[{"id":5265,"name":"Need For Speed Carbon","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/35f/35f815a22c4678b4fe76073f0f56df8e.jpg","description":"Need for Speed™ Carbon takes handheld racing to a whole new level with all-new crew-based gameplay and an exclusive east coast open-world city. Settle an ongoing turf war by building an unstoppable crew, winning races against your fiercest rivals, and outwitting the cops. How you choose and manage your crew will be the difference between victory and defeat. The city is yours for the taking with Need for Speed™ Carbon, the ultimate in handheld racing.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2009 Electronic Arts Inc. Trademarks belong to their respective owners. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Electronic Arts","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":326228,"name":"Yooka-Laylee and the Impossible Lair","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be8/be8f734c9b6f063a454a55aeb6a3509e.jpg","description":"Yooka & Laylee are back in a brand-new platform adventure from Playtonic Games! With their arch-nemesis Capital B up to no good, the buddy duo needs to spring into action once again to save the day. To thwart his evil plan of using a “Hivemind” device to enslave an entire kingdom of bees, our heroes need to take the fight to Capital B’s “Impossible” Lair. Things look tough, but with the help of Queen Phoebee and her Royal Beettalion , Yooka and Laylee might just have a chance!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"playtronic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":58551,"name":"Dauntless","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/82e/82e96c9d95f1be27c02a99962fdd16ec.jpg","description":"Dauntless is a free-to-play action role-playing video game developed by Phoenix Labs and published by Epic Games. The game initially launched in beta in May 2018 for Microsoft Windows. The game launched on May 21, 2019 for PlayStation 4, and Xbox One, including full support for cross-platform play.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"ISOLGAMES","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":11972,"name":"Move or Die","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/223/223cd610a1b8a36e4e7f067ede24bd41.jpg","description":"Free DLC Forever & ModsOur idea of an awesome game is a constantly updated one. So we plan to release regular content updates, consisting of new game modes, characters, levels and even new mechanics, completely FREE of charge! Here are some examples.\nOn top of that, the game is mod friendly and has a level editor as well as Steam Workshop support, so you can browse through awesome content made by fellow players like you! After all, the game's initials are MOD. Check out our modding wiki for more info.\nAcerca del juego20 seconds, constantly changing mechanics and a lot of yelling. These are the keywords that perfectly describe a round of Move or Die, the 4-player friendship ruining party game where rules change every single round. Slap your friends’ controllers out of their hands while playing on the same couch, challenge players online from around the world or pretend to practice offline with AI bots. Select what game modes you want to play from an ever-growing list of developer and community-generated modes, each with their own outrageous mechanics and level design crafted to promote hours of good old friendship-ruining fun.\nPlay online to gain XP and level up, unlocking awesome characters and game modes in the process, or try to work your way up the daily challenge leader boards where players go against AI bots in survival-like matches. As its name suggests, Move or Die forces players to take action. In fact, not moving literally makes your character explode. And, with just 20 seconds per round, Move or Die is a quick game to pick up, but a hard one to put down.\n4-Player Local/Online Multiplayer and Offline Practice Modes\nPlay as one of several outrageous characters on the couch with friends, online against people from around the world or battle devious bots offline.\nGame Modes Galore\nChoose from a huge and always increasing variety of hilarious game modes like Jump Shot, Chainsaw Backstab and Rocket Run, each with their own unique mechanics and level design.\nEasy-to-Learn, Fast-Paced Fun\nMove or die...literally. With not moving resulting in your character exploding and only 20 seconds per round, Move or Die is quick to pick up and incredibly fast-paced.\nLeveling-Up System\nAcquire crazy skins for your character and unlock new game modes as you squash your opponents online.\nDaily Challenges and Missions\nWork your way up the leader board and earn bonus XP by completing challenges and missions that change every 24 hours.\nRegular Content Updates\nNew content, including game modes, characters and new features will be added on a regular basis to keep Move or Die’s friendship-ruining-o-meter high.\nMOD Friendly and DRM Free\nBuild your own characters, game modes, mechanics, levels, soundtracks and more. Includes Steam Workshop support, as well as a super user-friendly level editor.\nDLC Free...Always\nEverything in the game can be unlocked for free, no paywalls. No bull$#%&. Period.\nStriking Graphics and a Killer Soundtrack\nGet your blood pumping with vibrant 2D graphics, as well as a heart-thumping soundtrack by Jacob Lincke. Check it out on Bandcamp!\nController and Keyboard Support\nPlay with one or 4 controllers, a keyboard, a DDR pad...or...the guitar and drums from Guitar Hero. Your choice. Although, we recommend a controller :D","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Reverb Publishing","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":368952,"name":"SnowRunner","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d22/d22ea1bfb636fbf1a9c235cc304312a8.jpg","description":"Snowrunner promises a \"huge roster\" of heavy duty machines and more than 15 sandbox maps to drive them on, some of them four times larger than the maps in Mudrunner. Once again, the job is, literally, a job, as the goal will be to haul various sorts of cargo across some of the crappiest landscapes on the planet. It's really the sort of thing that's meant to be played solo—you, alone against frigid oblivion, your only defense the chunky, shuddering gears of a krAZ-255—but you can go hauling with up to three friends if you like in online co-op play.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":61964,"name":"Iratus: Lord of the Dead","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/628/6288a95a4a290128705891d0d7e172b6.jpg","description":"Evil Returns, and Its Name is Iratus.\nAn inversion to the classic heroic tale, Iratus: Lord of the Dead lets players use fallen foes to create fearsome monsters for their personal army. With a heavy focus on strategic combat, Iratus is a complex and rewarding experience for those with dubious ethics and a love of dark fantasy. Brought to you by Unfrozen Studios, a newly formed studio of industry veterans who worked on the games such as the Disciples franchise.\nAs the eponymous necromancer, Iratus has players take the rein of a reviled mage returning from the void of death. After years of the tedium that comes being dead, Iratus returns to restart his quest of world domination. With bundles of bones, souls and squishy bits, Iratus brings back his army the only way he knows how...\n●\tDevelop and improve your belowground lair with necromantic powers.\n●\tCraft undead minions with the body parts of dead enemies.\n●\tAdvanced fighting system: Know your enemies’ strong points and weak spots to achieve victory.\n●\tTurn-based battle system with upward of 50 original minion’s talents.\n●\tIntelligent enemy AI, challenging even experienced RPG-strategists.\n●\tThree types of necromancer talents for gameplay: alchemy, magic talents, or tactical skills.\n●\tIrreversible consequences. Classic roguelike features including character permadeath.\n●\tDetailed stylized 2D graphics in the spirit of dark fantasy.\n●\tDetailed skeletal animations.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Unfrozen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4398,"name":"Bejeweled 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a0/0a0561997da0dc86fcdebf1249bf0043.jpg","description":"###Three in a row\nThe third part of the popular series of games in the genre three in a row, Bejeweled 3 was developed by the PopCap Games studio in 2010. The game was the fifth in the series, but the third one that received a number in the name. Originally released only on PC and Mac, but later it was ported to both consoles and mobile devices running Android, iOS, Java ME and Windows Phone. The developers called the game “the biggest Bejeweled experience available to date.” The game is available for free at partner sites.\n\n###What to do?\nThe goal of the game has not changed compared to the previous parts: the player must match three identical in color gem, which, if all is correct, they disappear. Rows of gems are constantly moving, and the game adds the random new gems on top screen. Thus, the player can launch a chain reaction and earn many points at once.\n\n###What’s new?\nIn the new part of Bejeweled, four new game modes appeared as well as new sound effects and improved graphics. However, this is true not for all versions of the game: so in the Java ME version, players have only four game modes available due to hardware limitations. There is Zen mode also in the game - a new one. There, players can customize the audio and visual components of the game and create their own meditative experience. There is no plot in the game, but you can earn 65 badges to prove the ultimate player’s skill.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17066,"name":"CONSORTIUM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c7/4c717d1808ea116b8c938189432a7c4c.jpg","description":"The Consortium is the first person shooter RPG, which takes place on the futuristic ship Zenlil. The period for the world of the game is the middle of the 21st century, the time in which all the armed forces were dissolved, and the law-enforcement function was assigned to the police under the name Consortium. The hierarchy on the ship is similar to chess. The player takes control over one of the crew members - Bishop 6, an elite soldier. This is the first part of the trilogy.\n\nThe structure of the plot of the game is often compared with Mass Effect Trilogy - because of the story branches, each playthrough differs from the previous one. A detailed background - the developers claim about 150 000 words in the script - only enhances the effect. Also note the unusual implementation of the dialogue tree: the developers sought to recreate lifelike conversations, each response changes the attitude of the NPCs to the main character. In total, more than 20 characters are available for communication, and the soundtrack of the game was written by the famous composer Jeremy Soule, who worked on such games as The Elder Scrolls V, Company of Heroes and Guild Wars.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Interdimensional Games","platforms":[{"id":0,"name":"PC"}]},{"id":30,"name":"WipEout Omega Collection","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05d/05d24f374d23180372d60801ae45a93b.jpg","description":"WipEout Omega Collection brings together all the content from WipEout HD, WipEout HD Fury and WipEout 2048, enhanced for PS4 and PS4 Pro.\nWe have been able to take advantage of the power and memory bandwidth of PS4 to rework all textures in the game. Compared to the original games, textures are now clear when viewed up close: you can even read some of the small text on the ships for the first time.  As well as a host of improved graphical effects we have also added in HDR which massively improves contrast to what was seen before.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Sony Interactive Entertainment Europe. Published by Sony Interactive Entertainment Europe. Developed by Clever Beans and EPOS. “Wipeout” is a registered trademark of Sony Interactive Entertainment Europe. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":18164,"name":"Tribes: Ascend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/140/140d84b5a5f55cd5dc68ba447c1e919a.jpg","description":"Network multiplayer shooter from the first person (with the ability to change the camera into a third-person mode) - claiming the title of the fastest. The game is the continuation of the Tribes series.\n\nThe series includes games such as: Starsiege: Tribes, Tribes 2, Tribes: Aerial Assault, Tribes: Vengeance and Tribes: Ascend.\n\n###The general plot of the series\nThe plot of the series begins in 2471, when a scientist Solomon Petresun invents the first cybrid, a bio-cybernetic hybrid artificial intelligence named Prometheus. After this invention begins mass production of cybrids, which are intended to be used as slaves. However, in 2602 Prometheus grows and directs all cybrids against humanity.\n\n###Chronology series\nThe earliest events of this story occur in the game Tribes: Vengeance which was released in 2004.\nThe events of the next period are covered in the game Starsiege: Tribes, although the game itself came out before Tribes: Vengeance, in 1998. Then the story opens in Tribes 2, released in 2001.\nThe Tribes Aerial Assault, 2002 does not follow the events of the plot of the remaining games, although it is located within the general setting.\nFinally, the last game of the series today is Tribes: Ascend, released in 2012.\n\n###Terrain\nThe area in which the events unfold is very extensive. It consists mainly of hills, slopes and mountains. Anything else, such as buildings, is rare.\n\n###Player Classes\nAt the beginning of a match, each player chooses a character class. Classes are only three. Class can be changed during the game.\n\nLight class - health and weapons of this class are weak, but this class has a high speed, it can become invisible and attack at a great distance from the sniper rifle. He is the best if you need to steal a flag or catch up with those who have already done it.\n\nThe middle class is average in everything - in health, armament and mobility. But this is not only the average level of everything, it is also a good balance between all the qualities.\n\nHeavy class has the largest health reserve and powerful heavy weapons. Equally good in attack and defense, but moves slower than all, sluggish.\n\n###Special equipment and abilities\nAll three classes have a jetpack, allowing you to fly through the air. But the height of the climb depends on the chosen character class. All characters can slide on the surface, the speed of sliding is high, but depends on the mass of the character, and hence, on his class.\n\n###Modes\nTeam fight.\nCapture and retention.\nCapture the Flag, CtF is the main game mode. In this mode, tactics of behavior is of particular importance.\nCapture the Flag \"blitz\" (CtF Blitz) - the main difference from conventional CtF is that after each successful capture the enemy flag moves closer to the rear of its base.\nArena 5X5.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hi-Rez Studios","platforms":[{"id":0,"name":"PC"}]},{"id":275681,"name":"Prey: Typhon Hunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/52d/52d99a14a80aaac7d91306c61b2c25c8.jpg","description":"In Prey: Mooncrash, TranStar’s secret moon base stopped transmitting shortly after the events of Prey. Now Peter, a hacker stationed aboard a spy satellite tasked with intercepting TranStar communications, must find out why. Trapped and under a ruthless contract with KASMA Corp, Peter’s only hope of ever seeing his family again is uncovering the moon base’s lost secrets.\nMooncrash includes Prey: Typhon Hunter, an online multiplayer update. Typhon Hunter is a lethal game of hide-and-seek between a single survivor (Morgan Yu) and five other players who stalk, hunt, and hide in plain sight as shape-shifting Mimic aliens. Every object is a potential enemy. Will Morgan or the Mimics prevail?\nTranStar VR is a single player VR-only campaign included in the Typhon Hunter  update. This campaign puts you in the shoes of various TranStar employees as you complete objectives and solve intricate puzzles on Talos I, just days before the events of Prey.\nRequires the Prey full game.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":19594,"name":"Sir, You Are Being Hunted","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/648/648691c034ae3b62794c7f16b2b179d7.jpg","description":"Known also under the alternative name “Madam, you are being hunted”, the game is a mixture of survival horror and the open world exploration. The game has a singleplayer mode, where players alone try to escape from the robots and do the same together with friends in the multiplayer mode. All actions are performed from the first person perspective.\n\nPlayers need to escape from Hunters, robots dressed like victorian-age gentlemen and their assistants: robodogs or worse. Robots must find and kill all players to get out of the island on which the action of the game unfolds. The landscape of the island is different during each playthrough - procedurally generated mechanics help to do so: the game engine chooses from five main themes - from the countryside to industrial areas.\n\nPlayers need to look for food and weapons to survive, besides, to spare parts for transport. The latter serves as the only way out of the island. Most of the game process is within the genre of stealth, so do not expect dazzling action from this game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Big Robot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":7102,"name":"Hidden Folks","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/595/5958daeb34d449b1a656d9f90570918f.jpg","description":"Search for hidden folks in hand-drawn, interactive, miniature landscapes. Unfurl tent flaps, cut through bushes, slam doors, and poke some crocodiles! Rooooaaaarrrr!!!!!\nA strip of targets shows you what to look for. Click on a target for a hint, and find enough to unlock the next area.\nIn case you like numbers a lot:\n- 17+ hand-drawn areas\n- 155+ targets to find\n- 1100+ mouth-originated sound effects\n- 250+ unique interactions\n- 3 color modes: normal, sepia, and night mode\n- 1 Steam Cloud\n- 5 Achievements\n- 8 Steam Trading Cards\n- 22 languages (translated by the community)\nMore areas and features to come!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Adriaan de Jongh","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":3294,"name":"LEGO Jurassic World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41c/41c324c3545879dc2862b2833c85e241.jpg","description":"Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World™  is the first videogame where players will be able to relive and experience all four Jurassic films.  Reimagined in LEGO form and told in TT Games’ signature classic LEGO humor, the thrilling adventure recreates unforgettable scenes and action sequences from the films, allowing fans to play through key moments and giving them the opportunity to fully explore the expansive grounds of Isla Nublar and Isla Sorna.\nGAME FEATURES:\n• Relive key moments from all four Jurassic films: An adventure 65 million years in the making - now in classic LEGO brick fun!\n• Wreak havoc as LEGO dinosaurs: Choose from 20 dinosaurs, including the friendly Triceratops, deadly Raptor, vicious Compy and even the mighty T. rex.\n• Customize your own dinosaur collection: Collect LEGO amber and experiment with DNA to create completely original dinosaurs, like the Dilophosaurus Rex.\n• Populate and explore Isla Nublar and Isla Sorna: Put your unique dinosaur creations in to paddocks as you complete special Free Play missions.\n• Play with family and friends with easy access drop-in, drop-out gameplay option.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"TT Fusion","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"}]},{"id":11553,"name":"Business Tour","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f64/f6470e82e699c6f4d6e151ecaf13e256.jpg","description":"\"Business Tour\" simple and entertaining gameplay allows you to come up with many interesting strategies, come to agreements with your rivals and even enter into conspiracies against other players. Apart from that, the game helps you to reveal your inner entrepreneurial qualities. For precisely this reason, children and adults alike can enjoy this game equally.\n\"Business Tour\" allows you to play a classic tabletop game online with your friends. The main advantage of \"Business Tour\" is that it's easy to learn to play, but that doesn't mean it's easy to win. You'll have to use all your bravery and business acumen to defeat real opponents. Difficulty and unpredictability make the classic table-top game more interesting, and the gameplay more diverse.\nKey features:\n* Online multiplayer mode, 2-4 players\n* Offline multiplayer mode\n* Play with Bots\n* Trading Cards and Achievements\n* Worldwide leaderboard\n* Your favorite game is now online\n* Daily Tasks\n* Inventory","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"8Floor","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":10836,"name":"Source Filmmaker","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecd/ecd0aa2f94b4165ad6c7a4cb63bbe877.jpg","description":"Source Filmmaker is a video creation program developed by Valve on Source game engine.\n\n###Usage\nValve uses Source Filmmaker to create trailers and short movies on their games. The most notable video series made to date is Meet the Team and several Team Fortress 2, Left 4 Dead and Left 4 Dead 2 videos. Usually, Source Filmmaker is used in cases when the creators need to dynamically change the character's facial expressions or much more cinematic movement animations. \n\nThe capture process is fairly easy - the creators have to record the movement of each character present in the scene, record their animations, add camera movement, sounds, and only after that, it is possible to properly record the facial animations, change the lighting, and add special effects. All these things can be done directly throught Source Filmmaker without resorting to any other software.\n\nSource Filmmaker supports a wide range of cinematic special effects and post-processing filters. The creators can use any assets of Valve games that are made on Source free of charge. It is also possible to use the resources of the community-made Source mods that are published on Steam, or add their own ones directly into the Source Filmmaker.\n\n###Support\nValve puts a heavy emphasis on the educational value of Source Filmmaker, as the company helps out the animators, by publishing the source files for their videos, and holds the annual Saxxy Awards, where the most notable SFM works are given awards from Valve.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"}]},{"id":11562,"name":"X-Morph: Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec5/ec53f6efc94777fe100032f8bbb12946.jpg","description":"Enhanced for the PC Uncapped frame rate, works even in 144FPS\nSupport for panoramic resolutions 21:9 included\nCustom Keyboard + Mouse Controls, created specifically for the PC. No artificial constraints.\nCustomizable controls\nNVIDIA Game Ready Certified\nAbout the Game\nUnique fusion of a top down shooter and tower defense strategy. You are the X-Morph - an alien species that invades Earth to harvest its resources and terraform the surface. Strategize in the build mode by carefully selecting various types of alien towers or throw yourself right into heat of the battle. Build mazes for incoming enemies in an environment that provides exceptional planning freedom. Tear down buildings and collapse bridges to support your defense or to simply indulge in a spectacle of unprecedented destruction. Possess a range of unique alien weapons and use defense strategies like you've never seen before in this genre.\nYour goal is to defend the X-Morph harvesters from waves of incoming human forces. Each enemy wave is preceded by a setup phase in which the player can check what types of enemies are going to be attacking him and to observe their paths. There is no time limit for this phase, so the player can carefully plan his defenses or choose to start fighting immediately and place towers when needed during the battle. One of the game's key features is the ability to build towers virtually anywhere on the map and to shape enemy paths by connecting towers with laser fences. The player can choose between building long mazes out of basic towers or placing more advanced towers which are more effective at different types of incoming enemies. Advanced tower types specialize in dealing with specific enemy types e.g. flame towers are great for destroying fast moving ground units, artillery towers are best at countering large groups of slow enemies, anti air laser is ideal for shooting down heavy bombers.\nAs the X-Morph fighter you can engage enemy units directly with a diverse arsenal of weapons. You can morph into four distinct forms which specialize in dealing with different kinds of threats. Each form has a basic attack and a special charged attack mode. The Plasma Fighter is the most universal form - good at destroying both air and ground units. The Dark Matter Bomber is great at decimating groups of ground units. It can also slow down time and release a dark matter bomb that can cut down buildings. The Shredder fighter is perfect for annihilating large numbers of human air units and clearing the sky. Finally the Laser Destroyer is best for smelting large single units. It can also charge up a gravitational anomaly that sucks in smaller enemy units.  A large variety of weapons and enemies along with a dynamic, fully destructible environment provides a rich arcade shooter experience.\nThe game's environments are constructed with a lot of attention to detail and they are almost completely destructible. From small picket fences to huge skyscrapers. Any bridge or building in the game can be collapsed and it's destruction is dynamically simulated using realistic physics. The destruction is not only a visual effect as it can significantly influence the layout of the battlefield. The combination of dynamic environments, laser fences and real time calculated enemy paths creates unique gameplay scenarios.\nHumans are desperate to defend their home world. They have created huge, building size, mechanical war machines to fight against each other, but now they will use them to destroy the X-Morph. Each boss fight is unique and heavily influences the gameplay environment. Entire cities will be destroyed.\nX-Morph: Defence includes a split screen co-op mode. All missions have different gameplay scenarios designed specifically for co-op play. Enemies attack in larger numbers and from new directions making good cooperation essential to winning. In this mode the game can be played in many different ways, one player can focus on optimizing tower placement while the other shoots at enemies or they can both focus their firepower on the strongest attackers.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Exor Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":809,"name":"Skate 3","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/122/1222277df1e3a000327b65d9ca45126a.jpg","description":"Skate 3 is a skateboarding simulator developed by EA Black Box. It is the third game in the series and is a direct sequel to Skate 2.\n\n###Plot\nThe game takes place sometime later after the events of Skate 2. The main protagonist, who is now known as The Legend, became one of the best skaters. He travels to a coastal town of Port Carventer to take part in a sponsored event but fails. To get to the top again, he has to put up his own team.\n\n###Gameplay\nPort Carventer differs a lot from San Vanselona. There are no zones where skating is restricted. The city itself consists of three zones: The City, The University, and the Industrial Area. Each zone has its own differences, for example, there are a lot of monuments and concrete buildings in The City, while The University boasts a high number of open spaces.\n\nLike in previous installments, the game's core mechanic called Flick It is still present in the game and is essential for getting high scores. It gives the player control of the skater and maps it to the right stick of the gamepad. Players are given points for doing tricks. The amount of points depends on the difficulty of the trick and their combos. \n\nThe game offers three difficulty settings: Easy (you can jump higher and do tricks faster), Normal (a classic difficulty, like in previous games of the series), and Hardcore (the physics resembles the same of the real world). \n\nThere is an in-depth tutorial called Skate.school that is accessible at any point in the game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":479695,"name":"Control Ultimate Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a74/a7462cb98ad1ed06f646afd0a5a1454d.jpg","description":"###Control Ultimate Edition\n\nA corruptive presence has invaded the Federal Bureau of Control…Only you have the power to stop it. The world is now your weapon in an epic fight to annihilate an ominous enemy through deep and unpredictable environments. Containment has failed, humanity is at stake. Will you regain control?\n\nWinner of over 80 awards, Control is a visually stunning third-person action-adventure that will keep you on the edge of your seat. Blending open-ended environments with the signature world-building and storytelling of renowned developer, Remedy Entertainment, Control presents an expansive and intensely gratifying gameplay experience.\n\n###Key features\n\n###Uncover the mysteries\nCan you handle the bureau’s dark secrets? Unfold an epic supernatural\nstruggle, filled with unexpected characters and bizarre events, as you\nsearch for your missing brother, and discover the truth that has brought\nyou here.\n\n###Everything is your weapon\nUnleash destruction through transforming weaponry and telekinetic\npowers. Discover new ways to annihilate your enemies as you harness\npowerful abilities to turn everything around you into a lethal weapon.\n\n###Explore a hidden world\nDelve deep into the ominous expanses of a secretive government\nagency. Explore the Bureau’s shifting environments only to discover\nthat there is always more than meets the eye…\n\n###Fight for control\nBattle a relentless enemy through exciting missions and challenging\nboss fights to earn powerful upgrades that maximize abilities and\ncustomize your weaponry.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":61882,"name":"Barro","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79c/79c22bd49c9df3380c545135b27ae75e.jpg","description":"Barro is a racing game with small cars and challenging tracks.\nGame modes:\nArcade: You vs 3 opponents, do your best and finish the race as the winner.\nTime trial: You against yourself, finish the laps as fastest as you can.\nMultiplayer:  Play the multiplayer (split screen) with a friend and have fun.\n10 Challenging tracks:\nEach track will challenge your skills, try not to fall of the track.\nNight race, fog and rain\nCars:\n4 types of cars, choose the one that fits you better.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SC Jogos","platforms":[{"id":0,"name":"PC"}]},{"id":11971,"name":"Space Rangers HD: A War Apart","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/668/668f9447327be622f82dc90ef9d24ac8.jpg","description":"###The reimagined classic\nA remastered version of the classic space strategy in real time from three studios: SNK Games, Katauri Interactive and original developers from Elemental Games. The first game of the series was released in 2002 but almost did not find fans outside of its region of release. The gameplay is often compared to games like Elite and Star Control 2. Space Rangers HD: A War Apart is an improved version of the second part of the Space Rangers, which includes all the additional content for the game, and a completely new one. The publisher of the game was the company 1C.\n\n###Key features\nThe player takes control of the pirate ship, which occupies the lowest step in the hierarchy of space bandits. The main task is to get to the top. To do this, you will have to carry out missions and learn new details about the mysterious leader of the organization. He is the enemy of the Coalition of sentient species. All actions of the player influence the virtual world and the decisions made change the ending of the game. In the updated version of the game, new graphics are available: players now have the ability to play in resolution up to 1920x1200. Developers also added new storylines and fifteen new tracks to the music library of the game. Like the original game, Space Rangers HD, it was positively received both by longtime fans of the series and by new players. Critics also spoke positively.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SNK","platforms":[{"id":0,"name":"PC"}]},{"id":3752,"name":"Vessel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4a/b4ab3798b6f64d3b2866959090b1843a.jpg","description":"Vessel is a game about an engineer who operates machines in a heavily industrialized steampunk world. The player assumes the role of Arkwright, a genius scientist who invented a new type of automaton called Fluro. The Fluros are amorphous creatures that can be made of any type of liquid and perform tasks for people. One day, the Fluros mutated and went out of control, ruining most of the world’s machines. Arkwright has to find the cause of the malfunction and restore control over the Fluros. \nThe gameplay consists of solving physics-based puzzles and manipulating the ridiculously complex machinery in a 2.5D environment. Arkwright jumps the platforms and pushes buttons to activate machines in a certain way. He can also use devices called Seeds to create new Fluros out of the liquids found on the levels, including lava. The Fluros, in turn, can be manipulated to perform helpful actions, such as to pull switches that are inaccessible for Arkwright. The liquid is the central element of the game, and a special graphics engine was made to animate it. The music by the famous DJ Jon Hopkins works as a hint for the player, becoming more complex when he or she does the right actions.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Playdek","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":10868,"name":"Stranded Deep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b60/b60318b011b69252e97c11bbd194006f.jpg","description":"Take the role of a plane crash survivor stranded somewhere in the Pacific Ocean. Experience terrifying encounters both above and below an endless environment. Come face to face with some of the most life threatening scenarios that will result in a different experience each time you play.\nScavenge. Discover. Survive.\n---\nGenerate an Infinite Number of Procedural Worlds - Explore Pacific islands, reefs, and bottomless ocean trenches filled with detailed biomes!\nNo two worlds are the same - You can generate a completely new and randomized world at any time. You can also mix your own maps created with the map editor in with the procedurally created maps in the world for a more customized experience. If you feel like sharing, you can even share your world seed with other players.\n* Please note, currently the generated world size is limited to 6.25km2 but the final world size will be much larger.\nDynamic Weather and Day-Night Cycle - Struggle to navigate stormy seas or enjoy basking with a coconut on a sunny afternoon.\nUnique Physically-based Crafting System - Harvest resources to create equipment by combining them together in the physical world - no crafting slots!\nUnique Physically-based Building System - Settle on an island and construct a shelter or venture the seas with your own built raft.\nDetailed Survival Aspects and Interaction - Manage your vitals of hunger, thirst, blood, and health against the harshness of mother nature.\nRandom Loot and Collectables - Search sunken shipwrecks and islands for interesting and rare equipment.\nHunting and fishing - Spear small animals in the shallows or risk the depths with a spear gun in search of larger meals. Starve an island of resources or maintain and manage its growth.\nThe things we want and things we know you want! Dealing with bugs -A lot of effort has been put into making sure your Stranded Deep experience is as bug free as possible, however the game is in an Early Access stage of development, so there will be bugs. We will be doing our best to squish them.\nPerformance - Optimizing performance is an important ongoing process that will continue through the Early Access period.\nIsland and Terrain Variety - Creating more unique biomes and biome parameters for different procedural generations.\nMore Wildlife - Incorporating more fish and shark species and more interesting island wildlife like birds, snakes and lizards.\nAn End-game Scenario - Making it possible to complete a series of optional tasks and progress through the world in an attempt to be rescued.\nCo-operative Gameplay - Where you can band together as a team of misfits and ration your supplies or eliminate each other one by one.\nImproved User Interface - All of the in-game UI is temporary and will be replaced with a more fitting theme.\nOcculus Rift Support\nController Support\nMuch more! - See our website for more details, http://www.beamteamgames.com","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4747,"name":"Split/Second","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a0/0a0b66527a2e5917134fcf502cf83af1.jpg","description":"Split/Second is a racing game with an accent on the destructible environment and the game within a game mechanics.\n\n###Gameplay\nThe title features usual for the genre lap and sprint races, but the unique feature lies in the destructible environment. Unlike previous installments, utilizing such mechanics, in Split/Second the player must fill the \"power play\" bar and unleash its power on the nearby construction — for example, crush the water boiler when there are opponents underneath it. \nThe strength of the effect depends on how full the power bar is — there are two levels of damage available. The first-level collisions are mostly minor and lie in the field of damaging some constructions and crushing the billboards, while the second-level ones activate during the full bar completion are lead to the structural damage of the map facilities frequently leading to route changes and landscape altering.\n\n###Plot\nPower Play mechanics is powered by the narrative underlining it as it tells the story of a TV Show, the participators of which are all the racers including our protagonist. The meter, in this case, represents the reviews watchers give to the show members. The computer-controlled opponents can also turn on the ability and crush something on the player's vehicle — so the audience votes not only for the protagonist.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":58762,"name":"Gears Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c36/c366f32194f488b2d04c0ec086c2cc3d.jpg","description":"Gears Tactics is the fast-paced, turn-based strategy game set 12 years before the first Gears of War. Cities on the planet Sera are beginning to fall to the monstrous threat rising from underground – the Locust Horde. With the government in disarray, a squad of survivors emerge as humanity's last hope. Play as Gabe Diaz, recruiting, developing and commanding your squads on a desperate mission to hunt down the relentless and powerful leader of the Locust army: Ukkon, the mastermind monster who makes monsters. Against all odds and fighting for survival, outsmart your enemy in uniquely brutal, turn-based tactical combat. Experience the intensity of one of the most-acclaimed video game sagas in an exciting new way.\n\nImmersive and character-driven story: Play as the defiant soldier Gabe Diaz, rescuing and building your troops in a journey of leadership, survival and sacrifice.\n\nCustomizable squad and equipment: Prepare your troops to face tough enemies, upgrading their skills and outfitting them with loot collected in challenging missions.\n\nAggressive gameplay: Command your squad in fast paced, turn-based battles, advancing and surviving intense and visceral encounters with the unstoppable, swarming enemy.\n\nMassive boss battles: Defeat towering deadly bosses that defy your strategies and completely change the scale of the battle.\n\nXbox Profile Required. Sign in with your existing profile or create one for free.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Splash Damage","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":706,"name":"Mother Russia Bleeds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/450/450ccffea136d06ef8d18802d583f8e5.jpg","description":"Mother Russia Bleeds is an independent beat 'em up title developed by Le Cartel Studio.\n\n###Plot\nThe game is set in an alternate version of USSR in the eighties. The government cannot do anything with widespread crime, so it simply ignores that. Four street fighters from a gypsy community unwillingly become the test subjects for a new drug called Necro. After escaping from the laboratory, the main character returns back to their community only to find it in ruins and the whole population becoming drug addicts. The protagonist becomes eager to get revenge on those, who did that. Further into the game, the main character starts taking Necro themselves, which causes horrible hallucinations.\n\n###Gameplay\nMother Russia Bleeds is a beat 'em up game which is largely inspired by titles such as Streets of Rage and Double Dragon.\n\nThe players advance through a level, that is divided into multiple sections. In progress further, the players have to kill every enemy they encounter in a section. At the end of each level, a boss fight is held.\n\nApart from hand-to-hand combat, the players can use the world's items, such as pipes, knives, bottles, and pistols. One of the defining features of the game is the health regeneration system, as the players can pump Necro out of their enemies corpses and eject them to themselves. A choice is given - regenerate health or become a berserk that has much more strength and speed.\n\nThe game can either be completed solo or in a four-player co-op.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":16013,"name":"Planetary Annihilation: TITANS","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/656/656d684bd6728e09cb121ad7563b146b.jpg","description":"Planetary Annihilation: Titans is a standalone expansion pack to Planetary Annihilation, a real-time strategy game developed by Uber Entertainment.\n\nIt is possible to either buy Titans included with Planetary Annihilation or purchase the upgrade pack if the players already have the base game.\n\n###Gameplay\nThe players are allowed to play short games on one planet (this results in 12+ hours of gameplay per a match) or engage in a Galactic War with up to 40 players. From time to time, a developer hosted mega-game is held on live multiplayer servers. Although the players can battle on different planets in one galaxy, there is no space combat present in the game. Instead, the game focuses on land and naval combat. \n\nIt is possible to use the planet's moons as army carriers, and gravity plays an important role in the gameplay as it can be used to damage the enemy army. Players take control of a Commander. Commanders are strong units and essential units in the game. They can only build base buildings without any specialization. If the Commander gets killed, the player loses the match. The faction's Commanders do not differ in their abilities or gameplay, yet they feature a distinct visual style.\n\nThere is no singleplayer campaign present in the game, yet it is possible to play offline with the help of AI bots.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Uber Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3598,"name":"Velocity 2X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d81/d81c9725b1da073e7ba036bdca8528f7.jpg","description":"Velocity 2X is a 2D sci-fi shoot'em up developed by FutureLab. It is the third game in the series, preceded by Velocity Ultra and Velocity. The primary focus of all three games is competing with the other players, teleporting and fighting numerous enemies — the game features some characteristics of bullet hell genre.\nThe story centers around Apex Predator — the protagonist of the game. While being set in a sci-fi setting the game tells a story of her modified body, which allows her and her ship to travel at supersonic speeds and uncover the mysteries of a world she ended up blending in.\nThe gameplay utilizes typical characteristics for the genre: much shooting, teleporting and reaching the higher overall score over the levels. The title also features dual-format: not only it allows to mirror the screen and make the levels more challenging but also it creates a room for bosses to be more robust.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"FuturLab","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":21942,"name":"Skyforge","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d8/8d88e99f82c7133027e682fd87cd9e12.jpg","description":"Skyforge is an open-world massively multiplayer online role-playing game. It is the second MMO RPG developed by Allods Team. The game is free-to-play but features microtransactions system that helps player advance at a faster pace. \n\n### Story and setting  \nThe game takes place on planet Aelion that used to be under the protection of great god Aeli. However, once Aeli vanished hostile gods, and evil creatures invaded the planet. The player takes the role of one of the Immortals, lesser gods that serve to protect Aelion and must defeat all kinds of threats that endanger the planet. \n\n### Gameplay  \nAfter creating a character and choosing one of 13 classes, the player starts their adventure in the capital of Aelion where after finishing tutorial, they get their first Combat Missions. Structurally, the game is very reminiscent of other MMO RPGs. The game focuses on upgrading your character, completing numerous missions, exploring the world and interacting with other players. However, several major differences in gameplay and player progression make Skyforge very distinct from other games in the genre. \nThe combat system is a mix between action and traditional MMO RPG skill-based system. Each class has its unique set of moves and abilities, some of which can be chained in different combos, in the hack-and-slash game fashion. The player can also change their character’s class at any time just by selecting it from the menu.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Allods Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":274571,"name":"Crash Team Racing Nitro-Fueled","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b2c/b2c0cc14e80cfd38be0f2b2ccd4d6db5.jpg","description":"Crash is back in the driver’s seat! Get ready to go fur-throttle with Crash™ Team Racing Nitro-Fueled. It’s the authentic CTR experience plus a whole lot more, now fully-remastered and revved up to the max:\r\n\r\nStart your engines with the original game modes, characters, tracks, power-ups, weapons and controls\r\n\r\nPower slide to glory in additional karts and tracks from beyond the original game\r\n\r\nRace online with friends and Crash the competition with online leaderboards","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Activision","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":15308,"name":"FORCED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f7/4f7a84826aa94072bb1f0651b3e2c9f2.jpg","description":"Forced is an indie role-playing game developed by BetaDwarf.\n\n###Story\nThe players are slaves who are made to fight in a gladiator-like arena. These slaves are born in a nearby village to become fighters and are trained from a very young age. With the help of your mentor, Balfus, you will embark on a path of becoming the best gladiator and getting to the final guardian known as The Master.\n\n###Gameplay\nForced is an action game played from a top-down perspective. It is heavily inspired by the MOBA genre, yet it only focuses on singleplayer and its cooperative mode. The players select a weapon, which serves as a character class and has 16 abilities. \n\nFour weapon classes are present in the game: Bow, Hammer, Knives, Frost Shield. The serve as a long-range damage dealer, deadly area damage dealer, fast melee attacker, and a supportive class. Just like in MOBA games, Forced features both active and passive abilities that are weapon class-specific. If a cooperative mode is played, the players have to choose different classes, as the game will not allow your party to play otherwise. The game also adjusts the difficulty accordingly if played in cooperative mode. \n\nAfter completing each mission of the game, the players are awarded gems. These gems can be used to upgrade your weapons and unlock their new abilities. The players can get three gems max per mission.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BetaDwarf","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2123,"name":"Among the Sleep","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41b/41b9f5119f03663dcc3ead3501beab14.jpg","description":"Among the Sleep is a first person horror adventure, in which you play a two year old child. After waking up in the middle of the night to mysterious sounds, you start exploring the dark looking for comfort.\nThe game explores horror through atmosphere and exploration, not with scores and combat systems. In Among the Sleep you’re vulnerable, scared, and trying to make sense of the world.\nController support: Works 100% with Xbox 360 controllers, might have some issues with Xbox One controllers. We are sorry about the inconvience.\nThe game will not get VR support.What people are saying\n\"More, please!\"\n- Kotaku\n\"[...] it more than succeeds in creating a wonderfully eerie atmosphere full of childlike anxiety, and along the way tackles a serious subject in a darkly poignant manner.\"\n- IGN\n\"Its depiction of a first-person horror told through the eyes and stumbling little legs of a two-year old is as intriguing as anything I've seen all year, and reminiscent of a time when games actively sought out new ways to play and new stories to tell.\"\n- Eurogamer","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Krillbite Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":5260,"name":"LEGO Indiana Jones: The Original Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eec/eeccbd9e91dd1696ddb1dffef99aec72.jpg","description":"Build, Battle and Brawl your way out of trouble!\nPlay through all three classic Indiana Jones™ movies and relive your favorite Indy adventures in the tongue-in-cheek worlds of LEGO®.\nExplore and Discover - Battle enemies, solve puzzles, and seek out the world's greatest treasures.\nMore Than 60 Playable Characters - Take control of Indy, his friends, and even his enemies. Team up with a friend and together search for fortune and glory.\nWhip Into Action! - Attack and disarm enemies, swing over perilous pits, and interact with LEGO® objects and puzzles!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PSP"}]},{"id":437049,"name":"FIFA 21","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df4/df415b18835f91a1b4db1da294996ee5.jpg","description":"Win as One in EA SPORTS™ FIFA 21, powered by Frostbite™. FIFA 21 has more ways to play than ever before - including the UEFA Champions League and CONMEBOL Libertadores. Stay tuned for exciting news to come.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":50671,"name":"Cultist Simulator","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec5/ec58c8b204da0d48448e7c2d148d0110.jpg","description":"Seize forbidden treasures. Summon alien gods. Feed on your disciples.\nCultist Simulator is a game of apocalypse and yearning from Alexis Kennedy, creator of Fallen London and Sunless Sea. Play as a seeker after unholy mysteries, in a 1920s-themed setting of hidden gods and secret histories. Perhaps you're looking for knowledge, or power, or beauty, or revenge. Perhaps you just want the colours beneath the skin of the world.\nIn this roguelike narrative card game, what you find may transform you forever. Every choice you make, from moment to moment, doesn't just advance the narrative - it also shapes it.\nBecome a scholar of the unseen arts. Search your dreams for sanity-twisting rituals. Craft tools and summon spirits. Indoctrinate innocents. Seize your place as the herald of a new age.\nKey features:\nCombine cards to tell your own story in a rich, Lovecraftian world of ambition, appetite and abomination. Corrupt your friends. Consume your enemies. There is never only one history.\nFound a cult, dedicated to the Red Grail, or the Witch-and-Sister, or the Forge of Days. Recruit Believers and promote them to Disciples to serve as burglars, researchers, cat's-paws. Use your disciples to keep you fed - or feed on your disciples.\nUnravel arcane, unacknowledged mysteries. Translate grimoires and glean their lore. Locate and pillage the Star Shattered Fane. Penetrate the realm of the Hours, and win a place in their service. Perhaps - if you are very cunning - you may even glimpse the Mansus.\nOutwit rivals, investigators and the increasingly suspicious Authorities. Your own altered Appetites may force you to act abominably, but your Cause must not be stopped.\nTranscend death with a story-driven legacy system. Perhaps your inheritors will complete the Rite of the Crucible Soul. Perhaps they'll find peace in a pleasing career. Perhaps they'll bring the Dawn.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Playdigious","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":50732,"name":"World War Z (2019)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b17/b17679dbca4ccfbc96d2335aa366ccf9.jpg","description":"You’ll face off against hundreds of zombies of different types on screen at a time, rushing as a pack to overwhelm your defenses. Dynamic swarm simulation, adaptive spawn control, diverse zombie mechanics, and an advanced gore system all combine for the ultimate zombie shooter experience. Play with friends or on your own with AI teammates to stay alive against these relentless swarms in all their bloody glory.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":39128,"name":"inFamous","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6e3/6e3e83ce5ccb49be4c74f987c1f8ed3d.jpg","description":"This game lets you become a superhero in an open-world soapbox and features comic-book stylized cutscenes to underscore the superhero theme. The game is set in a fictional megapolis called the Empire City.  The player assumes the role of Cole MacGrath, a regular delivery man who miraculously survived a deadly explosion that destroyed much of the city. This trauma somehow gave Cole a superhuman power to control electricity. His powers can be used to move, attack and defend, and over the course of the game, he will discover a lot of new abilities. The powers are not infinite, and Cole needs to be charged with more electricity. It depends on you if MacGrath will use them for the greater good or becomes a villain. Every choice he makes in the game will affect his Karma, making him more Good or Evil. The central plot, however, does not depend on your Karma meter and only varies based on certain player actions. Because of his high electric charge, the protagonist cannot drive vehicles. MacGrath moves around the town on feet, often climbing up the roofs and using his parkour skills.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":20959,"name":"Realms of the Haunting","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/464/46461a239c32cd68d3dc07add1c8c7a9.jpg","description":"Realms of the Haunting is a game about a haunted house with a creepy supernatural atmosphere. The plot is told through a series of full motion videos which were relatively new at the time.\n\n###Plot\nThe protagonist is Adam Randall, a young Englishman. His father died recently, and since then Adam is haunted by the nightmares about a cursed house. A mysterious priest gave him a box of magic stones and his father's letters. They reveal that the house from Adam's dreams was real. To investigate the mystery that led to his father's demise, Randall finds and visits the house. As soon as he enters it, someone locks the door behind his back. \n\nAdam has to walk through the house, reveal its dark secrets and deal with terrible creatures from other dimensions. Early at the game Rebecca Trevisard, a psychic, joins Randall as a companion. They learn that his father's soul is imprisoned within this walls, and there's much more at stake.\n\n###Gameplay\nRealms of the Haunting uses a first-person view. The gameplay alternates between sequences of arcade action and puzzle-solving. In action parts, Randall has to gun down the undead monsters. When solving puzzles, the player has to find and use the item that fits the task. The player can adjust the difficulty level, and at the easy difficulty, the items are chosen automatically. There are also many letters and other documents that reveal details of the plot and provide clues for puzzles.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Gremlin Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":51167,"name":"Q.U.B.E. 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3d/d3da9611b378bb72484d0b7dd4c85640.jpg","description":"Q.U.B.E. 2 is the sequel to the hit first-person puzzle game Q.U.B.E.  You are Amelia Cross, a stranded archaeologist who has mysteriously awoken among the sand swept ruins of an ancient alien landscape. Together with the distant help of another survivor, Commander Emma Sutcliffe, you must traverse and manipulate the structure of this forgotten world to find a way back home.\nWaking up wearing a strange suit with attached gloves, you have no prior knowledge on how you came to be in this environment. Awaiting you is a maze-like monolith, a structure that you must navigate, solving mind-bending puzzles. Use your manipulation gloves to change and adapt the architectural structure in your search to rendezvous with another survivor, finding a way off the planet.\nAs you explore and solve puzzles to progress, thought-provoking questions about your true purpose and the origins of the structure you are navigating will need to be considered, forcing you to come to terms with a devastating truth that will shake your world.\nFeatures\nMaster Eleven Puzzle Areas and Solve over 80 Puzzles\nExplore Diverse Environments that Expand the Q.U.B.E. World\nExperience an All New Adventure and Brand New Characters\nInteract with New and Improved Game Mechanics\nOriginal Musical Score Composed by BAFTA nominated composer, David Housden","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Toxic Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":10789,"name":"Tree of Savior (English Ver.)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d9/5d9d6da555c357edde9cfa2db622083f.jpg","description":"In this game you need to find a goddess in the world of chaos. The game world is based on traditional Lithuanian culture and mythology. The names of cities in the game world are consonant with the names of the real cities of this region and neighboring countries. For example, Klaipedia is located in the South of the Kingdom within the Klaipedia region. The city is one of the main cities in the game's world. It is connected to West Siauliai Woods, the starting point for all the new Revelators. The name of this city is made from the name of the real city in Lithuania - Klaipeda.\n\n###Wealth of choice\nThe choice in the game is very diverse, there is no fixed route.\n\nYou can search for the goddess in your own style - the game provides many opportunities for this in Massive Freedom of Choice mode. You have a huge selection of costumes and expressions. In any mode, different jobs, skills, and stats are available.\n\n###Training skills\nIf there is a lack of skills for success in the game - you can gain skill in the Team Battle League mode.\n\nThere are many character classes and 8 ranks. Each combination of class and rank is interesting in its own way. There are also classes that are simply not accessible, you have to satisfy special requirements so that these classes become available.\n\nThe game has a lot of hidden quests.\n\n###Severe test\nIf you are completely confident in your abilities, welcome to the Guild Wars mode - there are no safe places, there are no places where enemies can not reach, either in the open field or in the dungeons. By the way, in the whole game there are more than 200 unique boss monsters.\n\n###Multiplayer\nIf you want to play in the company - the community can be accessed anytime no matter where you may be. There is also Automatic Party Finding - make parties with nearby players.\n\n###Statistics\nAny data about your status is visible throughout the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"IMCGAMES Co.,Ltd.","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]}]