[{"id":13239,"name":"Darkness Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3cb/3cb1bb1566c4839b47f991d0d2078bc8.jpg","description":"The number of missing in the city increased. People talk about the experiments on human beings. And now, only you can figure out if it was true. Especially because you have no choice. Mysteriously, you find yourself in a terrible location 40 meters underground. Your name is Katrine, and you do not remember anything about your past. But in the search for truth, try not to lose yourself.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Black Lime Studio","platforms":[{"id":0,"name":"PC"}]},{"id":13125,"name":"Evil Maze | 恶魔迷宫 | 惡魔迷宮","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b04/b047e44a0e0b1810532a4bf427422ea5.jpg","description":"Random Iiem and Skills + Hidden elements RPG + Strategy  ARPG\nThe game starts in a dark underground maze where\na female officer is confined in the deepest depths of the prison.\nShe wants to get out of this nightmare maze!\nWould you like to help her?\nNavigate through a haunted prison maze battling evil monsters and finding hidden chests.\nImprove your attack and defense skills to defeat powerful enemies and bosses!\nCollect keys to open new doorways that may lead you closer to your escape...\nIN THIS GAME:\nVarious types of puzzles and challenges await!\nsecret levels and boss are awaiting for your ...\nUNCENSORED patch has launched on community\nhttp://steamcommunity.com/app/484950/discussions/0/358416640406165037/\n4 language dialogues supported: English, Simplified Chinese, Traditional Chinese, Japanese.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ZOV GAME STUDIO","platforms":[{"id":0,"name":"PC"}]},{"id":13033,"name":"Echo of Soul","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/650/6507e5e6ce89fb37d168b61920cbe42e.jpg","description":"[Prologue of EOS]\nThe story begins with a war between The Gods and The Giants.\nThe Gods had won the war, but the corrupted blood of the Giant King contaminated the source of all creation. The Gods attempted to purify the world from the malicious spirit, but they were unable to. You must become the Soulkeeper of the Gods and protect the world from harm.\n[Game Style]\nA classic MMORPG. Numerous dungeons and raids. Yet, Smooth combat system and Hardcore PVP.\n[Contents]\nTransitioning from Pay-to-win to Play-to-win\n1) Game character/class\n- There are seven classes in the game: Warrior, Guardian, Archer, Rogue, Sorceress, Warlock and Paladin. The combat system in EOS does not follow the standard \"trinity\" in MMOs consisting of tanks, healers, and DPS classes. Players can choose to tank or DPS; there are no dedicated healers. Healing is a group responsibility and strategic party play is critical to success.\n2) Game Play\n- The game has a wide array of both PvE and PvP modes. PvE includes solo dungeons, party dungeons, raids and RvR","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mr. Blue","platforms":[{"id":0,"name":"PC"}]},{"id":2564,"name":"Amplitude","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34f/34fdc97e9814d24345fe00268cb5ebbc.jpg","description":"Amplitude features a single player campaign presented as a 15-song sci-fi concept album with a narrative that surfaces through the game’s visuals, music, and lyrics. Take a trip through the expansive human mind as you seek to awaken your comatose patient and expand her perceptions.\nAmplitude also sports multiplayer for up to four players, supporting free-for-all competition, team vs. team play, or cooperative score-chasing. The requisite leaderboards are also present for bragging rights as well as self-validation or humiliation, depending on your skill level.\n\nWith a soundtrack of over 30 songs, Amplitude includes music from exciting artists such as Darren Korb (Transistor), C418 (Minecraft), Danny Baranowsky (Crypt of the Necrodancer), Insomniac Games, and Freezepop, Kickstarter backers, and music lovingly crafted by Harmonix’s talented in-house composers.\nAdditional hardware required for Remote Play.\n1-4 players\n3GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2015 Sony Computer Entertainment America LLC. Amplitude is a trademark of Sony Computer Entertainment America LLC. Amplitude developed by Harmonix Music Systems, Inc. Harmonix and all related titles and logos are trademarks of Harmonix Music Systems, Inc.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":969496,"name":"eFootball 2024","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1cb/1cbd9105ccd254570fb255fccf0fe9b0.jpg","description":"■ \"eFootball™\" - An Evolution from \"PES\"\nIt's an all-new era of digital football: \"PES\" has now evolved into \"eFootball™\"! And now you can experience the next generation of football gaming with \"eFootball™\"!\n[Ways of Playing]\n■ Build Your Very Own Dream Team\nApart from FC Barcelona, Manchester United FC, FC Bayern München, AC Milan, Internazionale Milano and other European footballing powerhouses, you can also brand your team with the latest Strips and Emblems of National Teams as well as Club Teams from South America, J.League and around the world!\n■ Sign Players\nAfter creating your team, it's time to get some signings in! From current superstars to footballing legends; sign players and take your team to new heights!\n・ Special Player List\nHere you can sign special players such as standouts from actual fixtures, players from featured leagues and legends of the game!\n・ Standard Player List\nHere you can handpick and sign your favourite players. You can also use the Sort and Filter functions to narrow your search.\n・ Manager List\nHere you can sign managers who are adept at all sorts of tactical approaches with different Coaching Affinities.\n■ Playing Matches\nOnce you have built a team with your favourite players, it’s time to take them to the pitch.\nFrom testing your skills against the AI, to competing for ranking in Online Matches; enjoy eFootball™ the way you like!\n・ Sharpen your skills in VS AI Matches\nThere are a variety of Events which coincide with the real-world football calendar, including a \"Starter\" Event for those just starting out, as well as Events where you can play against teams from high-profile leagues. Build a Dream Team that fits the Events’ themes and take part!\n・ Put your strength to the test in User Matches\nEnjoy real-time competition with the Division-based \"eFootball™ League\" and a wide variety of weekly Events. Can you take your Dream Team to the pinnacle of Division 1?\n・ Max 3 vs 3 matches with friends\nUse the Friend Match feature to play against your friends. Show them the true colours of your well-developed team!\nCooperative matches up to 3 vs 3 are also available. Get together with your friends and enjoy some heated footballing actions!\n■ Player Development\nDepending on Player Types, signed players can be further developed.\nLevel up your players by having them play in matches and by using \"Level Training Programs\", which can be obtained as Event rewards. Once your players have levelled up, you can use the available \"Progression Points\" to further develop their abilities. Allocate Progression Points to specific categories, such as \"Shooting\", \"Dribbling\" or \"Defending\", and the relevant Player Stats will increase.\nIf you are unsure about which category you should develop your players in, you can also use the [Auto-allocate] function to have Progression Points allocated automatically for you.\nDevelop your players to your exact liking!\n[For More Fun]\n■ Weekly Live Updates\nData from real matches being played around the world is collated on a weekly basis and implemented in-game through the Live Update feature to create a more authentic experience. These updates affect various aspects of the game, including player Condition Ratings and team rosters.\n■ Immerse in the \"Seasons\"\neFootball™ runs over the course of different \"Seasons\".\nEach Season will have a theme that reflects the latest trends in the world of football, and you can get a better advantage in Events by signing players and building a team that matches the Season’s theme.\nCreate a unique team for each Season and enjoy playing matches!\n*For customers whose Country/Region is set to Japan in the game, eFootball™ Coins are only valid for 180 days starting from the date of purchase.\n*Users that reside in Belgium will not have access to loot boxes that require eFootball™ Coins as payment.\n*eFootball™ Coins can be purchased in-game and can be used in various ways, such as signing players or unlocking Match Passes.\n*The description above may be changed in future updates.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":674334,"name":"Into the Pit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a70/a70712d9ffd26d5be4690745bf7d34d7.jpg","description":"As members of a family of lore-hunting mystics, you and your cousin Luridia separately wander the land following rumors of occult power. After discovering a demonic pit in a nearby village, Luridia’s once prolific letters grow silent.\nSomething has gone terribly wrong.\nNow it is up to you to journey to the desolate hamlet under dark eldritch skies. What did Luridia discover? And what great power has this village unearthed?\nKey Features:\nFIGHT WITH CHAOTIC MAGIC - experiment with various spells and powers to become an unstoppable magical force\nSHIFTING TREACHEROUS DUNGEONS - high-octane energy and short-paced levels will keep you on your toes. You’ll never know what horror lies beyond the next corner.\nGROW YOUR POWERS - rescue villagers to open shops for permanent upgrades to prolong your runs and maximize your potential\nCHOOSE YOUR CHALLENGE - mix keys and runes gathered on your journeys to generate and combine different dungeon encounters.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nullpointer Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":442869,"name":"Island Saver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/deb/deb2f9c182a7ca4005d46a2433fb37c9.jpg","description":"Welcome to Savvy!\nA group of amazing islands need your help! Horrid plastic waste has washed up and you need to sort it out with your trusty Trash Blaster! But look out for the Litterbugs. They love mess and they’re out to muck things up.\nYou need to wash away gloop, collect litter, earn coins and rescue the bankimals! These special animals are living piggy banks and with them you can help save the Savvy Islands and make things good again.\nFEATURES\n•\tTropical jungles - the icy arctic - dusty deserts – volcanoes - explore them all as you clean up the islands.\n•\t42 bankimals to save – can you rescue them all?\n•\tFind bankimals you can ride and use their powers to access new areas\n•\tHelp Kiwi find his missing nest eggs!\n•\tCollect coins and discover spending, saving, and more!\n1 player\n2GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2020 National Westminster Bank plc. Island Saver™ and Bankimals™ are trademarks of National Westminster Bank plc.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Stormcloud Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":311735,"name":"Transport Fever 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e5b/e5b0376a91aec5e304d1ce832b3f8488.jpg","description":"The classic transport simulation genre has a new gold standard with Transport Fever 2. Discover a whole new world by navigating transport routes through land, water and air. May progress and prosperity find their way!\n\nProvide the world with the transport infrastructure it needs and make a fortune with custom-made transport services. Watch your trains run on rails, your buses and trucks thunder along roads, your ships power through the water, and your planes soar through the skies. Carry people on their way to work or play, and be the reason cities grow and thrive. Deliver raw materials and goods to drive the economy. Experience the greatest logistical challenges from 1850 to the present day, and build a transport empire unrivaled anywhere else on the globe!\n\nFree play offers a huge range of creative possibilities, while campaign mode re-writes transport history across three continents. Transport Fever 2 offers a choice of over 200 vehicles from Europe, America and Asia, modelled in extreme detail; and with the in-game map editor, you can re-create landscapes from three different climate zones. Finally, the realistic transport and economy simulator, along with comprehensive modding support, round off the gameplay experience.\n\n**Open Up the World**\n\nA huge game world is waiting for your railroads, road vehicles, aircraft and ships. Intuitive interactive rail construction tools and a modular construction system for stations make it easy to build and expand your transport empire; and thanks to a wide range of configuration options, every free play game provides a new challenge, where completely different strategies can lead to success.\n\n**Write Transport History**\n\nThree historic campaigns set in different time periods and located on three separate continents will challenge you with different objectives …only transport magnates will manage to complete all the missions! Voiceovers and cutscenes enrich the story and contribute to a thrilling gameplay experience, and even the free play mode will challenge you with different achievements to unlock.\n\n**Optimize the Infrastructure**\n\nIt is vital to adapt your company to the needs of the economy and cities: bridges, tunnels, switches, rail signals, one-way streets, light signals, and bus lanes are just some of the possibilities you can use to optimize the transport infrastructure. Even train stations and airports can be expanded with modules in order to meet different requirements; and various data layers help you visualize traffic volumes and emissions, and provide information for further improvements.\n\n**Free your Creativity**\n\nThanks to the detailed game world, you can develop your very own virtual railroad landscape: the map editor provides the possibility to create countless different worlds; the terrain in the game can be adjusted and painted; and thanks to the extensive modding support, new creations are being developed constantly, which are available for free via the Steam Workshop and which can be easily integrated into the game.\n\n**Game Features**\n\n* Free play with countless configuration possibilities\n* Three campaigns across three continents with over 20 hours of playing time\n* Editors for creating maps and editing saved games\n* Three landscape types: moderate, dry, and tropical\n* Realistically modelled vehicles from Europe, America and Asia\n* A total of over 200 vehicles: trains, buses, streetcars, trucks, aircraft and ships\n* Modular train stations, bus and truck stations, airports and harbors\n* Realistic transport simulation including one-way streets and light signals\n* Editable and paintable terrain with realistic effects\n* Intuitive construction tools for building railroads and more\n* Display important data such as traffic and emissions, on separate layers\n* Dynamic economy and city simulation\n* More than ten economic chains with associated factories and goods\n* Cities with countless residential, commercial and industrial buildings\n* Detailed game world with physics-based lighting\n* Individually simulated land animals, birds and fish\n* Over 50 challenging achievements in free play mode\n* Extensive modding support via the Steam Workshop","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Urban Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":49376,"name":"Blazing Beaks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8cf/8cfb419d1ffd03a7aa1b1664ae918556.jpg","description":"Birds with guns are blazing the way out through the piles of mutants, monsters and creepy creatures to stop the invasion. Gathering items and artefacts is essential to survive in this fast-paced colorful roguelite. Lots of mysteries to unravel, secrets to find and levels to explore.Game modes\nStory mode (1-2 local players) - it's an explosive adventure where you are fighting the invaders and searching for the origin of evil. Endless pile of enemies you can shoot, blast, zap and disintegrate every way you want. Cute and charming world with challenging levels full of surprises.\nTournament mode (2-4 local players) - it’s battle experience where you compete with your friends to find out who's the real hero.\nDeathmatch - Everyone by themselves. Last beak standing wins.\nOne gun mode - Each player starts with the same randomly chosen weapon which cannot be changed in that round.\nDrop Hearts mode - A player drops some hearts when he is hurt and either he or any other player can collect them.\nSkull keeper mode - Grab and keep the golden skull without losing it for a certain amount of time and all your opponents will lose 1 HP.\nHunting mode - Each player starts with a spear in their possession. Once you throw it, you need to grab it before you can throw it again.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Applava","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17943,"name":"Secret Agent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63d/63db5e3b7c4315319751313143a7986c.jpg","description":"If you liked Commander Keen or Duke Nukem, this game is just what you're looking for. Lots of great situations to overcome and traps to work around. This game has great puzzles which make it much more than a simple run-jump-and-shoot contest. Superb colorful graphics and scrolling levels. James Bond never had it so tough!Features\nSneak and Scroll: Full-screen scrolling as you sneak across huge maps.\nHide and Hunt: Enter various hideouts, each with traps to dodge, puzzles to collect and bad guys to blast.\nSave Your Game: Save and load your game progress.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15897,"name":"KRUM - Edge Of Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/448/4489da404ddcffd11b6f233f7f279762.jpg","description":"KRUM - Edge Of Darkness is hardcore action RPG set in a fantasy world. The player goal is to survive and reach the end of the story by fighting his way through gruesome enemies and blood-thirsty bosses await adventurers as he traverse through a devastated but still beautiful world.\nKRUM has a unique combat system that is simple to learn but tricky to master that’s unlike almost any other action video game out there. It’s nothing like a click-and-slash button masher. Button mashing will only get you killed. Each weapon has a few easy to execute but brutal combos.\nThe nature of the fights suggests that you will have to wait your turn and plan your timing, in order to strike or parry at the very best moment.\nThe game leans heavily on action, but when the combats are so perilous and gritty you'll often find yourself in what feels like a stand-off. Either battling monsters or common warriors, you will be eagerly waiting for your turn to come. You will face countless fearsome mobs and grotesque beasts, hidden deadly traps, powerful demon knights and dragons.\nTHE STORYYou are a noble man living in a small and peaceful village.\nOne day you return from the forest with some wood and see your village ravaged and left in ruins. Your friends and family dead or taken away. One of the few survivors, was able to tell you what happened in his last moments:Unknown demon forces came and destroyed everything without a reason, taking away the ones you love.\nThere is no other way for you but, go on a quest to save them...\nAs you progress in your path, you realize, that there is something more, something bigger, something terrifying behind this.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"HA Studio","platforms":[{"id":0,"name":"PC"}]},{"id":15476,"name":"True or False","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e6/6e625accb8047f8fb7e4196ae2256980.jpg","description":"Featured DLC\nhttp://store.steampowered.com/app/521850/\nAbout the GameFrom the creator of Pythagoria & Aurora NightsTake a quiz to test your intuition and knowledge - and learn some interesting and specific facts along the way.\nYour goal is simple: decide whether the statements are true or false. Some of them may seem pretty crazy, but they are true; while other \"facts\" are actually false.\nIs there a chocolate-scented flower? You will soon know the answer!Key FeaturesOver 200 surprising and entertaining facts.\nCalm and relaxing OST.\nDRM-free. You can play the game anywhere anytime!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vladimir Maslov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14079,"name":"Haimrik","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a7e/a7e9e65f461bf49ab0c1aa29896b1756.jpg","description":"This unique action adventure game lets you become Haimrik, a young scribe trying to make a living in a medieval town full of warriors, sorcerers, dragons and dragon-riding sorcerer-warriors. But one book changes his whole life. With the help of Masamba, a hungry lioness who will protect him while constantly trying to eat him, he’ll venture out to take on the evil king and his elite generals, the Word Warriors.\nFortunately, Haimrik commands the Power of the Words! These are the stones in the path Haimrik walks, and he brings them to life as he steps on each one, willingly or not. Haimrik will need to activate the right words to defeat the various enemies that challenge him across numerous Word Worlds, with new puzzles appearing constantly throughout the game.\nIn an added touch, Haimrik will undoubtedly die many horrific deaths, leaving pools of red blood contrasting with the otherwise plain monochromatic sepia world. Be part of a medieval revolution against the Word King and his elite warriors, and change the way you see words and stories forever.Features\nUnique action adventure built upon interactive words.\nMedieval comedy full of dark humor and over-the-top cartoon violence.\nRare sepia view of a medieval fantasy world.\nEccentric characters like the lioness Masamba who will protect Haimrik from harm... when she’s not trying to eat him.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"1C Publishing EU","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":12974,"name":"Tanki Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/562/5628249d11e51a8fb0ca43aeb14c9e9a.jpg","description":"Tanki Online is the free-to-play MMO-shooter with real-time PvP-battles. Customize your futuristic tank by combining guns, hulls and protective modules, and face real players in four furious battle modes: Deathmatch, Team deathmatch, Capture the flag and Control points. Instant respawns, million of players around the globe, loads of arenas, non-stop action and adrenaline await you in Tanki Online.Key Features Only real players – come together with people from all around the world, invite your friends and make new ones Massive customization options – combine guns and hulls to fit your playing style and become the perfect war machine Turn up the heat with temporary power ups  – pick them up on random locations within the arena With instant respawns, you are constantly in battle – no frustrating down time! Jump right back into the arena and bring your enemies some payback Four game modes – choose your own challenge. Be a lone wolf in Deathmatch or test your team-playing skill in Team Deathmatch, Capture the flag or Control points Easy to learn, hard to master","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"AlternativaPlatform","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1916,"name":"Pang Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/013/0139f1a375ffc12a503f7931db3b5160.jpeg","description":"The Pang series is a beloved collection of arcade video games from the early 90s. Guide two brothers on a quest around the world to save humankind from a massive alien invasion! Use your wits and skills to overcome the attack balls pouring from the skies and rescue the world’s cities and landmarks from impending annihilation!\nPang Adventures brings new features and gameplay to this arcade legend while keeping true to the original spirit of the series.\n●     Local Co-op: Adventures are best shared! The couch-coop feature is available in every game mode, allowing friends and family to team up and save the world!\n●     Online Co-op: show off your skills and compete with your worldwide friends to see who can down the most balls!\n●     3 different ball-popping modes:\nTour Mode: Fight back the alien forces, one location at a time!\nScore Attack: Save the world with only 3 lives and NO CONTINUES! The real arcade experience!\nPanic Mode: Bust balls like a legend! 99 levels of continuous battle will put your skills to the ultimate test!\n●     More than 100 levels scattered throughout Antarctica, Scotland, Death Valley, Bora Bora... each location with its own unique tricks and twists!\n●     The Pang Bros. have upgraded their gear since the last alien invasion: machine guns, flamethrowers, lasers, shurikens…you name it, they've got it!\n●     Boss fights! For the first time in the series, the Pang Brothers come face-to-face with the nefarious Alien Commanders! These villains didn't come to Earth for the sightseeing…so get ready to blow them to smithereens!\n●     Since the last invasion, the Aliens have been busy improving their attack ball technology! Electric, explosive, smoke and lava balls will all be deployed to knock you off your feet, so be prepared!\nThe simplest recipes make the best cookies! Pang Adventures is one delicious treat specifically designed to please your digital tastebuds and get you hooked! So keep your eyes peeled and your reflexes razor sharp to succeed and save the world!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DotEmu","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":914795,"name":"Pizza Tower","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d0/2d02bcfc07f4b5ed8623599ff999ee91.jpg","description":"Pizza Tower is a fast paced 2D platformer inspired by the Wario Land series, with an emphasis on movement, exploration and score attack. Featuring highly stylized pixel art inspired by the cartoons from the '90s, and a highly energetic soundtrack.\nPeppino Spaghetti, a surprisingly agile and powerful fat balding italian, is on a mission to destroy the titular Pizza Tower in order to save his restaurant from annihilation. Follow him through his rampage across the many wacky floors of the tower, collecting toppings and beating up monsters!\nPLAY as Peppino Spaghetti, the supersonic italian middle-aged man! And sometimes Gustavo.\nEXPLORE up to 5 floors leading to many levels, discover all of their secrets!\nFIGHT some monsters and other weirdos!\nDESTROY everything in your path, including those stupid rats.\nBECOME the Pizza Tower!\nWeird crazy characters and animations!\nAn insanely energetic soundtrack!\nAn unusual platformer formula!\nPlay like you want! Go for the highest score or explore at your own pace!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Tour De Pizza","platforms":[{"id":0,"name":"PC"}]},{"id":59861,"name":"XERA: Survival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b33/b335b05714a7cdcdf6253d319a13a925.jpg","description":"It was the year 2020, Artificial Intelligence was becoming more and more popular around the world. Due to the potential threat of AI becoming self-aware, the governments of the world had to work together to prevent the possible extinction of the human race, in doing so, they created the XERA Corporation.\nA new law was soon taken up by all governments of the world. This law strictly prevents any further research and development of artificial intelligence. There was a loophole, which would allow the XERA Corporation to legally seize all research and prototypes created, and continue the research and development at its own facility.\nIn 2022, the first artificial intelligent humanoid went online. Soon after, it showed signs of consciousness and emotion. Then one night, it disappeared from the facility. The humanoid found an abandoned factory, which is where it created hundreds of replications of itself.\nThe military soon took over the XERA facility, and sent out a remote update to the humanoids. Something went wrong, the updates were corrupted. They started to turn against the whole of humanity and the world fell into war. Everything is chaos, it's kill, or be killed.\nThis is a story of a future, no one saw coming.MULTIPLAYERXERA: Survival has been built from the ground up with multiplayer support. You have the ability to play with your friends, or play against others from all around the world - the choice is yours.PLAYER VS PLAYER VS ENVIRONMENTXERA is heavily focused on PVP, but there is still the environment to worry about. Be careful of AI and watch your thirst and hunger meters.FIND LOOT TO SURVIVEScavenge the world to find weapons, food, drinks and medical supplies to stay alive & protect yourself.STASH YOUR LOOTThe global inventory is where you can store your items safely. This is done inside of a \"Safe Settlement\". Store your items, then venture out on raids with your selected load-out.CROSS REGION INVENTORYCharacter inventories are stored on a master server, which crosses over every region and every official server. You can logout of an American server, and have all your items on a European server. This enables players to group up with friends and meet players from all over the world.ENVIRONMENTThe map is an open-world environment, explore, scavenge, and stay on your feet to survive. Find a location to make yours, and guard it with your life. As night time comes, you should use it as an opportunity to scavenge as other players will find it hard to spot you.DAY & NIGHT CYCLEThe day and night cycle in XERA adds a whole new dynamic to game play. As day moves into night, the AI become more of a threat, different variations come out in darkness - with improved resistance and speeds.DYNAMIC WEATHER SYSTEMA weather system has been implemented which adds dynamic elements to combat & survival situations. Your play style will need to change depending on the weather conditions.EXPLORE & FIND LOOTAdventure through the world scavenging for resources to survive. Find weapons, food, drinks and medical supplies to stay alive & protect yourself. The world's loot system keeps items constantly spawning & respawning around the map, so roaming is your best option to finding more loot.COMMUNITY DRIVEN DEVELOPMENTWe want the community to be heavily involved in shaping the future of XERA. While we have a lot of base ideas & thoughts we will always be open minded about new ideas that the community bring forward.\nAs our community grows we want each and everyone's voices to be heard. Through various platforms we will ensure there is always a place for you to voice your opinions, whether it be positive or constructive, we want to hear it all.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Spotted Kiwi Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":38286,"name":"Penumbra: Black Plague","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccd/ccd3805e6bbea374a039a969772b5975.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frictional Games","platforms":[{"id":0,"name":"PC"}]},{"id":36900,"name":"The Lord of the Rings: The Battle for Middle-earth 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48c/48c80c9207a128996cd704b8d4f42c61.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":32232,"name":"Little Big Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49b/49b6f4cfce8e6979d00754953a71ca17.jpg","description":"Chilling dreams of destruction and doom fill your mind. You feel compelled to warn the world, but in so doing are imprisoned by the tyrannous Dr. Funfrock. Imprisoned because of a dream? You know in your soul that you must escape somehow and discover the meaning behind this mystery.\nAs Twinsen, prophet and savior, you embark on a surreal and suspense-filled journey. You cross continents in your quest to save the world and stop your evil nemesis. At any moment, your enemies may overtake you, stopping you in your pursuit of the Legend. Relentless you must be, for only those who remain pure can overcome the peril that awaits.\nLittle Big Adventure is a real gem in the genre. There is nothing else like it. The game is filled with surreal action and adventure that will make you laugh many times because you can hardly believe the kind of crazy things they've thought up. So if you are in a mood for a crazy adventure with great story, clever puzzles with more than one solution, and open world then you can’t go wrong with this masterpiece of a game.Well-written story, memorable characters, and surreal environment will give you an adventure you will never forget\nHuge world to explore with many secrets to uncover, places to visit, and mysteries to solve\nClever puzzles with multiple solutions: the crazier you think the easier it is to solve them","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"DotEmu","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"}]},{"id":19575,"name":"Imperial Glory","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/702/7022d34f318628f520042b15ac441d98_8lPZckB.jpg","description":"It is a time of war in Europe. Driven by new ideas of Enlightenment, the hearts of men and women across the continent are inflamed with dreams of freedom and glory. Antagonism between the Empires is at an all time high and war seems inevitable. Millions of men prepare for battle, while the finest strategists draw up their plans for the domination of Europe. This is the moment for a military genius to forge himself a name to be remembered throughout all eternity. This is your moment.Key FeaturesSpectacular real-time 3D land and naval battles\nComplex battlefields where units can gain higher ground, hide behind cover or use formations to their advantage\nA comprehensive turn-based management model with over 50 provinces in Europe and North Africa","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Pyro Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17821,"name":"Yellow: The Yellow Artifact","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20c/20cc48d98eaebcafba52ca40d43e5156.jpg","description":"Yellow - is a cool flat platformer, with adventure and puzzle elements.\nWelcome to the Yellow, abstract platformer with vector graphics.\nDifferent locations and enemies, great soundtrack and a lot of Steam features waiting you here! (achievements, trading cards, community, etc)\nRelax during the game and enjoy juice gameplay.\nExplore big game world\nEnjoy graphics and soundtrack\nGet cool emoticons, achievements and trading cards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BadDoge","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16459,"name":"So Many Cubes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7bd/7bdc3e0f7403346c89a077dad3b4893f.jpg","description":"A chaotic strategy game with cubes!\nYou have to choose and build deployments to destroy the Mothercube with So Many Cubes\nFeatures\nPlayers\nSingle player vs Bot (game mode 1)\nPlayer vs Player (game mode 2)\nSurvival single player (game mode 3)\n10+ Cubes: continuous deployment of cubes\n10+ Cubes: op turret to use for a limited time\n20+ Unique cubes","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"exagongames","platforms":[{"id":0,"name":"PC"}]},{"id":16195,"name":"Arcana Heart 3 LOVE MAX!!!!!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27e/27e93dd280a8a8ad071c77321f015a58_4K6yJOn.jpg","description":"With its own unique battle system and a wide selection of characteristic angels, the girls are appearing on Steam for the first time in [Arcana Heart 3 LOVE MAX!!!!!]!!Discover new meta gameplan as you play!\nFrom the basic battle mechanics such as performing \"Arcana Combo\" with the pressing of the correct buttons in sequence, \"Homing Action\" and \"Arcana Burst\", to the more advanced and spectacular \"Extend Force\", \"Arcana Eclipse\" and \"Arcana Blaze\", dozens of ways to decimate your opponent! Find out more about the mechanics in the game!23 playable Angels with 23 free selectable Arcanas!\nEquip the unique characters with an Arcana of your choice, and explore the boundless amount of strategies that can be derived!Plentiful story!\nEvery character has their own \"Main Story\", as well as a special \"After Story in the Hotspring\", all fully voiced! (in Japanese).\nIn addition, all characters have extra \"Short Stories\" (non-voiced), giving you the chance to understand your character more than ever!\nDive into the world of Arcana Heart!More than just simply fighting!\nIn short, there is \"Story Mode\", \"After-Story Mode\", \"Survival Score Attack Mode\", \"Trial Mode\", \"Time Attack Mode\", \"Versus Mode\", \"Training Mode\", \"Replay Theatre Mode\" etc. etc. and many more!\nAlso, in the \"Gallery Mode\", you can unlock Event CG illustrations and Link-Animations, and view the Angels' short stories!Online Network capable!\nPlayers who are up to the task can test their prowess online, via the \"Rank Match\" or \"Player Match\" mode.\nPlayers can save their battle results and scores online, and compare their scores with other players in the Leaderboard too!\nShow the world that your Angel is the #1 wa-, *ahem*, Angel in the world!Special Purchase Bonus!\nDiscover more about each Angel's charming points with the 144-page filled \"Link Anime Drafts Collection\" that comes with each purchase!\nWhen you're feeling exhausted after a heaty battle, open up the Collections and be refreshed!\n*They will be placed in your Steam folder:\n...\\Steam\\SteamApps\\common\\Arcana Heart 3 LOVE MAX\\Digital Extras\\","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aksys Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":15968,"name":"AKIBA'S TRIP: Undead ＆ Undressed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25c/25c2615be4dbd4497968491ea3f986d0.jpg","description":"Akihabara. \"Akiba,\" for short.\nThis suburban Tokyo ward's seen it all, from Japan's post-war reconstruction to the economic bubblegum crisis of the '80s. Always on the cutting edge of progress, with a little something to offer even the most fetishistic of appetites, it was almost inevitable that this singular technocracy of indulgence would give birth to a whole new kind of appetite altogether.\nEnter, the “Synthisters” – vampires who prey upon the life energy of the town’s unsuspecting figurine-chasers, maid café connoisseurs and cosplayers. Those victimized by Synthisters take on the properties of their attackers while also withdrawing from society and becoming veritable shut-ins due to their newfound fatal weakness to sunlight.\nAKIBA’S TRIP tells the story of one such unfortunate soul: a young man named Nanashi who was lured into a trap by the promise of rare character goods and transformed into one of the walking undead. He, however, was spared the worst of his fate by the bloody kiss of a mysterious Synthister hunter named Shizuku. Together with the rest of his companions in an organization unofficially dubbed the “Akiba Freedom Fighters,” Nanashi and Shizuku must uncover the truth behind the Synthister plague and save Akiba from being overrun by violent, antisocial energy vampires.\nAnd of course, the best way to fight vampires is to strip them down to their skivvies so they melt in the noonday sun…KEY FEATURESFaithful Recreation of Japan’s Electronics Mecca\nLike a virtual tour of Tokyo’s Akihabara district, all major outdoor locations from the town have been painfully recreated, with over 130 real-life shops accurately represented.\nUnique and Customizable Brawler-Style Combat\nAnything can be a weapon, from baseball bats to comics to motherboards, and individual clothing items may be targeted, stripped and added to the player’s own inventory.\nSatirical Story with Divergent Paths and Multiple Endings\nPlaying off common anime and video game tropes for social satire, the player’s choices determine how the story progresses, leading to one of many unique endings.\nModern Day Setting Enhances Gameplay Options and Adds Pop Culture Feel\nThe in-game smartphone is used to check email, read comments on “Pitter,” take side quests, catalog ad flyers, launch apps to identify the undead and much, much more.\n*Please note that the buildings and monuments depicted in the game AKIBA'S TRIP are based on the Akihabara town area from the fall of 2012 through the summer of 2013.*","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"XSEED Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":14691,"name":"Zombillie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/949/949959971c752df14026cf878a5e5df8.jpg","description":"The world has changed. Irrevocably and completely. Green parks have been replaced by grey ruins. Colourful meadows have become toxic swamps. Once vibrant lands are now littered with dust, rubble, concrete, and debris.\nMost creatures did not survive the Great Change. The survivors faired rather poorly in the immediate aftermath, becoming prey to all manner of predator. However, a lucky few managed to survive even then, to adapt, to thrive, to evolve. Zombillie was one such creature.\nZombillie lived a comfortable life in his humble cave, hunting for meat, and as he hunted, he grew, and grew, and grew. Everything was going relatively well for Zombillie, except for one problem: Zombillie didn't have enough meat!\nHelp Zombillie reach the legendary meat farm! A long road lies ahead: 90 complex levels full of puzzles and traps. So stand on your feet - all 100 of them - and just ride!\nFeatures\n- Almost 100 challenging levels\n- 3 completely different environments\n- Lots of power-ups & gadgets to find\n- Various levels\n- 2 additional types of mini-games\n- Addictive gameplay","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":10636,"name":"Office Battle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef0/ef05360d56d666528b36b6e81168746e.jpg","description":"Welcome to Office Battle! Many workers will lose their job because a layoff is happening very soon in your office. That is why \"Big B\" decided to organize a competition and the winners gets to keep his job. But don’t think that it will be easy. \"Big B\" will test the worthy office champion himself from time to time.Features: 60 colorful levels\n40 items that you will never see in other games\n11 skills that you can improve\nLevel Editor\nPartial Controller Support\nGlobal player ratings","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Black Lime Studio","platforms":[{"id":0,"name":"PC"}]},{"id":6579,"name":"Chainsaw Warrior","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9c/f9c85abb7f260067b1ed2a7d2ddccf70.jpeg","description":"Chainsaw Warrior from Games Workshop is the classic nail-biting game for one strong-nerved player! It's the year 2032 and spatial warping has opened a hole into another dimension in the midst of the old municipal buildings at the heart of Manhattan. Bizarre and dangerous creatures are flooding into our dimension, intent on destruction. Behind their actions is a controlling intelligence known as 'Darkness', who intends to drag New York back into the warp – destroying it utterly!\nAir strikes, ground assaults and WMDs have all failed to stop the swarming forces from beyond. All that remains is a single hope: a shadowy ex-special forces soldier, enhanced for combat and known only as 'Chainsaw Warrior'. Equipped with all the latest high-tech armaments, he must battle his way through to the trans-dimensional ground-zero and defeat Darkness. Not only are there swarms of zombies, mutants, traps, Chaos Agents and other twisted denizens between him and Darkness, time is the enemy too! Only an hour remains to save New York before it is torn from our world forever.\nFirst published as a solo boardgame in 1987, it has been updated, translated and re-engineered for the digital generation. In Chainsaw Warrior it's just you against both the clock and a tide of evil! Can you prevail where all others have failed? You only have 60 minutes to save New York!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Auroch Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":3778,"name":"Fort Defense","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/908/90812db83e26ea918b44866aa7789b19.jpg","description":"All hands on deck! Pirate armada dead ahead!\nTake part in an uncompromising struggle repelling freebooters' assaults. Watch out, the enemy may catch the tide for ruining your fortress. Build towers, collect crystals, upgrade spells and believe in your victory!\nWelcome to the unique pirate style Tower Defence. Now the battle rages on by land and by sea!\nTwo worlds, more than 40 levels, unique ships, menacing bosses and powerful spells - all this will deepen you into the game.\n1. To arms! Pirate armada dead ahead!\n2. Engage in incredible sea battles!\n3. Master the tactics of magic and arms!\n4. Defeat powerful and scary bosses!\n5. Download! Load! Sink'em all!\n- 40 different progressively challenging levels\n- 2 unique game settings\n- 12 kinds of creatures\n- 12 kinds of towers and structures\n- Extensive magic system\n- In-game store, for various upgrades.\n- Fascinating gameplay","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"8Floor","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":442866,"name":"Paper Mario: The Origami King","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/075/07556ef3826d83fdb19c8e1836d25c1a.jpg","description":"A new paper-crafted Mario adventure unfolds on Nintendo Switch\n\nThe kingdom has been ravaged by an origami menace! Join Mario and his new partner, Olivia, as they team up with unlikely allies like Bowser and the Toads to battle evil Folded Soldiers.\n\nTry to free Princess Peach’s castle from the clutches of King Olly in this comedy-filled adventure, only on the Nintendo Switch system.\n\nNew abilities… and new battles!\n\nUse the 1,000-Fold Arms ability to extend your arms to interact with the environment and solve puzzles. In battle, line up scattered enemies and plan your attack to maximize damage with the new, ring-based battle system that requires both puzzle-solving skills and a quick wit.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":257237,"name":"Persona 3: Dancing in Moonlight","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a5/8a5fae0904c767aea370e274caa341f7.jpg","description":"Face-to-face with an enigmatic Velvet Room resident, the SEES are forced to perform at a mysterious dance party. Test your rhythm based gameplay skills and dominate the dance floor!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":254547,"name":"Death Trash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/997/9970bb3eea2a5ce260328e5130dde49d.jpg","description":"An action role-playing game with combat, stealth, dialogue, inventory, attributes, skills, item crafting and psi powers where you fight against machines and larger-than-life beings or become their friend.\r\n\r\nCustomize your own character through stats and making choices and take a journey through a story-based campaign with lots of freedom and side missions.\r\n\r\nThe game is set in the future and where human species are space-faring and settled on the planet Nexus with its ancient secrets of stone and flesh. The machines were installed as protectors, but they were corrupted and eventually brought terror. You'll become a raider among the ruins of the past.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"crafting legends","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19171,"name":"Tex Murphy: The Pandora Directive","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/311/311806b4d7bf16b7e0e6056535a9a24f.jpg","description":"The Government has covered up the greatest secret of the 20th century.\nTex doesn't like secrets.\nIt's April 2043 and you- as Tex Murphy, the last of the old-style gumshoes- find yourself racing against time in the most dangerous game of your life. What is the truth behind the rumored UFO crash at Roswell, New Mexico? Why did the military suddenly shut down and seal off the Roswell complex? And why the frequent references to the lost Mayan civilization?The Pandora Directive features:\nUnrestricted movement. The unique \"Virtual World\" engine allows you to slip under desks, rifle through drawers, and see the flies tanning in the light fixtures. Without the restrictions of rendered paths, you can explore Tex's three-dimensional world with full freedom of movement.\nThe most replayability of any interactive movie to date. Follow one of three narrative paths leading to seven different endings. Are you a hard-nosed but honest P.I. struggling to overcome the forces of greed and corruption? Or a cynical opportunist who may have to \"sell out\" principles top score the big payoff? Perhaps you'll fall somewhere in between. Your choices could reveal more about yourself than you'd really like to know.\nTwo levels of play. The first level offers a complete on-line hint system to help you through the tougher puzzles. The second level- for expert gamers- has no hints available but rewards players with higher bonus points, extra puzzles and locations.\nHollywood! Enjoy the difference Hollywood cinematography, acting, editing, stuntwork, music, and direction make as the world of Tex Murphy becomes amazingly real. Cinematography and direction by Hollywood editor/director Adrian Carr (Quigley Down Under, Man From Snowy River, Power Rangers). Cast stars Barry Corbin (Northern Exposure, War Games), Tanya Roberts (View To A Kill, Beastmaster), and Kevin McCarthy (Invasion Of The Body Snatchers, Just Cause). Original song by blues musician Richie Havens.\nThe most interactive: Virtual World engine allows full freedom of movement. No rendered paths!\nPlay it again! Story line follows three different routes leading to seven totally different endings!\nMind bending: Intriguing mysteries and brainteasers that stretch the imagination.\nThe most playability: Two levels of play- complete on-line help or master level with no help.\nWill Tex and Chelsee finally get together... or is there a new woman in Tex's life? A secret has been buried for 3,000 years. What really happened on July 6, 1947, just outside Roswell, New Mexico? \"It was no weather balloon...\" This case may be too hot for even Tex to handle. Intriguing puzzles challenge your wits.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Access Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16509,"name":"Root Double -Before Crime * After Days- Xtend Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbd/bbd32b143f7f72c45d13adba321167a8.jpg","description":"The year is 2030. Business is as usual in the isolated research city of Rokumei–that is until several explosions suddenly go off in the nuclear research facility known as “LABO.” The city sends in “Sirius,” an elite rescue squad, to deal with the situation. But the situation only gets worse when LABO’s nuclear reactor melts down, sending the facility into lockdown–with members of Sirius and survivors still trapped inside. With lethal radiation leaking everywhere and not enough anti-radiation medication to last until lockdown lifts, the survivors make more and more grim discoveries. In their struggle for survival, in a deathtrap full of fire and radiation, they learn that doubt is their greatest enemy, and trust their greatest asset.\nThe story of Root Double features two different protagonists: Watase Kasasagi, a rescue squad captain who has lost his memories in the hours after the incident, and Natsuhiko Tenkawa, a student piecing together the clues in the six days before. The only key to survival lies in the player’s hands with the Senses Sympathy System (SSS). Unlike traditional visual novels, Root Double does not have clear cut “choices,” but rather, the game uses SSS to allow the player to manipulate the story based purely upon emotion. Your emotions projected upon the characters, particularly your trust in them, shape the progression of the story. Only with effective use of this system and completion of both protagonists’ stories can the player piece together the truth and hope to discover a way out of the facility.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Regista","platforms":[{"id":0,"name":"PC"}]},{"id":11615,"name":"Rabi-Ribi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ca/8ca4d43f408e0d4e4b994429a85ec083.jpg","description":"Free DLC \"Cicini's Halloween\" just released!http://store.steampowered.com/app/547660/\nCicini wants to get everyone hyped for Halloween!\nHer plans include new mini side story, new areas, new enemies and a whole new boss fight with new music!\nAbout the GameUPRPRC Edition contains\nRabi-Ribi Game\nDigital OST (Original Soundtrack)\nRabi-Ribi Digital Artbook\nThere never quite seem to be enough bunny girls in the world, so here is another for you aficionados out there. This 2D sidescrolling exploration platformer follows the adventure of Erina, whose humdrum life as a regular rabbit is turned upside-down when she finds herself in an unknown world and turned into a human (with rabbit ears)!\nAlong the way she meets the cheerful pink-haired fairy, Ribbon, who mysteriously chooses to stay by Erina’s side.\nThese unwitting heroes embark together on their quest to restore Erina’s life to normalcy, but who knows what troubles lurk, waiting for them…Rabi-Ribi is a 2D exploration platformer that focuses on non-linear gameplay. There will be hints to guide the player along, but they’re never required to follow them, which allows for much greater freedom to—you guessed it—explore.\nPlayers will play as our protagonist Erina, who focuses on close quarters combat. Ribbon the fairy is the ranged attacker who follows Erina’s lead, indirectly controlled by the player.\nErina may be a little rabbit that was turned into a human, but that doesn’t stop her from being capable of some pretty neat moves.\nBoth Erina and Ribbon’s abilities can be improved by learning new skills and attacks through collecting items and upgrades that are spread throughout the world.\nWhat trinkets and skills to pick up is up to the player; dare you challenge hard mode without any items?\n– Retro exploration platformer featuring a bunny girl.\n– 4+n difficulty settings for all types of players.\n– 9+ main areas and 20+ sub-areas to explore.\n– Bunny.\n– Over 60 items and upgrades.\n– Over 20 fully illustrated characters with cutscene illustrations.\n– 40+ boss battles, 1000+ attack patterns with Boss Rush Mode to fight some or all of them in a row.\n– Post game story and content with speedrun mode which takes out every section of the game where the player cannot control the main character.\n– Over 50+ pieces from an original soundtrack.\n– English, Chinese and Japanese support.\n– Bunny.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CreSpirit","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":2071,"name":"The Huntsman: Winter’s Curse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b19/b1995ae055665646e99b7d38aa955fd6.jpg","description":"Winter is fast approaching as Queen Freya’s army marches relentlessly. Beneath the shadow of that deadly war, Elisabeth’s life on her family’s farm in Vardhelm comes to an abrupt end. Join her to find her missing brothers as you explore the Huntsman universe and encounter both familiar faces and new dangers, all while discovering the secret Elisabeth herself carries in this Adventure RPG.\nMeet Elisabeth: Determined and optimistic, Elisabeth believes in fairy tales and happy endings--and a will to make them come true.\nMeet Marcus: A staunch ally with unusual magic, Marcus’ path seems entwined with Elisabeth’s--yet he hides secrets that might endanger them both.\nParticipate in an immersive interactive fantasy story.\nA Distinct Visual Style: Explore the world of Snow White and the Huntsman brought to life with character designs by Abigail Larson.\nEngage in Strategic Combat: Engage with wisps, goblins, trolls and more via a strategic and visually appealing system.\n1 player\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 Desert Owl Games\nThe Huntsman: Winter's Curse and all related marks and logos are trademarks of Universal Studios. © 2016 Universal Studios. Licensed by Universal Studios Licensing LLC. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desert Owl Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":1505,"name":"Monochroma","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a0b/a0b4904c78ca3c3cc0fa985ae7c27c3f.jpg","description":"Check out our upcoming Life Simulation Game\nAbout the Game","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nowhere Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":311820,"name":"Cyber Hunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9e/e9e8c75c028188ba6ed8d6b95ff19c17_LhGq5iM.jpg","description":"An Open Letter to All Wanderers\nDear Wanderer,\nWelcome.\nWe are the Cyber Hunter development team. First of all, please allow us to introduce our game.\nCyber Hunter is a next-generation, competitive sandbox mobile game. It's packed with a host of different elements, including survival, shooting, exploration, skills and much more, even including parkour! In short, it's a brand new gaming experience. The game tells the story of our future, after brain-computer interfacing technology has become highly advanced and human civilization has experienced another evolutionary leap, during which, great events have begun to unfold. Justice faces off against evil. The old stands against the new. And forces of conservatism clash with radicalism.\nIn this virtual world, all our heroes and heroines have acquired a “super power” through the help of quantum droids – the ability to turn quantum cube energy into any tactical support device they need. From Optical Camouflage to Quantum Barriers, from a detector that alerts you of approaching enemies, to a medical instrument that heals squad mates; anything and everything can be built, by you, and that's not all. You can choose whatever skills you think will help your strategy the most in any battle.\nWe've even created a vertical combat concept. With parkour features including climbing, gliding, and rolling, players can experience vertical battles on a variety of terrain, including mountains, swamps and deserts. In this game, the arena that hosts your battles are not just a huge, flat map, but a world where you can fly in the sky and move underground. We have also created a number of exploration points scattered throughout the world. Here, you can explore temples in the desert with a chance of finding E-Cores to unlock new skills and weapons. Amid mounds of destroyed robots, you can also find gloves that greatly increase your climbing speed.\nWe hope that Cyber Hunter can bring you a new way to enjoy gaming and that you'll love taking part in the sandbox competitions it offers. The game still has room to improve, however, if you experience overheating, slowdowns, occasional rebooting or updates to your device during the game, we would like to apologize in advance and ask for your understanding.\nWe can reassure you that this version does not represent the final quality of the game, but only the beginning of something even more fun. Your valuable suggestions and opinions will be the driving force for the continuous improvement of Cyber Hunter, and your enthusiasm and passion will be the motivation behind our continued efforts.\nFinally, we would like to express our gratitude to you for downloading and supporting our game. Thank you!\nFeatures:\n-- Vivid characters with verisimilar faces –\nWith next-generation face shaping art and over a hundred cosmetic designs, distinct and vivid heroes can be created\n-- Special skills and tactics –\nPlenty of tactical skills, such as optical camouflage, quantum barriers, invisible force fields, fire support. You can formulate your own tactical system\n-- Take to the skies to search for what you need. Become a parkour expert and knock your enemies out in style –\nGlide in the sky, dive into a deep sea, climb and roll, there are lots of parkour moves available to use during fast-paced free combat.\n-- Explore and fight in a sandbox world –\nAll terrain is open to explore freely, including 100-meter-high water falls, desert temples, and swampy relics. You’ll find lots of weapons in this world.\nAbout us:\n- Official site: http://www.cyberhunter.game\n- Facebook Page: https://www.facebook.com/CyberHunterOfficial\n- Facebook Group: https://www.facebook.com/groups/CyberHunterGroup/\n- Discord: https://discord.gg/xHABwgb\n- Twitter: https://twitter.com/CyberHunter__\n- YouTube: https://www.youtube.com/CyberHunter\n- Instagram: https://www.instagram.com/cyberhunter_official/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"NetEase Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":46232,"name":"Tokyo Dark","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78b/78b4383d2ced982413981f290c10b3dd.jpg","description":"Collector's Edition\nIn addition to the core game, Tokyo Dark: Collector’s Edition includes the game's digital soundtrack, alongside a PDF art book containing imagery from throughout the game's development process.\nAbout the GameDetective Ito`s partner is missing, but what starts as a straightforward case soon spirals into a twisted nightmare that causes Ito to confront her past and question her own sanity.\nTokyo Dark places the narrative in your hands. Your decisions and actions change Detective Ito's state of mind, opening doors to different possibilities as you attempt to find your partner and understand the dark and horrifying world around you.\nKEY FEATURES\nThe S.P.I.N (Sanity, Professionalism, Investigation, Neurosis) system keeps track of every decision you make, changing how other characters react and the actions available to you.\nA deliciously dark delve into the world beneath Tokyo, that will leave you questioning each and every decision.\nA branching narrative that delivers 11 exciting endings.\nA NewGame+ mode that positions you at the fork of each of Tokyo Dark's 11 endings.\nBeautifully animated sequences produced by Graphinica - a world class anime studio.\nThe exploration, discovery and puzzle solving found in Point and Click Adventures married with narrative depth and intrigue of visual novels.\nOriginal soundtrack by Reign of Fury front man Matt `Bison` Steed.\nLocalization by Japanese novelist Ureshino Kimi.\nWill the past come back to haunt you, or will you stand by your decisions?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cherrymochi","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":42437,"name":"Outlast: Whistleblower","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5c/c5c5ac554749639eb0b1c67eafa419cd.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Red Barrels","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]}]