[{"id":28554,"name":"Burnout Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/586/5862351f30cfe0b4e11e48916c8cff71.jpg","description":"Burnout Revenge lets gamers rip through rush hour traffic and lay waste to scores of rubbernecking roadhogs in an over-the-top scene of vehicular mayhem. In addition to tricked out new race, crash and road rage modes, Burnout Revenge takes the series' blistering speed and spectacular destruction to dizzying new heights with an all-new Revenge mode, challenging gamers to battle the clock and unleash their frustrations on rush hour traffic.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Criterion Games","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":18631,"name":"Phantasmagoria 2: A Puzzle of Flesh","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce8/ce80a47dd4866f703d85d7776c53b8cf.jpg","description":"Curtis Craig is a quiet young man. He has a steady job working for the WynTech Industries corporation. He has a lovely girlfriend, Jocilyn. He's been out of the mental hospital for exactly one year. All Curtis wants is to live a normal, happy life, but something seems to have other plans... Strange events, inexplicable and terrifying, begin to happen all around him. Curtis begins to doubt his own sanity, and the very fabric of reality.\nThen... The murders begin...\nA psychological horror story from the blackest depths of the human soul\nA compelling story with interesting characters\nAn intense atmosphere not meant for the faint of heart","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":800,"name":"Mutant Mudds Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/204/204b78adc6fe5f02ffd8124fa934cb4b.jpg","description":"Love pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, you’ve come to the right place, my friend. Mutant Mudds Deluxe is a “12-bit” action platformer full of pixels and platforming fun!\n\nOur hero, Max, may be just a 2D sprite, but he can leap into the third dimension by jetting between the background and the foreground playfields with his trusty jetpack in this unique dimensionally-woven experience.\n\nArmed with a heavy-duty water cannon, Max has what he needs to vanquish his long-term nemesis: the Mutant Mudds. Max must blast and hover his way across the soiled landscape to seek out mysterious Water Sprites. Legend says collecting all of the mysterious Water Sprites will wash the filthy Mutant Mudds away for good!Key Features\n80 hard-as-steel levels spanning across 5 pixelated worlds and 9 neo-retro art themes!\nJet between three 2D playfields and enjoy lovely depth-of-field blur effects – an eyeball treat.\nObtain power-ups from Grannie's Attic to gain access to secret level doorways!\n20 ghoulish ghost levels where the rules are turned upside down + spectral power-up.\nUnlock Grannie and other playable characters to harness the tri-power of all power-ups!\nSteam leader boards show the best level completion times from around the world.\nIncludes 20 lip-smacking delicious ‘Grannie’ levels, specifically designed for veteran players!\nSteam achievements earn you pride and bragging rights, while sharpening your skills.\nDozens of foot-stomping and booty-groovin’ chip-tune music tracks to snap your fingers to!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Renegade Kid","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":49790,"name":"Ash of Gods","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/259/2592287812dfd622f0845fe25adc13d8.jpg","description":"Ash of Gods: Redemption is a turn-based RPG that combines tactical combat, CCG elements, and a constantly evolving story in which no one is safe from death, including the main characters.\r\nGAMEPLAY\r\nAsh of Gods is the story of three separate protagonists rising in response to a centuries-old menace once thought to be mere folklore.\r\nAsh of Gods’ storyline is constantly evolving in response to players’ choices, sometimes even resulting in death. But, the death of a character is not game over. Instead, the story moves forward with the death of that character and previous choices continuing to impact future events.\r\nCombat in Ash of Gods is a blend of both traditional turn-based strategy and CCG gameplay. While individual tactics will depend upon the skills and classes of your characters, you will unlock and accumulate cards that have the power to unleash powerful abilities, sometimes altering the course of an entire battle.\r\nWHAT MAKES ASH OF GODS UNIQUE\r\nDecisions with Major ImpactsEvery decision, whether on or off the battlefield, has the capacity to alter the course of events and the fate of your party with major repercussions. But, even the death of your leader is not the end of your journey.\r\nNo Random Dice RollsThere are no dice throws to determine chance-to-hit or the force of a blow. In Ash of Gods, true tacticians must master the skills of their classes and harness the powers granted by their limited supplies of cards, or suffer the consequences.\r\nAI that Adapts to YouAsh of Gods’ AI adapts to your style of play to ensure a consistently challenging experience with no room for cheap tactics or invincible team builds.\r\nPvE and PvP MultiplayerWork with a friend to battle the AI in PvE challenges, or challenge other players and compete for a spot on the leaderboards. Unlock new characters, upgrades, and cards to customize your tactics even further.\r\nRewards for RiskExpend your own HP for a last-ditch attack. Go into battle with a smaller team to get better cards and quicker rounds. Take the shorter, but more dangerous route to save on resources. Ash of Gods rewards those willing to take the risks.\r\nTHE STORY\r\nAfter 700 years, peace in Terminum is about to end. The Feast of the Spring Equinox is in full swing when the town bell begins to ring. Captain Thorn Brenin, the bodyguard Lo Pheng, the scribe Hopper Rouley, and many others, do not yet know that the reapers have returned and intend to drown the world in blood so that they may awaken the sleeping gods.\r\nWritten by the award-winning fantasy author, Sergey Malitsky, Ash of Gods is a story-rich game full of memorable characters, powerful dialogue, and deep lore. Malitsky is currently working on a new novel stemming from the events of Ash of Gods.\r\nTHE ARTWORK\r\nInspired by the works of Ralph Bakshi (The Lord of the Rings), classical Disney animation, and the prolific Soviet studio, Soyuzmultfilm (The Snow Queen), Ash of Gods features intricately hand-drawn illustration and animation. Rotoscoping, a technique in which a scene is first filmed with a live actor to use as reference, instills every frame of animation with incredible detail and a true sense of life.\r\nTHE MUSIC\r\nThe original soundtrack is a collaboration of Adam Skorupa, Krzysztof Wierzynkiewicz, and Michal Cielecki, whose previous work includes The Witcher, Bulletstorm, Painkiller, EVE Online, Call of Juarez, and Shadow Warrior. Every track was recorded live by professional musicians, often using traditional instruments rarely encountered in contemporary recordings.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"AurumDust","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":44057,"name":"GORN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb5/bb5f9bfe03ce18e22031853298223062.jpg","description":"GORN is a ludicrously violent VR gladiator simulator, made by Free Lives, the developers of Broforce and Genital Jousting. Featuring a unique, fully physics driven combat engine, GORN combatants will be able to creatively execute their most violent gladiatorial fantasies in virtual reality. Savagely strike down an infinite supply of poorly-animated opponents with all manner of weapons – from swords, maces, and bows to nunchuks, throwing knives, massive two-handed warhammers or even your blood-soaked bare hands. The only limits to the carnage are your imagination and decency, in the most brutal and savage VR face-smashing game ever produced by man.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Free Lives","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":20895,"name":"Despair","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c3/4c3214926de5abf8302b80c79635a125.jpg","description":"«Despair» - indie-horror video game.\nThe main character wakes up in a tunnel of the subway and tries to find out that happened to it and other passengers of the train. To understand that after all it happened to the gone passengers, the player should investigate strange catacombs being deeply underground.\nAt himself the player has only a small lamp batteries to which very quickly come to an end.\nAs the player has to collect notes left other people to understand that happened.\nPurpose:\nWandering about subway tunnels the player has to find all notes the subway scattered in frightening catacombs and try that after all it happened to passengers and to him...\nAnd can be anybody the answer and isn't present...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"AGC","platforms":[{"id":0,"name":"PC"}]},{"id":20112,"name":"Survivor Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a92/a9278e223b6e8342ceb7d821d3b7f351.jpg","description":"Survivor Squad is a Strategy Action game where you control a Squad of up to four survivors and guide them through a highly randomized world looking for supplies to aid you on your journey.\nScavenge for supplies in every corner of every building, craft your gear, pick your skills and loadout while keeping your Squad alive by covering every corner and moving as a group.\nIt is a game that encourages quick thinking and fast paced play since you need to pay attention to all of your squad mates. If you leave someone behind, chances are they will be pounced on and die. Move as a Squad and cover every corner.\nFour game modes: Campaign, Survival, Death Lab and Multiplayer.Features:Top Down 2d Strategy Action\nUse Melee weapons to take down enemies silently or go guns blazing\nScavenge buildings for materials to craft your gear\nEquip Gadgets to assist you in combat\nHighly randomized world providing infinite possibilities\nCapture Infected buildings and defend them from the horde\nSeveral types of Special Infected that must be dealt with quickly\nRename your Survivors to have a more intense personal experience\nFour game modes: Campaign, Survival, Death Lab and Multiplayer.Gameplay:Control your Squad with the mouse carefully planning where each Survivor goes to and where to look. The Survivors have a limited view range so it is vital to ensure you are looking where the infected will most likely come from.\nCertain events require you to move around a building while fighting off a horde, you must keep a close eye on your squad or they will perish one by one.\nVarious types of Special Infected have abilities such as Blinding Powder or Acid Pool that encourage you to quickly move your Survivors while making sure they are never alone\nIn campaign mode you can capture infected buildings that generate resources but must be defended from horde invasionsCampaign:Play through a highly randomized world following a simple storyline with unique events and a conclusion.Survival:Score based mode, go through as many randomly generated buildings as you can never looking back.Death Lab:Equip your Survivor Squad with a limited budget and take them through a collapsed Lab. Good micro management of your Squad is essential to your survival.Multiplayer:The new Multiplayer mode is a 1v1 scenario (Online/LAN) where one player controls the Survivors and another player controls the Infected. The Survivors must reach the extraction zone and the Infected must stop them by spawning various types of Infected around them. Will the survivors reach their extraction zone alive and well or will they be devoured along the way? It's up to you!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Endless Loop Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14922,"name":"Survivalist","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/652/6521d433f358eb77819ae611dc403c8c.jpg","description":"It's one year after the collapse of civilization and self-centered hedge fund manager Joe Wheeler emerges from his specially constructed bunker in search of food.  This is a huge open-world Role Playing Game where you have the freedom to play how you want - but your choices have consequences.  Your aim is to find other survivors, gain their respect, and build a community.  You'll scavenge for supplies, trade, plant crops, go on quests, face moral dilemmas, go to war, and uncover dark, terrible secrets!\nInnovative dialog system with characters that remember your actions and form their opinion of you accordingly.\nCombines Action-RPG and Real-Time Strategy elements - you can take control of, or issue commands to, any character that joins your community.\nFast zombies and challenging combat that requires you to make use of all resources available to survive!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bob the Game Development Bot","platforms":[{"id":0,"name":"PC"}]},{"id":12300,"name":"Teddy Floppy Ear - Kayaking","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f12/f1256901fe7ba1fd8067e289a3eaccc8.jpg","description":"Send your kid onto an unforgettable journey with the world’s most charming bear.\nBased on a famous Polish cartoon, Teddy Floppy Ear stands out as a great entertainment for children. Prepared by an experienced team, Teddy Floppy Ear – Kayaking mixes fun adventure game with a healthy dose of learning, perfect for young minds.\nIn this episode our main character takes advantage of beautiful, spring weather and goes on a kayaking trip with his friend Piglet. There he finds out that there is a problem with Mr. Catfish who acts a little too bossy, and needs to be taught a lesson in kindness. During his trip, our hero solves numerous puzzles testing child's mathematical skills, eye-hand coordination, logical thinking and perceptiveness.\nBeautiful hand-painted graphics, soothing music, entertaining and violence free story keep your child occupied for hours.\nFeatures:\n- A dozen of colourful locations\n- Educational value\n- Great for even the youngest kids\n- Absolutely no violence\n- Numerous mini-games for variety\n- Soothing music\n- Famous Teddy Floppy Ear","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":12076,"name":"Destination Sol","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48f/48f6c31191af6cc51362839998c3c3bc.jpg","description":"Destination Sol is Open source!Destination Sol is an open source game, if you would like to contribute to the game go here\nAbout the GameDestination Sol is an open-source, free-to-play hardcore arcade/RPG. You start as a pilot of a small fighter ship on the edge of a star system, and you're free to explore the game world, land on planets, fight with enemies, upgrade your ship and equipment, hire mercenaries, mine asteroids, and more.Key Features:Randomly generated open world, consisting of 2 star systems, planets, asteroid belts and mazes.\nAbility to seamlessly land on planets.\n3 planet types.\nEnemies of many different types, ally fighters, traders, outposts.\n6 ship types to pilot.\nOver 50 items to equip -- weapons, shields, armor.\nOpen Source\nAndroid version is also available on our web site.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MovingBlocks","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5511,"name":"Army of Two","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/741/741b52ef5edae767125c07400fadf62e.jpg","description":"It will take an Army of Two™ to stop the corruption of rogue private military corporations. Fight alongside your teammate to become the deadliest two-man military outfit a government can buy. The breakthrough gameplay in ARMY OF TWO™, with a live or adaptive AI partner, enables you to take advantage of two-man strategies like customizable weapons, vehicles, and tactical shooting.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":19702,"name":"Eurofighter Typhoon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/028/0281b361a283d1cc5e70f199d5fe28db.jpg","description":"In Eurofighter Typhoon, you are flying the famous Eurofighter on top of Iceland to fight against Russian troops which invade the country and prevent the outbreak of World War III. Quickly outnumbered, the ICEFOR has been abandoned by NATO but has been able to deploy a small number of the new Typhoon aircraft. You will take over the destiny of 6 pilots, each with his own skills and abilities, in real time. Take your part in a fascinating scenario with a lot of missions and objectives to achieve!\nEvery steering aspect has been simplified to make this game handable for every one. Eurofighter Typhoon is a simulator game advised to hardcore players who already have played other simulator games and to beginners!FeaturesA visual and sonorous atmosphere which are part of the game, with sound themes adjusted to every situations and impeccable sets and planes modeling.\nA fascinating scenario, with breaking news on radio to keep you aware of the fight evolution!\nA great lifetime: training mission, two campaign modes, a multiplayer mode.\nA game for every fan of simulation and for beginners!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rage Software","platforms":[{"id":0,"name":"PC"}]},{"id":16555,"name":"Elements II: Hearts of Light","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55d/55d5e418007c0913da1ddbd0abb8869f.jpg","description":"\"What of their descendants? What of the other Saints? The full story has yet to be told...\"\nA mysterious little girl. An insidious plot to resurrect a great evil. The legend of a faint and fading hope. And a band of young heroes desperate for answers.\nFans of the original will discover enhanced gameplay, a more beautiful world, a deeper party system, and darker mysteries. To everyone else... welcome.\nSet 360 years after \"Elements: Soul of Fire,\" an age of political unrest and religious intolerance forms the backdrop for the next chapter in the story.\nThe start of a brand-new chapter in the Elements saga!\nNew approachable \"Easy Mode\" for beginners\nHighly customizable gameplay system\nComprehensive enemy encyclopedia\nQuest-tracking interface\nQuick menu shortcuts all across the keyboard\nCraft weapons, armor, and jewelry\nBuild your friendships to learn skills and combos\nLearn new magic by equipping shards that you find\nElemental strengths fluctuate with the days of the week\nMoral attributes determine the growth of your stats\nA message from the developer:\n\"Originally conceived over 15 years ago, the Elements series tells a story of hope, love, and unity while exploring the full range of human emotion and psychology. Personal empowerment is also a central theme, and it's my hope that people can be encouraged and inspired by the morals and allegories presented.\nEach installment is an epic in and of itself, consisting of no fewer than 20 main characters and sweeping quests through massive worlds. All of the writing, art, and design is done by myself, with my father and I collaborating on the music. The first game took seven years to create, from 2006 to 2013. I knew the sequel might take a long time as well (especially because I'm redoing all the graphics), and I didn't want to lose the audience from the original, so I struggled to find a way to sustain interest during the development process.\nFor awhile, I considered releasing \"E2\" episodically, which would've been a technical nightmare (hence why I didn't do it). After some discussion, my publisher and I determined that Early Access is the best option, given the scope of the project and long-term commitment involved.\nIt's always been my desire to have a personal relationship with fans of my work, and I'd hope that the hands-on aspect of Early Access would facilitate that. In addition, as with \"E1,\" I've included a Sketch Gallery with over 70 pieces of artwork, so you can see how my ideas and personal style developed over the years.\nRelease-wise, I would like to aim for two or three updates a year over a period of two or three years (or until the game is finished), consisting of successive \"chapters\" in the story; usually comprised of the next island to be visited. I feel this is better than more frequent, but smaller updates; in addition to allowing myself more \"breathing room,\" so to speak (very important), there can be a sense of completeness to each \"chapter\" this way, while still leaving you to wonder what might happen next... kind of like continuations of a serial drama, or even \"episodes\" if you will (only you're not being charged for each one).\nThe message of Elements has the spark to ignite a movement. The nature and scope of that movement, and whether or not it gets ignited in the first place, is wholly up to those who receive it.\nI hope you will support me in realizing the full extent of my vision, the vision I've dreamed of since my childhood. You'll be taking part in something truly special. Thank you.\nWith all the love in my soul,\n~ Jeremy Zink\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Soul Catapult","platforms":[{"id":0,"name":"PC"}]},{"id":14772,"name":"Mad Games Tycoon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/330/330e3a85d04674f11aa3dbeb259c93de.jpg","description":"BUILD UP YOUR OWN GAMES EMPIRE\nForm your own game studio in the early 1980s starting in a small garage.\nDevelop your own game concepts, create a team and develop megahit video games.\nResearch new technologies, train your staff, upgrade your offices, moving up to bigger and better locations.\nExpand your business and dominate the world market for video games!\n• Manage the various aspects of your company\nFrom being able to produce your own games in-house to buying up your competitors, the game\nallows for total control of your game company and the direction you wish to take it in.\n• Develop the games of your dreams\nYou are given the freedom to develop the game of your dreams.\nDevelop or buy a someone else's game engine and create a simple Platformer or the next\nbig MMORPG. You can set your main focus on graphics, sound, technique and gameplay.\nChoose between core and casual gamers as the targeted audience for your game.\nShould your game have Copy Protection? Want to use an offical Movie License for your game?\nThis only a few of the possibilities for you to develop your own groundbreaking, best selling game.\n• Build your office from scratch\nYou can arrange your office by your own imagination.\nBuild development, server, training, or production rooms and your own executive office.\nPlace some desks, cabinets and plants to keep your employees happy.\nThere are a lot of objects and rooms to create a personalized and effective office.\nBuild a customer support office to keep the fans happy, build warehouses and production rooms to\nmake and produce your own games in bulk, setting the prices and deciding what to include.\nFEATURES\n• Start your own game development studio\n• Create your own dream games\n• Build multiple development rooms and become a prolific game studio!\n• Buy out your competition, make improvements and have them make games for you.\n• Cut deals with publishers or produce your own\n• Show your new hit games off at the games convention to attract fans\n• Tons of genres, features and topics\n• Research new technologies\n• More than 120 different game screenshots\n• Hire game design legends\n• Train your employees and make industry defining games\n• Create a next-gen engine and sell it to other companies for profit\n• Buy new and larger office buildings\n• More then 100 licenses to base your games on\n• Develop and sell your own AAA Engine\n• Produce a next-gen game console","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Raylight Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":11819,"name":"Bloody Trapland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29a/29a9444a9aa3416d13c4c8cb478ffb90.jpg","description":"Now with Level Editor!\nBloody Trapland is a fast-paced multiplayer platformer where the levels are filled with dozens of dangerous traps and tricky jumps that stand in your way!\nPlay co-op with your friends or take on the challenges on your own. With support for up to 4 players at once, local and/or online.\n100+ levels.\n1-4 Players.\nOnline Multiplayer\nLevel Editor, Share and play your creations with friends.\nThree different game modes.\nco-op only and secret areas.\nOnline scoreboard.\n4 playable characters.\nUnique soundtrack.\nHours and hours of gametime.\nThis is a challenging, yet simple game that anyone can enjoy, whether you're a casual or a hardcore gamer.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2Play","platforms":[{"id":0,"name":"PC"}]},{"id":8000,"name":"Hack, Slash, Loot","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ba/4ba6550f212bf9e826b5a2122e43f3e8.jpeg","description":"There are dark places in the world inhabited by evil denizens. Places filled with danger and foreboding where no ordinary man would dare to journey. However, there are a few who are willing to risk death in the name of good, in the name of justice, in the name of.. valuable loot!\nHack, Slash, Loot is a single-player turn-based dungeon crawler. Take control of a lone hero and explore sprawling dungeons, fight dangerous monsters, and most importantly, plunder valuable treasures. With a new dungeon created every game you can be sure that no two playthroughs will ever be the same. Boasting easy to master controls you'll be adventuring in no time, but there is still enough depth to challenge the most hardened of adventurers. Key Features32 characters to unlock and play\nSix distinct quests requiring different tactics to beat\nThousands of items, monsters, and dungeon features\nStreamlined roguelike gameplay with a modern control scheme\nCute retro stylings, daemon ogres have never looked so quaint\nHacking!\nSlashing!!\nLooting!!!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"David Williamson","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":2356,"name":"Odin Sphere Leifthrasir","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/886/886e7e47b2a450a8c4c39f1aa13e7416.jpg","description":"The storybook opens once more…\nWelcome to the lavishly illustrated world of Odin Sphere Leifthrasir!  Lands of snow, emerald forests, and chasms of fire beckon you toward a story waiting to be unveiled.\nIn Odin Sphere Leifthrasir, experience the world of Erion as it hurtles towards the end of days as warring kingdoms clash for control. Take control of the magnificently hand-rendered characters in this enchanted realm, filled with mythical beasts and gargantuan monsters. Five character plots intertwine with each chapter centering on a unique protagonist and their struggles.\nCompletely re-drawn graphics and re-designed gameplay make this beloved 2D action RPG feel brand new! Choose Refined Mode to play the game with more scenes, new monsters, and an updated battle system. Or, revisit Classic Mode to experience the 2007 version of the game with updated graphics.  Whichever mode you choose, you’ll be able to fully experience the intricate plots and breathtaking art.\n1 player\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© ATLUS. © SEGA. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":683246,"name":"Hero's Hour","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81b/81bc8509f69be0e0d81caceab71df17d.jpg","description":"Hero's Hour is an accessible, yet-deep and content-rich Strategy Roleplaying Game. Take control of your hero, explore the world, build up your town, fight fast-paced battles, level up your hero and amass an army large enough to take out the opponents - before they take you out.Turn Based + Real TimeWhile exploring the overworld and developing your town and army are both turn-based, giving you time to think and plan out your next moves, in battles your units will do the best to fight for themselves in real time - all hundreds of them. Cast spells and give attack orders to swing the tide of battle - or just sit back and watch as your might unfolds.\nProcedural GenerationHero's Hour brings impactful procedural generation to the strategy game formula, ensuring that every time you play, there will be new areas to explore and strange buildings to enhance your hero or army. Seek out obelisks to start you on small procedural quests that send you around the world. You won't even be able to use the same build order each time you play the same faction.Features10 factions with special mechanics, strengths and weaknesses\n20 hero classes, with a special skill each\n36 common hero skills\n134 units (without counting upgrades)\n70 unique unit abilities\n145 artifacts\n75 spells & abilities\nDozens of impactful map buildings\nLocal \"hotseat\" multiplayer\nCo-op with other players or even with the AIThere's a lot of stuff in this little game!\nBeing on the faster side compared to other turn based strategy games, you may even be able to finish the hotseat games that you start!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Thingonitsown","platforms":[{"id":0,"name":"PC"}]},{"id":20661,"name":"Aveyond 3-2: Gates of Night","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5f/c5f953dd0760de2f962779a40b949e58.jpg","description":"Chapter 2 in a four-part series! A vampire mage has acquired a magical relic with the power to enslave humanity. Are you brave enough to stop him? Take to the high seas and explore a massive world. Your goal: unlock the gate to Naylith, a mystical land filled with ancient knowledge, and the answer you need to defeat the vampire.Games that have been released in the series:Aveyond: Lord of Twilight (DOWNLOAD HERE)\nAveyond: Gates of Night (DOWNLOAD HERE)\nAveyond: The Lost Orb (DOWNLOAD HERE)\nAveyond: The Darkthrop Prophecy (DOWNLOAD HERE)Features:HUMOR. Lots of it. Humor is the core of Aveyond. You will laugh... or else!\nMassive world filled with loads of monsters, loot, and civilizations.\nSteal a pirate ship!\nLearn to speak Orc.\nOpen the portal to the Fairy Realm.\nFind the hidden world of Dragons and try not to get eaten!\nTravel with a large party of friends. Pick your leader and your fighters for turn-based battles.\nSeek out special academies to learn skills like climbing so that you can explore new areas.\nHelp Edward, one of your party members, find a wife or face the wrath of his mother.\nGive or steal from temples.\nObtain a magical sword that can have its properties changed by the gem you put in its hilt.\nAwesome music brought to you by an award-winning musician who has the entire Final Fantasy music library memorized.\nFor the lazy: find the secret treasure caves and equip your heroes with mega weapons, gold, and level ups.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Amaranth Games","platforms":[{"id":0,"name":"PC"}]},{"id":19605,"name":"Railroad Tycoon 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2c/d2cadf03e51279f747c453310bc22cb2.jpg","description":"Railroad Tycoon 3 features 25 scenarios challenging players to recreate magnificent feats of railroading history from around the world. Players can lay track (including tunnels and overpasses), pick from over 40 locomotives from early steams to modern bullets, choose to haul over 35 types of cargo in a dynamic economy, and participate in an advanced stock market.\nThe new 3-D engine takes the franchise to the next level, allowing smooth scaling from an 'eye in the sky' view of an entire continent down to super detailed close-up of a beautifully modeled train, building, or just the landscape.\nRailroad Tycoon 3 also includes more multiplayer support than its predecessor, integrating an on-line chat and matchmaking service. To top everything off, the game's soundtrack features another installment of some of the best authentic blues, bluegrass, and Americana music around.\nMultiplayer available in LAN mode only.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"PopTop","platforms":[{"id":0,"name":"PC"}]},{"id":16454,"name":"Sniper Elite: Nazi Zombie Army 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d0/0d0d6363d25e0c1d5bf0cb372c00396b.jpg","description":"** Please note: a remastered and improved edition of this game is now available in Zombie Army Trilogy.**\nExperience a terrifyingly intense co-op campaign for up to four players in this gut-wrenching sequel to Steam best-seller, Sniper Elite: Nazi Zombie Army.\nWith World War 2 Europe overrun by legions of the undead, you must find mankind’s salvation deep in the twisted bowels of Berlin by securing the sacred artefacts that unleashed this damnation. Every step must be paid in blood as players work together against impossible odds and descend further into the demon-infested city and the terrifying Führerbunker itself.\nTackle the campaign online in co-op for up to four players, or embark on the twisted missions alone if you’ve got the bottle.\nFeaturing new enemies, new environments, blood curdling surprises and the return of the infamous X-ray kill cam, Sniper Elite: Nazi Zombie Army 2 will satisfy even the most bloodthirsty of zombie hunters.Key Features\nNew campaign. New terrors\nSurvive an all new stand-alone campaign for up to four players.\nEndure increasingly hellish new locations and oppressive environments.\nConfront blood-chilling new enemies including the Fire Demon, and Summoner.\nNerve-shredding third-person combat\nExperience the trademark sniping, blood-pumping sieges and co-op team play that made the original Nazi Zombie Army a Steam best-seller.\nRevel in the return of the infamous X-ray kill cam as your bullets purify the putrid insides of the undead in slow motion.\nDefy the odds and survive against overwhelming hordes with traps, explosives and powerful new machine-gun turrets.\nMore thrills. More blood spilled\nRecoil at grotesque new enemies, effects and tense new cinematics.\nSavour the all-new Carpenter-esque soundtrack inspired by slasher-horror cinema.NotesThis is a stand alone game. It does not require Sniper Elite V2 or Sniper Elite: Nazi Zombie Army to play!\nSteam keys will not activate in Germany","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":10872,"name":"Battle Brothers","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/299/2992286207c0b8da1b9fca2d78290b49.jpg","description":"What's in the Supporter Edition?For those of you who really want to support us for developing this game, and in developing further games, we also offer the Supporter Edition. Like the Deluxe Edition, this includes both the game itself and the soundtrack. In addition, you get a digital art and lore book with a lot of background info about the game, its art and its creation, as well as our very first legendary item in the game, complete with a look of its own and a unique background story: Fangshire.\nAbout the Game\nBattle Brothers is a turn based tactical RPG which has you leading a mercenary company in a gritty, low-power, medieval fantasy world. You decide where to go, whom to hire or to fight, what contracts to take and how to train and equip your men in a procedurally generated open world campaign. Do you have what it takes to lead them through bloody battles and to victory?\nThe game consists of a strategic worldmap and a tactical combat layer. On the worldmap you can freely travel in order to take contracts that earn you good coin, find places worth looting, enemies worth pursuing or towns to resupply and hire men at. This is also where you manage, level up and equip your Battle Brothers. Once you engage a hostile party the game will switch to a tactical map where the actual fighting takes place as detailed turn based combat.\nManage a medieval mercenary company in a procedurally generated open world.\nFight complex turn-based tactical battles with historical equipment and brutal injuries.\nPermadeath. All characters that die in combat will stay dead – unless they return as the undead.\nAll characters come with their own background stories and traits. Want a stuttering ratcatcher, a greedy witch hunter or a drunkard disowned noble?\nCharacter development without a restrictive class-system. Each character gains experience through combat, can level up and acquire powerful perks.\nEquipment that matters. Different weapons grant unique skills – split shields with axes, stun enemies with maces, form a spearwall with spears or crush armor with a warhammer.\nDiverse enemy roster. All enemies have unique equipment, skills and AI behavior.\nA dynamic event system with atmospheric encounters and tough decisions outside of combat.\nThree late game crises – a war between noble houses, a greenskin invasion and an undead scourge – add a looming threat.\nTwo full hours of orchestral soundtrack.\n70 Steam Achievements and Steam Trading Cards.\nOverhype Studios is an independent game developer studio from Hamburg, Germany. We are devoted to making great games that we want to play ourselves. With Battle Brothers we thrive to reflect the creativity, complexity and originality from the old days when game developers where passionate gamers, not corporate businessmen. While doing this we took a lot of inspiration from some of best games out there: The original X-Com, Warhammer: Shadow of the Horned Rat, Mount & Blade and Jagged Alliance.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Overhype Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5561,"name":"F1 2011","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b8e/b8eafe5f46273770f9d4ea249da3aa60.jpg","description":"The official FORMULA ONE™ game returns with new circuits, split-screen and co-op Championship modes plus all the cars and stars from the 2011 season. Debut ahead of the drivers at India’s Buddh International Circuit, race the iconic Nürburgring  circuit for the first time in High Definition and take on Abu Dhabi with a spectacular new day night transition. Use KERS and DRS to blast past rivals and race wheel-to-wheel against Lewis Hamilton, Fernando Alonso and Sebastian Vettel. Go from Rookie to 2011 FIA FORMULA ONE DRIVERS’ WORLD CHAMPION in career mode, set your best lap in Time Attack or test yourself online against 16 players plus 8 AI to simulate a full 24 car grid. Off track, become immersed in the world’s most glamorous sport with enhanced media interaction, expanded Paddock, new Parc Ferme area and celebration animations. F1 2011™ - be the driver, live the life – go compete!\nKey Features\t\t\t\t\t\t\t\t\tThe sequel to the BAFTA award winning 2millon+ seller F1 2010™\nGo compete in split-screen, co-op Championships and online against 16 players plus 8 AI to simulate full 24 car grids\nFeatures all the stars, cars and circuits from the 2011 FIA FORMULA ONE WORLD CHAMPIONSHIP™\nDebut ahead of the drivers at India’s Buddh circuit and take on the Nürburgring  for the first time in High Definition in a FORMULA ONE game\nUse KERS and DRS for new attack and defense options – blast past rivals and defend your line\nBe the Drive, live the life – new Parc Ferme area, enhanced media interactions, new celebrations and more immerse you in the world’s most exciting sport.\nRace wheel-to-wheel with stars like Sebastian Vettel, Lewis Hamilton and Fernando Alonso\nGo from Rookie to 2011 FIA FORMULA ONE DRIVERS’ WORLD CHAMPION in career mode or take on quick fire modes including Time Attack.\nFeatures new Pirelli tires, flashback and new authentic engine damage","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Codemasters","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":4499,"name":"Sports Champions","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69f/69f29aaf9a4d95ef7a2c942a3152f7f8.jpg","description":"Sports Champions™ will let you and your friends physically engage in an array of competitive sporting activities as you go head to head in six events. With the easy to use PlayStation®Move motion controller, anyone ca n crush, spike and smoke the competition in the ultimate sports showdown.\nKey Features:\n- New PlayStation®Move controller allows players to engage in actions such as pulling a bow, lunging forward with a sword, or perfectly tossing a disc into the goal several hundred feet away to score the big win!\n- Play a wide range of exciting sporting activities that include Disc Golf, Gladiator Duel, Beach Volleyball, Archery, Table Tennis and Bocce.\n- Champion Cup Mode: Compete in the bronze, silver, and gold cups to unlock hundreds of prizes.\n\n- Free Play Mode: Jump in to play casual matches against other players or the CPU with your choice of options.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item.\nOne-time fee for downloads to up to two systems that are associated with the purchasing account. Sports Champions is a trademark of Sony Computer Entertainment America LLC. © 2010 Sony Computer Entertainment America LLC.The PlayStation®Move motion controller(s) and the PlayStation®Eye camera are required (both sold separately).","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":1660,"name":"Sentinels of the Multiverse","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/486/486d6893612ce3c479d4f4bc773f5f77.jpeg","description":"Calling all Sentinels! Do you have what it takes to defend the Multiverse? Compose a team of comic book heroes, each with their own playstyles, backstories, and grudges. Pit them against a variety of maniacal and formidable villains. Defeat your enemies and save the Multiverse!\nSentinels of the Multiverse is the award-winning game in which players join forces as heroes to combat a dastardly villain in a dynamic environment.\nThe digital version of Sentinels of the Multiverse plays like a comic book come to life! Control an entire team of heroes in single player, or head online and join heroes from around the globe in multiplayer. This is cooperative card-battle like you’ve never played before!\nThe rules of the game are deceptively simple: Play a Card, Use a Power, and Draw a Card. What makes Sentinels of the Multiverse unique is that each card has special abilities that can create powerful combos or even change the rules of the game!\nThis digital version includes all content from the Sentinels of the Multiverse core game:\n10 Heroes: Absolute Zero, Bunker, Fanatic, Haka, Legacy, Ra, Tachyon, Tempest, The Visionary, & The Wraith\n4 Villains: Baron Blade, Citizen Dawn, Grand Warlord Voss, & Omnitron\n4 Environments: Insula Primalis, Megalopolis, Ruins of Atlantis, & Wagner Mars Base\nIt also includes several unlockable variant cards:\nVariant heroes with alternate powers and backstory\nVariant villains bring an all new twist on the battle\nAll are unlockable via secret Sentinels storyline-based challenges!\nExpansion packs that add new heroes, villains, and environments are available as downloadable content via Steam.\nSeason Pass 1 includes the first 4 expansions and 3 mini-packs. Save money and get all the content!\nMini-Pack 1 includes Unity, Ambuscade, and Silver Gulch, 1883.\nRook City includes Expatriette, Mr. Fixer, The Chairman, The Matriarch, Plague Rat, Spite, Pike Industrial Complex, and Rook City.\nInfernal Relics includes The Argent Adept, NightMist, Akash'Bhuta, Apostate, The Ennead, GloomWeaver, Realm of Discord, and Tomb of Anubis.\nMini-Pack 2 includes The Scholar, Miss Information, and The Final Wasteland.\nShattered Timelines includes Chrono-Ranger, Omnitron-X, La Capitan, The Dreamer, Kismet, Iron Legacy, The Block, and Time Cataclysm.\nWrath of the Cosmos includes Captain Cosmic, Sky-Scraper, Deadline, Infinitor, Kaargra Warfang, Progeny, Dok’Thorath Capital, and The Enclave of the Endlings.\nMini-Pack 3 includes Guise, Wager Master, and Omnitron-IV.\nSeason Pass 2 includes the final 3 mega-expansions and 2 mini-packs as they become available.\nVengeance contains 5 heroes, 5 team villains, and 2 environments.\nVillains of the Multiverse contains 10 team villains and 4 environments.\nEvery rule & interaction in the game has been carefully adapted and thoroughly tested by expert Sentinels players, as well as the designer himself. If you’re wondering how a certain situation works in SotM, this game is the ultimate rules lawyer!Features Original music brings the Multiverse to life like you’ve never heard before. Rock out to the official Sentinels Theme Song, ambient tracks for each environment, and ending themes for each villain.\nBeautifully rendered environment backdrops put you right in the action.\nBrand new artwork for every Hero and Villain in the game, created by Sentinels of the Multiverse artist Adam Rebottaro himself.\nOver 9,000 different potential battles to choose from by combining the 10 Heroes, 4 Villains, and 4 Environments.\nPlay a solo game with three to five heroes, or pass & play with your friends.\nCross-platform online multiplayer with friends and others from around the world.\nSentinels of The Multiverse: The Video Game is an officially licensed product of “Sentinels of the Multiverse®” from Greater Than Games LLC.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Handelabra Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":899,"name":"BlazBlue: Central Fiction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf5/cf58007875bc4b41fc78a93bbffb01ed.jpg","description":"BlazBlue: Central Fiction is the newest installment in the storied BlazBlue franchise and stands alone as the pinnacle of next gen 2D fighters! Like a well-timed 2D punch, BlazBlue: Central Fiction bashes massive amounts of content and innovation into one slick title that hits hard and keeps the pummeling steady!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Arc System Works","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":528689,"name":"Nomads of Driftland","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e33/e33ab0ebdf628a5daa59ead438813661.jpg","description":"Check our games!https://store.steampowered.com/app/1436970/Nomads_of_Driftland_The_Forgotten_Passage/\nhttps://store.steampowered.com/app/718650/Driftland_The_Magic_Revival/\nhttps://store.steampowered.com/app/1169740/Danger_Scavenger/\nAbout the GameThe promise to restore civilization to its former shape and return to the times of splendor overcame sadness. It filled the hearts of Driftland's inhabitants with new hope and energy. Determination for action diverted attention from the numerous conflicts between quarrelsome mage-rulers and various injuries sustained by those who did not give in to their will.\nOutlaw rebels, by the mage-rulers called Nomads, are exterminated and treated as barbarians. They believe that the new order is an attempt to restore balance in shape that has once destroyed the planet.\nNow, the Nomads must fight to defend their values and survive.About the gameNomads of Driftland is an RTS game initially created as an add-on to Driftland: The Magic Revival. Since it is significantly different from the base game, we decided to release it as a standalone expansion and make it available for free.\nBase game - Driftland: The Magic Revival is a unique fusion of RTS, 4X strategy, and Sim genres in a fantasy world made up of the shattered planet. The player takes on the role of a powerful mage-ruler capable of moving and reshaping parts of the planet. Both game mechanics and history are based on an innovative concept of dynamic topography and issuing orders to individuals with free will.\nNomads do not have a ruler and do not carry out orders like other races in the base game. Units are managed directly, like in classic RTS games. New unit types/classes affect strategy on the battlefield.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Star Drifters","platforms":[{"id":0,"name":"PC"}]},{"id":455599,"name":"Rocket Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/69d/69d984a5952c3f471792abf19606533f.jpg","description":"Welcome to a world where the rules are written in rocket fuel.\nRockets rule everything in Rocket Arena, an explosive 3v3 shooter where you’re never out of the action. Master your hero’s unique rockets and abilities to rule the arena and become a champion! Adapt your strategy with an ever-growing roster of diverse heroes with distinctive powers. Unearth new strategies and tactics based on your squad, explore a wide variety of dynamic maps, and discover the true depth of rocket gameplay.\nReady to roll? Pre-Order now to get the Epic Roller Derby Rev Outfit\nRocket-Fueled Heroes\nExplore a growing roster of unique heroes, each with distinctive personalities, backstories, and rivalries. Master your hero’s powerful abilities and signature rockets and get the most out of your squad.\nDeath-Defying Action\nNever say die, because in Rocket Arena, you can’t! Taking too many hits will blast you out of the arena, but not out of the action. Ride your rocket right back in, choose your landing spot, and return to the fight.\nReach New Strategic Depths (and Heights)\nRockets are easy to pick up but challenging to truly master. Learn how to time your dodges, lead your targets, and use well-timed items and gadgets like the Rocket Magnet, Trip Mine, and Speed Boost to change the course of combat. Become one with your rocket and you will rule the arena.\nExplore a Bold New World\nFrom tropical ruins of The Gemstone Jungle to the high-tech, utopian Boom City, the world of Crater is home to many exotic locales. Each map is highly interactive and filled with hidden tricks, traps, and lore to explore. Use your rockets to jump, climb, and interact with the environment. There’s a world of possibility, so grab your rockets and start exploring!\nEvolve Your Heroes\nThe sky’s the limit for your heroes. Every match you play with them earns experience, unlocking Rocket Parts, Totem Parts, and spectacular outfits you can use to customize their look. You’ll also unlock powerful artifacts as you play -- mix, match, and level them up to give your heroes impressive new stat boosts and abilities! You’ll need every edge you can get to rule the Rocket Championship Tour.\nChange the Game\nThere’s more than one way to play. Dive into Knockout for classic 3v3 competitive action, or warm up first against RocketBots and test out your favorite combos. Compete to score goals in Rocketball, control zones in Mega Rocket, and go for the gold in Treasure Hunt. When you’re ready to go rocket-to-rocket with the best, dive into Ranked Play and show ‘em what you’re made of. Let’s Rocket!\n© 2020 Final Strike Games, Inc. [EA and the EA logo are trademarks of Electronic Arts Inc.] Trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Final Strike Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21166,"name":"Eschalon: Book II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b8/1b890226f247f813158f3f766690e59d.jpg","description":"Return to the world of Eschalon in the sequel to 2007's award-winning RPG. The blight of war now threatens all of Eschalon and the only hope for peace lies in the secret of your past. Don't miss this second chapter in the epic Eschalon trilogy given \"5 Stars\" by RPGWatch and called \"immensely appealing\" by The Huffington Post.Key Features:A huge world to explore; you are free to go anywhere and do anything.\nThousands of items, monsters, puzzles and traps await your discovery.\nTurn-based action happens at your pace- play it fast and furious or slow and tactical.\nNo experience with Eschalon: Book I is needed to enjoy Book II.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Basilisk Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20357,"name":"Top Trumps Turbo","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77b/77b8084bc77d4c334cc879472438a58e.jpg","description":"The FIRST EVER and ONLY Top Trumps™ Turbo PC Game Available to Download NOW.\nTop Trumps™ Turbo is a brand new, exclusive fun and exciting Top Trumps™ card game brought to you by Funbox Media. Use the cards and your skills to beat the computer and become the ultimate Top Trumps™ Turbo Champion! Play, win & enjoy this action-packed game with your favourite decks, regularly updated packs, stunning gameplay and a great atmosphere for the whole family to enjoy.\nSpin the spinner to choose from 6 different mini games and fill your turbo bar with stars and enter into the Turbo final for a gripping head-to-head match. Collect more decks by downloading them and use your knowledge of the card statistics to win. Gain achievements by winning mini games and keep track of your stats to make sure you are the ultimate Top Trumps™ Turbo Champion!\nYou may well have only just discovered Top Trumps™ but believe it or not, the original Top Trumps™ card game is over 35 years old. The new look Top Trumps™ Turbo PC game will indulge you into a totally new experience where you will enjoy a variety of favourite decks available.  Using the card statistics you have to beat the computer and become the Turbo champion! Chose your favourite deck, spin the spinner to choose from 6 different mini games and enjoy the Top Trumps™ challenge.  Fill your Turbo bar with stars and enter into the Turbo final for a final head-to-head match. Enter the hall of fame with your achievements by winning mini games and keep track of your stats to make sure you are the ultimate Top Trumps Turbo Champion!\nTest yourself – how well do you know your facts about Pop Stars, Cartoons, Pre Historic Animals, Geographical objects? Are you going to be lucky enough to get some free stars? Or perhaps you will have a chance to steal few stars from the opponent? Play, win and enjoy the fame of becoming the ultimate Top Trumps™ Turbo Champion.FeaturesPlayers can build their own collection of decks.\nSingle Player mode vs. AI\nRegular deck updates in the store.\nStatistics and Achievements.\nIndividual Card and deck viewing options","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NYX Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18858,"name":"Montaro","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/101/101918027b51efecf26466a313729f8f.jpg","description":"Montaro is a casual runner game that was created to heal your heart.\n- Random generated street levels.\n- Lift up highschool girl's skirts, protect your doge by panties.\n- Collect Doge coins to unlock over 8 Doge costumes.\n- Doge's emoticons and background.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"JCKSLAP","platforms":[{"id":0,"name":"PC"}]},{"id":12291,"name":"Hunger Dungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e80/e802e9e364991b45e8833d083150cf66.jpg","description":"\"Hunger Dungeon\" is a 1-6 player round-based Multiplayer Online Battle Arena game.\nEnter a cutthroat arena with more than 12 heroes including the Dwarf Forgemaster, Octo Pirate, Princess Ranger, and the Demonic Knight!\nCompete in absolute chaos in Free-for-All or group up and take on other players in classic Team Deathmatch.\nMix and match Spell Scrolls and equipment between rounds to optimize your build (like a MOBA).\nUtilize positive and negative status effects to your advantage!\nOr...for those wishing for a greater challenge. Recruit up to 3 other players to take on Dragon Mode, facing off against one of three powerful element dragons for exclusive rewards!\n*4 randomly-chosen characters are available for free players each week. Premium players can access the original 12 characters permanently.\n\n\n\n\n\nGoblin Profiteer  Collecting Gold increases damage dealt\nCollides with opponents head-on\nOcto Pirate  Leaves a trail of poisonous Dirty Water\nFires a Death Cannon\nPrincess Ranger  Conceals in the terrain\nSets traps to immobilize enemies\nElement Fuse  Temporarily reduces cooldown of Spell Scrolls\nIncreased Mana regeneration\n\n2D top-down battle style - with a pixel-art aesthetic\nFree-to-play - four free players available each week, in-game currency to earn permanent Hero unlocks\nUp to 6 player online matches - Free-for-All and Team Deathmatch\nA roster of distinctive characters - each with unique skills and effects\n30+ Spell Scrolls - fireballs, lightning bolts, and ice bombs devastate your opponents\n40+ items to equip - turn the tide with unique magical equipment with various effects\n40+ stages to explore - battle in lush forests, painful volcanoes, or frozen tundras","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Buka Game Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11077,"name":"The Last Hope","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd7/fd75c9abb92a8a47cbe4072db6a61d4f.jpg","description":"ACHIEVEMENTS are now available!!!Since the release of the game, a lot of users, asked me about steam achivements.\nBecause of some problems with game engine, achivements couldn't be realized\nBut today i'm happy to annonce that 10 game achivements are available for all!!!\n- How hard is to get them?\n- From Very easy to Hard, it's VERY EASY\nhttp://steamcommunity.com/stats/522570/achievements\nAbout the GameYou are a scientist who was working on the development of a time machine. When the experiment began, a wormhole was formed and mankind and most of wildlife disappeared. Now you are humanity's last hope because you the last man alive. Your mission is to find the time machine .Therefore you will have to explore Russia, Germany, Norway, Egypt, U.S. ,Mars and Moon. Use portals because these can teleport you in differents ages from the Age of the Dinosaurs to our Era. But a problem that you will face is to survive. You will have to find resources like fish, fruits, beer , vodka, water because these will help you to stay alive. Also transport like cars, boats, airplanes and rockets will help you to travel faster. Save the mankind and became it's president!\nKey features:\n•\tTravel through different Eras of time;\n•\tFind resources like fruits,fish,beer,water and more that will help you to stay alive;\n•\tExplore countries like Germany,Russia,US,Norway,Egypt,United Kingdom;\n•\tTravel with the rocket through space especially on Moon and Mars;\n•\tBe pilot,driver or sailor;\n•\tFace different kinds of creatures;\n•\tSave the mankind and become its president.\n•\tBeautiful soundtrack(each country include up to 6 music specify to that country)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Atomic Fabrik","platforms":[{"id":0,"name":"PC"}]},{"id":4219,"name":"Medal of Honor: Warfighter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92e/92e1a182fc8eda23da91f6a0c9ccd5c6.jpg","description":"MEDAL OF HONOR™ WARFIGHTER is a First-Person Shooter featuring covert Tier 1 military operative combat. The game is a sequel to the 2010 release, Medal of Honor, which moved the long-running game series from its roots in WWII based gameplay, into modern warfare scenarios and true-to-life conflicts. The single-player campaign features mission play involving returning characters ''Mother,'' ''Preacher,'' ''Voodoo'' and others in operations after their service in Afghanistan. Multiplayer modes include 2-20 player support in which players have the ability to play as one of 13 real special ops units, from 10 countries.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\n© 2012 Electronic Arts Inc.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":943,"name":"Farming Simulator 17","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb1/cb1da1bb1de3209b4cb540b11c6eebe0.jpg","description":"THE MOST COMPLETE FARMING SIMULATOR EXPERIENCE\r\nTake on the role of a modern farmer in Farming Simulator 17! Immerse yourself in a huge open world loaded with new content: new environment, vehicles, animals, crops and gameplay mechanics!\r\nExplore farming possibilities over hundreds of acres of land, including a detailed new North American environment. Drive over 250 authentic farming vehicles and equipment from over 75 manufacturers, including new brands such as Challenger, Fendt, Valtra or Massey Ferguson.\r\nHarvest many types of crops, including for the first time sunflowers and soy beans. Take care of your livestock - cows, sheep, chickens and now pigs - take part in forestry, and sell your products to expand your farm! Transport your goods with trucks and trailers, or load and drive trains to reach your destination.\r\nFarming Simulator 17 offers rich online activities: play in co-operative multiplayer up to 16 players, and download mods created by the passionate community for unlimited content and an ever-evolving Farming Simulator 17 experience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":505871,"name":"The Jackbox Party Pack 7","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/754/754682412d9f60949d15b04ff460dd20.jpg","description":"Five new incredible party games to bring the fun!\n1.\tThe say-anything threequel Quiplash 3 (3-8 players). Get big laughs answering the quirkiest prompts.\n2.\tThe collaborative chaos game The Devils and the Details (3-8 players). Can you survive the daily torture of human life?\n3.\tThe drawing fighting game Champ’d Up (3-8 players) . Can you take down the heavy favorite?\n4.\tThe on-the-spot speech game Talking Points (3-8 players). Just keep talking whether it makes sense or not.\n5.\tThe pop culture guessing game Blather 'Round (2-6 players). It’s a good fun time experience.\nPlay using phones, tablets or computers. No extra controllers needed!\nNOTE: The Jackbox Party Pack 7 is in English only.\nNOTE: The game is local multiplayer but can be enjoyed over streams with remote players.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":47613,"name":"Monster Energy Supercross - The Official Videogame","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b0/0b0611eb331285aafb05779d9f76d0b8.jpg","description":"Monster Energy Supercross - The Official Videogame\nLive the adrenaline and the excitement of the 2017 Monster Energy Supercross Championship with MONSTER ENERGY SUPERCROSS - THE OFFICIAL VIDEOGAME!\nRace with the official riders from 250SX and 450SX on the official tracks, Daytona included, to experience one of the most spectacular and entertaining racing competition ever!\nDiscover the Track Editor feature for endless gameplay possibilities: select your stadium, create your own track and share it online with your friends.\nCustomize your rider and bike as you like, with countless possibilities, with more than 80 official brands and 300 items available, and challenge yourself in conquering the top of the leaderboard.\nRace alone or against players from all over the world thought different offline and online game modes!\nFeel the rush of adrenaline, enter the arena and be the King of Supercross!\nKEY FEATURE POINTS:\nThe official 2017 Monster Energy Supercross Season.\nOfficial bikes, iconic tracks, like the legendary Daytona, and athletes from both 250SX and 450SX Classes.\nA powerful track editor, for endless gameplay possibilities: create, customize and share online your own tracks.\nAn exciting career mode with extreme customization options for both riders and bikes.\nTop notch graphics for a world-class game quality and a next-level immersive experience with an accurate reproduction of tracks, accessories and athletes’ aspects.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Milestone","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":20236,"name":"Incitement 3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a78/a78f28123df6cf5ab9425f8cd1f3f83c.jpg","description":"General Features:\nA sequel to Incitement and Incitement 2, both of which are free to play.\nApproximately 8-10 hours in length\nAn immersive sci-fi world with a variety of locations to explore\nSide-view battles with fully animated battlers\n11 playable characters: 7 in the main party and 4 episodic\n2 difficulty modes: Normal and Challenging. Normal is for those seeking a casual experience, whereas Challenging is for the thrills and kills.\nHighly customizable equip setup, allowing the use of add-ons on top of standard weapons and armour.\nUse Weapon Add-Ons to customize an offensive bonus on a character.\nUse Body Add-Ons to customize a defensive bonus on a character.\nUse Head Add-Ons to customize which attribute will gain a bonus upon level ups.\nSome abilities require unique ammo, providing a deeper and more interesting ammo management experience.Story:\nSophorian civilization has been long looking for other sentient races in space in order to integrate them into their own society. However, that has not come without dissensions among the Sophorians, and sometimes very violent conflicts. In the recent past two huge attacks had occurred that threatened the whole civilization. The first one struck the government. The second one struck the Sophorian army. But was there a connection between those attacks, and will history repeat itself over and over until there’s no civilization left?\nIt has now been a year since a devastating EMP wave left one of the largest cities broken and disconnected. A lot of labour and resources went into restoring the city over the course of the year, but it appears things are not about to settle down yet.\nAdrial and his team of allies have been caught in another attack - but who is attacking this time and what are their motives? It is now up to you to assemble your allies, uncover this scheme, expose the enemy, and stop them before their actions magnify into catastrophic proportions.Get three games for the price of one! Incitement 1 & 2 are, and always will be, freeware!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Astronomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":17685,"name":"Game Tycoon 1.5","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a0/0a07a9944a1062187fcf51ef05ba2b2e.jpg","description":"Welcome to the Game Industry!\nThe year is 1982. Three young entrepreneurs discover the computer and potential to strike it rich in the Games Industry!  Their love for computer games is a common bond that they all share but they are also in fierce competition with one another in a race to build a successful Games Development House…\nThey quickly find that the Games Development business is not as simple as it appears… Banks, Investors, Magazines, Retailers, Distributors, Manufacturers and the Press are all breathing down your neck...they want results!  Do you have what it takes? You are now an up and a coming entrepreneur in the Games Business.  Do you have what it takes to be the next Game Tycoon?Features Cartoon style graphics\nThree characters to choose from\neleven mission including tutorial as well as a continuous play\nInteractive advisor (when you need advice)\nRealistic strategy game\nDifferent market situations in accordance with the customer's requests of the respective years\nAs the years progress new technological advances offer new game development techniques\nAnimation of all speaking characters\nVoices in English and German\nA lot of laughs and jokes","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sunlight Games","platforms":[{"id":0,"name":"PC"}]},{"id":14288,"name":"fault - milestone two side:above","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a82/a8230721657b4dde3a824b64cd5a2099.jpg","description":"fault - milestone two side:above is a Cinematic Visual Novel that takes place right after the events of milestone one. With the addition of a new 3D camera system, fault -milestone two aims to introduce a more immersive and \"larger than life\" reading experience. Follow the grand science fantasy story of Selphine and the gang as they traverse back to their homeland!\nPlease note that this novel is a direct sequel to fault - milestone one and contains massive spoilers of the first story. Play through of the first title is highly advised. Also please note the demo saves do not carry over and it is recommended to play the beginning of milestone two again as things have been upgraded.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ALICE IN DISSONANCE","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]