[{"id":20830,"name":"Lilly and Sasha: Curse of the Immortals","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/222/2224c466e214cb2bae80f3e2786bf564.jpg","description":"After Sasha is fooled into placing her hand on an ancient shrine, her twin sister Lilly starts noticing a new darker side to her that she has never seen before. After discovering that Sasha's body is slowly being possessed by the immortal Zahhak, Lilly must furiously try to save her!\nIf she fails, she will have to watch as the infinite power of an immortal lays claim to the world once more in Lilly and Sasha: Curse of the Immortals.\nCollect runes and attach them to skills to change their effects in battle\nSolve unique and exciting puzzles in each dungeon\nDetailed quest journal to keep track of quests\nNumerous side quests grant items, levels and secrets\nFind hidden dragon eggs and Immortals symbols for powerful rewards\nCollect pets and have them fight alongside you in battle\nContinue your save file in subsequent Lilly and Sasha games","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"John Wizard","platforms":[{"id":0,"name":"PC"}]},{"id":40468,"name":"Phantasy Star Online 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/296/2960740723535b92b150d7c528b6c661.jpg","description":"Phantasy Star Online 2 is an online action RPG developed and published by SEGA in 2012 exclusively in Japan. It is the sequel to the classic 2000 game Phantasy Star Online.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"}]},{"id":23263,"name":"Chess Ultra","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/413/4137847ceac2a680415f13a4526f72a6.jpg","description":"Introducing the most breathtaking chess game ever made.\nChess Ultra injects the greatest strategy game of all time with a modern twist; offering the ultimate chess experience with stunning 4K visuals, Grandmaster approved AI and full VR compatibility.\nStunning chess sets and beautiful environments\n10 Grandmaster-approved AI levels\nIntuitive, overhauled local and online multiplayer with ELO ranking system\nComprehensive time controls, including Classical, Blitz and Marathon, available online\nCross-platform online play and leaderboards\nSpectate and compete in Official Ripstone tournaments\nDemonstrate your skills in over 80 chess puzzles\nRe-write the past by winning the biggest historic matches\nExport portable game notation (PGN) for every game, locally and online\nFull Twitch integration invites you to play against your community\nPlay in VR and immerse yourself in the Chess Ultra experience\nIn-depth tutorials to help improve your game\nWith full Oculus Rift and HTC Vive support, play Chess Ultra in VR for the most breathtaking chess experience to date. From the wood grains on the antique mahogany board in the library, to the luxury felt on the bottom of every chess piece; chess has never looked this good. Physically reach out to make your move and focus entirely on the game at hand.\nCompatible with Oculus Rift and HTC Vive\nUse Oculus Touch or Vive controllers to reach out and move the pieces\nImmerse yourself in beautiful, ultra-realistic environments\nChange your perspective of each environment by standing to get a better view\nTake the most extreme chess challenge in Gomorrah. Will you survive?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ripstone","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":20523,"name":"Kivi, Toilet and Shotgun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/734/734ae3ce5be960e92808350bfd5ceb4e.jpg","description":"Features Randomly generated environments.\nCar upgrades/customization.\nCharacter upgrades.\nPower-ups\nCharacter mode / car driving mode\nMany cars to choose from\nComic book style cinematics\nKivi, Toilet and Shotgun is being developed by 16bit Nights and published by Back To Basics Gaming.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Back To Basics Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":18739,"name":"AquaNox","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/570/5704ae127ec8e7efea25a3d815f21fbf.jpg","description":"The water is no longer calm.\nThe undersea world has undergone a transformation from tranquil environment to a place of unspeakable violence, graphic murder and horrific danger. It is now the 27th century and mercenaries such as 'Emerald' Dead Eye Flint ply their deadly trade among the warring forces of man and nature. Gamers take the role of Flint, taking command of a loosely aligned force of fellow mercenaries who hire themselves out to the powerful leaders of this inhospitable world. Players fight vicious battles against crazed mercenaries, mighty military forces and hideous sea monsters. The frantic pace never lets up in Aquanox: True adrenaline-rush action for today's gamers.Key features:Mission based action with stunning and violent individual and team-based combat\nSuperbly crafted 3D graphics in a real-time, richly rendered underwater world of steep mountain ranges, intricate caverns, deadly currents and glittering underwater cities\n34 dangerous missions giving hours of action packed gaming\nMultiplayer options for LAN and Internet for gripping deathmatch and team-based battles\nOver 40 incredible enemies and vicious monsters to battle to the end\nAtmospheric 3D soundtrack and music","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":14097,"name":"Sakura Fantasy","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bff/bffa1e2e2617b9a1ed3ef58a9a88b8fb.jpg","description":"The new visual novel from the makers of Sakura Spirit and Sakura Angels.\nSakura Fantasy is an exciting visual novel fantasy adventure where you decide the development of the story by the choices you make.\nIt is the tale of an aspiring female protagonist who wishes to aim to become a knight.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":802584,"name":"Daggerfall Unity - GOG Cut","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/92c/92c15660f548971664fdcc66bf15e729.jpg","description":"Play a reimagined version of the all-time RPG classic from The Elder Scrolls series. Daggerfall Unity – GOG Cut brings this amazing experience to modern gamers. It has been made possible thanks to a whole team of passionate creators working under the banner of Daggerfall Unity.\nBefore / After\nThis ambitious project, launched over a decade ago by Gavin “Interkarma” Clayton, is aiming to bring the unique experience of the classic open-world RPG game to a new generation of gamers. Thanks to the efforts of the GamerZakh, a gaming content creator with a love for classics, you can now enjoy a special GOG Cut of the Daggerfall Unity title.\nAll you have to do is download the game and simply launch it. The GOG Cut of Daggerfall Unity doesn’t require any special actions or updates on your behalf. Thanks to settings and mods that were selected by GamerZakh you can explore the rich world of Daggerfall with enhanced visuals and gameplay.\nHowever, please note that although we find the experience very enjoyable the work on the title is stil ongoing. Some technical issues might occur, so it’s wise to quicksave often (F9) :D\nIf you’re ready for a deep dive into the rich fantasy universe of the game, more titles from The Elder Scrolls series await your discovery on GOG!\nThe ancient golem Numidium, a powerful weapon once used by the great Tiber Septim to unify Tamriel, has been found in Iliac Bay. In the power struggle that follows, the King of Daggerfall is murdered and his spirit haunts the kingdom. The Emperor Uriel Septim VII sends his champion to the province of High Rock to put the king’s spirit to rest and ensure that the golem does not fall into the wrong hands. Daggerfall offers you an opportunity to adventure in total freedom within a world where you destiny is of your own making and consequence evolves from your decisions. A world of love and darkness, magic and sorcery. Whether you choose to follow a quest or to venture out alone, you will interact with thousands of people as you travel across an expansive land in a time of fantasy and imagination.\nThe much-awaited sequel to the critically-acclaimed Arena,  Daggerfall builds on its predecessor in the all the right ways, bringing more content, more stories and more combat. The introduction of guilds and commerce provide you with the means to create your own political intrigue and extend your influence in the world of Tamriel. Also receiving rave reviews at launch, Daggerfall is a must-play for Elder Scrolls and RPG-fans alike.\nAdventure through thousands of cities, villages, farms, ruins, dungeons, graveyards, shrines and castles\nInteract with thousand of characters, both in dialogue and action\nCustomise your character, creating your own backstory, race and class\nParticipate in numerous large-scale, complex quests or venture on your own path\nA multiple path story, with several different endings. You decide how the story plays and ends\nOwn property and ships, participate in the politics of guilds and other organisations, and trade goods and services\nList of mods:\nD.R.E.A.M. by King of Worms - KoW\nImproved Interior Lighting by ShortBeard\nBetter Ambience by Joshua Steinhauer\nLoading screen by TheLacus\nEnhanced Sky by Interkarma\nInteresting Eroded Terrains by Monobelisk and Freak2121\nDistant Terrain by Nystul-the-Magician\nBasic Roads by Hazelnut\nReal Grass 2 by TheLacus\nVibrant Wind by Uncanny Valley - TheLacus - VMblast\nTaverns Redone by Uncanny Valley\nHandpainted model replacements by AlexanderSig\nWindmills of Daggerfall by Kamer\nDetailed city walls by Cliffworms\nBirds in Daggerfall by Uncanny Valley\nFixed dungeon exteriors by Cliffworms\nLively cities by Cliffworms\nUnofficial Block Location and Model fixes by XJDHDR\nReadied Spellcasting Hands by jefetienne\nRoleplay and Realism by Hazelnut\nRoleplay and Realism Items by Hazelnut and Ralzar\nDaggerfall Skyshards by Uncanny Valley\nAirships by Kaedius\nArchaeologists guild by Hazelnut\nDaggerfall Unity Quest pack 1 by JayH2971\nDaggerfall Unity Quest pack 2 by JayH2971\nWorld of Daggerfall Project  by World of Daggerfall Team\nBestiary by Shapur\nFamous Faces of the Iliac Bay by Cliffworms\nYou Can Pet The Cat by technitaur\nAmbient Text by Regnier\nDarker Dungeons  by Ralzar\nDaggerfall Expanded Textures by Ninelan\nBestiary by Shapur\nLevelling Inspiration by Cliffworms\nTown Descriptions And Details by imsobadatnicknames\nRest Warning If Unwell by Kirk O\nWorld Tooltips by jefetienne\nConvenient Quest Log by Macadaynu\nJayH's Random Little Quests by JayH2971","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"GOG","platforms":[{"id":0,"name":"PC"}]},{"id":60037,"name":"The King's Bird","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/43c/43cccc1b7c2402d7215e7c6645c1ec5f.jpg","description":"Flight · Flow · Freedom\nEscape into a world kept secret by a tyrant, and discover the truth about your freedom. The King’s Bird is an artistic, momentum-based game that seamlessly combines precision-platforming with physics-based gliding.\nNew yet easily accessible take on the precision-platforming genre\nDynamic background music and sounds that change based on your movements\nText-less narrative told through visuals in motion\nFive unique worlds to explore, full of vibrance and colorful silhouettes, with inspirations from ancient Mayan, Southeast Asian, and Roman cultures","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Serenity Forge","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":16111,"name":"Sins Of The Demon RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fac/fac7ba1155b892b7a61efffc985892a5.jpg","description":"Long ago, in the land of Lanistra, a demon by the name of Isharul appeared. He lashed out against the world, seeking to destroy everything in sight. Only with the help of Princess Atsuki was the beast dispelled.\nYet as he faded, Isharul placed a curse upon the land. And so it was that if a person committed one of the seven deadly sins in a great enough magnitude, they would become possessed by demons themselves.\nFollow the journey of Kenshi, a wandering demon hunter, and his brother, a demon cat seeking a way to return to his true form. Can they find a way to end the curse and save Lanistra?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Chandler Rounsley","platforms":[{"id":0,"name":"PC"}]},{"id":14264,"name":"12 Labours of Hercules","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a63/a635fcc9b1f8af84e539c35c79426bc6.jpg","description":"Our new games!http://store.steampowered.com/app/567800/\nhttp://store.steampowered.com/app/545820/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other Hercules adventures:http://store.steampowered.com/app/360640/\nhttp://store.steampowered.com/app/360650/\nTry other Hercules adventures:http://store.steampowered.com/app/396800/\nhttp://store.steampowered.com/app/491330\nhttp://store.steampowered.com/app/567800/\nAbout the GameAccompany Hercules on a quest to rescue his wife, kidnapped by the evil Hades in 12 Labours of Hercules! You'll meet heroes from Ancient Greece as you vanquish beasts, repair roads and construct wonders in this stunning Time Management game!\nNo magical creatures were harmed in the making of the game. They're all actors.\nStunning HD graphics\nFlying horse included\nChallenging unlockable achievements\nAction packed mini-games","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":12636,"name":"Valhalla Hills","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0e/b0e3154a0d4f36376050bd2afb6ef6b6_nfv5rBs.jpeg","description":"You spent your whole life in service to the gods of Asgard. You died an honorable death. You earned your place in the halls of Valhalla.\nBut when you knocked on its gates to receive your final reward, none answered. Odin has turned his back on your people. He underestimates the Viking spirit. He underestimates you.\nForce their hand as you lead your people past the dangers waiting on Valhalla Hills and fight to prove your honor, your strength, your worthiness. Look after your Vikings, gathering food, chopping wood, and mastering the complex economics of wilderness survival.\nReach the portal at the top of each mountain, and shout your battle cry loud enough for the gods to hear.\nIf they will not give your people the reward you all deserve, then by your axe, you will take it from them.\n\nBe prepared for randomly generated levels with various challenges\nLook after your Vikings' needs\nImprove constantly, use your knowledge and achievements for the next map\nEarn your place in Valhalla, for your Vikings and yourself","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10751,"name":"Legends of Eisenwald","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82c/82c27515972660514f7a0afc7a24c529.jpg","description":"Knight's EditionThe Knight's Edition contains Legends of Eisenwald OST in MP3 and FLAC formats and artbook. The last two screenshots above in the carousel are from the arbtook.\nAbout the GameLegends of Eisenwald is an adventure game with tactical battles, RPG and strategy elements. Take the lead of a small feudal army and try to defend your right to survive in this ruthless medieval world.\nThe mysterious lands of old Germany are waiting for you - it's a land where the superstitions of the time have come to life. This isn’t a fantasy game. There are no elves or dragons here. There are only people - and their passions, sins and fears that often take a tangible form. Which path will you choose? Live according to your conscience? Or live by power and might? Or will you live by justice? And what is your justice, really?Game features A unique and dynamic combat system - each move is also an attack\nThe ability to individually equip *each* fighter in your army\nA large selection of weapons, spells and abilities, including the option to use mounted units\nDiverse upgrade trees, and each unit level up provides cosmetic changes\nAn intriguing non-linear story\nA distinctive game world without common fantasy cliches\nOver 50 hours of gameplay within the game. A main campaign consisting of eight chapters plus two additional scenarios.\nA beautiful symphonic soundtrack in a medieval style\nAn accompanying Scenario Editor with the full set of developer tools\nIMPORTANT NOTICE: Similar to games like Disciples 2 and HOMM, there may be points farther into the game where you lose it all, troops, gold, inventory. All those things you worked so hard for. This is part of the game, not a bug. And you wont know when.... Be warned.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Aterdux Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":10720,"name":"Day of Infamy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e6/2e62985490386eba0b40c2e3cf214f09.jpg","description":"Digital Deluxe EditionDeluxe Edition includes the full 28 minute soundtrack of in-game music by composer Rich Douglas, plus three unit items to help start your collection: 101st Airborne Division, Seaforth Highlanders of Canada, and the 1. Fallschirmjager Division.\nAbout the Game\nDay of Infamy takes you to the battlegrounds of Southern and Western Europe during World War II. There are 10 maps, ranging from war-torn cities to farm villages, fortified beachheads and snow-covered forests. Whether you are fighting for the U.S. Army, Commonwealth Forces or the German Wehrmacht, there is a vast arsenal of over 70 historical weapons and attachments.\nDay of Infamy features 9 player classes and 10 objective-based game modes, providing a variety of experiences depending on what you’re looking for. Your objectives include capturing areas, assassinating officers, stealing enemy intelligence, and destroying anti-aircraft guns, fuel dumps and radio communication centers. Multiplayer gameplay features large-scale battles with many reinforcement waves, as well as smaller scale operations with objective-based reinforcements. Cooperative gameplay features three distinct game modes against challenging AI enemy troops.\nDay of Infamy is a highly strategic experience that rewards intelligent maneuvering and coordination with your team. Pay close attention to your surroundings, as blindly running into an open area is the easiest way to get killed. Lean around corners, lay prone to steady your aim, and walk slowly to conceal the sound of your footsteps - these are effective tactics to stay alive. A team that sticks together, advances cautiously, and uses proximity VOIP is more likely to overcome a scattered and disorganized opponent.\nSelecting the Officer class in the game puts you at the top of your team's chain of command. Pairing with a Radioman in the field will enable you to request supply drops, smoke screens, artillery barrages, as well as aircraft strafing and bombing runs. You may also issue various tactical commands to your team such as flanking or charging an objective. Communicating effectively as an Officer will enable your brothers-in-arms to turn the tide of battle with an effective order.\nAs you play the game, you will ascend through the ranks and unlock historic units. Earn cosmetic items such as melee weapons, rifle skins, and cloth wraps by attaining weapon skill thresholds. Unlocks do not provide players with any gameplay advantage, so game balance will always remain purely skill-based.\nThe units you earn by ranking up contain unique items such as arm patches, helmet stencils, hats, cap badges, voices, and faces. The game contains historic regiments rarely found in WWII games, such as the U.S. Army’s 92nd “Buffalo Soldiers” Infantry Division, the Princess Patricia’s Canadian Light Infantry and the British Indian Army’s 12th Frontier Force Regiment. The game also contains some of the more popular fan-favorite historic units, such as the U.S. 82nd and 101st Airborne Divisions, 2nd Ranger Battalion, and German Luftwaffe Fallschirmjägers.\nThe game comes with mod support and Workshop integration, providing players with a vast array of community created content. Built on Valve's Source Engine, the SDK is one of the most familiar out there. Modders can replace models, textures, sounds and user interfaces in the game, as well as add new maps or total conversions using the game's theater scripting system. There are already over 500 mods which have been released during the game's early access phase.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"New World Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5610,"name":"Lollipop Chainsaw","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f73/f73e546deb6c0b377abf6cdd1e879554.jpg","description":"Lollipop Chainsaw is the ‘un-deadly’ story of sweet and killer zombie-hunter Juliet Starling and her quest to uncover the root of a colossal zombie outbreak.  With her wickedly awesome chainsaw in hand, Juliet slices, dices and splits her way through hordes of the undead, but soon realizes the horde is only the opening act to a festival of zombie rock lords determined to kill the chainsaw-wielding cheerleader.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"8-4","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":993875,"name":"Marvel Rivals","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f0/3f0fdfc7c71655366aa83ab80ecab9b8.jpg","description":"Marvel Rivals is a Super Hero Team-Based PVP Shooter! Assemble an all-star Marvel squad, devise countless strategies by combining powers to form unique Team-Up skills and fight in destructible, ever-changing battlefields across the continually evolving Marvel universe! A Deep and Varied Marvel RosterChoose from a vast array of fan-favorite and cult-classic Marvel Super Heroes and Super Villains from across the Avengers, Guardians of the Galaxy, X-Men, and many more from across the Marvel Multiverse. Fast and Fun 6v6 Action with Ever-Changing Game DynamicsWith intricate environments, fast-paced gameplay, and ever-changing battlefields, there's never a dull moment in Marvel Rivals! Battle as Super Heroes and Super Villains with incredible abilities and combine your powers to bring unexpected fun to the battlefield in a matter of seconds.Dynamic Hero SynergyCoordinate unique combinations between characters to ignite surprising Team-Up Skills! Unleash the synergy of combined superpowers and invent new tactics that can turn the tide of combat. Ride on Groot's back as Rocket Raccoon to take on your enemies as a dangerous duo, unleash Gamma energy as Hulk to charge Iron Man's armor for massive damage, and so much more! Creative Environment DestructionTear your way through iconic Marvel worlds across destructible environments! From Asgard to the Tokyo of 2099, use superpowers to alter these environments, reshape the terrain, and craft a strategic advantage on the battlefield! Take cover to dodge attacks or use makeshift weapons to strike down enemies. Players will find countless ways to utilize the environment to claim victory!Continually Evolving Universe and Robust Post-Launch UpdatesThe Marvel Multiverse brings infinite possibilities! Each seasonal drop will introduce new Super Heroes to the battlefield along with challenging and diverse maps! Unlock new content to implement across various gameplay strategies while experiencing thrilling action and endless possibilities in these adventurous team battles!","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"NetEase Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":614967,"name":"Two Point Campus","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bde/bdedc180d7e2bca40fd105980d74b452.jpg","description":"Build your university, your way!\r\n\r\nIt’s time to spin academia on its head! Got a yearning for learning? Or just keen to build an educational masterpiece? Campus is jam-packed with new creative tools to help you build the university of your dreams.\r\n\r\nFor the first time, build in the great outdoors as you develop your own delightfully educational campus environment, housing the top teaching facilities in the land. Whether you prefer building on simple foundations, or placing every tree, you can build the university you want.\r\n\r\nLay down pathways with new easy-to-use tools. Plant glorious collections of outdoor flora. Place benches, fountains, sculptures, hedgerows – even picket fences. The only limit is your imagination (and your in-game bank balance).\r\n\r\nNot the usual fare\r\n\r\nBut, of course, it wouldn’t be a Two Point game without a twist.\r\n\r\nRather than typical academic fare, students in Two Point County enjoy a range of wild and wonderful courses: from Knight School (hey, we all have to learn jousting at some point in our lives), to the salivatory Gastronomy, where your students will build mouth-watering concoctions like giant pizzas and enormous pies.\r\n\r\nThe academic year… is here!\r\n\r\nTake advantage of the opportunity to spend way more time with the little people in your university. The academic year begins with a summer break, giving you enough time to get everything looking great before your students move in.\r\n\r\nBuild libraries, hire the best staff (from eccentric professors to madcap researchers), kit your campus out with the best courses and watch the academic potential of your students get unlocked!\r\n\r\nShaping the future\r\n\r\nBut it’s not just work hard in Two Point Campus. Get to know your students, explore their individual personalities, wants and needs. Keep them happy with clubs, societies, gigs.\r\n\r\nSurround them with friends, help them develop relationships, furnish them with pastoral care and ensure they have the right amount of joie de vivre to develop into incredible individuals who will do the legacy of your university proud.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Two Point Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":18288,"name":"Kung Fu Strike - The Warrior's Rise","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/60f/60fd5df991bae2e77669628d4eb38493.jpg","description":"Taking its inspiration from ancient Chinese tales of revenge and retribution and then adding a dash of over-the-top martial arts and old school arcade fun, Kung Fu Strike features 28 stages of fast-paced combo-based fighting. Blend powerful punches, high kicks and perfectly timed blocks to pull off devastating combos, all thanks to a fluid combat system that turns brawling into an art form. Key FeaturesOld-school beat-‘em-up arcade appeal!\nUnlock items and abilities to further customize style of play.\nOnline leaderboards breed competition between players.\nLater levels will challenge your Kung Fu on even the lowest difficulty setting.\nFreely flowing combat mechanics allow jaw-dropping combos.\nFight with or against a friend in local co-op.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Qooc Software","platforms":[{"id":0,"name":"PC"}]},{"id":16296,"name":"DreadOut: Keepers of The Dark","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e47/e474a21290123ffe6b80a822c7c6de59.jpg","description":"It's time to experience DreadOut in a different way.\nDreadOut : Keepers of the Dark is a new standalone horror game that takes place in the DreadOut universe. In this missing chapter, you will help Linda face the challenges of the DreadOut world with even more dangers lurking within.\nFollow the event in which Linda was transported by The Mysterious Lady in Red into The Mirror Realm. A portal of worlds that connects it to 8 haunted dominions where 13+ horrific ghosts are ready to greet her in the most terrifying way possible. They will stop at nothing to thwart your main objective: To survive!\nSo, get your smart phone and SLR camera ready and choose your path wisely. The doors you open will decide the outcome of Linda's fate.\nGame Features\nBattle against 13+ specially designed ghosts originated from the twisted minds of our beloved backers, meticulously implemented into the DreadOut universe.Work your way through 8+ supernatural realms in a nonlinear fashion.2 brand new levels previously unincluded in DreadOut.Solve mysterious puzzles obstructing Linda’s escape to liberation.Explore in third person view and battle in first person view.Find out more about Linda’s journey and dive deeper into DreadOut’s grand scheme of things.New storyline that will shed some light into Linda’s mysterious journey.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digital Happiness","platforms":[{"id":0,"name":"PC"}]},{"id":6256,"name":"METAL SLUG 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b10/b10ec870bdea34d4947e1ac3b0f1461a.jpg","description":"“METAL SLUG 2”, the 2nd entry in SNK’s emblematic 2D run & gun action shooting game returns to the battlefield on the Steam gaming platform! MAIN FEATURES・ARCADE MODE (MAIN MISSION):\nPlay the original arcade version of  “METAL SLUG 2” from Missions 1 to 6, and fight your way through the hail of bullets to thwart General Morden's evil ambitions, and uncover the secret of his new coup!!\n・MISSION MODE (STAGE SELECT):\nPlay, and replay your favorite missions as much as you want! Hone your skills alone or along with a brother-in-arms on the levels you have unlocked so far!\n・SETTINGS:\nSet your controls, language, video display, and sound volume settings for the ultimate “METAL SLUG 2” experience on PC!\n・LEADERBOARDS:\nCheck your current rank & score in “METAL SLUG” at any time, and challenge other players to be the best “METAL SLUG 2” soldier in the world!\n** WILL NOT RUN ON Windows XP **","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"DotEmu","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation"},{"id":0,"name":"iOS"}]},{"id":514890,"name":"SpellForce 3: Versus Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc0/fc0c97c99f58968985c7a57e133fdc05.jpg","description":"The SpellForce 3: Versus Edition gives you the chance to enter the battlefields of Eo for free, letting you test your RTS skills against AI opponents or even other human players.\nSkirmish or 1-on-1 Multiplayer\nYou can choose whether you want to take on AI enemies in a Skirmish battle, or go head-to-head with other human players of SpellForce 3 in both Ranked and Unranked PVP matches.\nOn top of it all you can also check out the single-player scenario ‘Old Haalâyash’ to get a glimpse of what the lavishly created single player campaigns of SpellForce 3 and its stand-alone expansions have to offer.\nMultiplayer Races: Orcs, Humans and Elves\nYou will be randomly assigned a faction, giving you a chance to try out either playing as Orcs, Humans or Elves.\nEach faction has its own strengths and traits, so you’ll need to develop your strategy to make the most of your warriors and workers. And because the faction is randomly assigned every time you play, you’ll have to think fast in order to secure victory.\nUpgrade to unlock more excitement\nThis is just a taste of the challenge and fun that SpellForce 3’s RTS matches have to offer. When you are hungry for more, the full versions of SpellForce 3 and its stand-alone expansions Soul Harvest and Fallen God will get you access to the complete PvP experience with all factions and the full story campaign.\n\nIf you love the PvP aspect of the game, we also offer the “SpellForce 3: Versus Edition - Full PvP Upgrade” DLC which contains the complete PvP experience with access to all 6 factions (Orcs, Humans, Elves, Dark Elves, Dwarves, Trolls).\n\nPlease note that the full Single Player and story campaign experience is only unlocked by acquiring SpellForce 3 and its stand-alone expansions Soul Harvest and Fallen God.\nKey Features\nFree PvP multiplayer\nGo for glory with Ranked and Unranked PVP matches\nChoose Skirmish mode to play against challenging AI opponents\nBattle against other human players of SpellForce 3, SpellForce 3: Soul Harvest, and SpellForce 3: Fallen God\nPlay the single-player ‘Old Haalâyash’ scenario map","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Grimlore Games","platforms":[{"id":0,"name":"PC"}]},{"id":281880,"name":"Almost There: The Platformer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98a/98a2a281f8744ec2c93175b19184a0d4.jpg","description":"⇧⇧⇧ Please wishlist! ⇧⇧⇧ We're a very small, dedicated team of two people trying our best to promote Almost There. Every wishlist really helps Steam's algorithms show our game to more people. Please help us!\nSprint between saw blades while dodging homing missiles. Duck under lasers while the floor crumbles beneath you. Almost There was designed specifically for fans of the hardcore platforming genre - you've been warned.\n100% Dexterity Platforming\nAlmost There provides uninterrupted platforming awesomeness.\nHours and Hours of Gameplay\nWith over 150 stages and timed challenges, Almost There will kill you thousands of times.\nSpikes, Saws, Lasers, Missiles, Oh My!\nEverything in Almost There is designed to kill you. Enjoy.Created for platformer fans -- by platformer fans","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"The Quantum Astrophysicists Guild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":60860,"name":"Assetto Corsa Competizione","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/19e/19ea8efb10fcbcf1b9c60729d510ed14.jpg","description":"Assetto Corsa Competizione is the new official Blancpain GT Series videogame.\nThanks to the extraordinary quality of simulation, the game will allow you to experience the real atmosphere of the ​​GT3  championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved.\nSprint, Endurance and Spa 24 Hours races will come to life with an incredible level of realism, in both single and multiplayer modes.\nAssetto Corsa Competizione is born from KUNOS Simulazioni's long-term experience, and it takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models.\nDesigned to innovate, Assetto Corsa Competizione will be set to promote eSports, bringing players at the heart of the Blancpain GT Series and putting them behind the wheel of Ferraris, Lamborghinis, McLarens and many other prestigious GT racing cars, all reproduced with outstanding level of detail.\nREALISTIC SIMULATION\nAssetto Corsa Competizione is designed to faithfully recreate the performance and the driving experience of real Blancpain GT Series cars through a sophisticated mathematical model that accurately replicates tyre grip, aerodynamic impact, engine parameters, suspensions and electronics systems that determine vehicle balance, as well as the influence of mechanical damage on the car's drivability.\nNEW-GENERATION GRAPHICS AND VISUAL EFFECTS\nUnreal Engine 4 guarantees photorealistic rendering and an accurate representation of scenarios, car materials and weather conditions. Thanks to the multi-channel audio sampling of real GT cars, the game conveys captivating and immersive acoustic surroundings and realistic environmental effects.\nCARE FOR DETAILS\nEven the secondary details are faithfully reproduced to make you feel the thrill of being in the cockpit of a real racing car. Doors, windshield wipers, headlights, racing lights, racing equipment and control devices such as ABS, traction control, engine ignition and ECU mapping, are all under the driver’s management to assure the best performance and offer the player total control of the car.\nTHE MOST ACCURATE CIRCUITS\nThanks to Laserscan technology, every official circuit is recreated with the utmost accuracy: all curbs and details perfectly fit their real counterparts to grant a gaming experience as faithful to reality as possible.\nADVANCED MULTIPLAYER FUNCTIONALITY\nA well-structured ranking system will evaluate individual performance and driving behaviour to reward the most virtuous drivers and promote fair play in online competitions. The matchmaking function makes sure that you can compete with opponents of similar skill level and easily find online races to join, while the leaderboards will allow you to compare single-lap performance with virtual pilots from around the world with the same car, circuit and weather conditions.\nIMMERSIVE SINGLE PLAYER EXPERIENCE\nCareer, Championship and Free Play modes offer a complete and customizable gaming experience, also thanks to the tutorials and progressive aid levels that allow you to tailor AI opponent difficulty and vehicle stability control to your abilities. The Special Events will allow you to gain a first-hand experience of the most noteworthy real-life Blancpain GT Series challenges.\nHIGH-LEVEL HARDWARE COMPATIBILITY\nAssetto Corsa Competizione ensures full compatibility with a wide range of peripherals from gamepads to professional steering wheels.\nMOTION CAPTURE FOR REALISTIC ANIMATIONS\nMotion capture technology is used to create the animations of mechanics and drivers in an even more realistic fashion, and guarantee a high level of player engagement during races, pit stops and driver changes.\nBLANCPAIN GT SERIES\nEncouraged by the success of the Blancpain Endurance Series, which after its creation in 2011 quickly became the global reference for GT racing, world-renowned Swiss watch manufacturer Blancpain and the SRO Motorsports Group decided at the end of 2013 to extend their partnership to the Blancpain Sprint Series. From 2015, teams and drivers were also given the opportunity to compete for an overall Blancpain GT Series title. Varied grids were the result, with a host of respected GT teams and drivers at the start of each race. The Blancpain GT Series also saw an influx of young and talented drivers, making it a worldwide benchmark in GT3 racing.\nWith both the Blancpain GT Series Sprint Cup and Blancpain GT Series Endurance Cup now sharing the same driver categories and points system, the ten-round Blancpain GT Series season – comprising five sprint events and five endurance events – crowns the world’s most complete GT drivers.\nA Blancpain GT Series Sprint Cup event consists of two races of one hour each, while the Blancpain GT Series Endurance Cup races range from three-hour events through a 1000 km race to the season highlight of the Total 24 Hours of Spa, one of the world’s leading 24-hour races.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kunos Simulazioni","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":16293,"name":"GemCraft - Chasing Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddf/ddf1496a37a7fb43d24b93404e7b2f10.jpg","description":"The cult classic tower defense game beloved by millions comes to Steam with GemCraft - Chasing Shadows. Against swarms of vicious, demonic avatars, your only defenses are the gems you conjure that, when placed atop towers or into traps and amplifiers, become conduits for powerful magical and elemental attacks. GemCraft combines fast-paced real-time strategy as you deal with waves of incoming monsters, and cunning tactics that allow you to craft and combine magical gems.\nCreate traps that poison or slow, discover powerful artifacts and unlock new abilities, and stand alone against The Forgotten, a seemingly unkillable archdemon whose endless armies threaten to swallow the world. GemCraft is packed with multiple levels of difficulty, hundreds of achievements, nearly two hundred levels, and much, much more, making it a rewarding, deep strategy game you'll come back to over and over again.Key Features:\nConquer over 190 stages with unique challenges and conditions.\nOver two dozen passive skills to unlock and enhance as you level up and increase your power.\nMore than 400 achievements that will reward you with more skill points as you earn them.\nCraft and combine nine gem types with different effects to suit your tactical needs.\nCombine and stack multiple tiers of difficulty and challenging battle traits for greater rewards, but also greater dangers.\nSocket fragments you find into your mystical talisman to impart new bonuses.\nWield devastating spells to decimate your foes or enhance your gems.\nControl the speed of battle with fast-forward or pause to fit your play style.\nWant more monsters? Summon them with wave stones, but beware their greater power...\nReplay any stage you've completed for more experience points or with  a new challenge.\nHold out as long as you can after you win levels in Endurance mode for more rewards.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Game in a Bottle","platforms":[{"id":0,"name":"PC"}]},{"id":50228,"name":"La Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f8/7f83ec85a55c51d12268f708881b5b20.jpg","description":"La Tale is a beautiful 2D side-scrolling fantasy MMORPG with fast-paced combat and endless customization. Choose from 9 distinct Classes and over 50 potential Job Specialties to create your own unique Hero of legend. Visit small towns and vast cityscapes, conquer exploration fields and instance dungeons packed with quests and secrets, or challenge colossal area bosses either solo or with a party across 3 massive continents. Customize your Hero however you choose with upgradeable weapons, gear items, powerful magical enchantments, and rare outfits, plus helpful pets and unlockable titles and emotes that allow you to express yourself your way.\nEmbark on an epic quest around the globe with other legendary heroes to battle against the forces of the Demon World and search for the renowned champion Iris Livier. The world of La Tale is yours discover – how will your tale be told?Key FeaturesChoose from 10 distinct Classes and over 50 potential Job Specialties\nUnlock extensive unique Skill Trees and Weapon Masteries\nChallenge colossal bosses either solo or with a party\nExplore 3 sprawling continents with cities, fields, dungeons and secret areas\nCustomize your Hero’s appearance with near-endless options\nCollect and raise Pets with unique helpful skills\nJoin a Guild and increase its rank for special bonuses\nChallenge other players in fast-paced PvP duels\nCraft, upgrade, and enchant weapons, gear, and accessories\nOpen a Shop and engage with the player-driven economy","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Actoz Soft","platforms":[{"id":0,"name":"PC"}]},{"id":16465,"name":"Sherlock Holmes: The Mystery of the Mummy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6d/c6d3ece71219260960e117cb4704c0aa.jpg","description":"Inspired by The adventures of Sherlock Holmes Written by Sir Arthur Conan Doyle.\nAfter Lord Montcalfe's death, his daughter Elisabeth turns to the famous detective Sherlock Holmes to solve the mystery that surrounds her father's death. As his trusted assistant Doctor Watson  is having a well deserved holiday with his family, Holmes decides to go to the manor on his own. He will have to use all of his considerable skill to resolve all the manor's riddles. Only then will he discover that behind this mysterious case hides a dreadful secret.\nIn The Mystery of the Mummy, you'll be immersed in an incredible adventure full of mysteries and with many developments. Take on the role of the famous detective Sherlock Holmes and get ready to avoid numerous traps and to solve riddles. A mysterious murder, numerous suspects, and the famous mummy for a case that appears to be not that easy...","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":14881,"name":"Contraption Maker","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39d/39d9f49d6e2a10f4b293acee4611c869.jpg","description":"** Contraption Maker is a 2-pack. Buy it and get a copy for a friend to build together! **\nThe team that created the original Incredible Machine® is bringing all of the Rube Goldberg craziness to the modern age.\nSolve puzzles involving ridiculous chain reactions full of hamster motors, trampolines, alligators, cats, and so much more. Everything you loved about the original game is back and improved with a new physics engine, high definition art, new parts, and even online multiplayer. Over 200 official puzzles, and a whole bunch of community creations.\nSteam Workshop integration allows you to share your creations with the world.\nEnjoy hours of puzzle solving with over 200 official puzzles and countless community submissions. Fix broken contraptions with specific parts you are given to accomplish goals like turning on lights, opening fireworks factories, and throwing birthday parties for crocodiles.\nEnter the easy to use Maker Lab to make your own puzzles or random contraptions. More than 100 parts ranging from gears and dynamite to bears and cats are at your disposal. Use the layered background tool to create settings for your contraptions to exist in, and then animate them to add some life. There's no part or size limitation to what you want to make. Build as much as you can to bring your computer to its knees.\nJavascript modding is built directly into the game. Create custom game types using all of the the Contraption Maker parts and physics as a base. Or start with a published mod and use the Maker Lab to make a new level. Easily share and play other mods in the Steam Workshop.\n\nPlay online with friends to build contraptions together in the Maker Lab. Up to 8 players can build together in real time. Currently multiplayer is only in the Maker Lab, there is no cooperative puzzle solving yet.\nShare your puzzles and creations with the world through the Steam Workshop. Thousands of Workshop submissions are already waiting to be played.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spotkin","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":249966,"name":"Spider-Man (2000)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1cf/1cf9e301f1d27172546dcabc2f6cb597.jpg","description":"Spider-Man is an action-adventure video game based on the Marvel Comics comic book series The Amazing Spider-Man, which features the fictional superhero Spider-Man. Although it features the likenesses and same voice actors, it is not based on the animated television shows from the 1990s. It was developed by Neversoft and published by Activision using the Tony Hawk's Pro Skater game engine for the PlayStation in 2000; the game was later ported by different developers to various systems including the Game Boy Color and Nintendo 64 that same year, as well as the Dreamcast and Microsoft Windows in 2001. The game follows Spider-Man as he is framed by a doppleganger for stealing a device created by a supposedly reformed Dr. Otto Octavious. The game features Venom, Carnage, Scorpion, Rhino, Mysterio and an exclusive-to-game Symbiote Doctor Octopus all as boss battles. Two direct sequels were released in 2001; one developed by Torus Games, Spider-Man 2: The Sinister Six, released for the Game Boy Color, and one developed by Vicarious Visions, Spider-Man 2: Enter Electro, released exclusively for the PlayStation. This game and its latter sequel feature narration from Spider-Man co-creator Stan Lee.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":31476,"name":"Harry Potter and the Chamber of Secrets","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1a/d1aa957423b0f3dbb66b699653b3ad87.jpg","description":"Be Harry Potter in a unique new PC adventure with more magic, friendship, and danger. Learn new spells, undertake new quests, make new friends, and challenge new adversaries as you confront the powers at the heart of the Chamber of Secrets. Do you dare face You-Know-Who again?\n\nExplore rich environments from the colorful Burrow to the dark reaches of the Forbidden Forest.\n\nMaster new spells including Expeliarmus, Diffendo, and Skurge.\n\nOvercome dangerous foes from Aragog to the Basilisk.\n\nTake flight to play improved Quidditch.\n\nInteract with new characters from J.K. Rowling's world, including Dobby, Lockhart, and Ginny Weasley.\n\n\nFeatures & details\n\n\nThe Chamber Of Secrets has been opened and the Heir To Slytherin is causing havoc -- Harry and his friends have to stop it\n\nExplore the complete world of Hogwarts -- completely immersive, interactive environments are waiting to be explored\n\nSave the students who are being petrified by Slytherin\n\nFly in aerial levels on Harry's Nimbus 2000\n\nCombat the deadly menace unleashed by the Chamber with new spells","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Eurocom","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 2"}]},{"id":20803,"name":"Frederic: Evil Strikes Back","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6f/f6fd38e556ffc49b7b6e703bde2d6715.jpg","description":"Special OfferBuy Frederic: Evil Strikes Back on Steam and get the award winning soundtrack from the game for free!!!\nAbout the GameDefeat famous opponents in musical duels. Immense yourself in fantastic story of Frederic's endeavors. Catch all the Easter Eggs and subtle parodies hidden in the background. Practice your skills until perfection and become the Master of the Piano.\nThe world of music is once again threatened. The art of soulful music, the kind that touches your heart, is in grave danger of disappearance. The evil forces that you fought so bravely are back! And they are even more powerful and desperate. Once again you'll need to step into Frederic Chopin's shoes and face opponents that have only one agenda - to enslave the musical world, mass produce soulless artists with their same-sounding radio hits, and reap enormous profits, hindering any creativity in the process.\n- 10 challenging musical duels with some of the most renown pop stars\n- 10 fantastic, catchy tracks, inspired by Frederic Chopin's composition and different music genres.\n- Quirky story with tons of parody and twists\n- Extremely easy to get to, but hard to master gameplay\n- Hand-painted animated comic\n- Achievements and leaderboards","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Forever Entertainment S. A.","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":316936,"name":"Paw Paw Paw","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/64e/64e4c4a09537f31ce87cd4b75e713042.jpg","description":"Paw Paw Paw is a 2D Sidescroller Beat ‘Em Up game. You play as part of the resistance in their effort to bring down the King. Hack and slash your way to victory, and beat all your enemies into pulps!KEY FEATURES Play single player or local co-op up to 4 players\nLevel up your character\nUnlock new combo\nLoot and equip new weapons\nHire companion to help you in battle\nRide your mount into battle\nCHARACTERS\nThere are four starting characters to chose from, with more to be unlocked as you play the game. Each character has their own abilities, stats, combos, and weapon preferences. Choose a character that fit your play style!\nWEAPONS\nUnlock new and powerful weapons for your characters! Each weapon has its own stats and bonuses. Loot weapons by defeating enemies and bosses. Or you can buy new weapons from the wandering merchants.\nOUTPOST\nOutposts are places that you can visit between levels. A place for you to rest and prepare for the next mission. Here you can level up your characters, equip new weapons, restock your supplies, buy various items and recruit a companion.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Simpleton","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":315987,"name":"TOHU","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/53e/53e97e0a99e75fc213f52b89623d1d4c.jpg","description":"In a small distant world floating in ether, there is a fish-planet, where lives an unusual little girl who keeps a secret: she can turn into a Cubehead - her alter-ego, who can carry big things and make big deeds. They spend calm days in their small cozy-house, but one day someone breaks the Sacred Engine - a heart of the fish-planet. All living beings are in danger now and our brave friends decide to start their journey to find someone who can fix the Engine and save a planet from dark chaotic terror, coming from nowhere...\nYou will go on a strange, deep and reflective adventure in a classic Point & Click game Tohu.\n- Unique graphic style with tons of details;\n- 9 colorful locations with 3-5 scenes in each;\n- Dozens of obscure creatures inhabiting the world. Catch them all!\n- Cute and funny characters;\n- 7-8 hours of gameplay;\n- Unusual mechanics, you've never seen before.\nThe unforgettable atmosphere is completed with music, created by Christopher Larkin - author of Hollow Knight's soundtrack.\nBecome a part of kind, mysterious and breathtaking story!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Fireart Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":262433,"name":"Effie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a9f/a9f6efa894e0f05eea59804640319031.jpg","description":"‘Effie’ is a 3D action-adventure game that combines the classic elements of the genre, such as combat, platforms and puzzles, with the exploration of a vast world. Live a unique fantasy adventure, set the towns free from a powerful dark evil, and relive the feelings of the classic video games!Live a unique adventure\nImmerse yourself in Galand's adventure, a young man who, cursed by an evil witch to be old, will have to recover his youth. Defeat all the sinister creatures, overcome all the platforming challenges and solve the intricate puzzles!Your shield Runestone, your travel companion\nA powerful dark magic controls all the towns in the Oblena region. To defeat evil, you will have a magical shield with which you can defend yourself, fight and surf through the red plains. Each time it will become more powerful and it will get new skills!Relive the feelings of a classic video game\nWe all remember with nostalgia those amazing classic 3D action-adventure games. We've used those references to make those feelings come true again, but with renewed and modernized graphics, controls and gameplay!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Inverge Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":40,"name":"GNOG","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/470/4701fcd3d56917ad592690e403f4eb13.jpg","description":"\"I was in love with GNOG the second I saw it\"-Rock Paper Shotgun\n\"Weird and wonderful...\" -Polygon\n\"This is such a joyful game, I'm not sure it's possible to leave it without feeling uplifted.\" -Destructoid\n\"It's a kooky idea brought about with lots of style and verve...\" -Eurogamer\nGNOG is a playful puzzle game about exploring monstrous virtual toys. Press, pull, slide, grab, click, and rotate every GNOG head to uncover its secrets!\n9 musical levels with whimsical puzzles to discover\nA dynamic soundtrack composed by Marskye\nEach level a unique hand-crafted experience\nPlay in standard mode or with optional VR support. Seamlessly switch between VR and standard play!\nGNOG is a 3D puzzle game set in a tactile world of toys and secrets. Point, click, grab, poke, spin, pull, and play with uniquely charming monster heads as you explore the hidden worlds inside them. Filled with eye-catching designs, playful interactions, and a rich, reactive soundtrack, the hand-crafted heads come to life in either standard play or in VR.\nInspired by real-world toy designs, every GNOG head is a miniature world to discover. Grab a bookcase and spin it to reveal a hidden pile of coins, slide levers to navigate a damaged ship through outer space, crank a wheel to cook a stew on the stove – each playful interaction generates lively feedback and surprising consequences. Set to a relaxing and dynamic soundtrack that evolves with each level, the surreal worlds and joyful puzzles of GNOG will have you turning heads.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"KO_OP","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":23748,"name":"Pokémon Sun, Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a00/a0013d8c9ddb1878c2d1030c822b7525.jpg","description":"Embark on a new adventure as a Pokémon Trainer and catch, battle, and\ntrade all-new Pokémon on the tropical islands of the Alola Region.\nDiscover the Z-Moves and unleash these intense attacks in battle. Call\nupon Pokémon with Poké Ride to discover new areas across the region and\ntake on the Island Challenge Trials to become the Pokémon Champion!\n\nChoose one of three new partner Pokémon that will accompany you as you\nset out on an all-new adventure and discover new Pokémon and regional\nvariant Pokémon in the Alola region. Catch and train Pokémon as you\nencounter captains, and kahunas of the 4 main Islands of the region.\nDiscover the mystery of the Legendary Pokémon while stopping Team Skull\nfrom causing chaos throughout the land.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":20168,"name":"Velvet Sundown","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b66/b6676a15067f63bd1c6bf9eedec559d3.jpg","description":"Jump into the role of a star and experience a new type of social gameplay!\nVelvet Sundown is a social multiplayer role-playing game, taking place on a luxury yacht cruising the waters of a fictitious Caribbean state of Balbonia. Embark on a journey full of conspiracies, trickery and secrets where you can never tell a friend from foe.\nIn the beginning of each game you are assigned one of the 11 readymade characters at random. Each character has their own unique agenda to pursue, as well as a randomized goal to strive for. Fulfilling your objectives might not be as easy as it seems though: as everyone else has their own secrets, some of the people aboard might not be as willing to co-operate as you would like. It is up to you to use your cunning, wits and social skills to get what you want and avoid spilling your own secrets.\nThe scenarios are always multiplayer and require a minimum of 4 players, which means that every character you see is played by a real person. This also means completing quests always requires freeform chatting and interaction with the other characters.\nVelvet Sundown is based on the Dramagame engine developed by the Finnish game developer Tribe Studios Ltd.Key Features\nThe first entertainment title ever to use revolutionary Dramagame mechanics and technology\nEndless replayability: players' actions affect how each scenario plays out, so every session is truly unique\nUses high-quality text-to-speech technology by Acapela to enhance immersion\nNo grinding, no killing, no looting – just 100% pure role-playing","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tribe Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":581213,"name":"Intravenous","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d39/d39681042f1ba444be99340c89db4528.jpg","description":"A LOVE LETTER TO EARLY SPLINTER CELL GAMES\nYou just entered the warehouse through the vent shaft as you hear voices from outside. They know you’re here. Someone must have tipped them off.\nYou continue to stay in the shadows. You shoot out lights, flip off circuit breakers and lockpick doors. You are a silent assassin.\nYou distract the guards by throwing bottles or imitating their wives voices. One by one you pick their lights out.\nFuck. You’ve been compromised. You shoot out the next door lock and go in guns-blazing. In an adrenaline filled shootout you eliminate your target and barely manage to escape. Well done!\nEnter the world of Intravenous as Steve Robbins - a man set out for revenge after losing his brother to low-life junkies. Delve deep into the criminal world under the guise of darkness or go armed to the teeth, guns-blazing, and padded with armor.\nOld-school stealth. Your visibility depends on how well-lit the environment is, and every step you take makes noise.\nTeeth-grinding action. Fun stealth gameplay does not exclude fun gunplay. Intravenous is meticulously designed to offer stealth for those looking for it, as well as no-brakes gunplay to those itching for a gunfight.\nReactive AI. Your enemies will do more than just rush straight at you. If they've found a dead body they will alert their friends in hopes of finding you. If they hear you sneaking about, they will investigate. If they see you, they will open fire. If they're unarmed, they will try to find their friends and warn them of you.\nCapable enemies. Enemies take cover during gunfights, use flashlights in darkness, and radio in suspicious activity. Any misstep you make will result in your opponents responding appropriately.\nLots of weapons. Multiple weapons, each with their unique handling. Each works best in a specific situation. You're sure to find your personal favorite here.\nChoose your loadout. Pick a rifle, a pistol, and a bulletproof vest to be ready for combat, or just a pistol and naught else, to be quick, agile, and silent- ready for improvisation.\nAdapt to your surroundings. Shoot lights out, crawl through vent shafts, flip circuit breakers off, throw bottles to distract your foes, lockpick doors to find alternative ways in - or simply shoot the door lock out, and go in guns-blazing.\nA gritty story. Steve Robbins lost the single most important person in his life - his brother. With aid from a mysterious person claiming to have suffered a similar fate, he decides it's time to take matters into his own hands after the police turns up empty-handed. Nothing is as clear cut as it seems to be.\nUncapped frames per second. 60hz display? Yep. 144hz? No problem. Enjoy the swift action or edge-of-the-seat stealth on your preferred monitor refresh rate.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Roman Glebenkov","platforms":[{"id":0,"name":"PC"}]},{"id":46502,"name":".hack//G.U. Last Recode","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e7/1e7a15446704ebf235ce49660d1db0a2.jpg","description":"Log back into the .hack//G.U. trilogy and return to “The World,” as Haseo tracks down Tri-Edge in .hack//G.U. Last Recode, now with enhanced graphics, improved gameplay, and brand new modes!\nThis collection includes all 3 original .hack//G.U. titles, Rebirth, Reminisce, and Redemption, all fully restored and remastered. As well as an all new exclusive 4th Volume: .hack//G.U. Reconnection.\n• 15 years of .hack – Celebrate the 15th anniversary of the beloved global cross media franchise that first released in 2002\n• Fully restored – Graphically enhanced gameplay and cut scenes now in 1080p and 60fps\n• Improved system features – Enhanced battle balance and game pacing to provide an optimal experience for new and old fans alike.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":25131,"name":"Pokémon Diamond, Pearl","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47b/47b915b28e72ead7a1775f057af421f6.jpeg","description":"Pokémon Diamond and Pokémon Pearl, exclusively on Nintendo DS, prove\nthat the next generation of Pokémon games is taking the hugely popular\nfranchise to amazing new levels.\nPack Your Bags\n\nPokémon Diamond and Pokémon Pearl take place in an all-new region called\nSinnoh. When you set off on your travels, you'll be able to play as\neither a boy or girl Trainer. Pokémon fans have caught glimpses of Mime\nJr., Lucario, Munchlax and Weavile in Pokémon movies, and these Pokémon\nwill be debuting in this adventure.\n\nPokémon Diamond and Pokémon Pearl will challenge you to explore the\nSinnoh region in an incredibly deep RPG adventure. Before your quest is\ncomplete, you'll meet over 100 new Pokémon and challenge countless\nTrainers along the way. Like previous core Pokémon titles, these games\nfeature an engrossing storyline and well-balanced RPG action.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":1412,"name":"Colin McRae Rally","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9d0/9d00759cfee271efc3a0e3e945608bcd.jpg","description":"Hit the dirt in Colin McRae Rally -  the classic off-road racing experience\nColin McRae Rally features the car and track list from last year’s top selling mobile title and features THIRTY amazing rally stages in three environments taken from the PlayStation classic Colin McRae 2.0. for this PC and Mac edition. With a combined distance of over 130km, go flat out through the dirt and the dust of the Australian outback, take on dramatic climbs through the mountains of Greece and get sideways on the tight and twisty roads of Corsica.\nTHE CARS\nGet behind the wheel of four legendary rally cars, the Subaru Impreza, Mitsubishi Lancer Evolution VI, Lancia Stratos and Colin McRae’s Ford Focus. Pace notes read by professional rally co-driver Nicky Grist help you fully commit through each and every stage.\nTHE CONTROL\nFeel the thrill of putting pedal to metal across different surface types and blast through beautiful, challenging environments. Race with a range of pads, including Xbox 360 and PS3 controllers.\nTHE CHALLENGE\nTake on different game modes including quick races, full rallies and Championships, post your best time to the leaderboards and unlock achievements.\nCOLIN MCRAE RALLY – THE CLASSIC RALLY EXPERIENCE RACES ONTO PC AND MAC","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Codemasters","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1099,"name":"Batman: Arkham VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ce4/ce4b8dac56df7e0b20052033bf207372.jpg","description":"Batman™: Arkham VR immerses you in the Dark Knight's Universe and redefines what it means to be the Batman.\nExperience Gotham City through the eyes of the World's Greatest Detective in an all new Arkham mystery.\nThink like Batman. Utilize his legendary gadgets in Virtual Reality to unravel a plot that threatens the lives of Batman's closest allies.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]