[{"id":327225,"name":"FINAL FANTASY XIV: Shadowbringers","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6b8/6b804883ffc31bc1b811dd96c54d901f.jpg","description":"Warriors of Light─Embrace the darkness and forge a new fate in the latest expansion to the critically acclaimed online RPG.\n\nExplore breathtaking new environments, unlock new playable races, master exciting new jobs, and fight alongside prominent characters with the new Trust system as you embark on a new journey as the Warrior of Darkness!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":262419,"name":"Google Spotlight Stories: Age of Sail","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/103/103275fc477a1a16b5fbe268a0999067.jpg","description":"Age of Sail VR is the story of William Avery (Ian McShane), an old sailor adrift and alone in the North Atlantic. When Avery rescues Lara, who has mysteriously fallen overboard, he finds redemption and hope in his darkest hours. Official selection Venice Film Festival.\nDirected by ACADEMY AWARD-winning filmmaker John Kahrs.\nProduced in collaboration with Chromosphere and Evil Eye Pictures for EMMY Award-winning Google Spotlight Stories.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Google","platforms":[{"id":0,"name":"PC"}]},{"id":254410,"name":"Lost in Vivo","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cdb/cdb223d23d3e25120da5b6e10dabccb1.jpg","description":"A horror game about claustrophobia.\nDuring a storm your service dog is forced down a broken sewer drain. You find the nearest sewer entrance and run in after it.\nAlong the way you will meet others that are also stricken by abnormal or psychological fear. You may be able to help them, just as you may be able to free yourself, but just as likely, they and you may be beyond help.\nThis game has controller support but you must first click past the graphic options. Do not rebind any of the keys if you plan on using the controller. The menus are hard programmed to the controller input's not the button labels, and currently there is no support to open the steam overlay with a controller.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Akuma Kira","platforms":[{"id":0,"name":"PC"}]},{"id":60547,"name":"Fox Hime Zero","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15d/15d794ae136dcfb3fb083a92197ed150.jpg","description":"PS.Trading Cards and Achievements will come out with the final version.*Game Introduction *--「The more we learn, the more ignorant we get.」\nThis is an era of discovery. The industrial revolution has just demonstrated its power. With the increasingly emerged new technologies, human beings are free from natural sensory limitations, and the frontier of the cognitive world is expanding at an unprecedented speed.\n“Yan” is a student of natural history. By coincidence, he has been sent to a natural observation station in the mountain for scientific research......\n「Though the work is plain and dull, I can discover nothing significant if giving up halfway.」\nHe starts his journey of discovery with this belief.\nOn the way to the unknown world, who is waiting for him? And what would happen between them?*Game Features*Dynamic Live2D pictures, even 2D characters are vivid(especially ears and tail!) Dubbing throughout the game according to Live2D pictures\nElaborate CG\nDynamic Performance* Character Introduction *Mori\nCV:円木左右子\nAge: 18 / Height: 163cm\nA feisty fox spirit, living in a temple in the mountains with Lord Sky Fox since childhood. She has little understanding of the human world, so she is full of curiosity.\nLord Sky Fox\nCV:紅葉美兎\nAge: appears to be 25, no one knows her actual age ? /Height: 168cm\nA serious adult fox spirit who processes enigmatic ability like a god. She lives with Mori and cares for her, but not knowing how to express.\nShe seems passive and reclusive, perhaps because she is well-informed.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"AsicxArt","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":46322,"name":"Wattam","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/15b/15bcd36dc56def7ce4e360110be250b8.jpg","description":"From the imaginations of Keita Takahashi (creator of Katamari Damacy) and developer Funomena comes the weird, wild, wacky, whimsical world of Wattam.\nMAKE NEW FRIENDS\nThe Mayor invites you to explore the colorful world of Wattam and bond with over 100 unique and carefree characters. The connections you form open a treasure chest of possibilities - playing, switching, stacking, climbing, chasing, floating, exploding and/or dancing all in the name of fun.\nEXPERIENCE JOYFUL EXPLOSIONS\nThe Mayor loves creating colorful explosions. The more joyful the explosion, the more characters will come and play.\nHAVE ENDLESS ADVENTURES\nDiscover what’s possible when you abandon all preconceived notions about what it means to play in games. Learn about the different origins of Wattam’s citizens, then work together with them to solve weird puzzles, celebrate special events and explore your imagination to its fullest.\nEXPLORE AWESOME MUSIC\nEach character in Wattam has their own unique melody. Characters can also chain together to create whimsical mashups.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Funomena","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":30655,"name":"James Bond 007: NightFire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9dc/9dc7f2a8f9c50b1650ce5b4626daf4e8.jpg","description":"DO YOU HAVE WHAT IT TAKES TO BE BOND?\n\nDeadly, and sometimes familiar villains - like ODDJOB AND JAWS - make every move a potentially dangerous one.\n\nONLINE BATTLES with up to 32 people and challenging AI enemies in more than 15 exotic locations deliver the most challenging multiplayer action ever.\n\n9 ACTION-PACKED, single-player missions filled with beautiful women and treacherous enemies, demand your immediate attention and utmost skill.\n\nSPECIAL GADGETS including Q-Specs for infrared, night, and X-ray visibility, the Phoenix suitcase turret gun, and the laser watch.\n\nYOU HAVE 60 SECONDS TO SAVE THE WORLD. GO.\n\nRun by the well-known international industrialist Raphael Drake, the Phoenix corporation has been in the news lately for its efforts to decommission nuclear weapons. Recent intelligence, however, suggests that there are more sinister motives behind Drake's activities. Once again 007, the world needs you.\n\nINFILTRATE a heavily fortified mountain castle near the Austrian border.\n\nPROTECT innocent hostages at a Japanese estate guarded by highly-trained and heavily-armed assassins.\n\nBE VIGILANT at all times in your mission to stop Drake, and always remember that no one, not even your closest allies, can be trusted.\n\nENGAGE in low-gravity combat inside a space station armed with nuclear missiles.\n\nDEFEAT Drake's army of elite paramilitary commandos on a nearly deserted South Pacific island.\n\nDO MORE IN ONE MINUTE than most people do in a lifetime.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Aspyr Media","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":28417,"name":"Contra","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79f/79f15eeda71f7534d58bacc55ae50ec0.jpg","description":"Single Player, Live Multiplayer 1-2, HD (High Definition). Relive the fun of this arcade classic! Help Lance and Bill rid the world of Red Falcon and all its alien minions! The full version includes access to all levels, Co-op multiplayer modes, a range of challenging achievements, and the ability to see how your scores compare to others! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Digital Eclipse","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28411,"name":"Afro Samurai","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/513/513106f6a8ed84e7ac3fa541d336ca14.jpg","description":"The quest for #1 comes to the Xbox 360! Afro Samurai is an action-adventure game featuring never before seen combat mechanics, stunning visuals, and an amazing cast of characters creating a brutally fresh entertainment experience. Afro Samurai utilizes a dynamic cross-hatching art style and cut-scene paneling that makes the game look like a comic come to life while its innovative combat system gives players the ability to dynamically cut enemies at any point in the body. Starring Samuel L. Jackson & featuring a hip-hop musical score produced by The RZA of Wu-Tang clan fame, Afro Samurai blends contemporary street and Japanese culture in the stylish world created by Takashi Okazaki and animated by revered animation studio, Gonzo. Follow the epic tale of Afro Samurai as he seeks vengeance against Justice, who murdered his father. Nothing personal... It's just revenge.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22382,"name":"Bermuda","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff8/ff87acffd092d8d9af4a95340c2c6cb0.jpg","description":"A camp trip goes wrong for Edward and his friends as they are abducted into an alien submarine. They now await to hear if they will be allowed home, or be executed inside this ship. Edward wants to trust the aliens will make the right choice, but as the decision looms, doubt begins to whisper in his mind.\nBermuda is a visual novel mixed with open ended stealth puzzles. The game is fully voiced, featuring the talent of veteran actors such as Cristina Vee (Madoka Magica), Kira Buckland (Blue Exorcist) and Kyle Hebert (Dragonball). Xanthe Huynh and Skyler Davenport from Unhack also make a return, as well as voice actor Miguel Moran. For players who prefer to read the story like a traditional novel, each character's voice can be toggled individually.\nRunning at around an hour in length, Bermuda aims to be a succinct story that players can enjoy around their busy schedules. Each episode features bonus conversations, giving players a chance to know the cast better.\nIllustrations: Alastair Sew Hoy\nMusic: Matt Hamm\nA demo version of Bermuda is available! Please consider checking it out first to ensure the game runs well on your machine.\nThank you! I hope you will find the experience valuable.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"InvertMouse","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22016,"name":"LoveKami -Useless Goddess","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/580/580ac7073f8ab287d4f37c989121efd3.jpg","description":"\"I took in a goddess!\"\nIt was after the descent of uncountable goddesses in Japan...\nMost goddesses were able to blend in with humans, living peacefully and happily together. Some of those goddesses even went on to become idols.\nHowever, there were others who simply refused to follow the rules. These goddesses prefer living freely and doing as they please, inadvertently causing all sorts of trouble for humans.\nGoddesses who are naughty are called Aragami.\nThe protagonist, Sho Narumi, stumbles upon a goddess who collapses on the street and attempts to help her. Soon enough it is revealed that she's the Aragami who had been causing frequent power outages in one small-town area of Tokyo. Sho decides to protect his beloved hometown by helping the goddess to get rehabilitated!\n\"Rehabilitate the goddess!\"\nWait...aren't goddesses supposed to help humans?\nWith the setting moving from Akihabara to a quiet small-town area of Tokyo, the story of one naughty goddess's rehabilitation begins now!Story BackboneThe story roughly remains the same, there's just something that's a little different...\nThis is the tale of an unusual goddess set in a slightly different Japan.\nThe Goddesses Descend!\nIt was a time when people had forgotten their dreams and lost faith.\nThe silhouettes of goddesses revealed themselves to the people who then could only believe in what they saw right in front of them.\nThe confusion surrounding the countless goddesses appearing in Japan could be explained due to Amaterasu Omikami wanting to teach the goddesses about the human world.\nAll of this brought about the implementation of the Divine Education Act.\nConsequently, the goddesses were able to learn, familiarize, and communicate with humans.\nThis cross-cultural exchange between goddesses and humans helped to show the world's many colors.\nAn Aragami brought down to the world by the Divine Education Act.\nShe's a naughty goddess who skips school.\nAlthough she possesses the power to manipulate electricity, since she's an Aragami, she can only make electricity go haywire.\nShe accidentally causes power outages when angry or irritated.\nSince she easily gets angry, she causes power outages almost every day somewhere in town.\nThough she'd like to be in control of her power, things always spiral out of control when she tries to use them.\nThis doesn't bother her, since she figures it's only natural for an Aragami, such as herself, to cause messes here and there.\nShe's stubborn and does what she wants, but it's not because she won't listen to instruction, she just doesn't want to do what she doesn't understand.\nShe gets a kick out of teasing Sho by trying to seduce him.\nShe also occasionally pulls pranks on Sho and seduces him in front of Maika to make her jealous.\nAn earth goddess dispatched to rehabilitate Akane who keeps causing damage to the town by not following the Divine Education Act.\nThis goddess is serious and focused, but innocent; she doesn't seem to know a lot about certain things.\nDespite being the local earth goddess, she never acts arrogant, and instead talks politely to everyone.\nShe is charming and elegant, but is also fairly clumsy.\nShe is easy-going, with a docile personality, but brings heavy rainfall to the town when she gets angry.\nAlthough she rarely gets angry, once she does, the damage she inflicts is incomparable to Akane's.\nShe broods over the fact that she has no prominent advantages over other goddesses, and hates to get mislabeled as a \"dirt goddess.\"\nBecause of her laid-back personality, she doesn't really care even if Sho sees her naked.\nShe'd even ask if he'd like to touch her chest.\nSho's junior, landlady, and close childhood friend.\nShe's just your average fashionable girl.\nHer looks are stylish and she loves wearing makeup.\nContrary to her appearance, she's rather diligent and capable.\nShe has feelings for Sho, but can't find it in her to confess.\nAlthough she works as the apartment landlady with her mother while attending school, she often makes comments about not caring if the old building gets demolished.\nIn actuality, she's a good kid and is serious about looking over the apartments.\nShe's tsundere, and wants to continue living there together with Sho.\nSometimes she gets jealous when Akane or Inori gets too friendly with Sho.\nEven though she seems to know about the adult world, she blushes intensely only when Sho sees her underwear.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"MoeNovel","platforms":[{"id":0,"name":"PC"}]},{"id":19965,"name":"Fairy Tale Mysteries 2: The Beanstalk","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f9/7f9f0ffbdaf5204a0bda34090919b5d2.jpg","description":"A long, long time ago the world was the stage of the struggle between the sinister giants and the noble race of peace-keeping guardians.\nAfter a fierce battle the giants were vanquished, except for one, whom the guardians overpowered with powerful magic and banished to a mysterious land above the clouds.\nThousands of years have passed and the world is once again on the brink of extinction.\nAll thanks to a boy who got hold of some magic beans powerful enough to open a path to the cloud world and put humankind in grave danger.\nTaking on the role of a fledgling detective from the Brothers Grimm Institute, you’ll embark on a journey through magical worlds to find the castle of the last of the giants, and face him using your wits, magic spells, and the protection of the guardians.\nThe fate of the world is in your hands. Are you up to the challenge?\nFeaturesSolve 83 unique tasks related to 15 hidden object scenes!\nExplore 52 locations in 5 diverse worlds!\nFind 400 items hidden in various locations!\nTest your wits in 29 mini-games!\nFind 41 collectible items!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":12871,"name":"Fire Pro Wrestling World","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e08/e0856919272d498ad21fb9425a2344a4.jpg","description":"The greatest grappling game returns to take on the world!\nCustomize every aspect of the match, from your wrestler to the ring itself, in your fight for the championship belt.\nPLAY ONLINE\nOrganize exhibition matches, tournaments, leagues, championship bouts and battle royals with players from around the world.\nMIX UP THE RULES\nModes include Deathmatch (steel cage, barbed wire or landmines), MMA rules and no-holds barred Gruesome Fighting.\nUNLIMITED CUSTOMIZATION\nCreate your dream wrestler from over a thousand devastating moves and even more body parts to battle for custom championship belts. Personalize the ring, mat logos and even the referee!\nREALISTIC SIMULATION\nGive your creations personalities with a robust CPU logic system that defines their every action. Does your wrestler play to the crowd, or play dirty? You provide actors for the ringside drama.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":12112,"name":"Bunker Punks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2b/f2b117deb509558b5304f8e147cd5d35.jpg","description":"Bunker Punks is a roguelike first-person shooter set in a dystopian future. You control a group of revolutionaries, raiding corporate strongholds for supplies, weapons and armor. Customize your bunker, strengthen your gang and overthrow the corporate government.\nFeatures:\nCLASSIC FPS GAMEPLAY – Heavily inspired by the classic FPS games of the early 90’s:  High-speed-action, circle-strafing and unloading a stream of bullets into enemies.\nBUNKER BUILDING – Build and upgrade new rooms in your bunker to buff your punks, improve your economy and enable new abilities. It’s a non-linear skill tree for a wide variety of play styles.\nRANDOMLY GENERATED LEVELS – Every level is generated randomly by the game. The layout is different, the enemies are different, the loot is different, even the propaganda posters on the walls are different.  You never know what’s around the next corner.\nCUSTOMIZATION – Combine loot, character attributes and bunker rooms to customize each character in your Bunker Punks gang","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ninja Robot Dinosaur","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5769,"name":"Beyond Gravity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb2/fb2ac72879b0986ba8622ffde43a158a.jpeg","description":"Beyond Gravity is procedurally generated \"platformer\" where you jump in-between planets and try to collect as many pickups as you can. This gets progressively harder the further you jump. No need to worry tho as you can upgrade your character with loads of upgrades and power-ups! Take control of brave space explorer and hold out as long as you can while collecting missing parts of your spaceship. Never miss to build up crazy score multipliers.\nFeatures:\n- Cleverly designed control scheme where all actions in the game are controlled by only one key.\n- Procedurally generated levels ensure non-repetitive and never ending fun.\n- Many goals and upgrades waiting to be unlocked, providing hours of entertainment.\n- Unique, old-cartoon style graphics running at 60fps.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Qwiboo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2089,"name":"Emily Wants To Play","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/976/9762bfd7f122cb9c964b73976fc4b85b.jpg","description":"It’s 11pm, and you are at the last house on your route. The lights are on, and the front door is opened. But, the windows are all boarded up and the grass is overgrown. It seems like a strange place to deliver a pizza, but at least, it looks like someone is home.\nYou run to the front door since it’s storming pretty bad.\n“Hello!? Your pizza's here!\" You announce. No one answers. There's an eerie silence.\nYou are getting soaked from the rain, so you hesitantly step inside the door and look around. The front door suddenly closes behind you.\nYou just wanted to finish this last delivery and head home for the night. Now you must figure out how to get out of this stupid creepy house.\nFreely roam the house and try to figure out what is going on. Three dolls and a strange girl named Emily will also start roaming the house as the hours toll by. Stay away from them, but if you do end up in a room with one, figure out how to stay alive.\nThis may be your last pizza delivery.\n===========================\nMain Objective:\nStay alive through the night and get out of the house.\n-no blood or gore\n-play the game how you want, sit still or run around like crazy\n-turn the lights off or on ;)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shawn Hitchcock","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":1084,"name":"RIGS Mechanized Combat League","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/36d/36dae9a964184acd9470c6d412b60a20.jpg","description":"VR games may cause some players to experience motion sickness.\nPlayStation®VR is not for use by children under age 12.\nPilot your finely-tuned double-gunned sports “RIG” in futuristic custom-built arenas where mechanized combat and sports collide head-on.\nBuild your skills to unlock extra RIGS in the exhilarating single player experience, then team up and go online to take on the world*.\nEnjoy an incredible sense of immersion in this all-action sports shooter – exclusive to PlayStation®VR.\n*Valid PS Plus membership required. Sold separately.\nPlayStation®VR headset and PlayStation®Camera required and sold separately. Quantities are limited and not guaranteed to arrive with your software purchase.\nPlayStation®VR Required\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Sony Interactive Entertainment Europe. RIGS Mechanized Combat League is a trademark of Sony Interactive Entertainment America LLC. Developed by Guerrilla Cambridge.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":601,"name":"Xbox Fitness","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a3/5a3ca7cb2a1de3ea38b733f7bfeb0e99.jpg","description":"Experience the world’s best workouts right in your home on Xbox Fitness.* Train with Jillian Michaels, Tracy Anderson, Tony Horton of P90X®, Shaun T of INSANITY® and more. Buy individual workouts, and get over 30 additional workouts for free with Xbox Live Gold. Only on Xbox One. For an optimized experience, with instant, personalized feedback on your form, power and heart rate, Xbox One Kinect sensor recommended.  Kinect sensor not required to play.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"}]},{"id":967003,"name":"LIZARDS MUST DIE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa3/fa3b8749daa14a09aedc5e8124f4577e.jpg","description":"Epic battles with hordes of lizards and other herods\nAn opportunity to show everyone HEROIC STRENGTH . For the glory of ANCESTORS\nFully voice acted : dialogs have Similar voice for Russian and English made with SteosVoice software (cybervoice.io)\n3D graphics, logs in 8 polygons MINIMUM\nProtection of Baikalsk, the Republic of Tyva and Hyperborea from the invasions of evil lizards\nDrinking the waters of Baikal, and going into battle against the Lizards of Herod and the unholy aliens that decided to seize the holy land of the Rus\nHoly massacre in the name of SVAROG\nExperiencing The blessing of Perun, who gives the Rus a mighty force\nSaving the most beautiful expanses of the Rus land, rivers, lakes, forests and mountains from foreign herods\nGOD-PLEASING festivities throughout the RUS land after the victory over the lizards FOR THE GLORY OF YARILA\nEverything is strictly according to scientific documents\nActive combos and high-speed attacks under a seasoned background for the glory of Perun\nRadislav Bagirov  - skillfully handles a sword and a shield, a thunderstorm of common sense\nVseslav the Sorcerer  is a master of battles with two swords, the most dexterous and fastest Russian, became famous in campaigns against lizards\nDrocheslav son of Sergeus  - A mighty warrior, wielding a berdysh. Everyone is putting together legends about his vitality and immortality.\nGOIDA\nThunderclaps of Perun\nSlavic chest shot\nBlow from the turntable\nFraternal onslaught of the Slavs","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"The Bratans","platforms":[{"id":0,"name":"PC"}]},{"id":787775,"name":"The Pale Beyond","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3b6/3b6e0d530099eae5a4a68cf3c5116ed7.jpg","description":"Five years ago, The Viscount and its crew set sail into The Pale Passage in search of absolute magnetic South. The ship and its crew were tragically lost to the ice, never to be seen again. Her sister ship, The Temperance shall follow in her path, hoping to find answers where The Viscount failed.\nYou didn’t ask to lead this expedition but here you are: stuck in the ice, Captain missing, miles from civilization and everyone looking for you to lead. Manage your meager resources, balance safety and morale, make the hard calls and head in the only direction you can - into The Pale Beyond.\nA polar exploration game set in an unforgiving frozen wasteland where you embark on a treacherous voyage across the ice and into the Pale Beyond. It’s a stunning yet harsh landscape that can change at any moment.\nEvery decision matters. As the expedition unfolds and the winter approaches, every decision you make will have a meaningful impact on the story as you navigate a way over the ice.\nAfter the Captain mysteriously goes missing, you unwillingly take the position of Captain. You didn’t ask to lead this crew but here you are: stuck in the ice, miles from civilization and everyone looking for you to lead.\nKeeping the crew and sled dogs safe, fed, and warm during an expedition is key for survival. Surviving the ice will matter little in the face of a mutiny, every vote will count. So keep the crew on your side.\nInspired by Victorian etchings and historic paintings of the time depicting the ice, each character and environment has been drawn by hand. The result is a unique artstyle with an expressive cast to see you through the cold and grim environment of the ice.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Bellular Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":717042,"name":"Overprime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/969/96962567d75b5c2408344208a51abf60.jpg","description":"Assemble your team. Build a strategy. Play for free!\nOverprime is a strategic action TPS MOBA where two teams of heroes battle to destroy each other's base. Choose one of the powerful heroes with unique skills, and work with your teammates to achieve the Prime Battlefield goals. Speed across the battlefield with the Prime heroes and feel the thrill of the action.\nDominate the battlefield!\nLead the team with the tactical use of the powerful skills! Use wisely each hero's skill to build a unique strategy to conquer the opponent's base. Cooperate with your fellows to discover new ingenious ways of team fight. Unite, mastermind and lead your team to victory!\nYou win or lose by the way you choose!\nThere are several heroes, and each hero is unique with specific skill sets and battle techniques. The choice of items you equip your hero with may determine an outcome of the battle. Try out different sets by customizing various items to make your hero undefeatable. In Training Mode, you can test different heroes and items, improve your playing skills and find new ways of utilizing the battlefield. New heroes will constantly be added in the future, so you will never cease to enjoy trying out new sets and combinations.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Netmarble F&C Team SoulEve","platforms":[{"id":0,"name":"PC"}]},{"id":447828,"name":"Vagrus - The Riven Realms: Prologue","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec4/ec43e63baa9ec0d508855f91b36d1d44.jpg","description":"ADD THE FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/909660/Vagrus__The_Riven_Realms/?snr=1_5_1100__1100\nAbout the Game\nVagrus - The Riven Realms: Prologue is an early Demo to Vagrus - The Riven Realms, a roleplaying game with a narrative focus, open-world exploration, and strong elements of strategy. The player takes the role of a vagrus - a caravan leader who strives to survive in a strange and dangerous dark fantasy world by leading a traveling company on all kinds of ventures.\nVagrus  is currently in development (in late Alpha) but it already has over fifty hours of playable content. The game is coming to Steam in the form of Early Access in the near future.\nThis Demo showcases the beginning sections of the game - both from the more narrative-driven introductory part and from the open-world main campaign.\nA vast realm is yours to explore, filled with unique locations, strange factions, and a colorful cast of characters. In order to punish the Empire for its sins, the Elder Gods unleashed their power a thousand years ago that ended up devastating the realms. The continent is now a wasteland, riddled with arcane anomalies, swarming with twisted monsters, and haunted by roaming undead even after long centuries of rebuilding.\nA large selection of stories make up the game’s narrative in the form of events and quests. The choices you make in these often affect your companions and the world around you. Pick your background from trader, mercenary, or explorer; work for factions, follow rumors and trading opportunities; acquire wealth, gain fame, and discover hidden knowledge.\nEngage in turn-based, tactical combat that involves your companions and a large variety of enemies, both humanoid and monstrous. Use a wide range of character skills as well as your own leadership-related abilities to succeed. Positioning and support skills are of paramount importance in these challenging engagements.\nJourneys have to be planned and prepared for carefully, lest they end in disaster. Manage your supplies, morale, and your crew’s vigor effectively to survive. Haul cargo and valuables across the wasteland or take it from others. Your crew of workers, fighters, scouts, and slaves have to be managed well to optimize their effectiveness.\nRecruit from a wide variety of companions to have them serve in versatile caravan roles, such as scoutmaster, guard captain, treasure hunter, or beast handler. Each companion comes with unique combat skills, background stories, and personal quest lines that can upgrade them further when you complete them.\nFollow and Wishlist Vagrus now.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Lost Pilgrims Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":428894,"name":"Helheim Hassle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb4/eb4aa1356efa3e0d8a061297acfffe18.jpg","description":"Helheim Hassle is a narrative adventure game that is as much about friendship as it is about body parts.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\nFrom the same universe (and set on the same Tuesday in fact) as previous hit Manual Samuel, comes this macabre adventure where you play as Bjørn, a pacifist Viking who hates the idea of dying and going to Valhalla… who then ends up dying and getting taken to Valhalla. When Bjørn is resurrected to assist with a task for the mysterious Pesto, he sees a way to negotiate his way out. Using Bjørn’s undying corpse with its ability to detach and combine limbs at will, players must solve challenging puzzles and navigate tricky levels in order to retrieve a certain magical item... In return, Pesto will try to grant Bjørn a permanent residence in Helheim - what a hassle!\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n14 levels90+ puzzles80+ interactable characters3,700 lines of spoken dialogue performed by 24 professional actors\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Perfectly Paranormal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":249971,"name":"Sakura MMO","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d03/d03a487b832b984ef899db0e59606883.jpg","description":"Dive into the magical world of Asaph Online in this visual novel, where Kotone is a feared dark witch with impressive and extensive magical powers, capable of defeating the strongest of foes with a snap of her fingers.\nIn real life, however, Kotone is an average woman who works an average job, with a below average relationship with her estranged parents.\nEvery day that passes is the same, and Kotone soon grows tired of her monotonous routine. If only she could enter a world like Asaph, filled with fantastical creatures and frightening monsters… but Asaph Online is only a game. There’s no way a game could ever become a reality.\nAt least, that’s what Kotone used to think – until a mysterious force summons her to the world she has traversed so many times through her computer screen.\nNow, Kotone isn’t just Kotone, but the dark witch Viola – and, freed from her societal obligations, she finally decides to have some fun!\nViola is the name Kotone gave to her character in Asaph Online. Upon awakening in Asaph, Kotone inherits Viola’s appearance, her magical powers, and her name.\nViola is a dark witch with unimaginable powers, who is feared by everybody in Asaph. Many have tried to challenge her, but none have emerged victorious. She enjoys grinding people down beneath her heel (sometimes literally), and treats those around her as little more than playthings.\nShe’s a deeply sadistic, dangerous woman… but even she has a soft side.\nNeve is Viola’s trusted most trusted maid, who would do anything to help her mistress.\nNeve is a member of the darkling race, which is reviled throughout Asaph as being savage and hostile, but Neve eschews these unfair perceptions. She is a diligent, loyal, industrious girl – but she may be a touch too devoted. She adores Viola, and becomes irrationally angry at any perceived slights against her beloved mistress.\nSelf-sacrificing and hard-working though she is, Neve can be rather scary when she wants. If she were to fight seriously, she may even be able to defeat demons.\nFion is a young, put-upon lass from a huge family, who works hard to ensure all her brothers and sisters have enough food to eat…\nAt least, that’s what she says, but Neve isn’t entirely convinced.\nFion might look like a sweet, innocent thing, looks can be deceiving, and she’s far craftier than she initially appears.\nfantasy based Visual Novelexperience the world of Asaph Online through the eyes of Kotoneavailable in English and Chinese","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":106419,"name":"Synergy ( Ske)","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a3/4a3d5b275e94d8a063f4b88f78a1e816.jpg","description":"A small game made in (under) 48 hours for the GMTK Jam.\nGet the green ball to the goal using your grapple beam.\nFeatures:\n10 levels of mostly increasing difficultyFancy transitionsSoundsGraphics (kind of)\nControls: Mouse :) (Note: real mouse (or touchscreen) recommended, trackpads = bad time)\nPress R to restart if you somehow get yourself in an awkward situation.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ske","platforms":[{"id":0,"name":"Web"}]},{"id":45872,"name":"Hide and Seek","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/024/0248eee0e88fca722563126a5ed2befe.jpg","description":"In Hide and Seek, players get to choose whether they want to be the one hiding or seeking.\nIf you choose to hide, you will have 30 seconds to find a spot to conceal yourself so that the seeker cannot find you. You can collect yellow objects in the game while hiding to increase your score. However, be careful not to step on anything that could give away your location, such as loud objects or objects that can leave tracks. If you choose to seek, you will have to find and catch all the players who are hiding in the game within a limited time. You can use clues such as footprints and other indicators to help you locate the players. Be quick and attentive, as players may be hiding in clever and unexpected locations.\nIn addition to the core gameplay, players can also help free other players who have been caught by the seeker, adding a cooperative element to the game. With its simple yet addictive gameplay and the option to play either as a seeker or a hider, Hide and Seek offers hours of fun for players of all ages.\nGame features :\n- Different game modes: Hide or Seek\n- Different maps: play in a variety of maps with different environments and hiding spots.\n- Power-ups: Collect power-ups that can give you an advantage in the game, such as speed boosts, invisibility, or the ability to distract the seeker.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Blockman Go Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":41627,"name":"Plants vs. Zombies 2: It's About Time","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/511/511a5cb40253866cbcf18bc773a62825.jpg","description":"Play the award-winning hit action-strategy adventure where you meet, greet, and defeat legions of hilarious zombies from the dawn of time, to the end of days. Amass an army of amazing plants, supercharge them with Plant Food, and devise the ultimate plan to protect your brain.\n100 Million Downloads – This app has received more than 100 million overall downloads.\nDISCOVER HUNDREDS OF PLANTS AND ZOMBIES\nCollect your favorite lawn legends, like Sunflower and Peashooter, along with hundreds of other horticultural hotshots, including creative bloomers like Lava Guava and Laser Bean. Go toe-to-missing-toe with a massive array of zombies at every turn, like Jetpack Zombie and Mermaid Imp – you’ll even have to protect your brain from rampant Zombie Chickens!\nGROW POWERFUL PLANTS\nEarn Seed Packets as you play and use them to fuel your plants like never before. Power up attacks, double-down defenses, speed up planting time, and even gain entirely new abilities. Boost your plants to ensure those zombies are lawn-gone!\nJOURNEY THROUGH SPACE AND TIME\nBattle across 11 crazy worlds, from Ancient Egypt to the Far Future, and beyond. With more than 300 levels, ultra-challenging endless zones, fun mini-games, and daily Piñata Party events, there’s always a new challenge to complete. Plus, ready your best defenses – Dr. Zomboss is waiting to take you on at the end of every world!\nEXPLORE MORE WITH THE TRAVEL LOG\nStumped about where to go next? Consult your Travel Log to embark on exciting Quests created just for you. Complete Scheduled Quests before time runs out, or take on a series of Epic Quests and earn special rewards.\nRequires acceptance of EA’s Privacy & Cookie Policy and User Agreement.\nBy installing this game, you consent to its installation and the installation of any game updates or upgrades released through your platform. You can turn off automatic updates through your device settings, but if you do not update your app, you may experience reduced functionality.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":41606,"name":"Family Guy: Back to the Multiverse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/afb/afb42c450a09341ac1f567071f612c33.JPG","description":"The Games on Demand version supports English, Italian, German, Spanish.  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  Everyone’s favorite foul-mouthed baby Stewie stars alongside his faithful booze hound Brian in the Family Guy event of the year: Family Guy: Back to the Multiverse!    Save Quahog from utter annihilation!  Stewie and Brian team up in an original Multiverse-spanning adventure to stop the evil Bertram from destroying everything!  • Bizarre Universes: Battle through all new demented universes that only the show’s writers could create.  • Extra-Dimensional Action: Face off against whacked out foes in INFILTRATION! and Multiverse Madness Modes.  • Create Epic Beat Downs: Switch between Brian and Stewie on the fly or grab a friend and play in 2-player Co-Op Mode to take down the enemies in the multiverse!  • Familiar Faces: Take the reins of 10 different characters plucked from the show and pit them against each other in 4-person local multiplayer!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Heavy Iron Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":25198,"name":"Metroid Prime 3: Corruption","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ed/1eded24fa739e8edfbae7a0ec931e8f7.jpg","description":"Stop the unstoppable Dark Samus\n\nIf you think you knew what it felt like to be the bounty hunter behind\nthe visor, think again. The Galactic Federation's network computer,\nAurora Unit, is suddenly and completely corrupted with something like a\nvirus. The Federation believes Space Pirates may be behind the problem\nand are soon attacked. Samus and other hunters leap to their defense\nonly to find that the enemy they face is Dark Samus, armed with immense\npower that no one can withstand.\n\nFirst-Person Perfect: Players control Samus by moving with the\nNunchuk and aiming with the Wii Remote controller, allowing for a\nlevel of immersion unlike anything they have ever experienced. It's a\nquantum leap in first-person control.\n\nWonderful Weapons: Samus employs well-known power-ups like the\nGrapple Beam and Morph Ball, as well as new surprises, to help her\nsurvive. Using the Wii Remote and Nunchuk controllers, players will be\nable to grasp and pull things by using actual arm movements, as well\nas execute amazing feats like aiming and blasting in midair or at a\nfull run.\n\nPhazon's Powers: The game also incorporates a new system\ninvolving Phazon. If you fill Samus' Phazon supply to a certain level,\nSamus will temporarily go into hyper mode, a state in which she can\npull off incredible feats. On the flip side, if she exceeds the\nmaximum Phazon level, she'll perish. Also, for the first time in the\nMetroid series, Samus' ship will be used in active game play.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Desconocido","platforms":[{"id":0,"name":"Wii"}]},{"id":21083,"name":"The Graveyard","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ff/5ff817b9241e4ed46c815324e82f6f2c.jpg","description":"The Graveyard is a very short computer game. You play an old lady who visits a graveyard. You walk around, sit on a bench and listen to a song. It's more like an explorable painting than an actual game. An experiment with poetry and storytelling but without words.\nBuying the full version of The Graveyard adds only one feature, the possibility of death. The full version of the game is exactly the same as the trial, except, every time you play she may die.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Tale of Tales","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19471,"name":"Global Ops: Commando Libya","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e51/e5171437bb4574dda85a9535cbb9358d.jpg","description":"January 21, 1968… A B-52G bomber crashes in the Arctic Ocean and an atom bomb goes missing. It has remained missing... until now… The CIA has learned that a notorious Russian mafia boss, Yebievdenko, has the weapon and wants to sell it to a ruthless Libyan ruler. As a member of a special unit, you must stop this deadly arms deal. The destiny of the world is in your hands!\nA special kind of third-person action shooter: set out in breathtaking pursuit of dangerous terrorists!\nDiverse missions and a series of new assignments: complete all the challenges; action-packed combat missions, stealth missions and hot pursuits in vehicles!\nA massive arsenal of different weapons and vehicles: use all the means available to you to catch the criminals!\nHours of gameplay fun: either solo or with friends: complete 9 single-player levels and show what you’re made of in 3 different online Multiplayer modes!\nDetailed graphics: fight in realistic settings from Greenland to Libya!\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Spectral Games","platforms":[{"id":0,"name":"PC"}]},{"id":18679,"name":"Commander: Conquest of the Americas","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70b/70bb941ecdf1f776a7c12d717d5d07b8.jpg","description":"Combining elements from both trading and strategy games, Commander: Conquest of the Americas will appeal to a wide range of players.  Players take charge of one of the many European powers aiming to conquer the New World. Starting from 16th century, players can choose from many different nations, each with their own unique strengths and weaknesses. Founding new colonies and then making them thrive is key to success. In order to accomplish this, players need to manage and optimize resources and production in their colonies, before transporting the goods to other colonies or back to Europe.  Rival powers and Native Americans can prove to be allies or enemies, depending on the player decisions. Hostile fleets engage each other in highly detailed tactical level. Players can command their ships in RTS fashion or take direct control themselves.\nFeatures\nConquer the New World\nChoose from 7 different European factions\nManage your colonies and their resources, production, military, and much more\nGame world spanning from the Caribbean to Hudson Bay\nNaval battles with as many as 30 ships in varied environments and 2 different control modes\nInteract with both the European powers and the natives\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Nitro Games","platforms":[{"id":0,"name":"PC"}]},{"id":15386,"name":"Access Denied","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8d/c8d4aa4a85a53dfe447a30d852a1b782.jpg","description":"Access Denied is a puzzle game in the world where for storage of personal data are used special device in the form of protected boxes. Imagine yourself in the role of the professional cracker of such devices and test your skills for 36 different levels.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":13083,"name":"FreeCell Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09b/09b96c335bbc1be1a40a87e9fb4e7225.jpg","description":"FreeCell Quest is an RPG FreeCell game. You’ve never played FreeCell like this before!\nWhen an archmage takes control of the entire continent of Selvarin, the world’s most powerful wizards try and fail to defeat him in battle. You are a young wizard, a master of cards, and you may have what it takes to outwit him.\nThe better you play, the stronger you become. Get heroic loot and collect cards to unlock new free cells. Level up to become more powerful and gain amazing skills. Travel across a vast and mysterious land, playing game after game as you prepare for your final battle.Game FeaturesPlay free cell battles with up to 104 cards on the board at once.\nGain rewards and experience from your victories.\nFind and buy awesome loot to become more powerful.\nLearn spells to help you with the difficult challenges.\nCollect cards to unlock more free cells.\nDodge attacks coming from buried cards by uncovering them.\nEnjoy exploring a huge world with 533 unique towns on your epic quest of card sorting!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Legend Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11333,"name":"Audioshield","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc6/cc65d17c109bb1df9616f3774c13c4eb.jpg","description":"\"Audioshield: Feels like music-melee Missile Command-and we love it\" (Ars Technica)\n\"AudioShield -- a rhythm game -- is HTC Vive's killer app\" (Jeff Grubb, VentureBeat)\n\"Let's punch the hell out of music in virtual reality with Audioshield\" (Polygon)\n\"Audioshield found some neuroreceptor in the deepest cavern of my brain—one that can only be stimulated by an incredible combination of sight, sound, and motion—and flooded it with a sensation that has left me reeling for days.\" (Ars Technica)\nExperience your entire music collection in VR. Audioshield puts you at the point of impact for every hit in your music. Beats glide in slowly for mellow parts of songs, then ramp up for intense parts of songs with cross-body, double-shield, and high-altitude hits.\nAudioshield uses an advanced version of Audiosurf 2's music analysis system to sync with any song from your collection  - and also with online streaming from Youtube.\nEvery song has its own online leaderboard. Audioshield also supports local leaderboards to easily compete with friends during look-at-my-awesome-new-VR-system parties.\n\"Fighting Music in VR. This is the coolest sh** ever.\" (Jericho)\n\"VR Missile Command inside a neon rave, set to your own music.\" (PC Gamer)\n\"The physicality of standing in place to fend off incoming orbs feels powerful\" (IGN)\n\"...felt like we were being pulled into a futuristic trance-like state with sparks of orange and blue splattering about\" (Maximum PC)\n\"...your music library comes to life as a fully immersive gaming experience\" (UploadVR)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dylan Fitterer","platforms":[{"id":0,"name":"PC"}]},{"id":11165,"name":"Use Your Words","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a85/a85f186fef7fae5abd549ef5b89907ac.jpg","description":"Grab a few friends and get ready to laugh. Use Your Words is the party game for funny people and their unfunny friends!\nUse Your Words is a game that invites players to respond to a variety of mini-games and prompts with the funniest answers they can think of! Players play using their phones and tablets as controllers, making game-play seamless and quick to pick up. Players who get stumped can use one of the hidden \"House Answers\" to lay a trap for their fellow players once it's time for everyone to vote for their favorite.\nWhether you're a total novice or a world-famous comedian, we guarantee hours of non-stop hilarity. So, grab a few friends and get ready to laugh along with Use Your Words!\nFor 3-6 local players (and way more spectators)! Use your smartphone as your controller!Mini-GamesUse Your Words ships with 4 unique mini-games:\nSub The Title: Watch a short clip from a foreign film, then write your own subtitle! Fans of Mystery Science Theater 3000 will love making the actors onscreen say whatever they want in a variety of monster movies, martial arts movies, and some just plain weird films from the past.\nBlank-o-Matic: Fill in the blank to complete the sentence! Instead of waiting to have the funniest card in your hand, write an answer that matches your sense of humor! We've hired some of the funniest writers around to set up the jokes perfectly so that even Grandpa can crack off a zinger or two.\nEXTRA, EXTRA!: Write a hilarious caption or clickbait headline for a ridiculous photo, in a take on the classic \"caption this\" game!\nSurvey Says: Go with your gut in this rapid-fire game show style \"lightning round\"! Features4 hilarious mini-games with tons of content!\nSupport for all HTML5-enabled devices!\n\"Family Mode\" to filter out adult or otherwise controversial prompts!\nA classy vintage soundtrack with songs by legendary composer Bob Thompson!\nHours and hours of playable content with more to come!\nUp to 1000 spectators will be able to watch and vote for their favorite answers!\nNote: This game is played locally, but remote players can play via stream or video conference.\nNote: all included content is in English only. Some trailer footage represents earlier phases of development.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Smiling Buddha Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10225,"name":"MyWorld - Action RPG Maker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/723/723aa135a0527dc9f6506701a31ca4e3.jpg","description":"MyWorld - Where action RPG begins!MyWorld is an action RPG adventure creator with built-in worlds; ready to be conquered and kick-start your imagination. Solid multi-player means you can battle alongside or against friends and foes with PvP and Co-Op modes. Invite players into adventures you've created, explore friends worlds and share on the steam workshop.\nPlayBattle your way through enemies and quests in our pre-made adventures, such as 'The Blight' and 'Mushroom Realm'. Combat is rewarding, learn enemy timings and use 4 special abilities to smash apart your foes. Most world objects are breakable! These worlds amongst others are showcases for what can be crafted in MyWorld. We can't wait to play yours!\nCreateWith a powerful yet easy to use editor, you can create worlds in exactly the way you want to play. It boasts over 350 items including undead skeletons, cursed knights, haunted crypts, towering bosses, homely taverns, friendly NPCS and even a chicken! With the click of a button you can change your world from a foggy blighted land to an enchanted mushroom kingdom, using our 9 world themes. This library is constantly growing, giving you real freedom and creativity for your action RPG adventures.\nNo coding required - you can easily drop in enemies, buildings, bosses, and link your worlds to form huge realms.\nEnemy Creator Craft your own enemies out of a wide selection of body parts, ranging from a pumpkin head to a giant eyeball body! Mix and match left and right limbs. Get creative with the paint pallet, assign glows and metals, fill worlds with enemies straight from your imagination. Body parts can also be hidden to create spooky floating enemies.assign it's behaviour, health, damage and more. Scale options give you the power to change the size of head and overall height.\nWorld PainterGet creative and totally change the feel of your worlds by painting it's contents. From barrels to houses, let the paint flow!\nTell stories, set questsAdd depth into your worlds by easily dropping in NPC's from the editor. Create unique quest chains with kill and collect objectives, harder the quests the more XP you or visitors to your world will get! Tell stories with 'Dialog' only options.\nHub WorldControl everything through your hub world. Create, host, join, watch tutorials on 'MyWorld Tv', change your hero character and more, simply by running over buttons or through portals.\nCommunity & Steam WorkshopRun through the Steam Workshop portal in your HubWorld to access worlds created by users. Download and access them in your world list. Join worlds or host your own via the hub world multiplayer portals, and get to know new players with in game chat.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Game Creators","platforms":[{"id":0,"name":"PC"}]},{"id":9661,"name":"Avorion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/805/80598260513c5b2362e60319ecdc3602.jpg","description":"Avorion is currently in Early Access, and under active development. If you want to know more about that, please read the Early Access disclaimer at the top of the page.\nSeveral hundred years ago, a cataclysmic catastrophe nearly ripped your galaxy apart - an insurmountable ring of torn hyperspace fabric appeared in the center of the galaxy, which normal hyperspace engines can’t overcome.\nSince this event nobody has managed to get near the central regions of the galaxy. All you know is that this event also spawned multiple insurmountable hyperspace rifts throughout the entire galaxy, and that a strange race of aliens, the Xsotan, has appeared in the center. It looks like these aliens have found a way to surpass the torn hyperspace fabric, but so far nobody has managed to establish contact with them.\nThere are also rumors about a strange new metal called ‘Avorion’, which has appeared in the center of the galaxy, around the same time as the Xsotan arrived. Apparently the aliens use this material to build their ships.\nStart out as a nobody at the edge of the galaxy and work your way to the center of a galaxy that gets more dangerous, but also more rewarding the closer you get to its core. Avorion takes sandbox aspects from games like X or Freelancer, throws in co-op multiplayer and lets you build your own ships. It features ships made of freely scalable blocks that can be procedurally generated and that break into pieces where they're hit in space fights.CombatEquip your ship with chainguns, lasers and other weaponry to take on your enemies and enjoy the sight of completely destructible ships breaking at the exact points where you hit them. Defend your allies from pirates, hunt down enemies for coin or even participate in wars between entire factions. Build hangars and command squads of fighters in your battles or destroy enemy freighters to steal their cargo.ExploreFly through beautiful nebulas and dense asteroid fields in search of hidden treasures and meet the many factions that populate and control their portion of the galaxy. Each faction has its own characteristics, such as peaceful, intelligent or aggressive, and has its own ship styles, meaning their ships and stations have a distinct look.\nExplore the galaxy at your own pace to find valuable goods in old ship wreckages, undiscovered asteroid fields rich of resources, unchartered asteroids which you can claim for yourself, or clues as to what happened during the event a few hundred years back.Build Your FleetThere are no limits to ship size or complexity besides your resources. You're not bound to the standard voxel style and while building an awesome ship in Avorion you won't get lost in lots and lots of micro-management. You can focus on building a great looking ship, without having too much trouble to make it work. But make sure you still keep an eye on your ship’s maneuverability and energy requirements. Adjust your ships perfectly to their operational purpose by building light and agile or heavily armored ships.\nBuild specialized transport ships with lots of cargo space or heavily armored battleships with strong shields. Collect loot from defeated foes which you can use to upgrade your ship: New turrets, resources, trading goods or system upgrades. Install system upgrades that allow more weapons, ease asteroid mining or trading systems which detect trading routes over multiple sectors.\nAnd why build only one ship? Hire captains to fly your ships for you, manage your crews, weapons, hangars and fighters and build your own fleet of space ships!TradeExtend your ship with a cargo bay, find profitable deals and haul over a hundred trading goods through the galaxy to make a profit and buy your way up the food chain: Build up a trading corporation and extend your influence in the galaxy by founding asteroid mines and factories that attract NPC traders who will buy and sell their goods at your establishments.Co-op MultiplayerYou don't have to fight the galaxy alone! Avorion features co-op multiplayer, so team up with your friends to build stations together and destroy pirates and enemy factions! Work together to extend your influence in the galaxy and build your own empire. Or, you know, blow them apart in large PvP battles. It's a sandbox, you can do whatever you want.\nIn Avorion you choose your personal playstyle. Haul cargo, find profitable trading routes and found factories. Or maybe you're sick of being the good guy? Build your own battleship, equip it with powerful weaponry and blow away your enemies. Be the aggressor that starts wars with entire factions, raid freighters, smuggle illegal goods and scavenge old wreckages. Find your way to the center of a galaxy that gets more hostile, but also more rewarding the closer you get to its core.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Boxelware","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4533,"name":"Sly Cooper and the Thievius Raccoonus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/189/189457decc788f6bb4a40974aafe775d.jpg","description":"Sly Cooper and the Thievius Raccoonus is a remastered HD version of the original Sly Cooper game on PS2TM system! Now you can play the classic thieving adventure all over again on the PS3TM system. - Guide Sly through rooftop chases and evade security guards - Dodge spotlights, alarms and infrared lasers - Steal priceless jewels and empty casinos - Supports 3D","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"}]},{"id":3143,"name":"Saint Seiya Soldiers' Soul","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fee/fee038343e284b89065712639200b749.jpg","description":"The long awaited return of Saint Seiya is here with Saint Seiya Soldiers’ Soul! It leverages the power of the new generation consoles for spectacular graphics, more robust gameplay, and intense battles. The legendary Gold Saints come back to life wearing their God Cloths, and for the first time ever, play as the God Warriors from Asgard!\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nNetwork Players 2-2\n5GB minimum save size\nDUALSHOCK®4\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©Masami Kurumada, Toei Animation\nGame © 2015 BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":2987,"name":"Fat Princess Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d48/d48c4e30a7acc755f44be260db87cf06.jpg","description":"Fan-favorite Fat Princess makes her delicious debut on the PlayStation 4 with the release of Fat Princess Adventures. Cooked up by the minds that brought you the original game, this new co-op adventure from Fun Bits Interactive serves up a generous helping of the cheeky light-hearted humor that made the original game a hit.\nUp to four friends can team up for a not-so-epic adventure to slay monsters, steal loot, rescue the princesses, gobble cake, and defeat the evil Bitter Queen. Your band of comrades will stab, smash, grab and grub your way through the land of Great Bitten with all the mischief that you would expect from a Fat Princess RPG.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fun Bits","platforms":[{"id":0,"name":"PlayStation 4"}]}]