[{"id":1508,"name":"Funk of Titans","genre":"Action","price":0.0,"description":"PERSEUS IS THE CHOSEN ONE… AND KNOWS FUNK FU!\nFunk is the music of Gods. Zeus, the father of all of them, created and shared it with the rest of the Universe. The humans have been dancing to and singing funky songs since the birth of time and give thanks to Zeus for receiving this blessing.\nNow, however, Pagan Titans have created other rhythms in the form of Pop, Rock and Rap and they are using them to influence the humans, turning them into empty headed, dancing minions.\nIn these difficult times, Zeus has summoned his son and Funky Champion, Perseus, to confront and defeat the Titans. Guide Perseus through more than 40 levels of ancient Greek mythology spread over the three worlds of Pop, Rock and Rap. Collect different helmets and weapons, compete in bonus stages and ride Pegasus to glory. Only one style of music can survive and the Funk is the music of the gods.\nOver 40 levels\nGroovy platforming\nFunk-Fu, ancient Greece, gods and demigods\nFight to restore the funk by defeating Pop, Rock and Rap\nRide your pimped-out Pegaus","imageUrl":"https://media.rawg.io/media/screenshots/f38/f38909544298f1dde05b8d8d24fe9ae8.jpg","releaseYear":2015,"developer":"EnjoyUp Games","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":635221,"name":"Company of Heroes 3","genre":"Action","price":0.0,"description":"The legendary strategy franchise is back! Company of Heroes 3 is the ultimate package of action, tactics and strategy. Take charge in the heat of real-time battle, then command as a General guiding the overall campaign where every decision matters. ​\n\nOverwhelm your opponents with new and familiar factions, units, and international Battlegroups. Command ground, air and naval forces and build supply lines to crush enemy advances on the new Dynamic Campaign Map - no two playthroughs are ever alike! Play at your own pace across campaign and skirmish modes before diving into blistering multiplayer action. Discover the untold stories of a stunning Mediterranean theatre, featuring next generation destructible environments, all powered by Relic's proprietary Essence Engine. ​\n\n\nAward-winning Tactical Gameplay\nCompany of Heroes 3 delivers the next generation of acclaimed tactical gameplay. Beloved combat mechanics collide with authentic new gameplay features, making for the deepest tactical experience to date. ​\n\nMake use of daring flanking moves to expose enemy side armor, experience all new infantry breaching mechanics allowing you to flush enemy units from their garrisons, and master elevation to enhance your line of sight and gain the upper hand.\nA Stunning New Theatre\nWelcome to the Mediterranean - a breathtaking new theatre filled with untold stories of war. Engage ferocious enemy forces across Italian mountain passes, breathtaking coastal vistas and the sweeping deserts of N Africa. Stunning visuals deliver authentic and highly diverse environments designed to keep you on your toes. ​\n\nMountainous maps will require uniquely different strategies from coastal towns, with verticality now greatly affecting units’ line of sight (True Sight). Desert plains will call for careful reconnaissance and daring armored maneuvers. On this new frontline, intelligence trumps speed and clever use of local terrain will let you bewilder your opponents and rout them from the field.\n\n\nNew Layers Of Strategy\nExperience the biggest single player campaign in franchise history. The new Dynamic Campaign Map delivers full ‘sandbox-style’ gameplay, allowing players to command the overall war effort and experience an unprecedented level of strategic choice. ​\n\nEstablish vital supply lines before deploying rear guard defenses to secure your advance. Launch air and naval strikes to weaken and scatter enemy forces or liberate a nearby town to develop a Partisan spy network. Choose your forces and upgrade your veteran companies to match your playstyle. Meanwhile, the optional Full Tactical Pause feature allows players total control over the pacing of single-player action. Plan your attacks, then effortlessly queue up lethal precision plays that will give you the edge in battle.\n\n\nDiverse Factions & Units\nCompany of Heroes 3 promises to delight even the most ardent WW2 enthusiasts thanks to the largest number of launch factions in the series to date. ​\n\nNew army customization mechanics will allow you to call in the help of a varied cast of specialist units. Take up the fight with new elite squads including the American-Canadian Special Service Forces, the revered Gurkhas from the Commonwealth and many more. ​\n\nFrom devastating tank destroyers to clandestine recon vehicles, Company of Heroes 3 features the largest roster in the series to date. The super light Weasel, the armor sniping Nashorn, and the Chaffee Light Tank are just a few of the units making their debut. Also, let's not forget revamped classics like the M3 Recovery Vehicle Halftrack, which can now be used to repair and steal abandoned enemy vehicles!\n\n\nCinematic Action\nFeel the blistering impact of every mortar shell and naval bombardment with Relic's state-of-the-art Essence Engine. In Company of Heroes 3, every location becomes a fully destructible sandbox, opening up limitless tactical gameplay options for you or your enemy to exploit. ​\n\nBring fortified buildings crashing down onto enemy squads, then witness enhanced destruction mechanics at play as soldiers exploit fresh ruins as dynamic cover. Stunning new rendering and particle FX technology depicts fire, sand and smoke like never before. Brilliant new soldier animations combine with enhanced A.I, delivering realistic squad reactions to the battlefield. Optimized for DirectX 12 and multi-core CPUs, Relic's new engine technology will deliver cinematic action to rival any Hollywood blockbuster.","imageUrl":"https://media.rawg.io/media/games/079/079cbcafbbbe278a928dcb86dc3d58fa.jpg","releaseYear":2023,"developer":"Relic Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":430330,"name":"House Flipper VR","genre":"Simulation","price":0.0,"description":"Important information:\nOur Friends' Game:https://store.steampowered.com/app/1019550/Thief_Simulator_VR/\nAbout the Game\nWe have ensured that House Flipper VR brings a unique experience, no matter if you ever tried virtual renovations. The veterans will definitely notice some items they have never seen before as well as a new graphic design. But all this is just the tip of the iceberg. The biggest revolution is in the gameplay itself. We have completely redefined all the mechanics: from now on you are not getting rid of all the dirt from the counter with a single click - swing that virtual brush yourself!\nLooking for new VR challenges?  You have come to the right place - just about time for a makeover! Look through your goggles to see all the wrecked houses crying out loud for your help. Grab the controllers and get to work! You will single-handedly assemble the heaters, plaster the walls, and do tens of other jobs to bring back the former glory of the place.\nRenovation activities require a lot of effort, so we got you some backup. Uncle Harry will take you under his wings, regularly seeking new special jobs for you to take on: one client might need an overnight express cleaning after a party, another will require some help with his family problems - you will not get bored!\nDuring the renovation process, you can always count on Beaver the Builder!\nThis animated companion will not only bring a smile to your face but will also support you, explaining the elements of the game. He is not only taking care of the woodwork!\nThere is a series of challenging renovations ahead of you, so do not hesitate!\nReach for your tool belt, get your crew and take matters in your own hands. Are you going to become the best flipper? It is all up to you!","imageUrl":"https://media.rawg.io/media/screenshots/bec/bec6b3650ba3033f965dd793a49502b5.jpg","releaseYear":-1,"developer":"Frozen District","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":345188,"name":"THE LAST BLADE","genre":"Action","price":0.0,"description":"“THE LAST BLADE”, the first entry in the legendary 2D weapons-based fighter set during the twilight years of the Tokugawa shogunate, returns for another joust! Sharpen your blade, and be ready for some of the most epic battles on GOG!ARCADE - Pick a fighter from the 12 (+2 boss) characters available, and select between the simple and highly-damaging \"Power\" mode, or the technical and deep \"Speed\" game mechanic. Challenge and defeat all 10 opponents who will stand in your way, and learn more about your character's story via the splendid game endings!\nMULTIPLAYER - Cross swords with the best of the best in “THE LAST BLADE\" via the \"Invite a Friend\" & \"Lobby\" multiplayer features.\nLEADERBOARDS - Check your current rank & score in “THE LAST BLADE\" at any time, as well as those of your friends and other top players!\nSETTINGS - Configure various types of video options, controls and volume sound settings to your preference for the most pleasant “THE LAST BLADE” experience ever.","imageUrl":"https://media.rawg.io/media/screenshots/0c2/0c29aa5d727dbf028aafd8244d44c43d.jpg","releaseYear":1997,"developer":"SNK","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":308130,"name":"Nightmare Reaper","genre":"Action","price":0.0,"description":"Nightmare Reaper is a dark and violent meld of retro and modern action games, mainly inspired by the classic 2.5D first person shooters of the 90s like Doom, Duke Nukem 3D, Blood, Rise of the Triad and Wolfenstein 3D.\nFeatures\nOver 80 satisfying and balanced weapons (32 in EA)\nOpen-ended levels filled with surprises\nFind gold, powerups and enchanted weapons with different stats\nPurchase character upgrades and customize your abilities via a minigame\nWage war through three varied game-sized episodes\nSoundtrack by the great Andrew Hulshult\nNon-intrusive, but mysterious story\nFight hordes of enemies at the same time\nA focus on satisfying combat that'll make you addicted\nYou rise to prevent her doom\nand duke it out with nightmares\nto reap salvation in blood.","imageUrl":"https://media.rawg.io/media/screenshots/63d/63d7bcc35d5a750ac4c5eef639f20024.jpg","releaseYear":2022,"developer":"Blazing Bit Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":261321,"name":"Taiko no Tatsujin: Drum Session!","genre":"Arcade","price":0.0,"description":"Game contains In-Game Purchases\nOver 70 awesome songs! All the best ones from the arcade in your home!\n\n• The PS4® system version is packed full of what makes Taiko no Tatsujin great!\nIn Friend Session, register friends and family with a Sony Interactive Entertainment account as friends to play with them even when they're not nearby!\nIn Guest Session, play Taiko Mode with popular characters!\n\nFeel like taking on players from all over the world? Then Ranked Match is for you! Get matched with players of a similar skill level win to raise your rank! Can you reach the top spot?!\nYou need a Sony  Interactive Entertainment account to play Friend Session and Ranked Match.\nYou do not need to be a member of PlayStation®Plus.\nYour PlayStation®4 system must be connected to the internet.\nChanges to the game may be made without prior warning.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1-2 players\n4GB minimum save size\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nTaiko no Tatsujin™: Drum Session! & ©2018 BANDAI NAMCO Entertainment Inc.","imageUrl":"https://media.rawg.io/media/screenshots/f23/f23ed1d81f24f0b341e9f69fbb9dd19a.jpg","releaseYear":2017,"developer":"BANDAI NAMCO Entertainment America","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":257205,"name":"Digimon Survive","genre":"RPG","price":0.0,"description":"Digimon Survive presents a hybrid visual novel and tactical RPG set in a mysterious world filled with dangerous monsters and deadly battles that will test your ability to survive.\n\nAfter getting lost on a school trip, Takuma Momozuka finds himself transported to a world inhabited by ferocious foes and new allies. Join Takuma and his friends as they fight their way back home. Craft your story in this thrilling visual novel with turn-based combat.","imageUrl":"https://media.rawg.io/media/games/566/566024ad65f27af6e2c2acfadb14c33a.jpg","releaseYear":2022,"developer":"Bandai Namco Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":254654,"name":"The Witch's House MV","genre":"Adventure","price":0.0,"description":"The Witch’s House, originally released in 2012, falls within the tradition of Japanese horror RPGs with heavy emphasis on puzzle-solving and jump scares. Among other entries in the genre such as Ib and Ao Oni, The Witch’s House surprised fans with pixel-art that conceals truly frightening horror.\nThe Witch’s House is deliberately designed with traps at *almost* every turn--sudden death is unpredictable and it keeps players on their toes. Anything can happen at any time.\nWith completely remastered visuals, The Witch’s House MV will feel fresh to even the most familiar old-school fans. Fans will also be greeted by a new difficulty mode that includes new events upon completion of the base game.\nA horror atmosphere wherein players solve puzzles based on clues found in the house.\nCompletely reimagined graphics that make for a beautifully terrifying experience.\nBrand new unlockable difficulty mode with new events and dialogue.\nViolence and gore that are not recommended for the squeamish. Player discretion advised.\nSudden deaths that lurk around every corner and await every misstep.\nItems must be used deliberately as players solve the puzzles for themselves.\nFixed save points (just keep an eye out for the talking black cat).\nGame pads are supporting and recommended.\nHead phones *strongly* recommended.\nHello. I'm Fummy, creator of The Witch's House MV.\nI'm happy to announce that we're finally ready to release the game.\nThe Witch's House MV is an RPG Maker MV remake of the original game, which was released back in 2012.\nWe remade all the graphics, including map tiles and character sprites, and worked hard to enhance the atmosphere and 2D beauty in The Witch's House. It took us five times as many hours to create this version, but we feel like we've finally managed to satisfy ourselves.\nAside from graphical improvements, we also added two new difficulty settings that was not present in the free version.\nThe first difficulty setting is a more accessible one that allows you to instantly retry. The other difficulty setting is a more difficult one which is only unlocked by those who manage to reach the game's true ending.\n\"The normal difficulty isn't enough to satisfy me...\"\n\"I'm not averse to instantly dying upon reaching new areas.\"\nIf either of these describe you, then we recommend you give this new difficulty a try. You also may be able to uncover some new story bits concerning \"her\"...\nThe world of The Witch's House has been reborn anew, and we sincerely hope you'll all enjoy it.\nMy name is Dan Stern and I’m the Scholar of the First Deal at DANGEN Entertainment (sounds fancy, but it means I work with the devs to get their games released so you can play them).\nJapan has a longer tradition in 16-bit horror games because of the variety of games that was released on the Super Famicom. But that wasn’t something I experienced because of growing up in the West. It wasn’t until I discovered The Witch’s House some years ago that I learned 16-bit games can scare me just as well as high-res AAA games made in 3D. I learned that even in pixel-art, horror is possible; it just depends on the creator’s mastery of atmosphere and timing. Fummy-san absolutely has that mastery and as silly as it sounds, I’ve never had so much fun dying a lot in a video game.\nI was ecstatic to find out that not only is there a remaster of my favorite indie horror classic, but that DANGEN could help to get that game in front of fans that I know will love it. Playing The Witch’s House MV feels like a totally new experience and I’m sure you’ll have fun with the new content after you finish your first playthrough.\nCheers!","imageUrl":"https://media.rawg.io/media/screenshots/9d5/9d54f41a1221294f5f76b12630786815.jpg","releaseYear":2018,"developer":"Fummy","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":60091,"name":"Shrouded in Sanity: Freebirth","genre":"Action","price":0.0,"description":"This is the free version of Shrouded in Sanity, and as such contains only the base game, with complete story. Additional content has been removed, such as; new game plus, the boss rush, the wave mode, and the 4 other playable characters.\nShrouded in Sanity is the first in a series of games, and as such continues with UsurperAbout Shrouded in SanitySet in the alternative historical setting of 1897 Angelic Empire of Britannia, your contract will order you to eliminate the source of the unnatural fog enveloping the Berelai Manor.\nDiscover the secrets of the estate, as you look for answers among the violent inhabitants.\nA strange and repelling madness took hold of the servants roaming the halls, and they will attack on sight, for their madness is one rooted in a deeper understanding of cosmic insignificance.\nTo repel the maddening horrors, your Iaito cane, and Waltham A9 hand canon will aid you. To mend your injuries your Vitae concoctions will offer healing.\nBeware, whatever unearthly events have transpired, your sanity will be tested as the truth unfolds in this hungry all-consuming Fog.","imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a008c8e69ab85b4ac5795159cf2fe1d.jpg","releaseYear":2018,"developer":"Steve Gal","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":59840,"name":"Adolescent Santa Claus","genre":"Adventure","price":0.0,"description":"It was Christmas Eve but my life was stagnant and boring.\nI was all alone sitting in the corner of the room until I was visited by a strange girl who claims to be Santa Clause...\n*. playtime : 20 minutes / visual novel\nFeatures of this game build\n- free game\n- Full voice and Beautyful CG\n- Short visual novel to enjoy lightly","imageUrl":"https://media.rawg.io/media/screenshots/add/add6652748681c57380b1f25febadaad.jpg","releaseYear":2018,"developer":"TALESSHOP Co","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":53182,"name":"Castlevania: Harmony of Dissonance","genre":"Action","price":0.0,"description":"Castlevania: Harmony of Dissonance is a platform-adventure video game developed and published by Konami for the Game Boy Advance. Belonging to Konami's Castlevania video game series, it is the second installment of the series on the Game Boy Advance. It was released in Japan in June 2002, in North America in September 2002, and in Europe in October 2002. It was the first Castlevania game to be called \"Castlevania\" in Japan instead of \"Akumajō Dracula\".\nHarmony of Dissonance occurs in the fictional universe of the Castlevania series; the premise of the series centers on the eternal conflict between the vampire hunters of the Belmont clan and the immortal vampire Dracula. Set fifty years after Simon Belmont vanquished Dracula's curse, Harmony of Dissonance focuses on his grandson Juste Belmont and his quest to rescue a kidnapped childhood friend.\nKoji Igarashi produced Harmony of Dissonance with the intent of \"creat[ing] a game that was similar to Castlevania: Symphony of the Night\", the critically acclaimed PlayStation game that he had worked on. Harmony of Dissonance sold 126,000 units in the United States and did not become a \"huge hit in Japan\". Critics praised it as an entertaining game with improved graphics as compared to its predecessor Castlevania: Circle of the Moon, but criticized its soundtrack. In January 2006, Harmony of Dissonance was re-released in North America and later Europe, along with Castlevania: Aria of Sorrow, as part of the Castlevania Double Pack.","imageUrl":"https://media.rawg.io/media/games/7ba/7ba3525c8e57ef876f79b25e4d5fb85b.jpg","releaseYear":2002,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii U"}]},{"id":50848,"name":"Aurora Trail","genre":"RPG","price":0.0,"description":"The camera view is your best friend, and your worst enemy!Maneuver yourself through the levels while avoiding overlapping colors by changing your perspective.\nA new epic puzzle game where the perspective of the camera changes everything. Do not let your body parts get in the same view as a wall with the same color, or you’ll lose it! Puzzle your way through challenging and appealing surroundings and try to stay in one piece!Change your perspectiveAvoid overlapping colors by changing your perspective. Just do not forget to look at the art as well, it is cool to look at. It is just a little bit less cool if you have to restart because of  looking to the wrong color.Different kind of puzzlesIn this puzzle game you will find different kind of puzzles. Try to figure out how you can pass it, just never forget the rules of the colors.","imageUrl":"https://media.rawg.io/media/screenshots/e68/e686200632dd0197a48515a4ac3ec5ed.jpg","releaseYear":2018,"developer":"Screenhit Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50432,"name":"Cobalt WASD","genre":"Action","price":0.0,"description":"Two teams of adorable murder-bots duke it out over a number of rounds. One side attempts to plant and detonate bombs in their opponents’ base, and the other, quite reasonably, attempts to stop them.\nDesigned for 4-versus-4 players, each round earns money (or \"volts\") which the teams can spend on outlandish equipment and weaponry. Take a stealth suit, slip past the enemy’s defences and snipe from the shadows, or dive straight into the fray, deflecting incoming shots with the reflector shield. Or toss a time bomb into the mosh-pit and watch as bullets and bots dance in balletic slow-motion! Synchronize with your team to achieve the best strategy and claim ultimate victory!\nBuilt especially for PC, with fluid controls tuned for WASD movement and mouse-aim.\nCool traversal abilities - dashing, teleportation, jet shoes and grappling hooks.\nFive unique suits with abilities such as Time Distortion, Time Booster, Bullet Deflector, Cloaking, and Kinetic Absorber!\nOver 30 different kinds of weapons and tools!\nMecha-styled vehicles to bring to the battle!\nDamage-bonus hit zones including: head, eye and from behind!\n10 maps at launch and more to come, plus workshop maps!\n4 versus 4 multi-player with dedicated server software!\nCustomizable characters and UI/crosshair settings!\nCobalt WASD is a FAIR GAME and a FULL GAME!\nNo pay-to-win!\nNo loot crates!\nNo edition exclusives!\nNo day one DLC!","imageUrl":"https://media.rawg.io/media/screenshots/659/659887fb5a3a3db7cc90547acce9fa00.jpg","releaseYear":2017,"developer":"Oxeye Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46871,"name":"Capsa","genre":"Simulation","price":0.0,"description":"Capsa is an open world, social game which provides users with the opportunity to hang out in a breath-taking, and ever-expanding environment.\nFeaturing a large, gorgeous landscape, players can enjoy exploring Capsa’s many destinations with all their friends. Developed using the most up-to-date technology, Capsa is designed to take full advantage of current hardware, providing an awesome, high-resolution experience. Unlike most virtual worlds Capsa is developed around the concept of a singular connected world, meaning no separate instances or loading screens to reach different locations and allowing you the ability to travel seamlessly to explore vast areas.\nProject an outward appearance that reflects your mood and charisma! Customize your character using in-depth facial shape options that offer you the freedom to create something unique.\nPersonalize outfits, with per-piece clothing customization offering a wide range of possibilities to express your personality and taste.\nDecorate one, or more, of the numerous beautiful homes using the assortment of furniture and décor options available.\nListen, share, and enjoy streamed music from a range of virtual devices.\nHost movie nights with friends! Enjoy fully synchronised streamed YouTube videos through virtual televisions in your personalized homes.\nExhibit your favorite images from the internet on canvases and frames.\nDiverse, invigorating areas offer a venue to meet new people and hang out together.\nVibrant, in-game dance clubs provide the perfect venue to strut your stuff on the dance-floor or listen to streamed music with your friends.\nFun mixture of dances and emotes, perfect to express yourself with.\nClean and easy to use in-game text chat.\nExpansive world provides the perfect landscape for hours of exploration. Capsa’s initial game world has been designed to submerse players in an exotic and breathtakingly beautiful, south Pacific archipelago. This large, scenic world can support huge groups of players simultaneously, so bring all your friends!\nImmersive ambiance which sets the perfect atmosphere for players to hang out and enjoy each other's company.\nDynamic world, featuring full day and night cycle.\nHost your own world featuring many clubs, homes, and hang out locations in the same connected space with no level instancing\nEnable Privacy options to restrict your server to either your friends list or a private group\nCustomize your server to your own liking, with adjustments for time of day length or forced time of day.","imageUrl":"https://media.rawg.io/media/screenshots/530/5301da0d1895a1ae59213de67ebd91d7.jpg","releaseYear":-1,"developer":"Vetron","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46052,"name":"TTV2","genre":"Action","price":0.0,"description":"TTV2 is an arcade retro hardcore maze wanderer minigame, sequel to Trip to Vinelands.\nA reflex-based indie experience with original audio and art, made by the same creator of the arcade series UBERMOSH.","imageUrl":"https://media.rawg.io/media/screenshots/798/7986192ca5fe4a0509d1408d4f71dc12.jpg","releaseYear":2017,"developer":"Walter Machado","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":45923,"name":"Holy Potatoes! What the Hell?!","genre":"Strategy","price":0.0,"description":"Holy Potatoes! What the Hell?! is a whacky hell-themed cooking management sim where you take on the role of a chef in an Afterlife populated by potatoes! Sort potato sinners into cooking stations to extract sinfully delicious ingredients, cook up incredible potato-based recipes, and appease the gods in your Pantheon by serving them savory spud dishes!\nPlay as Sweeny Tots, a potato chef in the Afterlife determined to find out what happened in his previous life as he works to ascend to heaven. Having no recollection of your life before, you appear in hell, late for your first day of work. After a brief and rather vague explanation, you are thrown into the kitchen and must adapt to your new job - sorting potato sinners into their rightful stations and cooking up delicious, tantalising dishes befitting the Gods!\nMeet pop-culture sinners such as Mealificent, St Reaper, and Sephiroot and mythological gods such as Loki, Persephone and Osiris while spiraling down the nine circles of hell!\nPunish potato sinners by sorting them into your desired cooking stations and wait for them to get mashed, baked, boiled and fried. In your quest to appease the gods and ascend to heaven, you have to cook up mouth-watering, delectable, and appetizing dishes to feed the hungry deities of Holy Potatoes! What the Hell?!Key FeaturesSort potato sinners into their rightful cooking stations to create delicious ingredients.\nUse sinful ingredients to cook up delectable potato-based recipes.\nFeed the hungry deities, appease your Pantheon, and level up your Gods.\nPut on your chef’s hat and research new appetizing recipes.\nManage your stations by upgrading, doing maintenance, and boosting them with hellfire.\nThrow down in Cook-off Showdowns and prove you are the best chef in hell.","imageUrl":"https://media.rawg.io/media/screenshots/9f6/9f6f4ecfe1849470157b728fa3baacbd.jpg","releaseYear":2020,"developer":"Daylight Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":40254,"name":"Harry Potter and the Deathly Hallows: Part 2","genre":"Action","price":0.0,"description":"Wield powerful magic and engage in epic battles in your quest to destroy the Horcruxes and Voldemort Himself.","imageUrl":"https://media.rawg.io/media/games/061/0616620ce03a82faba2a2e90bf016144.jpg","releaseYear":2011,"developer":"Electronic Arts Bright Light","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":30490,"name":"Severance: Blade of Darkness","genre":"Action","price":0.0,"description":"Blade of Darkness is a third person perspective action game that focuses on combat. Each of the four heroes has its very own set of moves and statistics, and starts the adventure in a different area. There's over 100 different weapons you can use in the game, each with its own characteristics that reflect on the fighting style. New special attacks can be unlocked as your character gains experience and power. While you slash and bash through the hordes of terrifying monsters, you will feel the urge sometimes to stop and look at the beautiful--if a bit gloomy--surroundings. If you're looking for a game that will take you on a fantastic quest filled with merciless combat, this is the one to pick up!","imageUrl":"https://media.rawg.io/media/games/8d6/8d6e253b996283f3244b7999472eeaad.jpg","releaseYear":2001,"developer":"Rebel Act Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":24918,"name":"F-Zero","genre":"Racing","price":0.0,"description":"The future of racing is here! F-ZERO, an intergalaxtic Grand Prix, uses machines that weigh more than a ton, reach dash speeds of over 500km/h and hover a mere twelve inches off the ground! Choose from the heroic Captain Falcon, or the suave, Dr. Stuart. Need more choices? Then try the sly alien, Pico or the not-so-honest Samurai Goroh, and race for intergalactic fame and fabulous fortune in the F-ZERO Grand Prix.","imageUrl":"https://media.rawg.io/media/games/c45/c45a1f2502a1e1c88c4e14875fceab72.jpg","releaseYear":1990,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"SNES"}]},{"id":22656,"name":"Master of Magic","genre":"RPG","price":0.0,"description":"Master of Magic is a classic, one of the most popular strategy games of the 90s. It is a 4X fantasy strategy game that allows you to play as an extremely powerful wizard, leading your troops and overcoming your magical opponents. After over 25 years, the game now receives the first official update with a significantly improved AI and more than 200 spells at your disposal. Dive back into time, relive this epic adventure and conquer Arcanus and Myrror once and for all!\nMaster of Magic is also available with the Community Update, a free optional patch developed by fans for fans and greatly increasing the polish of Master of Magic with countless fixes.FEATURESCombination of strategy and RPG elements\nEnduring replayability\n5 realms of spells and 18 traits to customize your wizard\n14 races for you to lead\n198 unique types of units\n60+ special abilities\n200+ spells\n250 editable pre-generated magical items\nCustom item crafting\nAvailable to play with the optional Community Update","imageUrl":"https://media.rawg.io/media/screenshots/9eb/9eb8c501dd15d577a1bc1c0b97cc2cf2.jpg","releaseYear":1994,"developer":"MuHa Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":22150,"name":"Schlocks","genre":"Simulation","price":0.0,"description":"ABOUTSchlocks, your favorite mini-games department store, understands you, the consumer. Every game at Schlocks is a whopping 10 seconds to try our product(s), and experience what everyone's been talking about! Hop in, test a product in one of our patented Microscopic Games™, and then be suddenly whisked away to a new one; it's an adventure unlike any other you've experienced at a department store! We're so sure you'll love shopping with us, that we can promise a consideration of the suggestion of a money back guarantee, or else! That's the Schlocks-brand Commitment™ that you can count on.FEATURES50+ games in Early Access with over 100 on final release.\nEnjoy competitive party gaming with friends, while also giving friends a good laugh at their expense.\n… or play all alone if you have no friends. It’s still fun!\nExplore 10 different departments of the Schlocks Store, including the farm, kitchen, ocean, carnival, and more!\nUnbeatable value! That's the Schlocks-brand Commitment™ that you can count on.","imageUrl":"https://media.rawg.io/media/screenshots/046/046882a7efbe586fb921533ec73fabe2.jpg","releaseYear":2017,"developer":"Fancy Bear Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21545,"name":"Dungeon Nightmares II: The Memory","genre":"Action","price":0.0,"description":"Dungeon Nightmares II is a first-person psychological horror that takes you through a journey of discovering what nightmares are.\nThe game is inspired by classic roguelike games which include 100% procedural-generated maps and permadeath. These features play an important part in making this game tense with the feeling of dread & terror as you walk the hallways of the dungeon.\nEvery time you play, the dungeons are randomised which guarantees unlimited replay value.\nThe game is simple. Get through each dungeon by surviving the horrors that lurk deep within and making your way to the exit.\nFEATURES\nIntense scary atmosphere\nCombat-less gameplay\n100% procedural-generated maps\nPermadeath\nRich 3D surround sound\nIntelligent AI that changes based on the way you behave each night\nUnlockable extras","imageUrl":"https://media.rawg.io/media/screenshots/122/122f2fb9880ec70d0fa4ad1bc4fdb72b.jpg","releaseYear":2015,"developer":"K Monkey","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20853,"name":"Acceleration of SUGURI X-Edition HD","genre":"Action","price":0.0,"description":"In Acceleration of SUGURI X-Edition HD (aka AoSXE HD), the \"little war\" continues at a breakneck pace. AoSXE HD is an enhanced version of the eagerly awaited sequel to SUGURI, and it features completely redone, optional HD graphics by the incredibly talented independent artist, Keiko Sakurai. The frenetic, rapid-fire combat action that fans have come to love in the first game is all here but with a focus on one-on-one shoot-’em-up/fighter hybrid action. Whether you choose to play as SUGURI, Hime, Nanako, or any of the other multiple fighters, you're dealing with weapons of mass destruction! Inflict massive damage and dash to safety. Victory can be yours!\n\nAcceleration of SUGURI X-Edition HD Features:\nHybrid shoot-’em-up/fighting game\nThree story modes with multiple unlockable characters\nPummel your friends with local and over-IP online support\nOptional, beautifully redrawn HD graphics\nSteam Cards","imageUrl":"https://media.rawg.io/media/screenshots/2d9/2d94b2469cf4112756094e57cca7bbab.jpg","releaseYear":2014,"developer":"Orange_Juice","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":20728,"name":"Stay Dead Evolution","genre":"Action","price":0.0,"description":"At its core, Stay Dead Evolution is a 'round beat'em up' like Street Fighter with elements taken from rhythm games.\nThe brand new idea behind Stay Dead Evolution is to have a real time interaction inside a cinematographic scene, using the main character as if he would be a video-game character.\nStay Dead is the union of movies and video-games.\nFinally, the sound and graphic quality of a movie joins effectively the interaction of a next generation video-game, creating a unique and involving game experience.\nUsing the video footage is one aspect of Stay Dead Evolution, but it's not the most important. Our focus is to let the player feels like using the main character in an actual movie, a movie with a real montage and a proper grammar.\nStay Dead Evolution is born refining Stay Dead, a game that in 2012 was well received by public and critique.\nEven if the graphic is entirely shot in real life, you can move your character with a great degree of freedom and you can perform more than 100 different techniques distributed in 5 stages.\nUse all the classic moves of the fighting games, just watch the result of your stunts with a never-seen-before spectacularity that just a real life shot with a cinematographic direction can provide.FEATURESFast arcade action\n5 different martial arts\n5 unique environments, different for look, feel and directing style\nMore than 100 martial arts moves\n4 difficulty levels\nReal time interaction in a movie\nOriginal concept for a groundbreaking approach to the genre\nUnlock: scoring feature, 90&80s look and feel, ...","imageUrl":"https://media.rawg.io/media/screenshots/8b9/8b9048491dad57ffa6934dd688d1b0b5.jpg","releaseYear":2015,"developer":"Brucefilm","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20113,"name":"Kings of Kung Fu","genre":"Action","price":0.0,"description":"Fans of Kung Fu cinema rejoice! Kings of Kung Fu was developed mainly for fans of classic Kung Fu flicks and designed to be playable by gamers from casual to mid-core so that anyone can pick it up and have fun.\nPlayers are challenged by a mysterious fighter called Red Ronin to take on the role of one of 14 martial arts stuntmen and compete in a one-on-one tournament to prove their worth to win a starring role in the studio's next big film.\nEach fighter’s style is inspired by actual moves used in martial arts cinema where their bodies are their weapons. Fine-tuned in diverse and unique methods of physical destruction, each style brings with it 100’s of attacks, counter attacks, blocks and grapples ranging from your basic kicks and punches to advanced attacks and combo chains to devastate their opponents.\nSelectable fighters include Tao Lung the Chinese Boxing Master, Chen Fu the master of Drunken Style, Ron Jones and his fierce Shorun-ryu Karate, Hou Feng with his wild and deadly Monkey Style, Lo Wei the Shaolin Master, John Deux is top of his game in Kickboxing, Ju Mao a champion of Hapkido and the Muay Thai Master Chang Tai. Not to mention The White Stallion master of Shotokan Karate, Lo Chi the grappling brawler, master of both Karate and Ninjitsu Ken Suguri, and Yuen Wong with his mix of Wing Chun and various Kung Fu styles. Also tossing their hats into the tournament for a chance at stardom are two new stuntmen: Jane Fury and Shen Wu.\n14 character roster - plus 1 boss character\n15 unique and dynamic background stages inspired by classic films\n100+ unique moves per fighter (including advanced moves and throws)\nSoundtrack contains over 20 songs influenced by classic Kung Fu films and old-school style hip hop\nFight against the computer in Arcade Mode, match skills against a friend in Local Multiplayer Matches or master your moves in Practice Mode","imageUrl":"https://media.rawg.io/media/screenshots/c68/c6829c9432dc7452b124b567a5498745.jpg","releaseYear":2015,"developer":"Jae Lee Productions","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19550,"name":"Ducati World Championship","genre":"Racing","price":0.0,"description":"Feel the rush of motorcycle racing with Ducati World Championship. Select your machine from over 70 original Ducati models, perfectly simulated replicas of the real thing. With Ducati World Championship you don't have to settle on one model - you can have them all!\nDucati World Championship features more than 70 superbly modeled motorbikes from 4 different categories — Classics, Sports, Road and Grand Prix. There are over 34 exciting circuits to race on with an incredible amount of extras to unlock. A 360-degree view into the world of motorcycle racing enables players to be a pilot racing in the amateur, semi professional and professional racing classes, intent on reaching the Superbike and the Grand World Championship.\nPlay against your friends in split-screen multiplayer mode.\n60 tournaments in five different game modes.\nBurn up the track at over 210 MPH on your Ducati Desmosedici\nChoose from more than 70 motorbikes from four different categories — Classics, Sports, Road and Grand Prix.\n34 adrenalin-pumping circuits with a huge amount of unlockable extra content.\nVaried weather and track conditions with realistic lighting effects\nLearn how to become a champion rider with Loris' Riding Lessons!\nWork your way up through the challenging Career Mode with increasingly faster bikes and gorgeous Race Queens!\nThree different playing modes - arcade, normal and simulation - give you countless options and endless hours of fun!","imageUrl":"https://media.rawg.io/media/screenshots/900/900e9d882c0940f26371e59a890f920b.jpg","releaseYear":2007,"developer":"Artematica Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19486,"name":"0RBITALIS","genre":"Simulation","price":0.0,"description":"0RBITALIS is a satellite launching simulator with a retro-puzzle style. Launch your satellite into orbit and go head to head with the dominant force that formed the entire universe: Gravity.\nThese launches won’t be a spacewalk in the park, there’s all manner of stars, planets, comets, pulsars and more to navigate. Not to mention rival probes that will compete against you and even chase yours down. Oh, and did we mention those anti-gravity probes?Features\nExperience an accurate gravity simulation with a unique minimalist aesthetic.\nExplore 100 levels across twelve sectors, each one with its unique gameplay mechanics.\nExperiment with teleports and bullet time to bend the very fabric of space for that perfect launch.\nDiscover and unlock 39 challenging achievements.\nUse the intuitive editor to design your own levels and share with the world via Steam Workshop.\nSupernova Edition includes:\n12 track 0RBITALIS Soundtrack by Doseone.\nThe Art of 0RBITALIS - Digital Art Book.\n40+ Background images to use as you wish.\nTo view these extras, right click on 0RBITALIS in your game list, go to \"properties\", go to the \"local files\" tab, and click \"browse local files\". These extras will be in the \"Extra content\" folder.","imageUrl":"https://media.rawg.io/media/screenshots/00d/00d8adaeafe1b02bc2350593e96c5bd2.jpg","releaseYear":2015,"developer":"Alan Zucconi","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19378,"name":"Lemma","genre":"Action","price":0.0,"description":"Immersive first-person parkour in a surreal, physics-driven voxel world.\nLemma enables creative building through movement. Spawn structures just by moving through space. Extend platforms, smash through walls, and build new ones, all through parkour moves.\nNon-linear story - four possible endings\nOculus Rift support (currently limited to SDK v0.6.0.1-beta)\nTime trial mode\nBuilt-in level editor with Steam Workshop support\nXbox 360 Controller support","imageUrl":"https://media.rawg.io/media/screenshots/4c7/4c7ce92ded84a3cebf9b50bdd4954404.jpg","releaseYear":2015,"developer":"Evan Todd","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19059,"name":"Jonah's Path","genre":"Indie","price":0.0,"description":"A Virtual reality (HTC Vive) experience which transposes the character at the first glance in a rich deep underwater environment. The environment then shifts and trans-cedes in the second half in a more ambiguous low gravity planet surface type, the experience has it's roots in the Jonah and the whale biblical story and in the depths of Europa Jupiter's moon.","imageUrl":"https://media.rawg.io/media/screenshots/a4b/a4b387716cb017f6f5ebedc44e549e64.jpg","releaseYear":2016,"developer":"Ionut Lucian Achiricioaei","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18633,"name":"DubWars","genre":"Action","price":0.0,"description":"RecommendedWe recommend the use of a Steam Controller, Xbox controller, or PS4 controller when playing our game.\nAbout the GameDubWars is an action-packed arcade shooter that successfully combines music and gaming in a way never seen before. We've collaborated with incredible EDM and Dubstep artists to create a game that synchronizes the energetic music with fun and exciting gameplay. The music becomes your weapon as they fire in sync to the rhythm of the song, each beat firing a unique weapon. Listen to the bass, up beats, climax, and the drop of each song in order to progress through each level's difficulty. Analyze the risk and reward of collecting Wubs from destroyed enemies in order to upgrade, or just try to frantically survive the song!\n10 custom-built levels with amazing visuals and effects!\nDiscover and support both up-and-coming musicians and your favorite established artists!\nLearn about the artists and where you can follow them, as well as download their other music\nProgress through three difficulty modes by mastering the music and upgrading your ship\nComplete objectives and Steam achievements, collect Trading Cards, and top the leaderboards!\nTracklist:\nOmni - Urban Metaphor\nDubsective - Synergy\nSpock - Break It Up\nMinecraft Universe - Eclipse\nCelldweller - Tough Guy (Tim Ismag Remix)\nVarien - Metalworks\nMinesweepa - Leviathan\nTotally Sick - Distorted\nSummer School - Choose Your Weapon\nNGHTMRE - MTRD\nJames Egbert - Menu Music","imageUrl":"https://media.rawg.io/media/screenshots/b3c/b3c04e143948fac972e11b12f1fe750a.jpg","releaseYear":2016,"developer":"MURA Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18284,"name":"Diamond Dan","genre":"Action","price":0.0,"description":"Dragged into Archeology by his uncle, Dan decides to take matters into his own hands. He discovers ancient temples with long lost treasures and menacing traps. Dan follows the clues found in the temples which leads him on a trip across the world, bringing him ever closer to making a sensational discovery. You will help Dan navigate past the traps, collect treasure and reach the bottom of the temples where Dan can find the treasure map that leads him further on his journey.\nKey features:\nAddictive casual platform game with a twist!\nMake your way down the towers of treasure collecting Gems and gold!\nAvoid the deadly pitfalls and traps in randomly generated levels!\nChoose Diamond Dan or Diamond Ann and use their unique bonus moves!\nTravel the world and discover 4 unique themes: Inca/Gothic/Persian and a secret location!\nPolished gameplay and high production values!","imageUrl":"https://media.rawg.io/media/screenshots/295/295024860d7f3d196f2538b91ce57de8.jpg","releaseYear":2010,"developer":"GrendelGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17463,"name":"ULTRAWORLD EXODUS","genre":"Indie","price":0.0,"description":"ULTRAWORLD EXODUS is now free!ULTRAWORLD EXODUS is now free! 100% free, no strings attached!\nI consider this game a personal work of Art, and I want everyone to get in there and try it! Fair warning: it's weird and awkward, (and not always in a charming way), but hey, it's free right? So give it a shot anyway.\nFor everyone who bought the game before it went free, you've been granted the soundtrack DLC for free. The soundtrack is still $5. I left a price tag on it for people who think it's worth a damn and/or want to support me as a creator.\nThanks!\nJames Beech\nCreator of ULTRAWORLD\nAbout the GameThe doors to ULTRAWORLD are open and beckon you to return. Come see what's new in ULTRAWORLD EXODUS, a free addition to the wildly abstract first-person exploration adventure you've heard so much (or little) about. The sole work of James Beech, a former Crytek/Sony AAA game developer, ULTRAWORLD EXODUS is a visual novel/Art toy/who-knows-what.\nFEATURING\nIMPERFECT: A highly revised redux of the original ULTRAWORLD story. Ponder Exoplanets and Artificial Intelligence while trying to assist a self-aware NPC in the midst of an existential crisis. Some people loved it. Some people hated it. Feel free to decide for yourself.\nEXODUS: A new continuation of the unusual sci-fi meta-narrative that could only be told in the medium of video games. A year has passed and ULTRAWORLD has changed. Your old pal is dismayed by your inaction, but this gives way to a new friend with an impossible plan. Embrace the hivemind!\nVACATION MODE: A greatly expanded free-roaming mode where you're the Artist. Change the colors, filters, particles, and rendering modes for infinite visual variety (and I do mean infinite). Then soar above the landscape, camera in hand, looking for the perfect picture. Every shot is a unique abstract painting, created by you, and fit to hang on your walls.\nTHE SOUNDTRACK: There are now double the songs to the highly praised original soundtrack.\nVR SUPPORT: Vacation Mode can be setup to use VR devices (although you'll need a steel stomach. Not meant for humans)\nFREE: If you already own ULTRAWORLD, you'll get EXODUS automatically. It's my way of saying thanks to everyone who's supported my bizarre art experiment. And of course, anyone buying from here on out gets EXODUS as part of the package.\nNow get out there and find your painting!","imageUrl":"https://media.rawg.io/media/screenshots/c1f/c1fe584a619afdf0103044d8aba4ff90.jpg","releaseYear":2014,"developer":"Neon Serpent","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17079,"name":"Disney Alice in Wonderland","genre":"Action","price":0.0,"description":"\"You're Invited to a Tea Party...\nExplore the brightly colored and vividly imagined world of Tim Burton's Alice in Wonderland in this intriguing game based on the feature film. Guide Alice through a myriad of adventures in the strange and compelling realm of Wonderland as she makes her way toward the ultimate battle against the Jabberwocky. Play as any of a variety of classic characters, including the Mad Hatter, the White Rabbit and the Cheshire Cat, and master an assortment of intriguing new abilities, like altering perception, making objects invisible and even manipulating time. Conquer challenging puzzles, roam through whimsical settings and confront perplexing optical illusions as you while away a day traveling beyond the movie and into a world of pure, captivating fantasy.\"","imageUrl":"https://media.rawg.io/media/screenshots/78f/78f6c522a05a63da8746ad62e745cd4f.jpg","releaseYear":2010,"developer":"Etranges Libellules","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"}]},{"id":16672,"name":"Comanche 4","genre":"Action","price":0.0,"description":"The best-selling Comanche series returns with this fast-paced action game that places you at the controls of a Comanche RAH-66 helicopter. In 6 single player campaigns and multiplayer, the game combines serious firepower with effortless controls and stunning, interactive terrain.\nFeatures\nNON-STOP ASSAULT — Blast away at tanks, jets, aircraft carriers, helicopters, missile-launching troops and more.\nUNLEASH THE POWER — Shoot Hellfire and Stinger missiles, rockets and a 20mm cannon.\nAIRBORNE IN MINUTES — Quickly master flying and fighting using the keyboard & mouse, or for the sim fan, joystick, throttle & pedal controls.\nSTUNNING INTERACTIVE TERRAIN — Immerse yourself in detailed environments with rotor wash, shadows, terrain scarring and spectacular explosions.\n6 EXTREME CAMPAIGNS — Fly across urban, forest, arctic, desert and sea environments while you protect diplomats, support Delta Force, subdue renegade forces, attack warships and more.\n","imageUrl":"https://media.rawg.io/media/screenshots/127/127ceacacbacb62806111de4a797a1e4.jpg","releaseYear":2001,"developer":"NovaLogic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14749,"name":"ORCS","genre":"Action","price":0.0,"description":"ORCS is an action/platformer 2D old school inspired by classic like Castlevania and Ghosts 'n Goblins.\nIt is very difficult and funny!\nSome features:\n- 5 bosses.\n- 24 levels (including bosses)\n- Gamepad support\n- Jokes! :)\n- and more!!!","imageUrl":"https://media.rawg.io/media/screenshots/f82/f82b4b33fec7ac8e116713b28e2b705a.jpg","releaseYear":2016,"developer":"Pixel vs Pixel","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14273,"name":"Evolution VR","genre":"Action","price":0.0,"description":"Dive into an alien world, and evolve a creature of your design to be the top of the food chain. Precisely guide your creature to attack smaller prey and avoid predators with motion controls. Fully customize your creature’s body parts and abilities, unlocking more as you grow. Explore beautiful and dangerous worlds with larger predators around every corner. Become the most fearsome creature on the planet!GAME FEATURES\nCustomize your character\nExplore immersive underwater worlds\nEvolve and grow by eating other creatures\nRoom-scale VR experience\nLow-poly art style\nFull motion controller support","imageUrl":"https://media.rawg.io/media/screenshots/f95/f9569c7d47ac4ecd844944f7770b580e.jpg","releaseYear":2017,"developer":"Magic Tavern","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12675,"name":"Statues","genre":"Action","price":0.0,"description":"Do you ever think that statues are alive? That there is a bit of a soul behind blank eyes of each statue. That stone hearts beats in the stone chests. That mysterious power just prevents their movements. And as soon as this power begin to run out, they go down from pedestals and go ahead with their plans that they always keep…\nSo do you think statues can have secret lives?\n\"Statues\" is a mix of survival-horror and action-adventure developed by Room710Games. The game based on the creepy enemies that only move when you're not looking at them. They will take your sense of security during the whole game.\nKey features:\n\n7 various locations;\nDifferent types of enemies;\nOriginal gameplay;\nPsychological thriller story.\nThe main character will have to face his fears and only the desire to survive and understand the cause of what is happening will lead him through the dark deserted locations...","imageUrl":"https://media.rawg.io/media/screenshots/dc7/dc740854b6f4b31d5faff5f2c752bb38.jpg","releaseYear":2015,"developer":"Room710Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12615,"name":"Virtual Pool 4 Multiplayer","genre":"Sports","price":0.0,"description":"Play 8-Ball, 9-Ball, Snooker, Billiards, Pub Pool, 27 games total!\n“So realistic it will make your real life pool game better!”\nVirtual Pool is famous for realistic physics and game play and Virtual Pool 4 makes multi-player online a joy.  Compete in online tournaments or play with friends. Single and double elimination tournaments with or without handicap. Compete as singles or teams. Player profile, friends list, awards, statistics, rankings, calendar of events, shot upload. Online lobby where players meet and chat. Great for both the friendly and competitive player.\nFree to play 9-Ball and 8-Ball in one location. Purchase of premium for $0.99 for 1 month, $2.99 for 3 months or $9.95 for a year. Premium includes V$ which can be used to purchase cue sticks, enter tournaments and match wagering. Tournaments pay out in V$ for high finishing places. Match wagering is in V$ and can be single players or teams.\nGrab a cue and play now!","imageUrl":"https://media.rawg.io/media/screenshots/17d/17de25508bf7f5a5e2628a889fdbe34b.jpg","releaseYear":2016,"developer":"Celeris","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12488,"name":"Discovr Egypt: King Tut's Tomb","genre":"Adventure","price":0.0,"description":"An historical mini experience (10-20 minutes) browse the tomb or play a timed treasure hunt.\nExplore the 3 rooms of King Tut's Ancient Egyptian tomb with the HTC Vive to see what they might have to say about the life and culture of early civilizations. 1323 BC: a time when Egypt is a recognized world power. Its young leader, King Tutankhamun, has passed away and been buried in what will become one of the greatest icons of Ancient Egypt. The tomb is littered with treasures and artifacts symbolic of Ancient Egyptian culture.\nCenturies later the tomb is uncovered by British archaeologist Howard Carter, and now you too can explore the tomb. Look around and learn about its contents in Discovry Mode, or take all the treasure before time runs out in Treasure Hunt.","imageUrl":"https://media.rawg.io/media/screenshots/c38/c38139a063e7cf31882f0c6dfa75b6ed.jpg","releaseYear":2016,"developer":"Discovr Labs","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11379,"name":"🔴 Circles","genre":"Casual","price":0.0,"description":"Circles is a unique, intuitive puzzle game where everything responds to your mouse.\nIt presents itself without any text and asks you to experiment.\nBy simply moving the cursor, you’ll uncover the underlying rules of each circle. According to the movements you make, they grow, shrink or move around the screen. Experiment and find your way to the end point to complete each level.\nContent\n•\t90 levels + extra challenges\n•\t4 unique modes for replayability\nFeatures\n•\tUnique and intuitive gameplay\n•\tDoes not contain a single word\n•\tBased completely on mouse movement\n•\tAtmospheric and interactive music\n•\tLots and lots of circles\nMobile?\nNope, Circles is not a mobile game. From the start, it was developed around mouse controls, so the best experience is to be had on PC/Mac. That being said, mobile is still an interesting option in the future. But currently all efforts are being directed at the PC version.","imageUrl":"https://media.rawg.io/media/screenshots/99c/99c80b6136ef685d5e861e7e7dd0cc2c.jpg","releaseYear":2016,"developer":"cherrypick games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]}]