[{"id":58725,"name":"Twin Mirror","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a52/a528a337aa63c83bd649a71278bff870.jpg","description":"Twin Mirror is an episodic psychological thriller game in which the player has to solve a mystery. The game features a distinct film noir atmosphere and explores darker themes like redemption and duality.\n\n###Plot\nThe main protagonist is an investigative journalist named Sam. Sam is a very tortured and troubled person who had a harsh time recently. He's yet to overcome his breakup with his ex-girlfriend, and his old friend, a fellow journalist, had just died. As he arrives at Basswood, his childhood city in West Virginia, to attend the funeral, Sam finds himself in a hotel room, covered in blood, with no recollection of how he got there or what happened. He has to investigate it and restore his memories. On his quest, he receives advice - not always helpful, though, - from his inner self, a sarcastic voice he calls the Double.\n\n###Gameplay\nThe player navigates Sam not only in the real world but also within his Mind Palace, depicted as a surrealist environment. The game also explores the protagonist's flashbacks, making them playable so that the player can make difficult moral choices not only about Sam's present but also about his past. The narrative in Twin Mirror is non-linear, and there are several different endings.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":27975,"name":"The Legend of Zelda: The Wind Waker HD","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c75/c75f83d346ded0cb785e0649e0ac10cd.jpg","description":"The Legend of Zelda: The Wind Waker makes its glorious return on\nthe Wii U console with gorgeous HD graphics and enhanced game features.\nIn this timeless classic with a unique and colorful \"toon-shaded\" art\nstyle, players guide Link as he sets out on the massive Great Sea to\nfind his kidnapped sister. You will sail the seas in search of lost\nislands, fight fearsome enemies, take on mighty bosses, and seek out the\nlegendary Triforce.\n\nNew Features:\n\nThe Legend of Zelda: The Wind Waker HD features 1080p visuals\nthat will immerse players in the game like never before.\n\nWith the Wii U GamePad controller, it’s easy to manage your inventory\nand view maps.\n\nPlayers will enjoy cruising the open sea with a new Swift Sail,\nbringing them to their next destination and action-packed adventure\nthat much faster.\n\nOnce players receive the \"Tingle Bottle\" item, they can connect with\nothers by posting comments to Miiverse. Through this new feature,\ncomments or screen shots posted on Miiverse will wash up on the shores\nof other players’ games. It’s like finding a message in a bottle.\n\nPlayers can also take and store more pictures with an improved\nPictograph and then post them on Miiverse.\n\nIf the television is already in use, this game can been played off-TV\non the Wii U GamePad.\n\nA new limited-edition Wii U bundle featuring The Legend of Zelda: The\nWind Waker HD launches on Sept. 20, 2013. The digital version of The\nLegend of Zelda: The Wind Waker HD will also launch on Sept. 20,\n2013, while the packaged version launches Oct. 4, 2013 with distinctive\ngold-foil packaging.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"Wii U"}]},{"id":25414,"name":"Super Smash Bros. Brawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a00/a00c19dae42d87ca31d903d26761d335.jpg","description":"Super Smash Bros. Brawl is a crossover platform fighting game for the Nintendo Wii published by Nintendo in 2008 and the third entry in the Super Smash Bros. series. It was developed by an ad hoc development team consisting of staff from Sora Ltd, GAME ARTS, Monolith Soft, HAL Laboratory and Paon.\n\nLike the two precedent instalments, the game features characters, locations and items from various Nintendo video game franchises such as Mario, The Legend of Zelda or Kirby. However, Brawl is the first game to include characters from third-party franchises, such as Sonic the Hedgehog or Solid Snake from the Metal Gear series. \n\nThe Smash Bros. series is notable among fighting games for its unorthodox gameplay. A game takes place on a stage that could be compared to a platform game level. Instead of a health bar, damage is represented by a percentage. When a player hits another, the victim's percentage increases. The higher the percentage, the further a player will be knocked away when hit. The goal is to knock other players out of the screen using a varied set of moves. Two to four players can fight at the same time, either in a free-for-all match or a team battle. Special rulesets also allow for different win conditions.\n\nItems randomly appear around the stage and can be picked up and used by fighters to aid in combat. These include food that heals the user, various weapons such as laser swords or firework launchers, or even Pokéballs containing powerful Pokémon. Brawl also introduces Assist Trophies, items that allow one to summon characters from various franchises to fight for them temporarily, as well as Smash Balls, which, when broken, allow a fighter to unleash their ultimate attack on their opponents. The game also supports custom rulesets, allowing players to disable items if they wish.\n\nBrawl is the first game in the series to include a complete single-player story campaign, named the Subspace Emissary. It features all the playable characters in the midst of a conflict against a mysterious entity looking to collect pieces of their world for an unknown reason. The player fights hoards of enemies throughout a multitude of platforming levels. It was also the first game to allow online play with friends or random players. This feature is no longer available due to the discontinuation of the Wii's online service in May 2014\n\nSuper Smash Bros. Brawl was praised by the critic for its fun and easy to learn gameplay, its sheer density and the attention put into the representation of its featured franchises. However, it left many fans of the series, particularly its competitive aspect, disappointed. The changes made to the gameplay from Melee considerably slowed the pace of the game and severe balance issues existed, which resulted in the game's competitive scene becoming inactive early in its life. To fix these issues, players resorted to modding. Among the various mods that were created was Project M, a mod that, at first, aimed to make Brawl feel more like its predecessor Melee, and later grew to become much more distinct from any game in the series. Project M gathered a decently sized competitive scene to the point where it was played at major tournaments along with the official games, but its development eventually shut down in 2015.\n\nDespite this, Brawl is the eight best-selling game on the Wii, having sold 13.29 million units as of March 2018. It is often considered to be the best Smash Bros. game for casual play or single-player.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Wii"}]},{"id":16415,"name":"Dracula 1: Resurrection (android)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e50/e50fb491212a6732c1744416105d597c.jpg","description":"A fright-filled Adventure that transpires in the heart of Transylvania.\nLondon 1904. Seven years after the slaying of Dracula, you play as Jonathan Harker, (the protagonist from Bram Stoker's original novel) and soon discover your wife, Mina has fled London for the Count's castle in Transylvania.  Has Mina fallen prey to vampires?  Or could this mean... Dracula... he's still alive?!\nBram Stoker's terrifying world is faithfully brought to life in this danger-riddled Point & Click adventure.  Thirsty for blood?  Do you dare play this cat and mouse game with the (un)dead?  Enter at your own risk.\nKey Features:\n1st person panoramic views properly convey the foreboding and terrifying mood\nPuzzles, challenges and an abundance of horrible evils await as you maneuver from one location to the next\nJourney across an eerie nighttime forest and an isolated Romanian Inn.  Make your way through an abandoned underground mine system, pass images of birds nailed to graveyard crosses and encounter hooded shapes as you enter the ominous Castle of the Prince of Darkness\nA chilling atmosphere, a menacing soundtrack and ambient SFX underscore the hair-raising fear that resonates throughout\nAnimated cutscenes bring the story to life and transports you into the dark depths of the world of Dracula","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microids","platforms":[{"id":0,"name":"Android"}]},{"id":11547,"name":"Chaos Reborn","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93f/93f2ccc8c6c68dc11b3fc4f582e9756a.jpg","description":"From Julian Gollop, the designer of the original, award-winning XCOM game comes Chaos Reborn - a turn-based wizard combat game with single player Realm Quests and many online options. Between 2 and 6 players can challenge each other to magical duels in a variety of arenas using a spell deck of interesting spells and creatures - including the Gooey Blob, Shadow Wood, and more. There is a monthly league system and several game modes with live or asynchronous battles. You can explore the Realms of Chaos fighting Wizard Lords and Kings, and invite players to join you in co-op battles, or act as an invader in someone else's realm. These Realms can be designed by player Wizard Kings and rated by other players.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Snapshot Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2771,"name":"Cubemen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dcb/dcbfbb01db2fe4bff4cc751e21c6bedc.jpeg","description":"Just UpdatedNew Features:\nLevel Editor including level creation, sharing & favourites - Yes Finally!\nSoon to be hundreds or thousands of user levels to play\nBrand new music tracks with custom music theme selection options per game mode\nLocal Mayhem games versus Bots (no need for online connectivity at all)\nRandom tower placement option in defense (unlocked per level by getting platinum)\nReverse tower placement in Skirmish mode (local and online games)\nBrand new music tracks with custom music theme selection options per game mode\nNew volume controls for Music and SFX in game options and in game\nLevel Theme skinning gallery\nAbout the GameCubemen is a fast paced, action packed, original 3D Tower Defense game that mixes TD with RTS in\nsingle player & online multi-­player awesomeness! Get ready for some crazy Cubemen action!\nIt’s the age old struggle between Good vs Bad, Blue vs Red, Little men vs Little men. Use your own\nlittle Cubemen to defend your base from other little Cubemen that are trying to run it over. It’s the\nusual story, but with many very interesting twists.\nPlay a purely defense game in various modes on a sweet selection of levels, or go into Skirmish\nmode and play a new type of TD game against either the computer or another human opponent.\nThat’s right.. Two way REAL-­TIME TD against the computer or a real person!\nIt’s TD like you’ve never seen or experienced before.Key Features:35 local Single-player Defense levels in ranging difficulties from beginner to insane\n25 local Real-time Multi-player Skirmish levels (play One v.s One against AI or another Human)\n9 local Real-time Multi-player 6 way online Mayhem levels\nNo static towers... Your towers are actually Cubemen. Place them and move them around at will.\nReal 3D environments with Height, Cross overs, bridges and floating platforms.\n6 Single-player Defense modes to choose from with local and online leader boards\nOnline Leader-boards and Statistic tracking\n41 Achievements to earn\nClean, rich and simplistic visuals that keep the focus on the strategy","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"3 Sprockets","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":364801,"name":"Soul Calibur V","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a4c/a4c5dbb5174222efe630df8c30d92689.jpg","description":"Fighting game with Ezio Auditore (Assassin's Creed franchise) as a guest fighter.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":244879,"name":"Castlevania Requiem: Symphony of the Night & Rondo of Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/276/2765d6d02b9d2fc49bd918f64ca94171.jpg","description":"'Castlevania: Rondo of Blood', first released in 1993 and 'Castlevania: Symphony of the Night', first released in 1997 are now available in one combined package for the PS4!\nExperience two of the greatest games from the famous Castlevania series.\nMake your way to the top of Dracula's castle as Richter Belmont, descendant of the famed clan of vampire hunters, in 'Rondo of Blood', or take the leading role as Dracula's son Alucard in 'Symphony of the Night'.\nEnjoy the unique world, the epic classical background music, and the side-scrolling action of the Castlevania series!\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1 player\n2GB minimum save size\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© Konami Digital Entertainment","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":21319,"name":"The Dark Stone from Mebara","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15a/15ad64b8ef1108054fd12fff44d1af2b.jpg","description":"Based on the mythology created by H.P. Lovecraft, The Dark Stone From Mebara is set in 1924 Massachusetts.\nTake on the roles of Arthur Pendleton owner of the Pendleton Detective Agency and his two employees – Detective Aloysius Monroe and Professor Webley.\nThe team has come in to possession of an eerie black rock with strange properties. As they try to discover the stones cosmic origins, they find themselves battling against madness, vicious cultists, and unspeakable horrors!\nWill they discover the truth behind…THE DARK STONE FROM MEBARA?Key FeaturesAn original adventure based on the works of H.P. Lovecraft.\nExplore fully realised towns, buildings and more.\nBattle challenging foes & cast powerful spells in a classic ATB system\nHigh quality period visuals\nCustom spell learning and detailed level-up displays.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jerseyware Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":19518,"name":"The Maw","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e08/e082f8453ef89e7e0ef7c8a70b9152c9.jpg","description":"The pinnacle of alien evolution, Maw is a cowardly fat blob concerned mostly with snacking and lounging.  He can, however, absorb the traits of anything he eats, is virtually indestructible, and can grow to unlimited size.  If he wasn't a danger to all life in the universe, he'd make the perfect pet.  In this action/adventure game, he's the best friend of our hero Frank, and only by working together can Maw eat their way to freedom.  The Maw was honored with the Audience Choice Award in the 2008 PAX-10 showcase of independent games, and is a finalist at this year's Independent Games Festival for Technical Excellence.\nUnlock all the Steam Achievements!\nFull featured 3D action/adventure\nWinner of the 2008 PAX 10 Audience Choice Award\nFinalist in the 2009 Independent Games Festival\nUnstoppable and insatiably hungry Maw that grows to limitless proportions\nCinemas with lots of personality and humor throughout the entire buddy-comedy storyline\nVersatile leash for manipulating creatures and objects\nEight levels with varying puzzles and traps to overcome\nFive unique creatures that instill Maw with five unique powers\nInteractive soundtrack by award-winning composer Winifred Phillips\nAdditional levels available as downloadable content","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Twisted Pixel Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":10935,"name":"Slingshot people","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f9/8f97f35cb23780578994d8df0b55936e.jpg","description":"Have you ever wanted to shoot a slingshot at people?\nThis game can give you such an experience!\nBut be careful,because you have a slingshot\nand people for which you intend to shoot\nthere is a whole Arsenal of weapons,which they will apply,\nto kill you.\nRely only on your slingshot and agility,\nfind enough stones,\nshoot all the enemies\nand rest from the battle with a sense of superiority\nover the heavily armed commandos.\nAll this awaits you in this interesnoi and exciting game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"StalkerAlex","platforms":[{"id":0,"name":"PC"}]},{"id":16959,"name":"Tidalis","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/504/50463fdb1d5b5217ee3fdf842c3e7cf7.jpg","description":"Tidalis is a block-based puzzle game with casual appeal, hardcore depth, and an addictive new \"streams\" mechanic. The game is brimming over with riffs and variants on that core mechanic with 20 game modes, dozens of special blocks and items, and 115 levels in the adventure mode alone. The basic rules of the game are this: blocks fall down into the board and have a color and an arrow direction. If a stack of blocks exceeds the height of the board, you lose. In order to clear blocks, you must right-click and drag paths through the arrows to set up chain reactions of like-colored blocks.\nIf this sounds simple, that's because it is -- you'll be lining up lengthy chains within minutes. But you'll be surprised how much brainpower it takes to set up combos of multiple chains, and the many brainteaser-style puzzles include some real stumpers. Tidalis has co-op and competitive multiplayer modes (both online and offline); action-oriented modes and timer-less brainteasers; a lengthy, casual-friendly adventure mode; twenty unique game modes providing innumerable twists to the basic gameplay; dozens of special blocks and items; and over fifty minutes of beautiful music to go with the painterly art.\nIn short, several games' worth of content are built on top of this core mechanic, which you'll quickly find to be as iconic as it is novel.Key Features:\t\t\t\t\t\t\tPuzzle game with casual appeal, hardcore depth, and an addictive new mechanic.\nTwo-player co-op and competitive play (both local and networked).\nA wide selection of both action-oriented or brainteaser-like levels.\nCasual-friendly adventure mode, hardcore-focused custom games and vs modes.\n20+ game styles, and dozens of items and special blocks.\nRich, painterly art style and beautiful music.\nPlayers can create and share whole new themes, levels, and adventures.\nOptions for colorblind players, players averse to lots of light and motion, and older computers.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14026,"name":"Patrician IV","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/364/3640726eff1d5c28eeb56f37b31cc339.jpg","description":"The Steam Special Edition contains alternate textures for the Counting House and Cog ship type.\nPatrician IV is the sequel to the historical trading simulation and strategy series. You are a merchant in northern Europe in the late Middle Ages when the Hanseatic League was flourishing. Your goal is to rise to the most successful and influential member of the Hanse, ultimately being elected Elderman, leader of the trading league. You start bargaining with common goods, build up your own production and establish a merchant fleet. Later on, you will gain more and more political influence and even found new towns.\n\nHowever, a Hanse merchant's life can also have its dark sides. On your way to power you have to hold your ground against fierce rivals, whom you have to fight with economic competition, price wars or impure means such as sabotage. Will you even engage in piracy?\n\nKey features:\t\t\t\t\t\t\t\t\t\t\tBecome a powerful merchant - rise through the ranks using your increasing fame and wealth to shape towns from small villages to glorious capitals under your control\nA complete strategic simulation - balance competing interests, trade routes, political turmoil, disease, weather, piracy and greedy royalty\nBuild an empire - construct buildings and hire workers, stimulating demand for common and exotic goods\nBattle on the high seas - protect your ships from pirate raiders in realistic and exciting sea battles\nVisually stunning - a powerful new graphics engine lets you visit bustling and realistically recreated medieval cities such as London, Novgorod, Cologne and Bergen\nFriendly Interface and Gameplay - Players will enjoy a brand-new, user friendly interface that makes Patrician IV easy to play but challenging to master\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Runesoft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1812,"name":"Metrico+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/161/1612cc569357276834b34c291417e5ac.jpg","description":"Metrico is a new world. A living world of infographics, driven by your input. All the bar charts, line diagrams and pie charts react to what the player is doing. One bar diagram might grow for every step you walk to the left, while another could decline with every jump you make.\nA New Perspective\nYou will have to explore Metrico and carefully analyze your every move to see how it affects the world, and whether it will get you further. This mechanic is called “Input Morphing” and it makes you think about actions you normally don’t think about.\n6 unique worlds to explore with distinct challenges, mechanics, looks, and sounds\nOriginal music by Palmbomen\nPlay as a boy or girl\nDecide what your story is in Metrico+\nMetrico+ is a combination of exploration, skill, experimentation, but most of all: thinking outside of the box.\nWelcome to Metrico. We hope you have what it takes.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digital Dreams","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":428072,"name":"Golden Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c7/1c713d350440963595af9f513afea475.jpg","description":"\"There is no god, yet.\"\nGolden Light is a first-person procedural survival horror game with rogue-like elements and an eerie atmosphere.\nExplore the dark enviroment of the Golden Light office, uncover the grim truth behind it's working spaces, fight the unthinkable.\nWhat's coming on release:\nProcedurally generated enviroments with interesting events to scare or help you on your way.Deep narrative and interesting main story.Plenty of firearm options.Visuals and atmosphere inspired by all of our favorite horror games.Original soundtrack","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Mr. Pink","platforms":[{"id":0,"name":"PC"}]},{"id":43253,"name":"Little Devil Inside","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d70/d7068fe0a1ba9abb8532da30588e98eb.jpeg","description":"Little Devil Inside is a truly engaging 3D action adventure RPG game where you are thrown into a surreal but somewhat familiar setting with men, creatures and monsters to interact with, learn and hunt - survive and discover the world that exists beyond.\nJourney through the wilderness - explore cities, forests, mountains and deserts. Meet with new characters, hire assistants, camp & rest, take cover from Mother Nature and even meet with other players!","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"neostream","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":41656,"name":"The Mighty Quest for Epic Loot (2015)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f2/7f280778b23561fe3ea8ffa04d5ed61f.jpg","description":"The Mighty Quest for Epic Loot is an MMO-only game. It offers the player to build a fantasy castle filled with traps and to raid the castles constructed by the other players. The game is full of puns and jokes about high fantasy tropes. The Mighty Quest for Epic Loot requires the constant internet connection. There are two main modes: assault and building. \n\n###Castle building\nIn this mode, the player builds a dangerous dungeon for other players to crawl. The builder can customize his or her castle, give it a name and enhance it with monsters, traps, bombs, and other defenses. More defense options can be unlocked as the player progresses. Every castle has a treasury room in its middle as a bait to give other players a reason to explore it.\n\n###Castle assault\nIn this mode, the player controls a character in a manner similar to Diablo or DotA games. The characters belong to four classes, each with its own comical personality: mage, archer, knight, or runaway. The player picks a castle and tries to fight his or her way through its traps and monsters. Each castle has a level that indicates its difficulty and the amount of reward. The goal is to reach the castle's treasury. By doing so, the player earns gold and other useful loot such as equipment that can be used in future raids. \n\n###Shutdown\nThe game's official online servers are discontinued since 2016. There's a mobile version of the game released in 2017, though it lacks the castle building element and uses pre-programmed levels.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":18905,"name":"Manifold Garden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3f/c3fc81393a8c90d48e0b2f03f56caf7a.jpg","description":"Manifold Garden is a game that reimagines the laws of physics.\nRediscover gravity and explore an Escher-esque world of impossible architecture. Witness infinity in first-person, and master its rules to solve physics-defying puzzles. Cultivate a garden to open new paths forward, where an eternal expanse awaits.\nIn November 2012, William Chyr began working on Manifold Garden. Initially the project was called Relativity, and it drew inspiration from various physics thought experiments. In early 2015, Manifold Garden was backed by Indie Fund. Over the course of its development, the game has been shown in over 20 game conventions and festivals, including E3, Tokyo Game Show, Gamercamp, and Indiecade East.Key FeaturesA unique gravity-manipulation mechanic that allows players to walk on any visible surface.\nAn expansive and beautiful world filled with secrets for players to explore.\nMind boggling Escher-esque architecture.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"William Chyr Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":12384,"name":"Insincere","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/11f/11f9a1fdc77486f6b3c93bd2a97fd9dc.jpg","description":"You are Joseph Walker. After waking up in a strangely deserted science facility with no recollection of how you got there, you hear the voice of an A.I. The A.I. promises to be your guide and to help you out of the facility. However, it is clear right away that it’s not telling you everything.\nTraverse the treacherous facility in search of answers, fight deadly mutants, try to stay alive, and most importantly – make the one responsible pay for all this. What secrets does this enormous facility hold, how did you get here, and why is the A.I. helping you?\nInsincere is a short, story-driven FPS with simple mechanics and fully voice-acted dialogue that marks the start of a sci-fi miniseries.\nFeatures: A mysterious sci-fi setting, taking place in a giant science facility.\nAn intriguing plot that will keep you guessing every step of the way.\n22 stages, which include derelict med labs, grimy manufacturing areas, rundown offices, A.I. labs, and more.\n7 different weapons to tackle the challenges ahead.\nFull voice-acting.\nFirst part of a series.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Astronomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":3505,"name":"Rollers of the Realm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/777/77707b4ec145b1e46fc477d77479ce61.jpg","description":"Rollers of the Realm™ combines the frantic physics of classic arcade pinball with the character-driven adventure of fantasy role-playing games. Bounce, spin, and battle through scenes of an epic storyline with a band of medieval misfits tasked with reclaiming the world from dark and ancient magic. Winner of a \"Best in Play\" Award at GDC Play 2014, IndieCade finalist in 2013.Key Features\nA new spin on pinball: includes physics-based puzzles and combat with unique nudge and flipper mechanics.\n10 hot-swappable player characters (represented by balls), each with a unique size, weight, and stats.\nUnleash devastating special abilities: flaming swords, animal companions, hailstorms, bombs!\nUpgrade stats and special abilities as your party levels up.\n30+ Campaign levels to discover and replay. Fully-voiced storyline.\nCombat focused: battle grunts, elites, bosses... and more.\nLoot drops: gold, score and mana multipliers, power-ups, and treasure.\nArena Mode: 5 challenging boards with Steam Leaderboard support.\nTwo difficulty modes: change the difficulty to Challenging or Casual on the fly!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":3188,"name":"Danganronpa Another Episode: Ultra Despair Girls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c44/c4453325f3e4878e540dedcd9e4edfc1.jpg","description":"Komaru Naegi, little sister to Makoto Naegi, has been imprisoned inside a mysterious apartment for over a year. One day, she is rescued by Byakuya Togami of Future Foundation, but the rescue is derailed by a sudden attack of hundreds of Monokumas. Komaru soon discovers that the city has been taken over by a group of children calling themselves the Warriors of Hope. Their leader, Monaca, declares that the city will be the site of a “children's paradise,” and to accomplish this, all the adults will be exterminated. Komaru teams up with Toko Fukawa to try to survive the rampaging Monokumas, escape the crafty Monokuma Kids, and uncover the secrets of the city.\nKey Features\nThird Person Shooter Action Sequences: Use Future Foundation's Hacking Gun to have a fighting chance against the hordes of Monokumasas you traverse Towa City.\nRiddles and Puzzles: The MonokumaKids will challenge more than just your trigger finger; you'll need your smarts to survive as well. There's a lot to discover in the city, with a number of familiar faces and mysteries to unravel!\nTons of Different Types of Ammo: Tackle challenges with multiple kinds of Truth Bullets, such as Paralyze and Link. Upgrade your firepower with special Bling Bullet modifiers.\nSteam Features: Supports Steam Achievements, Steam Cloud and Steam Trading Cards","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":471028,"name":"The Gunk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd8/cd85fef986d962251bdd8d7d1711784c.jpg","description":"The Gunk is the third-person action adventure you’ve been waiting for! Lead a duo of outer space explorers that chance upon a dangerous planet plagued by a corruptive gunk. Explore, gather, craft… and survive.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Image & Form","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":44762,"name":"Frantics","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a27/a27b53655c9c44e584977eb973ba67cf.jpg","description":"Arcade style fun and madcap mini-games are all the rage in Frantics, where you and up to three friends have to face off in a variety of challenges. Bluff, battle, negotiate and co-operate your way to victory, but beware – wise-cracking host The Fox is also on hand to stir things up.\nCompatible mobile device and Companion App required. For more information visit: www.playstation.com/playlinkcompatibility.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2017 Sony Interactive Entertainment Europe.  FRANTICS is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":2586,"name":"Stikbold! A Dodgeball Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a6/4a6318b2a44fd3936d2520d6d8f5f370.jpg","description":"Stikbold! A Dodgeball Adventure is an over-the-top action sports game with strong resemblance to dodgeball. Inspired by classic arcade games, Stikbold! delivers rock-solid and colorful local-multiplayer action with surprising depth.\nTest your skills against friends and family in the definitive living room Battle Royale. Be victorious or go out with a salty BAM!… and take your revenge from beyond!\nThe all new ‘Couch Overtime’ update is adds 4 hectic mini-games and a brand new level, for even more party game mayhem!\nEpic 4-player brawls! Play a free-for-all or in teams.\nUnleash player-controlled hazards - because playing unfair is twice the fun.\n6 different levels with unique themes, challenges and hazards.\nReinvent the game! Experiment and personalize the game by changing the rules.\n4 totally different mini-games for extra variety.\nEarn achievements and unlock the full roster of zany dodgeballers.\nEnjoy the original 70s disco soundtrack!\nPlay the story mode solo or with friends in co-op!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":27976,"name":"Mario Kart 8","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7df/7dfbdcb58a03fcddc68479454fc1f7de.jpg","description":"WINNER: Best Sports/Racing Game and Best Family Game\n\n--The Game Awards 2014\n\nExpand your game-play options in the Mario Kart™ 8 game with two DLC\npacks that feature new tracks, new vehicles, and new characters like\nLink™ from The Legend of Zelda™ series and Isabelle from the Animal\nCrossing™ series/franchise. Learn\nmore.\n\nRace upside-down and along walls on anti-gravity tracks in the most\naction-fueled Mario Kart™ game yet! Take on racers across the globe and\nshare videos of your greatest moments via Mario Kart TV.*\n\nDriving up a waterfall or across the ceiling can provide an intense\nadrenaline rush, but that’s not all anti-gravity is good for. It also\nprovides a wild new gameplay mechanic: if you collide into other racers\nin zero-g, you’ll earn speed boosts worth bragging about. Luckily, you\ncan upload and share your best moments and watch your friends’ using the\nall-new Mario Kart TV.* Returning features include 12-player online\nplay*, gliders, underwater racing, motorbikes, and custom karts. You can\neven race as Bowser’s seven minions, the Koopalings!\n\nRace along walls and upside-down on twisting anti-gravity racetracks!\n\nShare highlight videos of your greatest moments with friends via the\nMario Kart TV feature and Miiverse™*\n\nRace and battle with friends locally* or connect online to play with\nrandom players from around the world*\n\nFan favorite features from past Mario Kart™ games include gliders,\nunderwater racing, motorbikes, mid-air tricks, and more\n\nFor the first time ever, play as all seven of Bowser’s minions, the\nKoopalings!\n\nCrisp HD graphics and fluid animation offers players the most visually\nstunning Mario Kart™ yet\n\nIn-game content available for purchase using stored account funds.\n\n*Wireless broadband Internet access required for online play. Learn more\nat support.nintendo.com.\nAdditional systems and games are required for multiplayer mode. Sold\nseparately.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"}]},{"id":25856,"name":"Pokémon Platinum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2b/f2bd54a7aa57b901b7ad5291e738753f.jpg","description":"Following the vast popularity of Pokémon® Diamond and Pokémon Pearl,\nPokémon Platinum is the newest in the core series of Pokémon games.\nPokémon Platinum features a new story full of adventure,\nnever-before-seen forms of powerful Pokémon – including the legendary\nGiratina's Origin Forme – and the Distortion World, a mysterious new\nworld that suddenly appears in the Sinnoh region. Players can also enjoy\nthe new features in the Global Terminal, such as posting battle videos\nusing the new \"Vs. Recorder.\" In addition, Pokémon Platinum features a\nnew Battle Frontier, where the toughest Trainers can test their skills\nin new ways.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":25173,"name":"Super Mario Bros. 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9c/c9ce3a67180418f8ef10d04a48d794e5.jpg","description":"This release of Super Mario Bros. 2 is completely different from its original Japanese counterpart, originating in the West and being in fact a version of Yume Kōjō: Dokidoki Panic with a different storyline and protagonists swapped for Mario and his friends.\r\n\r\nOne night Mario has a strange dream, where he opens a door to another world filled with even stranger creatures and lands than those in his last adventure against Bowser. Amazingly, the next day, Mario, Luigi, Toad, and the Princess stumble upon a cave, which leads to the world that was in Mario's dream.\r\n\r\nSubcon, the land of dreams, is under an evil spell thanks to Wart, so Mario and the gang must save the day. New creatures to defeat and plenty of nasty surprises await.\r\n\r\nChoose from the four characters, each differing in speed and jumping ability, and head on through 7 levels each filled with puzzles, bosses, bonus coins, the always helpful mushroom, and invincible star, plus bombs and magic potions. After each level, depending on the coins you collect, you can use them in the bonus game to collect extra lives.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"NES"},{"id":0,"name":"SNES"},{"id":0,"name":"Wii U"}]},{"id":17359,"name":"RPG Maker VX","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ee/6ee7c6a9e6e3b1ecb4d433fb90fe9ac5.jpg","description":"Simple enough for a child; powerful enough for a developer.\nRPG Maker VX allows you to make the role-playing games you’ve always dreamed of by being one of the easiest game engine software ever developed. With its enhanced auto-tile capabilities, quick event creation, and dungeon generator, you can have a game ready to play faster than ever before!\nWith RPG Maker VX, you can create your own unique RPG, without the need to be a programmer, artist, or musician. Take advantage of the following features to make the game you’ve always wanted to:\nAn easy to use mapping system, giving you the tools to build the look of your world.\nA GUI driven database, where you can create your heroes, villains, items, magic, and more.\nA powerful eventing system, allowing you to dictate the flow of your game using a simple point and click interface.\nA great default collection of graphics, sounds, and music, giving you all the materials you need to make your game.\nEasy To Use\nRPG Maker VX carries over all the easy to use features from RPG Maker XP, while adding a few more if its own. You can save time by making frequently occurring events (like chests, doors, etc.) with a single command. You can create maps faster than ever due to the simple layer system and revamped autotile tool.\nPre-Made Graphics/Audio\nDon’t know how to create graphics? Can’t compose music? No problem. RPG Maker VX includes a large collection of pre-made, ready to use resources for you to create your own game with. You can also import new resources from the RPGMakerWeb blog, online communities, or even import resources you made yourself.\nShare Your Game\nFinished your game and ready to send it to your friends? With just a few clicks you can have a ready to go install file that includes everything they will need to play the game, without the need to have RPG Maker VX installed themselves.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"KADOKAWA","platforms":[{"id":0,"name":"PC"}]},{"id":13271,"name":"Chronicle: RuneScape Legends","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a09/a09247fcadc13bbe6bfb515bbfa867c6.jpg","description":"Play with the fate of Legends in a battle of wits, strategy and combat where lives are gambled on the turn of your cards. Defeat your challengers, expand and master your deck, earn rewards and customize your Legends as you write and re-write your story in the Chronicle.\nChronicle: RuneScape Legends offers a unique strategic twist on card games. Craft your epic quest, battle enemies for gold and bonuses, and face the challenge of player vs. player unique card combat.\nSTRATEGY CARD GAME WITH ADVENTURE AT ITS CORE: With strong RPG leveling and character-skilling, Chronicle evolves the genre from basic battle and board control against an opponent, to a more strategic, customizable, experience.\nMORE RPG IN YOUR CCG: As each game chapter opens, you will lock in up to four cards to battle against. You play against your cards in order, each card representing a step forward and action in your quests. Gone is the traditional arena and instead you battle on rich 3D landscapes from the world of RuneScape.\nCHALLENGING & COMPETITIVE: Player cards are both your greatest weapon and biggest weakness. You’ll slay monsters, bosses and other foes to get gold, items and buffs – but so will your opponent! Can you place your cards to set up victory, survive the skirmishes and ultimately beat the opposition?\nCUSTOMIZE & PERSONALIZE: With crafting, ranks, and badges, you’ll be able to show your enemy exactly why you are to be feared in-game.\nMORE SKILL, LESS LUCK: No random number generators or sliding values, no minions or same-old board control card mechanics. In Chronicle, the unknown element is about the card sequences in each chapter and the positive or negative impact it has on chains of pre-played cards.\nMULTIPLE MODES & WAYS TO PLAY: Solo and Casual modes let you hone your skills, while Ranked Play has you climbing the leaderboards as your skill increases. Dungeoneering offers draft decks, PVP challenges, and rich rewards!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jagex","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12743,"name":"Tokyo 42","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f4/0f42b366ee2022131a0568b18d6f7121.jpg","description":"Tokyo 42 is a hyper-stylish isometric open-world shooter.  Framed for a murder you didn't commit, you'll delve into a world of assassins, deadly corporate intrigue and...tactical cats.\nSpin the camera to see every angle of this beautifully hand-crafted micro Tokyo, as you discover a huge range of weapons, secrets and stories.\nSkilful shooting, bullet physics, sneaky stealth and crowd simulation all play a role in this ultra-colourful kinetic frenzy.\nA single player open-world story mode and a host of multiplayer modes await in this unique and critically acclaimed action masterpiece.\n\"Stunning...looks like Monument Valley and plays like Grand Theft Auto set in the world of Blade Runner\" (Vice)\n\"Gorgeous...Tokyo 42 is shaping up to be something pretty special\" (Kotaku)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mode 7","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":59624,"name":"V-Rally 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ad/5ada98a9fa27f9f0eb43bc4e08829b97.jpg","description":"The return of a legendary off-road racing game! Enjoy an extreme experience while becoming an expert in a demanding simulation. Take on the challenges of rallies, rallycross, drifts, buggies and hill climbs, and set off on a spectacular journey across every continent.\nDominate dangerous roads, hostile conditions and environments, constantly striving for more speed and with adrenaline boosting your reflexes. At the wheel of the most legendary off-road vehicles in each category, take on the most difficult routes in fabulous surroundings.\nRally: from Kenya to Sequoia Park, dominate the most difficult routes in conditions that are often extreme, at the wheel of modern and historic vehicles.\nV-Rally Cross: intense 8-way races on dirt/tarmac tracks.\nExtreme-Khana: drift, precision and speed, with traps scattered over the roads, putting your driving and showmanship skills to the test!\nBuggy: become an expert at driving through hilly terrain, adopt the special reflexes and learn the particular physics needed to win these fierce races.\nHillclimb: reach the peaks at the wheel of these powerful, twitchy monsters.\nOver 50 car models, including the most famous in rallying and extreme motor sport, for you to test drive, collect, upgrade, customise and, above all, excel at!\nDeveloped by Kylotonn Racing Games, a studio specialising in racing simulations, V-Rally 4 has all the latest physics and graphics developments of the KT Engine.\nAs the trip is worth nothing unless it is shared, V-Rally 4 has a Career mode and an innovative online mode to transform your experience and progress.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":20319,"name":"Infestation: Survivor Stories Classic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d7/7d791ab35fdc964acdaccbd487e7d919.jpg","description":"Infestation: Survivor Stories is a Survival Horror MMO that immerses players in a zombie-infested, post-apocalyptic world in which a viral outbreak has decimated the human population leaving in its wake, a nightmare of epic proportion.\nA Huge Persistent World: This is an nonlinear open world game\nExplore, Scavenge, Kill, Survive: You are one of the few survivors and must navigate the desolate countryside exploring cities and scavenging for items\nGroup with other players to increase your chances of survivalKey Features\tCombination of First-Person and Third Person Perspectives\nMeld of PVE (Player versus Environment) and PVP (Player versus Player)\nSafe Settlements where Players can access their global inventory\nCreate your own Clans\nReputation system – Choose to become a lawman or bandit\nLeave Messages for friends in the game world with a time capsule\nImmersive environment with unique and spine chilling sound effects\nHuge variation of melee and firearm weapon types","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"OP Productions","platforms":[{"id":0,"name":"PC"}]},{"id":19526,"name":"Crusader Kings Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/724/724c85668c2ca9c0bcf5d3f2bdf3ecfd.jpeg","description":"Europe is in turmoil. The lands are fragmented into petty fiefs and the Emperor struggles with the Pope. At this very moment the Pope has declared that those who go to liberate the Holy Land will be freed of all sins.\nGather prestige and piety and the world will whisper your name in awe. Will you co-opt other monarchs, and the Pope, under your leadership to liberate the Holy Land? Do you have what it takes to become a Crusader King?\nKey Features:\n\nTake control of one of the Great Christian Dynasties of Europe and forge the bonds of your vassals from a circle of friends into a Nation\nIncrease the greatness of your lands and your treasure coffins, build Cathedrals and Castles, and combat Highway Robber Bands and defecting vassals\nHistorical multiple-choice events will spawn from the actions of your monarch\nEngage in the campaigns of the Hundred Years War, the five Crusades and the Mongol Wars during 400 years of gameplay\nReenact the crusades, defend against the Mongol onslaught, and form feudal nation-states in Europe\nIntroduce laws, set taxes and interact with hundreds of courtiers and nobles\nExperience realtime grand-strategy based on the engine used by the award winning Europa Universalis-series\nEngage in an evolutionary combat system\nPlay all religious orders – choose between the Knight´s Templars, The Knights of St John, The Teutonic Order or the Order of Calatrava and the Order of Santiago\nEngage in fierce multiplayer battles with up to 8 players\n","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":59142,"name":"Onimusha: Warlords","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/377/37729d1d479e919fd01d32cf1150c2b3.jpg","description":"Capcom’s riveting samurai adventure returns! This version includes the original game’s intense swordplay and dramatic revenge story, plus a host of enhancements. Improved controls allow players to move and fight with analog-stick precision. The crisp, high-definition visuals support 16:9 widescreen as well as the original 4:3 resolution display. A new soundtrack brings the feudal Japan setting to life with an air of authenticity and intrigue. Experience this enhanced version of the best-selling action-adventure classic!","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 2"}]},{"id":22437,"name":"Wickland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02c/02c091c9737895de0525fd2071f51db3.jpg","description":"Wickland is an indie arena shooter heavily inspired by classic FPS games of the 90's. Morph into eight deadly beasts and use their own unique abilities, blaze through maps at insane speed to pick up power-ups, and fight your friends or foes in classic maze-like arena maps, just like the good old days. Wickland is an arena FPS dedicated to PC Gamers.Main ObjectiveWickland revolves around the unique arena FPS mechanic of morphing, fighting, and killing your opponent's beasts until their human character is defeated\nEach beast you pick up has it's own armor which stacks onto your base health.  In duel mode, beasts can only be picked up by 1 player at a time.  Use map knowledge and strategic routing to take control of the beasts and win the matchFeatures8 beasts with their own suited range and close range abilities\n6 themed arena maps\nWarm-Up (FFA Deathmatch) and Duel (1 vs 1)\nPractice offline or online against bots\nWatch live competitions via spectator mode\nCommunity supported tournaments with prize pools (eSports Leagues)\nPower-ups such as health potions and armor\nWall jump ability to increase momentum, perform trick jumps, and take shortcuts\nSteam Login with stat tracking\nSteam Trading Cards\nSteam AchievementsFree Content2 new maps will be released in Spring 2015\nHappy fragging!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mad Ram Software","platforms":[{"id":0,"name":"PC"}]},{"id":21359,"name":"7 Grand Steps: What Ancients Begat","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66e/66e9b44cd532e8c09e497fce55f6e3cd.jpg","description":"What Ancients Begat is a complete (~15 hour) game of family generations surviving the rise of western civilization. Survival is the ultimate goal. The sub-goals, you choose, build their story.\nExperience an abstract telling of the lives of our earliest recorded ancestors. Part board game, part machine, part nod to computer games of yore, it begins with a simple mechanic. Spend tokens to traverse the wheel of life. Earn tokens by tempting the jaws of death. Then, like layers upon a pearl, game play expands, introducing fresh tactics and strategies which, turn by turn, drive a sophisticated, emergent narrative. How you play defines the lives of one family's generations through the changing ages.\nAn enormous tableau of ancient western culture awaits your exploration:\nCore Mechanic - Back and forth tactics, across four social boundaries, to win legend points.\nFamily Strategy - Romance. Raise children. Rite of Passage.\nFamily Drama - Tales in the life. Sibling rivalry. Failed branches. Graveyard of  ancestry.\nGrand Legends - Earned over generations, they strengthen your family: Discoveries and Invention. Social Advancement. Heroics.\nRuling Games - City Administration. Warring Kingdoms. Imperial Senate.\nThe Challenges of an Age - Special for each social level. Survive and overcome, to enter a new age.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Mousechief","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15761,"name":"//N.P.P.D. RUSH//- The milk of Ultraviolet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a57/a5750740697ee3fcd8708c4eee23c3b0.jpg","description":"So nauseous pines,\nThis noxious abyss,\nI feed from the milk,\nof ultra violet,\nYet I'm lost with you,\nMy floating twin,\nYou're the anchor to the drain,\nbut I am the key,\nTo nothing.\nSpeedrun your Police super bike right into the white hot heart off the skirmish to save the souls of the cities junkies!\n- You wont avoid bullets\n- You will wheel spin through entrails\n- intense soundtrack feat:\nCardiffs Techno terrorist \"Manpanics\"\nand Dylan Barry (Super killer hornet Resurrection, G.M.O.S.S.E., Zenodyne, Every zig, Psichodelya, Flying V)\nFeaturing teletext art by ITAF 2014 winner Dan Farrimond\nDeveloped by UK based micro-indie team Rail Slave Games, N.P.P.D. RUSH: THE MILK OF ULTRA VIOLET is an intense, vehicular, open world, arena shooter combined with lite RPG elements and a 80s British bedroom programmer feel. There is also an exclusive track written by British electro artist MANPANICS plus classic tracks written by Dylan Barry, Founder of Rail Slave Games.\n“Rail Slave Games are to today’s indie dev scene as punk rock was to the music scene back in the late 1970’s” commented Darryl Still, CEO Kiss Ltd.  “I can guarantee you that you will not play anything else like this - it is about as original as it gets”.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rail Slave Games","platforms":[{"id":0,"name":"PC"}]},{"id":9700,"name":"Street Fighter V CFN Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b60/b601cc7bc1159ba9993f35ccb4865938.jpg","description":"Play STREET FIGHTER® V completely FREE for a limited time! This is an official PC Beta to test out the improved Capcom Fighters Network and online infrastructure. Only online modes will be available.\nOfficial STREET FIGHTER® V PC Beta Test schedule:5/11 3PM: Pre-load for the PC Beta starts\n5/11 6PM: Servers open for play\n5/14 6PM: PC Beta concludesAll times are listed as Pacific Time (PT) and are subject to change.\nThe legendary fighting franchise returns with STREET FIGHTER® V! Stunning visuals depict the next generation of World Warriors in unprecedented detail, while exciting and accessible battle mechanics deliver endless fighting fun that both beginners and veterans can enjoy. Challenge your friends online, or compete for fame and glory on the Capcom Pro Tour. The path to greatness begins here: RISE UP!\nFor a full list of features available in the main game, please visit: http://store.steampowered.com/app/310950/FEATURESNew and Returning Characters: Classic characters like Ryu, Chun-Li, Charlie Nash and M. Bison return! Many more new and returning characters will be added to the diverse roster, offering a wide variety of fighting styles for players to choose from.\nNew Strategies and Battle Mechanics: Highly accessible new battle mechanics, which revolve around the V-Gauge and EX Gauge, provide an unprecedented layer of strategy and depth to the franchise that all players can enjoy.V-Trigger: Unique abilities that use the entire V-Gauge, which allow players to turn the tide of battle.\nV-Skill: Unique skills for each character that can be done at any time.\nV-Reversal: Unique counterattacks that use one stock of the V-Gauge.\nCritical Arts: Ultimate attacks that use the entire EX Gauge.Next Gen Visuals: Unreal Engine 4 technology pushes the realism and next-gen visuals to new heights, making this latest entry the best looking and most immersive Street Fighter game of all time.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":2977,"name":"Yakuza 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/343/343160cdf27a64a5c650f6319310a444.jpg","description":"The legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld.  However, at the dawn of the bloody war between the Tojo Clan and the Omi Alliance, Kazuma is forced to accept his inescapable fate and returns to a life filled with crime and violence to protect his loved ones.  Yakuza 5 continues the epic story of Kazuma Kiryu and 4 other protagonists, Haruka Sawamura, Taiga Saejima, Tatsuo Shinada and Shun Akiyama.  The saga plays out across 5 major Japanese cities - Tokyo, Osaka, Hakata, Nagoya and Sapporo. Yakuza 5 also features “Another Drama” which is a series of extensive sub-plots that focus on each protagonist.  The battle system and customization system have been enhanced from Yakuza 4 and various mini-games are available in the well-known locales from the series including infamous night clubs and popular CLUB SEGA locations.\n1 player\n6MB minimum save size\nHDTV screen resolution: 720p, 1080i, 1080p\nDUALSHOCK®3\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© SEGA.  All rights reserved.  SEGA is registered in the US Patent and Trademark Office.  SEGA, the SEGA logo, and YAKUZA are either registered trademarks or trademarks of SEGA Corporation.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":702341,"name":"Milk outside a bag of milk outside a bag of milk","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a8/2a88f50fc8fe893de15a3bbcae992b01.jpg","description":"(How do you feel?)\n- I definitely feel. Sometimes that's more than enough.\n(Still, you're anxious, aren't you?)\n- Of course. Moreover, I'm completely terrified. Was it that obvious?\n(You're looking in every direction, but not up.)\n- Ah, this...\n- I've already told you, haven't I?\n(About what?)\n- Ah, you know, small stuff.\n(Can small stuff make you terrified?)\n- It's... hard to explain.\nI climb up the metal railing and let my legs hang down. I sneak short glances at the abyss from time to time. It replies with angry, cold breath. That's how we interact. Like old friends.\n- Sometimes I feel like the whole world pretends to be crazy.\n- As if it's trying to make me believe in something that doesn't exist.\n(That's weird, isn't it?)\nThe game is a sequel to Milk inside a bag of milk inside a bag of milk.\nThe game's events begin the same moment the first game ends.GAME'S KEY FEATURES:Psychedelic narrative full of pyramidal verbal constructions.\nStylized pixel graphics which reflect the girl's distorted perception of the world.\nHigh variability: each playthrough is unique. However, some dialogue lines, images and scenes have only a small chance of appearing; you'll have to really get close to the girl in order to find out everything she hides.\nOppressive and viscous soundtrack.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nikita Kryukov","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]}]