[{"id":4494,"name":"Zack Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9c/b9ca99d5613fc5c134151618327147b0.jpg","description":"Steam Big Picture\nAbout the GameZack Zero takes you on an action-packed platform adventure with incredible 3D graphics and the playability and entertainment of classic 2D games. Help Zack Zero save his beloved Marlene, kidnapped by the evil Zulrog in an effort to obtain the powerful substance that will allow him to travel back in time.Key Features\nMore than 30 characters, including 5 spectacular bosses!\nIncredible and diverse scenarios.\nUse Zack’s experimental suit to wield the powers of fire, ice and rock, with 10 unique skills that become increasingly powerful with use.\nDevelop Zack up to level 20, defeat enemies using a variety of creative attacks in order to reach Zack’s maximum power.\nFind hidden objects in remote areas of each scenario, a true challenge for skilled treasure hunters.\nFollow the storyline through animated comics that portray the game’s script.\nReal-time online ranking system: find your friend’s scores and try to beat them.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Crocodile Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":3190,"name":"Letter Quest: Grimm's Journey Remastered","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae6/ae66a3c246259aaba3bc1c75463c7b9d.jpg","description":"The grim reapers Grimm and Rose need your help to defeat a legion of monsters, ghosts, and evil bunnies using the power of words!\nSpell words to battle monsters, earn gems and use them to purchase upgrades, books, special items, potions, and much more! Letter Quest is a game about using your linguistic skills to survive. It's a turn-based RPG featuring high-res artwork, clever wordplay, and a great soundtrack.\nLetter Quest, RemasteredNew ENDLESS MODE - choose your favorite background art, music, character, weapon, and letter tiles and see how long you can survive!\n8 more achievements, now 60 in total!\nFully animated enemies and shopkeepers\nA brand new soundtrack in addition to the original music - choose your favorite!\nTooltips during battle\nFully rewritten in Unity, allowing for a smoother experience, better resolution options, higher-quality music and sound effects, and much more!\nWindows, Mac, AND Linux support\n70 quests to complete\nA built-in dictionary of over 192,000 English words that is frequently updated\nKeyboard Support\nAll of the battles in Letter Quest Remastered can be played with a keyboard - no more hunting for letters with the mouse if you don't want to! Simply type letters to add them to the current word, hit backspace to remove the last letter typed, and much more!\nLetter Quest Remastered also supports setting key bindings for all hot-keys right in the game's options menu.Touch Support\nEverything in Letter Quest Remastered works great on touchscreen laptops and computers, including Microsoft Surface Pro - you can even swipe to scroll lists and the map!About Bacon Bandit GamesWe're a two-man Canadian game dev team attempting to make great games. Letter Quest Remastered is a completely rewritten version of our first game, Letter Quest: Grimm's Journey.\nThe original Letter Quest was written in Flash and limited the platforms that we could release it on, so we spent over 600 hours rewriting it in Unity and are now proud to fully support Windows, Mac, and Linux!More Infohttp://www.facebook.com/baconbanditgames\nhttp://twitter.com/thebaconbandits","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bacon Bandit Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20617,"name":"The Chaos Engine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7a/f7a70f1b271de9b92a9714db33e4c8ba.jpg","description":"Prepare for the dark world of The Chaos Engine, a steampunk Victorian age in which one or two players must fight the hostile creations of the Chaos Engine across four dynamic landscapes and take part in the ultimate battle.\nChoose from six hard-nailed mercenaries each with their own unique weapons and skills.\nThose who have the strength and skill to overturn the Chaos Engine will be remembered.\n(The Chaos Engine was originally known as Soldiers of Fortune in North America)\nGame FeaturesBattle through four unique worlds in single player or online and local co-op modes.\nPlay in ‘Enhanced mode’ or ‘Classic mode’ with its original graphics and controls for the true Amiga experience.\nGamepad support with optional 16-directional movement.\nSteam achievements to test the mettle of both new players and old fans.\nRelive the classic 90’s Richard Joseph soundtrack.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Abstraction Games","platforms":[{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"SNES"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18086,"name":"Darkness Within 1: In Pursuit of Loath Nolder","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cff/cff439d7c525b5e2b3ff85d0ad1fb850.jpg","description":"Explore disturbing corners of the human psyche. Delve into a dimension of nightmares, the occult and a tense psychological world created in classic Lovecraftian style.\nAs police detective Howard E. Loreid, you are tasked to solve the murder of Clark Field, a wealthy man involved in the occult. Your number one suspect is Loath Nolder; a highly respected private investigator. After mysteriously abandoning his last case and abruptly resurfacing five years later, one wonders how venerated P.I. Loath Nolder has turned fugitive murder suspect. Your seemingly routine investigation takes a dramatic twist as terrifying happenings begin to plague your psyche. Horrifying dreams and paranormal experiences torment your very being and the line between sanity and insanity becomes frighteningly blurred. Face dire truths hidden deep within the recesses of your mind, as you embark on a surreal adventure.Key features:A chilling point and click Puzzle Horror Adventure inspired by the Works of H.P. Lovecraft, now brought to Steam for the first time as a slightly enhanced edition with Chromatic Aberration and cinematic effects applied to the game's graphics !\nBuilt-in Hint System with 3 Difficulty Levels – Players can choose to play in Standard, Detective, or Senior Detective modes.\nUnique Inventory System – Utilizing the ‘thinking screen’ allows players to collect and examine items, and thoughts. Clues can also be researched, combined or used.\nDynamic Puzzles and Features – Traditional adventure game puzzles are complimented by deciphering dreams and underlining excerpts in documents to garner critical clues.\nEnhanced Gameplay Experience – The proprietary game engine enables compelling special effects and stunning visuals in a panoramic first person game environment.\nEerie Gameplay Atmosphere – An immersive experience is created by a fascinating story, chilling real-time cut scenes, and haunting music.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Zoetrope Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":16970,"name":"Duet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c15/c15b292e62cd6596f71ca240e87ffc05.jpg","description":"Your survival is dependent on protecting two vessels - they are devices in sync, a dance and song between two entities tethered together in symbiosis. Feel edge of your seat terror where the world around you becomes quiet and numb as all that matters is the game -- that is Duet.Gameplay\nWith air tight controls and gameplay tuned to perfection, Duet provides the perfect balance between challenge and pure gaming satisfaction. Turn left and right to twist your vessels and avoid everything in your path. Remember: even that which begins simple can end complex.Nine Story Chapters\nExperience nine chapters of deceptive narrative and nerve-twisting gameplay. Replay any stage to perfect your movements and unlock over 50 achievements. This is a game that will test you.Eight Epilogue Chapters\nExplore a whole new narrative with all-new game mechanics in the Epilogue. Including over 40 stages, narrative and remix tracks, You will need a new state of mind to complete this experience.Challenges, Encore, and more!\nStill can’t get enough Duet?\nDiscover even more mind-bending challenges with the Encore Chapters.\nCompete on the leaderboards in the Endless Mode, Epliogue Endless Mode and Encore Endless Mode.\nHone your reflexes with the Speed Run Mode.Hypnotic Audio\nAn outstanding handcrafted soundtrack by Melbourne composer and Gotye multi-instrumentalist Tim Shiel. Eighteen unique and mesmerizingly beautiful compositions ensure an immersive experience for you at every step of your journey, complemented by full in-game vocal narration by Jojo Petrina.About Kumobius\nSelected for the Indie Showcase at PAX Aus and a finalist in both Game Design and Audio for the Freeplay Festival. This is another award-winning title from the team behind Time Surfer & Bean’s Quest. We call Duet a “Hex-like” in honour of Terry Cavanagh’s contribution to the medium of games and exploration of genres.About Tim Shiel\nTim Shiel is a composer/producer based in Melbourne. Tim is known to some as Faux Pas, the moniker under which he released a steady stream of constantly shifting electronic music for many years. He is also known for his work as a broadcaster at Melbourne independent radio station 3RRR FM, and for his recent role as multi-instrumentalist in Gotye's live band.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kumobius","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15698,"name":"Off-Peak","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c09/c091aa9af32cf2cd6ac671542a7f4b33.jpg","description":"You're stranded at a cathedral-like train station in the near future, searching for a ticket out of town. Explore the secret passageways, interact with strangers, dig for records, and get hypnotized by the soundtrack – a batch of original music courtesy of the band, Archie Pelago.\nWelcome to Off-Peak, a game created by Archie Pelago cellist Cosmo D.\nIn the game, players will uncover a world where the fate of it's musicians and artists is unclear, yet their tools of the trade are highly prized. Meanwhile, the station itself provides all the comforts a commuter could ask for: great food, the best beer, entertaining board games, relaxing gardens. But who is really benefiting here? It is entirely up to the player to what degree they want to engage in and interpret Off-Peak's stories, characters and themes.Gameplay\nOff-Peak is a first-person adventure game that takes place in one giant area with multiple nooks, crannies and hidden passageways to discover. Within its own bounds, the game can be explored at any pace or direction the player so chooses.  On average, the game takes roughly 20-30 minutes to play in its entirety.Off-peak Is freeware.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cosmo D","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12564,"name":"High On Racing","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57e/57ef29222eb0b94138e1ec2c9d962e7e.jpg","description":"High On Racing is an unique Retro Arcade Style Tactical Racing Game that will warp you into the sky to race against the time.\nFind the hidden RED diamonds that will get you into the next stage by only sliding left and right. You have to be fast to check the ground plates that will let you turn, jump and just changes the direction you are flying.\nFace 15 Maces with secrets, deadly traps and nearly impossible to master obstacles. And find the way through them to finally win the high score!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SilentFuture","platforms":[{"id":0,"name":"PC"}]},{"id":4353,"name":"Bang Bang Racing","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b39/b3926aa0f8dce5ac47112dce021f7614.jpg","description":"Bang Bang Racing is a distinct arcade game focusing not only on the speed but also on the technical driving skills. The very intuitive control system and the exciting tracks provide endless fun for everyone in the family.\nBang Bang Racing delivers fast-paced racing around every corner and down every straight. Drive high-speed, pumped-up racing cars through cones, tires and exploding barrels! Be one step ahead of your competitors, finding shortcuts, repairing your car in the pit lane, and dominating your opponents from the top-down view.Key Features:Visit exotic racing locations from all around the world\nComplete 9 challenging reversible circuits and vary them with shortcuts\nChoose from the 20 unique vehicles across 4 classes of racing- muscle cars like N-Dura, stock car series like  Evo GT, world endurance championship like Protech and formula one open wheels cars like Apex\nVary your choice of vehicle with one of the 8 colorful skins offered\nCall your friends to play with 4Player Split-screen Multiplayer Races\nCompete for top honors with extensive Friends and Global Leaderboards\nFace dynamic, interactive objects like cones or exploding barrels that make every race unpredictable\nBe aware of environmental conditions affecting the drivable surface-Snow, Sand, Water and Oil","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Digital Reality","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3788,"name":"Dustforce","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c68/c688a464c84baddf30fa6760aaf0f68e.jpg","description":"Dustforce is a platformer in which the main character is a janitor. The player takes control of one of their four janitors who use acrobatic tricks and a mop to clear dirt and filth from more than 50 levels of the game. Janitors differ slightly in characteristics such as the height of the jump. After completing the level, the player receives an evaluation from the game based on the finesse of the playthrough.\n\nThe game is often compared to such takes on the genre such as Super Meat Boy and N +, where the main emphasis is on timings and player’s quick reaction. Cleaning is automatic, and enemies need to be defeated by performing attacks. After the death, the level begins from the previous checkpoint. \n\nThere is also a local multiplayer for four players and a level editor in addition to game’s singleplayer. In multiplayer, different variations of Survival and King of the Hill modes are available: some players remove the mud spread out by the level of other players. In October 2014, there was a  free DX Update released for the game, in which the developers have added new levels and maps.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":505839,"name":"Cube Escape Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/313/31360e0633ba859c5f4b22713c934891.jpg","description":"In this classic point-and-click adventure anthology you follow the path of Dale Vandermeer, a homicide detective, as he investigates the death of a woman and finds himself drawn into the mysterious world of Rusty Lake.\nCube Escape was Rusty Lake's first series of games, introducing the Rusty Lake universe. Heavily inspired by TV series Twin Peaks. All games will be updated, preserved and bundled on Steam for a small price, to survive the end of the Flash Games era. The Cube Escape Collection will contain 9 chapters: Seasons, The Lake, Arles, Harvey's Box, Case 23, The Mill, Birthday, Theatre and The Cave.\nThanks for your support!\nPLEASE NOTE: These games do not contain any new content from their original versions (besides achievements, a new hint system and translations)!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rusty Lake","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":32186,"name":"Unreal Tournament","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbd/dbd43988f23859529e1a8c600c6a7e24.jpg","description":"Unreal Tournament is the original King of the Hill in the frag-or-be-fragged multiplayer gaming world. As the undisputed 1999 Game of the Year, Unreal Tournament grabbed the first person shooter genre by the soiled seat of its pants and knocked it around the room with its never-before-seen graphics, brutal edge-of-your-seat gameplay and a massive and varied feature list that gave gamers more than they ever expected.\r\n\r\nWith enhanced AI, bots in Unreal Tournament play as if they're jacked up on a big old shot of steroids. Their basic deathmatching skills have been virtually perfected, their understanding of the game rules is professorial, their ability to navigate levels is GPS-like, and their threat to your existence is very real.\r\n\r\nUnreal Tournament's robust UBrowser system provides the easiest way to find a game on the Internet and jump into battle, eliminating the need to download third-party server querying applications, and virtually any option you want to tweak can be accessed via the UT command line. Nice and easy!\r\n\r\nThanks to Spectator Cams, you can enter a game and hop around to view the action on the level. Even cooler, the camera can be \"attached\" to one of the players in the level to view the action from their perspective.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Digital Extremes","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"PC"}]},{"id":23850,"name":"The Legend of Zelda: Spirit Tracks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a1/4a1ed758c53873d6442562f0c772b640.jpeg","description":"Spirit Tracks have long protected the kingdom from evil. But when they\nstart disappearing mysteriously, Link and Zelda must travel together to\nrestore them and keep the dark forces at bay. Fight enemies and explore\nthe world as you travel by train and take control of a hulking suit of\narmor!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"}]},{"id":20171,"name":"Wild Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/884/88448427e6d30218287a61aa38ac2b8c.jpg","description":"Survival of the fittest: now with guns.\nWild Warfare is a free-to-play, class and vehicle-based FPS, starring a colourful cast of critter mercs. Inspired by old school shooters, it seeks to capture the fun and fur-ious action of classic era multiplayer games. There ain't no regenerating health here.\nWild Warfare is currently in Alpha. If you enjoy classic arcade action with well balanced gameplay, crazy characters, and bears with mini-guns, this is exactly that game.\nWild Warfare features:\nClass-based combat - nimble rabbits with bludgeoning weapons, raccoons with assault rifles, and more on the way!\nVehicle combat - Armoured Walkers transform the battlefield instantly with missiles!\nCustomizable characters - deck out your animal with warpaint, hats, and backpacks!\nA bunch of game modes (Capture the Flag, Team Death Match, and Death Match)!\nRanking and levelling up - earn your infamy!\nMore of everything! This Alpha only scratches the surface of what's in store!\nNo animals were harmed in the making of this game. But we encourage you to pick up the slack.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hyper Hippo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20061,"name":"Seduce Me the Otome","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d61/d6105065f6452f9886cbd3ec9f90f2e4.jpg","description":"\"It seemed like the start of something new. Something that would change.\"\nYou are a senior in high school along with your two best friends, Naomi Patterson and Suzu Cappini. You are also the granddaughter of Harold Anderson, the CEO and founder of Anderson Toys, a toy company sworn to give children amazing products and give a large part of their profit to charity.\nOne day, you get called home to attend your grandfather's funeral. After the funeral, you learn that you have inherited his large estate. Your father suggests you move in immediately, so the next day, you move out of your parents home and into your estate.\nWhen you enter your new home, however, you see five injured, yet very handsome men on the lobby floor. They eventually awaken and make it known that they were attacked by a group of dangerous 'misfits' and ran to find shelter, passing out as soon as they entered your home.\nYou find out that they are incubi, 'demons who consume and use sexual energy of humans to survive'. With nowhere to go and a target on their backs, they ponder what what to do. Out of sympathy, you offer your home as refuge for a while in exchange for minor servitude (it is a big house, after all). They happily agree.\nWhat will happen as the incubi get comfy? Why exactly did they come the human world? Who are the 'misfits', and will they stop pursuing them so the incubi can leave?\n...Will you WANT them to leave?\n---\nABOUT~\nSeraphim Entertainment brings you \"Seduce Me\", a new otome game. This game is a PG-16 otome with pursue-able men and women. What you say and do determines your ending.\nFEATURES~\nChangeable Main Character Name\n6 Male and 3 Female romantic options!\n22 Potential Endings!\nCompletely Optional Implied Sex Scenes\nCustom GUI\nOriginal Soundtrack\nFull English Voice Over\nCG Art Gallery\n'Surprise' Gallery\nLike the Music? Get the music here!\nhttps://itunes.apple.com/us/album/seduce-me-original-soundtrack/id969743836","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Michaela Laws","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":19966,"name":"Grim Legends 2: Song of the Dark Swan","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a07/a07b00d2b3d2da3ab1f2f7416b5f1242.jpg","description":"Embark on a dangerous quest through mysterious ruins and magical woods in the second chapter of Grim Legends series. Save the young queen from a mortal danger and change the faith of the entire kingdom!\nWhen a mysterious illness befalls the queen of the Eagle Kingdom, a famous healer is summoned to Eagle Castle to examine her.\nThe Healer’s quest takes a sudden turn when the infant prince vanishes under mysterious circumstances. The queen is accused of practicing dark magic and thrown into the prison tower.\nAccording to the kingdom’s law, sorcery is a crime punishable by death. The desperate King, believing his wife is innocent, begs the healer to find a way to exonerate the queen.\nThe protagonist has only one day to reach the ruins of the Swan Kingdom and unravel the mystery behind the ruling family’s curse. Only then will she manage to find the young heir to the throne and save the queen from her execution.\nWill the healer be successful in saving the queen? Will she rescue the little prince from the clutches of dark magic?\nThe fate of two kingdoms lies in the healer’s hands.\nFeaturesA legendary realm imagined brilliantly in 42 hand-painted locations\n3 fairy-tale sidekicks to help you in times of need\n32 challenging mini-games and 16 hidden-object scenes\n14 intriguing characters to meet on your journey\nAn additional story told from two different perspectives!\n29 achievements to unlock!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16697,"name":"Echoes+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e4/2e48a6e80453d44028173f62fe6e3f7d.jpg","description":"Echoes+ is an intense retro action space shooter created with App Game Kit 2. It will test your reactions and concentration levels to the max!\nFight your way through wave after wave of neon coloured space enemies, leveling up your score multiplayer and shields as you go. The onslaught just keeps on building with new challenges the further you progress. You'll need to be super focused if you want a place on the global high score table, one blink and it can be all over!\nEchoes+ is a showcase game made using App Game Kit 2 (AGK). You can learn more about App Game Kit 2 here:\nhttp://store.steampowered.com/app/325180/Echoes modeEchoes mode consists of 10 levels of blasting action, each introducing a new enemy with different strengths & weaknesses.\nWhen you get hit you lose energy but it can be replenished by collecting green power ups. Getting hit may also downgrade your weapon, but act fast and you can power it back up again. Increased kills means more power-ups.Time AttackJust want a quick blast? Then try time attack. In this mode you have to score as many points as you can in 3 minutes.  You get unlimited energy but being hit incurs a points penalty.\nTips\nThe secret to a high score is collecting multipliers.\nThe more enemies you kill the more multiplier power-ups will be dropped.\nShooting stars will always drop a score multiplier.\nWarning! Points lost if hit are linked to the score multiplier.Survivor ModeThis is all about how long you can survive without taking a hit. The score is irrelevant!\nTips\nYour weapon will power up over time automatically.\nTime is your priority so shooting enemies might not always be the best approach.\nDestroying planets might be risky but they drop shields which will protect you for 10 seconds, invaluable in this game mode.Classic ModeThis has a simpler game play and modified controls making it more like the 80's retro games.\nTips\nUse smaller and more controlled movements than in other game modes.\nTry and stay away from the edge of the play area whenever possible.\nListen out for the warning sounds that mean a saucer is approaching.Meteor Storm ModeThis challenges you to fend off increasingly frequent and dense waves of meteors. Destroy the golden meteors & collect score multipliers.\nTips\nYour ship starts with a fixed amount of energy which cannot be replenished.\nGetting hit reduces your energy but also causes you to drop some of your score multipliers.\nYour weapon power is fixed and cannot be increased.Asteroid Belt ModeHere you face snakes of energy that increase in both quantity and length at each new level.\nTips\nYour ship starts with a fixed amount of energy which cannot be replenished.\nThe score multiplier is linked to the number of asteroid belts at the start of the current level.\nYour weapon power is fixed and cannot be increased.Zoo Trials (zoots)These are a series of additional challenges. Each zoot can be attempted on any of the four difficulty levels, with harder difficulties contributing more towards your total completion percentage; Easy = 1%, Normal = 2%, Hard = 3% and Insane = 4%\nOnly the hardest difficulty achieved counts towards your total, so for the ultimate 100% score you need to complete each of the 25 zoots on insane difficulty.\nZoots can only be completed in specific game modes so make sure you check these on the zoo trials menu screen.\nThe Pause screen shows your progress towards and zoots.\nIf you enjoyed Echoes+ then you might also like 1982!\nhttp://store.steampowered.com/app/639650/1982/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Game Creators","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15912,"name":"Edge of Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9a/c9a1e264c093c97431d6cc366432099a.jpg","description":"Special Edition Content:\nChrome Fineous Mount\nSE Laser Pick\nSugar Glider Pet\nFirst Responder Armor\nLuchidor Helmet\nTopHat Helmet\nConcept Art PDF\nEdge of Space OST\nTake a look at our journey through Early Access.\nFeaturing Official Terraria Content!\nAbout the GameSuit up as an operative of the Ark Corporation, sent to the farthest reaches of the universe in search of habitable planets to terraform. However, after the long space journey you awaken from cryosleep to find that your ship has gone way off course and is disabled near a strange new world. With no choice but to descend to the surface and figure out how to survive long enough to complete your mission, you step into the escape pod.\nAlong the way you’ll gather resources to craft armor, weapons, facilities, and vehicles to help you explore the world and conquer its aggressive inhabitants. Your base of operations will evolve from a few basic facilities exposed to the elements into a hardened fortress full of advanced technologies that let you accomplish amazing improvements to your equipment and alter the environment itself.\nBe careful, though; almost everything down there wants to kill you, including fierce laser space sharks, artillery-toting polar bears, wickedly quick jetpack penguins, and even crazier horrors. Out on the Edge of Space, you must adapt or you die. Good luck, ArkCo Operative!\nKey FeaturesOpen World Exploration– Dynamically-generated 2D sandbox set in the deepest recesses of space, explore randomly generated caverns, wormhole anomalies and dive deeper into the planet to discover valuable resources and other rare phenomenon.\nCrazy Creatures – Hordes of enemies and epic bosses ranging from Artillabears, squid pandas, jetpack space penguins, and laser space sharks; not to mention epic bosses like DJ Penguin and Omegatron\nCooperative Exploration – Engrossing gameplay, built from the ground up, to support multiplayer focusing on cooperative exploration and combat with team-based tactics.\nAdvanced Crafting System - Using the power of science, craft advanced technology for weapons, gear and base constructions from basic resources\nLoads of Armor – Ranging from stat boosting battle armor to quirky vanity costumes, craft armor to survive the changing environmental conditions and specialize in different aspects of mining, exploration, and combat.\nWeapons – Create a wide-variety of dynamically generated weapons ranging from guided rocket launchers to Experimental Gauss Rifles and discover new advanced weaponry to expand your arsenal.\nResearch System – A new research system allows players more freedom to discover new areas of technology in exploration, combat, base building, and much more.\nCommand Center Management – Establish your central base of operation by creating the ultimate Command Center customized with defensive turrets, hangers and repair drones.  Make improvements to protect yourself from the constant environmental changes like radiation storms and other anomalies.\nPIOS (Power Input Output Systems) – A simple drag and drop tool, letting you design electrical systems as basic as powering a light or as complex as creating your own logic gates.\nPets – Create and collect pets that assist you on your epic exploration of space by granting defensive, offensive, or exploration perks.\nAnomalies - Random world events both dangerous and helpful\nVehicles - Craft items from hover boards to massive mechs to safely explore the dangerous world\nTerraforming - Conquer space by turning the land into a livable habitat\nContinual Support – Regular post-launch updates will bring fresh new content","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Handyman Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14104,"name":"Sakura Space","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a8/6a8b7c75ba6664a3cab33ae0e1cb1f2c.jpg","description":"Captain Shika has seen all kinds of things in her adventures throughout the universe, and with her two loyal crew members by her side, she's managed to make a name for her small company of mercenaries. When Shika finds a bounty job offering an absurd amount of money, she doesn't hesitate to act: tracking hardened criminals is part of the job. Their target is an elusive mastermind, a mark who challenges their ingenuity at every turn. In this yuri space adventure, the crew will need all of their wits - and a fair amount of luck - to bring their quarry to justice.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13772,"name":"Worm.is: The Game","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c97/c97605472b1252d587018141d90bb9c0.jpg","description":"** From the creators of Mitos.is: The Game (82% positive reviews). **\nHere it comes ... Worm.is: The Game!\nSmash worms or slither trying!\nWarning: Incredibly addicting Multiplayer Game!\nYou are a worm and you slither around looking for food to eat to get longer. Other worms, likewise, slither around you seeking for food and trying to cut in front of you. When your head hits another worm you become food for worms. Try to intercept your enemies as they slither to kill them and eat their mass. Finally, beware of the viruses!\nWormis allows you to:\n- Two Game Modes: Free to Play, Random Team, Others coming soon\n- Private rooms to play with friends\n- Eat food to gain length\n- Cut other worms' way to kill them and finally eat them\n- Stay away from viruses: they slow you down and absorb your mass\n- Expel mass to give it to other worms\n- Have a lot of fun!\nComing soon\n- Custom skins\n- Items and equipment\n- Much more! Stay tuned!\nMusic \"a new Monster\" by h3ctic. Thank you!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Freakinware Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12882,"name":"The Albino Hunter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e07/e0779053d23f25920e82ff1bc2df7619.jpg","description":"Kalymn Nox is the Albino Hunter; even his pretentious and slightly racist title can keep him from waking up broke after a night of drinking. Join him as he takes on various jobs throughout the land which include:\n-Spontaneous Engagement\n-A Telepathic Lizard\n-A Witch with a Poorly Insulated Castle\nAnd hey! That was just in the Demo alone! The Full Version will include various additional plot lines, an updated Battle System, more Party Members, and even an Interdimensional Mini-Game.\nRecommended Age: 14+","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cherry Co. Studios","platforms":[{"id":0,"name":"PC"}]},{"id":3991,"name":"Aliens: Colonial Marines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bb0/bb04eabb272c7bd9e89e0321b5c47b86.jpg","description":"In partnership with Twentieth Century Fox Consumer Products and developed by critically acclaimed studio Gearbox Software, Aliens: Colonial Marines will bring new levels of bone-chilling suspense and adrenaline-filled action to the renowned franchise. The game pits players against the universe’s ultimate alien killing machines, the Xenomorphs, in claustrophobic environments guaranteed to produce blood curdling thrills.\n1-2 players\nHDTV screen resolution: 720p, 1080i, 1080p\nDUALSHOCK®3\nNetwork Players 2-12\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nAliens: Colonial Marines, Alien, Aliens, Alien 3™ & © 2012 Twentieth Century Fox Film Corporation. All rights reserved. Twentieth Century Fox, Alien, Aliens, Alien 3 and their associated logos are registered trademarks or trademarks of Twentieth Century Fox Film Corporation. Aliens: Colonial Marines game software, excluding Twentieth Century Fox elements. © SEGA. SEGA and the SEGA logo are registered trademarks or trademarks of SEGA Corporation. All rights reserved. © 2012 Gearbox Software, LLC. Gearbox and the Gearbox Software logos are registered trademarks of Gearbox Software, LLC in the U.S. and/or other countries and used here under license.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Gearbox Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":3802,"name":"Double Dragon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/950/95072fc0c187fbb2c8c5855767d8c90b.jpg","description":"Set in a post-apocalyptic New York, Double Dragon is the story of Billy and Jimmy Lee, twin brothers trained in the fighting style of Sou-Setsu-Ken. Together, they manage a small martial arts training school, teaching their students in self-defense. One day, Billy's girlfriend, Marian, is kidnapped off the street by the \"Black Warriors\", a savage street gang led by a man named Willy. The Black Warriors demand the Lee brothers disclose their martial arts secrets in exchange for Marian's freedom. The Lee brothers set out on a rescue mission to crush the Black Warriors and save Marian.\n\nUsing whatever techniques they have at their disposal, from the basic punches and kicks to the invulnerable elbow strike, as well any weapon that comes into their hands, the Lee brothers must pursue the gang through the city slum, industrial area and the forest before reaching their hideout to confront the big boss, Willy.\n\nThe NES version of this game also has an additional VS. fighting mode for one or two players. Players choose from a field of six different characters (Billy and 5 of the enemy characters) and enter into a one-on-one fighting match. Players have to punch, kick, jumpkick, and even use a weapon against their opponents until someone's health bar is fully drained. The winner is the last one standing.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Arc System Works","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"NES"},{"id":0,"name":"Game Gear"},{"id":0,"name":"Android"},{"id":0,"name":"Atari Lynx"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Atari 7800"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Atari 2600"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":1312,"name":"The Deer God","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/396/396edbe692ed9022c64307b1bafcb90e.jpg","description":"The Deer God is a breathtaking 3D pixel art adventure that will challenge your religion and your platforming skills.\nIt's a game about survival, reincarnation, and karma; all set in a breathtaking and unique 3D pixelized world.\nFeast your eyes on the beautiful lighting, day and night system, and vast landscapes.\nBecome one of the most beautiful animals on planet earth.\nLIVE AS A DEER.\nSURVIVE AS A DEER.\nFeatures:\nGorgeous 3d pixel art world to explore\nVarious animals and characters to interact with\nNight and Day system\nVarious quests\nTons of items to find and use\nReincarnate into other animals\nUse the power of statues and level up your antlers\nFind secrets and solve ancient puzzles\nFollow an interesting and dark storyline\nAmazing Original Soundtrack by Evan Gipson.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Crescent Moon Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":339241,"name":"Rexaura","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/040/04003b93103a46e626b7d1d27655df16.jpg","description":"Rexaura is a modification for Valve's Portal featuring a single-player campaign through an alternate world of Aperture Science. It contains 20 new chambers centered around high energy pellets. Players familiar with Portal and Portal 2 will once again be put to the test because Rexaura introduces a wide array of new testing elements that will force you to sharpen how you think with portals.\n\nRexaura is designed for those who have completed Portal. The puzzles are intended to be challenging to solve but easy to execute once you know the solution.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":162987,"name":"Oblivion","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8f/d8f8307b5379e9eb55d52739aed0c289.jpg","description":"This is Oblivion, a multiplayer survival game with lots to do and awesome game mechanics. This game is based on an unreal engine asset but has been revamped. This is a a very early stage of the game but will be updated as much as possible. The team are very dedicated and are down for any community feedback. This game will be very community-based, YOU choose and vote in this game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Leon2k909","platforms":[{"id":0,"name":"PC"}]},{"id":28455,"name":"Toy Soldiers: Cold War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e6/2e69114048671c3a53f841a9abe5c0bd.jpg","description":"(Online Interactions Not Rated by the ESRB) The Cold War is decided when ‘80s era action toys come alive and wage war! Toy Soldiers: Cold War blends intense first person combat with addictive action strategy, whether you’re scrapping solo or jumping into the fray with friends.  Battle in campaign, competitive, co-op modes or fight for the highest score in mini-games!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Signal Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":27711,"name":"Metroid: Zero Mission","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c9/9c9a48645464b53cb20b9c8559125eeb.jpg","description":"Space bounty hunter Samus Aran is sent on a lone mission to infiltrate the fortified planet of Zebes. Traverse through the mazelike base of operations for the Space Pirates, gaining access to powerful upgrades and items for your weapons and suit. Locate Mother Brain, and put a stop to the replication of Metroids!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":25166,"name":"Transformers: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/792/7924eba36daf05ceca74b297a8340343.jpg","description":"Transformers: The Game lets gamers control the outcome in the battle for\nEarth as they choose to protect it as Autobots or destroy it as\nDecepticons. Players will also experience the unstoppable power and\nmassive scale of their favorite Robots in Disguise such as Bumblebee,\nBarricade and others.\n\nFeatures\n\nProtect Or Destroy The Earth – As the Transformers robot’s war comes\nto Earth, gamers make the choice to join the Autobots in protecting\nour planet or to join the Decepticons in destroying it. With dual\ncampaigns, the fate of the world is in players’ hands.\n\nInstantly change from a larger-than-life robot to a high-powered\nvehicle such as a sports car, fighter jet or helicopter. Seamless\ntransformations leave enemies in the dust or enhance players’ combat\nstrategy with a range of options in both vehicle and robot modes that\ntake full advantage of the characters’ dual forms.\n\nCrush, topple and wreck every object, including buildings and\nvehicles, in your path, or use the objects as weapons. It is up to the\ngamer to decide how best to use the environment.\n\nAn unprecedented line-up lets gamers experience the massive scale,\nunique abilities and sheer strength of an army of characters from the\nTransformers universe. Play Optimus Prime, Megatron, Ironhide,\nStarscream, Bumblebee and more.\n\nFor head-to-head battles, fans engage in melee combat that reflects\neach Transformers robot’s character, scale, weight and power along\nwith melee weapons and special moves unique to each character. The\ngame’s ranged combat offers a wide array of projective weapons\ndesigned to take out enemies from afar.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"}]},{"id":23767,"name":"Captain Toad: Treasure Tracker","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/56f/56f074a9deb83de61434c5498ab86b27.jpeg","description":"As of February 13th, 2019, you can purchase the Captain Toad: Treasure Tracker - Special Episode DLC to continue your journey with eighteen new challenges, including five brand-new courses. Purchase and download this content before March 14th for early access to one of the courses! The remainder of the DLC will be available on March 14th. Naturally, you can play all of the courses with a friend or alone. Either way, you’ll dodge dangers and track treasures across many trap-filled miniature worlds; some are even based on the Super Mario Odyssey™ game!\nCaptain Toad stars in his own puzzling quest on the Nintendo Switch™ system! Our stubby hero must dodge dangers and track treasures across many trap-filled courses. Survive smoldering volcanoes, hazardous steam engines, haunted houses, and even new courses based on the Super Mario Odyssey™ game! Luckily, a second player can join in by tossing turnips at enemies.\nPlay anytime, anywhere, and anyway you want—even in two-player mode using a pair of Joy-Con™ controllers on one Nintendo Switch system—in TV mode or Tabletop mode. You could also play alone in handheld mode! No matter what, explore each puzzling course for treasure, like hidden Super Gems and Power Stars. As you reclaim the treasure stolen by the monstrous, greedy bird, Wingo, you’ll eventually be able to play as Toadette! These tiny heroes must waddle, hide, pluck, chuck, and power-up through enemy-infested locales like towers, wild-west shanties, and Goomba waterparks—all bursting with secrets. Aim your head-mounted flashlight at adventure!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"}]},{"id":20857,"name":"Star Wolves 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20e/20e195ff1616eb03968c59b3fbbd2270.jpg","description":"Six years have passed after the events of 2226 A.D. The balance in the galaxy has been restored as transgalactic corporations have been deported to the outskirts of the galaxy and deprived of their power.\nThe Empire, just as before, continues to fight against the Aliens. As a rule armadas of battleships aren't used in such conflicts. Small maneuverable squadrons that can attack and retreat quickly are better suited for this type of war. This means that the famous Star Wolves team is back in action!\nStar Wolves is a 3D space RPG with deep strategy and tactical elements. The game thrusts players into a world of freelance space hunters during a time of war for the all-powerful Empire.  Human space pirates, rogue AI computers that rebelled against humanity and Aliens roam space in search of easy prey and planets to conquer.\nStar Wolves 2 is a sequel to the best-selling space strategy with role-playing elements\nHuge game world with over 50 star systems and complete freedom to move from one to another\nNew ships including the Mothership, improved fighters and ships built using alien technologies\nUpgrade your ship with a huge range of parts\nNew characters and mercenaries to join your team\nNon-linear storyline, several ways to finish the game and dynamic missions.  It is up to the player to choose where to go and what missions to pick up.\nUpgrade your ship with a huge range of parts","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"X-Bow Software","platforms":[{"id":0,"name":"PC"}]},{"id":19308,"name":"Cossacks: Art of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35a/35a155a1f257d41040599098b71c972f.jpg","description":"Cossacks: The Art of War – continues the history of the great battles of XVII–XVIII centuries, and introduces five new campaigns, two nations, some new units and much more.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":6627,"name":"The Solus Project","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/565/56564e7233d00ced3b8b233e120b152d.jpg","description":"Full game out nowLEFT EARLY ACCESS JUNE 7 2016 - The full adventure with all and final content is now out!\nVR SupportDecember 4 2016 - Substantial VR patch adding the Explorer Diary along with a range of fixes. See patch notes for details.\nJuly 20 2016 - Major VR patch and update released including VR inventory and crafting. See patch notes for details.\nTSP has work-in-progress support for VR (Vive/Oculus). Support for room scale and the Vive controllers! This is a high end and very large VR experience that requires a powerful computer to be played in VR.\nAbout the GameA single player exploration driven adventure with survival elements, set on a mysterious and seemingly uninhabited alien planet.  Survive through exploration, and unlock the mysteries of Gliese-6143-C. From the creators of \"Unmechanical\" and successor to \"The Ball\".\nEarth has been destroyed and mankind lingers on in a small fleet of ships near Pluto. As humanity's last hope, you are sent to scout a distant planet as a potential location for a colony. After years of space travel disaster strikes however, and your ship is destroyed when approaching the planet...\nWith your team members dead and your equipment gone you have no way of communicating or receiving help from anyone... you are completely and utterly alone...\nDesperately you look for a way of phoning home, but as you explore the seemingly desolate planet, you uncover the dark secrets buried within the depths. In this otherworldly odyssey you uncover mystery upon mystery as you try to survive the harsh climate.\nFEATURES\nExplore - Unlock the depths of the uncharted planet, and discover the secrets buried deep below. Delve into huge cave systems and tombs and uncover over 200 secrets.\nHandcrafted  - 10 large entirely handcrafted levels to explore. Explore and puzzle your way through 5 islands and 5 large tombs/caves.\nAtmosphere - Atmosphere rich environment that is fully dynamic. An alien day and night cycle and a dynamic weather system that calculates everything from temperature, wind, humidity, cloud coverage impact on the climate and so on. It handles ocean tides. Plants respond to the climate. Storms form. Earthquakes happen.\nSurvive - Survive the extreme climate, tornadoes, storms, meteors, lightning, and not least the dark secrets buried beneath the surface.\nVR - Supports Vive and Oculus, including room space and motion controllers. Explore the huge world start to end in VR! (*Some VR features are still in development - see notes at the bottom for info)\nFEATURES CONTINUED\nDepth - Plants grow and rot. Ocean tide based on the moon. Your body responds to everything from getting wet to lack of sleep to walking uphill to the humidity. Hundreds of upgrades to be found. Secret areas within secret areas within secret areas.\nSavior - Your death means the end of mankind. Save us and rebuild a communication device to phone home, by scavenging useful items.\nAdventure - Be a pioneer, an archaeologist, and an astronaut to explore a mysterious alien planet. The adventure has a beginning and an end, but it is a harsh world. A mistake will cost you your life.\nGAMEPLAY\nLinear - The game has a start and end. It is a singleplayer adventure with 10 large levels.\nYour Time- Scale the game as you wish. Go from a super hardcore experience to a relaxing stroll on an alien planet. In fact you can cheat old school console style even. It is your time, your experience.\nJust You - Little hand holding. No obvious enemies. It is just you. All alone by yourself.\nOld school - Fond memories of games from 10, 20 years ago? So do we. Complex level layouts. Dozens of secret areas. Keys to unlock doors. Underground environments. A ~ key to open the game console.\nExploration - There are hundreds and hundreds of things to find hidden away in the world. Secret areas the size of modern \"next gen levels\". Just how deep does the rabbit hole go?\nPuzzles - Puzzle your way through environmental puzzles left by an alien civilization, like our titles Unmechanical and The Ball.\nTHE PLANET\nWorld - Gliese-6143-C is a harsh and barren planet, covered by a vast ocean. Days are over 45C/113F, and nights under -30C/F.\nArchipelago - 5 islands, with a shallow sea between them and connected through a system of caves. To travel from one island to the next you must traverse these dark caverns.\nWreckage - The spaceship in which you arrived crashed on arrival, and its debris is scattered across the world. Find and locate debris sites to find additional resources.\nTombs - Megalithic tombs are all over. Clearly you were not the first intelligent being to have set foot on this planet. Who was here before? Where did they go? What happened?\nVR\nVive/Oculus - Works on both. Supports Xbox controller on Oculus, and either the Xbox controller or motion controllers on Vive. Supports room scale for Vive. Keyboard and mouse is supported as well.\nMovement - Supports regular locomotion walking and teleporting. For rotating you can pick between room scale rotation, snapped rotation (45 degree steps), smooth rotation, or enable strafing. Movement speed can also be scaled freely.\nHigh end and huge - This is not a small VR demo or game. It is a massive 16 hour experiences with miles and miles worth of world to explore, and provided you have a powerful machine (980 and up) you can experience it with some of the most ambitious high end graphics tried in VR to date.\nTSP is not a pure VR game. It was designed for non-VR gameplay and thus a VR headset is in no way required to play the game. If you do have one, it is an awesome (but different) experience!\nVR is work in progress - Currently not implemented: VR Loading screens and Oculus Touch. The intro tutorial is also a bit rough. Everything else works solidly. TSP received a major VR patch July 20 2016 adding VR inventory and crafting among many other fixes, and another one on December 4 2016 adding the Explorer Diary and a range of fixes.\nABOUT US\nThe Solus Project is the brainchild of Sjoerd \"Hourences\" De Jong. As a one-man army he crafted the vision for the game and a large part of the game's looks. Sjoerd has over 12 years of experience in the industry and has worked for a range of large and small studios such as Starbreeze, Epic Games, Guerrilla Games, Digital Extremes, and many more.\nThe game has been in production since July 2013, and has a team of 5 to 10 people working on it.\nTeotl is a small indie studio that was founded in 2010 and is located in Sweden. It released The Ball on PC in 2010 and followed up with Unmechanical Unmechanical on PC and iOS/Android in 2012.\nThe studio focuses on creating high quality and immersive single player experiences. The Ball won the PC Gamer USA Action / Adventure Game of the Year 2010 award.\nGrip Digital is a privately owned developer and publisher of games for consoles and high-end portable devices, based in Prague, Czech Republic. The company was started by industry veterans who worked on games across all major platforms. Grip Games is working with the top independent developers to bring their games to console platforms.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Grip Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":45,"name":"Cosmic Star Heroine","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfc/cfc85370ef7b1527c3eba26178438ca7.jpg","description":"Alyssa L'Salle was one of the top secret agents at the Agency of Peace & Intelligence on the Planet Araenu. But when she uncovers a horrible conspiracy, she has to go rogue in order to save the day! Can Alyssa save the galaxy when everyone (and everything) is out to stop her!\nFeatures:\nThe best of classic and modern RPGs!\nBrisk pacing that respects your time! Save anywhere!\nNo separate battle screen! Battles take place directly in the areas that you explore!\n2D visual style straight from the height of gaming's 16-bit era!\nAnimated cutscenes reminiscent of the Sega CD & Turbo Duo era!\nSoundtrack by HyperDuck SoundWorks (Dust: An Elysian Tail, Precipice of Darkness 4)!\nOver 100 minutes of music!\nMulti-character combo techniques!\nInnovative turn-based combat system that focuses on flow & strategy!\nYour own spaceship! Recruit new agents to help your home base grow!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zeboyd Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":975600,"name":"Portal: Revolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b87/b870833fac4f5ab50afbe997a330e2a5.jpg","description":"The Portal Mod you've been waiting for. Delve into a new story with original characters, spanning over 8 hours of gameplay and featuring over 40 new challenging test chambers which make use of new mechanics.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":67508,"name":"Microsoft Solitaire Collection","genre":"Card","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e7/3e728c858ebd673e099cab3558a47d42.jpg","description":"The World's #1 Solitaire game is now on iPhone and iPad!\n\nFor over 25 years, Microsoft Solitaire Collection remains one of the most played games of all time and is now available FREE for your iPhone or iPad!\n\nThe Microsoft Solitaire Collection offers FIVE of the best Solitaire card games in one app!\n\nKLONDIKE\nTimeless & Classic Solitaire. Clear all the cards from the table using one or three-card draw. Also try out Traditional or Vegas scoring! \n\nSPIDER\nEight columns of cards await you. Clear them all with fewest moves possible. \nPlay single suit or challenge yourself with four suits! \n\nFREECELL\nBe strategic and use the four extra cells to move cards around and try to clear all cards from the table.  \nFreeCell rewards players who think several moves ahead. \n\nTRIPEAKS\nSelect cards in a sequence, earn combo points, and clear as many boards as you can before you run out of deals!\n\nPYRAMID \nCombine two cards that add up to 13 to remove them from the board. Challenge yourself to reach the top of the Pyramid and clear as many boards as you can!\n\nDAILY CHALLENGES\nPlay new guaranteed solvable challenges in all 5 game modes with 4 levels of difficulty every day!  By completing Daily Challenges, you will earn badges and rewards!\n \nXBOX LIVE SUPPORT\nSign in with your Microsoft account to earn Xbox Live achievements and compete with your friends and family. Continue playing on any Windows 10, iPhone or iPad device because your progress and game data will be saved in the cloud!\n\nUpgrade to Premium on iPhone and iPad\nYou can now get the Microsoft Solitaire Collection Premium Subscription for $1.99 per Month or $9.99 per Year.  With  Premium Subscription you get these great features:\nWith Premium Edition you get these great features:\n•             No Advertisements\n•             More coins for completing Daily Challenges\n•             Get a boost for every game of TriPeaks and Pyramid\n•             NOTE: this will not grant Premium on other platforms\n\nPayment will be charged to your iTunes Account on confirmation of purchase. Subscription automatically renews monthly or annually depending on the subscription type purchased. Payment will be charged to your iTunes Account within 24-hours prior to the end of the current period ($1.99 monthly, or $9.99 annually, depending on the subscription type purchased). You can turn off auto-renewal by going to your Account Settings after purchase. If auto-renewal is turned off at least 24-hours before the end of the current period, you will not be charged for the next period.  All cancellations will take effect at the end of the current period.\n\nFor more information visit: https://zone.msn.com/microsoftcasualgames/casualsuite/support/default.htm \nPrivacy policy: https://aka.ms/privacyioslink/ \nTerms of Use: https://www.microsoft.com/en-us/servicesagreement/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Microsoft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":46092,"name":"Tales from Candlekeep: Tomb of Annihilation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58f/58fa540e33d5fbd3c14a319c52c7b9c3.jpg","description":"Tales from Candlekeep: Tomb of Annihilation, a turn-based dungeon-crawling game based on the Dungeons & Dragons Adventure System board games.\n-- SETTING --\nOn the deadly peninsula of Chult, an adventuring party must fight their way through dangerous jungles, labyrinths and dungeons to find and reverse the cause of the death curse. Choose to play as one or more of the four adventurers (Artus Cimber, Asharra, Birdsong, and Dragonbait) to face many perilous challenges and deadly foes throughout the quest.\n-- FEATURES --\nUnique Quests: The procedural map generation allows every quest to remain unique even when replaying them multiple times.\nOver 40 Quests: The game features a mix of Main Story quests and Side quests.\nA board game experience brought to life: The game highlights most of the features from the popular board game, combined with features unique to the digital version.\nCraft your way to Victory: Collect rare crafting materials. Craft powerful weapons and armors to strengthen your heroes.-- DETAILS --\nEnd Acererak’s reign of terror and bring peace to the region of Chult.\nMaster your heroes' capabilities and hone new strategies.\nExplore and fight your way through perilous dungeons and jungles.\nFace hordes of monsters and terrible villains.\nCraft powerful weapons, armor, and accessories.\nLevel up and unlock new possibilities.\nFind chests filled with treasures and materials.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"BKOM Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20769,"name":"Chicken Shoot Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/462/462b45d40d00e61143ac34b0f016e349.jpg","description":"This tiresome bunch of feathered troublemakers is not giving any peace. Stop this hostile destruction from these rampaging roosters in Arcade mode, or fight against the clock in Classic mode in three difficulty levels. Six fabulous landscapes (in Chicken Shoot 1) and another seven landscapes (in Chicken Shoot 2) enchant the player again and again revealing new secrets and gimmicks every time. Punctuated with loads of original sound effects and underscored with idyllic music both parts will amuse not only the lone player, but the whole family with its variety of comic chicken animations, unique surprises and hilarious, raucous chicken noises.\nInvite and join forces with the like-minded for a spell of joint poultry plucking in a network, or on the Internet. Alternatively, stalk them alone and achieve the ultimate high score to secure first place on the international online scoreboard.\nThe Gold Edition contains both: Chicken Shoot 1 and Chicken Shoot 2GameplayCHICKEN SHOOT is a Classic Fun Shooter with adventure elements. You don't have to think too much... just blow the chickens away. In each mission you can collect a number of items and receive many extra points for different actions. So it’s easy - especially throughout the first levels - to score lots of points, but the levels increase in difficulty from mission to mission, eventually becoming a real challenge with a huge hook. The implementation of numerous and varied gimmicks - individually designed for each level - offers the player many hours of exciting gameplay.FeaturesAbout 25.000 hand-drawn chicken animations (in Chicken Shoot 1 and Chicken Shoot 2)\n2 exciting single player modes: Arcade and Classic\nThree difficulty levels for casual and for \"hardcore gamers\"\n6 (Chicken Shoot 1) resp. 7 (ChickenS hoot 2) various levels\n6 various weapons with a different shooting range\nFascinating landscapes with lots of funny gimmicks\nSingle player mode with online high score list\nMultiplayer Mode for up to 4 players over LAN and Internet","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Desconocido","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19969,"name":"Nightmares from the Deep 2: The Siren`s Call","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f6/4f694ac0b6769f18638f9e397aeca075.jpg","description":"Nightmares from the Deep: The Siren`s Call is the sequel to the smash hit Nightmares from the Deep: The Cursed Heart.This epic adventure features an exciting plot full of outstanding puzzles and unforeseeable twists and turns.\nWhen Sarah Black, curator at the Caribbean Naval Museum, receives a package from a mysterious messenger, she is unwittingly drawn into an ancient conflict. Inside the package she finds an artifact, and instantly assailants descend on the museum to rob her. The artifact is stolen. Sarah lowers her head in disbelief as she realizes that again she is falling headfirst into a nightmare from the deep.\nNext Sarah finds herself on the shores of Kingsmouth, a forgotten fishing town which holds an incredible secret. A would-be messenger reveals the sad truth: he and the rest of the town’s denizens are suffering from a curse that is gradually turning them into ghoulish, mutated ocean creatures… a curse that was cast by none other than the mayor, Murray, and the old sea-devil himself, Davy Jones.\nFeaturesThrilling storyline with complex plot based on a dark mystery\nUnusual depth of character for the Hidden Object genre\nAAA-quality cinematics\nA plethora of majestic locations\nVaried gameplay: interactive hidden-object scenes, mahjong, and many others\nThree different types of collectible objects\nThe sequel to the smash hit Nightmares from the Deep: The Cursed Heart, building on the first game’s story\nBonus gameplay:  an additional adventure, telling the story of the praetorians who seek redemption after decades of serving Major Murray\nAdditional materials:  concept art, wallpapers and a stunning soundtrack\nReplayable minigames and HO scenes","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":16957,"name":"Skyward Collapse","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/810/81084013efec05de29e8b077f9ddb173.jpg","description":"How do you balance -- and indeed encourage -- a war between factions without letting either side obliterate the other?  How do you rule over gods, creatures, and men who refuse to obey you?  How do you build a landscape of villages when bandits and mythology are conspiring to tear it down?  Skyward Collapse places you into the role of The Creator, and frees you to tackle these problems your own way.  Brought to you by the developer of the modern strategy classic AI War: Fleet Command, Arcen's second full strategy title is equally unique (but far easier to learn): a turn-based 4x strategic god-game.\nYour task is to build and populate the floating continent of Luminith.  You create -- but cannot control -- gods, creatures, and artifacts from both Greek and Norse mythology.  The power you wield with these is immense: Heimdall's horn causes everyone outdoors to drop dead, for crying out loud.  Your task is to keep both factions alive and fighting until The Master calls you home -- but this is harder than it sounds.  Bandit Keeps pop up periodically, as do Woes such as floods, serial killers, guild strikes, and vegetarian uprisings.  Every game plays out differently, and you'll need even the craziest of your powers in order to survive what lies in store for you.Game Features A turn-based strategic god-game where you control neither faction, but instead strive to maintain the balance of power.\nMake towns and war as the boardgame-like floating continent continues to construct itself around you.\nPersuade your minions into doing what you want by controlling the circumstances of their (brief) lives.\n16 gods, each with unique passive abilities and three active powers, help you further your goals as you pass into the Age of Monsters.\nLevel up your player profile by winning games. Twelve unlockable buildings in all!\nStraightforward controls paired with an intuitive and helpful interface make this an easy title to pick up... but the strategy runs deep.\nMultiple difficulty levels let you play a very relaxed game up to a nail-bitingly difficult one.  There's no one best way to win!\nCo-op multiplayer for up to 8 players.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15397,"name":"Hyper color ball","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84e/84e71d4b6b1d65397fae9d335a0dd80a.jpg","description":"game PlayHyper color ball is a casual, difficult game. The game-play mechanics are based on testing your focus and dexterity skills. With a fast paced, upbeat soundtrack and a strong vibrant colours. Hyper color ball makes for a fantastic party game. You play as the Hyper ball, try to not collide with the elements. Collect green balls which give you points and health boost.color BeatHyper color ball uses our 'Color beat' system, the game tracks the frequency of the music and shifts the in-game colors accordingly.\nThe Hyper ball will also change color depending on your health, watch out for the elements!\nHyper color ball was conceived during Castle game jam 2016!Most Important features: Skins\nBetter color dynamic\nAchievements\nAudio player lite\nAdd your music (wav or ogg)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Czester16","platforms":[{"id":0,"name":"PC"}]}]