[{"id":23165,"name":"Mario Kart 8 Deluxe","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f8/6f846e941c78cfbabe53cd67e55ced83.jpg","description":"Hit the road with the definitive version of Mario Kart 8 and play\nanytime, anywhere! Race your friends or battle them in a revised battle\nmode on new and returning battle courses. Play locally in up to 4-player\nmultiplayer in 1080p while playing in TV Mode. Every track from the Wii\nU version, including DLC, makes a glorious return. Plus, the Inklings\nappear as all-new guest characters, along with returning favorites, such\nas King Boo, Dry Bones, and Bowser Jr.!\n\nFeatures:\n\nRace your friends in the definitive version of Mario Kart 8, only on\nNintendo Switch!\n\nRace as every character on every track from the Wii U version,\nincluding DLC characters and tracks.\n\nPop some balloons in the revamped Battle mode, complete with Balloon\nBattle and Bob-omb Blast.\n\nBattle on new courses, like Urchin Underpass and Battle Stadium, or\nreturning ones, such as GCN Luigi's Mansion and SNES Battle Course 1.\n\nInkling Girl & Inkling Boy from Splatoon, King Boo, Dry Bones, and\nBowser Jr. join the roster!\n\nPlayers can choose a new Smart Steering feature which makes driving\nand staying on the track easy for novice players and kids even at 200cc\n\nThree new vehicles have been added, two are even inspired by Splatoon\n\nCarry two items at the same time\n\nReturning items include Boo, the item stealing ghost, and the Feather,\nwhich gives you a high jump in battle mode.\n\nPlay your friends in local wireless multiplayer with up to 8 players.\n\nDrive through in 1080p HD quality in TV mode\n\nPlay on the go with handheld mode and play anytime, anywhere","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":442847,"name":"Tony Hawk's Pro Skater 1 + 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/088/0885c48293746aad6df30735f30d0836.jpg","description":"Play the fully-remastered Tony Hawk’s™ Pro Skater™ & Tony Hawk’s™ Pro Skater™ 2 games in one epic collection, rebuilt from the ground up in incredible HD.\r\n\r\nDrop Back In With The Most Iconic Skateboarding Games Ever Made\r\nSkate as the legendary Tony Hawk and the full pro roster. Listen to songs from the era-defining soundtrack. Hit insane trick combos with the iconic handling of the Tony Hawk’s™ Pro Skater™ series.\r\n\r\nAll The Original Game Modes And More\r\nPlay all the original modes and go head-to-head with local 2-Player modes. Show off your style and creativity with upgraded Create-A-Park and Create-A-Skater features. Compete against players from around the world in Multiplayer modes and leaderboards.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":236751,"name":"We Were Here Together","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/812/8129a4f97f5a061e370901b6dc257bd8.jpg","description":"Release dateWe Were Here Together is expected to release early next year. In the meantime, you can play the prequel We Were Here and our follow up We Were Here Too.\nAbout the GameWe Were Here Together is a standalone online cooperative adventure, the third entry in the We Were Here series.\nThe game continues the communication-centered adventure in which you and a partner must solve puzzles on an urgent mission to save the expedition... and yourself! This time, expect even more puzzles and discover the story behind the Antarctic expedition.\nStarting out at the research base camp, you’ll need to figure out a way to get to Castle Rock together. Once you’re through the frozen Antarctic wastes, you'll find yourselves separated inside the castle itself, facing puzzles, secrets, and dangers!  You and your partner have nothing but your wits and a walkie-talkie each. Observation, smart communication and teamwork will be the only way to escape from the sinister Castle Rock.\nNOTE: This game is co-op only. It requires both players to have a working PC-compatible microphone and an internet connection.\nTalk – Your voice will have to lead the way.\nYou and your expedition partner must traverse Antarctic wasteland and infiltrate a sinister ancient castle. The only possession you have left is a walkie-talkie.\nSolve – The warmth of life abandoned the halls of Castle Rock long ago.\nImmerse yourself in a thrilling experience as you and your partner puzzle your way through the expedition camp, frozen wastes, and finally multiple wings of two unique locations inside the abandoned castle itself. Discover brand new environments and mysteries, together.\nEscape – We were not alone...\nDarkness has engulfed the once magnificent Castle Rock and its surroundings. Can you discover the truth behind the grim fate of the fallen citadel and make it out alive... or will the original inhabitants catch you on your way out?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Total Mayhem Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":20570,"name":"X-COM: Interceptor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/277/277d4b377e73caa25179d07706a06480.jpg","description":"The fourth installment of the series, X-COM: Interceptor is a combination of genres within the setting of the previously established game. Major Earth corporations ventured to space in order to prevent the decay of civilization, and the player takes command over the elite force to fight the aliens directly in space. Interceptor primarily is a space combat simulator. But the commander is still in charge of the region, so it would be players’ responsibility to manage bases, resources, and finances. \nThe game main screen is no longer shows the anthill of interconnected rooms of the X-COM headquarters. Now players see the map of the space section. Over the course of the first several missions, a new commander will be taught how to locate, intercept and destroy enemy ships. Every battle is played out as a flight simulator. Commander can purchase equipment, hire pilots and research technologies. It’s the first X-COM game to include multiplayer, where players participate in the space combat.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"}]},{"id":16252,"name":"The Dark Eye: Chains of Satinav","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a95/a95e293cd9403f3c99666addd3d76341_TkdqnQe.jpg","description":"###Boardgames are fun!\nThe adventure game in the point-and-click genre from the German studio Daedalic Entertainment. It was highly appreciated by the players precisely because of the adventure games and quests. The game itself is a quest based on the very popular in Germany table game with the same name - The Dark Eye.\n\n###The story\nIn The Dark Eye: Chains of Satinav, player have to look at the world through the eyes of a young man named Geron. Geron is a hunter, and also a very unlucky young man. But this is not a natural evil rock, but someone carefully planned situation. Being the object of ridicule of the whole town, the boy does simply not despair, but, on the contrary, tries to overcome circumstances by the only possible weapon for this - smartness. And he unwittingly becomes part of a swirl of events.\n\n###Key features\nIn the classic for the genre manner (point the cursor, click on the button and something will happen or not) the player will have to plunge into the world that is perfectly worked, thanks to the extensive game universe. The plot is twisted so that you do not even need to be a quest lover in order to want to understand what will happen next - on the next screen. The game is designed in such a way that it will, on the one hand, win the confidence of newcomers, allowing them to retain them thanks to a system of tips, and on the other - not to frighten regulars of the genre with their simplicity. And of course - the balance between the comic and the seriousness of the events taking place will allow the player to go into the plot and feel the atmosphere.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":657,"name":"Happy Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45c/45cf373b371c1912613ff799a16e4fa2.jpg","description":"Happy Wars is an online multiplayer role-playing strategy; it also features a campaign mode. The game consists of matches: two 15-layers teams try to destroy the opponent’s castle and protect their own.\n\nIn Happy Wars you can choose between three types of characters: the warrior, the mage, and the cleric. They also have subclasses that define their specification. For example, Berserker is stronger than an ordinary warrior and more suitable for protecting lines. In general, every class has their unique abilities that can be upgraded with the in-game currency and real money. Wisely balanced teams have more chances to win battles.\n\nThe key feature that differs Happy Wars from other MOBA-type games is that before you destroy your opponent’s base you need to build yours. Bases are equipped with multiple weapons so it’s hard to get close to the enemy rift. Besides the center, there are several control points; the most massive battles are usually held near them. However, the cartoonish style of the visuals makes such epic fights look funny, explaining the name of the game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Toylogic","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":421698,"name":"Animal Crossing: New Horizons","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/42f/42fe1abd4d7c11ca92d93a0fb0f8662b.jpg","description":"If the hustle and bustle of modern life’s got you down, Tom Nook has a new business venture up his sleeve that he knows you’ll adore: the Nook Inc. Deserted Island Getaway Package! Sure, you’ve crossed paths with colorful characters near and far. Had a grand time as one of the city folk. May’ve even turned over a new leaf and dedicated yourself to public service! But deep down, isn’t there a part of you that longs for…freedom? Then perhaps a long walk on the beach of a deserted island, where a rich wealth of untouched nature awaits, is just what the doctor ordered!\n\nPeaceful creativity and charm await as you roll up your sleeves and make your new life whatever you want it to be. Collect resources and craft everything from creature comforts to handy tools. Embrace your green thumb as you interact with flowers and trees in new ways. Set up a homestead where the rules of what goes indoors and out no longer apply. Make friends with new arrivals, enjoy the seasons, pole-vault across rivers as you explore, and more!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":22842,"name":"Anachronox","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fe/6feeb92f482324e86ee1766dc0943a6d.jpg","description":"Anachronox is a third-person role-playing game developed by Ion Storm. \n\n###Story\nApparently, 300 years before the events of the game, a planet with alien technology was discovered. More of these planets were later found and called Senders, as they sent multiple interplanetary ships through the galaxy. Every Sender later became a center of space trade. In the center of the known universe, there is the biggest Sender that ever existed in which Anachronox is placed. It is thought that Anachronox was the homeworld for millions of aliens. \n\nSly Booty lives in a cheap flat in the south of Anachronox. He is attacked by several mysterious agents and is later recruited by a mad scientist.\n\nIt should be noted, that the developers were only able to make a half of the game, as its story was to be told in its expansion pack that never got released.\n\n###Gameplay\nThe game was heavily inspired by Chrono Trigger. However, the character development and inventory management were streamlined and the game focused on the world exploration and the world's story building. The game's protagonist, Sly Booty travels through the galaxy to uncover the mystery of the creation of the universe encountering many characters on his path. Most of these characters can be recruited into your party.\n\nThe players can upgrade Sly's abilities and skills, as well as his inventory.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Ion Storm","platforms":[{"id":0,"name":"PC"}]},{"id":313826,"name":"Museum of Other Realities","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ed/8edd5be882dfe85b35de69252f07d8db.jpg","description":"A new space for a new kind of culture. The Museum of Other Realities is an immersive art showcase.A New Frontier for Art\nStep into a painting, surround yourself with fantastic sounds, experience art as it evolves and takes form. The museum contains a cross section of the free-ranging experimentation present in the relatively new medium of virtual reality art.Building a Community\nHang out with friends and enjoy a collective experience with new people. We hold regular events, celebrating and fostering a community around this new medium.Supporting ArtistsEvery artist featuring their work in the Museum is paid and promoted.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"MOR Museum","platforms":[{"id":0,"name":"PC"}]},{"id":29642,"name":"Silent Hill 2 (2001)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/003/0033ae7d21418ff5a7807ab2c7d90247.jpg","description":"In the sequel to Silent Hill, Silent Hill 2 follows James Sunderland, whose life is shattered when his young wife Mary suffers a tragic death. Three years later, a mysterious letter arrives from Mary, beckoning him to return to their sanctuary of memories, the dark realm of Silent Hill. You must guide James through all-new environments and creepy new areas closed off in the original game. Real-time weather effects, fog, morphing, and shadows set the stage for heart-stopping frights. Be brave as you journey to uncover the truth.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Bloober Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":13038,"name":"Red Faction II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ae/8aeb9db0a0f6077b08a5bc9975904003.jpg","description":"Red Faction II is a first-person shooter by Volition. It is the second part of the same-named tetralogy. The games of the series are traditionally divided into the categories by the genre. Red Faction II corresponds to the first section which includes the first-person shooter gameplay. \n\n###Plot\nThe game takes place straight after the first chapter. The setting is the same — Mars in 2080, five years later than the events of the previous part. The story circles around the narrative of the rebellions on Mars, caused by the dictatorship of Sopot who rules the Mars for the past few years. Sopot follows a logic of uniting the Commonwealth community and the United Republic. The player is representing Alias — the protagonist must put an end to his dictatorship alongside with the other five team members.   \n\n###Gameplay\nAs the player proceeds through the levels the encounter obstacles which they may overcome in many ways: explosives, shooting and even puzzle elements included. The game also features vehicle and melee combat — your jeep may be modified and melee weapons acquired through the boss battles. Every battle differentiates from the previous one and grants the players the unique loot. The title also features local multiplayer which is playable through the 40 levels with the real player or the set of bots.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":3746,"name":"LUFTRAUSERS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4eb/4eb2e76cfd81c0e076415790a90ec294.jpg","description":"LUFTRAUSERS is a shoot 'em up game developed by Vlambeer. It is a remake of an earlier game of the same name by Vlambeer made on Flash.\n\nLUFTRAUSERS is an arcade two-dimensional plane sim that uses retro pixelated style. The player controls a plane that somewhat reminds a vehicle developed in the German V-Waffen (retaliatory weapons) project. The plane's main weapon can shoot only in the direction of flying so the players need some skill shooting and flying at the same time. Further into the game upgrades for the plane are unlocked, such as new weapons, body kits, and engines. There is 125 plane builds available in the game. The build the player uses affects the music player in the game. Every plane subsystem brings something new into the game's music. \n\nThe main objective of the player is to survive against the enemies overwhelming force, which includes reactive and experimental planes, zeppelins, boats, ships, subs and so on. A scoring system is also present in the game. Upon the enemies destruction, the player gains a score multiplier.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":573123,"name":"Life is Strange: True Colors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/278/2784fe67065c5095411f0d4c85205143.jpg","description":"A bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!\r\nPre-order Life Is Strange: True Colors now to receive 4 additional in-game outfits for Alex.\r\nAlex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees as blazing, colored auras.\r\nWhen her brother dies in a so-called accident, Alex must embrace her volatile power to find the truth – and uncover the dark secrets buried by a small town.\r\nTHE TRUTH WILL HURT\r\nDiscover the shocking secrets behind your brother’s death in an emotional roller-coaster of an adventure.\r\nFEEL EVERYTHING\r\nChange fate and change lives with the psychic power of Empathy.\r\nFORGE DEEP RELATIONSHIPS\r\nBuild trust with the townsfolk – and embrace friendship or romance with Ryan and Steph.\r\nA TRULY PERSONAL STORY\r\nMake tough decisions and choose your own future. Freely roam the streets, stores, and hidden spaces of Haven Springs and meet unforgettable characters.\r\nFIND YOUR VOICE\r\nAnd decide Alex's style, with up to 24 outfits in your wardrobe.\r\nEXCLUSIVE SOUNDTRACK\r\nNew tracks by mxmtoon and Novo Amor, and extensive licensed songs including Radiohead, Phoebe Bridgers, Gabrielle Aplin, and more.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Deck Nine","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":386546,"name":"Pixel Puzzles Traditional Jigsaws","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fba/fba0e5d9e376f1c8bc6efa66fdc03e7d.jpg","description":"Pixel Puzzles Traditional Jigsaws, Bringing puzzles to the digital age.\nFor the traditionalist, this iteration of the Pixel Puzzles franchise is for those wanting a traditional well crafted puzzle cut.\nSetting the standards for online jigsaw puzzling.\nWith many FREE puzzles included, Pixel Puzzles Traditional Jigsaws has a large range of puzzles in various sizes for you to solve and enjoy.\nShaped to perfection and with piece counts ranging from 96 to a huge 1410 pieces. Pixel Puzzles Traditional Jigsaws brings you full size professional puzzles to the digital market place. No longer will a puzzler be left looking for that last piece, never again will the kitchen table be covered in tiny wooden shapes.\nFrom square to rectangle to huge panorama images, with a massive variety of separately themed puzzle packs containing only the best images possible, each having a unique yet traditional cut like no other jigsaw could.\nPixel Puzzles Traditional Jigsaws gives you the choice to play only the types of puzzles you really want to solve. It's the definitive way to puzzle, customize the game the way you want, with a full range of options to tweak the game as you see fit. Multiple themed play environments, all fully customizable for you to fine tune the jigsaw puzzling experience you’re looking for.\nPixel Puzzles, the number one place for digital jigsaws.FEATURES:Full range of sizes from 96 to 1410 pieces.\nBeautiful puzzle images.\nAuto saving, never lose your progress.\nPeaceful puzzling atmosphere.\nTraditional puzzle gameplay.\nMany customization options.\nMultiple interactive play environments.\nHint tools to help solve puzzles.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"DL Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":15772,"name":"Lead and Gold: Gangs of the Wild West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dad/dadc0032edd296fe58638f36c348919b.jpg","description":"Lead and Gold: Gangs of the Wild West is a multiplayer third-person shooter developed by Fatshark.\n\nThe game revolves around team-based combat. The class system is present in the game. There are four classes in the game: Blaster, Deputy, Gunslinger, and a Trapper. Every class grants a bonus to their teammates. For example, the Blaster can increase the defense stat of his teammates. The classes are designed to cover every range of the battlefield. The Blaster and the Gunslinger are short range classes, while the Deputy and the Trapper should be used in the middle to long range combat.\n\nThere is no singleplayer campaign present in the game, yet there are 6 different game modes: Conquest, Greed, Powderkeg, Robbery, Shootout, and Demolition. Every game mode requires a lot of teamwork from the players. For example, in Greed mode, the objective of the players is to capture the only bag full of gold on the map and get it to a specific safe zone.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"}]},{"id":379486,"name":"Going Under","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb4/eb476146053ea03619c4b2eee067f2ea.jpg","description":"Going Under is a satirical dungeon crawler about exploring the cursed ruins of failed tech startups. As an unpaid intern in the dystopian city of Neo-Cascadia, you’ll wield office junk as weaponry as you make your way through the offbeat procedural dungeons beneath your company campus.\nThe Future is Wack\nFailed businesses no longer just cease to exist--they sink beneath the earth, and their employees are cursed to wander the halls for eternity as monsters. It’s your duty to put these monsters out of their misery and repossess their assets--so that your boss can afford a new car, or something.\nNot All Heroes Get Paychecks\nBattle through the remains of failed startups themed off of gig workers, dating sites, and cryptocurrency. Uncover the true motives of your employer, a carbonated drink startup known as Fizzle, and their parent company, a subscription box manufacturer with an army of helpful shipping drones. Make friends with your co-workers! Hire a freelance goblin! Date a slime! Invest in crypto! Set a rideshare on fire!\nFight Flexibly\nIn the dungeons of Going Under, almost everything can be used as a weapon, from laptops to brooms to body pillows. Proper weapons can be found as well, but even they can break at a moment’s notice if you aren’t careful. Playing cautiously and picking the right weapon for the situation are musts if you intend on surviving your internship.\nHorrible Bosses\nAnd you thought your boss was a monster. At the bottom of the dungeons lurk the founders of the cursed startups, getting rich off of investments while their employees fight amongst themselves. Defeat them and return to the surface with their enchanted relics to empower the company you work for.\nGet Paid in Experience\nAs you explore, you’ll encounter powerful Skills that change the way you play. Learn them at the Cafe and they’ll show up in future runs. Use a Skill often enough, and you’ll get it “endorsed” and available to start your expeditions with. Combine multiple Skills for crazy synergies, and you’ll be cleaning house in no time.\nA World of Characters\nComplete Tasks for your co-workers to gain Clout with them and unlock their unique bonuses. Learn more about Neo-Cascadia, the origins of Fizzle, and how the drone shipping empire known as Cubicle came to dominate the city. Can you save your company and yourself from going under for good?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Aggro Crab","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":22733,"name":"Lure of the Temptress","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79a/79ab3ca882e351d5423499723bc1890c.jpg","description":"Trouble is afoot in the once peaceful land of Turnvale. Skori warriors (vicious mercenaries under the control of the mysterious Temptress) have arrived. But who is the Temptress, and more importantly, where is she?\nFrom the creators of the Broken Sword series, Revolution Software, comes the first in a series of 'Virtual Theater' adventure game.\nNon-playable characters will walk around and perform different actions regardless of your interaction with them. There is a variety of options and commands, including the possibility of interaction with a supporting character, whom you can give orders in order to solve some of the game's puzzles.\nLure of the Temptress has an intuitive point and click system. Everything you need to do (movie, talk, search and fight) is controlled via the mouse and its two buttons. It's all you need to explore a large and complex game world with over 60 screens to explore... more than 25 intriguing characters to interact with... and of course, Selena - the Temptress.A captivating story set in grim, medieval times\nThe old-school feel of a classic adventure game\nMany interesting characters that move about freely and live out their own lives, thanks to the Virtual Theatre system","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Revolution Software","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20457,"name":"Particula","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/676/676980aa78adec19a441f0c56ea502ba.jpg","description":"A tower-defense game in a psychedelic setting. The developers insist that their game is designed for joint playthrough and name the genre as a tower-defense coop. Therefore, efforts on a single campaign were apparently less elaborated than on multiplayer, so the singleplayer in the game is secondary.\n\nVisually the game is a heap of swirling nebulae, among which there are several strips of a battlefield. Is necessary to arrange the towers at special points along with the battlefield. The towers look like clots of energy, which, as the enemy approaches, begin to attack.\n\nDuring the completion of the game, players have separate resources, and they can build at any point of the map. So there is a little need for cooperation. The appearance of additional players on the map almost does not affect the gameplay in any way. Although the existing arsenal in the game can appear huge, de facto players only have three main types of towers to deploy: ice, poison, and fire. The rest are their upgrades, which must be built separately for some reason.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Microblast Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19400,"name":"Need for Speed: Shift","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22b/22b61e8391b252cbd9be3317709cc68d.jpg","description":"Shift is the thirteenth Need for Speed game. It is considered one of the most hardcore installments of the series. Unlike many of its predecessors, it is oriented towards the actual driving simulation rather than arcade racing.\n\n###Gameplay\nThe creators of Shift aimed to realistically imitate the driving experience, making the game harder than an average NFS game. However, Shift automatically adjusts the difficulty depending on the player's experience and skills. Before the player enters the career, he or she has to complete a test drive at the famous Brands Hatch track to familiarize the game with his or her driving abilities. \n\n###Cars\nNeed for Speed: Shift offers a roster of more than 60 vehicles. As in most Need for Speed games, the player starts with a small amount of money and only a handful of available vehicles. To unlock and purchase better cars, the player has to win races. The cars in Need for Speed: Shift consists of four classes called \"tiers\". The lowest tier contains the cheapest and slowest cars, while supercars from manufacturers like Lamborghini and Bugatti belong to the higher tiers. \n\nThe game also has a detailed modification system. The player can customize not only the car's look but also its important details like tires and aerodynamics.\n\n###Tracks\nAs the player progresses, he or she may unlock new levels. Some of them are based on real-life tracks of Formula One fame, including Spa-Francorchamps, Nurburgring, Silverstone and Laguna Seca. Others are purely fictional and only exist in-game.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":22854,"name":"Ultima Worlds of Adventure 2: Martian Dreams","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/080/0803c497bf50e30c773a53f3ba1158db.jpg","description":"Explore the Red Planet and save history before it’s too late!\nThe year is 1893. The World's Columbian Exposition in Chicago. Astronomer Percival Lowell's colossal space cannon is poised to hurl a huge bullet-ship to Mars. Then disaster strikes! The cannon discharges a day early with dozens of history's leading figures aboard. Unprepared for the rigors of Mars, the accidental space travelers have little chance of surviving. You must rescue the stranded expedition or history will be forever changed!\nMartian Dreams is the second in the Ultima Worlds of Adventure series, taking you, the Avatar, to exciting new worlds of science fiction, mystery, historic exploration, horror, time travel, espionage, and fantasy. Time and space, past and future, fact and fiction--all are are yours to explore in Ultima Worlds of Adventure! Solve the mysteries of the Martian canals, steam-powered factories, radium-driven mechanical men, and other artifacts.\nInteract with some of history's most renowned men and women, painstakingly researched and accurately portrayed. Meet and learn about Sarah Berhardt, Nellie Bly, George Washington Carver, Marie Curie, Thomas Edison, Sigmund Freud, Emma Goldman, William Randolph Hearst, Vladimir Lenin, Grigori Rasputin, Theodore Roosevelt, Nikola Tesla, Mark Twain, H.G. Wells, and dozens more!\nConquer the eerie Dreamworld by confronting your own subconscious fears and desires.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Origin Systems","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":460524,"name":"Worms Rumble","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/075/0753492cda7ee3c9bd4a3ca673fd0c8c.jpg","description":"Worms Rumble is Worms like you’ve never played it before, with intense, real-time, arena-based 32 player cross-platform combat. Get ready to rumble in Deathmatch or Last Worm Standing modes where you’re only ever a Holy Hand Grenade away from death!\n\nUse a variety of fan-favourite weapons like the Bazooka and Shotgun plus all-new additions to the armoury to bring the pain to your invertebrate opponents as you climb the ranks. Customise your worm, take part in challenges and seasonal events and experiment with new ways to play in The Lab. This is Worms, reinvented.\n\nKey Features:\nThe First Real Time Worms!\nYou won’t find any turn-based combat in Worms Rumble. Every round is in REAL TIME! If your enemy is raining fire upon you, give them heck right back!\n\n32 Player Cross Platform Multiplayer\n\nGet ready to rumble online, across console and PC. With Deathmatch and Last Worm Standing solo and squad battle royale modes available at launch!\n\n\nClassic Weapons with New Ways to Play\n\nArm yourself with new and returning fan-favourite weapons! With classics like the Bazooka, Shotgun and Holy Hand-grenade to use at your disposal!\n\n\nEvents, Challenges and ‘The Lab’\n\nTake part in seasonal events, daily challenges and community collaborations for additional XP and rewards, and experiment with new gameplay mechanics and weapons in The Lab.\n\n\nPlayer Customisations\n\nEarn XP and in-game currency to unlock and purchase weapon skins, outfits, accessories and emotes! Mix and match to create your own personal style on the battlefield.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":764,"name":"DC Universe Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cd/0cddbca1ecf96f944a218160c7cdead0.jpg","description":"DC Universe Online is an MMO game set in the world of Batman and Superman. The game offers the player to become a completely new superhero or a supervillain.\n\n###Backstory\nThe game's opening cinematic tells how the greatest heroes and villains of the DC Universe annihilated each other in a future war. This left the Earth defenseless before the space conqueror Brainiac. The only survivor of this war, Lex Luthor, claims he came back to the present to prevent this catastrophe. He created nano-robots that grant superhuman powers and released them on Earth to create new metahumans. As a result, thousands of people develop extraordinary abilities and become superheroes or supervillains. One of this people is the player's character.\n\n###Character creation\nBefore entering the game, the player has to create his or her original, fully customizable DC character. The player can define the character's gender, looks, personality, powers, and other attributes, or to use pre-loaded templates. You also have to choose your side and decide if you're a hero or a villain. \n\n###Gameplay\nThe newly created character enters the DC Universe and immediately has to fight for his or her freedom as part of a tutorial mission. The player shares the world with thousands of other metahumans as well as AI-controlled famous heroes and villains from the DC Comics canon. All of them are involved in constant battles between good and bad. To become a member of Justice League or Secret Society of Super Villains, the character has to gain experience, complete quests and master his or her powers.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Daybreak Games Company","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":23323,"name":"BATTLETECH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fe7/fe774427b11e2a808a1aacf1a32213ed.jpg","description":"From original BattleTech/MechWarrior creator Jordan Weisman and the developers of the award-winning Shadowrun Returns series comes the next-generation of turn-based tactical ‘Mech combat.\n\nThe year is 3025 and the galaxy is trapped in a cycle of perpetual war, fought by noble houses with enormous, mechanized combat vehicles called BattleMechs. Take command of your own mercenary outfit of `Mechs and the MechWarriors that pilot them, struggling to stay afloat as you find yourself drawn into a brutal interstellar civil war. Upgrade your starfaring base of operations, negotiate mercenary contracts with feudal lords, repair and maintain your stable of aging BattleMechs, and execute devastating combat tactics to defeat your enemies on the battlefield.\n\n## Game features:\n\n* COMMAND A SQUAD OF `MECHS IN TURN-BASED COMBAT: Deploy over 30 BattleMechs in a wide variety of combinations. Use terrain, positioning, weapon selection and special abilities to outmaneuver and outplay your opponents.\n* MANAGE YOUR MERCENARY COMPANY: Recruit, customize, and develop unique MechWarriors. Improve and customize your dropship. Oversee your team of technicians, engineers, and support personnel.\n* TAKE PART IN A DESPERATE CIVIL WAR: Immerse yourself in the story of a violently deposed ruler, waging a brutal war to take back her throne with the support of your ragtag mercenary company… should you choose to provide it.\n* CUSTOMIZE YOUR `MECHS: Use your MechLab to maintain and upgrade your units, replacing damaged weapon systems with battlefield salvage taken from fallen foes.\n* FIGHT YOUR WAY ACROSS THE PERIPHERY: As a Mercenary, travel a wide stretch of space, taking all kinds of missions and managing your reputation with a variety of noble houses and local factions.\n* PVP MULTIPLAYER & SKIRMISH MODE: Customize a Lance of ‘Mechs and MechWarriors to go head-to-head with your friends, compete against match-made opponents online, or jump into single-player skirmish mode to test your strategies against the AI.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Harebrained Schemes","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":5653,"name":"Singularity","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/702/7020d1319d09e0c6a840aa08c5ce120f.jpg","description":"Singularity is a shooter game developed by Raven Software. \n\n###Plot \nThe protagonist is Captain Nathaniel Renko, a part of a U.S. Recon Marines group. The action starts from an uninhabited island called Katorga-12.\nAn electromagnetic surge from the island hits an American satellite, and the unit goes there to investigate the place. Another surge damages the crew’s helicopter; Nathaniel is the only person who stays alive. He fades out to find himself in the past. At this point, the plot twists; every event in the past has an impact on the present. Back in 1955, Nathaniel meets Nikolai Demichev, a Soviet scientist working at Katorga-12. Further on, Renko and Demichev run against each other during the whole story; their interactions are at the core of the game. \n\n###Gameplay \nSingularity is the first-person shooter; the player performs the protagonist's actions. The main gameplay device is not a weapon, but an artifact called the Time Manipulation Device. Using that, the player can move the protagonists and objects around back and forth in time. At some point the player has to make choices; they affect the game result. The game also has multiplayer modes; the player can perform either as a soldier or as a creature, one of the individuals inhabiting Katorga-12. \n\n###Key features \nThe game’s concept is based on the Cold War era. Some features are inspired by exploration of military bases back in the 20th century and by sci-fi movies.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":4475,"name":"Uncharted: Golden Abyss","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b7f/b7ffc4c4776e61eca19d36d3c227f89a.jpg","description":"Golden Abyss is the fourth game in the Uncharted franchise, although it’s a spin-off rather than a part of the main series. It serves as a prequel to Uncharted 3: Drake's Deception. The player controls the series’ main protagonist, the adventurer Nathan Drake. In Golden Abyss, Drake arrives at an archeological dig site in Panama alongside fellow treasure hunters Marisa Chase and Jason Dante. Before they investigate the artifacts they found, Dante betrays his partners to a mercenary leader Roberto Guerro. The villains believe that the findings can lead to Quivira, a secret city of gold. Nathan and Marisa have to escape captivity and save the artifacts from the enemy.\nGolden Abyss became the first Uncharted game released for a portable console, PS Vita, and it uses the console’s touch screen as part of the controls. Otherwise, the gameplay didn’t change much since the original Uncharted. It combines intricate platforming and acrobatics with the elements of a third-person shooter and puzzle-solving. One of the few features the game introduces is that Drake can use his journal and photo camera to search for clues to the puzzles and identify locations. Golden Abyss has no multiplayer options.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Bend Studio","platforms":[{"id":0,"name":"PS Vita"}]},{"id":45730,"name":"Phantom Doctrine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a17/a176da07b6d4597b9ad950c559292092.jpg","description":"Set in 1983 during the Cold War, Phantom Doctrine is an alternate history thriller in which players lead The Cabal, a secret organization dedicated to fighting a global conspiracy committed to controlling the world by pitting world leaders and nations against one another.\nThroughout secret missions, classified files investigations and enemy agent interrogations, peel off layers upon layers of a sinister plot and save the world from a somber future. If you can.Features\nA rich alternate history plot anchored by historical events and characters, bringing the chillingly relevant Cold War reality to life from a unique point of view.\nNext-generation turn-based combat: Unprecedented flexibility of movement and actions, variable overwatch modes and assault-oriented Breaching ability\nExpanded battlefield: position assets around the world and call for assistance in the middle of battle when you need it most. Just remember, the enemy can bring their own reinforcements, heavy weapons or even air support and their toy box is much bigger than yours.\nKnowing is half the battle: scout mission locations ahead of time, infiltrate with undercover operatives and improve your odds. Elite enemy agents with their own agenda are always ready to spring their own ambushes.\nGo loud or go home (stealthily): fully-fledged stealth gameplay with silenced weapons, silent takedowns and cutting-edge Cold War era security technology. All this makes completing entire operations clandestinely a viable option.\nRun your own counterintelligence organization: recruit subjects of top secret government experiments, operatives of the world’s secret services, KGB & CIA included, or even criminals. Manage a global operation, securing weapons, resources and contacts. Command from a distance or go hands-on to fight for the real stakes.\nActively pursue the truth: research cases, locations and individuals in Investigation Board gameplay mechanics to uncover new missions, resources and technologies.\nEmploy technology ruthlessly to your advantage: learn from the enemy or research your own methods for brainwashing, interrogation, body engineering and chemical enhancement.\nCustomize your operatives and then do it again once they need a new identity: forge documents, change appearance, retrain them for lethal effect and send them back into the fray.\nReplayable, modular campaign with an array of mechanics to ensure unique and markedly different playthroughs: generated character names and backgrounds, modular and algorithmically populated maps, randomized intelligence snippets.\nA highly replayable, story-driven campaign with meticulously designed and adaptable maps.\nTwo stories to choose from: a KGB counterintelligence operative or a CIA wet work commando who have to come to grips with the truth and challenge the conspiracy, with an additional New Game Plus protagonist.\nNo mission too big, no mission too small: enter a bustling government facility undercover to assassinate a target with surgical precision or mount a heavy frontal assault on an enemy staging base. With optional objectives closely linked to a mission’s complexity and opportunities like loot and intelligence to collect, there are decisions to be made at each step.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"CreativeForge Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17742,"name":"Transformice","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/092/0922422089a8962bba5fb3b35d402714.jpg","description":"Transformice is an indie multiplayer platformer developed by Mélanie Christin and Jean-Baptiste Le Marchand.\n\n###Gameplay\nThe gameplay revolves around guiding the player controlled mouse around several obstacles, getting the cheese, and going back to the hole. If the player gets the cheese first, it will be noted in their profile under a special tab.\n\nA shaman mouse accompanies the players on every level. It can create physical objects to help the players get to the cheese. A player with the highest score is chosen a shaman.\n\n###Map editor\nOn August, 22nd 2010 a map editor was released. Any registered member can create their own maps and publish it for 40 in-game cheese pieces (it used to be 20). It is also required for the players to have 1000 pieces gathered on their account. During a game, each third map is community-made. After the time expires, a voting window appears, where the players can share their opinion on the map. If the map's rating gets lower than 50%, it gets removed from the game. \n\nMap categories were later added to the game. \n\n###Emotes\nThe players can use nine animated emotes: dance, laugh, cry, kiss, anger, applause, sleep, facepalm, and sit. These animations do not require the participation of another user.\n\nApart from that, there are four two-player emotes: high five, hug, kiss, or \"rock, paper, scissors!\"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Atelier 801","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":564757,"name":"Sifu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a9/3a9ea2db24f879e61fe7b824f5888d2a.jpg","description":"Is one life enough to have Kung Fu?\r\nIn Sifu, you play a young Kung-Fu student on a path of vengeance.\r\nRunning after shadows from his past, one against all, he will have to draw deep into his unique mastery of Pak-Mei Kung-Fu to prevail.\r\nOn the path of vengeance:\r\nThe hunt for your enemies will take you through the hidden corners of the city, from the gang-ridden suburbs to the cold hallways of the corporate towers. You have got one day, and countless enemies on your way. Time will be the price to pay.\r\nAdaptation is the way:\r\nCareful positioning and clever use of the environment to your advantage are key to your survival. Use everything at your disposal: throwable objects, makeshift weapons, windows and ledges... The odds are stacked against you, and you will be offered no mercy.\r\nTraining never ends:\r\nKung Fu is a path for the body and the mind. Learn from your errors, unlock unique skills, and find the strength within yourself to master the devastating techniques of Pak-Mei Kung-Fu.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sloclap","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":25097,"name":"The Legend of Zelda: Ocarina of Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a0/3a0c8e9ed3a711c542218831b893a0fa.jpg","description":"As a young boy, Link is tricked by Ganondorf, the King of the Gerudo Thieves. The evil human uses Link to gain access to the Sacred Realm, where he places his tainted hands on Triforce and transforms the beautiful Hyrulean landscape into a barren wasteland. Link is determined to fix the problems he helped to create, so with the help of Rauru he travels through time gathering the powers of the Seven Sages.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 64"}]},{"id":17636,"name":"Bio Menace","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4b/c4b46dbe5ef63e9e884cb4aaaa42bc0b.jpg","description":"Intelligence reports indicate that a man calling himself Dr. Mangle is responsible for the mutants and the destruction of Metro. You will have to battle your way through levels packed with evil mutants and robotic guards to finally infiltrate Mangle's fortress and defeat him. You think to yourself that this will be the most dangerous mission of your life.\nSnake Logan is a weapons expert, and uses several throughout the game, including a high-powered machine gun and grenades.Features\nGroundbreaking: Developed using a game engine developed by Id Software, designers of Quake.\nA Delight to Fight: Fantastically-animated creatures to kill, menacing robotic enemies to outwit and big boss creatures to battle!\nNukem 'n' Dukem: Non-stop, Duke Nukem-style, kick-'em-in-the-butt, shoot-everything action!\nSecret Weapon: An arsenal weapons at your disposal - plus four secret weapons and maneuvers.\nSave Your City: Three skill levels, joystick support, game saves, hidden areas and more.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"id Software","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":50566,"name":"Halo 3: ODST","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8a/f8ac43db218f2c4396fa811a050591d7.jpg","description":"Halo 3: ODST is a spin-off of the Halo series of futuristic shooters.\r\n\r\n###Plot\r\nThe game is set in the distant future when the humanity is at war with an alien empire, the Covenant. Unlike most Halo games, ODST doesn't feature the series' trademark protagonist Master Chief. In this installment, the main characters are the Orbital Drop Shock Troopers (the titular ODST). They do not possess the Master Chief's superhuman strength and power armor. \r\n\r\nIn the Campaign mode, the main protagonist is Rookie who only recently joined ODST. The characters are voiced by the actors of Firefly and Battlestar Galactica fame, such as Nathan Fillion, Alan Tudyk, and Tricia Helfer. At the beginning of the game, ODST soldiers prepare to defend the city of New Mombasa from a Covenant battleship.\r\n\r\n###Gameplay\r\nODST features an open world designed as a futuristic version of Mombasa, a city in Kenya. ODST do not have Spartans' abilities and equipment, they are weaker, slower and lack the deflector shields to protect them. Instead, Halo 3: ODST introduces the stamina meter that decreases when the character is hit and then slowly regenerates. When stamina meter reaches zero, the protagonist will lose health which does not regenerate.\r\n\r\n###Multiplayer\r\nODST includes Halo 3 multiplayer modes and maps. The game introduces three more maps, a map editor and a new cooperative mode called Firefight. The campaign mode also allows up to four players to cooperate and take the roles of the other ODST soldiers.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bungie","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":2446,"name":"The Incredible Adventures of Van Helsing II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/333/333e7121b588929dcf08eb99aff39ce5.jpg","description":"The Incredible Adventures of Van Helsing II is an action-RPG game, a second installment in the series set in a fictional universe.\n\n###Plot and setting\nThe game’s story picks up after its predecessor, continuing the legacy of a legendary vampire hunter’s son set out on different quests, with the ultimate goal of protecting humankind from various monsters. As well as the first game, Van Helsing II is based on different gothic fantasy tales, with elements from Stoker’s Dracula as the main source of influence. However, despite the grim setting, the series offers comic relief elements through dialogues, NPCs and many more references.\n\n###Gameplay\nRegarding game mechanics, The Incredible Adventures of Van Helsing follow the steps of the genre’s progenitor, Diablo, with hordes of enemies to combat with, various classes for the main character, large, and different loot. The new elements in the second part of the series are various interactions with the rebels, where the protagonist can train and assemble task teams and send them out on different side quests. \n\n###Graphical elements and other features\nThe game engine is shared between both installments of the series; however, the second game brings out smoothened textures, corners, and almost every detail, making slight improvements while staying true to the steampunk setting and overall tone. The game also offers a cooperative multiplayer campaign, and a competitive multiplayer mode, where up to 8 players can engage in PvP battles.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2409,"name":"Fearless Fantasy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb7/bb7056d822cacc5f4107b727608d47eb.jpeg","description":"As Leon, the world’s most dangerous bounty hunter, you embark on a mission to slay the world’s weirdest creatures, and save a girl from an awful marriage.\nFearless Fantasy is probably the weirdest RPG you’ll play this year. It’s a turn-based game that deeply involves players during every turn. You use gestures (with the mouse) to score critical hits, resulting in very involved and interesting gameplay on every turn.\nUse gestures to score critical hits in a turn-based RPG\nMost original character designs you’ll see this year\nA full-on story with animated cutscenes and voice-overs\nUpgrades and progression systems\nBoss fights\nRPG stuff and dances!About the developers\ntinyBuild GAMES Partnered up with Enter Skies to bring Fearless Fantasy to life. tinyBuild is an indie-friendly publisher and game developer. This is Enter Skies' first commercial game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"tinyBuild","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":2568,"name":"A Virus Named TOM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35f/35f953424c1aada018490265f76e934d.jpg","description":"A Virus Named TOM is an indie puzzle strategy game developed by Misfits Attic.\n\nIn a utopic world, a scientist gets fired by a giant corporation. He creates a virus and names it TOM. The only purpose of it is to get revenge. \n\nThe game features 50 single-player levels in 6 different areas. With every completed level, the player disrupts one of the systems of the device that was infected with TOM. Each area represents one device which is used by humans in a utopian world. 50 more are available for cooperative play. The players objective is to connect all the nodes creating connection paths for them while avoiding the anti-virus drones present in the game. Sometimes, the player has to correctly turn the nodes in order to establish a connection. The enemies move in a repetitive pattern of traveling back and forth. While easily avoidable alone, the game gets harder and harder as the number of enemies increases.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Misfits Attic","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":54285,"name":"Mortal Kombat","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e9a/e9a782a3f40f0e53ab64c7018251053e.jpg","description":"Mortal Kombat is a fighting game focused on one-on-one matches known for its gore elements. It’s the first title in the series that consists of multiple sequels and spin-offs. The plot follows Liu Kang, a monk who needs to defeat evil mage Shang Tsung and save the world. To do so, he takes part in the deadly tournament called Mortal Kombat and has to fight every participant over to get to Shang Tsung and his monstrous ally Goro.\nThere are seven playable characters in Mortal Kombat, however, unlike in other fighting games, each of them has almost the same stats with a small difference in abilities. The core feature of the game is its unique control scheme that includes not only using buttons but also moving a joystick in eight directions. Every character has a set of attacks which can be performed by tapping a combination of buttons and the joystick's moves. The most-known element of the fight is so-called Fatality that allows brutally finishing the defeated opponent.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Midway Games","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Game Boy"},{"id":0,"name":"PC"},{"id":0,"name":"Genesis"}]},{"id":15234,"name":"Hello Neighbor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1e/d1e9fa31912b1b168adeef6ddb3875d0.jpg","description":"Hello Neighbor is a stealth horror game about sneaking into your neighbor's house to figure out what horrible secrets he's hiding in the basement. You play against an advanced AI that learns from your every move. Really enjoying climbing through that backyard window? Expect a bear trap there. Sneaking through the front door? There'll be cameras there soon. Trying to escape? The Neighbor will find a shortcut and catch you.\r\nSuspenseful horror gameplay (not jump scares) that focuses on sneaking around your neighbor's house\r\nConstantly evolving experience where the Neighbor's AI counters your moves, and learns from what you do\r\nSandbox-style gameplay with plenty of environmental interaction and physics.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"tinyBuild","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":3304,"name":"Skulls of the Shogun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a06/a06ad4fb44d5031dcfa262ffc1759b47.jpg","description":"Skulls of the Shogun is a turn-based tactical strategy game, set in the fantasy of late medieval Japan. The story of the game focuses on the tale of a dead general, once destined to become the new Shogun but viciously interrupted by a stealthy foe. As he meets his demise, man learns that while not exactly he is capable of returning to life, but instead, he can set out on the way to becoming the new Shogun of the Dead.\nThe game features a set of missions, where the player has to control a small army and defeat their enemy, sometimes far outnumbering. Various tactics can be employed to achieve victory, and the clever use of each unit and their abilities often leads to a swift and fruitful conquest. Each map can be replayed, as different outcomes under different circumstances give new bonuses for the further playthrough.\nThe graphics of the game are hand-drawn, styled like a comic book, where every character looks formidable, but at the same time, hilarious. The strange humor of the game includes several gags about the Japanese culture, history, and mythology, and the dialogues between the characters do not leave any player dissatisfied.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"17-BIT","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17507,"name":"Guardians of Middle-earth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fc/1fca7d5fd11e43295577eeaf02d0b3f9.jpg","description":"If DotA was set in John R. R. Tolkien's fantasy universe, it would have been Guardians of Middle-Earth. This multiplayer-oriented game unites players in teams of up to five to battle against each other on an arena, or to fight an AI-controlled team of the same size.\nThe game offers more than 30 playable characters, mostly from The Lord of the Rings and The Hobbit, including Bilbo, Sauron, Legolas, Gandalf, and Gollum. Their design is based on Peter Jackson's movie series. There are also several characters that don't appear directly in movies or books, such as Arathorn, father of Aragorn. All characters are divided into \"good\" and \"evil\" factions to preserve a semblance of continuity behind the battles, so that Kili wouldn't have to fight Thorin, for example. Treacherous Saruman can join either side.\nThe goal of each team is to destroy the enemy base that is protected not only by the opposing players but also by defense towers. Gameplay in Guardians of Middle-Earth has a distinct \"RTS\" feel to it. Both teams’ bases regularly spawn “minions” who join players in the fight, making the game more about clashes of armies than duels between individual champions. The RPG element is minimal, and there are no in-game items or upgrades.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Monolith Productions","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":227,"name":"LEGO Worlds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c9/1c9c69f0edb8c4f45e3fa6958fb8d40a.jpg","description":"EXPLORE. DISCOVER. CREATE. TOGETHER. LEGO® Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain ranges and dot your world with tropical islands.  Drop in prefabricated structures to build and customize any world to your liking.  Explore using helicopters, dragons, motorbikes or even gorillas and unlock treasures that enhance your gameplay.  Watch your creations come to life through characters and creatures that interact with you and each other in unexpected ways.  In LEGO Worlds, anything is possible!\nhttp://www.warnerbros.com/privacy/policy.html","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":4298,"name":"Papo & Yo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18b/18b47446f242904662beb3c6efe6b33d.jpg","description":"Papo & Yo is an adventure puzzle with a platforming focus. Indie studio Minority Media developed the game. After the development of Papo & Yo studio has concentrated on developing VR games. It is the only installment in the IP.\nThe plot revolves around the boy called Quico who is living in the Brazilian suburbs, and his father addicted to alcohol. As told by Vander Caballero — lead game designer, the game represents his experience with his alcoholic father. The ability to open tears to another dimension is like this a particular kind of representing escapism. \nThe game features platforming sections, and the ability to turn the real world into the magical one is introduced: tools brought out from the latter may aid the protagonist in their quest. The whole magical setting is very much like going into another dimension for the stuff needed. The Monster is also a crucial part of the gameplay — he helps Quico to hop around the gaps. The behemoth can also turn berserk: if he eats too many frogs, he starts crushing everything on its way. It can be calmed down with fruits.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Minority","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]