[{"id":19614,"name":"Hunted: The Demon’s Forge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/860/860171b6bd79446299832e53c15e6888.jpg","description":"Powered by the Unreal 3 engine, Hunted: The Demon’s Forge™ is a fresh take on the classic fantasy game that delivers the intensity and action of a modern-day shooter. Taking control of either E’lara, a ranged weapon expert, or Caddoc, a master swordsman, you and your partner will descend into a dark and foreboding world for an unforgettable cooperative experience. As you travel deep within the world of Kala Moor, you will use a variety of deadly weapons, powerful spells, and cover tactics to face down wave after wave of vicious enemies.  It will take the combined efforts of two great warriors to explore menacing dungeons, overgrown ruins, and downtrodden towns … and discover the secrets of the Demon’s Forge.\nKey Features:\t\t\t\t\t\t\t\t\t\t\tAn Unreal Dark Fantasy: Powered by the Unreal 3 engine, the dark world of Hunted comes to life as a third-person fantasy game with the intensity and action of a modern-day shooter.  Hunted boasts stunning visuals with breath-taking vistas and foreboding underground worlds.\nCo-op at a Distance: Combine E’lara’s ranged attacks with Caddoc’s melee expertise to pull off gruesome co-op kill moves, perform special attacks, and heal one another from anywhere on the battlefield.  The characters’ differing combat expertise allows a player’s strategy to vary from one play through to the next.\nDescend into Dungeon Depths: Work with your co-op partner to discover hidden paths and solve the devious puzzles that block your way. Explore menacing dungeons, overgrown ruins, and terrorized towns to discover treasure and powerful upgrades.\nTwo Ways to Fight: Wade into the thick of the fight using deadly melee skills, or tactically use cover to dispatch hordes of creatures with bows and spells. Use powerful magic to boost your partner’s combat effectiveness and even the odds against increasingly formidable enemies.\nForge Your Own Levels: Create and share your own challenging dungeon designs with The Crucible, a powerful in-game editor that provides endless opportunities for exploration and battles for you and your friends.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":19525,"name":"A.R.E.S.: Extinction Agenda","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1b/b1b00a57cca9ba9ac203d376c8f15b46.jpg","description":"Steam Exclusive OfferCarbon Stealth Suit: (Yellow)\nA light weight and non metal alternative to ARES traditional armor. Proves to be pleasing to the eye.\n\n\nIndigo Pulse Suit: (Blue)\nA prototype suit made of special materials discovered by United Earth which was estimated to be immune to Zytron Gas.\nAbout the GameA.R.E.S.: Extinction Agenda is the first chapter in a full featured episodic hardcore action packed side scrolling platformer, in the traditions of retro classics, where you play as Ares, a combat robot created for the sole purpose of saving humanity. Can you live up to the task or will you be reduced to nuts and bolts?\nYou are Ares, the first Zytron immune robot. A symbol of how far human technology has come, you are the most advanced robot in existence; built to run faster, jump higher, and fire quicker. In addition to these core attributes, your design includes a system for converting spare parts and resources into valuable items, armor, and weaponry. You will need to use everything at your disposal in order to reach and rescue the survivors aboard the Zytron infected space station.\nKey features:Play through various locations in the A.R.E.S. universe, each a beautiful, unique, 3D environment with challenging obstacles.\nYou are the ultimate weapon with the ultimate sidekick – Collect the secret items and get power up to become a perfect weapon.\nCome face to face with colossal opponents, learn their patterns to defeat them in battle.\nDestroy enemies, collect their parts, and then recycle them to make incredible items, including health packs, ammo, and weapon upgrades.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Extend Studio","platforms":[{"id":0,"name":"PC"}]},{"id":9549,"name":"Constructor","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ab/6ab847bbd5905849d490741b8d6b2429.jpg","description":"CRIME IS YOUR GREATEST TOOL.\nIn a town where anything goes, you can’t rise to the top without taking a few others down. From dodgy deals to shifty tricks, do what you gotta do to go from small-time slumlord to filthy rich tycoon.\nIn Constructor, you take on the role of a budding property tycoon who must do battle with your competitors to create a thriving and profitable city...in ANY way you see fit!\nDesign and share city maps with online multiplayer battles against up to 3 of your mates.\nBuild houses and factories, cope with the incessant demands of your tenants as well as keeping a whole bunch of UNDESIRABLE characters under control! This ‘colourful’ group of degenerates can also be used against the competition with humorous and catastrophic effect! If all else fails, call in the Mob…","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":57179,"name":"Sonic the Hedgehog 3 (1994)","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bb0/bb0032aa8b422968ebadb01353cdd608.jpg","description":"Sonic the Hedgehog 3 is a platform game developed and published by Sega. The fourth main game in the Sonic the Hedgehog series, it was released for the Sega Genesis worldwide in February 1994, and in Japan three months later. Following the events of Sonic the Hedgehog 2, Dr. Robotnik's spaceship, the Death Egg, crash-lands on a mysterious floating island. There, Sonic and Tails must once more retrieve the Chaos Emeralds to stop Death Egg from relaunching, while making rounds with the island's guardian, Knuckles the Echidna.\nDevelopment of the game began shortly after the release of Sonic 2 in late 1992. It was developed simultaneously with Sonic & Knuckles; they were developed as a single game until time constraints and cartridge costs forced the developers to split them in two projects. The Sonic & Knuckles cartridge features \"lock-on\" technology that allows it to be physically attached to the Sonic 3 cartridge, creating a combined game, Sonic 3 & Knuckles. A portion of the soundtrack was allegedly composed by American pop musician Michael Jackson, who left the project before completion and went uncredited.\nAs with its two predecessors, Sonic 3 was a critical and commercial success, with critics seeing it as an improvement over previous installments. It sold over one million copies in the United States; though this makes it one of the best-selling Genesis games, its predecessors, bundled with the Genesis in some regions, had sold a combined 21 million. The game has been re-released in compilations and download releases for various platforms, including Sonic Mega Collection for the GameCube and Sonic's Ultimate Genesis Collection for the PlayStation 3 and Xbox 360.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"SEGA","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Genesis"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"}]},{"id":47242,"name":"Cube Racer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8eb/8eb471a7b6d276da36a05007b52fa0d0.jpg","description":"Cube Racer is a round based multiplayer racing game with cubes. Every round, all players race against each other to the finish line. Before every round, the players get to build one or more obstacles on the map. In the next round, all players have to pass all the obstacles, which have been built yet.Features\nOnline/Local Multiplayer\nSingleplayer\nMap Editor\n262 Different obstacles\n22 Standard maps ( + Endless user created maps)\nCompetitive, fun and exciting\nController support for ingame racing\nMinimalistic, but still nice graphicsOnline/Local Multiplayer\nSo basically, the game is designed to be a fun multiplayer game. You race against your friends or other players, to finish as fast as possible and score as much points as possible. But instead of giving the winning player an advantage for the following rounds, like it is done in many other games, all players have the same conditions every round, as all players are racing on the same map, with the same obstacles.\nBesides of the racing, all players extend the map continuously, as every player can build obstacles, boosters or potential deadly objects on the end of each round. This way, the map gets more difficult or easier, but surely more interesting. It's totally ip to you!\nTo win in the end, you must collect the most points by scoring as good as possible in every round, outsmarting your opponents with your obstacles and your racing skill.\nAlso, the game comes with a dedicated server, which allows you to set up your own local or online Cube Racer Server. It's a perfect opportunity to play some rounds with your friends, or to have some fun time on a hypothetically LAN-party ;)Singleplayer\nIn Singleplayer, you can challenge yourself to race on different maps with various predefined obstacles to slam the fastest times you are capable of.Obstacles\nBy playing games either in singleplayer or multiplayer mode, you earn credits for your performance. With these credits, you can unlock new types of obstacles time by time. You can also then use the credits to upgrade the obstacles you own, to make them maybe bigger, maybe stronger and develop your personal cube-racing strategy.\nAt the beginning of a game, every player decides, which obstacles to take along into the game, which makes every online-game individual and exciting.Map Editor\nThe game also includes a map editor where you can live your creativity and make your own maps for Cube Racer. You then have the possibility, to either just play your custom maps on your own server, or to upload them to the Steam-Workshop and share your creations with the whole community.\nAccordingly, you can also browse through other players map creations to download and play your favorite ones.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Simon Blasen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14551,"name":"Grotesque Tactics: Evil Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/798/7987e4fe35f947059e077a220f0e8cd2.jpg","description":"Grotesque Tactics is a story driven, satirical RPG with a strategic combat system. A party of 10 anti-heroes are fighting in a grotesque world that combines the features and clichés of Western and Asian Strategy RPGs like Final Fantasy Tactics, Heroes of Might & Magic and Fire Emblem.\nGrotesque Tactics weaves a humorous storyline and plenty of amusing dialogue, poking fun at some of the most successful RPGs, such as Oblivion, Gothic and Lord of the Rings.\nTo protect the kingdom from the merciless cult \"The Dark Church\" which has murdered all of the kingdom’s heroes and knights, you will have to hire dubious soldiers and rescue jealous maidens who will follow you into combat as your groupies.\nFeatures\t\t\t\t\t\tTurn based tactical battles with humorous animations not seen in any RPG\nDistinctive party members such as the arrogant Holy Avatar, the blood thirsty Vampire Solitaire, the sweet but hot-tempered Angel Angelina and many more\nGorgeous village landscapes and dark, sinister dungeons\nScantily dressed maidens to be freed from the grasp of merciless monsters\nEnormous, highly detailed and very angry end bosses\nClassical RPG elements: quests, treasures, trade, leveling up and out¬fitting a party of unique heroes\nEnjoyable multiple choice dialogues and conversation puzzles in the style of classic adventure games, such as Monkey Island or Maniac Mansion\n*In chess, a Grotesque is a problem or endgame study which features a particularly unlikely initial position, especially one in which White fights with a very small force against a much larger black army. Grotesques are generally intended to be humorous.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]},{"id":11372,"name":"Sakura Agent","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1b/f1b29bc67e50fbe0dc45bd8a3eacddad.jpg","description":"Akira is an agent for a secretive organisation who protects the world from threats simply known as incursions. Strange creatures from another dimension are invading his world, wreaking havoc wherever they go. With his assistant and a freshly assigned rookie to back him up, can Akira overcome a threat which may end civilisation itself?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"}]},{"id":3862,"name":"Final Exam","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef6/ef6b04ebec5f85b374c3e740c7b2d626.jpg","description":"Jump into the frenzied action and the whacky humor of a pure 2.5D side-scroller!\nWhile they were going to their old high school for what was supposed to be the party of their life, four long-time friends end up in a ghost town full of monstrous creatures.\nAlone or in cooperative mode (4 players online and 2 in local play), survive hordes of monsters ready to skin you alive and achieve unique and varied objectives throughout huge and non-linear levels.  Choose your character, knock out high-scores and thoroughly explore each stage to gain experience and reach higher levels. Find new weapons, improve your skills, unlock new special moves and devastating powers… and achieve increasingly impressive combos to outdo your friends' high-scores.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Mighty Rocket Studio","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":484531,"name":"Blade Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/57b/57beb9f7e99306671ce02b51f79680f5.jpg","description":"After the devastating Red Stone War, the world is divided into three regions: the mutant infested outside grounds, the Undercity where people have fled to seek refuge from mutants, and the sky city Esperanza where the rich and powerful rule over the world. Fight against the corrupt military of Esperanza as part of the resistance force of the Undercity. Bring the corrupt to justice by becoming stronger and fighting alongside your trusty comrades.\nBlade Assault is a 2D action rogue-lite platformer with beautiful pixel art set in a desolate sci-fi world. The game features tight, responsive controls and a cast of charming characters. Playable characters have various transformable weapons that they use to battle against their enemies. Weapons can be further customized by different “Cores” and “Transform Upgrades” that appear randomly during gameplay.\nSatisfying fast-paced combat. Utilizing diverse skills, dodging enemy attacks by dashing, launching projectiles, slashing away mobs of enemies. Your attacks change according to the “Cores” you select and the upgrades you decide to take on your runs.\nMeet NPCs and find upgrades along your quest to unlock unique powers. Each playable character has their own weapons of choice kept in their own armory.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"TeamSuneat","platforms":[{"id":0,"name":"PC"}]},{"id":28447,"name":"Kinect Sports","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ab/0ab47649e8d84d67b501530565881775.jpg","description":"The Games on Demand version supports  English, French, Italian, German, Spanish, Potuguese, Russian, Japanese, Korean, Chinese. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". This game requires a Kinect™ Sensor.  Kinect Sports sends you, your friends and family into the stadium to bring out your potential as sporting legends. Experience all the thrills of six major events: Soccer, Bowling, Track & Field, Boxing, Beach Volleyball and Table Tennis.  No controller required - your body is all you need. From delivering a supreme serve to vaulting the final hurdle, the Kinect sensor tracks all your movements. Play solo to boost your personal best, tackle computer-controlled opponents, send challenges across the globe via Xbox LIVE or gather around the TV for lively living room competition. There's even a mascot-packed Party Play option for those times when everyone wants in on the action!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":18742,"name":"Chaser","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c34/c349876798e77012823cba62e622c274.jpg","description":"Mars, 2044. The UN establishes MARSCORP (Martian Security and Economics Committee) under the leadership of Samuel Longwood. In the years that follow, the UN gradually loses control of MARSCORP, mainly due to the non-transparent licence policy of its director. Longwood uses his autonomous status to create vassal relations between the corporations and MARSCORP. The unshakable power position of MARSCORP is supported by the companies and thus they acquire additional rights and licenses. Longwood and his consortium become extremely wealthy from this arrangement. However, dissenting voices in MARSCORP begin to challenge Samuel Longwood's authoritarian policy. They demand his dismissal as director and a complete redistribution of the mining rights.\nBut Samuel Longwood keeps an ace up his sleeve for occasions like this…\nChaser awakens on board the spaceship H.M.S. Majestic. He doesn't know who he is, what he's doing here, why he is being sought by men in black uniforms and what they will do to him when they find him…\nThe player's goal is to find out who Chaser really is and why he is being hunted. The story leads the player from the H.M.S. Majestic to Montack City on Earth, then on to Siberia and finally to Mars, where the trail ends and hopefully the truth can be found.Key features:Based on Cauldron's cloakNT engine. Boasts state of the art graphical features and is perfectly suited for rendering large environments.\nAuthentic weapons: Nearly all the weapons in the game are modelled on real-life equivalents. The developers placed a great deal of emphasis on building detailed replicas.\nEngaging storyline: In the search for his identity, Chaser becomes involved in a plot full of twists and turns.\nHighly developed A.I.\nMultiplayer support via GameSpy as well as dedicated servers.\nNumerous multiplayer modes including teamplay modes in the style of Counter-Strike and Team Fortress as well as deathmatch and capture the flag.\n","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Cauldron","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":18302,"name":"Thunder Wolves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a1/4a1d4c5ad53f21008fc447d91794f278.jpg","description":"When this “wolf pack” strikes, you hear the thunder roll. The Thunder Wolves attack from the air. They are mercenaries, and the best helicopter pilots in the world. Every one of them is ready for action at all times—and ready to fight evil, wherever it lurks.\nThe Thunder Wolves have already made it through countless battles. They are equipped to destroy their enemies—destruction is part of their business. Put yourself in the pilot’s seat of a combat helicopter and become a member of the most experienced and dangerous helicopter team in the world!\nSupport the Thunder Wolves in their global battle against terrorism. Take part in varied operations and do whatever it takes to thwart the diabolical plans of your enemies! Defeat them once and for all, and save the world!Key Features Experience furious helicopter action in this relentless, adrenaline (and lead) pumped arcade shooter!\nMake use of 9 different helicopters, as well as a large arsenal of different weapons, and let your appetite for destruction have free reign!\nMaster 13 action-packed missions in 4 different regions of the world!\nVanquish masses of enemies, fulfill varied mission objectives, and fight your way through to spectacular boss battles!\nFly together with a friend as pilot and gunner in local co-op mode!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Most Wanted Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":5484,"name":"Super Stardust HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a22/a22898199b1049569d84e6549dbcf103.jpg","description":"Super Stardust™ HD for the PlayStation®3 system is a fully updated version of the classic game Stardust. Your mission is simple: destroy everything in sight!\nWith five highly detailed 3D planets to save, hordes of enemies and asteroids to destroy, and various game play modes, Super Stardust™ HD presents super intense action.\nSuper Stardust™ HD is now available in 3D to provide the most immersive gaming experience ever, along with Simulview support in co-op, so you and a friend can view two completely different game views on the same 3D TV screen! 3D TV not required to play Super Stardust™ HD.\nSuper Stardust™ HD ©2007 Sony Computer Entertainment Europe.  Developed by Housemarque OY.  Super Stardust is a trademark of Sony Computer Entertainment Europe.\nVideo output in HD requires cables and an HD-compatible display, both sold separately.  This game supports displays ranging from standard definition to 1080p displays.\nCompatible 3D display, cables, components & PS3™ firmware 3.30 or later required.  Some people may experience discomfort (such as eye strain, eye fatigue, or nausea) while watching 3D video images or playing 3D video games on 3D televisions. SCE recommends that all viewers take regular breaks while watching 3D video, or playing 3D video games. The length and frequency of necessary breaks  may vary from person to person – please take breaks that that are long enough to allow any feelings of discomfort to subside. If symptoms persist, consult your physician.\nThe vision of young children (especially those under six years old) is still under development.  Prior to viewing 3D programs,  consult with your child’s physician (such as a pediatrician or eye doctor) before allowing young children to watch 3D video images or play 3D video games.\nPurchase or use of this item is subject to the PSN Terms of Service and this item’s use restrictions.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":13217,"name":"Ring Runner: Flight of the Sages","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/216cb94fab12f95d819928fe831bddd3.jpg","description":"Ring Runner combines the fast-paced action of space combat with the rich story and skill variety of an RPG.\nTrek across the universe in a 30 hour long story-driven campaign based on a companion Sci Fi novel, or challenge 6 scenarios alone, cooperatively, or competitively through local or online multiplayer.\nChoose from 60 customizable hulls that act as templates for 400+ wildly-varied skills. Level layouts, backgrounds, and AI enemies are all procedurally generated, yielding billions of challenges.Story\nYou awake from unelective brain surgery to find key memory centers of your brain missing. They've been replaced by Nero, your peanut-butter-craving neuro-Hud, who'll guide you through the universal super-highways known as The Rings. If you survive fiery trench runs, flail-swinging gladiators, and feuding trash moguls, you'll discover that you're a Sage, capable of rewriting the physical laws with your thoughts.\nBut beware The Extinguishers!\nIn the interests of universal order, The Consortium of the Inner Rings has slated the Sages for extinction, plunging the cosmos into a war with casualties measured in galaxies. You'll play a pivotal role in this terrible battle... if you can find out who you are.Big PictureFeatures\n400+ Unique Abilities - many inspired by fantasy games\n60 Fully Customizable Ships - five archetypes, with many hybrids to choose from\n30 Hour Story-Driven Campaign - universe based on a companion Sci Fi novel\n6 Scenarios - Play alone or coop and competitively through online multiplayer\nInfinite Challenges - The level layouts, backgrounds, and AI enemies are procedurally generated\nReliable Multiplayer - drop-in and drop-out of games with seamless host migration; no waiting in lobbies\nLocal Coop - \"Duo\" ships allow a friend to act as a copilot, usable in multiplayer modes and second half of campaign\nFull Soundtrack - 20 tracks of music and hundreds of original sound effects\nClassic Arcade Inspired Mini-games - earn Sage abilities by conquering challenges in The Subrostrum\n30 Prebuilt Ships - jump straight into the action with these handcrafted hullsScenariosChallenge these Scenarios through single or Online Multiplayer:\nSpace Defense League - League of Legends/DotA in space! Complete with cruisers, bosses, swarms of drones, and waves of power up crates\nZombie Survival - Rack up the kills before the hordes of space zombies feast on the atoms of your brains; defeat custom bosses to gain Super Sage abilities!\nWave Survival - Survive waves of procedurally generated bosses, swarmers, and standard ships\nGladiator Mode - Run a gauntlet of procedurally generated bosses\nSpire Battle - Fast-paced base vs base battles\nDeathmatch - No teams; it's every Sage for his or herselfSteam WorkshopPress Quotes\"Clearly had a little TLC put into it. The writing is solid by video game standards, the graphics are solid by indie game standards and the game’s fun by any standard.\"\n- Indiestatik\n\"At its best, it takes the very idea of a twin-stick shooter, shakes it by the collar and shrieks, 'Space is enormous and deserves more than lasers and lightshows – let us strive for the beauty and variety that the stars deserve.'\"\n- Rock, Paper, Shotgun\n\"Bites off way more than it can chew, and it’s endlessly endearing for it.\"\n- GiantBomb","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Triple.B.Titles","platforms":[{"id":0,"name":"PC"}]},{"id":4538,"name":"Ratchet & Clank: All 4 One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/96d/96d5ab690afebfc4784bb307c9339601.jpg","description":"Created exclusively for the PlayStation®3 system by Insomniac Games, Ratchet & Clank: All 4 One™ packs an explosive punch by introducing 4-player co-op to the franchise for the first time. Play together online or offline as the greatest heroes (and villain) in the Ratchet & Clank universe form the unlikeliest team in this humorous adventure blending high-powered, accessible gameplay with astounding moments and cinematic visuals.\nBuy It Today!\n© 2011 Sony Computer Entertainment America LLC. Ratchet and Clank is a trademark of Sony Computer Entertainment America LLC. Developed by Insomniac Games.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":19924,"name":"Guardians of Victoria","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b2/7b2f5a27feef314a4a5ebbbc61107bdd.jpg","description":"Guardians of Victoria is a running game with multiple twists, taking conventional running gameplay and creating something unique! Testing your reactions, planning, and timing in an action-packed multi-tasking race to the end without being caught by Jack the Ripper.\nPlay as the Guardians as they fight their way through the Steampunk city in the clouds, collecting items and defeating the allies of the ever-chasing destroyer- Jack the Ripper. You must stop him!\nThe game features:\nFree-Roaming: Unlike most running games you can actually stop, and run left!, allowing you to explore the environment a bit more. Not recommended on the hard mode!\nRacing against a chaser: To keep you moving along and fighting tooth and nail, The Ripper chases with his giant cloud of thunder.  The higher the difficulty- the faster he moves. Be wary though, as Ripper can shoot electric bolts!\nUsing mechanics: To keep you in the sky and alive and well, you must avoid gas leaks, control crane platforms, put out fires, and more!\nMulti-characters: There are three characters with their own uniquely designed levels across various locations. Brella, Cutlass, and Firearm- members of the Guardians. The leader of the Guardians, a small flying robot called Zeal, also follows the characters on their missions. Each character has their own back-story, personality, and platforming ability (such as Brella using her umbrella to glide)!\nShields-up!: Utilise the player shield by collecting the fireflies for their dust around the city. ﻿Using the shield protects you from Ripper attacks, enemy blows, fires, gas leeks, and anything else that might damage you!\nTactical fast combat: Each character has a very unique fighting style. You can test them out in the arena/tutorial area, and really be tested in the city.\nMultiple replayable levels: Platform your way across many levels including ‘The Factory’, and ‘Daylight Victoria’. Each level features 3 different difficulty star ratings and a timer system! Simply survive to the portal at the end!\nIndoor running: Forget traditional rooftop running! Run indoors too! Some floating buildings can be entered! Jump in through windows or tunnels or use and find the secrets within!\nSteam bonuses: Steam users will also collect trading cards.\nExtra levels: The game also features an arena with character selection, and a combat and platforming tutorial. I also look to addship flying levels!\nUpgrade! Conquor! Earn skillpoints through take-downs and collectables and upgrade your characters, speed, jump, attack and health! There is lots your can do.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tall Story Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17548,"name":"Solar Flux","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2f/b2fb849f8aef26228949bf30d8d5fcf4.jpg","description":"Travel across the universe and save dying suns from extinction in this unique and challenging puzzle strategy game. You are the last hope to bring salvation to a perishing universe as you collect and deliver fragments of plasma using your omni-directional ship. Solar flares, asteroids, supernovas and force fields are just some of the challenges you will face as you pilot your ship through the intense heat of the imploding stars.\nKey Features:80+ progressively challenging missions\n18 themed sectors with a variety of obstacles to overcome\n4 unique galaxies with distinctive visuals and an acclaimed ambient soundtrack\nIntuitive 3-star rating system with varying level objectives\nDistinctive gameplay that revolves around zero-gravity navigation\nChoose between mouse or controller-activated gameplay\nSupport for achievements, statistics and leaderboardsFull Controller Support","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Firebrand Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":795463,"name":"Destroy All Humans! – Clone Carnage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/085/08553ac02c3d79bba1703dd4dc967b68.jpg","description":"Pre-order Destroy All Humans! 2 - Reprobed & get Clone Carnage for free!\nPre-order now to get the standalone multiplayer-DLC \"Destroy All Humans! - Clone Carnage\" for free!\nhttps://store.steampowered.com/app/1266700/Destroy_All_Humans_2__Reprobed/\nAbout the GameWreak havoc in Clone Carnage! This standalone DLC comes with 4 modes, 6 maps, and up to 4-player multiplayer. Split-screen lets you double the damage in local 2-player multiplayer. Unleash your wild side in Rampage, Armageddon, Race, and Abduction modes!\nExperience the evil side of a classic alien invasion story\nDestroy humans using your Psi-Powers and unique weaponry, like the Anal Probe Gun\nBody snatch a pathetic human and infiltrate their fragile democracy\nObliterate their backward architecture with your flying saucerDLC featuresCompete and destruct with up to 4 human or alien lifeforms online\nCause double the destruction with the local two player multiplayer on a split-screen\nChallenge your friends and foes alike in 4 game modes over 6 different maps\nAll skins from the Destroy All Humans! Release in 2020 are included","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":650597,"name":"Crysis 2 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d1/2d1b75e2191c3c10375cac2e6d490cfa.jpg","description":"Aliens have returned to a world ravaged by climate disasters. As the invaders lay waste to New York and begin an assault that threatens the total annihilation of humankind, only you have the technology to lead the fightback. Equipped with the upgraded Nanosuit 2.0, customize your suit and weapons in real-time and unlock powerful abilities in the battle for humanity's survival.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Crytek","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":514900,"name":"BloodRayne 2: Terminal Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61e/61e3d39225c5761eb51cf035a508a91b.jpg","description":"Enhanced and updated for modern systems by the game's original developers, this is the definitive edition of BloodRayne 2.\nBloodRayne is a dhampir, born from the unnatural union of vampire and human. Blessed with the powers of a vampire but cursed with the unquenchable thirst for blood and a weakness to sunlight, Rayne is challenged with her most personal battle yet as she hunts down her siblings. They have banded together and pledged to carry on their father's legacy of creating a new era of vampire supremacy where humans are mere cattle.\nWith new acrobatic movements and rail sliding, fast-paced blade and gun combat, fatal finishing moves, more dhampir powers like time control, and an extensive combo system, BloodRayne 2 is a brutally satisfying continuation of the iconic series.\nFeatures and enhancements of the Terminal Cut edition, created by the game’s original development team:\nSupport for higher display resolutions (up to 4K / 3840x2160).\nUpscaled cinematic videos\nSupport for modern gamepads (XInput)\nImproved rendering with up to 4x anti-aliasing\nImproved lighting with higher resolution light maps\nSupport for higher texture resolutions, allowing for use of uncompressed original textures\nImprovements to visual effects and reflections","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Terminal Reality","platforms":[{"id":0,"name":"PC"}]},{"id":283985,"name":"Resident Evil 2 (1-Shot Demo)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/99e/99e8c13a3d91d0f6fb118ccd1548daee.jpg","description":"Pre-purchase Now Available\nAbout the GameThis specially tuned demo allows you to experience the newly reimagined Resident Evil 2, but be warned: whilst you can continue as many times as you like after dying, you'll only have 30 MINUTES to complete the demo. Take in the horror atmosphere at your own pace, or make a desperate dash to solve all the puzzles Raccoon Police Department has to offer? The choice is yours!\nOriginally released in 1998, Resident Evil 2, one of the most iconic games of all time, returns completely reimagined for next-gen consoles.\n- Play individual campaigns for both Leon Kennedy and Claire Redfield using an all new 3rd person view\n- Explore the zombie infested areas of Raccoon City, now stunningly re-built using Capcom’s proprietary RE Engine.\n- New puzzles, storylines and areas\nNote: This demo is available until 1/31/2019. You must be signed in and have an active internet connection to play.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":61767,"name":"SimpleRockets 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63a/63accb741bbb342c2564a9938db2ae26.jpg","description":"SimpleRockets 2 is a fully 3D space sim that lets you build rockets, airplanes, rovers, or anything you can imagine and explore highly detailed 3D planets. Upload your crafts and sandboxes and share them with the community to earn points. Join us as we enter Early Access and continue adding new features, such as the Planet Builder and Campaign Mode.BUILD\nBuild crafts by snapping parts together. Stretch and shape fuel tanks with easy-to-use tools that help you create exactly what you want. Choose from the available engines, such as the Mage, which is a powerful kerosene-fueled engine. Or choose the very weak, but highly efficient Ion Engine. Or you can choose both. It's your craft! Nothing will stop you. Use interstages to split your craft into multiple stages to reach incredible altitudes. Piece together modular fairings to protect your precious cargo.SANDBOX\nLaunch multiple crafts into orbit at once. You can dock with your existing crafts to build space stations, moon bases, refueling stations, etc. Take photos of your journey across the solar system with the built-in Photo Library tool.SHARING\nDownload from a huge collection of user-uploaded crafts and sandboxes. Upload your own crafts and sandboxes and share them with the community. Rise through the ranks from a white level builder to a gold level builder.ROCKET SCIENCE\nKepler wrote the equations 400 years ago, and SimpleRockets 2 uses those equations to model extremely realistic orbital physics. Players will learn about rocket science and astrodynamics while they are having a blast exploring the solar system.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Jundroo","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18626,"name":"Caesar 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/907/90723cba269abb1056ffe7c8249c8205.jpg","description":"Hail Governor, your city awaits.\nAs a provincial governor charged with spreading the glory of Rome our mission is clear: build cities, foster trade and industry, make money. How you accomplish this is entirely up to you. Gain wealth and power, make a career out of pleasing the emperor, battle Barbarians and repel invaders or concentrate on building the next Eternal City. Fail and you’ll end up as lunch for the lions. Prove your strength of mind and spirit and you just may be crowned Caesar!\nBuild rule and defend on one screen -  a truly intuitive, helpful interface lets you jump right in and start building.\nCitizens give you a glimpse into the life of the common man – talk to them for clues about how to improve your city.\nVarious new structures and challenges arise throughout your Governor’s career, for tremendous depth of play and replayability.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Impressions Games","platforms":[{"id":0,"name":"PC"}]},{"id":17025,"name":"The Way","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d81/d81ac7c838602fc5d65d529462fd1afe.jpg","description":"Journey to another planet and discover its secrets in order to bring your loved one back to life. Experience an adventure, inspired by old school classics like Another World (A.K.A. Out of This World), Heart of Darkness and Flashback.\nThe Way tells a story about a member of space explorers team, who lost his beloved one and cannot accept her death. Finding ancient writings on eternal existence during one of his last expeditions makes him come back there in search of the meaning of life itself.\nHe will soon know that the planet has its own secrets and problems that he will need to face in order to get what he is looking for.Game Features:Immersing sci-fi story\nMind-bending puzzles\nUnique alien planet to explore\nRetro style rich with animations\nInspired by Éric Chahi's masterpieces","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Puzzling Dream","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14002,"name":"Tom Clancy's Ghost Recon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f4/1f42d0fe54c0d983e9940e16ded17a20.jpg","description":"Eastern Europe, 2008. War has broken out on the borders of Russia and the fate of the world hangs in the balance. That's when the call goes out for the Ghostsan elite handful of specially trained Green Berets, armed with the latest technology and trained to use the deadliest weapons. Their mission: Spearhead the way for a NATO peacekeeping force, and keep the lid on the conflict before it mushrooms... literally.\nAll the realism, sweat, and fear from the Game of The Year: Award-winning tension and deadly realism on tomorrow's battlefields.\nMultiplayer: Online or LAN multiplayer with up to 36 players.\nWeapons: Standard and special-issue weapons like the M16A2, the M4 carbine, and the fearsome and deadly OICW.\nGameplay: The total combat experience that teaches a deadly, realistic lesson in how to fight on tomorrow's battlefields.\nIncludes: 23 single-player missions, 11 multiplayer maps, and six multiplayer modes.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Red Storm","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 2"}]},{"id":949,"name":"Cut the Rope","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/242/242011264968168c61e4efc71059f2ed.jpg","description":"A mysterious package has arrived, and the little monster inside has only one request… CANDY! Use your mouse to cut the ropes and release delicious bundles of candy into Om Nom's mouth. As you keep your new companion's sweet tooth satisfied, be sure to collect shiny gold stars to unlock new levels. Play through a range of different box types – Cardboard, Fabric, Gift Box, Toy Box, and others – each with interesting new gameplay mechanics to keep you coming back for more. Join millions of others who have enjoyed the fun, casual gameplay of this critically acclaimed physics-based puzzle.\nKey Features:\n275 levels, 11 level boxes. New game elements in each level box.\nInnovative gameplay mechanics\nRealistic physics\nCute character\nOutstanding graphics","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"ZeptoLab","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DSi"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":18112,"name":"Kingdom Wars","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/633/633f3ad798922e8c288f608866cbf01f.jpg","description":"Kingdom Wars is a free to play 3D MMORTS with real-time siege combat, without the pay to win element so common in the genre.  Having evolved from Dawn of Fantasy: Kingdom Wars this strategy game offers lively online world, where players gather resources, construct majestic towns, and impregnable strongholds, direct citizens, complete quests in the service of mighty nobles and fiendish rogues, and eventually manage a global empire. All within an online realm that grows, works, lives, and breathes even when you log off. All this in glorious 3d world with stunning level of detail and epic scale - with vibrant towns and thousand strong armies. And of-course let’s not forget the glorious siege battles all in real-time! Developed by Reverie World Studios, Kingdom Wars is the result of several years of hard work by a new Toronto based studio, with members all over the world.FeaturesInnovative MMORTS Approach\nWage war with neighboring regions or complete countless hours of quests as you unveil the dark secrets of Terria while managing a persistent kingdom and economy with thousands of other players. Socialize, trade, forge alliances and - best of all - battle against other players across the world, defeat their armies, and burn their towns!Not Pay to Win\nWith Kingdom Wars free to play release our goal was to create a game of skill, not bigger wallets. We have followed player suggestions and tried to avoid the common pay2win traps. In Kingdom Wars majority of micro-transaction only effect cosmetic changes or unlock bonus content, that does not effect game progress and player interaction. All the other options are limited to one time use, to prevent anyone gaining unfair advantage.Multiple Games Modes\nTwo additional singleplayer modes - including open-ended Campaign mode, and content-packed single-player Skirmish mode with both Lay Siege and Castle Defense maps - guaranteed to satisfy players of various tastes and gameplay styles.Stunning Siege Combat\nUser-friendly Siege-oriented gameplay adds a whole new dimension to the battlefield as you ram the enemy gate, scale the walls, and place automated defensive systems, such as: stone tippers, boiling oil, and wall-mounted catapults.Three Distinct Races & Styles of Gameplay\nKingdom Wars features three distinct civilizations: Elves, Orcs and Men, presenting a unique approach to these iconic races with three distinct styles of gameplay. Each race is complete with its own lore, language, world region and terrain, dozens of distinct units and buildings, hundreds of unique technologies, and each even has a different approach to economy and building style.Fully 3D Dynamic World Map\nTravel the MMORTS world using a beautifully-designed 3D World Map featuring scale replicas of all the NPC strongholds, quest areas, and the player's homeland.Original Base Building Approach\nEach player’s Stronghold features hundreds of buildings that look and behave like a City-Simulation game, but without any micro-management, giving the player more time to spend on the battlefield. In addition each race offers a different approach to building strongholds.Complex Economic Model with Corpse Looting\nCombines the complexity of nearly a dozen gathering possibilities, different for each race, with automated simplicity, allowing players the options to micromanage their economy, or leave it to run itself in times of war.Realistic Weather and Season Change\nThe gaming world comes alive as you build and battle during winter or summer months, as you push your armies through heavy rain or snow storms. Your economy significantly changes from summer to winter, when different strategic options are available during different times of day and severe weather makes certain units useless.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Reverie World Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":566660,"name":"The Life and Suffering of Sir Brante - Chapter 1 & 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/105/1053fd999327fe4327bf779ef9607126.jpg","description":"The Life and Suffering of Sir Brante is available here\nThe free version of The Life and Suffering of Sir Brante — Chapter 1&2 chronicles the early years of Sir Brante's journey. Explore the world of the Blessed Arknian Empire and experience first-hand the cruel customs and order that govern it, then decide who you want to become: an inquisitor, a judge... or a rebel!\nThe Life and Suffering of Sir Brante is a narrative-driven RPG that comes to life on the pages of the protagonist's journal. Set in a ruthless world where any form of dissent is mercilessly crushed, the story follows a man who has dared to challenge the existing order. Set out on a lifelong journey and become an individual able to carve out their own destiny... But remember that freedom never comes cheap.\nLife in the Great Arknian Empire is harsh and its hardest Lot is yours by the circumstance of birth. You are a commoner, holding no rights and no title. To seize your fate and become the rightful heir to the legacy of the Brante family you will have to come to grips with ossified tradition and prejudice. Embarking on a life-long journey from one's birth until true death, you will have to endure great upheavals, face adversity, and make many difficult choices. Every decision will affect not only the protagonist, his family, and loved ones, but may even topple the foundation of the Empire itself.\nKey features\nAt the turn of time\nEvery imperial citizen's life is predetermined by their estate. The deities known as the Twin Gods have bestowed this truth to the world, dividing mortals into Lots. The nobles lead and rule over others, while the clergy guides people on the one true path, and the lowborn suffer, toiling away for the glory of the Empire. You may accept your fate without question, but it is also in your power to change the cosmic order that governs all.\nYour choice is not an illusion\nDivided into chapters, the game keeps track of the player's deeds, the skills they acquired, as well as other overlapping circumstances that shape a unique plotline for each playthrough. Every decision has its consequences and you will be held accountable throughout the entire journey. To protect your family and loved ones, to impose the rule of the Emperor and make a fortune, or to try and change the world as you see fit... Make your choice, but beware of the follies of pride and ambition.\nFind your own path\nThe first complete walkthrough can take you upwards of 15 hours! The unpredictable conclusion to the game's story hinges solely on your actions: the fates of your character and members of his family, their friends and rivals, as well as the outcome of the monumental events that shall determine the future of the Empire – you can decide it all!\n","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sever","platforms":[{"id":0,"name":"PC"}]},{"id":28021,"name":"Super Bomberman R","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d0/9d0c899bcf9c32aa64917a995a3b8d08.jpg","description":"Pre-Purchase OfferPre-order items\nAdditional Character \"Golden Vic Viper\"\nAdditional Characters \"8 Shiny Bomberman Brothers \"\nAbout the GameSuper Bomberman R is coming to PC!\nPlay alone or with a friend in a Story Mode jam-packed with different levels. Re-experience classic Battle Mode,\nor discover the brand new Grand Prix Mode in which team play is just as important as individual skills!\nNew characters are joining the fight. Play locally or online with friends and players from around the world!\nSuper Bomberman R is the biggest Bomberman game ever!\n■Story Mode\nA campaign playable alone or with a friend in local co-op.\nJoin the 8 Bomberman heroes and help them to defeat the Evil Emperor Buggler!\n■Battle Mode\nThe classic and fun Battle Mode is back.\nPlay with up to 8 players locally or 8 players online!\n■Grand Prix\nGrand Prix is a new competitive mode in which teamwork is key.\nWhich team will show the best skills and be crowned as the best in the Universe!?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":18144,"name":"Fortix 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a0/6a0c0e0d241e28a8e95e5292000d3244.jpg","description":"Fortix 2 is best described as a reverse turret defense game. As Sir Fortix, the knight, you must conquer castles while dodging tower turrets and evil monsters.\nFight your way across the shires of the island Artalom, storming from castle to castle. Use cunning strategy to succeed against the maze-like levels and defeat the evil mage Xitrof.\nYou are the lone Knight who must fight against the entire infested continent!\nKey Features:\t\t\t\t\t\tEntertaining and Addictive Game Play\n30 levels to master\n3 unique lands to explore\nUpcoming DLCs and monthly updates\nIndie Game Challenge finalist\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nemesys Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":321226,"name":"GRID (2019)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e4b/e4b42b75dfeaf7921946055bd6708861.jpg","description":"Take your place in the GRID World Series and fight in thrilling wheel-to-wheel battles with the most iconic and desirable race cars – current and classic, from GT through Touring and Muscle to Stock and Super Modifieds – and in some of the world’s most iconic locations. GRID captures every moment of the race, from the adrenaline rush of lights-out to the elation at the chequered flag – and in-between, it’s all action too.\r\n\r\nIncidents come one right after the other – tight overtakes, bumper-to bumper scrapes and competitive collisions – all heightened by rivalries, team-mates and a nemesis driver who will all either try to help or hinder your progress.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":290897,"name":"One Finger Death Punch 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4fe/4fe61ecd27bb128b3354453dd1a891a7.jpg","description":"DEMO LAUNCHES FEBRUARY 11\nDemo link will be activated on February 11th.\nYou're surrounded, outnumbered and have to use any weapon you can get your hands on to dismantle your opponents in a flurry of kung fu.  That's the essence of OFDP2, the world's fastest brawler.  It features the original OFDP's unique two-button mechanics which we've spent the last five years perfecting.  Speed and precision are key in this whirlwind fighting frenzy, as players maintain control over the 26 different unlockable skills, frenetic gameplay, and classic kung fu-inspired animations.ATTACK LEFT or ATTACK RIGHT\nWe want to show that a fighting game can be complex without cumbersome button combinations.  Once players complete the tutorial levels and learn the basics, they'll see that this is the most intense two-button game ever made.\nWith a 1000 different animations available, literally, anything is possible—particularly when players unlock each of the 26 available skills.  Having these skills available simultaneously is a major design challenge that encompasses the core of what OFDP2 is trying to achieve.   Seeing the game with all 26 skills is a spectacle unique to OFDP2.\nWe built this game as a palette cleanser between other games in your library.  It was designed to deliver a quick hit of adrenalin as fast as possible.\nYou can't get a feel for the gameplay from watching videos.  The flow of combat is something we spent years tweaking.  It's what makes OFDP2 unique.  Only by playing it will this become clear.  That's why it's important to us that you TRY THE DEMO out before you consider purchasing this game.EASY TO LEARN\nTHE WORLD'S FASTEST BRAWLER\nOUR ONLY GOAL WAS TO CREATE FUN\n400+ LEVELS - 26 SKILLS - 4 ENDLESS SURVIVAL TOWERS","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Silver Dollar Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":55775,"name":"Battle City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/092/09252c018cf74744c7cf8f83e283b085.jpg","description":"Battle City (バトルシティー, Batoru Shitī) is a multi-directional shooter video game for the Family Computer produced and published in 1985 by Namco. It is a successor to Namco's 1980 Tank Battalion, and would be succeeded itself by the 1991 Tank Force.\nAn arcade version for the Nintendo VS. System would follow, and the game would eventually end up with the Virtual Console release for the Wii and Wii U. There was also a related Game Boy game of the same name dating back to 1991, which was also published by Namco but developed by Nova Games.","review":"","timePlayed":0.0,"releaseYear":1985,"developer":"NAMCO","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy"}]},{"id":20759,"name":"Go Home Dinosaurs!","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d7/4d76fce4fa3d4625dfa37bc89df27b95.jpg","description":"Todd Rex wants steak. Todd Rex wants YOUR steak. Are you gonna let him take it? No way! Go Home, Dinosaurs!\nPrevent hordes of marauding Dinos from crashing your party in the world’s premier BBQ defense simulator! Unlock powerful towers that act like little weaponized puzzle pieces.  Take control of a rock-throwing, coconut-gathering gopher and build your battlefield to keep those Dinos at bay. With adorable characters, intense strategy, and mouse-only controls Go Home Dinosaurs is accessible enough for kids and challenging enough for adults. It's a game truly everyone will love!Go Home Dinosaurs Features\nHighly innovative, bar-setting tower defense gameplay A beautiful, vibrant 3D world and adorable characters 60 levels of Dino brawling action spread across three worlds! 18 collectible cards that feature a colorful cast of characters, including DJ G04, a trio of robot buddies, and aMeteor-summoning Mad Scientist! Adorable Dinos with individual traits and personalities Insane boss levels! Challenging strategic gameplay involving fitting together colorful, puzzle piece shaped defenses Carefully pick your defenses before each level Purchase costumes and powerups for your gopher with coins you earn beating levels (no IAP) Don't like steaks? Change them out in Veggie Mode!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Fire Hose Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":18798,"name":"Telltale Texas Hold ‘Em","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aac/aacc4331c7ae8563c096a9215249061c.jpg","description":"Join poker's most outspoken players for a hand of Telltale Texas Hold'em, the card game stacked high with personality. Quips will fly, chips will fall, and you may just end up rolling in the aisles.\nThis is your chance to play in a poker tournament against four characters of such lethal absurdity, you'll either die laughing or die trying. Test your skills as you answer life's toughest questions...\nCan you outsmart Harry Weinhead, the wily businessman and student of the game?\nCan you humiliate Boris Krinkle, the tough guy with a heart of pure lead?\nCan you groove with Theodore Dudebrough, slacker extraordinaire and just plain cool dude?\nCan you even understand Grandma Shaky, the eccentric old coot who may be more dangerous than she looks?Even if you've never played Texas Hold'em before, you'll learn everything you need to know, and you'll laugh learning it!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":17005,"name":"Puzzle Quest: Challenge of the Warlords","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c8/6c854d85985cccbd9c6278fd238e177a.jpg","description":"PuzzleQuest: Challenge of the Warlords delivers, for the first time ever, classic puzzle-game action backed with an epic story of good vs. evil.  Challenge your match 3 skills as you battle against computer opponents to save the Kingdom of Etheria from the evil Lord Bane.  Make matches of different crystal types which build your inventory of spells.  Outscore your oponents and unleash your spells to disrupt their matching chances and lower their totals.  Build your heroic character by winning head to head battles.  Or play classic match 3 in quick play mode.  Explore the expansive kingdom as you experience a puzzle game like nothing you have played before.\nEmbark on an epic single-player campaign comprising more than 150 challenging quests.\nJump into this exciting puzzle game and outmatch your opponent in Quick-play mode.\nBuild your empire as you capture cities, build castles and gain a party of companions that will aid you in battle.\nEarn money with each gold title to buy helms, weapons, armor and more!\nExperience tiles grant you additional experience instantly.\nMatch skull tiles to inflict damage on other players.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"D3 Publisher","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":427620,"name":"Max Payne (RU)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a70/a70f6d686a1fef938c1390a2d62821dd.jpg","description":"Макс Пэйн — человек, которому нечего терять, в темной и холодной городской ночи. Работающий под прикрытием полицейский был ложно обвинен в убийстве, и теперь его преследуют и копы, и бандиты. Макс находится в отчаянном положении, сражаясь в битве, в которой он не может надеяться на победу. Приготовьтесь к новому типу серьезных экшн-игр. Приготовьтесь к боли...","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":59688,"name":"Hiveswap Friendsim","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74f/74fb16d79f33b22a3295e8aadde77619.jpg","description":"You just crash-landed on Alternia, and you’re DESPERATE for friendship! Anyone will do...wait, who are those two trolls approaching you?\nThe Hiveswap Friendsim is a quick, loosely-canonical visual novel adventure following the efforts of the unnamed protagonist (that’s you!) to survive and maybe even thrive on the harsh surface of ALTERNIA. Set in the time of Hiveswap: Act 1, this episodic visual novel’s opening volume, written by Homestuck creator Andrew Hussie, is sure to satisfy Homestuck and Hiveswap fans who are eager for a darker stroll across the Alternian landscape.\nFuture episodes will arrive regularly as DLC.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"What Pumpkin Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28437,"name":"Banjo-Tooie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84d/84d128e39e3d57a040c1ae21607135bb.jpg","description":"The bear and bird’s second outing available in full. Loads of rollicking fun to be had here and with the legendary Stop N Swap feature reinstated. The best use of a backpack in a game ever! This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 64"}]},{"id":17039,"name":"Cognition: An Erica Reed Thriller","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c6/1c61e8b30350c14efc33a0ec5a46ccb2.jpg","description":"FBI agent Erica Reed has an uncanny talent: she can see the past and piece together how a crime unfolded. But not even this sixth sense could save her younger brother, Scott, from a brutal serial killer. Three years later, the investigation into Scott’s murder has gone cold -- but Erica’s work has only just begun.\nJump into Cognition: An Erica Reed Thriller, the exciting four-part series that brings Erica face to face with the deranged demons of her past. A serial killer is loose in Boston -- one who seems to be leaving deliberate clues that only Erica, with her unique post-cognitive abilities, can uncover. Is she finally on her way to solving Scott’s murder? Or, blinded by vengeance, is she falling into a trap that could cost Erica her life? And how does this new killer know her secret?\nWinner of six 2013 Reader’s Choice Aggie Awards, including Game of the Year, this edition of Cognition includes everything in the original game, plus brand new director commentary for all 4 episodes and exclusive content including concept art, storyboards, outtakes and other behind-the-scenes material about the development!\nDeveloped by Phoenix Online Studios (makers of the King’s Quest spin-off The Silver Lining), with contributions from veteran game designer Jane Jensen (Gabriel Knight, Gray Matter) and comic book artist Romano Molenaar (Batman, X-Men, The Darkness), Cognition is a thrilling adventure that grips you and won’t let go.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Phoenix Online Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]