[{"id":11332,"name":"The Night Cafe: A VR Tribute to Vincent Van Gogh","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/902/90249e1ae8b87bcaf994c13fe8e620c5.jpg","description":"The Night Cafe is an immersive virtual reality environment that allows you to explore the world of Vincent van Gogh first hand. Take a moment to enjoy his iconic sunflowers in 3 dimensions or walk around the chair he painted in his bedroom to see it from another angle. Step into the vivid colors straight from his palette.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Borrowed Light Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9854,"name":"Zombie Playground","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a8/7a88e53a46a4dd6f5744754d8a1c20c2.jpg","description":"\nZombie Playground™ is Goonies meets Attack the Block meets The Walking Dead. The mood we want to capture in Zombie Playground is the feeling that you had as a child when you were completely immersed in your imagination fighting monsters and doing things you thought were cool from your favorite movies, comics, and video games.\nStealth Studios Inc. has worked long and hard to create a game that delivers on the promise of our original vision. Zombie Playground™ is made with the brains, disease, and puke of all involved - that means heart! We've put everything we have into this development, and we intend to put a lot more.\nGameplay in Zombie Playground is a hybrid of third person shooter and action RPG mechanics set in a cooperative zombie survival horror arena. This translates simply to \"A fun romp solo or with friends.\"\nKey Features - What Me Worry??\nArena Style Map: Classroom Building Arena Map comprised of a Courtyard, a Main Entrance, and areas for Language Arts, Biology, Computer Science, and Music.\nMultiple Enemy Types + BOSS FIGHT! Normal, +Elite, and even a Big Bad Boss! From crouched zombies, to vicious adult zombies, to the dreaded mopper of the halls... Buckethead, the Janitor! Can you topple this giant flesh bag and live to tell the tale? (If not, try with some friends!)\n2 Playable Classes: 'Bully' is your damage dealing, tanky type class, where 'Rascal' is akin to an agility, or glass cannon, class. Both have their own stats and abilities: Bully-Bomb, Bully-Buff, Rascal-Can't Touch This, and Rascal-Speed Demon.\n2 Playable Weapon Styles: Each class has both full melee and ranged combat capabilities, complete with combos and finishers. Why sacrifice one for the other when you can have both!?\n17 Unique Weapon Choices (currently) to choose from: a variety of melee and ranged weapons. (And more in the pipeline!)\n10 Missions: Do you have what it takes to discover the source of the contagion?\nTons of Gear!: We have over 200 different aesthetic assets in the game at present, and more are coming!\nUp to 4 Player CO-OP Networking is a go! But sometimes, this function is more than 'one click' away. Should you encounter any issues, please check our forums on our main site.\nOriginal Soundtrack by the Amazing Shawn Lee made specifically for Zombie Playground. Hot!! We were lucky enough to collaborate with Shawn in order to bring some sweet funky beats, crossed with an 80's style retro feel, to Zombie Playground. Some of Shawn's other credits include Bully, Tales from the Borderlands, and Sleeping Dogs.\nKeyboard (or Controller) Breakdown: Be sure to check out the keyboard commands refresher, it will help you understand how to play the game better, complete with detailed descriptions of combos, finishers, and abilities. You can find it on our home page forums.\n","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stealth Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9748,"name":"The Wild Eternal","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd1/cd159d098752d4ba0a28be5305c6c0fe.jpg","description":"Get lost beneath the fog in The Wild Eternal, a reflective first-person exploration game.\nIt is the early 1600’s.\nYou are an old woman named Ananta who has fled a life of suffering to search for lasting peace in the Himalayan wild. After a traumatic life, you long to escape the cycle of reincarnation so that you may finally rest in peace.\nYour defiance of reincarnation has landed you in a lush, deserted wilderness covered in fog. A fox-shaped demigod agrees to help you escape your fate, but only if you’ll help him in return.\nExplore the mystical wilderness together as you embark on a meditative adventure to heal the scars of your past in hopes of avoiding an eternity of suffering.FeaturesExplore a Mystical and Mysterious World: Explore a vastly beautiful wilderness blanketed in fog as you journey from clear vistas to distant landmarks.\nFind Your Own Way: While lost in the fog, you'll find ancient artifacts and unlock powerful abilities at hidden shrines.\nInteract with Strange Wildlife: Encounter wild, and sometimes dangerous creatures, each with distinct personalities. With no means to attack them, tread mindfully on your journey.\nUncover a Tangled Narrative: Play as an old woman, Ananta, seeking to escape the cycle of reincarnation and search to uncover the truth about her past.\nImmerse yourself: Get lost beneath the fog in this 6-9 hour game designed to be a meditative hike riddled with powerful narrative and mystery.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ilsanjo","platforms":[{"id":0,"name":"PC"}]},{"id":3243,"name":"Legend of Kay Anniversary","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e5/4e516ca10bbc8cfb9649f46cc7239284.jpg","description":"10 years after its initial release, Legend of Kay - Anniversary is a thoroughly remastered version of the original game: high-resolution textures; new, more detailed character models; modern rendering techniques and crystal-clear surround sound give this great classic a new shine.\nFull of fond allusions to old martial arts films and pop culture quotes, Legend of Kay - Anniversary is both an incredibly funny game and a challenging action-adventure for young and old alike.\nKey Features:25 different levels with over 15 enemy types and epic boss battles.\n3 different primary weapons (sword/hammer/claws) with distinct combat styles.\nVarious mini-games such as wild boar racing, dragon flying and wolf riding.\nOnline rankings: compare your score with your friends’ and compete against the best in the world.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":801842,"name":"Warhammer 40,000: Rogue Trader","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/edf/edf3bd3ffa486f5d6a84bda020765839.jpg","description":"You will take on the role of a Rogue Trader, a scion of an ancient dynasty of daring privateers, that reign over their own merchant empire and explore the fringes of Imperial space with the blessing of the Emperor Himself. Thanks to their Warrant of Trade - the Rogue Trader is endowed with privileges and power beyond imagination as well as the task of expanding the borders of the Imperium. At their disposal is a gargantuan voidship of immense power and innumerable servants and personnel ready to do the bidding of their lord. Their adventures begin in the vast Koronus Expanse - a treacherous region of unexplored space at the edge of Humanity’s domain.\n\nExploration will bring the protagonist to mysterious lost and forgotten worlds as well as numerous planets claimed by humanity - from lush Agri-Worlds to steel-clad Forge Worlds, all of them ready to be claimed for your burgeoning merchant empire or plundered for their riches. While travelling between the stars, get ready to come across potential allies and dangerous enemies of the Imperium, Chaos cults and alien Xenos counting among the most treacherous and deadly.\n\nYou will make fateful decisions that affect the lives of entire worlds. You will prove your strategic and tactical skills in high-impact turn-based battles against powerful opponents.\n\nNo Rogue Trader travels alone: on this dangerous journey into the unknown, you will meet faithful and sophisticated companions. Imagine fighting alongside a mighty power armoured Space Marine, a lethal Aeldari Ranger, or even a courageous Sister of Battle armed with bolter and ardent prayer - these characters and many others will join you. Become a Rogue Trader endowed with great authority, discover new worlds and shape the future of the Imperium! Join this fantastic story!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Owlcat Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":375192,"name":"Caliber","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c19/c197c915284029ce1cb624577c28f22a.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"1C Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":288664,"name":"Bomberman Live","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/630/630fddb97af6db303f28baf7f65ff4f2.jpg","description":"Single Player, Xbox LIVE Multiplayer 2-8, Local Multiplayer 2-4, HD (High Definition), Xbox LIVE Vision. The award-winning hit Bomberman has gone live - Xbox LIVE! The full version of this classic game has eight exotic arenas where you can battle with up to eight players over Xbox LIVE! Customize your very own Bomberman with any of over 10,000 unique combinations. Unleash your fury using all your favorite power-ups to emerge victorious and prove who's best! There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":54646,"name":"Garou: Mark of the Wolves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cc/4ccee6c3e367f4dd94d19d4857dfc1c9.jpeg","description":"Garou: Mark of the Wolves (餓狼 MARK OF THE WOLVES, Garō Mark of the Wolves, \"Hungry Wolf: Mark of the Wolves\"), released as Fatal Fury: Mark of the Wolves on Dreamcast, is a 1999 fighting game produced by SNK, originally for the Neo Geo system. It is the eighth installment in the Fatal Fury series.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"DotEmu","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22962,"name":"Ether One Redux","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/938/938a22f90efb63bebcbce474e6f10822.jpg","description":"Ether One Redux is a first person adventure that deals with the fragility of the human mind.\nThere are two paths in the world you can choose from. At its core is a story exploration path free from puzzles where you can unfold the story at your own pace.\nThere is also a deeper, more adventurous path in which you can complete complex puzzles to restore life changing events of the patient's history in order to help the validation of his life.\nThe aim of the parallel paths was to make Ether One accessible to a range of skilled players. The hope was that people would be able to enjoy playing the game and solving puzzles with parents or friends, as well as immersed in the game on your own with the lights off. From a young age we enjoyed the first person puzzle games that required you to write cryptic notes on spare pieces of paper to unravel mysteries. Ether One aims to bring back pen and paper puzzle solving, whilst still being accessible and optional for people not wanting to get stuck and frustrated on the harder puzzles.Open narrative exploration in the town of Pinwheel.\nAccessible gameplay with additional controller support for players that aren’t as skilled with complex controls.\nChallenging pen and paper puzzle design that you can decrypt at your own pace.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"White Paper Games","platforms":[{"id":0,"name":"PC"}]},{"id":21656,"name":"Nethergate: Resurrection","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8db/8db400259d7c068f308f1d0b57fab8be.jpg","description":"Spiderweb Software's classic adventure of treachery and battle in ancient times has returned! Travel back to ancient Britannia for a tale of cunning foes, vicious battles, and a race to rediscover the lost secrets of magic.\nBritannia is a land ravaged by war. The natives of this land, the savage Celts, have long been subjugated by the Roman invaders. At last, they have risen up in bloody rebellion. Battles rage across the land. Cities are sacked, the inhabitants massacred. And, lost in the chaos, in the small, forgotten valley of Shadowvale, a plan is being formed.\nSoon, a band of barbarians will rediscover the lost secrets of magic. They will find a way to rid their lands of their oppressors forever. And you, as the Celtic warriors, will attempt to free your people.\nOr you, as the Romans, will attempt to crush them. For the good of the Empire.\nKey Features\nTwo different sides, the powerful Romans and the savage and cunning Celts. Each side has a completely different full-length adventure.\nEnormous game world, with dozens of dungeons and many characters and quests.\nFascinating storyline. Fight for freedom, or further the glory of the Empire.\nLost secrets of magic! Dozens of spells and hundreds of hidden magical artifacts.\nInnovative story and unique setting. Unlike any fantasy game you've ever played.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"}]},{"id":17491,"name":"Driver Booster 3 for STEAM","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55c/55ccc400749dd56c512947844a8a4839.jpg","description":"* Powerful Database\nDriver Booster 3 for STEAM adopts online database to update drivers in real time. At present, over 200,000 device drivers are included and the number continues to rise. Rare drivers and newly released drivers like Graphics Driver, Audio Driver, Network Driver, Chipset Driver, Printer Driver, etc can be detected in this beefy database to ensure that your devices match the best drivers. Thus, your hardware performance boosts and your computer reaches its optimal state.\n* Game Boost\nDriver Booster collects game-related graphic & audio drivers which are optimized specially for hot games. These driver updates can fix flickering or blurred screen and no sound or sound crackling problems to improve game fluency for better experience. At the same time, game components like PhysX, DirectX and OpenAL are also taken in to eliminate all sorts of dependency problems. Plus, without suffering from manually searching & installing components, you will concentrate more on games.\n* Easy to Use\nAs an easy-to-use driver updater, Driver Booster can automatically scan drivers and rapidly locate the outdated ones. And drivers are downloaded and installed by itself with only one click. With the function of rebooting or shutting down PC enabled, you will find drivers are updated already while you're away from the computer.\n* Smart Installation\nTo not disturb you, Driver Booster can intelligently decide to pause driver updating when you are playing games or staying in full screen. After you finish what you focused on just now, you can determine whether to continue updating.\n* Auto Download\nDriver download is a very tedious and time-consuming task. Driver Booster can automatically detect outdated drivers and download them when your system is idle to save half of the driver update time. Or you can disable this function if you think it's unnecessary.\n* Missing & Faulty Drivers Detection\nDriver Booster does not only update outdate drivers but also fix missing & faulty drivers, especially after upgrading your operating system or using your PC for long period time.\n* Simple & Safe Update\nDriver Booster only installs drivers passed WHQL by default to guarantee security of driver resource. And more technology solutions, such as System Restore, Driver Backups, Driver Roll Back and Device Uninstall features, will keep your computer safe to the hilt. Once anything unexpected happens, you can recover the previous good drivers. Moreover, the Feedback window make it easy for you to send anything to the 24/7 technical support team.\n* Others\nDriver Booster, of course, does more than above. Functions like program version auto-update, real-time detection of peripheral drivers, scheduled scanning and reminding, UI customization, network proxy support, and more are to be discovered by you.\n* About License\nThe license codes of Driver Booster 3 for STEAM are Lifetime/3PC. You pay for the program only the first time and enjoy all updates & supports within version 3.X for FREE and for lifetime on any 3 PCs.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"IObit","platforms":[{"id":0,"name":"PC"}]},{"id":16923,"name":"RACE On","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbc/cbc1735be14fbbaf3e818ecdb1eaeb9c.jpg","description":"RACE On brings you the epic WTCC 2008 season down to the smallest detail and now YOU get the chance to show the world who the real champion is.\nThe RACE On Expansion Pack includes the Iconic Detroit Muscle cars suited for those who like to lay down lots of rubber power sliding out of corners on the rev limiter. Enough torque to drag the moon off orbit, full opposite lock and a big grin on your face. Or you can try your hand at the Formula Masters, a top of the line open wheel series, offering you even more speed and action than ever before. Extreme cornering speeds and simulated g-forces make this a true driver’s car.\nBut RACE On is not just new cars, it also features brand new American tracks in SimBin quality and it comes with a hefty update of existing tracks to 2008 standard. With RACE ON comes 5 brand new tracks all recreated down to minute detail.Key Features10 unique car models in 7 different classes\n5 new tracks\nVarious real life championships including their accurate regulations\nMultiplayer, up to 25 AI or real players online\nGhost racing against your own lap time or against those of your friends","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"SimBin","platforms":[{"id":0,"name":"PC"}]},{"id":2629,"name":"Trillion: God of Destruction","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee1/ee1ef2c1aeab2766cb08056a8dc4b70a.jpg","description":"Key Features\n- A TRILLION HP! This big bad boss has 1,000,000,000,000 HP! How you defeat him is up to your individual strategy and training!\n- 6 Deadly Sins to Love! In between battles, you’ll get some quality alone time with each of your six Overlord Candidates leading your army. Can you have a love story even in war?\n- Prepare for Battle! While Trillion sleeps, it’s training time! Hit the training grounds and discover randomly-generated treasure chests or strengthen weapons at the Blacksmith’s!\n- Replay, Replay, Replay! Stats carry over with each New Game+ plus and there are multiple endings to unlock! With over 10 endings, there’s even more reason to stand up and keep fighting!\nIt’s up to you, Zeabolos, to strategically battle against this god with a trillion HP! With six Overlord candidates at your disposal, change the tide of battle through rigorous training, forging strong bonds, and making painful sacrifices, all to stop Trillion from consuming the Underworld in this groundbreaking and emotional strategy RPG!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Idea Factory","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":1158,"name":"Major Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2a/d2af35d3fca1a00ff5f06bb4521bc591.jpeg","description":"Arcade cover shooter inspired by Time Crisis, Metal Slug and 80's action heros! He's got an itchy trigger finger, some scratchy stubble, and a fondness for shooting dudes in the face. Run and gun your way through gorgeous 3D environments as you embark on a mission to rescue your kidnapped girlfriend from the Forces of Evil. Guns, grenades and an assortment of other tools of destruction are at your disposal, and you'll need every last one of 'em. So what are you waiting for, Major Mayhem? The future of the Free World -- and your love life -- hangs in the balance.Features45 levels of non-stop action\nBattle your way past hordes of enemies in three picturesque environments: Tropics, Metropolis and Desert\n100 Achievements to earn and collect!\n150 Mission objectives (mini achievements). For extended gameplay.\n20 different weapons to unleash hell with!\nHeaps of costumes and hats for the Major.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"[adult swim]","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":980664,"name":"Banana","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b95/b951f8177cf99ceb3aa2f827daa7a802.jpg","description":"About the Game\nBanana is a clicker Game, in which you click a Banana!\nFeatures:\nBananas\nAchievements\nItems","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"aaladin66","platforms":[{"id":0,"name":"PC"}]},{"id":633406,"name":"Monster Hunter Stories 2: Wings of Ruin Trial Version","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f7/4f76cce8e4136df6192e18d39cb37771.jpg","description":"Monster Hunter Stories 2: Wings of Ruin\nAbout the GameIn this demo for Monster Hunter Stories 2: Wings of Ruin, players are able to play the opening portion of the game for free. Save data from the demo can be carried over to the retail version.\nMonster Hunter Stories is an RPG that gives players a chance to explore the world of Monster Hunter as a “Rider” who develops bonds with, raises, and coexists with monsters. A brand new story of kinship begins to unfold in this second installment of the series.\nSTORY\nA world in which all traces of Rathalos have disappeared.\nThe protagonist, a direct descendant of the great Rider named Red, has a fateful encounter with a young Wyverian girl named Ena who entrusts him with a mysterious egg.\nA Rathalos with small black wings – one that closely resembles the legendary Razewing Ratha – hatches from the egg.\nThe protagonist and companions embark on a journey of hope and destruction as they seek to uncover the truth behind the abnormalities going on around them.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Capcom","platforms":[{"id":0,"name":"PC"}]},{"id":570173,"name":"Warhammer 40,000: Battlesector","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dc4/dc4d36f790226897c9962534a9f0bbaf.jpg","description":"Warhammer 40,000: Battlesector is a fast-paced turn-based strategy game set in the grimdark universe of the 41st Millenium. Pick your force, develop your army, field mighty heroes and fight for victory using superior strategy, awesome abilities, and devastating weaponry.Age of Crimson DawnExperience an epic twenty mission single-player campaign that explores the aftermath of the Devastation of Baal. Help Sergeant Carleon and his allies purge the Tyranid infestation on Baal Secundus, and preserve the honour of the noble Blood Angels.Skirmish ModeFight across the surface of Baal on maps of your choosing and select either the Blood Angels or the Tyranids in the Skirmish mode. Completely customize your army list by picking your units, heroes and their loadouts.Forge Your ArmiesCommand iconic units like the Sanguinary Priest, the Librarian Dreadnought, and the Hive Tyrant to annihilate your foes. Use over 60 abilities and 50 weapons to orchestrate your opponent’s bloody demise.Build MomentumEach faction has a unique Momentum system that can result in a Surged unit. Units that Surge are able to string together superhuman chains of actions, or use the opportunity to further upgrade their abilities.Call In Air SupportUse Command Points to call in faction-specific air support abilities. The Blood Angels Stormraven can obliterate xenos with a missile barrage, or deep strike a unit of veteran Assault Marines behind enemy lines. Meanwhile, the Tyranid Harpy can devastate the enemy defenses with its Sonic Screech, or scatter the battlefield with its deadly Spore Mines.Face Your Friends On The BattlefieldWith live and asynchronous multiplayer, and hotseat modes available, there’s no excuse not to take your friends to war.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Black Lab Games","platforms":[{"id":0,"name":"PC"}]},{"id":416810,"name":"Bug Fables: The Everlasting Sapling","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82f/82f152cf71e5055a4119363998efd13c.jpg","description":"Bug Fables: The Everlasting Sapling is an Adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of The Everlasting Sapling, a treasure that can grant immortality! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom. The turn-based battles make use of Action Commands that can power up your attacks!\nSTORY\nHidden within the foliage of nature lies a small but prosperous continent - Bugaria. Insects from all over the world travel to it in search of the treasure scattered across it. The most sought after of these relics is The Everlasting Sapling! Eating just one of its leaves can grant even immortality! In search of this ancient artifact, a brave team of explorers - Vi, Kabbu, and Leif - will travel across many different environments. In order to do so, they must work together to clear puzzles, defeat strong enemies and help the general bug populace!\nFEATURES\nSeven lush chapters of story following the heroes across Bugaria!\nTraverse vast overworlds that transition into turn-based combat! Use action commands with Vi's Beemerang, Leif's Ice Magic, or Kabbu's Horn to make attacks more effective or block enemy attacks! Turn the tide of battle with the Turn Relay feature to exploit enemy weaknesses with the power of teamwork!\nExplore unique areas including: The Ant Kingdom, the treacherous Snakemouth Den, the picturesque Golden Hills, The Lost Sands, and Vi's home, the Bee Kingdom!\nUtilize a cooking system to turn ingredients into items that can help you in battle!\nEngage in a Tattle System that lets you hear your party interact with each other as they discover all the secrets Bugaria has in store!\nOver 30 sidequests and 15 optional bosses!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Moonsprout Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":327242,"name":"Panzer Dragoon: Remake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cd/4cd37b0352538071a713ebcf4b2e208a.jpg","description":"A new, remade version of the Panzer Dragoon game – true to the original, with improved graphics and controls, that suit modern gaming standards! \r\n\r\nOn a far, lone planet, you encounter two dragons awaken from the ancient time. Armed with a deadly gun from the ancient past and the guidance of your armored blue dragon, you must fulfill your destiny and keep the Prototype Dragon from reaching the Tower or die trying!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Megapixel studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":288800,"name":"Power Rangers: Battle For The Grid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f5/7f5972ab99f48b84b770dea1edd2f5c5.jpg","description":"A modern take on the 25 year franchise, Power Rangers: Battle for the Grid showcases stunning graphics and vivid details. Pit current and classic Rangers and villains like never before in 3 vs. 3 tag battles. Test your skills online against friends and players from around the world for endless replayability. A streamlined combat system welcomes newcomers with simplified controls while maintaining depth for the most dedicated competitor to learn and master.\r\n25 YEARS OF RANGERS\r\nGenerations of Power Rangers collide across the multiverse’s 25 year history. Experience authentic but reimagined Power Rangers battle sequences like never before.\r\nEASY TO LEARN, HARD TO MASTER\r\nPower Rangers: Battle for the Grid features traditional fighting game controls. This easy to learn but hard to master game is designed to welcome players of all skill levels.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"nWay","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":60901,"name":"Maelstrom (2018)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0db/0dbbaba8248d45d652ff5679d2bf857d.jpg","description":"Unique system ‘rewind’\nUse the rewind ability to save your position, then use it again to return to that position without any interruption. If you use your abilities well, you can pass through seemingly impossible attacks or obstacles. Also, rewind can be used during combat. By attacking the enemy while rewinding, some or all of the damage taken can be refunded. Use this actively to help with limited recovery means!\nVarious movement actions\nCombining rewind with moving actions such as 'dash' to move a long distance at once and 'climbing up a wall' to create multiple movements, and actively utilize the surrounding terrain to create challenging platforming difficulties.\nVariety of upgrades\nIn addition to simple stat-increasing upgrades, take advantage of the ‘artifact’ system that allows you to flexibly change your character according to the situation. Artifacts provide their own powerful upgrades, and Artifacts can be replaced at any time while resting. There are also 3 powerful spells available to assist with basic attacks. Unlock upgrades through exploration!\nChallenging Expeditions\nExplore 4 different themed areas! Defeat or dodge menacing enemies that stand in your way, and solve the puzzles that exist there to advance. Explore puzzles, combine abilities to design your own route, and break through puzzles with quick wits!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Gunpowder Games","platforms":[{"id":0,"name":"PC"}]},{"id":20977,"name":"Another Perspective","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72e/72e224662941246634b5b17f0fe27bbb.jpg","description":"Another Perspective is a puzzle platformer following the very confusing adventure / slow existential meltdown of someone looking for something that they don't remember.\nThis person(?) has the power to swap minds with what appears to be other versions of himself who all see the world in different ways. Where one pair of eyes sees a bottomless pit, another might not. Where one sees a locked door, another sees a key. To change perspective is to change reality!\nCombining these \"realities\" allows him to progress - or to at least do something that resembles progress - however this new found power leaves him deeply confused. Who is he? Why does he have this super power that doesn't make any sense? If he's swapping between bodies which body is really his? Why does he keep having to pick up keys and unlock doors? Where is he going? Is he even going anywhere? Does he even exist? What is he looking for?\nThe answers to some, all and none of these questions will be probably definitely not be maybe found by playing the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ShaunJS","platforms":[{"id":0,"name":"PC"}]},{"id":19169,"name":"Tex Murphy: Mean Streets","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fa/5fa631923e160d541470afefd6b24681.jpg","description":"The year is 2033. Your name is Tex Murphy, Private Investigator in San Francisco. You've been hired by the beautiful daughter of a university professor to uncover the facts about his death. As you begin your investigation you uncover the deaths of several prominent members of the scientific community. Are these deaths coincidental or is there something more sinister going on?\nAnd which characters could have a motive? Could it be J. Saint Gideon, former head of British Intelligence? Could Frank Schimming, president of the largest surveillance company in the world be hiding something? Or what about Sylvia, the professor's daughter. Is she as innocent as she seems? And why is an infamous Detroit hit man in town?\nYou'll interact with more than 27 digitized animated characters who respond to questions, bribes, and threats.\nYou'll rummage through offices, warehouses and factories looking for clues. With out innovative \"tree\" system you can search without typing.\nUse your Lotus Speeder to fly to major cities along the West Coast. This land/air vehicle is a full 3-D solid fill flight simulator.\nStunning 256K VGA graphics combined with RealSound produce a software experience close to real life than has ever been achieved before. Some characters actually talk and respond to questions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Access Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17230,"name":"Skyshine's BEDLAM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a2/9a2fd0f2e0e318b9a36826f402b33b15.jpg","description":"\"I haven’t seen a better looking game this year.\" - Rock, Paper, Shotgun\nYou are the Mechanic, the last known member of a once-thriving guild of brilliant operators of the rolling fortresses called Dozers.  You are in charge of commanding your crew in battles, managing your resources, improving your Dozer, interacting with various characters, and protecting your passengers while navigating through the post-apocalyptic wasteland.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Skyshine Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13302,"name":"theHunter: Primal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/663/663d3db478a93884d4b046ba118158f4.jpg","description":"Hunt - Explore - Survive\nWelcome Pioneer!\nStep into a huge Cretaceous world (24 km² / 9.3 mi²) where the very environment will test your survival skills to the max. This is the planet of Primal Eden. Help us reclaim, subdue and eradicate the savage wilderness so that we may plant the seed of civilization in its place. If you are successful, we will permanently erase your criminal records. If you fail, your dead body's nourishing of wild plants and animals will be seen as treason against the Expansive Galaxies Corporation and your extended family will be volunteered as Pioneers.\nThere should be some supplies in your drop pod to get you started. In order to survive, you will need to explore the world in search of more powerful weapons, clothing and ammo. Sounds easy? Well, not only is the island littered with poisonous plants, but deadly dinosaurs roam the island looking to feast on the weak.\nPlanet Primal Eden is inhabited by 5 different dinosaur species, including the mighty Tyrannosaurus Rex and the much-dreaded Quetzalcoatlus, a.k.a. Menace of the Skies. Careful planning, cooperation and backpacks filled with ammo and weapons are crucial to your survival.\ntheHunter: Primal is a new instalment in the highly popular and critically acclaimed theHunter franchise, created by Expansive Worlds and Avalanche Studios. Since its release, the original game has grown into a 5 million strong player community, and is still growing rapidly.\ntheHunter: Primal offers both single player and multiplayer modes, with the option of creating private gaming sessions. If you are looking for a serious challenge, turn on the PVP function, team up with your friends and let all hell break loose. If you prefer cooperative hunting, you can turn off the PVP function and join your friends and other players in an effort to bring down the beasts of planet Primal Eden.\nThe game features a persistent inventory system, which means that everything you’ve collected in one game session will remain in your inventory in the next one. But it comes with a price. If you die, all your equipment is lost. If you are fast enough you can pick up your lost backpack before another hunter loots your stuff.\nHappy hunting!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Avalanche Studios","platforms":[{"id":0,"name":"PC"}]},{"id":12261,"name":"Just Shapes & Beats","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/82a/82a8b8757f9c085d372b5fc8563d41cf.jpg","description":"Chaotic four-player couch co-op musical bullet-hell featuring numerous shapes of assorted variety and gallons of rad beats. Nominated for the most self-explanatory game title of all time.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Berzerk Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":11182,"name":"VoidExpanse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/133/1339b75a2068e8fe59b20c7822388bb2.jpg","description":"VoidExpanse is an open-world, science fiction action-RPG set in deep space.\nTake on the role of a spaceship pilot and navigate the vast reaches of VoidExpanse! Mine asteroids for valuable resources, trade to improve your ship, complete story missions offered by one of several factions with their own agendas, advance your character through diverse skill-trees -- and engage in fast-paced combat with hostile aliens, mercenaries and pirates in the rich and exciting Sci-Fi universe of VoidExpanse.\nOpen exploration of procedurally-generated galaxies in sandbox mode.\nUpgrade your ship using hundreds of different modules and devices.\nComplex real-time combat system.\nFactions that have their own agendas, people, territories and storylines.\nCharacter customization with a number of diverse skill trees and branches.\nMeaningful trading system involving trade routes and supply/demand simulation.\nAdvanced asteroid mining with a multitude of ores and mining devices.Every aspect of the game can be fully modded and expanded upon -- and new content can easily be added. For example, game logic can be edited by using our custom scripting API to modify VoidExpanse even further. In sandbox mode, you can create your own procedurally-generated galaxy or create persistent multiplayer worlds with custom rules and gameplay mechanics.\nWe want to keep polishing the game as long as people are interested in the world of VoidExpanse. Please join our forums so that we can read and address any feedback you might have! Tell your friends about VoidExpanse if you're having fun with the game. The more we hear from you, the more we can achieve together!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"AtomicTorch Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":783856,"name":"Animal Well","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f0a/f0ae5322f985cda91e871adcfcb91f6f.jpg","description":"Explore a dense, interconnected labyrinth, and unravel its many secrets. Collect items to manipulate your environment in surprising and meaningful ways. Encounter creatures both beautiful and unsettling, as you attempt to survive what lurks in the dark. There is more than what you see.Explore - Illuminate The Dark Dense atmospheric puzzle box world with attention paid to every detail\nLight candles for safety and gradually fill out your map\nNonlinear -- explore and collect items in whatever order you choose\nTons of secrets\nSolve Puzzles - Observation Is Rewarded Enemies, environment, and items interact in surprising and systemic ways\nAll items have multiple uses\nLearn how innocuous details can become meaningful\nThe main game is just the beginning. Players will be discovering hidden puzzles for years\nSurvive - Tread Carefully You must assess for yourself what is safe and dangerous\nFocus on tension and suspense rather than action\nYou are disempowered, but can make clever use of your environment and items","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Shared Memory","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":334431,"name":"Kirby's Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/374/37428e70248ebdbc11ee628dda3eb88e.jpg","description":"Kirby's Adventure is a 1993 action-platform video game developed by HAL Laboratory and published by Nintendo for the Nintendo Entertainment System. It is the second game in the Kirby series after his debut on the Game Boy and the first to include the Copy ability, which allows Kirby to gain power-ups from eating certain enemies. It is the only NES game in the Kirby series, released towards the end of the NES's lifespan and pushed the palette and graphical capabilities of the NES to its limit.\nThe game centers around Kirby traveling across Dream Land to repair the Star Rod after King Dedede breaks it apart and gives the pieces to his minions. The Star Rod serves as the power source of the Fountain of Dreams and insures that all residents of Dream Land will have restful sleep.\nA remake of the game for the Game Boy Advance, titled Kirby: Nightmare in Dream Land, was released in 2002 featuring enhanced graphics and multiplayer support. The NES version of Kirby's Adventure was re-released on the Wii via the Virtual Console in February 2007. A 3D Classics version was released for the Nintendo 3DS eShop in November 2011 and a Virtual Console version for the Wii U was released in April 2013.\nThe game was critically acclaimed and is considered one of the best NES games of all time.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"HAL Laboratory","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"GameCube"}]},{"id":257242,"name":"Shin Megami Tensei V: Vengeance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b6/1b6673b646af55f834938bedebee2a0f.jpg","description":"The ambitions of god and human clash amidst the horror of a dying world. Neither human nor demon, the newly-forged Nahobino and his friends must decide what is worth saving... and prepare to sacrifice everything in its name. In a world without its Creator, which path will you choose?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Atlus","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":61213,"name":"东方大战争 ~ Touhou Big Big Battle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a0e/a0e5ae9a8833005633dcb4611033d498.jpg","description":"Touhou Big Big Battle is a Touhou Project fangame, and a casual hobbyist project made by MyACG Studio. We hope you enjoy it!\n[]Train your army, explore a variety of skills, and push down your enemies![]Control your protagonist, hoard the points, storm the battlefield with your spell cards!Develop your unique deck and strategy, crush your opponent with wisdom!\nStrategic Battles!\nExplore various combinations of units and skills, and lead your massive army to the victory!\nTons of Playable Touhou Characters!\nEveryone has their unique perks and weaknesses! Show your foes what they are capable of!\nNetworked Multiplayer!\nFinally, a Touhou fangame that you can play with your Steam friends!\nFree Collectible Cards! Say no to Gacha!\nCollect cards to build your unique deck of armies! Cards are only obtainable through progression, not cash!\n...Incident?\nUhhh... We haven't thought about what kind of incident this is yet, but the most important question is -- do we really need an incident to start a Touhou story? ??\nIs this really free?\nThe base game will be free at any time, and we might add additional paid characters through DLC.\nBut we promise that we will NOT add any paid gacha or card packs like other digital collectible card games on the market.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"MyACG Studio","platforms":[{"id":0,"name":"PC"}]},{"id":51435,"name":"Wilmot's Warehouse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/785/7859b3b924205d3cc1fd39771058be0e.jpg","description":"Wilmot's Warehouse is a puzzle game about keeping a warehouse running in tip-top shape. You play as Wilmot, a hard working warehouse employee tasked with pushing, sorting and stacking a variety of products. Over time more and more truckloads of these products will arrive, gradually filling up the warehouse. How you arrange them all is entirely up to you - organize by color, type, the Dewey Decimal System, or some wild format that only you understand - it’s all good! Just remember where you put everything, because when the service hatch opens, you'll need to find the things people want quickly, in order to earn the coveted Performance Stars required for all manner of labor-saving upgrades.\n\nFeatures\n- Unique relaxing gameplay.\n- 500 possible products to stock.\n- All manner of upgrades and perks.\n- Splitscreen 2 player co-op: Work in tandem to organize the warehouse with a friend                                                                                                                                                                                                                                                                   - Customise your game with Expert Mode for an extra challenge\n- Sublime electronic music to listen to while you decide whether wellington boots belong in the footwear section, or with the umbrellas.\nPlease note that 2 player co-op mode requires at least one gamepad.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Richard Hogg","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":45567,"name":"Luna Online: Reborn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58b/58b169fe57c800fcbab66c036d7f3cc9.jpg","description":"Luna Online: Reborn is an anime themed MMORPG set in the cute fantasy world of Blueland. The game is a remake of the popular Luna Online, now published by Suba Games. It provides adjustments to original content that remove any negative experience gamers reported about Luna Plus.Features4 UNIQUE CLASSES WITH 100's OF PATHS OF FOLLOW\nLuna Online's special job system allows for players to mix-and-match skills and abilities to create the ultimate hero!\nA VAST COLLECTIONS OF COSTUMES TO CHOOSE FROM\nWith nearly 1000 costume parts to choose from,\nUNLEASH THE HIDDEN POWER OF PETS\nA pet in Luna is more than a cosmetic friend. Your pet will be a truely powerful companion if you take good care of them. They may even \"Awaken\"...\nFIND YOUR TRUE LOVE ON THE BATTLEFIELD\nParticipate in Date Dungeons to find your special someone; and even get great rewards doing so!\nFORM A GUILD AND CLAIM THE CASTLE\nWith you as the king and close friends as your soldiers, there's no way things aren't going to get hectic! Battle other guild in weekly events to take ownership of the luxurious Nera Castle.\nBECOME A HOMEOWNER\nSettle down in your own home and decorate it as you like. Setup a farm and grow your own harvest or relax by a peaceful lake with the birds chirping and catch some wild fish to cook.\nTRAVEL THE WORLD\nRide around in dozens of vehicles, and mounts. Whether you prefer to ride in style in a fancy car, get around in a UFO or go old school and ride a horse, the choice is yours.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Funtime","platforms":[{"id":0,"name":"PC"}]},{"id":44187,"name":"The Long Reach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44c/44cda3bae9ffa992cd9fd9f57726bfd8.jpg","description":"\"Calm down. This is all normal. Well, it’s a new normal. There was a malfunction that we can’t fix yet, but with your help I can make symptoms bearable. We’re all in the same boat here and should help each other.\"\n\"I’m Shelly, a lead scientist in General Education research facility. The job title is longer, but it’s not important. Here’s what I know so far, though.\"\n\"The experience-sharing program that we were studying went haywire. Maybe it’s that black box, maybe something else. The main symptom for you is that your nightmares and dreams no longer require sleeping to manifest. These hallucinations is all your subconscious. It turns out that given enough time with it, we go insane. But we can fix that.\"\nThe Long Reach is an adventure game filled with colorful characters, puzzles, and a shock of discovery. Wait, weren't we supposed to say “joy of discovery”? That can’t be right.\nThe Long Reach takes place in New Hampshire, in the fictional town of Baervox. The game draws its inspiration from Lone Survivor and The Cave and all the classical adventures (except that The Long Reach is set in the present day). You don't play in a post-apocalyptic world or explore a fairy-filled fantasy world. You’re in the thick of it, just around the corner from the place where you buy your groceries.\nThe Long Reach is a horror-thriller hell bent on screwing with your perception of things.\nThe game misuses stunning pixel art to create gruesome and unsettling images.\nYou’ll be playing as Calvin throughout the game -  this is an example of the lies and deception that we have in store for you.\nYou won’t be forced to figure everything out. Escape if you wish, in fact we encourage you to run for your life!\nSolve puzzles that require thinking outside the box. The box provided by our publisher was never used during the development.\nYou’ll be able to talk with plenty of characters. In fact, you’ll have a chance to pitch in every five lines or so.\nA classic adventure game inventory filled with keys and weird stuff (note: no Elvish swords glowing faintly blue when evil is close in this game).\nOriginal atmospheric and haunting soundtrack. The composer's not right in the head, he brought weird stuff home to use in the soundtrack. We’re all concerned for his cat.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Merge Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":32110,"name":"Biing!: Sex, Intrigue and Scalpels","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/570/570169303a24f0284e231a36110fe1bb.jpg","description":"Mature content notice: Biing!: Sex, Intrigue and Scalpels contains explicit language, strong sexual themes, nudity and is intended for mature audiences.\nThe sequel: Biing! 2 is included with the game as a bonus goodie. Available only in German.\nWhacky, graphically brilliant, extremely funny and incredibly entertaining, that was the judgement of the specialized press about BIING!. Of course you, as the manager of “Brainworm Memorial” should know exactly what’s important in modern medicine nowadays!\nSpecialists with a golf handicap under 50?\nDefinitely qualified!\nNurses with an education level below 3 and a bust less than 100?\nHighly unqualified.\nAfter all, you have to offer something to your patients. Only a satisfied customer pays the steep bill with a dreamy smile and returns. And only a healthy bank account allows you to buy the necessary medical hardware, like an ambulance and the operating theater. Well - the golf course could also use a renovation.\nLet’s hope you will never be admitted to this hospital. After all, we don’t take responsibility for your physical and mental integrity.\nIn case of risks and side effects, please take your doctor to the pharmacist and not to us!\n","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"reLINE Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":30057,"name":"Blade Runner","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a1/8a1caa9a69ba9977caf6d3f42f4fd275.jpg","description":"In 1997 Westwood Studios released a title that won universal praise from gamers and critics all around the world, along with accolades like AIAS’s Adventure Game of the Year award. Set in the same time and universe as the 1982 classic science fiction film by Ridley Scott, Blade Runner video game is now making a big comeback on modern computers.\nIn the game, you take the role of detective Ray McCoy. Armed with your investigative skills and tools of the Blade Runner trade, you must roam the dark, rainy streets of Los Angeles A.D. 2019 in pursuit of androids gone rogue. Searching for those so-called replicants is a tough nut to crack because they look and behave almost exactly like real people. Faced with growing moral dilemmas, McCoy will soon have to answer questions about his own humanity.\nFeatures:\nImmerse yourself in the dark, gritty world of Los Angeles 2019, where you become both the hunter and the hunted.\nExplore over 100 interactive environments including sets from the Ridley Scott’s 1982 movie.\nTake part in a non-linear story that creates a unique experience every time you play.\nInteract with over 70 motion-captured characters, all with their own AI and agendas.\nWitness the climatic noir-style visuals, engulfed in smoke and rain.\nRecognize the Hollywood cast from the original film including Sean Young, James Hong, Joe Turkel, Brion James, and William Sanderson.\nListen to the ambient, multi-track audio and hear the music which includes specially recreated cuts from the original Blade Runner soundtrack.\nStep into the role of detective Ray McCoy and utilize Blade Runner tools you know from the movie. Use ESPER photo analysis machine to distinguish replicants from humans, and analyze all case clues with the Knowledge Integration Assistant.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Westwood Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20600,"name":"GundeadliGne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8f/c8f1a84651df206ce39197190c365236.jpg","description":"Reload for more shooting action with GundeadliGne, the 2nd  title in the Gundemonium Collection - this anime-style side-scroller brings the intensity of the 'bullet hell' shooter genre to Steam. Take your place as a mercenary and assist in the effort to prevent the annihilation of mankind by the demons of the underworld. Grab a friend, lock and load your guns - play online together in co-op mode! Choose from two player characters, and fight to unlock the third! Four levels of difficulty will make your experience an intense battle. As an added bonus, choose from 6 Matrix Masters with different abilities to help you along your way.\nKey features:\t\t\t\t\t\t5 levels of bullet hell craziness\nSweet old-school retro anime-style art\nTwo playable characters and an unlockable third\n6 Matrix Masters to choose from\n2 unlockable mission modes\n11 Steam achievements\nLocal two-player multiplayer mode\nSteamworks two-player online multiplayer mode\nFull online leaderboards\nNew arranged soundtrack by DM Ashura\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Platine Dispositif","platforms":[{"id":0,"name":"PC"}]},{"id":20448,"name":"Small Town Terrors: Livingston","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b9/1b9e3fbb9c3d290b94f52eaad52745a6.jpg","description":"Ever taken a wrong turn on a car trip? A bad sense of direction should not turn into something so dire. In an instant, there's a bad accident. You awaken from a coma to the scene of a living nightmare. The hospital is a dreadful place that looks like it does more harm to patients than good. Even worse, your family is nowhere to be found.\nFlesh-Eating Zombies\nProceed with caution as you venture through an apocalyptic atmosphere. Sinister forces hide beneath the shadows and danger lurks around every turn. The local residents have all transformed into flesh-eating zombies. Our heroine must find her husband and daughter and escape before they all succumb to the horrible fate befalling Livingston.\nState of Chaos\nThe entire town is in a state of chaos. Crazed zombies appear to be on the loose. Small Town Terrors: Livingston is not a game for the faint of heart…\nStop the Horror\nYou must uncover the cause of the evil and find your family before it's too late. Bit by bit, piece together what happened in this terrifying tale. Search for your family; uncover the horror that has corrupted nearly every living thing and fight to escape with your life.\nFeatures\nExplore abandoned buildings and search for helpful items as you try to piece together what has happened to the town. Find your family before all is lost! From beginning to end, you will be mesmerized by the zombie-dominated storyline and its advanced hidden object puzzle adventure game features.\nExplore a town plagued with zombies\nUncover mysterious evil\nFind your missing family\nSpooky original score sets the mood","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Gunnar Games","platforms":[{"id":0,"name":"PC"}]},{"id":17900,"name":"A Wizard's Lizard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c31/c31daaa4ed177891f11074f74f573660.jpg","description":"Conquer the forces of Death in A Wizard’s Lizard, an action RPG for Windows, Mac and Linux. Explore ever-changing dungeons, filled with valuable treasure and powerful items, while battling back the hordes of evil. Rescue townsfolk to improve your town and aid your next trek into the dungeon.\nFans of The Legend of Zelda, Gauntlet, and The Binding of Isaac will love the retro-inspired twin-stick action of A Wizard's Lizard.\nWhen the wizard of Amberfall unlocks the magic of eternal life, Death comes to take him away. Now his faithful pet lizard must brave procedurally-generated dungeons to save him!\nMaster Life & Death: Death is only the beginning as you continue to unlock secrets in the realm of the dead. Find hidden items only accessible to those who have died and discover the power of resurrection. Tread carefully, the dead do not wish to be disturbed.\nRebuild the Town: Rescue townsfolk trapped throughout the dungeons for increasing reward. Discover lost blueprints which allow the town's blacksmith to craft new weapons and armor.\nRestore the Museum: Search Death's domain for stolen artifacts and legendary weapons. Every item you find is returned to the museum for display. Can you recover all of the powerful weapons, legendary armor, and magical items?\nControl your lizard using your favorite gamepad (including the Xbox 360 controller) for full 360 degree movement and attacking.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lost Decade Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17727,"name":"Particulars","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47b/47bf9470cff568a5ab4d990b75986a5c.jpg","description":"Are you a Supporter or Devotee?The Supporter and Devotee packs are ways to give extra support to the developers of Particulars, and get extra goodies! The listed bonuses will be added to your account as they become available.\nAbout the GameParticulars is a game with a unique combination of arcade-action and puzzle gameplay, set in the mysterious world of subatomic particles.\nTaking control of a single quark, you must negotiate the fundamental forces of the universe. Other particles will push and pull at you - you'll always be on the brink of losing control and being dragged towards annihilation!\nWoven through the game is the story of Alison, a young physicist struggling to outrun her troubled past. Her journey through the subatomic world is drenched in memories (both good and bad), and will ultimately lead her to some powerful revelations.Features\nBased on actual particle physics: Enter the world of sub-atomic particles and take part in the interactions between them.\nA puzzling narrative: Particulars is a game which blends arcade and puzzle gameplay with an engaging story about a troubled young scientist.\nOver 100 intriguing levels: Explore the four fundamental forces of the universe over ten chapters of increasingly complex play.\nDig deeper: The Particlepedia provides information on each particle in the game, the differences between the game world and the real world, and links to other information sources.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SeeThrough Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]}]