[{"id":14799,"name":"Астролорды: Облако Оорта","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bb/4bb3fbdfc1c69138c595c9372ecbd022.jpg","description":"Astro Lords: Oort Cloud is winner by Indie Game Cup 2015 in \"Best Art\" category.\nEach player begins the game as an Astro Lord on their asteroid base. This base enables players to extract minerals and build factories, which will be used to produce ammunition and spare parts for their space ships. This base is the player’s primary stronghold: other Lords can raid it, but they won‘t be able to capture it. Players can also capture up to five additional asteroids, which will be used to extract minerals. But beware: the player will have to remain on the alert to keep other Lords from recapturing the asteroids.\nPlayer bases are located on asteroids, which travel within the Oort Cloud. Once they’ve acquired the appropriate skills, players can control their asteroid’s movements.\nMass-combat enthusiasts will love the Arena: here, players can battle it out against alien races (AI) or other Astro Lord players. Those battles take place in real-time, which allows players to actively take part in the game instead of just having to wait for the completion of their building projects.\nYou will experience complete freedom of action and social interaction.\nBecome a worthy Astro Lord!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Aratog","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14117,"name":"Revelations 2012","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8a/a8a4cd1cbee63a613d81159837eb750c.jpg","description":"Armageddon. Apocalypse. The end of days.  Mayan prophecy foretells the beginning of a new world age on December 21, 2012 when the road to the stars will descend from the sky and civilization as we know it will come to a tumultuous end.  That date has arrived and with it the awakening of a most formidable enemy.  Galactic alignment has enabled an artifact which opened a portal allowing villainous Gods access to our universe.  Fate has chosen 4 characters to teleport through this portal into another dimension and battle against all odds to rescue mankind from destruction and enslavement.  Using teamwork and strategy, can the four heroes save humanity by defeating these evil foes?\nIn Revelations 2012 players progress through an alternate dimension in a sweltering jungle environment heavily influenced by ancient Mayan culture.  First-person shooter action is combined with puzzle solving requiring methodical yet quick-thinking team play in a captivating campaign that can be played with up to four players in co-op mode.  Players navigate their way through this perilous maze in 15 different maps gathering \"suki-tok\" to advance themselves all the while fighting hordes of demonic minions.  At the end of each level, the characters are faced with their greatest challenge yet, the Gods themselves!!!  As each God is defeated players acquire a crystal to increase the capability of their weapon.  Players must use each successive crystal in the next trial that awaits them.  Gather all the crystals and overpower the Gods to be victorious in this epic journey.\nIn addition, multi-player modes let you compete four-on-four with friends playing as either heroes or demons in stasis tag or team death match.  Revelations 2012 also boasts the premiere of battlegrounds multi-player maps.  This unique mode allows unit selection mind control in a 4 vs. 4 setting to advance in force upon your opponent and infiltrate the enemy base to destroy their boss.Key Features:\nFPS 4 player co-op\nEpic boss fights\nHordes of powerful minions\n4 vs 4 multi-player game play with an all new battlegrounds mode\nModular alien weapon system\nTeamwork strategy to solve puzzles\nOld world Mayan city setting\nUse of AI director for unique game experiences\nMatchmaking, stats, rankings, and awards systems\nPowered by Source and Steam","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Dark Artz Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":13472,"name":"Adam's Venture Chronicles","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdb/cdbb8af8e87a5794be1e767445950ea3.jpg","description":"Adam Venture is a renowned explorer and adventurer. During his epic adventures, set in the 1920’s, he encounters antique artifacts, ancient mysteries and the player will decipher strange symbols. Supporting him is his accomplice: Evelyn, with her the player will solve ingenious puzzles and embark on breathtaking platform challenges to outsmart the evil Clairvoix Corporation. Visit gorgeous locations, including historical sites and stay ahead in a race between good and evil that holds the world in the balance.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SOEDESCO Publishing","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":12480,"name":"Tales of Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ca/9ca6d9aedbaa429a5fd5fd872e2efd57.jpg","description":"Tales of Destruction\nTales of Destruction is minor FPS shooter game\nTales of Destruction currently has 9 maps + 1 big Open World more to come. In Tales of Destruction player only target is to find hidden treasure chest in level. There are many other soldiers who try to prevent you to find hidden treasure.\nThere are 2-4 respawn locations where player randomly respawn after death.\nThe game has collectibles, such as ammos kits & health packs. So not to worry if you have low health or no ammos, everything is there to help you fight off those enemies. Each player is only entitled to 2 different weapon currently, Laser rifle & Lava Launcher.\nTales of Destruction has no story behind the game, the main objective is to find the necessary treasure and complete the map. At the end of every map, you will be sent back to the main startup lobby for you to pick another map to play\nProject is also hole time under development progress and stuff is planned. Like new enemies, trading cards, more maps etc","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tero Lunkka","platforms":[{"id":0,"name":"PC"}]},{"id":11634,"name":"Universal Combat CE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b48/b48e024aaa0f0142ac8b94dcf352d89c.jpg","description":"THE MOST ADVANCED SPACE COMBAT CAPITAL SHIP SIMULATOR. EVER. SERIOUSLY.\nIn Feb 2015, as part of the Battlecruiser twenty-five year anniversary celebration, a refresh of Universal Combat 2.0 was released for FREE for a limited time.\nUniversal Combat which was first released in 2004, was the spiritual successor to the infamous Battlecruiser series of games which made its debut in 1996. Then heralded as the most advanced capital ship space combat game, Battlecruiser 3000AD, the first title in the series, set the resulting standard for high-end capital ship combat games. You not only had control over a massive armed carrier in a vast universe with space and planetary bodies, you also had complete control over the carrier's systems (weapons, navigation etc), support crafts (fighters, shuttles, vehicles) as well as an entire crew that moved around the ship doing various things (e.g. engaging in combat with intruders).\nWhen Universal Combat arrived, aside from new graphics technologies, it brought along with it a host of new features which were not present in the previous Battlecruiser titles. Such features included advanced fps controls which allowed you to not only deploy your carrier crew to planets, control them in combat etc, but it also allowed you to fight alongside them\nIn 2007, Universal Combat Collectors Edition was released as the final title in the Battlecruiser and Universal Combat IPs.\nIn 2009, following the 2008 release of Galactic Command Echo Squad SE (we also refreshed this game in 2014 and released as a Steam exclusive)  which had improved space and planetary engines, we again refreshed the UCCE game and released it as Universal Combat Collector's Edition v2.0.\nThis ultimate space capital ship combat compendium spans over two decades and represents the evolution of hard core space combat sims. It contains all Commander scenarios from every game in the Battlecruiser and Universal Combat series:\nUniversal Combat Special Edition (3000AD, Oct 2006)\nUniversal Combat A World Apart (3000AD, Oct 2005)\nUniversal Combat Gold (3000AD, Oct 2005)\nUniversal Combat (Dreamcatcher Interactive, Feb 2004)\nBattlecruiser Millennium Gold (Dreamcatcher Interactive, March 2003)\nBattlecruiser Millennium (EB Games Exclusive, Nov 2001)\nBattlecruiser 3000AD v2.0 (Interplay, Dec 1998)\nBattlecruiser 3000AD (Take2, Sept. 1996)PRIMARY GAMEPLAY FEATURES\nHere is a sampling of the game features, out of hundreds of things that you can do in the game; most of which you can must make up as you go along. And this list doesn't contain any mention of the advanced game engine technologies, especially one of the most advanced AI systems you've ever encountered in a game.\nCommand 28 capital ships including carriers, cruisers, transports.\nCommand 46 support crafts including fighters, shuttles and planetary vehicles.\nCommand a crew of over 100 personnel including key personnel such a Flight Officer, Navigation Officer etc.\nUse fleet command & control to create a massive fleet consisting of your ships and other AI controlled ones.\nDirect control of various ship systems including shields, reactor, engine, cloaking, tractor beam, transporters and various advanced weapon systems.\nTrack your ship's AI crew as they go about their on-board duties which include engaging hostile intruders, repairing ship systems, prepping support craft etc.\nLead your marines into battle on planets using various weapons of mass destruction.\nDeploy an away team of (e.g. marines, engineers etc) in a shuttle, deploy them on various planetside missions; complete with advanced orders.\nDeploy probes to keep track of friendly regions as well as spy on hostile ones.\nDeploy mining drones on planets to mine for precious minerals which you can then sell for profit.\nDock at various space stations and planetary bases to trade, repair, rearm - and of course engage the hostile ones along the way.\nCapture space stations for your alliance and use them as operational bases, including the ability to use their own fleet of support craft (cruisers, carriers, fighters etc)\nPlay the freeform scenario and roam a large persistent galaxy.\nNo shuttles? Don't want to risk being shot down? Use the transporter room to deploy your combat away team directly into hostile planets.MULTIPLAYER\nThere is no multiplayer in this version of the game.SUPPORT\nThere are no more updates to the base game. The final version was v2.00.03 released on 05-28-2015. You can view the changelog for more info. Due to the game being improved upon, future updates are only released via The Lyrius Conflict DLC which uses v3.x game engine kernel. You can view the changelog for more info.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"3000AD","platforms":[{"id":0,"name":"PC"}]},{"id":11538,"name":"On A Roll 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af0/af0a80a2472d77590e314a1156c95c8e.jpg","description":"On A Roll 3D\nRoll your way through 24 huge levels across six different themes in this fast, colourful 3D platform game.\nBe prepared to take on spikes, mines, dynamite, conveyor belts, springs, switches, doors, bumpers, lasers, saws, fire, ice, water, electricity, trapdoors and much much more. Each level has three areas you must navigate your way through, battling a host of enemies along the way, then a fourth and final area where you must take on one of the six end-of-level bosses! Grab the protective stars as you go and keep an eye out for the many hidden bonuses to help you on your way.\nOn A Roll 3D is a classic platformer that mixes the regular 2D format with a 3D twist as many of the platforms cross in front of each other. There are plenty of puzzles thrown in that combine realistic physics and logical reasoning with switches, levers and pushable blocks required to open doors and trapdoors, and to reach otherwise inaccessible places.On A Roll 3D is an immensely fun and very challenging retro platform game!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Battenberg Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10360,"name":"UFO Online: Invasion","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9be/9be6557f90b578d4e9b373f994289438.jpg","description":"UFO Online: Invasion is a turn-based tactical combat MMORPG set in the post-apocalyptic world\nIn February 2024 a huge alien spaceship attacked Earth. Myriad capsules containing xenovirus landed and began spreading their contents across the world. Right after that alien dropships began the descent. The main alien objective was to gather genetic material generated by natural evolution process.  Then they planned to totally eradicate life on our planet and re-seed it with primitive life forms, as they have done many times before. But they have failed.\nIt was too late for their plans. Human evolution has been much more efficient than they expected, and they faced fierce resistance. In this war every man was fighting not for resources but for the right of humanity to exist.\nAfter this war, our world has changed beyond recognition. Alien mothership suddenly left Earth's orbit, but some alien life-forms and some of their infrastructure remains on Earth.So the War Is Not Over.Simultaneous turns tactical combatPlayers have 60 seconds to choose their actions during \"Planning phase\" and watch their actions resolve during \"Simulation phase\". This system eliminates countless hours of waiting for your opponents to complete their turns, thus allowing massive tactical PvP battles with dozens of participants.Large Open WorldFull of hidden treasures, quests, missions and dangersPlayer-driven IndustryGather resources, craft weapons and equipment, use them or sell for profit.Player-driven EconomyBuy low - sell high. Destroy your competitors in a trade warsFlexible Skill SystemChoose from more than 100 skills in 11 masteries to create unique characterRich Social InteractionsCreate and improve your clan or join existing one. Wage bloody wars with enemy clans and alliances to control basesConquerable BasesFight for control of the bases, defend them, improve them and use to craft most advanced equipmentPlay Your Own Style In Ufo Online!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bad Pixel","platforms":[{"id":0,"name":"PC"}]},{"id":10127,"name":"SuperPower 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b0/1b04d41f3c11952539022d937ff2b342.jpg","description":"RULE YOUR COUNTRY, CONQUER YOUR ENEMIES, DOMINATE THE WORLD!The Story:SuperPower 2 is the only global geopolitical simulation game which allows players to control entire countries. Players control countries in 3 major areas: political, economic and military, but this time, in a beautiful real-time 3D environment. Players build up their own countries and increase their influence in the broader world while competing against sophisticated A.I. Along the way, gamers make use of economic sanctions, political alliances, and military actions to wage their battles. SuperPower 2 offers the ability to fine-tune each country's performance, from creating or breaking treaties, to making tactical decisions in particular military conflicts.Key Features: 193 real countries all playable & equipped with realistic data drawn from the CIA World Factbook, the United Nations and U.S. Military databases.\nSophisticated A.I. designed to realistically simulate each country.\nReal-life combat situations, with multiple forces joining and leaving battles as the balance of power shifts.\nReal-time gameplay and Modular units building.\nSolo scenarios and \"sandbox mode\", as well as full Multiplayer support for up to 32 players in a variety of styles, including world domination, economic master, and many othersSuperPower 2 Steam Edition Features:14 steam achievements\nNew internet matchmaking library, and modified the UI flow in the multiplayer menus\nUpdated the code to support new OS\nWidescreen Resolution support\nEditor and Full SDK includedGameplay Changes:Capital ships needed for invasions from the sea. They need to be within 750km of the region you're trying to invade.\nEnemy fleets must be further than 1500km of your invasion fleet when trying to invade a region from the sea.\nThe AI will take diplomatic relations into account and will decide whether or not to annex regions under it's military control now.\nEconomy: GTM limited to 30%, sectortax at 70%.\nDiplomacy: embargo treaties result in a drop in relations.\nCombat Radius has been enlarged to make frontlines easier to make.\nAI: allies will make more rational decisions when there is war. If you can handle it yourself, they won't help.\nPeaceful Annexation: depending on population support in both nations, you now have more or less chance of peacefully annexation a nation.\n95 and the nations involved need at least one religion or language in common.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"GolemLabs","platforms":[{"id":0,"name":"PC"}]},{"id":4433,"name":"Warp","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05b/05be845a5ec826b4a5a409194d9cffab.jpg","description":"Warp™ is a puzzle based stealth action game where gamers play as Zero, a loveable yet lethal, little orange alien with a big score to settle. Abducted by a villainous General from his home world and taken to an underwater research facility, Zero must plan his ultimate escape by relying on his arsenal of special abilities.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© Trapdoor Inc., Trapdoor and Warp are trademarks of Trapdoor Inc. in the U.S. and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":306030,"name":"Lovers of Aether","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/990/99046548acbdd14a9c20f686166eb0d0.jpg","description":"Now is not the time for war. Now is the time for love! The homecoming dance is tonight and you need a date pronto. Spend your school day talking to the students at Aether High. All the original characters from Rivals of Aether are in attendance. It's up to you to decide who you would like to take the the homecoming dance. Get to know each character by talking to them and asking questions. But the school day is not all about lollygagging. You'll have to attend classes, take a pop quiz, give a book presentation and play a game in the computer lab. At the end of the day, will you have a date to the dance?\nLess words than War and Peace by Leo Tolstoy! Don't spend the rest of your life reading the words in this game.\nOrcane is a pranskter! Do you like pranks? Then you'll love Orcane.\nUse your mouse and click stuff. Or use a touch screen and poke stuff. Or use your eyes and look at stuff. Or use your wallet and buy Rivals of Aether.\nEvery character is some kind of animal. Someone told me that is an important feature for a dating game, but I have no idea why.\nCalm relaxing gameplay. Unlike in a fighting game, no one is out to destroy you and make you wish you never picked up a controller. You can talk to characters at your own leisure and enjoy the elaborate lore of Aether High.\nSylvanos will help you get ripped. Follow his natural path and you too can obtain beautiful longtoids.\nLearn about all the drama that went down last night at the Ding Dong Tree. Who will you believe?\nAn amazing soundtrack that will remind you of the fighting game with these characters so maybe you'll buy that game for all your friends after playing this game.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Dan Fornace","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":288681,"name":"Drug Dealer Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/659/65974809e9a0ae5e3be1a1a18afeda45.jpg","description":"Have you ever thought about expanding your own crime empire, without the legal and moral consequences? SIMULATE IT!\nNow you will finally be able to crawl into the dark alleys of the drug dealing business!Start small, grow BIG!Begin your story in a small dirty hideout and make your way up to controling the territory, hiring your own minions, and doing dangerous business.\nBecome a street business mastermind, or a ruthless gangster - it's up to you!\nBut be carefull! Nothing is easy in the world of crime...\nRetrieve smuggled merchandise from outside cartels, avoid the police, organise hideouts. Sell small amounts to singular clients, or do big deals with gangs.\nRemember, you have to be smart, you have to be sneaky. Enemies are lurking on every corner, and the DEA never sleeps.\nScared yet? Don't be. The brave ones rule the world.\nIn this world not only you seek power, money and respect. Be careful with your actions, as you can either make powerfull allies or vengfull enemies... or both. Don't screw your clients... too much, cooperate with the right people, don't get caught and you just might live long enough, to spend your fortune!\nWho needs money, if you can't spend it, right? Use your profits to either grow your gang, buy new equipment, bribe people, hire some muscle or... JUST HAVE FUN AND PARTY.\nGuns, drugs and rock'n'roll... or something like that.Game features:- Receive smuggled shipments from the cartel\n- Safely make your way to your hideout with the merchandise\n- Create your own recipies, divide portions to prepare dope for sale\n- Organise your distribution starting from singular junkie sales up to wholesale transactions with local gangs\n- Strategically avoid police patrols and DEA ambushes\n- Raise your influence and gain territory. Hire or bribe people, make deals with gangsters or simply shoot your way to domination.\n- Grow your business, invest your money and face new dangers and dilemas as you climb the criminal ladder.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Byterunners Game Studio","platforms":[{"id":0,"name":"PC"}]},{"id":58763,"name":"Battletoads (2020)","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e7/0e7485e8b30197bf2f797f91a68b6f6d.jpg","description":"The wait is over! Rash, Zitz and Pimple are returning at last to smash-hit their way through an all-new action-packed adventure of choreographed chaos, and couch co-op may never be the same again.\n\n1-3 players will take control of the Battletoads and team up to storm through wild and unpredictable stages with only one rule – expect the unexpected. Teamwork makes the dream work in a drop-in, drop-out gameplay blast, filled with over-the-top gameplay moments that anyone can enjoy, but only a True ‘Toad’ can master.\n\nWith a unique hand-animated cartoon style and packed with memorable characters and locations, the Battletoads are back for a larger-than-life brawl across the universe that promises to be fun alone, and unforgettable together.\n\n• Action-packed adventure as iconic characters return\n• Over-the-top combat with combos and hard-hitting morph attacks\n• Wild, varied gameplay sequences for all types of gamers\n• Hand-drawn animation feels like playing a cartoon\n• Drop-in couch co-op for three players\n• Hilarious story with cinematic cutscenes","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rare","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":53129,"name":"Altered Beast (1988)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0c8/0c8e70a85fd2a341c77ada2a919ca0e1.jpg","description":"Altered Beast is a 1988 beat 'em up arcade game developed and manufactured by Sega. The game is set in Ancient Greece, and follows a centurion who is resurrected by Zeus to rescue his daughter Athena. In order to save his daughter, Zeus transforms the centurion into beasts with the use of power-ups. After its initial arcade release, it was ported to several home video game consoles and home computers, including the Mega Drive/Genesis, for which it was a pack-in game.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"SEGA","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"NES"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Genesis"}]},{"id":49782,"name":"家有大貓 Nekojishi","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c9/7c9cea8f768c3178762f5d826fc72a5a.jpg","description":"Visit Nekojishi Official Website!Visit Nekojishi official website!\nGet Your Nekojishi LINE Stickers!Get your Nekojishi LINE stickers! Search \"Nekojishi\" in LINE store.\nAbout the GameEver dreamed about having furry beast men hanging around with you? What if they are gods in your childhood bedtime stories? This visual novel gives you a chance to play a young man whose dream has come true, but also gets him deeply involved in the consequences.\nAlthough he was born within a religious family, college student Lin Tian-Liao has never thought about meeting three feline spirits.\nIt's never bad to have three lovely guys around, but life must be going on. Knowing his humdrum life has gone forever, Liao still don't know what his future holds. However, his story with three big cats has already began.\nWith his third eye accidentally opened, Liao can now see spirits that used to be invisible to him. However, their requests force Liao to decide for his future life. Lin Hu, the tiger patron god of Lin family wants Liao to go back home after his graduation. Likulau, a clouded leopard spirit from an Aboriginal Taiwanese tribe finds Liao is a good candidate for the tribe oracle. And Yan Shu-Chi, who is a colleague of Liao but now being possessed by a leopard cat spirit, is trying to get help from Liao to rejuvenate a countryside temple. Before Liao could understand what’s going on, his brand new daily life is already on the track.\nSurprisingly, these gods appear from nowhere are not fuddy-daddy as Liao thought, letting him rethink the positive side of folk belief in the modern society. However, his course schedule doesn’t allow him to thoroughly interpret the traditional culture, and now it’s time for you to help him getting his decision.\nThe story of Nekojishi contains same gender romance plots.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team Nekojishi","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":43752,"name":"EA SPORTS NHL 18","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f90/f903702ba39094082dc136219b8c9b8b.jpeg","description":"EA SPORTS NHL 18 introduces the thrill and creativity of today's young NHL superstars through new Creative Skill Stick gameplay controls, a brand new 3-on-3 arcade-inspired hockey experience in *NHL Threes,* and the most multiplayer options to play cooperatively or competitively with friends ever delivered in a sports videogame.\r\n\r\nNew Creative Skill Stick controls let you execute the highlight-reel, jaw-dropping plays seen in the new NHL by the likes of Connor McDavid, Auston Matthews and Patrik Laine. On attack, all-new creative dekes freeze goalies and defenders with between-the-legs shooting, one-handed dekes, band-handed toe-drags and much more - including linked dekes for moment-to-moment decision making. New through-passing allows you to pass pucks into space for players to skate onto, or bank them off the boards to teammates and to yourself to beat a defender. On defense, the all-new Defensive Skill Stick lets you get creative on defense with poke check targeting, extended pokes, and controlled stick sweeps to cover zones of the ice and takeaway passing lanes. New Creative A.I. also means your teammates leverage all the same creative tools  as you, making for beautiful, intelligent decision-making all over the ice.\r\n\r\nIntroducing a bold new take on the insane, over-the-top action of 3-on-3 hockey with *NHL Threes* – an all-new arcade-inspired hockey experience with faster skating, harder hits, and pick-and-up-and-play fun to score big goals. Enter wild arenas with all-new commentary and pick your style of play, from fast-fun couch modes to fully competitive online team play where you choose the game rules and modifiers. Take on the *NHL Threes* circuit mode and play through regional circuits, from minor leagues to the big show, completing challenges and unlocking surprises along the way. NHL Threes combines the best arcade era fun with authentic 3-on-3 overtime action that is made to be played with friends.\r\n\r\nNo other sports game allows you to team up with friends and hit the ice like *NHL 18*. Whether you’re playing cooperatively or competitively, offline on the couch or online with up to 12 players, *NHL 18* delivers more than 64 combinations to team up with or against friends locally or online. Team up cooperatively with a friend on the couch and another friend online. Or play as a team with three friends on the couch and two friends online, all playing competitively against 6 other players online. No matter how you want to play, NHL 18 offers more ways to play multiplayer with your friends or against your rivals than any other sports videogame.\r\n\r\nExperience the brand new NHL first in *NHL 18* with the all-new Vegas Golden Knights as the 31st NHL team. Take on the head office role and be the first to draft the Golden Knights using the all-new Expansion Draft feature in Franchise Mode, complete with the authentic jerseys and arena. Or change the face of the league completely by creating and drafting an entirely new 32nd team wherever you choose, including the arena, logo, jersey, and even the mascot.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":34970,"name":"Chrome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7c/b7c78d278b88fccb0e78b0ecd70f009b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Techland","platforms":[{"id":0,"name":"PC"}]},{"id":31713,"name":"Duke Nukem 2","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f7/1f78f48d82229304bbcb46e3a773fb57.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Apogee Software","platforms":[{"id":0,"name":"PC"}]},{"id":22001,"name":"Metal Waltz: Anime tank girls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea5/ea5ee939e1ec73c212b951160c9aec41.jpg","description":"Metal Waltz\nis a military strategy game in multi-language, currently supports Chinese, Japanese, Korean, German, and Russian.\nBackground story\nIn 194X, human created a new creature, which were combined with animals and tank components, called Beast Tanks. This new kind of creature had amazing power, they were controlled via radio waves. Beast Tanks can be used for agricultural production and other production activities, of course, including war. However, one day human suddenly lost control of the Beast Tanks. The runaway Beast Tanks conducted destruction everywhere in the whole world, brought the human being an unprecedented catastrophe... ...\nMetal Maidens are the only hope of the human being to defeat the Beast Tanks.\nMetal Maidens is the product of the Walküre Project, which aims to transform humans in a similar fashion to Beast Tanks; with the same capabilities or better. Metal Maiden technology is divided into two types -- Body modification and Attires.\nBody Modification --A Metal Maiden core (an improved Beast Tank core) is implanted into the body, vastly improving the human body's limits and expanding neural networks to allow for control of external armor and appendages.\nAttires -- Armored combat attires similar to a Beast Tank's, developed as a robust and reliable armor utilizing their new capabilities; however, some attires are specifically developed for and only correspond to a specific type of Metal Maiden core.\nAs a side note: Men are, for some mysterious reason, unable to utilize any core at all, but not all women are able to as well; so both the selection and testing are rigorous and stringent.\nSome scholars believe the Metal Maidens are a new kind of creature. Some say that the Metal Maidens technique will lead to the fundamental change in mankind.\nIn the world of Metal Waltz you are a commander. You lead the Metal Maidens to fight against the Beast Tanks and explore the secrets behind the Beast Tanks at the same time.\nFeatures:\n1. The character voices in the game has 3 main languages: Chinese, Japanese and Korean. Our Japanese voice actors includes Sumire Uesaka, Aya Hirano and Ruriko Aoki.\n“上弹、瞄准、开炮！”\n\"目標確認、ファイア！\"\n\"목표물 확인，사격！\"\n2. Most of the roles in the game are animated by Live2D. Click on the girls, you can have interaction with them.\nT-34M：“Huh? Will you just stop clicking on my hairpin? It is made of real flowers!”\nM4A3E2：\"Would you tighten the screws on my back, Commander?\"\n3. In the early development phase, the development team flew to France to visit the famous tank museum Saumur Musee Des Blindes to study tanks. In the museum the team took over 5000 photos of the tanks.\nMuseum administrator: \"The museum will be closed soon. I've urged you three times to leave. I have to pick up my daughter after work. You know?\"\n4. There are over 250 different tanks from the period from WW2 to the early Cold War.\nDeveloper: \"No, there is no Merkava in the game. But it's also a kind of art to collect all Ausf. of Pz.Kpfw. IV.\"\n5. Different tank types use appropriate ammunition. Military fans will be satisfied with the huge tech tree, which was formed based on the history.\nDeveloper: \"AP, APDS, HE, RP, APCR, HESH ... we have them all.\"\n6. The story in the game has over 300,000 words. It is also not bad to regard the game as a novel.\nPlayers: \"No more story? Then I will stop pushing the battles forward!\"","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Shanghai JingCai Computer Software Development Co","platforms":[{"id":0,"name":"PC"}]},{"id":21952,"name":"WWE '12","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f4/1f464632acd78acaa09f328e9cf5a2fe.jpg","description":"THQ’s flagship franchise in the company’s WWE videogame portfolio is reborn, delivering the best and most realistic WWE action ever.  With new Predator Technology™, an overhauled gameplay experience and new broadcast TV presentation that promises the most fluid, dynamic, authentic and action-packed WWE simulation experience to date, WWE ’12 gives you more control over WWE than ever before.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"THQ","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":21767,"name":"Musaic Box","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a7/9a71446a16e4d9b0add47ae172b19d33.jpg","description":"Uncover all of your grandfather's sheet music, hidden in his home amongst a treasure trove of gorgeous antiques and musical relics. Melodious music box games will let you piece these special compositions together and unleash their symphonious secrets. Unlock Creative Mode and write your own outstanding arrangements. With a house full of secrets and a box full of music the aural excitement never ends.\nBeautifully rendered graphics\nEntrancing musical score\nUnlock musical mysteries!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"KranX Productions","platforms":[{"id":0,"name":"PC"}]},{"id":17864,"name":"InFlux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/372/37233c0fd03bb423af684276968d0ea5.jpg","description":"InFlux is a puzzle game that mixes exploration and platforming in a series of beautiful natural and abstract environments. You are a mysterious metal sphere which falls from the sky, traversing an apparently deserted island dotted with cubic structures of glass and steel. Each glasshouse is a puzzle to be solved.Key Features\nSit in a comfy chair and become as relaxed as you have ever been while playing a video game\nSolve a series of mind-bending cubic puzzle structures connected by...\nA series of beautiful, naturalistic hub world environments to roll around\nMeet a majestic and enigmatic humpback whale\nWorks great with keyboard and mouse or your Xbox 360 controller\nA completely original soundtrack by musical genius Jonathan Yandel","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Impromptu Games","platforms":[{"id":0,"name":"PC"}]},{"id":16660,"name":"Strategic War in Europe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ae/1ae5b5680e9aaf2df8ef733c21786b76.jpg","description":"Strategic War in Europe takes you back in time to World War 2.\nThis game is about:\nPanzer Corps\nWaves of Infantry\nWorld War 2\nLand, Naval and Air battles\nProviding supplies\nFollowing the 'easy to learn, hard to master' design principle, Strategic War in Europe combines accessibility with a plethora of strategic options. A compact, large-scale map and clear basic rules will not overwhelm you, yet the choices you will be presented with should satisfy all your tactical needs. From overthrowing governments and researching new technologies, to securing air supremacy and supplying your troops by water and railway, Strategic War in Europe is a strategist's dream.\nSeven scenarios with up to 25 controllable countries, each with five scaling difficulty settings make for an incredible replayability. When pitching yourself against the AI is not enough, Strategic War in Europe offers hot-seat and PBEM for all your multiplayer needs. Match your wits in an epic East vs. West showdown or try to survive together as Poland and Norway.\nMuster Your Panzer Corps!\nPrepare Waves Of Infantry!\nThe War Begins Now!\n\n\nMain FeaturesTake over one or more of 25 countries, ranging from Nazi Germany to Iraq\nPlay through seven unique scenarios, including six historical from 1939 to 1944, and a fictional 1945 West vs. East campaign\nCommand hundreds of historical units and leaders\nDeclare wars, host elections and carry out coup d'etats\nExperience dozens of historical events with great repercussions on gameplay\nEnjoy tactical battles, with weather, supplies and terrain all being important factors\nControl the skies with air combat, recons, fighter interceptions, bombardment, and even nukes!\nSail the seas using a naval system that includes convoys, raiders and sea battles\nManage economy and research\nFight against your friends in hot-seat and Play By E-Mail multiplayer modes","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wastelands Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":12385,"name":"Hyposphere","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bca/bca22536e2f6ce15348e9ba49792090d.jpg","description":"Hyposphere is not simply a classic \"marble\" platformer, it may also be the most beautiful, thanks to the power of the Unreal Engine 4, as well as the most difficult.\nA cunning artificial intelligence, along with the help of a clever virus, has taken over every computer in the world! There is only one chance to fight back: pass the tests generated by this dastardly digital demon!\nDare you accept the challenge and prevent the coming of the end of the information age?\nThere's only one way to find out: take control of Hyposphere and dive into the adventure!\nKey features:\n- Stunning graphics with the power of the Unreal Engine 4!\n- More than 100 levels!\n- Non-linear levels, which can be played in different ways!\n- S~E~C~R~E~T P~L~A~C~E~S!\nDuring the adventure you can collect a variety of bonuses:\n- Extra points, coins, and lives!\n- The ability to increase in weight and in size!\n- A special magnet for items!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Atum Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5458,"name":"PAIN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91c/91c006c1de2961e56d0b4aba0c45b1da.jpg","description":"PAIN is the cutest way to suffer. Take careful aim and make sure not to rush as you attempt to fling yourself up, one consequential leap at a time.Encounter some real oddballsMeet some strange characters and make some charming new friends on your way up and learn more about them each time you fall back down.\nA varied journeyTravel through different environments with their own unique twists on gameplay and explore every nook of the mountain to try and locate its many secrets.\nPAIN takes place on one large map, a fall could mean anything from dropping a couple of meters to a couple of miles.\nWhat lies at the top? There's only one way to find out...\nPAIN is inspired primarily by Getting Over It with Bennett Foddy and Jump King","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":1239,"name":"Flockers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/108/108759e8c2298c3db8a4403e8e01d191.jpeg","description":"For over nineteen years sheep have been an integral part of the worms’ fearsome arsenal. Held for years within the evil thrall of their diabolical masters the sheep are finally making a dash for freedom! Escaping the tyrannical worms, the flock must dodge its way past all manner of lethal machinery and traps as the sheep negotiate their path through the confinement of the Worms’ weapons factory out into the testing grounds and ever onwards towards pastures green.\nFlockers is a modern day take on the classic A to B puzzle genre with a generous helping of sinister foreboding and dark humour for good measure. Levels have been designed to challenge the player’s skill and strategic planning as they attempt to guide their flock past heinous traps, sadistic devices and diabolical puzzles; rewarding those that can save the most sheep while still allowing progression for anyone who falls foul of the factory’s deadly machinery.Key Features:\n60 gruelling & puzzling levels to master.\n6 bonus levels  - Psst... Hidden throughout the campaign levels are portals to a greener, more tranquil place. Discover them to unlock a new play mode where waking lazy sleeping sheep becomes the priority…\nRewards - Want a zombie sheep? You got it! Green blood? Yes sir.. There are a stack load of customisation rewards to unlock by fulfilling a wide range of objectives. Choose from 17 crazy skins and 6 types of blood.\nCreate your own levels - We’re including a powerful level creation tool, the \"Meat Maker\", that will give you the power to design your own deadly puzzles. (Currently only available on PC)\nSteam Workshop integration - Share your own creations with the community and play challenging levels created by other Flockers players.\nSteam Leaderboards - Players can compete against their friends and others in an attempt to get the fastest time on a level and the fastest time in the story mode.\nStar system - Player performance is assessed via a star rating system encouraging players to perfect each level.\nTwitch support - Share your sheep herding talents to a wider audience with integrated Twitch support.\nSteam Achievements - Demonstrate your gaming prowess and show off to your friends by earning Flockers achievements.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":589,"name":"Industry Giant 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/595/59587ab49ee650871476ce567d051572.jpg","description":"Economic booms, stock market crashes, oil crises, upswings, triumphs... Now you can become the greatest power in industry! Begin in the year 1900 with little money but large ambitions and through skilfull decision-making you can build up an enormous business empire. Make critical decisions which products you should manufacture, where to gather the best raw materials, where to sell them and how to effectively transport them there.\nIt's your choice whether you start out as a small-time fruit-growing framer with a little orchard and retire as the owner of the biggest foodstuff empire around, or end up owning a multinational conglomerate with a vast portfolio of products.FeaturesOver 150 real products from the 20th century\n50 different vehicles\n20 endless maps\nDetailled graphics and environment\nHistorical happenings like the magazineboom or prohibition\nIntelligent city growth – from small village to a huge town\nMotivating luxury feature\nCampaign mode with 20 missions for beginners and pros\nPro-Mode with all important dates and statistics\nFull HD Resolution\nSteam Achievements\nSteam Cloud Save","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":695797,"name":"Shuffle Party","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da8/da8e9e07aed467e409dc1ed4eead69ef.jpg","description":"Shuffleboard bowling has come to your Windows Phone with exciting new game modes! Shuffle Bowl provides the traditional bowling experience with beautiful 3D environments and easy to use touch controls. Master a series of physics puzzles in the exciting new Challenge Mode! Earn cash for your high scores to spend on custom pucks, pins, and game tables. Shuffle Bowl will bowl you over.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Babaroga","platforms":[{"id":0,"name":"PC"}]},{"id":484501,"name":"Kingdom Hearts: Melody of Memory","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa7/fa7e8ba1bca24d8ac299c8d04a0cef59.jpg","description":"Play as famililar faces from the KINGDOM HEARTS series, including Disney guest characters who will appear to lend you a hand.\n\nEnjoy a massive variety of music from both the KINGDOM HEARTS series and Disney, with a collection of over 140 songs. Dive into rhythm-action gameplay with memorable tunes in this can't-miss musical journey!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":442850,"name":"Old World","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/482/48251f9b936d47a4b5685c737267ee36.jpg","description":"Conquer the Old World in this historical, epic strategy game from Soren Johnson, Lead Designer of Civilization IV and Offworld Trading Company. Every year is a turn, and each leader is a mere mortal, so your lasting legacy will be the dynasty you leave behind.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mohawk Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":327211,"name":"Auto Chess","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/86c/86c4cfd81576dba6f0d2ee2d7a8dd97f.jpg","description":"Innovative gameplay\r\nThis is an innovative gameplay created by Drodo. By collecting/changing Hero cards, and arranging different formations, 8 chess gamers will be contending for the first prize in the following tens of minutes. Millions of players are challenging each other every day, and, it has become one of the most popular leisure gameplays nowadays.\r\n\r\nFair Play\r\nMake a real fair-play game! The World e-Sports Games are created by Dragonest Co.Ltd., Drodo, and lmbaTV. Million Prize Pool awaiting!\r\n\r\nStrategy Rules the World\r\nPlayers will randomly get their Heroes in the Sharing Cardpool, and form special formations according to their unique strategies. Evolution, combination, jockey for position etc. enable you to practice your strategies to the greatest extent. Who will be adaptable to the changing tide and survive till the end?\r\n\r\nGlobal Server\r\nNo matter where you come from, welcome to our world and challenge players from all over the world!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Dragonest","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":322364,"name":"Pupperazzi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a5/1a5dcac6ee73034c47b9fa9515f98744.jpg","description":"Welcome To Your Life As A Freelance Pupperazzo\n\nSnap photos of dogs while maintaining your social media presence. Will you hound celebrities in public, or would you rather be taken seriously as an artist? Perhaps you just want to show your friends the cute dog you saw while you were out. It's your choice which direction your career goes, don't screw up!\n\nDodge between people and obstacles as you try to capture canine beauty on everlasting digital photos. Double jump across buildings to get that lucrative shot of a local dog celebrity just trying to live their life. Slow motion zooming helps capture mid-air moments that actually make you feel something.\n\nWhen you finally give up your dreams of a stable life as a photographer, commiserate with other amateurs through local multiplayer dog-spotting competitions.\n\nTrue beauty comes from within, but we think in-game photos are major competitors.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sundae Month","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":52815,"name":"Command & Conquer","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c62/c62e21b805e3f4c13e99702d2eca6a65.jpg","description":"Command & Conquer (abbreviated as C&C or CnC) is a real-time strategy (RTS) video game franchise, first developed by Westwood Studios. The first game was one of the earliest of the RTS genre, itself based on Westwood Studios' landmark strategy game Dune II and introducing trademarks followed in the rest of the series. This includes full-motion video cutscenes with a notable ensemble cast to progress the story, as opposed to digitally in-game rendered cutscenes. Westwood Studios was taken over by Electronic Arts in 1998 and eventually closed down in 2003. The studio and some of its members were absorbed into EA Los Angeles, which continued development on the series.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"SEGA Saturn"}]},{"id":49057,"name":"Animal Super Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/097/0978ea5ba04bf0545ab9c126da2878a6.jpg","description":"No matter who you are you might as well ask your mom for an advance allowance cause you’ll want to buy Animal Super Squad by the time you’ve finished reading this.\nPlay as a chicken. Or a sloth. Or even a freaking blowfish\nChoose a ridiculous vehicle - like a toilet on wheels or like a flying propeller attached to your butt\nGet to the other side of the level to win, you know how this works, you’ve played games before I don’t need to explain this you’re on the internet, jeez\nUnlock stuff yourself instead of just getting it handed to you by the government, like a useful tinfoil hat or a dead octopus on your head\nDon’t cake your pants\nA custom level editor gives endless replayability by letting you make your own levels, and also play other people’s levels, you know how level editors work too, just stop reading this and buy the damn game\nVery cool physics-based gameplay that is 100% accurate in any situation, I don’t really know how physics works though i wasn’t paying attention in school\nBasically you’re far better off playing this game than whatever else you’re doing with your time and your mom’s money, which is probably buying economy glue in bulk.\nBut seriously, don’t eat anything with chemical solvents in it, it messes with your mind,\nWe’ve poured our hearts, souls and butts and money actually all our savings (yes our glue savings) into this game so we really hope you’ll enjoy it. Sometimes the work hours get long, but that’s no excuse to start eating glue seriously - that stuff will mess you up\nyou can play.. you choose your chicken, then you choose like a plane or a hover tank or whatever you want to ride, then you put on a goofy hat and you hit the gas buddy\nthen you try to get to the end of the level to unlock the next level and you also get maybe a new vehicle or at the least a new hat for your head to show your mom\nok that’s it that’s pretty much the whole game. im gonna go eat some gl","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"DoubleMoose","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":21310,"name":"Vegas: Make It Big","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/978/97865d4591a0d9802b94c04bbc9b403f.jpg","description":"Develop a state-of-the art Las Vegas resort complex, using all the money and management skill you can. Customers on the living, breathing Las Vegas boulevard are Notoriously hard to satisfy - can you win the hearts and wallets of Vegas?\nAmazing real-time 3D graphics show off your resort to the max. Experience grand panoramic views, or get up close and personal to fine-tune the inside and outside of your perfect Vegas paradise.\nFulfill the needs of 5000+ individual guests\n500+ vehicles include cars, taxis, limos and helicopters\n10 resort styles, inspired by amazing cultures and themes\nRelaxed attractions provide a welcome break\nCreate a wedding chapel on the spur of the moment\nBreathtaking rides and attractions\nUser friendly controls make resort construction simple\nFully customizable - adjust goals, competition and difficulty\nDevelop not just the outside of your resort, but the inside too\nHire and fire staff, based on true-to-life skills and qualities\nAdjust the stakes in your favor and Make It Big!\nVEGA$: Make It Big © 2003 Empire Interactive Europe Limited. Designed and developed by Deep Red Games Limited. Empire, \"E\" and Make It Big are trademarks or registered trademarks of Empire Interactive Europe Limited in the UK, Europe and/or other countries. All other trademarks and trade names are the property of their respective owners. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Deepred","platforms":[{"id":0,"name":"PC"}]},{"id":20784,"name":"Daedalus - No Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad2/ad20f1f04ffa11466db5f1da674251cd.jpg","description":"Ever wanted to play Unreal tournament or Quake 3 Arena from a top down 2D perspective ? Daedalus - No Escape brings you exactly that, the same feel and control as in an arena FPS but from top down, in a dark sci-fi mood inspired by Alien Breed.\nIn control of a space marine, walk the arena and defeat your opponents using powerful weapons. No feelings, no mercy, only your gun does the talking.Features single player, multi player\ngame modes: highscore, deathmatch, last man standing, team deathmatch, capture the flag\nonline leaderboard\ndifferent control schemes: FPS-like, fixed camera\n9 cool weapons\nlots of maps\nmap editor\noriginal soundtrack\nwindows, linux and mac support","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Patrice Meneguzzi","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20506,"name":"Castle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b98/b98c2d1e8e64ddec1f5821348a68803d.jpg","description":"Castle is a visual for adults only! In this game, you will be told the story of a hot whore, Rosa, who suddenly woke up in a very strange castle. She has to pass two tests to stop being a whore! The game is filled with sex scenes, humor and romance.\nIn this cool game you will plunge headlong into the story of a castle... Whore Rosa woke up in the dungeon of the castle. There she met one of the workers of this castle, who gave her different tests. And what happened next you will see in the game itself. Get real pleasure from a very simple gameplay and cool music.\nBeautiful graphics!\nRelaxing music!\nExciting sex scenes!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mikoko","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20390,"name":"Agricultural Simulator 2013","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccc/cccf9fdd24575731a4405653f9289c8c.jpg","description":"Best In Farming!\nAn idyllic farming environment surrounded by inviting & untilled mountain panoramas set in the beautiful landscapes of Tuscany, The Alps and USA await all fans of the Agricultural Simulator series.\nAt their own farm hobby-farmers undertake the daily tasks and challenges of a professional: The production of food, sustainable resources and delivery of eco products all have to be managed.\nFields have to be worked and farm animals cared for. The dynamic ground makes the whole game more realistic! Future farmers have to invest tactically and with foresight – the rapid spend of budgets by running costs and seed bills must not be underestimated. To realize a profit takes financial and tactical skill.Key Features\nIncluding  Interactive Tutorial\nIncludes 4 Maps\nIncludes more than 100 machines\nFree placeable building including:\nSolar Energy Plant\nGreenhouse\nWindmills\nDung Tank \tExtensive Help System, including Transport tasks\n6 different animal species","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Actalogic","platforms":[{"id":0,"name":"PC"}]},{"id":18669,"name":"Immortal Empire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/533/533a83e62ba758dcaa1b20e3fa6394cd.jpg","description":"Immortal Empire is a multiplayer tactics role playing game. Control a party of up to 5 immortals as you travel through a unique fantasy world, using spells and strategy to defeat your enemies.\nFeatures\nPlay co-op with your friends, or destroy them in versus mode.\nUnravel a mysterious storyline complete with fully voiced characters in the campaign.\nUse automated matchmaking to compete in the PvP ladder.\nParticipate in official tournaments and win rewards.\nChoose between 13 unique immortals, level up, collect loot, enchant your gear to fully customise your party.\nYour dialog choices matter, the way you behave may form relationships or grant powerful character attibutes.\nTry the challenging co-op Gauntlet mode where you must work together with other players to defeat enemy waves of increasing difficulty.\nUse strategy and synergize spells to defeat challenging bosses.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tactic Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17042,"name":"Lost Civilization","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ee/2eeb7ca2441db2e01c7b12b124b4d254.jpg","description":"Race to unearth the mystery of a forgotten civilization and rescue your kidnapped fiancé in this atmospheric adventure, suitable for beginners and diehards alike, which features a haunting blend of puzzle-solving and investigation. As amateur archaeologist Sarah, journey from the dark corners of Prague to the forgotten chapters of Mayan civilization as you solve clever puzzles and unravel ancient secrets that could lead to proof that alien life exists on Earth. Featuring over 120 richly-detailed and animated scenes, haunting sound effects, and a refreshing variety of challenges ranging from point-and-click adventuring to hidden object challenges, the fate of the world rests in your hands.\nFEATURES\nHaunting storytelling and atmosphere\nArchaeology adventure suitable for all skill levels\nBlends engaging puzzles and hidden object challenges\nOver 120 richly-detailed scenes and 30 interactive characters\nAtmospheric sound and musical score","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Icarus Games","platforms":[{"id":0,"name":"PC"}]},{"id":12134,"name":"Software Inc.","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/629/6298e694224be51917e7f4ad475f5b09.jpg","description":"Construct and design buildings for optimal working conditions. Hire people to design and release software, so you can defeat the simulated competition and take over their businesses. Manage and educate your employees to make sure they are skilled and satisfied with their job.\nCURRENT FEATURES\nBuild, furnish and maintain office buildings up to ten stories + basement, on an enormous land, using a free-form building system with easy copy-paste tools\nHire employees to design, develop, support, research and market software in teams\nBuild roads and parking to ease commuting for your employees\nTend to your employees' needs, demands, skills and specializations, while making sure each team has compatible personalities\nCustomize your own employee avatar\nCreate your own software products and franchises\nCompete in a simulated and randomly populated market by selling your products, taking on contract work, creating patents, making deals or trading stocks\nHire staff to repair your furniture and computers, clean your office, make food for your employees or greet visitors\nMod what kind of software you can develop, add your own furniture, upload your building blueprints or add support for your language\nDelegate important tasks to your team leaders, such as managing development cycles and human resources\nSet up your own servers for products, source control and running your own online store","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Coredumping","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]