[{"id":528657,"name":"Morkredd","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84e/84ec995165fd1c9381a0b04dd17de6d0.jpg","description":"The Orb is your fate...\nThe Orb Calls for Two\nMorkredd is best played as a couch co-op experience. Heed the Orb’s call with a friend or prove your loyalty alone by mastering the unique dual-character controls.\nYour Path is the Orb\nYou are the Orb’s protector, and the Orb’s light is yours. Survive and master over 60 puzzles while avoiding the shadows caused by your partner and the environment.\nThe Orb is Your Only Friend\nAn endless abyss of deadly shadows conceal dangers in this cold, dark world. Stay with the Orb if you want to stay alive.\nGaze into the Orb\nDiscover ancient secrets about the Orb hidden in the darkness.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hyper Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":397481,"name":"The Survivalists","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b3/1b3680c0604d4e3c65fc883fd6ace209.jpg","description":"A World of Adventure and Possibilities\n\nThe island is alive! Your newfound home will change with day/night cycles as you explore and uncover its secrets. Hunt (or be hunted by!) animals for food and meet the local inhabitants, who aren’t necessarily pleased to see you. Get quests from a Mysterious Stranger or find them washed up on the shore. Prepare to trek into a procedurally generated wilderness, with a variety of biomes, for an adventure that’s unique to every player.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Team17 Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":43252,"name":"The Witcher 3: Wild Hunt – Blood and Wine","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b51/b51c3649322ac0de9dfbe83435eda449.jpg","description":"Welcome to the land of summer, a remote valley untouched by war. The land of wandering knights, noble ladies and magnificent wineries. What better time to visit than now, when this kingdom of virtue is torn apart by a series of savage massacres! Geralt of Rivia, a legendary monster slayer, takes on his last great contract. Blood and Wine offers over 30 hours of adventure, where beauty clashes with horror, and love dances with deceit.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":18741,"name":"ArcaniA: Fall of Setarrif","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/342/342c6554dca0c269f552c76574efba6b_0XqtdoX.jpg","description":"Face the last challenge - determine destiny!\nA new threat casts its shadow over the Southern Isles. A mysterious demon, consumed by hatred, terrifies the population and pools his force against the coastal city of Setarrif. The dramatic situation exacerbates after a volcanic eruption in the mountains nearby. Thereupon the nameless hero joins forces with his strongest allies and courageously faces the new menace.\nEven after king Rhobar III was freed from the demons control, the struggle apparently is not over. The king already ordered his armies to conquer Setarrif, but so far no word from his troops, or the frantic population for that matter, has gotten through.\nExperience an all new adventure amidst demonic powers, political intrigue and inscrutable incidents – what’s really going on in Setarrif?\nFeatures:\t\t\t\t\t\tExperience a new, compelling part of the chronicles of Argaan\nPlay parts of the story from your famous allies’ perspective\nAll new enemies as well as new armors and weapons to further expand and hone your combat skills\nMeet new, lively characters when exploring the (yet) unknown regions & dungeons\nStand-alone expansion\nPlaying time: 4 – 8 hours\nImport your character from the main game (with a character that killed the endboss of ArcaniA main game)\nNew locations and settings (lava/beach/dungeon)","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Spellbound Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":2003,"name":"Deep Dungeons of Doom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c11/c1113f7f7b951d787f3e1061a547ccdc.jpeg","description":"You’re Going Down! Enter the Deep Dungeons of Doom if you dare…\nThis game is only for the brave. Dungeons await, each one deeper, each one more perilous and each one more challenging than the last.\nYou will meet monsters and you will need skill and tactics to defeat them. You will find weird and wonderful treasures along the way. Most will help you, but some might not. You may choose to play as a Crusader, a Witch or a Mercenary – in fact each one might well be required if you are to successfully complete your quest – but knowing when to use each one is something you are going to have to figure out for yourself.\nThe reward for your endeavours? The Deepest Dungeon of Doom. Never before has such evil existed on such a massive scale. Only the most battle-hardened rogues will stand a chance of making an impact.\nGame Features:\n• Relive the 8-bit era with super-stylised visuals, music and SFX\n• Simple gameplay with a wicked learning curve\n• Choose from 3 characters, each with their own unique abilities\n• Battle monsters in increasingly deep and difficult dungeons\n• Explore a world of magic, evil, power and redemption","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":244806,"name":"The Shapeshifting Detective","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/665/66500faeb6c5cccdb4eb70c5b9e03bd7.jpg","description":"The Shapeshifting Detective is a supernatural-noir murder mystery FMV game where you play as a detective who can shapeshift into other characters, allowing you to unlock secret conversations and private encounters.\nDorota Shaw is dead. And the prime suspects are three tarot readers with the uncanny ability to predict murder - or commit it. It’s your job to find out what else they know - but they won’t reveal their dark secrets to just anyone… Luckily, you can be anyone you want to be. Even the next victim.\nThe game features more than 1600 full HD video responses, a simple questioning interface with unique ‘delete’ mechanic, and a randomly chosen murderer at the start of the game. Developed by the World Record-breaking makers of \"\"The Infectious Madness of Doctor Dekker\"\".","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wales Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":40302,"name":"Scott Pilgrim vs. the World: The Game","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/313/3131eaaea9b3e6f69763a150b5a4cdf6.jpg","description":"SCOTT PILGRIM is the ROCK-N-ROLL ACTION LOVE-STORY for the 8-BIT GENERATION. Scott Pilgrim is a lovable loser and the best fighter in the province. He is in love with Ramona Flowers. But she has baggage! To get the girl, Scott must defeat the League of Ramona’s evil exes. Be prepared for some serious action... - Team-up with up to 3 of your friends as SCOTT, RAMONA, STEPHEN and KIM, each with their own signature moves and attacks. - 8-BIT animations by the world-famous Pixel Artist PAUL ROBERTSON. - More than 30 original music tracks by chiptune heroes ANAMANAGUCHI. - Unlock secret modes  - Collect up to 12 achievements and 200 gamescore. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":38491,"name":"Sam & Max: Episode 204 - Chariots of the Dogs","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/233/2337379ff6a23784a95f3e1f9a0d0b6d.jpg","description":"Sam & Max 204: Chariots of the Dogs is the fourth adventure game in the series of the same name. \n\n###Plot\nThe plot is about the events happened to Sam and Max — they are personas of Steve Purcell's comics. In the game, Bosco, the severely paranoid and conspiratorial thinking owner of Bosco's Inconvenience store, disappears.\nSam and Max try to track him down; when they do, they discover a strange organization called T-H-E-M. The interior motif of the Chariots of the Dogs is time travel and aliens. The characters are caught by a flying saucer while investigating the case. They find a high-tech elevator that allows them to travel in time. Sam and Max begin to move between several time periods, simultaneously trying to fix the passing paradoxes. \n\n###Gameplay\nThe player performs as the anthropomorphic dog Sam and a hare called Max, detectives from the Freelance Police. The player aims to solve various puzzles, complete tasks, and choose between options given in branched dialogues. All of them lead to the final puzzle, so the player should take sidelong thinking to finish the game. \n\n###Key features\nThe dialogues between characters have the usual TellTale sense of humor; there are a lot of plot twists and callbacks. The game also has original soundtracks. All of the actions happen in the 3D parody universe.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":38197,"name":"Sam & Max: Episode 201 - Ice Station Santa","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa7/fa7b3a577434d244580f562ba5d94c08.jpg","description":"Sam & Max 201: Ice Station Santa is the first episode of a graphic adventure game Sam & Max Beyond Time and Space based on self-titled media franchise. It is a sequel to Sam & Max Save the World.\n\n###Story\nThe game follows two friends and freelance policemen: an anthropomorphic suit-wearing dog Sam and “hyperkinetic rabbity thing” (as described in the source material) Max. It takes place one year after the event of Sam & Max Save the World. The story begins with a giant robot attack on their office. After the heroes defeat the robot, they find out it was a present from Santa Claus, so they decide to travel to the North Pole where they discover panicking Santa who barricaded himself in his workshop and threatens the elves with firearms. Sam and Max decide to find out the reason for Santa’s distress as well the cause of the robot attack. \n\n###Gameplay\nJust like the previous game, Sam and Max Beyond Time and Space is a point-and-click adventure with a heavy emphasis on story and comedy. Throughout the game, you explore different locations, solve puzzles, interact with other characters. Although the core gameplay is identical to Sam and Max Save the World, there are some new features in the sequel. One of the most notable is that the game now has a hint system which you can adjust in the main menu. Aside from the main point-and-click constituent of the game, there are some mini-games such as driving sequence or a boxing match.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10516,"name":"The Age of Decadence","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/949/949a970eaf4304dfcbe33c29f77a01ef.jpg","description":"The Age of Decadence, our first but hopefully not the last RPG, is now available. If you've been following it or playing it in Early Access, you know what to expect. If you've just discovered it, \"stay awhile and listen\". The most commonly asked question is:What Kind of Game Is It?\nIt’s a very different game than anything you’ve ever played. I’m sure you’ve noticed that the RPG genre hasn’t really been explored yet and most RPGs follow the formula that didn’t change in 20 years. While there were always games that strayed off the beaten path – Darklands, Planescape: Torment, King of Dragon Pass – such games were the exceptions that only reinforced the rule.\nThe Age of Decadence is an experiment, an attempt to explore a different direction, taking you back to the PnP roots of the genre. It doesn’t mean that the game is awesome. In fact, there is a good chance that you won’t like it, precisely because we took too many liberties with the established design.\nSo What Sets The Age of Decadence Apart From Other Games?1. The Setup\nTraditionally, many fantasy RPGs are about killing things, clearing up dungeons, and being a hero. There is nothing wrong with mindless fun and wish fulfillment, but we want to offer you something different. To quote Tom Chick (Quarter to Three's game critic):\n\"But Age of Decadence wants nothing to do with kobolds, just as it wants nothing to do with Doo-dads of Unimaginable Power. The overarching idea is a crumbling society divided among three noble Houses, each fumbling around in its own version of darkness to comprehend what destroyed the world. That’s the central mystery. It plays out like noir in that you are the detective, piecing together what really happened from differing accounts, all vividly written with clear voices and efficient prose. And like a detective in a noir yarn, you can’t help but become part of the central mystery, effecting an outcome you might not have intended.\"\nThe Age of Decadence is not a game about killing monsters or exploring mystical lands, but rather, surviving amid the greed and brutality of your fellow humans and carving out a name for yourself. Good and bad are purely relative. It’s a world of scheming and backstabbing in which your words and actions have the potential to forge alliances and sow discord, and your path is never certain.\nYou get to play with seven different factions: three Noble Houses and four 'professional' guilds: merchants, assassins, thieves, and the army, all fighting for power or influence; over 100 named characters, over 750 ‘generic’ characters with unique IDs taking part in violent take-overs, assassinations, and power grabs, and over 600,000 words of dialogue: a well-developed and thought through world, believable characters, realistic motivations, but no elves, dwarves, magic, and wizards in fashionable, pointy hats.2. Combat difficulty\nAnother design aspect worth mentioning is combat difficulty. It’s a hard game.\nCombat difficulty is integrated into the setting. You can’t say that the world is harsh and unforgiving and then let the player kill everyone who looks at him or her funny. The game has to be hard, dying should be easy, and you should have reasons to pick your fights.\nYou aren’t a powerful hero who can defeat anyone and save the world and it is the difficulty that reinforces this notion. Make the game easier and we’re back to the powerful hero setup. So unless you’re a natural born killer, watch what you say and think before you act or you’ll end up dead before you can blink.3. Choices & Consequences\nChoices are what the game is all about - crafting your own narrative via a variety of choices that alter the story, playing field, and your options down the road. From multiple quest solutions to branching questlines you'll have plenty decisions to make and consequences of said decisions to deal with, which is what makes the game incredibly replayable.\nStarting the game as a mercenary and joining the Imperial Guards will give a completely different experience, different quests, different content and points of view than, say, playing the game as a merchant (less buying low and selling high, more scheming and plotting to gain advantages for the guild), a praetor serving a Noble House, or an assassin.\nThe questlines are interwoven, forming a large, overarching story, so playing the game only once will be like witnessing events from a single perspective, which is limited by default. You will have to play the game several times to better understand what’s going on, piece everything together, and see the full effect of the choices you make.The Big Question: Should You Buy The Game?\nTry before you buy. Even if everything I said sounds exactly like your kind of game, try the demo first. That’s what it’s there for. It gives you access to the first Chapter, consisting of 3 locations and about 30 quests split between mutually exclusive questlines and decisions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Iron Tower Studio","platforms":[{"id":0,"name":"PC"}]},{"id":10354,"name":"Painkiller: Resurrection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24e/24eb6765b9ae1cbca2f2521eaa507fc1.jpg","description":"William \"Bill\" Sherman has a problem - he's dead. Blown to pieces by his own C4 payload, which he wanted to eliminate a South American druglord with on behalf of some shady secret service people. The fact that he accidentally blew a bus full of innocent civilians into the Great Beyond has given rise to an all new problem - Hell doesn't exactly have any problems with claiming his soul. But now Bill's in purgatory and he's caught the eye of heaven's warriors. He's been offered a chance to make good the havoc he wrought using his quite special skills. And with weapons of course. Bizarre weapons. Crazy weapons...The GameDeveloped by Homegrown Games with former developers and modders from the previous Painkiller games in collaboration with Studio Med-Art and with a Catholic priest advising, Painkiller Resurrection combines rock-hard, no-frills action and an exciting story with painstakingly researched details. In a bizarre world influenced by medieval ideas about hell and purgatory and Dante's Inferno, the mixture of fast, straightforward levels and enormous, explorable regions containing the worst scum of any hell provides a unique gaming experience.\n\nUnique storyline told using top quality \"graphic novel\" style cutscenes\nCompletely reworked \"Painkiller 2.0 engine\" with shader effects, weather systems, a superb physics engine, and ultra-fast netcode, including an anticheat system\nThe best weapons from all of the Painkiller titles + new, inventive tools of death\nClassic-style FPS levels and enormous, explorable areas provide varied gameplay\nCountless eSports-grade multiplayer modes with numerous new and updated maps","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Homegrown Games","platforms":[{"id":0,"name":"PC"}]},{"id":20250,"name":"Hacker Evolution: Untold","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/290/2907c5b4fa6ff5fe76f0927145549aec.jpg","description":"Hacker Evolution: Untold is an indie-hacker puzzle game with a high focus on non-linearity and decision-making.\n\n###Gameplay\nAll gameplay is just clicking the objects on the screen and watching the computer code compile and in front of player's eyes. The game also features some keyboard input to choose between the targets to hack. There is a set of objectives in each level one have to accomplish for example — fool the security system, access the enemy servers and transfer the information from one device to another.\nThe game features real commands from programming on Linux.\nThere is also a highly customizable level creator, so the total amount of levels one may accomplish and come through depends on the other users. \nThere is also a money system introduced to the game with no meaning whatsoever — one cannot buy anything hacker-useful for them.\n\n###Plot\nThe developers got inspiration from multiple conspiracy theories and philosophical conceptions— this led to the narrative utilizing the theme of AI gaining control over the human race with the protagonist forced to conquer the mutinous robots. We play as Brian Spencer whose quest is to get unframed from the crime he did not commit. Not only androids are standing on the way of humanity, but the economic and political situation in the world keeps getting worse experiencing multiple crises.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"exosyphen studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18435,"name":"MANDAGON","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/295/2959ffa285945cc9a3bdc480bd3595e4.jpg","description":"Explore Mandagon, a world inspired by Tibetan theology and philosophy. With a focus on life and death, discover what it means to make a true sacrifice.\nTraverse a vivid interpretation of Bardo, the Tibetan word for limbo. Learn what experiences brought you there and what forces pull you through . . .\nNon-linear exploration in a 2D world\nImmersive environment\nAtmospheric sound design\nEmphasis on in-game storytelling\nNarrative led experience\nThis little DLC pack contains a digital art book pdf showcasing in-game art, concept art and other thematic illustrations.\nThe soundtrack will consist of a single 22 minute composition designed as a meditation aid or guide. Provided in flac and mp3 format.\nWe’ve also included 4 desktop backgrounds in 16:9 (1920 x 1080) and 16:10 (1920 x 1200)\nLastly there’s a ‘print and build a paper cube fella’ A4 printout for the arts and crafty types out there!\nTo locate the DLC please follow these instructions -\nRight click (Ctrl+Click on Mac) Mandagon in your library, then select Properties>Local Files>Browse Local Files. This should take you right there.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blind Sky Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17980,"name":"X3: Reunion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da8/da840a45bceef305e577525e31c2a6c4_uIQGg3p.jpg","description":"X3: Reunion is the third game in the X series of futuristic space exploration simulators. It is set in the X-Universe, a science fiction world that includes over 100 interconnected star systems.\r\n\r\n###Plot\r\nThe game continues the plot of its predecessor X2: The Threat and follows the same protagonist, Julian Gardna, a space pilot from the year 2935. A former pirate, he helps the Argonian military to train pilots. The Argon Federation is at war with the alien race called Kha'ak, who wiped out much of the Argonian fleet. Julian has to uncover the secret reasons behind the Kha'ak invasion and to restore the jump gate that leads to the original Earth, which means that the Terrans finally appear in the X universe. The protagonist also has to save his father Kyle who is wanted for alleged crimes by the Paranid civilization.\r\n\r\n###Gameplay\r\nX3: Reunion is set in the open world that the player can freely explore. He or she can follow the storyline or abandon it and follow the side quests instead. Most of the time the player controls the main character's starship. The protagonist can change his ship and use a different vessel that fits for different missions, such as a battlecruiser, a carrier, or a scout ship. The player can mine and trade resources, competing against the AI players, to earn money and status. As the player improves his or her status and reputation with various factions, the new ships and upgrades are unlocked.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Egosoft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3111,"name":"WWE 2K16","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/884/884e6a520b60aac011a38f4954303448.jpg","description":"The authority in WWE video games returns with WWE 2K16!  The newest addition to the flagship WWE video game franchise will deliver fun, authentic and hard-hitting action, including returning fan-favorite features and game modes, new innovations and more!  Play as the greatest WWE Superstars, Divas and Legends of all time. Includes all DLC content!\nKey Features:\nLargest Roster Ever:Offering more than 120 unique playable characters, including cover Superstar Stone Cold Steve Austin alongside Seth Rollins, Daniel Bryan, Dean Ambrose, Bad News Barrett, Paige and Finn Bálor, WWE 2K16 includes the largest roster in WWE video game history.\n2K Showcase: The franchise’s popular story-based mode returns in WWE 2K16, enabling players to relive iconic matches and moments in WWE history. Along the way, they will complete objectives to unlock legendary characters, entrance and ring gear, match types and unlockables.\nWWE Universe: WWE 2K16 makes core improvements to stories, rivals and match card selections. In addition, for the first time, Superstars can be assigned to multiple shows, enabling players to have a broader experience.\nAll DLC Included: WWE 2K16 includes all of the DLC.  Gain access to the following bonus content:\nArnold Schwarzenegger as The Terminator: Play as two playable versions of Arnold Schwarzenegger as the Terminator: T-800 from The Terminator and T-800 from Terminator 2: Judgment Day.\nMyPlayer KickStart: Players will gain instant access to boost created Superstar ratings and attributes in the game’s MyCareer mode.\nAccelerator: Players will gain instant access to all unlockable content available in the game (excluding downloadable content).\nNew Moves Pack: More than 30 new moves, including the Corner Enzuigiri (made popular by WWE Diva Nikki Bella), Avalanche Ram (made popular by WWE Diva Paige), Sidewinder Suplex (made popular by WWE and NXT Superstar Kevin Owens).\nLegends Pack: Playable WWE Legends: Big Boss Man, Dusty Rhodes, Lita, Mr. Perfect, “Rowdy” Roddy Piper and Trish Stratus.\n2015 Hall of Fame Showcase: Playable matches and Superstars include:\n“Macho Man” Randy Savage vs. Jake “The Snake” Roberts\nRikishi vs. The Rock\nAlundra Blayze vs. Paige\nLarry Zbyszko/Arn Anderson vs. Ricky “The Dragon” Steamboat/Dustin Rhodes\nTatsumi Fujinami vs. Ric Flair\nThe Bushwhackers vs. The Natural Disasters\nThe Outsiders vs. Harlem Heat Future Stars Pack: Playable WWE/NXT Superstars:\nSamoa Joe, Diego, Fernando, Blake, and Murphy","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":60634,"name":"Cube Escape: Paradox","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/121/121ce998d64729c47608f6943ff9d4cc.jpg","description":"When the infamous detective Dale Vandermeer wakes up in an ominous room without any recollection of his past, he soon finds himself part of a bizarre game orchestrated by an old foe. Dale must solve increasingly challenging puzzles to escape the room and recover his memories.\nCube Escape: Paradox Features:\nA unique, never-before-seen, game/film crossover experience\nThe absorbing gameplay, atmosphere and wealth of puzzles fans would expect from the tenth Cube Escape game\nA ton of connections and interactions with Paradox - A Rusty Lake Short Film\nThere will be two different chapters available (one for free and one premium) with multiple endings\nBeautiful paintings handmade by Johan Scherft\nImmersive and atmospheric soundtrack by Victor Butzelaar\nPowerful voice-overs by Bob Rafferty and lead actor David Bowles\nSupporting 14 different languages","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rusty Lake","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":38456,"name":"Sam & Max: Episode 203 - Night of the Raving Dead","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e34/e34401ace14ecb65e2997eb5c9b377fa.jpg","description":"Sam & Max 203: Night of the Raving Dead is the first adventure game in the series of the same name. \n\n###Plot\nThe storyline follows the adventures of Sam and Max, characters of Steve Purcell's comics. In the game, New York’s streets are flooded with dangerous dancing zombies. Sam and Max are working in the Freelance Police. Their goal is to kill all the zombies and confront their leader, a European vampire. The characters try to find a resolution in Stuttgart, Germany. \n\n###Gameplay\nThe player performs as the anthropomorphic dog Sam and a hare called Max. The player's goal is to solve puzzles - Sam and Max are in fact detectives - and complete various tasks. There are the usual branching dialogues which let the player make decisions, choosing between the given options. \n\n###Key features\nThe game is set in a parody 3D-universe based on typical stereotypes about Germans: Night of the Raving Dead mocks Germans lacking any sense of humor, classic vampire stories like Frankenstein, and the main antagonist, an emo-like vampire. The dialogues between characters have the usual TellTale sense of humor; there are also some plot twists. Jazz soundtracks also complement the game.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":28958,"name":"Wolfenstein","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/40b/40b894b07c4f8b30c4324361490d3c0b.jpg","description":"Wolfenstein™ brings the Nazis dark obsession with the occult to life with epic action and harrowing shooter combat. Use a powerful arsenal of both definitive and occult-enhanced Axis and Allied weapons to beat back a supernatural Nazi force that is full of surprises.\n\nPlay as BJ Blazkowicz, a highly decorated member of the Office of Secret Actions (OSA). You are sent on a special mission into the heart of the Reich to investigate evidence that the Nazis may possess a new and mysterious power. While behind enemy lines, you discover the Nazis have done much more than develop a new toy. The Nazis are harnessing the power of the Black Sun through a dark parallel dimension called The Veil; in order to create a weapon of war-ending mass destruction. You are the only one that can stop them and save the world from their perverse domination.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":17977,"name":"Spirits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a71/a71f3dc234728188f8f1fd248877e55d.jpg","description":"Spirits is an indie adventure platformer developed by Spaces of Play. The game is heavily inspired by Lemmings.\n\n###Plot\nAutumn is coming, the leaves become yellow and fall off the trees. The spirits of the fallen leaves go on their journey home.\n\n###Gameplay\nThe players have to guide a group of fallen leaves spirits to a better place. The spirits can be commanded through changing the direction of the wind or building new paths. \n\nIt is possible to sacrifice the leaf spirits to build a bridge out of leaves, make a wind-blowing cloud, dig out tunnels, and block the winds. The players have to use that feature carefully as using all of the leaves will result in a player's defeat and the further restart of the level. It is up to you to find your own creative way of completing a level and get the leaf spirits to an exit off the level.\n\nThe game is specifically designed in a way that the determination and working out of your plan is much more harder than the plan's execution itself. There is a lot of moves that the spirits can execute, but are not as obvious as the players think they are. It is a process of trial and error for the players. \n\nThe developers put a heavy emphasis on the relaxing aspect of the game, as its color palette features mostly warm colors such as orange, red, and yellow and its soundtrack was specifically made a little bit silent to not distract the players.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Spaces of Play UG","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":38418,"name":"Sam & Max: Episode 202 - Moai Better Blues","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f8/2f863c54b1e9fcefa88d9662c59aae15.jpg","description":"Sam & Max 202: Moai Better Blues is the second episode of a graphic adventure game Sam & Max Beyond Time and Space (released initially as Sam & Max: Season Two). \n\n###Story\nAfter the events of the first episode, Sam and Max return to their office from the North Pole and find their friends Sybil and Abe chased by a triangular portal, that eventually sucks in the heroes and their friends. After that, they find themselves on Easter Island, where a Moai Head tells them about a prophecy. According to it, the Island is about to be destroyed by a volcano eruption. Now Sam and Max have to prevent the catastrophe and save the Island. \n\n###Gameplay\nLike all the other entries in the series, Moai Better Blues is a point-and-click adventure with the heavy focus on story, characters, and humor, where the heroes have to explore the environments, solve various puzzles, interact with different characters and complete some minigames. Unlike most of the previous games, the events of this episode mostly occur on Easter Island and only a small part of the action happens in the Sam and Max’s neighborhood. The puzzles may require possession of certain items, getting information from NPC characters or, occasionally, completing minigames such as a musical rhythm game or, a surfing challenge or a driving sequence.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":17947,"name":"Savant - Ascent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9f/c9ffdb0d86204d5f4296bf68db7e22f9.jpeg","description":"Savant - Ascent is an action game. This is a result of the collaboration with the artist, called Alexander Vinter. He is also known as Savant. \n\n###Gameplay \nThe gameplay is quite simple in the beginning. The player should shoot, dodge and jump on two spots.\nHowever, while progressing it is becoming more complicated. When you start playing, you have a limited set of skills, but you can pick CDs from enemies to unlock bonuses or to acquire ultimate power. Every new ability, you unlock, forces you to get used to a new tool, so it makes the game process more tricky and challengeable. The player has to collect six CDs to unlock all achievements and get to the final fight. There are a few modes. In the Story mode, you need to finish five levels. After accomplishing it, the player can try the Time attack mode, where you aim to kill foes for a limited time. Alternatively, try the Endless mode. There you have to fight with never-ending units of foes. Every new wave is stronger than the previous one. However, there is an indicator, showing you the location of the new enemies. \n\n###Art style \nSavant has composed each song, and it fits in with the environment of the game. There are seven unlockable soundtracks.\nMoreover, in the boss fight, it can seem that you fight to the music beat. As for the graphic, it is simple. There are nice 16-bit images, so the design feels a little bit retro.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"D-Pad Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":10976,"name":"Hurtworld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f21/f217ad15f844966fe0d5d240e5c73173.jpg","description":"WARNING: Hurtworld is still very early in development. It may be worth waiting until we are further through development before getting on board (We're not going anywhere).\nHurtworld is a hardcore multiplayer survival FPS with a focus on deep survival progression that doesn't become trivial once you establish some basic needs. That feeling when you're freezing to death trying to make a fire, or you're defenceless being chased by creatures. These experiences are what make a survival game. When you overcome that challenge and find a level of comfort it's a great feeling, but what do you do next?\nHurtworld tempts you out of your comfort zone with rich resources, better loot and higher tech. It will also throw more dangerous creatures, harsher environments and new challenges at you that can't be taken on without the proper gear or refined skill. Will you settle for bows and arrows and a campfire, or push deeper into the map and start scavenging for vehicle parts and better weapons?\nBuilt from the ground up with solid multiplayer foundations. Designed for fast skill based PVP and PVE. You will constantly have to decide which is the biggest threat, the player opposite you or the creatures that will hear your gunshot.Current FeaturesCrafting Gear, Tools, Weapons and Machines - Combine what you find in the world to make hundreds of different items.\nStructure Building - Claim land solo or with friends, build from a hut to a city using our attachment point based structure system.\nProcedurally Generated, Customizable Vehicles - Find a car or quad bike wreck in world with random panels. Scavenge for parts and get it moving again. Find rare paint colors and skin patterns to get it looking just the way you want. Upgrade your engine and gearbox. Make sure to carry a spare tire!\nMining Resources - Heaps of different minable resources that require different tools to gather, from Pickaxes to Dynamite. Alternatively you can build some automated drills and let them do the work for you.\nTwitch based PVP - Some areas of the map will be highly contested, are you willing to share the limited resources needed to survive? If you aren't, we have many different projectile and melee weapons to do away with your opponent. Careful though, murdering your peers may increase your own penalty for death.\nFarmable Plants - Find wild seeds and get a crop going back home.\nHunting Neutral and Hostile Animals - Environment is filled with animals, they may be your lunch, you may be theirs.\nTown Ruins and Relics with Random Loot - Tightly contested, if the radiation and mutated creatures don't kill you, another player will. You might just find those engine parts you've been looking for here.\nDynamic Day/Night + Weather - Pick the right time of day to attempt crossing sand dunes, but watch out for sandstorms.\nStat Simulation - More than just a hunger bar, everything in the world is affected by time of day, current biome, localized effects like radiation, dynamic weather, heat given off by machines etc. Items can have different behaviors based on current stats too. That steak in your backpack might just freeze in the snow, at least it will take longer to go rotten. Put that storage chest too close to your fire you may come home to a pile of Ash.\nDrastically Different Biomes - Explore the harsh world. From the snow forests of the North to the colorful parrot Tokars of the red desert, gear that lets you survive in one biome may kill you in another. Players with a home base advantage will likely be better equipped to handle their surroundings than invaders.\nAll the features above are currently in the game and functional, however much of the content in these systems is placeholder. While we've done a lot of the hard work developing robust systems to underpin gameplay mechanics, we haven't yet spent a lot of time generating and balancing content for these systems. As this is mostly configuration work, we will be able to quickly deliver lots of new content in the coming months.Server Authoritative MultiplayerMost multiplayer open world games use a MMO style network architecture. While this allows for greater player numbers per server, it opens up the game up to endless cheating exploits that are impossible to stomp out. Hurtworld uses an architecture closer to that of a modern FPS, where all physics and game logic are calculated on the server. While cheats can never be fully stopped, this structure makes a large amount of the exploits impossible from day one. Due to this, our servers will use a bit more resources for the same number of people than your usual survival game, but we think it's totally worth it.PerformanceKeeping your FPS high and smooth is crucially important to us. As members of the PC master race we know 60+ FPS is a right, not a privilege. Not to mention PVP gunplay just doesn't work at low FPS. This is an ongoing battle while we are developing the game, adding new stuff slows things down, doing an optimization pass gives us some breathing room. It goes in cycles.\nCurrently things are running very well, we did a lot of hard work during our closed alpha to bring performance up and to get rid of big spikes. On mid range 2 year old machines we're currently getting 80+ FPS on medium settings. Our biggest bottleneck is player skinning on the CPU. Meaning if your CPU is a potato, and there are lots of players in your area, it will chugg. We have a fairly comprehensive graphical settings menu that should let you scale things down even on lower spec machines. We are constantly working to improve performance and we'll do our best to keep everything running well throughout early access.PVP & GunplayHurtworld has competitive FPS in its DNA. Violence isn't the only option, but when it's needed you want to be sure it's a fair skill rewarding system. We are keeping the gear cap low on PVP items. This means a player with 150 hours in a server and endgame loot can't faceroll their way around the map with impunity. Higher grade gear will allow you to survive in harsher environments and take on fiercer creatures, it won't however stop a bullet to the face.Infamy SystemWe are currently testing a new system that changes the way gear is dropped on death. By default all gear you have equipped like tools guns and clothes won't drop on death.\nSecured gear in your hotbar and equipment slots (gear you are wearing) can only be dropped if your infamy level is above zero.\nInfamy is a stat bar that increases by one every time you kill someone, and slowly decreases over time back to zero. For each point of infamy you currently have, you have a chance to lose a secured item (equipped gear / weapons / tools).\nWe hope this will have a few effects.\n\nMost people will actually use their best gear all the time\nNew spawns being harassed at spawn that can’t fight back won’t lose much\nPlayers harassing fresh spawns are putting a target on their own head, as some of their gear is now up for grabs to anyone who kills them, creating interesting skirmishes.\nFarming yield of a player will be dependant on the territory they can control. If a player tries to mine the limited resources around your base, you can kill them to claim the resources back without completely ruining their day.\nWe can make tiers of gear much more expensive to create without crossing the too valuable to lose bracket\nAs with any new gameplay system, it sounds great in theory to us, how it plays will be the real test. This behavior is currently enabled by default, however server owners can override playerlootmode to 4 different settings depending on preference including the classic lose everything.Modding\nModding is one of our top priorities. We have been working with the awesome guys at Oxide, to integrate their modding framework with Hurtworld. You can download their API right now and start writing server mods for Hurtworld in Lua, C#, Javascript or Python!\nIn the future we want to build Hurtworld into a platform for different sandbox game types (Think Dota 2 custom games). We are designing the game we want to play most, however the framework of player movement, gear, combat, environmental effects, AI, vehicles, construction and gathering can all be applied to vastly different game modes with very little work. We are slowly building up a more powerful SDK we plan to release sometime in 2016. I can't wait to see what other people do with a solid FPS framework with the backing of a fleshed out survival game.FAQ\nWill you add procedural maps?\nCurrently we are focusing on hand crafted maps. We are a good way through developing an SDK for Unity we call \"Shigi Tools\" designed to allow the community to create their own maps in-engine. It's not out of the realm of possibility that a server will have its own unique map designed by its admins that is downloaded on connection. This combined with server side mods should open up the gameplay possibilities a lot. We don't have an ETA on this yet, we are using it to build internal maps but it will require some new engine systems to handle runtime loading that we will prioritize amongst other things.\nCan I host a server?\nYes! We have a Windows and Linux headless server build that can be downloaded through the tools section of Steam or via SteamCMD, check out the Hurtworld Wiki for guides.\nHow many players per server?\nWe are optimizing for 50. We run all our physics on the server with low jitter and a high tickrate. This means we won't reach the 200+ mmo class of servers, however we think the tradeoff is worth it for a more responsive experience and a game more resistant to cheats. It also means we can do more interesting things with AI that feel more like Left for Dead and less like World of Warcraft.\nMAC USERS NOTE: If you get a crash on startup of the game, please disable Steam overlay","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bankroll Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10509,"name":"Freebie","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5e/a5ea2b82f47e23f5bd5c0c951b23f48d.jpg","description":"Freebie is a casual indie-style arcade where the player has to control a ball. \n\n###Gameplay\nThe aim is to accurately launch a ball against a rotating blue paddle so that the ball hits the green surface. It is presented as two bars at the edge of the square-shaped area.\nThere are usually two green bars and two red bars; the red ones should not be touched. When the ball hits the green bars, the player earns points; when the ball hits the red ones, the player loses one health dot. There is a health bar - there are three of them - on the right of the area. The ball is launched from the left-side bottom angle and the right-side top angle. As time passes, the blue paddle starts to rotate faster, making it harder to play. Achieved points are shown as cards; the players can check out their positions on the leaderboard available for every user.\n\n###Key features\nFreebie's area fits in an 8x10 frame. The game has no design or music settings; it does not change throughout the play. There are two levels: a normal mode, described above, and an epilepsy mode, which is harder to play. In this mode, the monochrome background changes, turning into a pool of colored squares. Developers state that those prone to epileptic seizures should avoid playing the epilepsy mode.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"hyperboreanGames","platforms":[{"id":0,"name":"PC"}]},{"id":4002,"name":"Fuse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c3/6c3c74f18315de8af9ada80f55d3a8c1.jpg","description":"What happens when humans gain access to powerful alien technology they were never meant to have? When a volatile energy source called Fuse falls into the wrong hands, the CIA calls in an elite contact team to retrieve it: Overstrike 9. Join up to three friends in team-based co-op play as you take down the rogue paramilitary corporation behind the theft. Use lethal teamwork, coordinate devastating attacks, and provide cover for one another with fringe-tech weapons and gadgets. The unique LEAP feature lets you instantly shift from agent to agent during combat, allowing you to take advantage of each one’s special arsenal. You’ll need your teammates and their firepower to stop a global arms race from spinning out of control.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2272,"name":"Arma Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/128/128ef824b918a2b0bdf9c3a5ccc96a06.jpeg","description":"ARMA Tactics is a standalone spin-off of the ARMA mobile tactics series. While being set in the same universe as its predecessors, the game features a dramatically different type of gameplay.\n\n###Premise\nThe player takes control over a squad of four Special Forces operatives in the modern world. He or she can view them from the top-down \"bird's eye\" view in a 3D environment. The scope of a camera is very limited, however. Each character has special skills that can be improved when the character levels up using an RPG-like mechanic of experience points.\n\n###Gameplay\nThe combat and movements in ARMA Tactics are turn-based. Each unit has two action points. They can be spent on movement, healing, attacks, or preparations for an enemy attack. For example, the player can spend a point to order his or her soldier to fire upon seeing an enemy without waiting for his or her turn.\n\nARMA Tactics relies heavily on the \"invisible dice.\" A lot of things in the game are randomized, and both the player's and enemy soldiers can miss their target from the point-blank distance if the game says so.\n\n###Modes\nThe game has two modes. In the story mode, the team completes a series of missions against Islamic terrorists in Africa. The plot is delivered through cutscenes between missions. The other mode offers the player to complete the randomly generated missions. There's no multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":326221,"name":"Röki","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ea/8eafa15945b94ce0f4e90f5db6fda419.jpg","description":"Röki is an adventure game inspired by Scandinavian folklore; a dark contemporary fairy tale underpinned by a touching narrative, alluring art style, ancient puzzles and atmospheric exploration.\n\nWe join Tove on a fantastical journey to save her family. A journey that takes her deep into a hidden and long forgotten world of lost folklore filled with strange locations and even stranger creatures.\n\nExplore the ancient wilderness, solve its mysteries, save your family in this modern adventure game for all.\n\n  · “EXPLORE a Living Fairy Tale Forest”\nJoin Tove to Explore a rich and beguiling world of wintry Scandinavian folklore, a world alive with detail and life crafted in Röki’s signature graphical art style.\n\n\n  · “Make Friends WIth MONSTERS”\nSeek out the ancient and magical creatures of the Scandinavian wilderness, some are friendly, some not so much!. Röki has a rich cast of unique ‘creepy-but-cute’ characters to discover our own take on Nordic folklore. \n\n\n  · “SEARCH for Long Forgotten Items”\nThe ancient wilderness holds many secrets. Seek out long forgotten items to aid you on your adventure.\n“SOLVE the Riddles of the Wilderness”\nRöki is a game of brains not brawn. Can you unlock ancient pathways and solve the riddles of the ancients.\n\n\n  · “CHART your Journey”\nTove charts her progress in her trusty journal, it’s her grail diary. Map uncharted regions, delve deeper into the rich lore of Scandinavian folklore, collect loot and earn unique ‘wilderness explorer’ badges.\n\n  · “An ADVENTURE For ALL”\nRöki is an adventure game for ALL gamers. With its non-violent gameplay, accessible controls and universal themes it is a journey to delight all gamers. The game is designed uniquely to pose a challenge but to also offer a helping hand when adventurers need it meaning it can be enjoyed by all. A truly modern take on the Adventure game genre.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Polygon Treehouse","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":47381,"name":"60 Parsecs!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9e/e9e19e791513add41990b4c5958c5bf1.jpg","description":"In the late 1950s, the Cold War opens up a new front: THE OUTER SPACE!\nWhen an unlikely crew of astronauts gets stranded among the stars after a haphazard evacuation from the exploding space station, their fate rests in your hands.\nTime to act, Captain!\nGet your people and enough supplies to the space rocket, before the incoming nukes, accidental debris or the vaccum get you first. Is 60 seconds enough to prepare for the 60 parsec, unplanned journey into the unkown?\nHurled into the depth of far away galaxies, only you can get everyone back home. Decide what to do, facing impossible odds every day and a unique adventure every time you play. Ration food, somewhat radioactive fuel and make the best of your supplies to keep your crew spaceworthy.\nCan you survive the horrors lurking outside and within your space rocket?\nBon voyage!\nSCAVENGE for supplies, resources and your crew in just 60 seconds and live with the consequences of your frantic decisions!\nSURVIVE the farthest reaches of outer space with an almost competent crew and a modest supply of soup cans in your trusty space rocket. Can you reach your destination?\nEXPLORE the vastness of space in a procedural, non-linear narrative, incorporating roguelite elements for short but intense play sessions, where every decision made can make it or break it.\nCRAFT your own space-faring adventure and experience a neverending stream of story events with a diverse cast of characters*!\n* including, but not limited to space octopi, the infamous swinging aliens of Omicron-7 and of course those pesky Soviets.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Robot Gentleman","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":18851,"name":"Jurassic Park: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f7/5f72fb91f10f4a1c24fe1861877701c5.jpg","description":"Security systems have failed and the creatures of the park roam free. Now, a rogue corporation will stop at nothing to acquire the dinosaur embryos stolen and lost by Dennis Nedry. Experience a brand new adventure set during the events of the first Jurassic Park movie and see new areas and dinosaurs in this landmark adventure 65 million years in the making!\nKey Features:\t\t\t\t\t\tA cinematic adventure in four parts featuring fast-paced action, exploration and puzzle-solving\nReturn to familiar locations from the movie and explore new areas including the menacing waters of the marine facility\nTake on the mighty T-Rex, the cunning Raptors and escape the jaws of new prehistoric threats\nDiscover the fate of the Barbasol can containing priceless dinosaur embryos\nFaithful to Spielberg’s vision of Jurassic Park – an authentic extension of the world you love\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":16710,"name":"1954 Alcatraz","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2d/f2d9d8be9217195800f2b84a53154912.jpg","description":"1954: Alcatraz – The cash is out there. But who will get it?\nJoe's doing 40 years on Alcatraz for a heist on an armored truck. The loot is still hidden out there, but only Joe knows where it is. In the streets of San Francisco, Joe's ex-accomplices and his wife are eager to find the stolen money. Who will get their hands on the dough?\nIn this interactive Point & Click adventure by Daedalic Entertainment and Irresponsible Games - the team of Gene Mocsy - Joe and his wife Christine will be playable characters. Players will decide between love, treachery, life and death: will Christine assist Joe during his prison break? Will they recover the fortune together? Or will they succumb to greed? Will Christine deceive her husband, taking revenge for all the disappointments and a marriage that brought her nothing but hardship? Will she just turn her back on Joe and hit the road with his former accomplices? Or will Joe gain everything in the end?\n1954: Alcatraz offers all what makes a great adventure: challenging puzzles, a mature crime story with a dynamic plot and various possible outcomes, and a whole bunch of shady characters: brutal felons, making life on The Rock even harder for Joe, while outside not only his partners-in-crime but also snoops and cops are after the money and Christine. The cinematic San Francisco of the 1950s, caught in a gritty comic style is a harsh place. But it's also a place where 1954: Alcatraz can also pay homage to history and zeitgeist, in form of the Beatnik culture and other contemporary themes.\n.Key FeaturesTwo playable characters: the gangster couple Joe and Christine\nMore than 20 additional 3D animated characters\nMore than 60 hand drawn backdrops, based on original footage of San Francisco, North Beach and Alcatraz\nChallenging puzzles and exciting dialogues by Gene Mocsy, co-writer of Ghost Pirates of Vooju Island\nAtmospheric Beat and Jazz soundtrack by Pedro Macedo Camacho (Fairytale Fights, Ghost Pirates of Vooju Island, A Vampyre Story, Audiosurf)\nIn-game decisions extensively influence the plot and lead to various endings","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":319120,"name":"art of rally","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9a/f9a3b8c9d6ae61e29bd45782040d2c7e.jpg","description":"\"To do something dangerous with style is art...\"\n\nart of rally is a stylized experience inspired by the golden era of rally from the creator of Absolute Drift.\n\nRace across the world through colorful and stylized environments in top-down view. Compete for first place in the leaderboards with daily and weekly challenges. Will you master the art of rally?\n\n###The Golden Years of Rally\nExperience the golden era of rally in Career mode, travelling across 60 stages from Finland to Sardinia, Norway, Japan and Germany.\n\n###50+ Iconic Rally Cars\nGet behind the wheel of your favorite vintage cars, ranging from the 60’s to the 80’s, Group B, Group S and Group A.\n\n###Authentic Handling\nFrom beginner-friendly options to driving modes that’ll challenge the most expert drivers, all players can tackle the races using their favorite rally driving tricks: Scandinavian flick, counter steering, left foot braking, handbrake turns.\n\n###Race To The Top\nGet your name out at the top of the Leaderboard in our daily and weekly challenges.\n\n###Photo Mode\nShow off your driving skills, or simply your favourite landscapes, with the integrated Photo and Replay mode.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Funselektor Labs","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":254542,"name":"Horizon Zero Dawn: The Frozen Wilds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0a/b0a6ef260b58ef99b40faddd0f9ebed3.jpg","description":"Beyond the northern mountains, the borderlands of the Banuk tribe challenge all who dare enter to survive the extremes. But now this frozen wilderness harbors a new threat, and for Aloy, a new mystery – one she’s determined to solve.\r\n\r\nThe Frozen Wilds contains additional content for Horizon Zero Dawn, including new storylines, characters and experiences in a beautiful but unforgiving new area.\r\n\r\n·\tUncover a compelling new story.\r\n·\tExplore a brand new area\r\n·\tFace new machines.\r\n·\tTo use this download, you must own Horizon Zero Dawn (sold separately).\r\n·\tEnhanced for PS4™ Pro with dynamic 4K gaming, improved graphics and environments, and High Dynamic Range visuals*.\r\n\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":18232,"name":"Take On Helicopters","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/475/47572f0bea1ada256aaa56ea59381b99.jpg","description":"Take On Helicopters is a simulation game. This game is the first one in taking On series. \n\n###Plot\nJoe Larkin began running Larkin Aviation with his younger brother, Tom Larkin after their father died. Joe is a helicopter power and war veteran.\nThe brothers face the business troubles. To solve it, they have to sign different contracts.\n\n###Gameplay\nFirst of all, there are tutorials, which can help you assimilate. They range from the easiest one to the advanced.\nYou can get used to the cockpit and instruments and learn how to do maneuvering and to land. Also, you can familiarize yourself with sling roads and emergency procedures. The game offers the Career mode with various scenarios. Mostly you play as Tom Larkin, but in a few flashback missions, you have to choose his elder brother Joe as a character. The contracts, you sign to save the company, requires you to earn money. According to these deals, you have to complete the missions. They can vary from filming the whales to helping out the SWAT-officers. The player can spend earned money on buying, repairing and upgrading the helicopters. There are three types: light, medium and heavy. Also, you can use diverse equipment: sling-lines, winches and fast rope hooks.\nMoreover, there are challenges, which can include rescuing, sling-roading and formation flight. Sometimes you have to complete a mission in a limited time. As for the areas, there are two: North American and South Asian open-world terrains.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":22041,"name":"Halo Wars: Definitive Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b9a/b9a85da19ba361e20bfb39404f74f800.jpg","description":"Halo Wars: Definitive Edition is an enhanced version of the real-time strategy classic, Halo Wars, updated to run natively on PC.\nSet early in the iconic war between the Covenant and UNSC - made famous by the Halo FPS games - Halo Wars: Definitive Edition provides a unique angle on the war while bringing new heroes to the battlefield. Control large Halo armies and direct them in action-packed warfare.\n\nHalo Wars: Definitive Edition includes improved graphics, new achievements and all the DLC from the landmark game. Experience the epic campaign or compete in online multiplayer battles with armies of powerful Halo forces at your command.\nNetwork play for this product is exclusive to Steam.  Cross-play with Windows Store versions of the same game is not supported.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"343 Industries","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":11184,"name":"ArcheAge","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f1/5f10706421c71f3aae151debcb883a05.jpg","description":"Revelation is Live!ArcheAge 3.0: Revelation is here! Play as the stout Dwarves and fearsome Warborn, unleash game changing Abyssal Power skills, explore beautiful new zones, settle in new residential areas, and more!\nAbout the GameArcheAge is the ultimate free-to-play fantasy-sandbox MMORPGBuild massive castles and lay claim to lands whose riches fuel a deep, player-driven economy. Band together to protect your fortune in epic siege battles and naval combat – or live the life of an outlaw, prying glory and coin from foes left in your wake.Shape the WorldGatherers, crafters, and traders are the engine that drives ArcheAge, and its economy is yours to control. Master diverse skills to craft trade goods, houses, ships and castles. Transport and trade materials across the realm, braving danger and piracy to support your allies in wars that will change the fate of the world. Join a zone’s community and work together to unlock special regional bonuses or form a family with your closest friends.Fight for GloryAssemble allies and build an empire to span continents. Sabotage your enemies’ trade and lay waste to their armies in the field. Rally your forces and craft massive siege engines to storm the heart of rival castles and claim them as your own, or test your skill against hundreds of other players in open world battlegrounds.Set SailSail the vast uncharted ocean and amass fame and fortune by securing trade routes and controlling the flow of enemies’ resources. Riches await, whether you lead fleets against rival armadas or ply the waters as a pirate for hire – just beware what lies beneath!Rule a NationConquer and improve one of the six Auroran Castles to prove the might of your guild and create your own nation! Develop your nation’s resources and convince other guilds to join you. Choose the faction you want to align with by convincing their heroes to ally with you. Expand your territory by conquering the other Auroran Castles and fend off sieges from those seeking to claim your nation as their own!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"XLGAMES","platforms":[{"id":0,"name":"PC"}]},{"id":13527,"name":"The Town of Light","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9f/f9fe0c135bbd65142e9094178b43697b.jpg","description":"12 March 1938. Renée, 16 years old, is ripped out of her world, locked up and deprived of everything.\nHer only fault was that she didn't know what her place in the world was.\n\"A danger to herself and others and a cause of public scandal\" wrote the police headquarters.\nThe only horror you will find in this game is the truth: a blow to the solar plexus, much more intense than any supernatural presence\nThe Town of Light is a psychological adventure told in the first person. The story is  set in Italy in the first half of the 20th Century in a place which really existed and has been meticulously reconstructed. Exploring and interacting with the environment you will relive the history of the main character through her confused viewpoint and on the basis of your choices, the story will develop in different ways.\nBecause of its contents, the game is intended only for adult users.Characteristics: Realistic 3d graphics\nBased on real facts and events.\nStrong narrative component\nNo zombies or supernatural presences.\nOriginal sound track.Follow us on:Website\nFacebook\nTwitterList of supported VR headsetsOculus Dev Kit 2","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wired Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":362933,"name":"Gamedec","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a87/a874f770b7384b23dd9cd30fa0adc512.jpg","description":"You will hunt down the criminals of virtual worlds. Rich, spoiled businesspeople, mothers who want a better life for their children, or corporations with plans to rewrite humanity. Are they acting alone, or are they mere puppets? What does a \"happy ending\" mean to you or to them? Each decision you make shapes the game world and your character’s personality.\nSome decisions will feel right, and others will be unexpected. The game continually adapts to your choices and never judges – only you can judge yourself.\n\nWelcome to Warsaw City in the XXII century, where \"real\" is a relative term and \"life\" and \"death\" have many meanings. Virtual worlds give rise to real problems: lust, sloth, envy, and pride. That’s why the residents of these virtual game-worlds need specialists – Gamedecs who discover and exploit cheats hidden in the realities of their clients. Wild West or the jungle of a prehistoric entertainment park, throughout these and many other worlds, they are facing human nature, which, despite many changes, has remained the same...\nGamedec is a pure RPG experience equipped with mechanics such as a codex, aspects, and deduction. Fight conversational duels, discover or build schemes of intrigue, save lives, and discover extraordinary relationships between the virtual worlds and their inhabitants. The game emulates the nature of a tabletop RPG by focusing on choice-dependent character building.\nGamedec, like classic tabletop RPGs, gives you the freedom to approach situations from multiple angles rather than forcing a single solution. Remember: the choice is yours.\nhttps://store.steampowered.com/app/917720/Gamedec/","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Anshar Studios","platforms":[{"id":0,"name":"PC"}]},{"id":28495,"name":"Perfect Dark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f62/f62d090119e5ff05c59036480123fd83.jpg","description":"(Online Interactions Not Rated by the ESRB) Buy the full version of Perfect Dark to unlock the classic package in its entirety. Experience every twist of the story, every stray bullet, every gadget and upgrade, every newly polished texture – and top it all off with full access to multiplayer modes now playable across the globe through Xbox LIVE. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 64"}]},{"id":9576,"name":"Supraball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/238/238b9bcc2b658e38be965b16c9e39075.jpg","description":"Instead of writing more about why we think this game is great we decided to let our beta testing community write some comments here.\n\"What is Supraball? - imagine you're playing fifa, controlling just one player. Okay now imagine that each other player is a real person. Okay now imagine you're in first person, and you have this super awesome cannon with dozens of combinations of spins that fires a yellow ball at 400km/h. Okay now imagine you've fired that into the top corner at that speed - and someone saves it. That is supraball!\"\nSolomon\n\"So the first thing that I liked was the innovation, there are no games like it.\"\nMalaria\n\"The game being a first person sports game made me feel like I was actually on the field playing ball. Also, the fact that everyone on the playing field was an actual person, and not a scripted AI that would change into the player if given the ball, added an element I personally had never seen in a game before Supraball.\"\nSkel\n\"F**k yes, I can play football at home!\"\nSilw\n\"The thing that fascinated me the most is the amount of teamwork involved and the kind of creativity you can have while playing this game.\"\nBakes\n\"It's pretty easy to play but hard to master.\"\nOlo\n\"Most fascinating is the ability some players have to always create new moves etc.\"\nGoku\n\"Different things happen every match, so it's never the same.\"\nDimle\n\"I liked being the last hope for my team and the tense pressure filled moments were amazing. Making a 1v1 save is a really awesome feeling and no other game has given me the same feeling yet.\"\nVendetta\n\"Very precise, accurate, total control. Intense gameplay, nail biting finishes.\nI can't stop, it's heroin/crack!\"\nRevan","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Supra Games","platforms":[{"id":0,"name":"PC"}]},{"id":1509,"name":"Electronic Super Joy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/933/9334a5e555b8e6bf1908f76b63c1c88b.jpg","description":"Electronic Super Joy is a platform video game with a humorous tone and numerous levels followed by electronic music. \n\n###Gameplay\nThe player performs for a black human-like character. He has to cross through the levels, looking for his stolen butt and seeking revenge for it. The player's goal is to get through every level and survive after enemies' attacks. As time passes, the game sets three boss fights. \n\n###Key features\nThe world is drenched in electronic music; its track supports each level. There are more than 45 levels with different obstructions, enemies, and surroundings.\nThe player passes plenty of checkpoints on each level; it is possible to resume from there if they die. Every stage is covered in a particular color; some of them have portals, bridges, flying stairs, mazes, plants; some surfaces block the player's movement, or affect him otherwise. There are also moving levels that force the protagonist to move quicker. The character can run, jump and do the “smashing” movement - he then drops upon something directly. At some levels, the player can also fly or double jump. Some of the enemies perform as small white shooting missiles, some of them are black human-like creatures who somehow differ from the protagonist: for example, they might wear a hat. An enemy usually yelps a nasty black-humored phrase like “I stole your butt, it's true!”","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Broken Rules","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":537744,"name":"Dyson Sphere Program","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/842/842ab43c709d2acb95691c927de9cb93.jpg","description":"Dyson Sphere Program is a sci-fi simulation game with space, adventure, exploration and factory automation elements where you can build your own galactic industrial empire from scratch.\n\nIn the distant future, the power of science and technology has ushered a new age to the human race. Space and time have become irrelevant thanks to virtual reality. A new kind of supercomputer has been developed – a machine whose superior artificial intelligence and computing capability will push humanity even further. There is only one problem: there isn’t enough energy in the whole planet to feed this machine.\n\nYou are a space engineer in charge of a project launched by the space alliance COSMO, tasked with a massive undertaking: constructing Dyson Spheres (a megastructure that would orbit around a star, harnessing all its power and energy) to produce the energy that humanity needs. Only a few decades ago, Dyson Spheres were considered a hypothetical, impossible invention – but now it’s in your hands… Will you be able to turn a backwater space workshop into a galaxy-wide industrial production empire?\n\nNeutron stars, white dwarfs, red giants, gaseous and rocky planets… There is a big and varied universe out there, waiting for you to gather all its resources.\n\nEvery playthrough will be unique: your universe will be procedurally generated every time you start a new game. There will be different types and distribution of stars, planets and resources. Will you manage to thrive and build your Spheres, no matter what the universe throws at you?\n\nAs a space engineer, you are expected to design your interstellar factory and production lines, not to micromanage every small package going back and forth. You have to transport materials from one planet to another, forming interstellar transport teams that gather resources and bring them to where they are needed.\n\nThen, your resources can be transported between facilities through conveyor belts, and you’ve got the technology to help your buildings fit the grid automatically during the construction process. You’ve got the best tools COSMO can afford to build a massive-scale automated production line – the most efficient one ever seen in the universe!\n\nBuild a galactic industrial empire from scratch: start with a small workshop and improve it until it spans the whole galaxy\nDevelop your very own Dyson Spheres, a megastructure that orbits around a star harnessing all its power and energy, from the first screw to its completion\nExplore a vast universe procedurally generated with all kinds of celestial bodies: neutron stars, white dwarfs, red giants…\nGather resources in planets of all types: ocean, lava, desert, frozen, gaseous planets…\nResearch new technologies to improve your factories… and discover the secrets of the universe\nBuild mechasto fly, sail or jump through outer space and alien planets\nTransport materials across the galaxy to your facilities: thousands of transport ships will flow endlessly to your factories and back!\nDesign the most efficient automated factory and production line\nCustomize your factory and Dyson Sphere to make it unique\nDesign a balanced power network capable of producing energy in all kinds of power plants like wind turbines, artificial stars, etc.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Youthcat Studio","platforms":[{"id":0,"name":"PC"}]}]