[{"id":279590,"name":"KINGDOM HEARTS FINAL MIX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c51/c516902fde524b694b807e522bdb69e7.jpg","description":"Kingdom Hearts is the story of Sora, a 14-year-old boy whose world is shattered when a violent storm hits his island-paradise home, and is separated from his two closest friends, Riku, a 15-year-old boy, and Kairi, a 14-year-old girl. The storm scatters the three to differnt and unknown worlds. At the same time, there's turmoil in Disney Castle. King Mickey is missing, and Court Wizard Donald and Captain Goofy set out to find him. On their travels they meet Sora on his own search for his lost friends. The three are told of ominous creatures known as the Heartless - beings without hearts derived from an unknown dimension and as it turns out, manipulated by Disney villains and the ones responsible for the devastating storm. Upon discovering the link between the Heartless, the storm and the disappearance of King Mickey, Sora, Donald and Goofy join forces and help familiar Disney heroes to save their worlds.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Square","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":51091,"name":"Disney's The Lion King","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bb1/bb182c89b9d4e19b41e5d0f81caa0f42.jpg","description":"Disney The Lion King brings to life the majesty and mystery of Africa through the tale of Simba, a lion cub faced with the challenging transition to maturity. Now, you too can be part of the adventure!\nDriven into the wilderness by his evil uncle Scar, Simba finds salvation and Hakuna Matata with Pumbaa the warthog and Timon the meerkat.\nTackle heinous hyenas in the elephant’s graveyard, avoid the trampling hooves of stampeding wildebeest as you battle through 10 levels to ensure Simba claims his rightful place as The Lion King.\n●Join Simba through 10 levels on his journey from cub to king\n●Enjoy adaptations and orchestrations from the award-winning soundtrack, including “I Just Can’t Wait to Be King” and “Hakuna Matata”\n●Jump, climb and fight your way through this adventure, collecting bugs along the way","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Westwood Studios","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Game Boy"},{"id":0,"name":"NES"},{"id":0,"name":"SNES"},{"id":0,"name":"Genesis"},{"id":0,"name":"Linux"},{"id":0,"name":"Game Gear"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17879,"name":"Victim of Xen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8aa/8aab6b9ac9d49efc6212e7c6e0d01489.jpg","description":"Embark on a journey across continents in the Role Playing Game, Victim of Xen. Follow Will as he becomes a victim of circumstance, after the frivolous royal witch, Xen, turns him into a girl. As you search of a way to reverse the spell, you'll get pulled into something much more treacherous. Explore a dynamic story set in a rich world full of war and intrigue, with a dash of quirkiness. Fight monsters, complete jobs to earn coin, and get ready for adventure!\nUnique Story\nDynamic World\nCan you reverse the spell?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Smolders","platforms":[{"id":0,"name":"PC"}]},{"id":17853,"name":"Doorways: Prelude","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7f/c7ff7c7383880ce973f756483d159b98.jpg","description":"Doorways is an episodic first person horror adventure, featuring a complex story and deep atmosphere. Each chapter will challenge you with its fast-paced gameplay and breathtaking visuals and sounds, so prepare to immerse yourself in a terrifying psychological experience.\nYou're playing as Thomas Foster, a special agent who must track down four psychopaths. Who are these people? What is this place and how did you get here?\nThese are just some of the questions that you must answer during your journey...\nStart playing chapter 1 and 2 now!Key Features\nHorrifying exploration adventure with an immersive atmosphere\nIngenious puzzles as well as challenges that put your reflexes at test\nInspired voice acting by Sam A. Mowry (the voice of Alexander in Amnesia: The Dark Descent)\nReplayability through many secret places\nFull Controller supportNative Oculus Rift support\n----\nDoorways is an episodic game, it's divided in three parts and they can be played separately:\nDoorways: Prelude (Chapter 1 & 2):\nhttp://store.steampowered.com/app/248470/\nDoorways: The Underworld (Chapter 3):\nhttp://store.steampowered.com/app/311250/\nDoorways: Holy Mountains of Flesh (Chapter 4):\nhttp://store.steampowered.com/app/383930/\n----\nIMPORTANT\nAchievements do not work on Linux","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Saibot Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16568,"name":"Future Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6c/f6c3af5356afbc4fc3b070fb6114e1f1.jpg","description":"Battle it out on the proving grounds and get ready for Future Wars.\nSimilar to classic titles such as Advance Wars and Battle Isle, the game takes strategy gaming away from the micro-management overkill that it has become and using simple, proven rock-paper-scissors principles, reopens the genre to everyone.\nWith a modern 3D engine providing the graphics, a proven, easy to learn, but difficult to master set of rules surrounded by an engaging plot and challenging gameplay, the game will appeal to newcomers and hard-core gamers alike.\nAlso available is unlimited access and infinite possibilities to mod the game through open data structure, open scripts and an easy-to-use editor.FeaturesModern 3D graphics & proven gameplay embedded in an engaging and sometimes, humorous plot\nInfinite modding possibilities through open data structure, open scripts and editor\nNovel and unique game modes such as AI vs. AI or play-by-email\nRock-paper-scissors principle makes Future Wars easy to learn but difficult to master\nIn-game achievements allows for hours of replay to acquire top honors","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]},{"id":16206,"name":"Reset 1-1","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6f/e6f771a2f80fc892cf91aa631b03f548.jpg","description":"The world has ended, Demons have risen to conquer the uninhabited and flourishing nature outside.\nIt's your turn, with your unknown identity, to find your path for a new beginning.\nReset 1-1 is a good ol' fashioned frantic action RPG platformer! Battle your way through demon hordes and gigantic bosses!\nLet's not beat about the bush here. Reset 1-1 is everything you loved about the late 80's/early 90's. It's a blast from the past, with a fresh spin. It's a great little fun game. Remember when games used to be fun and challenging? Reset 1-1 is just that. Enjoy!\nGame Manual:\n-------------------------\nLeft/Right  keys : move\nEnter: start\nEscape : pause/menu\nX : Roll\nC/Up Key: Jump\nV: Attack\nSPACE: Heal\nDown Key: Action\nController:\nSTART: pause/ start\nLB / RB : Attack\nLT / RT : Change Weapon\nA: Jump   B: Roll   Y:Action  X: Heal\nArrows/sticks: Move","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"xXarabongXx","platforms":[{"id":0,"name":"PC"}]},{"id":14770,"name":"King Arthur - The Role-playing Wargame","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9f/b9f3358e608415a1d83475ea6b60e682.jpg","description":"Welcome to the lost age of chivalry, where magic and myth is alive, and you are destined to be one of the living legends: Arthur, the son of Uther Pendragon, the Once and Future King of the prophecies.\nFulfill your destiny and claim your rightful place on the throne of Britannia. Recruit fabled knights to your Round Table: send them to adventures or battles, let them gather knowledge and artifacts, see how they become the most powerful heroes of the realm. Build the majestic Camelot, but beware: there will be enemies, both mortal and otherworldly that will try to destroy you. Send your heroes and their followers to battle with legendary warriors and monsters and see how the folk of the faeries and the saints set against wizards and evil knights.\nReal-time fantasy battles: spectacular fight scenarios on grandiose battlefields, featuring thousands of soldiers and powerful heroes such as Sir Lancelot, Sir Galahad or Merlin. Battles rely on the strengths and weaknesses of the different arms with several tactical possibilities, the abilities of the units and the heroes, monsters and most of all, spells.\nTurn-based Campaign Map: Britannia is represented as a fully three dimensional topographic map where heroes move freely, conquer provinces or find adventures. In the turn-based campaign the changing seasons have effect on the gameplay and the graphics of the Campaign Map.\nCreate your own legend! The saga of King Arthur is an epic tale about the conquest of Britannia through a story-based campaign. The Campaign is divided into chapters, like a chronicle, each with a unique tone and theme. The chapters all have objectives, long- and short-term goals that also fit together to draw a grandiose picture of an unfolding storyline. There are many possible events and outcomes that all influence the legend itself and determine the ending of the storyline.\nMorality Chart: Every decision in the game will influence the position of King Arthur on the Morality Chart. King Arthur might become a Christian ruler or the Follower of the Old Faith; a rightful or a ruthless monarch. These choices unlock special contents, allies, heroes, units and developments.\nRPG elements: Heroes lead the armies and learn skills, spells and abilities from an ability tree for experience points. Heroes can also use magic items or become liege lords, entrusted with the leadership of a province, which is the best way to have them indebted. Arranging their marriages with the nice damsels of Arthur’s court also raises their loyalty.\nAdventures: adventuring is the essence of King Arthur’s world. Quests pop up on the Campaign Map regularly. In technical terms it is a short story where the chosen knight has to make important decisions. Some adventures end in battles on special battlemaps.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Neocore Games","platforms":[{"id":0,"name":"PC"}]},{"id":10793,"name":"1993 Space Machine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b2/0b235aa29180946eece7da4fd46220e4.jpg","description":"Space shooters never die.\n1993 is a testament to that, honoring classics like Life Force, R-Type and Xenon II. We're keeping the genre alive.\n1993 was made in 1993. It is not made to look retro. It is not polished for today's tech - this is the genuine thing!\nIt's 1993 in 2016!\nYour're in charge! Explore and secure the different worlds in the order that fits your taste and urge.\nThe kick ass weapon system lets you unlock weapons for use in later play sessions. We feature both classic powerful weapons plus some fresh smart weapons.\nOf almost 100 deadly enemy types, we have crafted unique evil behaviours for most of them.\nAs an extra game mechanic we have introduced a new health and shield system for more interesting game play.\nUp to four player co-op mode.\nIn short:\n10 Ships to choose from\n25 Different weapons with 3 power levels\n13 Levels\n10 Different Bosses\nStarted in the age of the Amiga 500, this game was featured in Amiga format and Commodore User - two of the largest gaming magazines of the time. A series of unfortunate events prevented this space shooter to get finished. We plan to do that now!\nFeatured on:\n\nGame story:\n\"Towards the end of the interstellar wars, chaos spread and one band of elite mercenaries acted more like pirates and looters than actual soldiers. The leader of this group was the notorious and infamous Colonel Nestor.\nWithout a doubt the biggest prize of their looting campaigns was the Spacemachine: a device designed to terraform barren planets and making them habitable. With this device, and the rest of their treasure, Nestor and his men started to build an army that now poses a great threat to the known star systems.\nMission: Bring back the Space Machine.\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Modesty","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2372,"name":"Unmechanical: Extended","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/25b/25b2d9ecc9adecdc9f549074db7ec06a.jpg","description":"Unmechanical: Extended is an award-winning platformer/puzzle game loved by countless players around the world, now coming to Xbox One with a brand new “Extended” story episode that contains even more puzzles and mysteries to solve. Do you dare enter?\nOur story starts when you are abducted into a secret underground world full of fantastic machinery. Flying freely through the strange world, you have to solve a wide variety of puzzles and mysteries. The journey to freedom begins!\nOn your adventure you may also begin to understand the reason behind it all - the underworld may be more than it seems, the fateful descent more than just chance, and you might not be entirely alone there after all…\n- 5 huge, non-linear levels to explore\n- Dozens of puzzles that will test your skills\n- Award-winning art design\n- Beautiful soundtrack","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Talawa Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":350543,"name":"Totally Reliable Delivery Service Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/caa/caa687fd5579acb6dcff2f2e63120a87.jpg","description":"Wishlist the full game!https://store.steampowered.com/app/1011670/Totally_Reliable_Delivery_Service/\nAbout the GameTRDS OPEN BETA\nBuckle up your back brace and fire up the delivery truck, it's time to deliver! Join up to four friends and haphazardly get the job done in an interactive sandbox world.\nDelivery attempted, that's a Totally Reliable Delivery Service guarantee!\nBETA FEATURES:\nLocal and Online Multiplayer: Go it alone to ensure the safety of your deliveries, or join your friends and put your teamwork to the test.\nControlled Noodly Chaos: Unpredictable ragdoll physics meets snappy platforming. Sprint, leap, dive, and grapple with ease, but collide with something and you'll be knocked out cold!\nA World of Distractions: Take a break from deliveries and play around! The world is chock full of toys, vehicles, and machines that can be used for work or play.\nRagtag Crew: Customize your blue-collar workers and get your rear into gear, it's time to deliver!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"We're Five Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21673,"name":"Myst: Masterpiece Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b2/9b2a970c6f28090e857bd69244cd51e5.jpg","description":"Enter a world where nothing is as it seems... and adventure knows no bounds!\nJourney to an island world eerily tinged with mystery... where every rock, every scrap of paper, every fleeting sound holds a clue to an ancient mystery. Enter, if you dare, a starkly beautiful landscape shrouded in intrigue and injustice. Only your wits and imagination hold the power to unlock the shocking betrayal of ages past!\nLose yourself in fantastic virtual exploration, now more compelling than ever in the stunning Myst® Masterpiece Edition. Breathtaking graphical realism blurs the line between fantasy and reality, challenging your wits, instincts, and powers of observation like never before. The fantasy beckons... can you resist its call?","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":20648,"name":"Pink Hour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/569/56918485f2a1d12aa8e9cccaea0a7aa0.jpg","description":"Kero Blasterhttp://store.steampowered.com/app/292500/\nSequel: PINK HEAVENhttp://store.steampowered.com/app/409690/\nAbout the GameThis is a cute and fancy action game that lets you mess around and have fun to your heart's content\nPlaying as the pink-clad office lady appearing in Kero Blaster - the 2D scrolling action game - you must make your way through a cave to escape the enemy's clutches.\nFind the missing documents and defeat your opponents by jumping over them.\nClear the game by returning safely back to the office with the reclaimed documents in hand.\nHard mode includes a new special ending that you won't want to miss!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Studio Pixel","platforms":[{"id":0,"name":"PC"}]},{"id":20373,"name":"CUPID - A free to play Visual Novel","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/043/0439fa80b7718e60d12aa7dfb5f21788.jpg","description":"WARNING: MATURE CONTENT. This game contains disturbing imagery, violence, flashing images, sudden and loud noises, mature themes, and strong sexual content. Viewer discretion is advised.\n\"Love is both poison and cure, both knife and remedy.\"\nRosa's best friend, Catherine, is dead and she is sure Catherine's betrothed, Marquis Guilleme is to blame. Mother says so. Mother says he has to pay with his life. Although, she knows by now Guilleme is no ordinary man. He is tainted. Inhuman. A monster. He cannot be killed by usual means. To seek the best revenge, she must find out all his secrets and destroy him. But will her own dark desires consume her or liberate her?\nNo matter.\nMother will tell her what to do.\nSet in the romantic 18th century France, play as the third person point of view character of Mother — a unique twist to the visual novel decision making medium. Decide the fate of the characters, scold or console, argue or assent... Just don’t be surprised if they start to question your commands.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fervent","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13973,"name":"Jagged Alliance: Crossfire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5f/e5f0af1e03acbb40514c055d4b36476a.jpg","description":"Job well done, soldier! The island of Arulco is free; however, there are other countries under the shadow of war that are ignored by the rest of the world. Khanpaa, a peaceful and tranquil nation, is being held in the terrifying iron grip of a group of paid mercenaries…yet the United Nations looks the other way. UN ambassador Behnam Atiqullah tries to help his home country, but there is not much he can do. Military intervention from a major world power seems not to be an option and Khanpaa appears all alone…\nThat’s where YOU come in! As the strategic genius behind your own personal Private Military Corporation, you’ve offed to help by bringing in your team of skilled mercenaries to retake the tormented nation of Khanpaa! Help the oppressed people by hiring a team of hardened guns-for-hire and prepare for battle in treacherously frozen mountain badlands. Along the way, discover why Khanpaa has been turned into a bloody battlefield and who aims to truly profit.\nJagged Alliance: Crossfire is a stand-alone expansion to the hit tactical RPG – Jagged Alliance: Back in Action. Crossfire adds new mercenaries, new environments and new weapons to challenge the player’s battlefield planning skills, while offering the combination of humorous dialog and realistic combat fans have come to expect from the series’ decade-long history.Key FeaturesTactical combat at its finest, using the enhanced “Plan ‘n’ Go” system of plotting your team’s moves strategically, then executing them in nail-biting real time\n10 new mercenaries round out your team, offering a roster of more than 50 unique combatants with unique skills, weaknesses and quirky personalities\n10 new maps, set in the unforgiving, frozen mountainous countryside will challenge your planning skills – rocky mountain terrain, narrow valleys and icy cliffs will provide new cover opportunities, chokepoints and offer optimum ambush points\n15+ hours of gameplay across a brand new campaign with a broad variety of missions\nNew weapons, enemies and equipment – supplies are scarce, and your mercenaries will have to make the most of outdated weapons, limited supplies and equipment\nEnjoy the Jagged Alliance series as never before with vastly improved graphics, enhanced AI behavior, a polished interface and numerous performance and gameplay updates","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Coreplay","platforms":[{"id":0,"name":"PC"}]},{"id":12274,"name":"Ballistick","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b2/7b24a3fa8aad810102014cdbaf1e7a07.jpg","description":"Did you watch those stick figure flash videos of the 2000's? Are you a fan of Newgrounds, Xiao Xiao, or Stick Death? If so, Ballistick is right up your alley. An homage to this generation of flash videos, Ballistick offers compelling 2D combat combined with tactical gameplay and hyper-realistic gun mechanics.\nInfiltrate enemy strongholds\nMassacre enemies with ten different weapons/gadgets\nStealth or guns blazing, you decide\nLive the animations that you loved as a kid\nIntensely realistic gore and gun mechanics\nManually add shells to your shotgun, drop the clip out of your M4, or toggle your safety\nRelive the glory days of flash stick animation and kill some stick figures while you're at it.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bomb Shelter Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":12075,"name":"Timespinner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75b/75b9ef03724e9372460535d4587e03ac.jpg","description":"Timespinner is a 2D Metroidvania about Lunais, a young woman who is stranded on a foreign world after the evil Lachiem Empire eradicated her clan. With the Timespinner destroyed and having no hope of returning to the past or her home world, she vows to get revenge on the Emperor himself.\nExplore a vast connected world with beautifully drawn pixel art environments. Travel through time to witness the barren present and the lush past of the planet of Lachiem. Collect elemental orbs and mix their powers to destroy your foes with blades and spells. Befriend mysterious familiars and train them to aid you in battle. Take down an entire Empire!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lunar Ray Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":17839,"name":"Creeper World 3: Arc Eternal","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fb/1fbf551e7e846cc8a5cb6de892e5d11b.jpg","description":"Creeper World 3:  Cellular automata takes over a strategy simulation.  Instead of discrete units that attack your base, a fluid-like substance spreads over the terraformable terrain.  Your base, your weapons, your strategy... you must adapt them all.Creeper World 3 bends what it means to be a strategy title. Instead of heavily scripted A.I., players find themselves engaging an enemy with theoretically predictable behavior yet which is shockingly interesting to engage. Players can build fortifications and stick around forever.  Players can go for domination, quick strategic kills, or amass huge stockpiles of resources.  Some play for speed, others to create art.  Tiny maps, large maps, five minute missions, five day missions...  the simulation scales to handle all of these scenarios.User generated content is critical and supported at multiple levels in Creeper World 3.  Dial up worlds using the DMD (Dial Map Device) and tweak dozens of constraints.  Then, play and share the addresses via an on-line database.  Create your own maps using the built-in map editor and upload and share on-line.  Or, join with thousands of other players and peruse the databases of worlds created by others.  Want to create a new weapon, a unit, an enemy, or an effect?  Use the built in scripting language to create what you dream.  Hundreds of engine commands are exposed and examples abound on the forums and grow daily.  You can even take the built in story maps and make your own.  In fact, all of the built in story missions were written using the built-in editor and the CRPL scripting language.Some of the high level features are:Thermodynamic/fluid physics based play.\nBillions of total missions.\nStory arc with insane and unique enemies.\nExplore hundreds of star systems with thousands of worlds in Prospector missions.\nHundreds of hand crafted missions in the Alpha Sector.\nDial up your own mission worlds using the 'Dial Map Device' and share the address.\nCreate your own maps using the included map editor.\nPlay on maps of variable size, dimension, and shape.\nScript your own enemies and effects using the built in scripting language.\nTerraform the landscape during missions to take the higher ground.\nDiscover experimental weapons that devastate the enemy.\nShare thousands of unique maps with an established, enthusiastic on-line community.\nFeatures a unique, original, and awesome soundtrack.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Knuckle Cracker","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16769,"name":"Twin Sector","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e8/5e8ef3af4be60c7c5afdc5f915cc316d.jpg","description":"The story of Twin Sector takes place in a post-apocalyptic future where the remains of mankind have been put to artificial sleep in cryogenic chambers deep under the contaminated surface of earth — until the planet becomes habitable again.\nYou as the player must take the role of Ashley Simms, the protagonist of Twin Sector. Suddenly awakened by the station's security A.I. system O.S.C.A.R., you face the imminent extinction of all other still sleeping survivors due to an unknown failure in the life support system. According to O.S.C.A.R., you are the only person who was able to be woken and therefore the only individual capable of saving mankind. Within the next ten hours you will need to repair the broken main generator of the subterranean bunker system in order to reestablish the station's functionality. But there are yet unknown forces trying to prevent you from succeeding at all costs!\nTwin Sector is a thrilling physics-based action-adventure which allows players free interaction with their environment. Using the advantages of the powerful HAVOK®-Engine, innumerable puzzles, challenges and enemies await the players in a hostile and threatening futuristic environment. Featuring more than 15 missions alongside a thrilling story line unfolding over the course of action.\nKey features:\nMore than 15 challenging missions\nThrilling and exciting storyline\nInnovative gameplay\nPhysics-based action-adventure\nSolve challenging puzzles in different ways\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"DnS Development","platforms":[{"id":0,"name":"PC"}]},{"id":15420,"name":"Galcon Legends","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85a/85a85d128d80f4743d05a9cfebf39857.jpg","description":"Join Buck the bill collector as he unites the galaxy against the forces of evil.  Send swarms of ships to defeat enemy planets and conquer the universe!\nGalcon Legends teaches the basic strategies of Galcon through a single-player campaign.  The 23 levels can be easily defeated at the lower-ranks, but mastery at the Grand Admiral level will take much more effort!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hassey Enterprises","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10924,"name":"Darkout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1d/e1d70bdb358d85faa2af3aa09ca5bb56.jpg","description":"Crashed and alone on a world mankind tried to leave behind, Darkout challenges players to survive on Illuna, in harsh, procedurally generated biomes, utilizing the game’s sandbox features to build shelters, craft weapons, and research new technologies.\nYou are not alone. Light-sensitive creatures prowling the landscapes become most active at night and in a world shrouded by clouds the security of day will never come, instead, twilight periods allow players minor security to explore, rebuild, and gather resources.\nDarkout’s deep history manifests itself through logs left behind by others, some recent, while others hearken back to long-extinct natives of Illuna, offering glimpses into what events led up to the pandemonium that now persists.\nHow will you survive?Current FeaturesExplore expansive randomly generated worlds\nSandbox Play\nFight Shadow enemies sensitive to Light.\nStrategic Research & Crafting System\nMining, gathering & looting.\nTons of resources, materials and devices you can use to...\nCreate various kinds of weapons, armor, tech, furniture, etc.\nA story for those who like to do more than just explore, craft and build.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Allgraf","platforms":[{"id":0,"name":"PC"}]},{"id":6616,"name":"Pool Nation FX","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/160/1600327931fb1254c09ee478d555f8f5_DIpJFK7.jpg","description":"Pool Nation FX is the ultimate Pool Simulator for Xbox One®. Prepare yourself for pixel perfect physics, photo-realistic graphics and super detailed visuals in this truly immersive representation of the sport.\nPractice, spectate and play live matches seamlessly online, compete in Leagues, share, challenge and create epic trickshots within our exclusive Trickshot Editor, enrol in the Pool Nation Cup, explore our unique rule set customisation tool and re-discover this much-loved sport.\nPool Nation FX flawlessly blends reality with the impossible, resulting in the finest example of digital pool you will ever play.\n","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"CherryPop Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":5467,"name":"Gurumin: A Monstrous Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ee/7eeef717ce75a404c734a793fe5d403c.jpg","description":"Gurumin: A Monstrous Adventure is a fantastic Action-RPG from leading Japanese developer Falcom (Developers of “Ys” and “Zwei” among other classics) featuring real-time combat, stunning 3D graphics, tons of fully voiced characters and mini-games , 90+ items, multiple endings, a rocking soundtrack, 35+ hours of playtime, and more.\nOriginally released outside Japan on Sony’s PSP®, Mastiff is proud to bring a fully localized and updated version of Gurumin: A Monstrous Adventure to Windows and to offer it through Steam with a full set of Steam specific features including Achievements, Trading Cards, Big Picture and Cloud Save.\nThe Story\nGurumin stars Parin, a strong-willed girl sent to live with her grandfather in a small mining town. Parin soon discovers an invisible monster village hidden behind her home. She is quickly drawn into a fight between the village’s friendly monster residents and the Phantoms, evil monsters that want to destroy them. Learning of a weapon hidden underneath the village that she alone is fit to wield, Parin embarks on a quest to stop the Phantoms and make the world right.\nPlay From Your Couch\nFeatures\n30 stages of non-linear game play\n23 non-player characters, 48 unique enemies, and more than 90 items to collect\nBrilliantly diabolical dungeons, traps, puzzles and boss encounters\nMini-games galore!\n5 difficulty levels\nHidden characters, modes, and other secrets\nSupports Windows XP, 7 and 8 at high resolution (up to 1920x1080) and with modern Anti-aliasing (up to 8X MSAA)\nFull Steam support including: Achievements, Steam Cloud, Big Picture mode, and...\nBeautiful Steam Trading Cards\nAn All Star Cast\nAmber Hood as Parin\nTara Strong – Cream/Mosby\nJustin Shenkarow as Puku/Prince\nDee (Bradley) Baker as Rocko/Digby\nRobin Atkin Downes – Pierre/Doug\nMichael Gough – Hyperbolic/Giga\nSteve Blum – Motoro/Bob\nQuinton Flynn – Roger/Poco","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PC"}]},{"id":3322,"name":"Farming Simulator 15","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6f/f6f40e3144903192efdbd8a99335392e.jpg","description":"Special Offer\nAbout the GameWelcome to the new generation of Farming Simulator!\nWith a brand new graphics and physics engine, Farming Simulator 15 offers an immense open world, filled with details and visual effects transporting the Farming Simulator franchise to a new era.\nManage your own farm: from harvesting to animal husbandry, and from the sales of fresh products to woodcutting, the benefits of your exploitation will allow you to develop, and invest in new and more powerful vehicles or tools.\nAcross hundreds of acres of land offered by the new Nordic environment, and a renovated North American environment, use and drive over 140 authentic vehicles and farming tools, from over 40 most famous manufacturers (including 20 new brands): New Holland, Ponsse, Case IH, Deutz-Fahr…\nThis new equipment includes a selection of vehicles and tools entirely dedicated to a new activity in Farming Simulator: woodcutting!\nIn multiplayer, invite up to 15 friends to help you develop your farm. Thanks to an active and passionate community, benefit from limitless new content: new vehicles, tools, and even environments!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Giants Software","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":928,"name":"Flinthook","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a4/1a4769a96d1c5ed2011c905736ad6fff.jpg","description":"DeluxeHere's all the bonus content offered in Flinthook's Deluxe edition:\n100+ pages Artbook featuring:\n- Character design! See the artistic process that led to the creation of enemies, shopkeepers, and Flinthook itself!\n- Concept art! Learn how we came up with the game's setting, the architecture and layout of the spaceships through sketches and color research.\n- Illustrations! Look at the different steps from sketch to print for a bunch of colorful illustrations!\n- And more! Storyboard thumbnails, logo design, sketches and more!\nOriginal Soundtrack by Patrice Bourgeault!\n- 23 tracks of epic pirate-inspired, dance-inspiring chiptune masterpieces!\n- Play the soundtrack in the Steam Music Player or access the MP3 files directly!\n4K Wallpaper collection - 16 wallpapers featuring Flinthook, anchor patterns, the Devil, Sirens, space and other illustrations!\n(All Deluxe edition content will be downloaded to Steam\\\\steamapps\\common\\Flinthook\\Deluxe)\nAbout the GameFlinthook is a fast action-platformer with “roguelike” elements. Become space’s greatest pirate with your hookshot, pistol and slowmo powers!\nZip around with your mighty hookshot!  Aim freely and toss your giant anchor at golden rings to propel yourself around the levels at high speeds, giving you the agility and swiftness needed to dodge hazards and enemy bullets.\nShoot in 360’ through your Blasma Pistol! Take down all sorts of enemies with fresh hot bullets!\nLook really cool with slow-motion powers! Slow down time to adjust your aim or pull off a tight stunt - do it often, it recharges real quickly and it makes you at least 200% cooler.\nBlast through randomly-assembled pirate spaceships! Each level is special, as ships are procedurally built from hundreds of hand-crafted rooms, modified by various variants, filled with extraordinary treasure and populated by random waves of enemies.\nHunt down the pirate lords of the Cluster Clan! Feed your compass creature to pinpoint the bosses’ location, then take them down and bring your bounty home. Your rivals are no space chumps, make sure you’re ready for the challenge!\nCollect rare relics and powerful perk cards! All the treasure you loot builds up your legend - unlock new equippable perks as you level up, buy permanent upgrades in the Black Market, and hoard collectible relics and lore pages!\nUncover some mysterious secrets?! I don’t know, are there secrets in this game? O_O\nAlready a big fan? Get the Deluxe Edition for some extra loot!\nIncludes: the Game itself, Soundtrack, the Artbook and a Wallpaper set!\n23-track Soundtrack by Patrice Bourgeault\n100+ pages Artbook featuring character design, concept art, storyboards, illustrations, sketches and more!\n4K Wallpaper collection - 16 wallpapers featuring Flinthook, the Giant Anchor, the Devil, Sirens, space and anchor patterns!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tribute Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":44662,"name":"TimeLock VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30d/30d900f37f8cc7d1f6559d9697e7b89b.jpg","description":"USE TIME MACHINE TO SOLVE THE PUZZLES\nTime Agents may interact with the objects in different ways: slow down the object time, make time rewinds or even transport objects between timelines!\nAll quests are build with Time Travel mechanic in mind.FIGHT ENEMIES AND BEAT MINIGAMES\nTime Agents must be ready to fight different enemies and even bosses during the Time Travel.\nUse special weapons and Time Control Tools to succeed every action moment!FULLY INTERACTIVE VR ENVIRONMENT\nTimeLock VR offers a fully functional environment with lots of interactions: you can throw objects, open every cabin, turn lighting on and off and much more.\nEach room can be visited in different timelines.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Whale Rock Games","platforms":[{"id":0,"name":"PC"}]},{"id":21446,"name":"Glass Wing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/142/142bc0be03c9de954243a89ce2f36d04.jpg","description":"A nice little 3D puzzle platformer that takes after a lot of my fond memories with great N64 games! This title won 3rd place during the 64digits 2014 spring contest!\nPlay as Mayfly, a young girl literally snatched away from her normal life by Ferace, a humongous​ demon. Mayfly is weak and powerless, knowing nothing of combat, so instead she must use her wit and agility to get as far away as possible from Ferace and the mindless monsters that he warns her about.\nIn her adventure she encounters many tools, all of which prove to make for bad weapons in her hands, think about what the tools are good for in real life and it will all come together.\nBack in 2014 This game was originally designed to play with keyboard and mouse, the option to support gamepad controls was added later on demand using Game Cube and Logitech controllers. While those can work the game just fine, X-Box360 and similar controllers has a different analog axis orientation which was not able to be tested originally when building the gamepad support.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"From Soy Sauce","platforms":[{"id":0,"name":"PC"}]},{"id":18292,"name":"Flight Control HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/442/442a9b49776b6b8cc3d2cac4f1b240c6.jpg","description":"Control a never-ending stream of aircraft in this insanely addictive worldwide hit from Firemint!\nYou’re an air traffic controller at an increasingly busy airport; just point and drag aircraft to their landing zones with your mouse or trackpad. Sounds easy? It isn’t! You’ll need nerves of steel and smart strategy to keep the chaos under control. Flight Control HD has been especially redesigned for PC and Mac, with updated graphics and an even tougher new challenge – the Steam exclusive Stunt map where you can increase your score by flying through the gates before landing!\nFlight Control HD is insanely addictive – easy to start, but impossible to stop, so get it now and find out what everyone is raving about!\nKey features:\nEnjoy 9 maps of varying difficulty to suit players at all levels\nSteam exclusive “Stunt” map for players looking for a challenge\nUnlock achievements, compare with your friends on Steam\nGlobal leaderboards and rankings through Firemint’s cloudcell.com community site\nFast-forward mode for advanced players\nRetro styled graphics inspired by the golden era of aviation\nInfinite replayability as you chase ever higher scores!\nSteam Cloud support – pause your game and continue from anywhere!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Android"}]},{"id":16735,"name":"Reveal The Deep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f5/1f53c7054dfd91c7ae6efe2cc6c75ea9.jpg","description":"Reveal the Deep is a short exploration-based indie game, where the user traverses through the wreck of a 19th century steamship.\nThere is a heavy focus on piecing together the story of the ship's past, through a variety of notes and clues.\nPuzzles and mysteries will be encountered all the way through!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lazy Monday Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":16169,"name":"Biodrone Battle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5e/d5ed1fd96bb386352a3265d1af4d08c6.jpg","description":"\"Looks well made and polished.\"\n-Kotaku\nSomewhere  in the far future, mankind succeeded in building the first artificial beings from biological and electronic components.\nNot surprisingly, one of their first applications were as highly intelligent battle drones. These drones are called Bionics. The Bionics constantly enhance their artificial brains by learning rapidly from all previous perceptions. Their self-awareness develops day by day. Eventually, they chose to turn against their creators.\nAll training rooms in the laboratory are now occupied by aggressive battle machines. Their utmost desire is to survive in all scenarios and to preserve autonomy.\nYour mission is to eliminate all hostile drones fighting to keep their recently gained autonomy.\nA remote-controlled drone is the only way to defeat the rebels by using two methods that go hand in hand: shooting and morphing.\nUnfortunately, your starter drone is too weak to compete with much stronger opponents. Therefore, morph into more powerful drones in order to benefit from their abilities for a limited time. Here's the drawback: you cannot morph without energy packs dropped by killed drones which leads back to method one - shooting.\nThe game is a tribute to the memorable Paradroid.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"voodoosoft","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9547,"name":"Varenje","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d63/d6386a060b50925c7c6f592062d07301.jpg","description":"Special OfferFor supporting us we want to give you some advantages.\nWhen the game will be released you will receive next benefits from buying Early Access version:\nReduced game price (because full version will cost more)\nDLC with OST and Digital concept art book for FREE\nYour name in \"Special thanks\" section in the Full version of the game\nAbout the Game\n\"All grown-ups were once children... but only few of them remember it.\"\n― Antoine de Saint-Exupéry\nIt's all drawn - anyone can easily play as Varenje doesn't have any texts or dialogue.\nYou will find the steps by yourselves - it's a puzzle for a reason!\nGet yourself a little summer's day with a raspberry jam adventure!\nOur hero was spending summer happily at the cottage until curiosity forced him to sample an unknown berry at the stream. Before he knew it, everything had become incredibly large, and he was reduced to the size of a bug!\nTrying to understand what happened and how to return things back to normal, we set off into the invisible to the human eye tiny world, where worms, beetles and spiders live their life, and build bizarre vehicles, in disguise so that humans do not realize.\nOur new friends will surely help us by discovering the secret healing potion, which will return us to our previous dimensions. All we need is to collect enough raspberries to cook grandmother's jam. And as we all know - this is a remedy for all ills!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Play Cute","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5933,"name":"About Love, Hate and the other ones","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e6/8e6e8aa27d95fa288ed0dec3a48dac9e.jpeg","description":"About Love, Hate and the other ones is a puzzle game, in which you influence your surroundings by the force of Hate and the power of Love.\nThey shouldnʻt have pushed the button! Life on the hill was just perfect for Love and Hate before that shiny red device appeared. Suddenly, they are trapped in a dark and spooky cave, far away from home.\nNow it is up to you to control the opposing forces of Love and Hate. They will soon meet a lot of Other Ones, wondering how they might react when Loved, or when Hated. Find a way through caves and ice, castles and factories, all by the might of your puzzling! If you ever return to that hill, life will be sweet again...","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Black Pants Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5590,"name":"MotorStorm: Pacific Rift","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e7/9e7a999efff7b40bcb635ac7934d6941.jpg","description":"It’s time to take to the starting grid again as the MotorStorm® festival heads to the tropics. MotorStorm® wowed racing fans with its heady formula of brutal, unpredictable off-road racing, festival vibes and stunning scenery. This new outing takes you to a solitary tropical paradise in the Pacific Ocean, ready for a whole new take on no-holds-barred racing action through thick swamps, dense jungle, towering peaks and steaming volcanoes.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3899,"name":"Rain","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92e/92e6aed958318c573418b307da905526.jpg","description":"rain™ is the enchanting tale of a boy who embarks on a journey to save an invisible girl from ghostly creatures. Upon entering the world he discovers that he has also become invisible and must learn to navigate through the unknown, using the rain to guide and protect him.Key Features:• Unique Puzzles - Control an invisible boy who can only be seen in the rain. Use the surrounding environment to create cover or distract enemies.• A Fully Immersive Experience - Picture book art style, speechless narrative, expressive sounds of rain, and atmospheric music all combine to truly immerse players in the world of rain™.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©2013 Sony Computer Entertainment Inc. Rain is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SCE Japan Studio","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":2103,"name":"Snakebird","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d5/0d54bb56c22bf946daadb29ab321a55b.jpeg","description":"What is the longest possible length a bird can be? Obviously a question only all the fruit in the world can answer! But where could all this fruit be hiding? Follow Redbird, Greenbird and Bluebird on a quest for an amount of fruit beyond any birds wildest dreams.\nSnakebird is a very simple but deceptively challenging puzzle game about assuming the right shapes for the task at hand, be it pushing, lifting, teleporting or just defying the laws of physics.Key features:Over fifty challenging levels\nNon-linear world map\nSeveral different zones with their own themed puzzles\nSnake-like birds with narcolepsy\nDynamic fruit-powered length gain system","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Noumenon Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":2049,"name":"Severed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a6/3a6b9d0d0d903bcf864fe7ab9295dba9.jpg","description":"** Apple iPad Game of the Year 2016 **\nTake control of a one-armed warrior named Sasha, wielding a living sword on her journey through a nightmare world in search of her family.\n----- ACCOLADES -----\n• \"iPad Game of the Year\", Apple 2016\n• \"Best Mobile Game of 2016\", Destructoid\n• \"Best Mobile Game + Best Musical Score\", Canadian Video Game Awards 2016\n• \"Battery Park Award for Best Handheld Game\", 2017 New York Game Awards\n• \"Handheld Game of the Year -- Nominee\", 20th Annual D.I.C.E. Awards\n• \"Mobile Game of the Year -- Nominee\", 2017 SXSW Gaming Awards\n• \"Best Mobile Game -- Nominee\", The Game Awards 2016\n• \"5 best mobile games of 2016\", GameSpot\n• \"Best Mobile Game of 2016 -- Nominee\", IGN\n• \"Top 10 best iOS/Android games of 2016\", PocketGamer\n• \"10 best video games of 2016\", Mashable\n\"Severed is a super compelling game that looks great. Its mechanics go to surprising depths and the sword-swiping combat feels fantastic on iOS.\" 5/5 - 148Apps\n\"With great game mechanics, unique artwork and tough to master gameplay, Severed is well worthy of your time.\" 8/10 - Post Arcade\n\"Severed is just a game that's all-around cool. Its aesthetic is top-notch, its combat is deep and engaging.\" 5/5 - TouchArcade\n----- KEY FEATURES -----\n• Dungeon Combat: Master offensive and defensive touch combat techniques to survive intense battles against a menagerie of enemies.\n• Severing: Best enemies in combat for a chance at severing their body parts -- then wear them to gain new powers or consume them to upgrade your equipment and abilities.\n• Exploration: Follow branching routes through the unknown, using your wits to avoid hazards and solve puzzles.\n• Award-Winning Soundtrack: Immerse yourself in the haunting original score from Juno- and Polaris-nominated band YAMANTAKA // SONIC TITAN, featuring Pantayo.\nAlso includes:\n• Graphical optimizations for Metal-enabled devices\n• Gameplay video recording with ReplayKit (requires Metal-enabled device running iOS 9+)\n• Multiple difficulty modes\n• Game Center Achievements\n• Cloud Save\n• iMessage Sticker Pack (requires iOS 10)\n• 3D Touch support (3D Touch-enabled device required)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DrinkBox Studios","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"}]},{"id":804751,"name":"Crisis Core: Final Fantasy VII Reunion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6c/f6cfffdb246351c35b6f07a8bcf6e748.jpg","description":"His legacy, gave life to FINAL FANTASY VII──\n\nSince its original release in 2007, CRISIS CORE –FINAL FANTASY VII– has received wide acclaim for its deep and emotional story.\n\nThis new version enhances the graphics to HD and updates all of the 3D models in the game. Full voiceovers and new music arrangements present this epic tale of strife and heroism, presenting FINAL FANTASY VII in a brand-new light. Enjoy a more beautiful and accessible CRISIS CORE, going way beyond just a simple HD remaster.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":522982,"name":"Phoenix Point: Year One Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f9/1f9b4a079f9689db4874dd0a0a288451.jpg","description":"Phoenix Point: Year One Edition is the definitive version of the acclaimed strategy game from the creator of X-COM, collecting all previously released DLC, updates, and additional content.\n\nThe Earth has been overrun. A mutating, alien menace threatens the last remnants of mankind. Only the Phoenix Project, a secret organization of the best minds and bravest soldiers left on earth, can repel the aliens and reverse the inevitable. It's up to you to lead the Phoenix Project: research and develop new technologies, explore a ravaged globe, build your bases, manage resources, and dominate the battlefield.\n\nBut you won't be alone. Factions, including the corporatist New Jericho, the indecisive Synedrion, and the fanatical Disciples of Anu, as well as offshoot subfactions, have their own values and view of the Pandorans. You can choose to work with factions via Phoenix Point's diplomacy system, or you can simply crush all around you with military might. No matter what you choose, it won't be an easy victory.\n\nYear One Edition Features:\nTons of Content: The Year One edition of Phoenix Point includes all previously released content: 3 DLC Packs (Blood & Titanium DLC, Legacy of the Ancients DLC, and the Living Weapons Pack) and a slew of updates, upgrades, fixes, and new content suggested by our community.\n\nMutating Alien Menace: Face down an ever-changing alien threat that adapts to your tactics and offers no respite even as your team becomes more powerful and technologically advanced.\n\nUncover the Secrets of the Pandoravirus: Engage with a complex narrative, complete with multiple endings that the player can only uncover via several playthroughs. Explore, research, and discover a secret history, as you learn about the origins of the mutants, the Pandoravirus, and Phoenix Point itself.\n\nManage Diplomatic Relations: The Phoenix Project is not the only organization trying to reclaim the Earth. The militaristic New Jericho, the mystical Disciples of Anu, and the technophiles of Synedrion all offer unique rewards for co-operation and threats for opposition. It is up to you to decide how, or even if, to deal with them.\n\nTake Aim on the Battlefield: In addition to equipping and commanding units, Phoenix Point lets you take direct control of your soldier's shots in combat, with a unique free-aiming system. Target enemy weakspots, weapons, or valuables, or just go for center mass.\n\n\n\nNext-Gen Tech with Classic Pedigree: Phoenix Point was designed by Julian Gollop, the creator of the X-COM series in the 1990s. Integrating the core ethos of X-COM while updating the visuals, technology, and systems to modern standards has made Phoenix Point best-in-class.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Snapshot Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":479670,"name":"Hood: Outlaws & Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/220/220eb5b32d6ce6baf040568e502b0183.jpg","description":"We are all Outlaws… but some of us will become Legends.\r\n\r\nFaced with a merciless, unchecked state, rebels and rogues from every corner battle to claim their place among legends. To win influence with an oppressed people, rival gangs now compete in daring heists to hit the wealthy where it hurts. Folk hero or gold-hungry outlaw, only the best will escape with hard-earned riches.\r\n\r\nGather your team of outlaws and attempt to steal treasure from an oppressive government in a dark and violent, medieval world.\r\n\r\nTwo teams of players compete to execute the perfect heist, in environments patrolled by deadly AI guards. Utilise the unique skills and mystical abilities of each character, moving in stealth to steal treasures unseen or dominating through loud and brutal combat.\r\n\r\nBlood will be spilled. Riches will be stolen. Legends will be reborn.\r\n\r\nOutplay opponents in intense PvPvE multiplayer heists\r\nExperience a violent medieval world where ancient mysticism competes with man-made power and corruption\r\nClaim your loot and invest in perks, weapons and bold new looks\r\nPost launch support with new maps, characters, game modes and events","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sumo Digital","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":30501,"name":"Chip's Challenge","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef1/ef12e8776d0e13d91083a7bcdad02a07.jpg","description":"Before Chip can join the Bit Busters computer club and hang out with the girl of his dreams, Melinda the Mental Marvel, he must solve all 144 challenging puzzles.\n\nYour bird's-eye view can help Chip rush through the puzzles and mazes before he's deleted by monsters, traps, and the passage of time. Show Chip how to use blocks of soil to overcome water traps and cherry bombs, find keys, and pick up the computer chips which Chip needs to solve some puzzles.\n\nCan you help Chip win the cold heart of his one true love and become an official Bit Buster? If you can't, no one can!","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Epyx","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Atari ST"},{"id":0,"name":"PC"},{"id":0,"name":"Atari Lynx"},{"id":0,"name":"NES"}]},{"id":15970,"name":"Ys VI: The Ark of Napishtim","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2c/c2c787f80b85c6230eec4b151e0fa38d.jpg","description":"Red-haired adventurer extraordinaire Adol Christin has finally reunited with his best pal, Dogi, and is eager to set sail for new adventures in Afroca. It seems fate has other plans for him, however, as a pirate captain named Ladoc makes him an offer he simply can't refuse: a chance to explore a dangerous, uncharted archipelago in the Atlas Ocean that may hold treasures of heretofore unseen value.\nNever ones to back away from a good mystery, Adol and Dogi both agree to join Ladoc on this expedition aboard his ship, the “Tres Mares” -- but no sooner does it weigh anchor than the Romuns, their sights set on the same curious islands of Canaan, attack the wayward pirates and ultimately knock Adol overboard, leaving him for dead.\nSome time later, he washes ashore in Canaan itself, alive but weakened, rescued and resuscitated by two young girls named Isha and Olha who sport long ears and bushy tails. They are of the native “Rehda” tribe, and it seems Adol is not the first human to arrive here -- nor are humans particularly welcome...\nCome experience the very first 3D Ys game as you've never experienced it before! Already the foundation upon which Ys: The Oath in Felghana and Ys Origin would later be built, this version of Ys VI: The Ark of Napishtim comes equipped with an original translation and brand new, entirely unique gameplay features such as the addition of a super hardcore “Catastrophe Mode” for fans of the later titles, full widescreen support, map warping, Steam achievements and leaderboards, and even a full digital art book packed with concept sketches, hi-res character portraits and original production PSDs.\nSee what you've been missing with this definitive version of the game that brought Ys into the modern era!Key Features:\nFast, real-time combat centered around elemental swords with unique magical abilities\nEnormous screen-filling bosses set to quintessentially Ys rock music composed by the legendary Falcom Sound Team jdk\nA deep and involving story that ties into Ys history and serves as a cornerstone of series lore\nBrand new “Catastrophe Mode” where healing items can’t be purchased or stored, to create a gameplay experience more in line with later entries\nAdjustable high-resolution PC graphics and gamepad support\nNewly-added ability to warp among checkpoints\nSteam achievements and leaderboards","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PSP"}]}]