[{"id":49603,"name":"Home - A VR Spacewalk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c45/c45ffc68a62df9d3ebb8b94efd883d3b.jpg","description":"Throw yourself into the void 250 miles above Earth in this award-winning VR spacewalk inspired by NASA's training program and the astonishing experiences of its astronauts. Home puts you at the center of the story, taking you on an emotional and personal journey while delivering beautiful, heart-stopping, and memorable moments.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BBC","platforms":[{"id":0,"name":"PC"}]},{"id":43989,"name":"Trophy Fishing 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ed/8ed9b0881cf706df2b01f8c094539e2d.jpg","description":"★ Beautiful and realistic 3D environment\n★ Diversity of game maps and locations\n★ More than 850 species of fish, carefully selected in accordance with their real habitats\n★ About 100 different kinds of bait\n★ 3 types of fishing rods (float, spinning, bottom)\n★ Wide choice of different rods with original leveling\n★ Ability to fish by 3 rods at the same time\n★ Tournaments, competitions and quests\n★ Over 250 different achievements\n★ Shop, in-game market, crafting unique baits\n★ Chatting in a chat room","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Overgroup","platforms":[{"id":0,"name":"PC"}]},{"id":43852,"name":"Slash It Ultimate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f8/1f8ca761d11513d2bc5178ec5fbd61df.jpg","description":"Slash It Ultimate is a colorful rhythm arcade game that uses a mix of 2D and 3D play styles.\nThe goal of the game is to play the rhythm of a song through various game modes and compete with other players!The game will feature:15 songs\n7 game modes\n2 difficulty levels for each mode\n800+ leaderboards, show your skill and compete with others, see your ranks among your friends or global!\n500+ challenging achievementsGame Modes:Arrows Mode - use keyboard arrow keys to slash trough the beat of the game\nMouse Mode - use your fast reflexes to catch the beat with your mouse\nNumbers Mode - challenge your number typing speed with different twists\nCube Mode - collect the beat, avoid obstacles and fight against the camera view as it changes\nSpace Mode - just press the space key, when the beat reaches the middle of the screen\nWords Mode - challenge your word typing speed, the faster you type the more you need to handle\nAlphabet Mode - challenge your letter typing speed with different twists\nMouse Mode - collect the beats with your mouse, are you fast enough?Additional Info:All game modes have their own unique visual effects\nEvery mode is challenging\nA lot of playtime\nThere will be options to play in other languages for Alphabet and Words game Modes (English,German,Korean,Russian,Chinese,Japanese,French,Spanish,Portuguese-Brazilian,Ukrainian,Turkish,Polish... and more to come)\nGame will be updated with new songs monthly\nThree different leaderboard displays:\nfriends only leaderboards - view all your Steam friends progress compared to your own\nglobal leaderboards - view the world's top 20 players for each leaderboard\npersonal leaderboards - view your own current ranking among other players\nFeatured Songs\nJanji ft. Johnninh - Heroes Tonight\nJanji - Horizon\nJanji ft. TR - Milky Way Stars\nA Himitsu - Cease\nA Himitsu - Stories\nA Himitsu - Lost Within\nElexive - Beach Buggy Ride\nElexive - Bloody Pumpkin\nIndigo - Hope\nJOA Mabeha - Skyward\nNiki Kofman - Maelstrom\nNiki Kofman - Tropicom\nQuasar Music - Madness\nRolipso - Jumble\nWhithe - Garcion","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":31584,"name":"Eternam","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d3/6d3fc9244fe8d9c1edb075817a20eceb.jpg","description":"Congratulations Don Jonz! You have just won a Virtual Adventure Vacation on Eternam, the biggest and best planetary Funpark in the galaxy.\nHard working intergalactic Space Marshals like yourself deserve to experience the ultimate gateway. Travel through 3D landscapes to more than a half-dozen past human eras, populated with life-like-bio=tech creatures offering tongue-in-cheek remarks. From the age of the pharaohs and the realm of medieval knights to the French Revolution and beyond, you'll have the adventure of a lifetime...or several.\nBut, Mister Jonz, there is a slight problem... Dragoons still inhabit Eternam wanting to reclaim the park and have joined forces with your arch-rival Mikhal Nuke. They plan to ruin your vacation in a big way!\nAt least you can count on help from the beautiful Tracy, a technician on the Eternam coordination team. Unfortunately, to escape Nuke's evil clutches,, she has dematerialized into the Funpark's computer network, so Tracy will communicate only via a computer screen.\nYou'll need intuition, courage, wit, diplomacy, charm and a surreal sense of humor. Only you can save Eternam - and yourself. But who wouldn't face all challenges to win Tracy's smile. So...Enjoy your vacation, Mister Jonz!","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Infogrames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":29114,"name":"Rez HD","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8f/f8f0ff80a5a9210d4c3b67c3e48b02c8.jpg","description":"Single Player, 5.1 Surround Sound, HD (High Definition). Set in a cyberworld, this legendary fast-paced action-shooter created by Tetsuya Mizuguchi will provide the ultimate audiovisual experience as you target the enemies and hack the system while creating your own beats.  Five challenging areas, each with its own theme as well as unlockables waiting to be discovered.  Don’t be afraid to dig deep into the world’s computer network! This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Q Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":25190,"name":"Madden NFL 08","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/018/0186b69ed1cf4c3cef5bae456f8312b4.jpg","description":"The unstoppable football franchise enters the third year of its\nfive-year exclusivity contract with the '08 entry in the series. Play\nwith only the Wii Remote with EA SPORTS Family Play or use the Wii\nRemote and Nunchuk for more advanced controls. Featuring an all-new\nParty Mode, in which you can play trivia or chose from 22 minigames.\nBreak-down plays and highlight key moments with the all-new Madden NFL\n08 telestrator. Bring the game online, play head to head with friends\nand keep up to date with the live sports ticker for the ultimate online\nexperience.\n\nAll-new Read & React System — New player skill icons identify on-field\nstrengths and weaknesses, providing an immediate read on what your\nopponent is giving you. Quickly react, create mismatches, and exploit\nopponent weaknesses before every play.\n\nSpectacular Catch — These receivers perform amazing catches that no\nother receiver can complete.\n\nBig Hitter Shutdown Corner — Spectacular catches will often leave the\nreceiver vulnerable to big hitters.\n\nSmart Safety — Smart safeties read the offense.\n\nAiming Arrow — Clutch kickers hardly ever miss.\n\nAll-New Front Office Mode — Take full control of every aspect of an\nNFL franchise. Construct a state-of-the-art stadium, set concession\nprices, hire your coaching staff, draft players, and manage the entire\noperation from the top down to build your dynasty.\n\nYour Ring of a Champion — Increase your Madden Gamer Level to help\ncreate and customize your own in-game championship ring.\n\nMadden Unmatched — All-new player moves, including auto-motion,\nbackward passes and low-hitting tackles, plus ultra-smooth gameplay\nprovide the most realistic NFL gaming experience ever. Control\nreceivers and make spectacular catches or key possession receptions,\nor roam the secondary and jar the ball loose with big hits and\nball-stripping tackles.\n\n\n","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts Tiburon","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22149,"name":"Serious Sam's Bogus Detour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db4/db4bdd896016212652770671ec6b17cf_WD00ZSb.jpg","description":"Serious Sam’s Bogus Detour is an all-new action-adventure in the legendary Serious Sam saga from Hammerwatch developer Crackshell. Battle through beautiful Mediterranean locales, dangerous biological weapons labs and even high-tech moon bases as a one-man wrecking crew or in four-player online cooperative for maximum chaos! Dominate the chaotic Survival and Versus modes or make your own mods, modes, and even total conversions with the include game editor. Serious Sam’s Bogus Detour is the biggest little Serious Sam game ever made!\nCampaign Mode: Solo or 2 – 4 Players Online with Experience and Level Up Perk System\nVersus Mode: Deathmatch and More for Up to 12 Players\nSurvival Mode: Solo or Up to 12 Players\nFull Mod Support: Game Editor and Dozens of Mods Ready or In Development","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Croteam","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21227,"name":"Lilly and Sasha: Guardian Angels","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1de/1de1a32e043d4c6233f58685db8b2564.jpg","description":"Part 3 in the Lilly and Sasha series.\nAfter Sasha was deemed unworthy of redemption, she passed through the Nexus of Souls. Lilly, who had promised Sasha that she would never give up, followed her through the portal.\nMeanwhile, Zahhak is more powerful than ever. With Lilly gone, Griffin and Dak must find a way to stop Zahhak.\n* More new and exciting usable items like the bird whistle, crane controller and more make for new and exciting puzzles\n* Visit the town of Balyang and try your hand at the puzzle dungeon\n* Detailed quest journal to keep track of quests\n* Battle alongside your pets\n* Continue your save file from the previous Lilly and Sasha games","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"John Wizard","platforms":[{"id":0,"name":"PC"}]},{"id":19090,"name":"Vinyl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15c/15c8c16487a2f049d33d52b2869ab82d.jpg","description":"Vinyl is a dynamic indie music game created by graduate students at the University of Utah EAE program, that experiments with the aesthetic distance between gameplay and music.\nEvery Song is Unique:\n- Load your own music.\n- Your music procedurally generates the world...\n- The way you play changes the music!\n- Pick a music genre and let Vinyl remix your song how you choose.\nArcade Styled Runner:\n- Dodge all of the obstacles to see your music in vibrant neon synesthesia.\n- Make mistakes and your music will be taken back in time.\n- Rewind to undo your mistakes, and your score.\n- Collect audio filters to manipulate your music even more, and score more points!\n- Too easy to dodge obstacles? Boost to increase your multiplier and gain the ultimate score!\nScore Attack:\n- Use all of your abilities to rack up points.\n- Challenge the online leaderboards.\n- Enter your initials to claim the number one spot!\nVinyl: Play Your Music","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Manipulation Machine","platforms":[{"id":0,"name":"PC"}]},{"id":18731,"name":"Acan's Call: Act 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83c/83c8e099f878ef168a973fd6d74a1205.jpg","description":"Sword and Shield in hand, fight your way along this sword-fighting experience, exclusively for VR.\nPlease note that the Act 1 serves as a proof of concept for the fighting system.\nWe need your help to develop an amazing game.\nTry it with your friends and family and send us your feedback for the upcoming episodes (which will be bigger in terms of content and play time).\nThe experience should take around 10 to 15 minutes to complete... that is if you reach the end alive!\nThis game was developed by Cyberith GmbH, under the Lead Developer Pierre Mercy.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cyberith","platforms":[{"id":0,"name":"PC"}]},{"id":17783,"name":"Real Warfare 2: Northern Crusades","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/271/2712cf5ccdabd0648243895f9f340b80.jpg","description":"Real Warfare 2: Northern Crusades is the next installment in this series of realistic real-time strategy games covering various periods in the development of the present day civilization – from the Middle Ages to today. This new title helps players witness the key events in the history of the Teutonic Order in 13th century, namely conquering the pagan Prussia. All battles form a single storyline campaign. The player will act as a Komtur of the Teutonic Order as they relive the battles of the crusaders, regardless of the low manpower of the Order and the strong resistance of the heathens.\nThe project perfectly comprises two types of gameplay and owing to that the objectives of the Komtur are not simply limited to participation in battles. The strategic map involves the gamer into a colorful and integral world and allows them to travel around the map in the real time. The mode features full freedom of movement, dialogues with locals, RPG elements, quest system and much more. However, sooner or later, the players will have no other choice other than engage their faithful warriors into a battle. And this could be a combat with other armies, large-scale sieges of towns and castles, using various special assault weaponry and tools and fight right on top the walls and fortifications.\nKey features:\t\t\t\t\t\tRPG system. Troops gain experience throughout the campaign and carry it over from battle to battle.\nCombat system. A unique combat system, dependent on up to 80 game factors. Moral component of the combat system evaluates the battlefield situation every second to bring the simulation of combat behavior for the “living” warriors as close to reality as possible.\nUnprecedented scale. Real Warfare 2: Northern Crusades features not only really large-scale battles with more than 10,000 warriors engaged, but impressive and unprecedentedly vast actions during the siege and defense of towns and castles, using various special assault weaponry and tools and fight right on top the walls and fortifications.\nFreedom of actions. Variable modifiers consider the environment a unit is battling in and make the game tactically versatile.\nTwo gameplay modes. The game now features a strategic map, where the player can travel around the world and interact with various characters; however the battles will be carried out in the well-known tactical mode.\nNetwork game. Apart from the storyline campaign the game features several diverse multiplayer modes. From 2 up to 6 gamers can participate in a battle at a dedicated Internet server. The results are stored in online Hall of Fame.\nState-of-the-art graphics. Graphics engine used in the game provide for the highest level of details. Historically correct armor and weaponry, realistic animation and battle scenes, which correspond to the specific period – Real Warfare 2: Northern Crusades depicts the 13th century in great details.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Unicorn Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":17408,"name":"Fire With Fire Tower Attack and Defense","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/912/91220f3d141f20082491b5286bec6673.jpg","description":"Fire with Fire is an online player vs player tower defense strategy game about ascendant fireball creatures fighting over the last remaining fuel sources of a dying planet. Save the trees and rise up the leader boards. New unique towers, creeps and arenas in development.Core FeaturesOur own system improving on traditional Tower Defense elements such as tech trees and tower upgrading.\nPlayer vs player online matchmaking, opponents choose and deploy waves of creeps against each other in turn.\nAchievement based leveling, players gain xp points by completing achievements, single player maps and defeating matchmaking opponents.\nUnlock-able bonuses, grow fruit to gain stat bonuses and additional in game effects for your online matches.\nOngoing content updates, we add new towers, creeps, arenas, and balance updates regularly.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Theory Georgiou","platforms":[{"id":0,"name":"PC"}]},{"id":17067,"name":"Draw a Stickman: EPIC 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/666/66671fd647f898d1432e036869b815af.jpg","description":"Grab your pencil and get ready for the most creative DRAW A STICKMAN adventure yet!!\nImagination is the key, as you enter a magical storybook land full of mystery and wonder, unusual creatures, and enigmatic puzzles!  Create your own original stickman, and then watch it come to life in DRAW A STICKMAN: EPIC 2!  Challenge yourself to unlock every secret, collect every drawing, and share your creativity with the world!\n\nA NEW STORY!\nEmbark on a perilous journey through time!  Draw your Stickman, and create a friend!\nBut be warned… disaster falls upon your ally!  It’s up to you to become the hero!\nManeuver your way through the magical world of EPIC 2 in a quest to save your partner!\n\nYOUR DRAWINGS MATTER!\nCreate and save unlimited drawings in your sketchbook!  Use them throughout your adventure!\nSHARE WITH FRIENDS!\nWith the new share feature, you can now send your creations to your friends!  They will then be able to use your drawings in their own epic adventures!\n\nFIGHT EPIC BATTLES!\nFace off against inked-out goblins, tongue-lashing frogs, fire-breathing dragons, and BIG bosses! You must use your own strategies to solve intriguing challenges and puzzles, while battling all new villains!\nJump in to this action-packed adventure that allows for endless creativity! As you explore each colorful environment, choose from an assortment of drawing pencils and tools to help you successfully overcome every obstacle along the way. New features and enhancements allow you to choose from a larger color palette, along with a variety of pencil sizes.  With the new share feature, send your drawings to your friends!  Unlock hidden Color Buddies, locate puzzle pieces, and enjoy new drawing pencils for Wires, Eggs, and Ice!  This is an experience like no other, personalized by you!\n\nDRAW A STICKMAN: EPIC 2 is the sequel you’ve been waiting for, and is sure to offer hours of entertainment to avid gamers and creative minds alike!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hitcents.com","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":16881,"name":"Goblin Defenders: Steel‘n’ Wood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/751/751860e2a2c6d2f91aa4e2b496512c32.jpg","description":"Tired of boring tower defense games? Goblin Defenders: Steel 'n' Wood breaks the mold with exciting and unique action! Why fight off enemies pouring in from one direction, like most other games, when you can battle hordes of monsters coming at you from all angles? That's what Goblin Defenders is all about!\nStart with three guns capable of ripping through crowds of attackers and steadily upgrade your arsenal as the game progresses! But beware: the game gradually becomes more difficult as enemies approach from more and more directions! Your survival will depend on your ability to make the right choices when upgrading your weapons and towers. Ogres, spiders and evil spirits are coming for you, so answer their challenge in Goblin Defenders: Steel 'n' Wood!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":13783,"name":"Twisted Worlds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/289/2892a81dc1da6a6cc086d119a2a8fe1f.jpg","description":"Travel back in time and reconstruct the world chronology in Twisted Worlds. Explore whimsical hidden object locations in two dimensions and save the day!\nFeatures:\nThe most extraordinary hidden object casual game!\nUnparalleled time travel to save the world\nBreathtaking cutscenes, animations and HOS visuals\nReal and magic worlds to explore\nA must for sci-fi geeks, history buffs and hidden object games fans!\nA cast of mysterious creatures to guide you\nOver 20 changing locations to explore in two worlds\nOver 10 Hidden Object modes for devoted finding games fans\nOver 2000 tasks which disclose true historical events and forecasts for the future\nUnique mechanics of crafting boosters from the found ingredients\nOver 1100 days of gameplay for mystery games geeks\nAn unknown event dated back at the turn of the common era affected the timeline and caused the two worlds collide. Now you must start the time machine and find hidden objects associated with the core events of the passed years to reconstruct the world chronology. Beware! The brink between the two worlds has become too vague, so, no one could predict what reality you end up at your next time leap. Any seek-and-find location may appear in its true or mystic perspective, while the item list is presented as either letters, numbers or symbols. Cleverly hidden on the scene, they are scattered randomly each time you enter the location, providing limitless i-spy experience.\nAs you journey to the past, you will collect souvenirs from each year you come to be in order to complete different tasks and earn experience points. As you progress through the storyline, you will witness the development of the modern civilization in its various aspects – science, technology, philosophy, politics, art and more. Each collection you complete displays the evolution of a particular instrument of human culture and make an assumption of its further advance.\nIt’s time for the quest of your life! Find yourself in a twisted reality, search for hidden symbols, decipher the meaning of the secret numbers and open the gate to the future in this breathtaking sci-fi adventure game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Absolutist","platforms":[{"id":0,"name":"PC"}]},{"id":13076,"name":"Impulse of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/028/02863b4bff4152b4a90bcec97a11a04f.jpg","description":"Stop! You haven't captured the train yet? Didn't  build a base and haven't mastered the planet? I won't jump from a springboard to take the flag! I'll be waiting for you!\nDifferent types of vehicles:\n- Buggy\n- Tanks (NEW!)\n- Hover (in development)\n- Terrain Vehicles (in development)\n- Spaceship (in development)\n- Mega-robots (in development)\nDifferent modes:\n- Building base\n- Capture a train\n- Capture the flag\n- Deathmatch\n- Hover-racing with shooting (in development)\n- Capture the points (in development)\n- Capture the fort (in development)\n- Mega-robot vs All (in development)\n- Clan wars (in development)\n- Tournaments (under development)\n- Co-op mode (in development)\nModular editor vehicle:\n- Primary weapon (blaster / gun, etc.)\n- Secondary Weapon (shocker, energy shield, etc)\n- Armor Plates\n- Protection of the wheels\n- Spoilers\n- Colors\n- Trails\n- Wheels (in development)\n- Camouflage (in development)\n- Flags (in development)\n- Toot (in development)\n- Engine sound (in development)\nBuilding base:\n- The main building, which generates income\n- Other 10 buildings (in development)\n- Ability to build springboards (in development)\n- Teleports (in development)\n- Clan Base (in development)\nCommunication:\n- Chat\n- Invitation to battle(NEW!)\n- Clans (in development)\n- Friends (in development)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dmitry Medvedev","platforms":[{"id":0,"name":"PC"}]},{"id":12352,"name":"Kalaban","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aeb/aeb515061cb0fbd1c1f63c27e6829b45.jpg","description":"Kalaban is a horror-themed 2D action-adventure by Rayhouse Productions. The game focuses on story-telling and open-ended gameplay.\nSTORY:\nThe game is set in the year 1995, in an alternate history version of Finland. The main character of the game is Bob, a hermit and an American who has moved to Finland. Bob's cabin is attacked by a mutant monster, which triggers the story. He must find out what is going on around him and discover the reason behind the weird outbreak.\nFEATURES:\nUnique story and characters: While the game has a basic premise of mutant invasion, it also features a story with real depth and complexity.\nTop-down action: In the heart of the gameplay is the exploration and combat. You kill monsters, gain loot and eat food to survive. We've wanted to make the combat fun and approachable, compared to similar survival horror titles.\nMini-sandbox: After the introduction, the player is let loose on the game world. You're given the freedom to explore the setting in a non-linear fashion.\nDark comedy: The game is presented with a serious tone, but beneath it lies an absurd comedy, filled with strange events and characters.\nPlayer choice matters: Your actions and choices directly affect the how the story plays out. The characters' destiny lies in your hands.\nHand-crafted world: All the level backgrounds are unique, and the main character is completely hand-animated. We've wanted to achieve a high level of polish with the art.\nBack to the 90s: The game is set in the recent past of Finland. The game is littered with tropes and references to the history and culture of our country. In addition to that, we've taken many influences from older DOS titles, and brought their design to the modern day.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rayhouse Productions","platforms":[{"id":0,"name":"PC"}]},{"id":10388,"name":"Operation: New Earth","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f95/f953d4cee18c3d22b8f0064cf83a4121.jpg","description":"New Region - Theta 1!Now is a great time to start playing as we have just recently opened a new Region - Theta 1!\nNote: If your Headquarters is below level 8 and you're in another Region, you can choose to teleport to this new Region as well if you prefer.\nAbout the Game\nOperation: New Earth is an intense sci fi multiplayer strategy game in which you must command an advanced military facility to defend Earth from a hostile alien invasion! Create an alliance, gather resources, and unlock advanced technology to level up your stronghold - your only protection against the invaders who are laying waste to the planet!\nPrepare to defend yourself and your allies against other surviving human factions in the struggle for territory and dominance over what remains of our world - and battle for Neutronium, a powerful alien element like no other, brought to Earth by a meteorite shower. Seek it out to enhance your armies and advance your technology to become the most formidable force that humanity has ever seen.\nCommander, it’s time to mobilize! Retake and defend this new Earth and let no enemy, alien or human, stand in your way!\nJOIN THE FIGHTConnect with players from around the world in the massive battle to take back planet Earth.\nBUILD YOUR BASEBuild and upgrade your facility unlocking new technologies, structures, dropships to become a juggernaut of power.\nRAISE AN ARMYTrain an army of varied and specialized unit types including hi-tech infantry and cutting-edge war machines.\nHARVEST NEARBY RESOURCESBuild outposts in the world to defend your supply lines and harvest Neutronium.\nCOMMAND YOUR HEROTrain an elite Hero unit for incredible advantages and bonuses, while attempting to defeat and capture enemy players’ Heroes in battle.\nDEFEND YOUR TERRITORYRaid, destroy, or capture enemy Heroes - choose your strategy to direct your troops in battle!\nJOIN AN ALLIANCEAssemble an Alliance and build a powerful network of territory; increase your defenses, gain great advantage over key resources and objectives, and strategize to terminate the opposition to your new Earth in a single stealth mobile strike!\nWithout powerful allies like you, humanity will surely fall. It’s no longer fiction, Commander, you must join the fight now - or face extinction at the hands of your enemies!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hunted Cow Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":4634,"name":"Parasite Eve II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a36/a368b84da71d038d03d0332cba7d7412.jpg","description":"Aya Brea is back. The Neo Mitochondrion Creature has resurfaced and taken on a sinister twist. The outcome of this battle will determine Earth's dominant species.\nFully-upgradable weapons, customizable armor, and a new, real-time battle system will aid in the conflict, along with powerful new Parasite Energy abilities.\nDownload this PS one® Classic today!\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game. You must have at least 775 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game. Then, download the game from your \"Download List\" in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly. This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\n© 2000 Square Enix Co., Ltd. All Rights Reserved.\nParasite Eve, SQUARE ENIX, and the SQUARE ENIX logo are registered trademarks of Square Enix Holdings Co., Ltd.\nBased on the novel: Hideaki Sena \"parasite EVE\" (Kadokawa Horror Bunko).\nCharacter designed by Tetsuya Nomura.\n\"PS one\" is a registered trademark of Sony Computer Entertainment Inc.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and this item's use restrictions. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":836466,"name":"Fashion Police Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ec/1ec7ef994e1666a5c966e57a63e1eda7.jpg","description":"Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!\nFashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!\nPit yourself against all kinds of Fashion Crimes, from saggy pants to neon brights\nUtilize a specialized weapons arsenal, including weaponized Sock Gnomes\nJump, climb and swing your way around Trendopolis to uncover its secrets\nFight against the biggest, baddest bosses in the fashion industry\nSolve the mystery of the resurgence of Fashion Crime and take out the villains at the top\nEach fashion crime has a fashion solution, and you'll need to choose between your weapons carefully to fix each fashion faux pas! Each enemy needs something, be it a splash of color or all the seams taken in, so you'll need to switch to and use the right weapons for the right situations! Picking the wrong weapon will do nothing to your enemies, so time to choose wisely!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Mopeful Games","platforms":[{"id":0,"name":"PC"}]},{"id":598946,"name":"Farlanders: Prologue","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/943/943688165074630ceac6a6890a536117.jpg","description":"Strategize, build, and manage your resources as you experience first-hand what it takes to create a successful settlement on a new planet. Configure your colony around the harsh landscape of Mars, construct your base, and use specialized tools to terraform the planet to your needs.\n\nCreate a viable habitat for your settlers by building water pumps, establishing farms on fertile ground, harnessing the power of the sun, and mining for precious minerals. Don’t forget to conserve your resources to create power cables and pipes that will connect the whole of your settlement!\nUse a turn and select a terraforming kit to shape the landscape to your colony’s advantage. Need a water source? Place a water drop tile into a canyon and watch the surrounding flat land become fertile. Need suitable terrain to build wind turbines? Use a terraforming kit to raise mountains that will help increase your energy production.\nTerraforming tiles have preset shapes, so be careful when configuring where to place them! You may end up with ice if you place a water drop tile on flat ground instead of a canyon. Be wise in your choices and always plan two steps ahead!\nNo two maps are ever the same when you select a new game. With procedural map generation, you will be challenged with every landscape as you navigate the canyons, mountains, and rough terrain of the Red Planet.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Andriy Bychkovskyi","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":554708,"name":"Song of Farca","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a3/1a357f93719bb57fab9e52a8b5d33eab.jpg","description":"Corporations and criminal gangs have carved Farca city up into zones of influence, and there's nothing the corrupt government can do about it.\n\nThe police and the state do nothing, leaving residents no choice but to turn to private investigators. A hacker PI Isabella Song may be under house arrest, but that won't stop her from uncovering crimes that the police have turned a blind eye to due to pressure from the mafia.\nFeatures:\nlaunch drones and gain access to personal messages and deeply hidden secrets\nrecover corrupted video files and photos\ndraw conclusions by questioning suspects and analyzing biometric data\ncombine leads to create a database of hard evidence\nanalyze evidence using AI\nrely solely on the facts – sometimes, clients can lie, and suspects can end up victims\nmake life-changing decisions and live with the consequences","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Wooden Monkeys","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":523104,"name":"Football Manager 2021 Touch","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd0/dd02a29d85b1a8cdbfce4e3630517b39.jpg","description":"Although you are trading a little depth for speed, Touch still packs the finesse and quality of the full simulation experience.\nAll the top leagues and nations are included from around the globe and your player recruitment is powered by the world’s biggest player database, which features more than 500,000 active real-life players.\nTactical presets prime you for success and feature the most popular formations from around the world of football. For more control and personalization, there’s also a custom setting for you to stamp your individual style and preference.\nOn Match Days you can enjoy the action from the touchline or completely avoid the action by simulating your result and skipping the highlights. Smashing through the seasons lets you focus your time on buying superstars and unearthing wonderkids - and there are thousands to be found. By accelerating your progress, you also won’t have to wait too long to watch your youngsters become elite.\nChallenge Mode offers an even more casual approach to proceedings with various ready-made trials and experiments. Aim to finish the season unbeaten, see off an injury crisis or battle the odds and avoid relegation over the last few games of the season.\nLicensing updates, new features and game upgrades will all be revealed in November across the Football Manager social media channels, so get following to get ahead of the game.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Sports Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":493433,"name":"Notre-Dame de Paris: Journey Back in Time","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87b/87b10656a576445af6ce552310d1bbc4.jpg","description":"On April 15, 2019, the world witnessed as Notre-Dame Cathedral was nearly destroyed in a devastating fire. While the cathedral is currently closed for restoration, it is still possible to visit it thanks to Ubisoft’s VR experience.\nAt the heart of the videogame Assassin’s Creed : Unity , the 3D reconstitution of Notre-Dame de Paris was the result of 5000 hours of detailed graphic work, guided by historians.\nAdapted from on this acclaimed model, the virtual visit offers multiple point-of-views, some of which were inaccessible to the public, and ends spectacularly with a hot-air balloon flight over its arches, in a lively environment of Paris in the XVIIIth century.\nIn a 4 to 9 square meters zone, the visitor is invited to look around and take a few steps to admire each perspective of the monument, to the sound of its famous Cavaillé-Coll Organ performing J.S. Bach.\nThis experience has been shown for the first time at the UNESCO Headquarters on Heritage Days 2019 and was part of the South by Southwest Virtual Cinema 2020 selection.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"}]},{"id":331809,"name":"Dragon Ball Z: Burst Limit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a1/4a132c5780f2f853d54606163ea620b1.jpg","description":"Dragon Ball Z: Burst Limit is revolutionizing the series by entering the realm of next-generation gaming. Complete with fierce online battles and radical 3D graphic effects only possible on Xbox 360 system, Dragon Ball Z: Burst Limit will blur the line between video game and iconic anime series. Jam-packed with graphically enhanced playable characters, realistic battle stages and environments, players can take hold and experience Dragon Ball Z as never before.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"DIMPS","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":58356,"name":"Megadimension Neptunia VIIR","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d5/9d58d94aec070c8068b9fabec307f94b.jpg","description":"Megadimension Neptunia™ VIIR brings turn-based battles that feature massive enemies, devastating team attacks, and custom combos! After the fight’s over, use VR to cross dimensions and meet your favorite characters face-to-face! Plus, challenge friends in the Online Dimension Rank Challenge and see who rises to the top of the leaderboard!\nKey Features:\nUse the special VR mode to customize your room and hang out one-on-one with characters from the Neptunia series! The PlayStation®VR Headset can enhance the experience, but is not required.\nIn turn-based battles, players can choose attack combos on-the-go, use dazzling specials, and even position teammates to perform devastating team attacks!\nCharacters get two levels of transformations for another layer of tactics and even more powerful attacks!\nEnticing worlds, beautiful sceneries, and wacky dialogue can now be experienced through a brand-new game engine allowing for better and smoother graphics!\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1 player\n13GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nPlayStation®VR Compatible\nPlayStation®Camera Compatible\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2018 IDEA FACTORY / COMPILE HEART All rights reserved. Neptunia is a trademark of IDEA FACTORY.\nLicensed to and published by Idea Factory International, Inc.   Cross dimensions with the PlayStatyion VR headset! The Goddesses of the game will join you in the Player’s Room for interactive one-on-one talks about games, hobbies, and more! Plus, unlock ways to decorate the space to be truly Nep-worthy.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Idea Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":52357,"name":"Fighting Fantasy Classics","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/521/52100b88ce0ba3798885d1a6fe177bf9.jpg","description":"Ready your sword, pack your provisions and prepare to embark upon nostalgic quests of epic proportions where YOU choose what happens next! Journey a magical realm, fighting monsters and unravelling mysteries in Fighting Fantasy Classics – text-based roleplaying adventures remastered. Originally presented by Steve Jackson & Ian Livingstone in the 80s and 90s, Fighting Fantasy Classics brings these timeless tales back to your gaming library.\nFEATURES Every player recieves Jonathan Green's swashbuckling pirate adventure - Bloodbones - free with their download.\nTitles available to purchase include Caverns of the Snow Witch, Citadel of Chaos, City of Thieves, Deathtrap Dungeon, The Forest of Doom, Island of the Lizard King, and The Warlock of Firetop Mountain (original gamebook version), with more books planned for future updates.\nMake the gamebooks as easy or hard as you like and even turn on a special 'Free Read' mode to play the book like an old-school cheater!\nMap feature makes it easy to keep track of everywhere you have explored during current and previous playthroughs.\nUnlimited Bookmarks allow you to revisit difficult sections as many times as desired.\nClassic, original artwork from Iain McCaig, Russ Nicholson, Malcolm Barter, Ian Miller and more! All viewable through a collectable artwork gallery.\nAutomated Adventure Sheet that keeps track of your stats, inventory and knowledge gained during your journey.\nSpecially composed, atmospheric soundtrack and effects.\nHistory of Fighting Fantasy and Rulebook titles, included as free books on the shelf for all players.\nTraverse the realm of Allansia, using your might and magic to hunt down evil demisorcers. Brave the dangers of Darkwood Forest to help save a doomed village of dwarves. Seek vengeance from the Pirate Lord who murdered your family and destroyed your life many moons ago. Save a port-town from the wrath of an undead lord and his ghostly hound minions!\nPart story, part game, in these adventures YOU ARE THE HERO!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Tin Man Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":46351,"name":"Flashing Lights - Police Fire EMS","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9a/c9ae02f06c86910187c53c7693931141.jpg","description":"Flashing Lights is an emergency services simulator with both single player and online multiplayer. Choose to enroll with the police, emergency medical services or fire department and climb the ranks of each role to unlock new missions and rewards. Each department will have its own variety of vehicles, equipment and abilities. Players can work together to tackle a variety of incidents taking place across a shared open world. Flashing Lights will be available on PC and Mac.\nUsually the first to respond to a criminal incident, the police are equipped with the fastest cars and use a variety of equipment. Their roles vary from handing out parking tickets to engaging with dangerous suspects. They will do everything they can to prevent criminal activity and put a stop to any crimes in progress.\nRanging from traffic cones, to spike strips, to speed cameras, you'll need to kit yourself out:\nSpike strips\nA variety of Weapons\nTraffic Cones and Police Tape\nAs a medical specialist, your job lies in keeping members of the public alive, treating patients for severe wounds, diagnosing injuries and more. Further to this, Ambulance Operators can also heal other players in multiplayer, which is vital in particularly dangerous jobs.\nLife-saving work requires life-saving tools and equipment:\nMedical bag\nStretcher\nAmbulance\nThe role of the fire department extends far beyond putting out flames, as they work closely with medical services on the scene, prying open crashed cars so that medical staff can get to the injured is vital, for example. The fire department won’t engage in the pursuit of suspects, but will handle the aftermath of an incident, including, of course, putting out fires.\nBattling flames and freeing trapped civilians is going to involve some heavy duty gear:\nJaws of Life\nAxe\nHosepipe\nFire Extinguisher\nFiretruck\nMULTI-PLAYER\nTeam up with fellow players online and divide your team between the three emergency services at will. Race around the open world to where you are needed. Work together to help civilians in accidents or clean up the trail left behind from a high-speed car chase.\nMISSIONSYou'll receive emergency calls to action, and successfully completing missions will earn you experience points within your department. As you prove yourself to the Emergency Services Division, you'll be assigned more dangerous and important jobs. But if you start to slip up, don't be surprised to see yourself falling back down the ranks.\nTHE WORLDFlashing Lights features a thriving open world that will see emergencies break out through day and night. From bustling city streets to rural countryside mansions, this is an exciting and varied open world. Environmental physics make police car chases all the more engaging, with both you and the suspect leaving your mark on the world.\nThese screenshots represent a current work in progress depiction of the city we are currently building. The total world size is planned to be a lot larger with various different environments such as a beach, a more rural area with farms and a hilly upper class estate.\nDAY & NIGHTWatch the city and its citizens' behaviour change as you move from day to night. Types of emergency incidents change as the traffic dissipates and the bars open, making drunk drivers and fist fights more common.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nils Jakrins","platforms":[{"id":0,"name":"PC"}]},{"id":40430,"name":"Age of Empires Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3a/c3ab5cda609bd9df77f2c257b353213e.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Robot Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":38710,"name":"Slapshot","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d5/8d5c7997d7efc7d4648976d4a26838d6.jpg","description":"Slapshot is an online multiplayer game where you and 5 other players play a game of hockey. The game is physics-based, so teamwork and crisp passing are essential to win. Play with your friends or team up with other Slapshot players!Free-to-PlaySlapshot is free-to-play indefinitely. You can buy the Slappy Pass in order to unlock all of the customization options you've earned to make your character stand out!ControlsYou control your own player's movements with WASD and a mouse. Use the mouse to swing your stick and control the puck. Trackpads work, but a mouse is absolutely recommended.About the DevsSlapshot is a hobbyist project consisting of three developers: two software engineers and a designer/artist. We've managed everything on our own from engine development, model creation, servers, and publishing. Try out the game and let us know what you think!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Numix Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":29260,"name":"qop","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/152/152207fefe512f13c8272f4fa12147f5.jpg","description":"qop is a minimalistic puzzle which goal is to get the cube to finish using 4 directions in space. The difficulty increases due to the unique cubes - angular and teleports.\n- FullHD\n- 60 levels (from simple to insufferably difficult)\n- Smooth animation\n- Pleasant music\n- Intuitive interface\n- Steam achievements\n\nControls: WASD, Arrows, gamepad Xbox 360 and Steam Controller\n\n\"qop\" powered by Clickteam Fusion 2.5\nColor scheme borrowed from the beautiful game HOOK\nMusic by Delone","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":28974,"name":"LOTR, BFME II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf9/cf9cc18a870b40d7d3238818153b288f.jpg","description":"Command the armies and control the epic battles of Middle-earth. Experience never-before-seen lands and six unique factions you build and control with exclusive Xbox 360 features including an intuitive controller scheme, four new multiplayer modes, and voice over IP. With graphics rendered in stunning HD detail and incredible 5.1 surround sound, Middle-earth has never looked—or sounded—this good.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":22449,"name":"Big Fish Legend","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/401/401df03bd747ebdc51cf02b49cf614cd.jpg","description":"One summer day the old friend Rat tells the kitten legend about Big Fish.\nThe kitten has a desire to get the fish and starts its journey.\nThe legend tells that there is one big fish in the world that can be caught by only the most strongest and bravest one.\nThe kitten has a desire to get the fish and starts its journey.\nThe kitten passes 3 islands on its way: tropical, snowy and desert island.\nOn every island the kitten needs to gather a particular quantity of artifacts (fire, water, feather).\nThese artifacts open the way for other islands. The unexpected outcome waits for the kitten in the end.\nGame features:\n3 worlds\n13 various monsters + 4 bosses, with every boss player should use a special strategy to vanquish them\nadventures on earth, in the water and in air\nmore than 60 picturesque levels\ncomix scriptline insertions between the levels\nintricate plot with unexpected ending\nclimbing the walls becomes easy and funny now\nsolving logical and physical puzzles\nextraterrestrial abnormalities will be in the way\nonly in this game kitten can fly using Kamikaze-Birds\nThe kitten-rogue has a main role in the game\nthere are 8 trophies that can give the kitten special abilities","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Igry.ru","platforms":[{"id":0,"name":"PC"}]},{"id":20696,"name":"BiT Evolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d4/6d4ed432cb03862d54da86f11430ef6f.jpg","description":"Evolve through the history of video games in this fun-filled blast from the past in BiT Evolution.\nPlay as the hero BiT as you battle through different eras of gaming greatness from the 70’s, 80’s and 90’s on a legendary quest to defeat the Evil Dr. Malek.KEY FEATURES:\nEvolve from a bit to a hero and enjoy unique styles of gameplay as you experience the golden eras of gaming history. You never die, but you kill yourself often. Traverse between the Rendered (real) World and the matrix-like Realm of Code as BiT overcomes obstacles, collects hidden pixels and more.Enjoy the light-hearted story as you travel through each World and take on the Evil Dr. Malek.MORE FEATURES\nMultiple ways to play Dual-worlds to exploreMind-melting attention to detail Watch the story unfold with fun cut scenesNostalgia feelsEvolving and challenging levelsAttack, swashbuckle and blast your enemies in the faceOriginal soundtrack to bounce to\nFor more information, check out the official website at http://www.bitevolutiongame.com","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Major Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19775,"name":"Drunk Wizards","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/712/7129d20821e43dc7ace860c21e058da8.jpg","description":"Drunk Wizards combines the fluidity and skill of an arena shooter with the lighthearted fun of a party game. It's intense FFA arena with different spells.Collect \"Magic\" Ale to get more mana and use stronger magic.\nDrunk Wizards is arena up to 4 players, providing immersive, fast-paced enemy fragging with different spells.0.MorphWhen tan out off mana you can save your life with Morph spell which turns enemy players into different object not allowing them to cast any spell.1.FrostboltFast ice attack which slos down enemy and dealing 35 dmg.2.Death CoilStrong dark magic spell, dealing 60 dmg. Has a chance to kill enemy with 1 strike.3.Ice WallCreates an ice wall for 2 second to protect you from enemy spells(does not affect ice magic).Upcoming spells:Mana shield(reduces incoming dmg in cost of mana point).\nIce trap (freezes an enemy to ground).\nRestoration(restores full hp)\n+\nFell free to suggest any new spells in steam community hub","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Strongbow","platforms":[{"id":0,"name":"PC"}]},{"id":19393,"name":"Memento Mori","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/494/4945e27b55f3a281e4ee1c4c5ece77ff.jpg","description":"Where am I and who am I... I don't remember anything..This is a four-person portfolio developed game, an immersive VR room escape game that escapes from unidentified spaces with a little creepy atmosphere.-synopsis-Having been caught in an unidentified place, I decide to escape from this place first.However, looking at the things that I vaguely remember in the middle of the process, I have a lot of thoughts..-feature-You can experience an empty horror atmosphere that is immersed and overwhelmed through VR.You can feel the catharsis of surprise.Find the items you need to escape and perform gimmicks and quizzes.You can achieve small achievements through nonsense quizzes and gimmicks.You can find traces of the past by getting your collection through hints everywhere, not just escape.It takes about 30 minutes to an hour of play time and is a VR game enjoyed as a short piece.Get all your collection and find a true ending.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":18599,"name":"Engage","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a9/4a9b027bdd8e4c18c6c0641c8f00dc15.jpg","description":"ENGAGE is a new free to use education and presentation platform that seeks to transform how people share ideas and teach lessons to each other globally by harnessing the power of virtual reality technologies such as the Oculus Rift & HTC Vive.\nEngage is a social learning platform where educators will be furnished with the tools they need to enable them to create their own lesson plans and immersive experiences, transforming how educational content is delivered to their students.\nEngage also enables people and businesses to connect in a more intimate way by placing you inside the meeting room and allowing users to collaborate using tools such as our interactive white board system. The Engage platform is also Dropbox and OneDrive compatible meaning you can share all your files and media inside a virtual environment.  PowerPoints, video files, audio files and spreadsheets have never been easier to share. You can even share YouTube videos.\nEngage is a multi-user system allowing up to 30 users into a single private lesson or meeting from any location to experience content in a more enhanced way with our “ Immersive FX “ presenter system. This system allows the host to stream in virtual assets that can be interacted with to make presentations and lessons more fun and intuitive. You can also change the digital environment instantly bringing users on a field trip to exotic locations like our Martian surface environment.\nEngage also allows educators and presenters to record their classes and lessons so they can edit them later and publish them on the platform. We call this system “Projected Presence “. Projected Presence allows the presenter or educator to record themselves as they give a lecture or presentation. Projected Presence records their Voice, their Avatar’s movements, and their projected media. Users can then sit down and watch themselves present and if they are happy with the results they can publish their projected presence for the public to enjoy.\nProjected presence can also allow you to be in multiple places at once. If you want to provide live talk in more than one room at the same time your avatar can be beamed into multiple rooms to thousands of people giving the illusion that you attended each room personally to talk directly to the users within.\nThis early preview release of the Engage platform is just a small part of what is to come as we test out some of our network features and streaming capabilities. We are rapidly developing and updating the system over the next few months and want to hear from educational institutes, digital content creators and businesses wanting take the next big leap in digital media and Engage directly with their clients and students.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Immersive VR Education","platforms":[{"id":0,"name":"PC"}]},{"id":15083,"name":"Once in Yaissor","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56a/56ae2b57de4decf39e8d3cf5270de1c5.jpg","description":"Особенности игры:\n- Сложный сюжет\n- Проработанные персонажи\n- Отличный юмор\n- Неповторимая стилистика\n- Задеваются жизненные темы\n- Нет надоедливых аниме персонажей\nЛето, 2020 год, Яиссор. Большая часть людей стали ютуберами, стримерами и прочим скамом, почти никто не хочет быть работящим быдлом. Своего мнения никто не имеет. Все возомнили себя нигилистами, атеистами, читающими интеллектуалами и прочей элитой. Но жизнь быдла не изменилась, ведь все люди, что гонят на это быдло им же и является. Поэтому Яиссор больше не Европа-Азия, теперь она Атеисто-Быдло. Во главе Атеисто находятся сами люди, а точнее те, кто занимается интернет деятельностью. Во главе Быдло стоит Нитуп и именно эта часть страны снабжает Яиссор всем необходимым производством, ведь в Атеисто живут люди, которые считают, что работа для отсталых в развитии людей.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Valera Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":12878,"name":"Finnish Roller","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/000/0001ecd92eec4aa9953e2cc7f6fc7bb8.jpg","description":"Introduction\nFinnish Roller is a simplistic 3D rollerball game. Choose with over 10 different types of ball to play as across 28 levels, 4 separate worlds, each categorized based on difficulty. The objective of the game is to reach the end point of each level alive! End of level is finish line and treasure chest\nBeware of things like the lava, fire, bots & laser beams, Toxic cans, cactuses, fishes etc.\nIn open worlds there are treasure hidden to someplace and player have to find it\nThere is also health pick-ups like bananas and apples.GameplayUser may pick their preferred level and world along with preferred ball. The object is to simply complete the level with the necessary objective. As they progress to each different level and difficulty, the game becomes more challenging with more obstacles to clear along with more ways to be eliminated, making it harder for them.Features:\n- 28 levels\n- 4 open world\n- over 10 ball material\n- ALSO GAME HAS NOW PARTIAL CONTROLLER SUPPORT\n- More levels to come","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tero Lunkka","platforms":[{"id":0,"name":"PC"}]},{"id":12479,"name":"Sirius Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb4/cb481f7e7b1931ba4650b2f0f976aaa0.jpg","description":"War. A never ending source of waste. A never ending demand for more lives and resources. The Year is 2436, and humanity, once again, wages war on itself. Nearly a hundred years ago we settled on the Sirius Star System, a rich system with two habitable planets. The first Settlers, now forming the Sirius Colonial Council built this ecology from the ground up. They self-governed and prospered. Five years ago, the Terrans appeared, demanding to return the Control over the System. Failure to do so would result in catastrophic response from the Terran Reclaim Forces.\nAnd so, once again, war erupts.\nTake part of the war or live along both sides, trade, fight, think and explore. Be the tip at the iceberg of the upcoming conflict. Control the Economy with your Trading Craft. Find unimaginable riches in the 11 AU wide Sirius Star System. Battle Pirates and even more sinister forces. Create your own Empire among the Stars.Sirius Online 1.2 - Rise of the Crimson Dawn\nIt was an accident. Or so they say. One day, the Research Station from the Sociecty of Advanced Technology, a neutral Faction dedicated to research the effects of AGI, vanished. Well... in an explosion. From that day on ships of unknown origin invaded, attacked traders, attacked explorers, abducted people. Always leaving only fragments of data. Fragments that say \"...remember the Crimson Dawn\". We never gave them much thought. Another Lunatic, fallen to space sickness, painted his ship in odd colors, attempting to kill people until stopped.\nIt was too late to realize that these were not loners. That these were not unorganized. That these seek to end all human life in this star system. When the first Megacarrier with countless of AI Drones arrived, programmed to speak with the voices of our loved ones, we realized: THEY were the Crimson Dawn. And they have risen. To end us.Features Explore an 11AU big Star System, with a living economy and hidden riches\nTake your Side in an Endless war between the SCC and the TRF. Defend your Homeland or take it back for Earth\nInfluence a steadily changing market of supply and demand and work your way up to bigger ships\nSurvive the onslaughts of an unforgiving AI assault destines to kill everything living.\nBe a part of an ever evolving universe","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digital Dawn Studios","platforms":[{"id":0,"name":"PC"}]}]