[{"id":16311,"name":"Anna's Quest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d97/d971acbc10662aaefbc4ec24151dee9b.jpg","description":"Dragons, witches, trolls... No one can stop Anna. With her telekinesis, unorthodox use of torture instruments, a knack for improvisation and the help of a shady fox she just makes her way. She communes with the dead, shuts off the local taverns beer supply and gets old ladies behind bars...\nThe world of author Dane Krams' debut on the game development stage isn't as cuddly as it may seem. Anna however, is actually perfectly nice - or is she? It all starts with freeing talking teddy bear...\nAnna's Quest unfolds a hand-drawn, grim tale with a good dash of self-irony.\nUnlimited inventory with special slot for a baby dragon\nSmall-time Vandalism\nDiscover a Unicorn's inner beauty\nBlack magic and telekinesis - this time, not exclusive to villains!\nExecutions for the whole family!\nlight-hearted, courageous, bad-ass: Anna\nClassic Point & Click controls with hotspot-indicator\nAwesome ending (really!)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":121,"name":"Street Fighter IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a2/0a2ee705109a6d8d94e28bef03f6d598.jpg","description":"STREET FIGHTER IV is a fighting game, the fourth main installment in Capcom’s Street Fighter series.  \n\n###Plot \nStorywise the game is a sequel to Street Fighter II and prequel to Street Fighter III. The S.I.N corporation begins a new tournament for the best fighters from all over the world. Although each participant has its reason to take part in the tournament, the S.I.N’s motivation behind it is to collect necessary data from fighters to complete a bio-weapon project BLECE.  \n\n###Gameplay \nLike most other games in series, Street Fighter IV is a 2D fighting with one-on-one fights between various characters with unique fighting styles and supernatural abilities. The core gameplay is very reminiscent to that of the Street Fighter II, but the game adds many new mechanics, gameplay elements as well as new characters, stages, game modes. The two main gameplay innovations in SFIV are Focus Attacks and Ultra Combos. Focus Attacks are chargeable attacks that can knock down an opponent. It can also absorb one opponent’s strike which gives a new layer to the game combat and makes gameplay less combo-based and more focused on reading the opponent’s moves and fast reactions. Super Combo gauge returns for previous games and allows the player to perform more powerful versions of character’s special attacks. The new Ultra Combo system fills a special Ultra Combo gauge with each hit laid on your character and allows you to unleash a string of powerful attacks on the enemy.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":709004,"name":"Grand Theft Auto: San Andreas – The Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae3/ae3ba4e4d73ab8ec9dd6bfd8ab9d4efb.jpg","description":"Five years ago, Carl ‘CJ’ Johnson escaped the haze of Los Santos, San Andreas...a city tearing itself apart with gang trouble, drugs, and corruption. Now, it's the early 90s. CJ’s got to go home - his mother has been murdered, his family has fallen apart, and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of cops frame him for homicide, forcing CJ on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets in the next iteration of the series that changed everything.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Rockstar Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"}]},{"id":19579,"name":"Cubetractor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/850/85053bb302b7ab558b1a6ef747da4d86.jpg","description":"Cubetractor is tower defense-like cube-styled action-strategy-puzzle bullet hell. This is the only game within the IP.\n\n###Gameplay\nThe game is self-called \"reverse tower defense\" by the developers. The point is, you and your opponent have to build stationery structures to defeat each other's bases. Many of the maps designed so no side has the opportunity and every odd in the gameplay depends on the speed and skillfulness of the sides. There a total of 40 maps.\nThe core gameplay element comes from combining the materials: Endroi can pull the multi-colored blocks towards him — if hit an enemy, they destroy both the for and themselves, and if they get hit by another block of the same color, they form a construction — most likely a turret — which shoots in all directions. So the player is forced to continually think about the directions of pulling and the placement of turrets to antagonize with the AI-driven opponent adequately.\n\n###Story\nThe plot circles around Endroi on his quest to acquiring the power of Cubetracking — which is Cubes + Attracting combo-word. On his way, he encounters many enemies and overcomes them with tactics and more exceptional time management skills.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ludochip","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":214,"name":"Disc Jam","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bb/2bb23a02cfaf1c021735dbe025c35e6c.jpg","description":"Disc Jam is a sports game developed by High Horse Entertainment.\n\n###Gameplay\nThe game is a hybrid of both air hockey and tennis. The players can engage in 1v1 and 2v2 matches with AI, locally on a split screen or in online multiplayer. \n\nThe player plays on their own side of the field while acting both as a defense and offense of their side blocking the disc from getting in their goal zone and hitting it back in an attempt to hit the opponent's goal zone. The disc is thrown back and forth until one of the player's scores, after which the disc is reset, and the player who got scored serves it. The game is won by the player who scored the most goals.\n\n###Defense\nWhen the player place defense, it is necessary for them to catch the disc by making any contact with it, preventing it from reaching the goal zone. The players can either walk into the disc or dive for it. \n\n###Offense\nWhen the players get the disc, the offensive stage of the game begins for them. They have to act aggressively and try to land the disc in their opponent's goal zone. It is not possible to move in any direction while holding the disc and the disc itself can be held for several seconds. The players choose a direction in which they would want to throw the disc. The players can throw it either at the goal zone or bounce it off the in-game obstacles.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"High Horse Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":605674,"name":"Lies Of P","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/458/45838becd01e929b6be8b88d655cebfc.jpg","description":"You wake up at an abandoned train station in Krat, a city overwhelmed by madness and bloodlust. In front of you lies a single note that reads:\r\n\"Find Mr. Geppetto. He's here in the city.\"\r\nPlay as Pinocchio, a puppet mechanoid, and fight through everything in your path to find this mystery person. But don't expect any help along the way and don't make the mistake of trusting anyone.\r\nYou must always lie to others if you hope to become human.\r\nInspired by the familiar story of Pinocchio, Lies of P is an action souls-like game set in a cruel, dark Belle Époque world.\r\nAll of humanity is lost in a once beautiful city that has now become a living hell filled with unspeakable horrors.\r\nLies of P offers an elegant world filled with tension, deep combat system and a gripping story.\r\nGuide Pinocchio's and experience his unrelenting journey to become human.A Dark Fairytale RetoldThe timeless tale of Pinocchio has been reimagined with dark and striking visuals.\r\nSet in the fallen city of Krat, Pinnochio desperately fights to become human against all odds.Visual ConceptThe city of Krat was insipired by the Belle Époque Era in Europe (late 19th Century to the early 20th Century) and is the epitome of a collapsed city bereft of prosperity.'Lying' Quests and Multiple EndingsExperience interconnected procedural quests that play out depending on how you lie. These choices will then affect how the story ends.Weapon-Making SystemYou can combine weapons in a multitude of ways to create something new altogether. Research to find the best combinations and make something truly special.Special Skill SystemWith Pinocchio being a doll, you can change parts of his body to gain new skills and hopefully an edge in battle. But not all of the enhancements are for fighting though, they can also provide several other unique and useful features.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Round8 Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":428839,"name":"Rogue Legacy 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/776/776ebcf6f05c98eab89af736e6f38283.jpg","description":"Rogue Legacy is back!  But now it's got a 2 in front of it!\r\nRogue Legacy 2 is a genealogical Rogue-LITE.  That means it has all the trappings of a typical rogue-like (randomized runs, changing characters, and more), but with persistent upgrades, and persistent dead heirs.  In this game, the grind is optional.  Play well and you can dive deeper into the depths of the ever-changing world.  Or don't!  Who cares!  With hardcore platforming mixed with a deep RPG system, everyone can win eventually.\r\n...And really, isn't having that kind of choice the best? <3\r\nHere's what Rogue Legacy 2 IS:\r\nA procedurally generated adventure.  The entire kingdom changes with every life, so no two runs are the same.\r\nRogue-LITE.  Build your manor, improve your legacy, and make each child stronger than the last.  The game can be beaten at level 1, but that doesn't mean it has to.\r\nUniversal Healthcare.  Every child is unique.  Some might have Synethesia, others might be a pacifist, and some could just be a little chubby.  Through the powers of Socialism, traits which have more debilitating effects on gameplay now give gold bonuses!\r\nCastle Permanence.  It's a rogue-like where bosses stay dead.\r\nEvery class (and there's a lot!) now have their own unique set of armaments.  Take down foes from afar with your bow as the nimble Ranger, or get up and close with the massive Battleaxe as the Barbarian.\r\nStack Runes.  Runes can now stack to infinity.  It'll take a while, but if you wanted to have penta jump, and lifesteal, and hyperspeed you can!\r\nAND THERE'S A WHOLE LOT MORE.  But we're working on it, and we'd still like to keep a few secrets in our back pocket. :)\r\nThis store page may be temporary, but Rogue Legacy is forever!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Cellar Door Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":10969,"name":"Caveblazers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80c/80c10b0d78a4540899319c3b5ce8f760.jpg","description":"Caveblazers is an action focused platformer roguelike set in a fantasy world. Each game is unique with procedurally generated levels to explore and a massive amount of items, weapons and equipment to discover.\nThe game takes place in a recently discovered cave, said to hold \"unimaginable power\". You play as an adventurer setting out to explore the cave and find out what riches it holds. However, you are not the only one...\nAs you delve deeper in to the cave, you'll discover new areas to explore, new weapons and new monsters to try them out on.Smart Characters!Throughout your journey you will encounter AI characters. Some friendly, some hostile. We're using an advanced pathfinding system which means friendly characters will be able to follow you wherever you go, and hostile characters will be able to track you down wherever you hide. There is no escape. Be afraid!Platformer Roguelike! Caveblazers is a modern platformer which incorporates some Roguelike and RPG elements such as permanent death, randomized potion identities, an RPG-style inventory system and tons of items, equipment and upgrades!Daily Challenge Runs!Each day a new adventure will be generated! It will be the same for everyone and you'll only get one chance at it! These challenge runs give you a starting loadout, and feature a set of different traits.Epic Boss Battles!Between each area you'll encounter a boss. Each boss is very unique, requiring a different strategy to defeat. Bosses are generally gigantic monstrosities with life bars stretching across the entire screen. Good luck!Character Customization!A whole load of unlockable hats, tunics, trousers, robes, and more! Or perhaps you fancy stripping off and heading in to the caves in the nude? Go for it!Compelling Combat!Largely overlooked in other modern Roguelike games, Caveblazers attempts to move away from the simplistic combat systems we've seen in other games in the genre, and incorporates fun, fluid and fast-paced combat which is accentuated by the game's brutal and persistent blood effects.Challenges!In case that isn't enough content, Caveblazers features a bunch of challenges for the well seasoned players to take a punt at. These challenges reward players with new items, weapons & perks!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Deadpan Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":349679,"name":"Autonauts","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24c/24c4678bfcdc3858e81c1efe5366c5a7.jpg","description":"Wishlist Now!\nAbout the Game\nTravel the universe colonising uninhabited planets with the sole goal of setting worlds in motion through the power of automation.\nFresh from your spaceship you must harvest stick and stone and begin your colonisation efforts. Create rudimentary crafting items from blueprints and slowly build a number of workerbots to aid in your efforts. Teach and shape their artificial intelligence with a visual programming language, then instruct them to begin the formation of your colony. Marvel as a planet you’ve shaped becomes home to a civilisation of workerbots, happy to do your bidding!\nExpand further with the creation of colonists; beings that require your assistance to survive. Push your workerbots further by introducing fishing, cooking, housing, and tailoring and help the colonists into a state of transcendence.\nKey Features:\nPlayful Programming\nTeach your workerbots requisite steps to complete tasks by asking them to repeat actions utilising a visual programming language. Designed to be easy to learn but with added complexity there are numerous possibilities.Automated Automation\nBuild an army of bots to automate just about everything in your colony, teach them what to do and expand both their brains and task possibilities with numerous upgrades and options.Various Ventures\nFrom gathering to building, cooking, fishing, tailoring, farming, animal husbandry and more - the world of Autonauts is vast with limitless opportunities to automate and colonise.Charming Creativity\nThe world of Autonauts pops to life with a low-poly art-style married with a consistent and bright colour palette adding depth and scale, creating a relaxing and attractive play space.\nAutonauts combines the very best of agriculture, simulation, crafting, building, production-line and resource management titles to create a brand new experience unlike any other. Create the automated world of your dreams! The future is now!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Denki","platforms":[{"id":0,"name":"PC"}]},{"id":18002,"name":"Divinity: Dragon Commander","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e5/3e5b137b31a674513af88ce6f24994e6.jpg","description":"You are the Dragon Commander. Your mission it is to reunite a broken empire and become the new emperor.  Success depends entirely on your ability to efficiently rule your empire, build invincible armies and lead them to victory. Your secret weapons: your tactical insights, your leadership skills and your ability to turn yourself into a dragon.\n\nDragon Commander is not just any strategy game - it seamlessly blends real-time strategy gameplay with turn-based campaigning, role-playing an ascending emperor and controlling a formidable dragon.Key \n\nFeatures:\n- Real time strategy: Command your sea, land and air forces in real-time. Combined operations and knowing where and when to hit are crucial elements of any victory.\n- Dragon Combat: During real time strategy mode, you can turn into a dragon to support your troops in combat and obliterate the enemy using your formidable dragon powers.\n- Turn based campaign: Direct your conquest on the turn-based world map; plan several moves ahead, build formidable armies and invest in the right technology or magic upgrades.\n- Rule your empire: You are the emperor and you make the decisions! But beware, political balance is easily upset. Each game is different and you'll find that a Dragon Commander needs to make really tough decisions. Feel the effects of your decisions on the battlefield as the war progresses.\n- Single-player, multiplayer and co-op modes: Play the single player story-driven campaign or test your mettle against other Dragon Knights, online or local via LAN. Start your own multiplayer campaign with or against a friend. Or duke it out on a skirmish map.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Larian Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":8798,"name":"TRAUMA","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf1/bf17f3355be57f92313ec8ce3fc56f11.jpeg","description":"TRAUMA is a point-and-click adventure indie game developed by Krystian Majewski. The game was developed as a part of a thesis project and explores human experiences during being unconscious. \n\n###Plot\nThe game tells a story of a woman, who survived a car accident, yet slipped into a coma. You go through several memories of hers and reveal her backstory.\n\n###Gameplay\nThe game focuses on two mechanics in its gameplay: the usage of gesture-like mouse movements and a typical point-and-click experience. These mechanics are used by the player to move around the world of the game, which consists of several dreamscapes. Gestures are used in several specific moments and mimic the real world actions. These gestures can sometimes be used for traversing the world. \n\nEach dreamscape is represented using real photos, but with several artificial elements added to them. The primary objective of such dreamscapes differs and is told to the players after selecting one of the dreamscapes. During the game, a narrating voice can reveal plot details or hints. The players have to find nine Polaroid photos in each area. \n\nThe players are to traverse all the dreamscapes and get every possible ending in the game. After revealing every ending for a specific dreamscape, the player is awarded a photo tracker, which makes finding the polaroids much easier.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Krystian Majewski","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1105,"name":"Duke Nukem 3D: 20th Anniversary World Tour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/002/00277b66ea1acfa782d809535748fd8a.jpg","description":"Frag like it’s 1996 – this time with even more asses to kick! Join the world’s greatest action hero in Duke Nukem 3D: 20th Anniversary World Tour as he saves Earth once again, kicking alien ass and saving babes across the globe along the way. \n\nBlast your way through hordes of ugly aliens in four classic Duke Nukem 3D episodes plus an additional ALL NEW FIFTH EPISODE from the game’s ORIGINAL EPISODE DESIGNERS with NEW MUSIC from the game’s ORIGINAL COMPOSER and NEW Duke Talk from the ORIGINAL VOICE of Duke Nukem.\n\n•      ALL-NEW Episode FIVE, created by the original episode designers, Allen Blum III and Richard “Levelord®”  Gray!\n•      New, bonus content in Episode 5: Duke Nukem finally gets an INCINERATOR to roast new “Firefly” enemies!\n•      New “Duke Talk” plus high-fidelity re-recordings from Duke Nukem’s original voice actor, Jon St. John!\n•      New musical score for Episode 5 created by Duke’s theme song author and original game composer, Lee Jackson!\n•      Original 1996 source code and “2.5D” engine re-mastered in True 3D for PC!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":15967,"name":"Call of Duty: Advanced Warfare - Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0e/e0ef96a0639af3735cb4d26160e82c16.jpg","description":"Call of Duty®: Advanced Warfare, developed by Sledgehammer Games (co-developers of Call of Duty®: Modern Warfare® 3), harnesses the first three-year, all next-gen development cycle in franchise history. Call of Duty®: Advanced Warfare envisions a powerful future, where both technology and tactics have evolved to usher in a new era of combat for the franchise. Delivering a stunning performance, Academy Award® winning actor Kevin Spacey stars as Jonathan Irons - one of the most powerful men in the world - shaping this chilling vision of the future of war.\nAll digital purchases of Call of Duty: Advanced Warfare include the bonus Digital Edition Personalization Pack with a custom weapon camo, reticle set and playercard.\nPower Changes Everything.An Advanced WorldCall of Duty: Advanced Warfare takes place in a plausible future in which technological progress and today’s military practices have converged with powerful consequences.\nIn this carefully researched and crafted vision, Private Military Corporations (PMCs) have become the dominant armed forces for countless nations outsourcing their military needs, redrawing borders and rewriting the rules of war.\nAnd Jonathan Irons, the founder and president of the world’s largest PMC - Atlas Corporation - is at the center of it all.An Advanced SoldierPowerful exoskeletons evolve every aspect of a soldier’s battle readiness, enabling combatants to deploy with an advanced lethality and eliminating the need for specialization.\nThe introduction of this gameplay mechanic delivers enhanced player movement and verticality through boost jumps and grappling, covert cloaking abilities, and biomechanics that provide unparalleled strength, awareness, endurance, and speed.\nWith the advent of the exoskeleton and newly advanced armor and weaponry, every soldier commands tactical freedom in any terrain unlike ever before, fundamentally changing the way gamers play Call of Duty across all modes.An Advanced ArsenalHarnessing the power of next-gen platforms, Call of Duty: Advanced Warfare introduces a new hi-tech, advanced arsenal and ability set, arming players with all-new equipment, technology, perks, and vehicles like hoverbikes and highly specialized drones.\nPlayers can also choose between standard ammunition and an all-new class of directed-energy weaponry that enables totally new gameplay dynamics.\nAnd with exoskeletons delivering a massive force multiplier and unprecedented tactical freedom, Call of Duty: Advanced Warfare evolves every firefight.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"}]},{"id":3642,"name":"Abyss Odyssey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/186/186641799044a7daa32d2845d354758a.jpg","description":"Abyss Odyssey is an action platformer game developed by the ACE Team. The game also features several roguelike elements.\n\n###Plot\nThe game follows several heroes that descend into the dungeons of a 19th century Chile city of Santiago to find a warlock, whose dreams wreck havoc on the streets of a South American town.\n\n###Gameplay\nIn its gameplay, Abyss Odyssey fuses several genres into one, creating something absolutely new. The players control a character, whose main objective is to complete procedurally generated levels without dying and killing as many monsters as they can on the way to the exit from the level. The implementation of procedural generation results in a high degree of replayability as no level will play out the same.\n\nDue to the infusion of roguelike elements to the game, the players only have one life. Upon death, the players are given a weaker character to play as. This new character sets out to avenge the death of a previous one. It is possible to revive your dead character by finding them and using a special alter that has to be found somewhere on the level. \n\nThe game's combat is heavily inspired by several Japanese fighting games. The players are awarded new loot upon timing their moves correctly. \n\nAbyss Odyssey features a unique level unlock system, that is driven by the community. On the game's release, only the first act was available for playing. The next ones were unlocked upon a certain number of players beating the game's bosses.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ACE Team","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":14933,"name":"Space Channel 5: Part 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/577/5772c843f5a40c601893f788c8913294.jpg","description":"Space Channel 5 Part 2 follows famed reporter and dancer Ulala as she battles the Rhythm Rogues-a group of villains led by the mysterious Purge and his right-hand man Shadow-in a quest to rescue thousands of people who have been kidnapped and forced to dance. Players will need to help Ulala move and \"chu chu chu\" her way to victory over these evil-doers before they succeed in taking over the universe with their ultimate dance-control weapon.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"SEGA","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":13977,"name":"Airscape - The Fall of Gravity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a69/a69f2cb01d957a457cf887632a5387da.jpg","description":"Airscape - The Fall of Gravity is an indie platformer developed by Cross-Product.\n\n###Plot\nA small octopus family falls victims to an unknown alien force and are captured by it. The youngest octopus sets out to find his family in an unfamiliar world in which it is possible to manipulate gravity.\n\n###Gameplay\nAirscape - The Fall of Gravity is a fast-paced action platformer with the addition of gravity shifting mechanics. The players have to traverse an environment consisting out of floating islands, water bodies, and robots. Five playable characters are available to the player, with every character having their own ups and downs.\n\nIt is essential to get used to the octopus movement, as it is realistically simulated. The players will experience a smooth transition between moving on land and swimming through numerous water bodies that are present in the game.\n\nIt is not possible to attack the enemies in Airscape - The Fall of Gravity. The players have to rely on their skills and intellect to outmaneuver and run away from their enemies. It is necessary to dodge bullets, avoid mines and outwit the enemy seekers. A hardcore difficulty option is available to the most dedicated players.\n\nThe game features 60 levels which are divided into 18 different zones, that vary in both their environments and gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cross-Product","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12732,"name":"Dungeon Fighter Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f66/f669955b99d63d7c59f34b35de0d858d.jpg","description":"With fast-paced gameplay and unique side scrolling 2D action, Dungeon Fighter Online (DFO) is an Action-anime MORPG played by over 500 million players worldwide.\nDelve into the fantasy adventure with an epic story line and a variety of characters!\nYou are the hero of the next adventure!\nRetro-styleDungeon Fighter Online is a 2D side-scrolling action game inspired by classic arcade games such as Golden Axe and Double Dragon.\nIf memories of playing good ol' games like Street Fighter gives you nostalgia, and want to indulge yourself into a similar experience, this is the game for you!\nIncredible Hit Effects and Spectacular CombosLike a true action game, Dungeon Fighter Online showcases dazzling hit effects and complex combos! Easy to learn but hard to master!\nAlso, there are beautiful illustrations for each class which adds more fun to your gaming experience!*\nDynamic CustomizationDFO allows you to customize your character with various types of avatars. Dyes are available so that you can color and personalize\nyour avatars, giving yourself a unique look!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Neople","platforms":[{"id":0,"name":"PC"}]},{"id":10667,"name":"Paradigm","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6c/b6ca8ba20caa7677aa2f5a506d9d84aa.jpg","description":"Paradigm is a surreal adventure game set in the strange and post apocalyptic Eastern European country of Krusz.\nPlay as the handsome mutant, Paradigm, whose past comes back to haunt him in the form of a genetically engineered sloth that vomits candy.\nParadigm’s unfortunate life begins at DUPA genetics, a company who sells prodigy children to the rich and powerful who don’t want to leave their inheritance to their poor excuse for biological children.\n\nSomething went wrong during Paradigm’s growing process and he was left horribly mutated. To save their reputation, DUPA dumped the hideous infant in a nearby post Neo-Soviet abandoned town, forcing him to fend for himself.\n\nParadigm didn’t let this get him down and found solace in music. He dreams of becoming the best electronic music artist the world has ever seen! Unfortunately his past is set to catch up with him and he must reluctantly step up as the world’s saviour. When really he just wants to finish his latest EP.\n\nOn his journey, Paradigm meets an array of strange characters. Some include: a psychopathic superhero, an evil sloth, a secretary knight , and a glam metal cult leader pug.\nClassic point [/img[/img]]and click adventure: Think Monkey Island, Day of the Tentacle, Space quest, Full Throttle.\nSurreal 2D Graphics: Pixar meets Fallout\nPost apocalyptic:  The year is 2026, dial-up is back in fashion.\n70/80’s influences: Paradigm's world is what people from that era imagined it to be; large super computers, space age furniture and floppy disks that can save the world.\nMature content and dark humour: Help the local drug addict and have a hot date with a toaster.\nUgliest protagonist in gaming (maybe): Look at him, Jesus.\nEvil sloth antagonist: Who is a genetically engineered living candy machine.\nGlam metal cult: May your pants be tight and your excess be excessive.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Jacob Janerka","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10081,"name":"Detention","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d96/d966fbdebcb904af63980842b37c31c9.jpg","description":"Greenwood high school, located in a remote mountainous area, two students found themselves trapped and vulnerable. The place they once knew has changed in unsettling ways, haunted by evil creatures. To escape, they must explore the mysterious campus filled with ominous objects and puzzles. How will they survive in this ever threatening environment? Could they return to safety in one piece?\nSet in a fictitious world in the 1960s Taiwan under martial law, Detention, the story-driven atmospheric horror incorporated East Asian elements rarely used in games. Taoism, Buddhism, Chinese mythology, the game draws on local Taiwanese cultural references to tell an unique and terrifying story.\nIn this 2D atmospheric horror side-scroller, players navigate the main characters in a classic point and click fashion to explore a high school where evil encroaches. While hiding from the rampaging monsters, you are to find items to interact with in the otherworldly rooms. And as more mysteries unveiled, the dark past of a cursed school will finally surface.\n2D atmospheric horror with spine-chilling atmosphere.\nImmersive gameplay and puzzle solving experience\nUnique Taiwanese/Eastern cultural references.\nOriginal sound tracks, fusing Electronic, Lo-Fi, and Rock with traditional Asian instruments.\nUnique and appealing  graphics.\nMultiple language support. (Including English, Chinese)\nMac, Windows and Linux support","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"RedCandleGames","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":2343,"name":"Wizorb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a95/a95a895d303408744cd4f5bf3404098c.jpeg","description":"This game develops the ideas on which several classic video games are based, the first in the industry - Pong, Breakout, Arkanoid. This game is the closest to the game Breakout.\n\n###Classic gameplay of the genre\nThe basis of the game is the same basic process as in the games listed above.\n\nAt the bottom of the screen is a “protected” by the player wall or a series of elements. A block consisting of \"bricks\" is approaching it from above.\n\nIn addition to this block, other elements can gradually approach the wall. Including, elements with own trajectory of movements.\n\nThe player controls a small horizontal platform, designed in accordance with the \"plot\" of the game - it can be an impersonal plank or something, stylized as a spaceship or anything else.\n\nThis platform is moved horizontally, right and left, within the boundaries of the screen.\n\nBetween the wall and the block of elements advancing on it, a ball is thrown, having sufficient elasticity to bounce off everything with which it comes into contact.\n\nThe task of the player controlling the movable bar is to be between the ball and the wall at the bottom of the screen - so that the ball never touches this wall.\n\nThe player manages his own bar, kicking the ball, and the ball is torn between the player’s bar and the block advancing from above, bouncing off the walls / edges of the screen, from the block and from other elements, if any, in the game.\n\nEach time a ball hits an impending block, it knocks out or otherwise destroys a number of elements that make up this block.\n\nThe player tries not to “throw” the ball to the wall behind him, because touching the ball to the wall will destroy it and either the game will end or the player will lose one “life”.\n\nIn addition, the player tries to knock out as many elements as possible from the block advancing on him - because the block’s contact with the wall also means the end of the game or the loss of “life”.\n\nWhen all elements / “bricks” from the block are knocked out, there will be no more block (but a new one will appear or the game will go to the next level).\n\nSimilarly, the player tries to do with other elements present on the screen - as a rule, they also threaten the wall and should not touch it.\n\n###Wisorb option\nIn this game, the classical scheme is supplemented with elements of the genres \"strategy\" and \"role play game\".\n\nIn the style of these additions, the player does not just beat the ball, but uses magic for this, between the levels the player needs to build cities and so on. The whole game is framed by a plot that adds interest and appeal to the classic gameplay.\n\n###Plot\nThe peaceful Kingdom of Gorudo has been faced with the threat of attack by hostile forces. This power is so great that only Cyrus is able to resist it, a wise man and wizard dedicated in a secret magic art called Wizorb.\n\nThe player is expected by numerous mysterious places / levels, from the derelict monster infested town of Clover to Gorudo Castle atop Cauldron Peak. These places are full of dangers and the player will need refined reflexes to survive in battle and protect the Kingdom.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Tribute Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18276,"name":"The Ball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7f/b7f99da1098316690691eaedb86ada92.jpg","description":"The Ball is a first-person action-adventure game with heavy emphasis on puzzle-solving. The game was a part of Valve’s Portal 2 promotional campaign Potato Sack. \n\n###Gameplay \nIn The Ball, you play as an archeologist that one day came across and got trapped in the ruins of an unknown civilization’s underground city. How you have to escape the city as well as find out the secrets of this place.\nYour only weapon and primary puzzle-solving tool in the game is a solid mysterious metal sphere that you have to manipulate to overcome the challenges of the game. There are various ways to use Ball in the game. It can play the role of a platform to help you reach high places over traverse gaps. Many puzzles require guiding ball to a specific place. Besides puzzles solving, there are random combat sequences in which you also have to use the Ball to smash your enemies. During the game you can upgrade it by changing its properties like covering it with spikes, overcharging with electricity or changing its gravity field allowing you to jump higher when you are near the Ball. The story campaign consists of 8 levels and lasts about 5-6 hours. Aside from the story mode, the game offers survival mode that challenges you with waves of enemies.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Teotl Studios","platforms":[{"id":0,"name":"PC"}]},{"id":13605,"name":"Victoria II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89a/89a2f33f0a70c4fe7d530f7376970a90.jpg","description":"Carefully guide your nation from the era of absolute monarchies in the early 19th century, through expansion and colonization, to finally become a truly great power by the dawn of the 20th century.\nVictoria II is a grand strategy game played during the colonial era of the 19th century, where the player takes control of a country, guiding it through industrialisation, political reforms, military conquest, and colonization.\n\nExperience an in-depth political simulation where every action you take will have various consequences all over the world. The population will react to your decisions based on their political awareness, social class, as well as their willingness to accept or revolt against their government.\n\nKey features:\t\t\t\t\t\t\t\t\t\t\t\tDeep engrossing political simulation with dozens of different governments.\nDetailed economy with over fifty different types of goods and various production factories.\nOver 200 different countries can be played, during the era stretching from 1835 to the onset of WWII.\nAdvanced Technological system with thousands of inventions to discover.\nImproved graphics and interface, as well as multiplayer support.\nA streamlined interface makes the game easily accessible.\nAutomation of various tasks including, trade and population promotion.\nAdvanced spheres of influences system, where the great powers battle over the control of the world.\nCottage production simulating pre-industrial economies.\nGunboat Diplomacy, no need for negotiating as a fleet outside a port may be a more persuasive argument.\nHistorical and Dynamic missions guiding your country through the history.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16711,"name":"Blackguards 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9fa/9fae84bdb6f5cd9d46961b90d720d17e.jpg","description":"Buy Blackguards:http://store.steampowered.com/app/249650/\nBlackguards 2 Steam exclusive content:\nAbout the Game\nBlackguards 2 is a turn-based strategy-RPG and will deliver challenging hexfield battles and a gritty story filled with violence and crime.\nChoose your playstyle: no matter if front line combat monster, mage or ranged fighter it's in your hands how you want to develop your character. Every action has consequences, so make your decisions wisely. Death may be just around the corner.\nThree years have passed since Count Uria´s plots. The Vanquishers of the Nine Hordes long parted ways but life in Aventuria went on. Cassia, a young woman of noble descent, has only one goal: She wants to claim the Shark Throne, no matter the price; and be it only for one day. Unfortunately, there are two problems that potentially foil her plans. First of all, she spends her days incarcerated in a dungeon and secondly, there is already a man on her throne: Marwan. She is neither fond nor proficient in matters of diplomacy or politics, so she chooses a more... practical approach. She intends to break out of prison and overthrow Marwan to claim the throne herself. For this, she needs strong allies. She needs to recruit an army of Sellswords and rally the Vanquishers of the Nine Hordes around her. Sounds like a solid plan, doesn't it? But then again, how cunning must one be to escape the dungeon's walls; and how reckless must one be to gather and command the worst scum of the realms?\nRecruit mercenaries, find upgrades and build an indomitable army\nFind the Vanquishers of the Nine Hordes and see what has become of Takate, Naurim and Zurbaran\nA story with many twists and turns, fateful decisions and more than 20 challenging hours of playtime awaits you\nCommand up to 20 characters in your party and lead them to death or glory\nMaster and finish the game on many different non-linear paths\nMake decisions influencing your squad and the ending of the game\nChoose your spells, talents and skills wisely, since they dictate your strategy on the battlefield. Give priority to offensive or tactic in challenging battles\nInteract with your environment and let walls collapse or even discover new routes on your journey through Aventuria\nLay waste to your enemies with powerful spells and abilities. But be on your guard: your foes may wield them as well","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3433,"name":"Evolve","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c30/c304b2c132f6bc1b6bcec5b03417a005.jpg","description":"Evolve is a game about hunting alien monsters. The creatures evolve during the hunt, making them a difficult prey. The game also allows the players to control the monsters.\n\n###Plot\nEvolve takes place in a distant future on a faraway planet called Shear. Humans only recently colonized the planet and encountered hostile alien monsters that quickly evolve. As they consume other local animals, they can mutate into new, stronger creatures. The main protagonist in the story mode is William Cabot, a retired famous monster hunter, who comes to Shear to \"tame\" the planet and save the colonists from the monsters.\n\n###Gameplay\nWhile the game has a single player campaign, it is oriented towards online multiplayer team deathmatches. The teams are asymmetrical: a group of four hunters opposes one monster. The hunters have to find and annihilate the monsters using their guns, jetpacks, and tracking devices. The monster's goal is to evolve. It requires him or her to prey on the smaller animals to gather experience and level up. Until the monster reaches its full power, it is very vulnerable.\n\n###Character classes\nBoth factions have several classes. The hunters have five characters in each of their four classes: Assault, Trapper, Support, and Medic. The monsters have five types: Goliath, Kraken, Wraith, Behemoth, and Gorgon. Both monsters and hunters only start with the basic characters and have to unlock the rest by defeating the enemies.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":45424,"name":"The Adventure Pals","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc5/fc5a4ff92f7621cd1e844b6a42a20310.jpg","description":"The Adventure Pals is an action-packed platformer about friendship, exploration, and riding your giraffe. Mr. B is kidnapping old people and turning them into hot dogs! It's up to you and your best buddies to save the day. You'll leap, slash, and blast your way through increasingly madcap levels filled with traps, weird and wild enemies, treasure, and more. Along the way, you'll help a whale regain confidence, take a side in the battle between toast and dinosaur, travel to a legendary sunken city and decide the fate of a Pirate election. Explore the world on the back of your giraffe. Your travels take you across a huge land filled with zombie pirate cats, post-apocalyptic dinosaurs and hotdogs that poop explosive mines. Explore the mystical forests of Treevale, hike the haunted craters of the moon and dive into the depths of the ocean to find the lost city of Crablantis.\nInspired by classic platformers and cartoons alike, The Adventure Pals combines hilarious characters with rip-roaring platforming and combat. Level up to learn special abilities, throw bombs and whack things with your sword. Find cupcakes to unlock costumes and fill your scrap book up with secret stickers. The game is a mixture of lovingly handcrafted platformer levels, combat focused arenas and RPG-like locations with townsfolk who provide quests, items and other goodies for you to buy to aid you on your journey. Just like your favorite peanut butter and jelly sandwich, The Adventure pals is both nutty and sweet,with perhaps just a little crunch. It is lighthearted, goofy fun no matter what your age.\nGame FeaturesExplore five distinct worlds, all with their own unique characters and quests.\nLevel up by defeating baddies to improve your health, stabbin', or rock-smashin'.\nGameplay that's easy to pick up, but ramps up the challenge as you go.\nA fun and funny story with a bizarre but lovable cast and hilarious cartoon cutscenes.\nBattle such dazzling, creative bosses as vegetables, breakfast, a tree, and more!\nPlay by yourself, or with a bestie in co-op mode.\nThree words: Giraffe. Helicopter. Tongue.\nThe Pals\nThe Player\nThis is you! One minute it’s your birthday, the next your Papa is being stolen from you right before your eyes! Thrust into the role of adventurer, when all you’d rather be doing is opening presents, you quickly realise that you are a natural at this baddie-bashing, grapple-swinging, toaster-popping, quest-completing, experience-leveling, treasure-seeking malarky. But will you be able to rescue your Papa and stop Mr B’s diabolical plans in time?\nSparkles The Giraffe\nFriend. Philosopher. MENSA member. Giraffe. Sparkles has many talents beyond being a mere mount. Use her not-at-all-creepy helicopter-like tongue to slow and direct your fall, or her long neck to yank yourself to distant enemies for devastating combo finishers, or up to those hard-to-reach platforms to y’know... jump higher\nMr. Rock\nWhen you need somebody sturdy you can lean on for support, call Mr. Rock, because, well... he's a literal rock. Maybe he's a bit of a smart-aleck, but don't take him for granite... you’ll discover he has some pretty awesome abilities to unlock as you adventure through the game","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Armor Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":19320,"name":"Recettear: An Item Shop's Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98d/98d2b72cd2bbbe1ca19a29b9707758a1.jpg","description":"Recettear is the story of an item shop, the girl who lives in it, and the fairy who turned her life upside down. Recette Lemongrass finds herself in charge of an item shop built into her house, in order to pay back a loan her father took and then skipped out on - and Tear, her newfound fairy \"companion\", won't take no for an answer! As Recette, you have to decide how you'll get your stock - either through playing the markets in town or going out into the wild with an adventuring friend and thrashing beasts until they give up the goodies - how much to sell things for, what the shop should look like, and how to best go about getting the money Tear needs to pay off the loan. If you can't come up with the money... well, hope you like living in a cardboard box.\nKey features:\nManage all aspects of an item shop – from stock to interior design!\nExplore randomized dungeons – never quite the same twice!\nMultiple adventurers to choose from when dungeon-diving – no two play the same!\nPlenty to do after beating the game – challenge yourself with Survival Mode or play to your heart's delight in Endless Mode!\nEngaging story, localized by Carpe Fulgur – get to know the people of Pensee!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"EasyGameStation","platforms":[{"id":0,"name":"PC"}]},{"id":16467,"name":"Journey to the Center of the Earth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b6/4b607ca785758e5e26041b3d2f6c4752.jpg","description":"Journey to the Center of the Earth is an adventure 2D platformer game which is based on a Jules Verne novel. \n\n###Plot\nThe player can perform for three characters, separately or grouped. They are Otto, Axel, and Hans, who have decided to go on a journey to the center of the Earth. The main problem is that if the player chooses to move forward individually, the others can't go any further. So the three characters need to work together to avoid the vicious spike traps reminiscent of the old Prince of Persia, solve puzzles and survive through dangers. \n\n###Gameplay\nThe gameplay is classic: there are no battles and no enemies, the player should make his way through 18 levels. It requires solving puzzles through the use of buttons and ladders, avoiding traps, getting past every level's obstacles, and escaping various traps along the way. Every character has a unique skill: Otto can use a pickaxe to destroy stones, Axel can jump higher, and Hans can hold water in his flask - this is quite an important skill as the characters can die of thirst. It offers difficult puzzle challenges which get harder over time and ordinary gameplay length. The game has special sounds and music which repeat throughout the gameplay.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":387247,"name":"Endzone - A World Apart","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/363/363774f9eef34d299fcd0ba378e7e89b.jpg","description":"In 2021, a group of terrorists blew up nuclear power plants around the world and plunged the world into chaos. Only few were able to escape into underground facilities called \"Endzones\". 150 years later, mankind returns to the surface - under your command! In an extremely hostile environment full of radioactivity, contaminated rain and extreme climate change, you'll have to prove your worth as a leader.\nBuild a settlement on the hostile surface of the earth with over 30 different buildings and take care of your men, women and children.\nGather & refine many different resources and manage your economy by building an efficient infrastructure with streets and depositories.\nExperience dynamically simulated, believable environments! Every ground cell in the game has its own humidity and radiation values.\nSurvive in a world of constant threats including radioactively contaminated ground, droughts, toxic rain and sandstorms.\nSend expeditions to forgotten places and make meaningful decisions that change the fate of your people.\nAnd many more features coming during our early access phase...\nThe world as we know it is gone. Build a new home for the last human survivors on earth! Give them shelter and a house. Fulfill their basic needs with steady water and food supplies, educate them, ensure their survival and help them stay motivated with over 30 different buildings.\nAs the leader of your settlement, coordinate and assign different professions and tasks. Let your people gather & refine many different resources and manage your economy by building an efficient infrastructure with streets, depositories and markets.\nEvery ground cell in the game features dynamically simulated humidity and radiation. Watch as rain clouds irrigate your soil or prepare for constant fights against contaminated rain bringing devastating radiation to your lands.\nThe climate has changed! Prepare for recurring and agonizing droughts and plan ahead by stocking up food and water. Every cycle is a new challenge! Withstand the unstoppable sandstorm, as it destroys buildings and brings deadly radiation.\nThe invisible danger of radiation is still haunting the surface with contaminated rain. Protect your people from radiation sickness with special gear. Clean water with active coal filters, build roofs on your fields and dig up the ground as a last resort to remove radiation from your land.\nThe world is in shambles but some of the manmade fragments still remain. Send expeditions to ruins and long forgotten places and make meaningful decisions that change the fate of your people.\nWe want to make a game that fits the needs of our community. We’ll update the game on a regular basis, adding brand new features and challenges while listening to your feedback and wishes. Embark on a journey with us to make Endzone the best game it can be.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Gentlymad Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":236697,"name":"Luigi's Mansion 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d9/3d972802b9ee793098b73ecf676b687e.jpeg","description":"The hotel is haunted. Mario is missing. And our only hope is…Luigi?!\nLuigi’s invited to the towering Last Resort hotel, but when Mario and friends go missing, our green-clad hero will have to conquer his fears to save them! Slam, blow away, and vacuum up ghosts with the all-new Poltergust G-00, and join forces with Gooigi to overcome the puzzling contraptions and mischievous boss on each themed floor. And that’s just the Last Resort. Enter the ScareScraper for 8-player local wireless or online co-op gameplay. \n\nSee if you can defeat all the ghosts, rescue all the toads, or clear other objectives before time runs out…in the ScareScraper! And for more mini-game madness, compete on teams at the ScreamPark! Whether you play with friends or wander the hotel alone, you’ll be sucked in by the atmospheric music and ghoulish décor of every cobwebby corner you explore. Why not take in the cinematic sights and sounds with a friend? In the main adventure, you and a friend can play together as Luigi and Gooigi in two-player co-op! Gooigi can walk on spikes, slip through tight spaces, and help Luigi overcome obstacles he can’t tackle alone. Never hurts to have a friend in this hotel; it may not be very spooky, but Luigi begs to differ!\nCatch ghosts and solve puzzles to rescue Mario and friends in the Last Resort hotel\nEach floor of this towering hotel is themed, from the décor to the puzzles to boss!\nUtilize the functions of the all-new Poltergust G-00: Pummel ghosts with a Slam, break through defenses with the Suction Shot, and blow back groups with a Burst\nLuigi can call upon and control Gooigi, his all-green doppelganger, who can do what Luigi can’t\nGooigi can slip through tight spaces, walk on spikes, and help Luigi overcome obstacles\nChange between Luigi and Gooigi in single player, or let a friend play as Gooigi for 2-player co-op\nUp to 8 players can work together to ascend the Scarescaper via local wireless or online\nIt’s Team Luigi vs. Team Gooigi in a mini-game battle to see which is the ultimate team of ghost hunters","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":46080,"name":"Fell Seal: Arbiter's Mark","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9b/c9b52b5b94a9fb39ced60f64856340dd.jpg","description":"Fell Seal: Arbiter's Mark is a story-driven, turn-based tactical RPG set in a fantasy world with a touch of steampunk. Take control of the Arbiter Kyrie, an agent of the Immortal Council tasked with preserving stability and order throughout the land, and lead your troops through difficult encounters.Features:Experience an epic and mature story, unfolding through over 40 story encounters and topped with challenging end-game content.\nClassic tactical combat battles, with rugged terrain and elevation, taking place on beautiful hand-drawn environments.\nA deep and complex class system with over 20 classes and 200 abilities lets you truly customize every one of your characters through the selection of their class, sub-class and passives. Carefully craft the character you envision, be it a versatile generalist, a dedicated spell-caster or a mighty foe-crushing specialist!\nCustomize your troops' appearance your way, by selecting their portrait, outfit, colors and overall visuals from a wide selection.\nEquip your army with over 240 pieces of equipment, either purchased, gathered from fallen enemies or created from crafting.Story:Centuries ago, a brutal beast of destruction rent the world asunder. In this time of need, the first Immortals came into their uncanny powers, powers so great that they succeeded in destroying the beast ravaging the land, where all else had failed.\nTo prevent such destruction from ever happening again, the Immortals banded together to form a Council  that would enforce order and stability on a global scale, stepping in at any hint of war or chaos.\nThe Immortals might be vastly powerful, but they are few. Even they can't oversee all of the lands. This is why they rely upon their mortal agents, the Arbiters, to guard the land's people from the more day-to-day dangers they face. Arbiters range over the land, rooting out bandits, unruly monsters, and crooked officials; their word is law.\nBut one Arbiter uncovers the deepening corruption pervading her own order, and it falls to her to halt the spread of a threat as dire as the brutal beast of yore.About the game:Strongly influenced by games such as Final Fantasy Tactics (original and Advance versions) and Tactics Ogre, this tactical RPG stands on its own as a worthy successor of those classics, bringing a slew of improvements and additions to the tactics genre.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"6 Eyes Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3458,"name":"MONOPOLY PLUS","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dcc/dcc8140fdc7f29b04f6501b4fb299f6b.jpg","description":"A real living board:\n• A full 3D city at the center of the board lives and evolves as you play. You own a miniature world where each neighborhood has its own unique identity and characteristics. Its friendly inhabitants will interact with your progression throughout the game and celebrate your achievements, bringing a new dimension to your experience.  Feel that you own something special and admire your empire grow right in front of your eyes!\nPlay the way you want\n• You can change the rules and adapt them to your playing style. Play the famous Speed Die mode to spice up your game or select from a catalogue of 6 house rules chosen by Monopoly community members from around the world!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":19705,"name":"Freespace 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27c/27c5528a52c8b66b15915409a4048ca2.jpg","description":"Addressing install issuesSome users report an error when trying to launch the game.\nWe are working on a fix, but you may be able to resolve the issue right now by following these steps:\n\n1. Open the folder where Freespace 2 is installed (usually \"C:\\Program Files (x86)\\Steam\\steamapps\\common\\Freespace 2\\data\")\n2. Open the \"Registry\" folder. If there is no Registry folder open the \"Data\" folder\n3. Double-click the file \"FS2.reg\"\n4. Click the \"Yes\" button to make a system change\n5. Click the \"Yes\" button to confirm\n6. Click the \"OK\" button when Reg Edit says it's done\n7. Launch Freespace 2 from your Steam library\nDepending on your system settings, you may need to temporarily lower your UAC (User Access Control) settings or disable your anti-virus to make the change. Then re-enable UAC and/or your anti-virus software. We apologize for any inconvenience.\nAbout the GameThe year is 2367, thirty two years after the Great War. Or at least that is what YOU thought was the Great War. The endless line of Shivan capital ships, bombers and fighters with super advanced technology was nearly overwhelming.\nAs the Terran and Vasudan races finish rebuilding their decimated societies, a disturbance lurks in the not-so-far reaches of the Gamma Draconis system.\nYour nemeses have arrived... and they are wondering what happened to their scouting party.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Volition","platforms":[{"id":0,"name":"PC"}]},{"id":3403,"name":"DEAD OR ALIVE 5 Last Round","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8a/a8a624bbf3e96658fca79a7700de55d7.jpg","description":"The final word in fighting entertainment - DEAD OR ALIVE 5 Last Round!\nTwo new playable characters join to make the largest roster in series history!\nTwo fan favorite stages make their triumphant return with updated graphics and gameplay!\nWith new effects and skin shading technology, the hottest fighters in gaming look better than ever!\nVideo output in Full HD 1080p requires 1080p native display.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-4 players\nNetwork Players 2-16\n11MB minimum save size\nDUALSHOCK®4\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\nDEAD OR ALIVE 5 Last Round ©2012-2014 KOEI TECMO GAMES CO., LTD. & Team NINJA All rights reserved. DEAD OR ALIVE, LAST ROUND, TECMO, Team NINJA, and the Team NINJA logo are trademarks or registered trademarks of KOEI TECMO GAMES CO., LTD. The KT logo is a registered trademark of KOEI TECMO HOLDINGS CO., LTD.　Akira, Sarah, Pai, Jacky characters ⒸSEGA. Virtua Fighter is either a registered trademark or trademark of SEGA Corporation. All other trademarks are properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":2058,"name":"Bound","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9bd/9bdb0abe91e00389fb6b3225f414f695.jpg","description":"In Bound, the player takes on the role of a dancing lady in a surreal imaginary world.\n\n###Plot\nThe game serves as a metaphor for pregnancy. The frame story explains that the game is set in a world imagined by a pregnant woman who fantasizes about being a princess in another world. This princess is the main protagonist, and she follows the quest her mother Queen gave her. There's a monster that tries to destroy the Queen's kingdom. The character's goal is to find a way to defeat the monster. \n\n###Gameplay\nIn the prologue, the player controls the pregnant woman in the real world. In the main game, the player assumes the role of the dancing princess. Her movements, such as jumps and rolls, resemble that of ballet dancers and gymnasts. Most of the game consists of the protagonist navigating the world, jumping platforms, walking tightropes and climbing, with few occasional fights. An Edge Guard system ensures that the protagonist cannot fall from most platforms. At the few selected locations, the protagonist can fall to her death and respawn.\n\n###Style\nBound features a notably colorful and surreal visual style. The environment around the protagonist consists of geometric shapes that change in constant motion. Locations often reflect certain aspects in the life of the frame story protagonist. The game is set to electronic ambient music.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":62505,"name":"Genesis Noir","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dec/decdfa154a72265cd2914097666a99d5.jpg","description":"Genesis Noir is set before, during, and after The Big Bang. To save your love, you must stop the expansion of the universe.\nA love triangle gone askew as cosmic beings quarrel in the dark nether of pre-creation. Confrontation and a shot fired. A Big Bang. The birth of the universe, an expanding force of destruction, the Earth a fragment of shrapnel hurtling towards the fragile heart of a god.\nCan you find a way to stop the Big Bang and save her?\nWe've made a short story on the web that will give you a taste of the tone and interactions you'll find in Genesis Noir. Try the teaser experience at http://GenesisNoirGame.com/teaser\n\nThe Game\nGenesis Noir is an adventure game with an emphasis on exploration, tactile interactions, and generative art. You will wander around 3D starscapes and 2D vignettes. You will collect cosmic clues solve little puzzles and play with particles. You might even destroy the universe.\n\nDiscover worlds familiar and alien. Explore nebulae, asteroid fields, black holes, primordial Earth, and jazz cafes. Become acquainted with the massive, the microscopic, and everything in between.\n\nPlay with generative systems and discover what they create. Express yourself by planting seeds, transforming landscapes, creating and destroying stars, or improvising a jazz duet.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Feral Cat Den","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":4228,"name":"Of Orcs and Men","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6e/b6e8669dc5a328ba97b2f10ee521e1ea.jpg","description":"Lead the revolution of the Orcs and Goblins!\nIn a world at war, the vast Empire of Men tries to extend its domination over the territories of the Orcs and Goblins, who are systematically persecuted, enslaved and massacred. Through this great role-playing game, lead a fearsome Orc warrior, and a Goblin master of assassination and stealth.\nYou have been appointed to fulfill an extremely dangerous mission, deep in enemy territory: to kill one man... the Emperor himself. Fight your way through a terribly hostile world to reach the objective of your quest. Level up, learn and develop powerful skills, and finally free your people from the yoke of the Empire!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":485010,"name":"Mass Effect: Andromeda Deluxe Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfa/bfaded7a4a43864ce1835985078b131b.jpg","description":"EA Play\nAbout the GameMass Effect™: Andromeda takes players to the Andromeda galaxy, far beyond the Milky Way. There, you'll lead the fight for a new home in hostile territory as the Pathfinder - a leader of military-trained explorers. This is the story of humanity’s next chapter, and your choices throughout the game will ultimately determine humanity's survival.\nPlay as the Pathfinder - a leader of a squad of military-trained explorers - with deep progression and customization systems. This is the story of humanity’s next chapter, and your choices throughout the game will ultimately determine our survival in the Andromeda Galaxy.\nAs you unfold the mysteries of the Andromeda Galaxy and the hope for humanity lies on your shoulders – You must ask yourself… How far will you go?\nKey Features:\nReturn to the Mass Effect universe. Lead the first humans in Andromeda on a desperate search for our new home. In this new chapter of Mass Effect, meet and recruit all-new, interesting characters caught up in an epic space saga filled with mystery and galactic conflict.\nFight for survival. Battle with your Pathfinder team against terrifying enemies and creatures. New additions like destructible environments, boosted jumps for added verticality, and all-new weapons and Biotics make combat more thrilling than ever.\nBuild your hero. Create a formidable hero with amazing weapons, powers and tech. A much more flexible skill and weapon progression tree means you can replicate your play style to make you unstoppable against new, powerful alien enemies.\nExplore a new galaxy. Chart your own course in a dangerous new region. Unravel the mysteries of the Andromeda galaxy as you discover rich, alien worlds in the search for humanity’s new home.\nThe Deluxe Edition contains:\nDeep Space Explorer Armour. Looking for armour that can stand up to anything a brand new galaxy can dish out? With the Deluxe Edition, you'll get to gear up with Deep Space Explorer Armour.\nNomad Skin (3). Make sure your Nomad really stands out while you're exploring mysterious new planets with this unique skin.\nMultiplayer Booster Pack. Jump-start your multiplayer co-op play with a booster pack. Includes five 50% XP Boosters (entitled instantly, limit 1 per match).\nPathfinder Casual Outfit (2). Nobody wants to wear their uniform 24/7. Whether you're relaxing aboard the Tempest or exploring a friendly space dock, this casual outfit will help you look your best.\nScavenger Armour. Stand out from the crowd, even when you're planetside on a deadly new world.\nPathfinder Elite Weapon Set (4). Ditch the standard gear and go Elite. Battle your way through Andromeda with this unique set of weapons.\nPet Pyjak. Everyone’s favourite space monkey is back and can join you aboard the Tempest.\nDigital Soundtrack. Kick back and enjoy the incredible music of Mass Effect anywhere you go with this digital download.\nMultiplayer Deluxe Launch Pack. Get a head start on Day 1 co-op play with the Multiplayer Launch Pack, which includes items to kick start your progress (entitled instantly).\nAsari Adept Multiplayer Recruit Pack. Lightly armored, with a focus on biotics as the primary form of attack and defense, Asari specialize in crowd control and damage.\nTurian Soldier Multiplayer Recruit Pack. The Turian soldier is a tough and versatile powerhouse. The soldiers’ primary tools are their weapons, but a Turian may utilize advanced armor technology to gain an edge in the fight.\nMultiplayer Deluxe Launch Pack. Get a head start on Day 1 co-op play with the Multiplayer Launch Pack, which includes items to kick start your progress (entitled instantly).","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"BioWare","platforms":[{"id":0,"name":"PC"}]},{"id":62423,"name":"Dicey Dungeons","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e4/0e4d3e51d6366a64997d8a41749b6681.jpg","description":"Escape the cruel whims of Lady Luck in Dicey Dungeons! A new roguelike by Terry Cavanagh, Marlowe Dobbe, and Chipzel, coming out in autumn 2018!\nLearn to master six different characters, each with their own unique playstyles - ranging from the push your luck and risk it all Robot, to the swaggering, just smash stuff Warrior, to the carefully laid plans of the Witch.\nCan your adventurers make it out? Maybe - but luck is definitely not on their side.\n(Current screenshots are from the work in progress alpha version.)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Terry Cavanagh","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":274757,"name":"Sayonara Wild Hearts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/77c/77ca75b962f0ca9f7de6eb03814d6b5b.jpg","description":"Sayonara Wild Hearts is a euphoric music video dream about being awesome, riding motorcycles, skateboarding, dance battling, shooting lasers, wielding swords, and breaking hearts at 200 mph.\nAs the heart of a young woman breaks, the balance of the universe is disturbed. A diamond butterfly appears in her dreams and leads her through a highway in the sky, where she finds her other self: the masked biker called The Fool.\nTraveling through futuristic cities, dark forests, and electric deserts, The Fool sets out to find the harmony of the universe, hidden away in the hearts of her star crossed allies: Little Death, Dancing Devils, Howling Moons, Stereo Lovers and Hermit 64.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Simogo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":46404,"name":"Keyboard Killers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ace/acec7c6c30a90405339c02cd5ae673a2.jpg","description":"Keyboard Killers is not simple keyboard clicker game. In which you should kill meteors to save your starship and your friend dragon.\n- 28 different levels\n- 4 difficulty level\n- Each level has its own cool rock song\n- Create your own music on the special level with 22 various sounds\nPlaying for a long time you can learn to type blindly (or you can kill your keyboard)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Heaven Brotherhood","platforms":[{"id":0,"name":"PC"}]}]