[{"id":4493,"name":"Tom Clancy's Splinter Cell Double Agent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/33d/33d72d63a624f17431d39922359c7bf8.jpg","description":"The best-selling Tom Clancy's Splinter Cell® saga takes on an entirely new direction.\nIn the highly anticipated sequel to the 2005 game of the year, Tom Clancy's Splinter Cell Double Agent™, play as a double agent spy for the first time ever. Take on dual roles of covert operative and ruthless terrorist, where your choices of whom to betray and whom to protect actually affect the outcome of your game.\nExperience the relentless tension and gut-wrenching dilemmas of life as a double agent.  Lie. Kill. Sabotage. Betray. All to protect the innocent. How far will you go to gain the enemy's trust? As covert operative Sam Fisher, you must infiltrate a vicious terrorist group and destroy it from within. You'll need to carefully weigh the consequences of your actions. Kill too many terrorists and you'll blow your cover. Hesitate and millions will die. Do whatever it takes to complete your mission, but get out alive.\nDouble agent gameplay and branching storyline - Play both sides and decide between opposing NSA and terrorists objectives. You choose who's priorities to support, and who's to undermine. Your actions affect the story and gameplay, leading to shockingly different endings.\nUpgradeable weapons and gadgets - As you progress get access to upgraded prototype gadgets and weapons, like improved night vision, based on your choices and covert skills.\nAuthentic double agent tactics - Use realistic tactics, based on testimonies of actual undercover agents, to sabotage the enemies' plans.\nDon't blow your cover - Steal, destroy, kill, and evade the authorities. Do whatever it takes to make your mark and gain the terrorists' trust.\nA world of International espionage - Go from Shanghai and Cozumel to America itself, where New York City and Los Angeles are threatened by the terrorists' agenda of destruction.\nAll-new extreme gameplay situations - Conduct your missions underwater amidst churning ice floes, in a blinding sandstorm, or even sheathed in dust and smoke.\nInnovative multiplayer - The critically acclaimed multiplayer modes are back with new innovations and exclusives for each platform. Get recruited and earn rank upgrades, and sabotage and spy for your team.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19377,"name":"Operation Flashpoint: Red River","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/810/8100f945426cd77450ae0c62cffcb288.jpg","description":"Operation Flashpoint: Red River is a tactical first-person shooter, set in the modern world. The game is a sequel to Operation Flashpoint: Dragon Rising,  and overall a third game in the series.\nThe game’s protagonists are a squad of four US Marine Corps soldiers, each with their unique skills and fighting capabilities. The main campaign focuses on a fictional conflict in the Middle East, featuring both single-player mode and cooperative multiplayer.  The battles in Operation Flashpoint are unique in a way that the players will feel the battleground, facing a real threat of getting their platoon killed, therefore making them plan their every step and use the surroundings to ensure victory.\nWhile, the game lacks competitive multiplayer, due to its focus on realism and refined experience of a fast-paced military simulator, the cooperative experience will allow players to fully immerse themselves in what would seem like a real test of nerves, teamwork, and tactics.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Codemasters","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":52997,"name":"Grand Theft Auto 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/623/623eff489e5fcfd3d684e902d3efad8b.jpg","description":"Grand Theft Auto is back. The cars are faster. The streets are busier. The bad guys are nastier. The police are angrier. And now, the FBI and the Army are getting involved...\n\nSeven ruthless gangs are involved in a ruthless power struggle and it is up to you to make a name for yourself.\n\nRespect is earned, not given.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"DMA Design","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Dreamcast"}]},{"id":22512,"name":"Diablo II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f7/8f79c37b124822e59af54023ae6bb384.jpg","description":"Diablo II is an action role-playing hack and slash video game developed by Blizzard North and published by Blizzard Entertainment in 2000 for Microsoft Windows, Classic Mac OS, and Mac OS X. The game, with its dark fantasy and horror themes, was conceptualized and designed by David Brevik and Erich Schaefer, who with Max Schaefer acted as project leads on the game.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Blizzard North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4813,"name":"Alien Breed 2: Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdc/fdc21a8972c4b38fb0e517db7f6e9e23.jpg","description":"Alien Breed 2: Assault is an isometric shooter with survival elements, a second part in the series, following the original release of 1996 and its 2010 remake. The setting of the game is the distant future, on board a spaceship, seemingly attacked by an unknown foe.\nThe protagonist of Alien Breed is Theodore J. Conrad, a Chief Engineer at a spaceship, facing off troubles of crashing into an enemy ship and the consequent invasion of its inhabitants. The player faces off hordes of aliens throughout the levels of the game, following a story of survival, unknown experiments and the eventual fate of our hero. The game features a vast arsenal of weapons to choose from, each with their pros and cons, and different pickups to help Conrad on his quest.\nAlien Breed 2: Assault includes 2-player cooperative mode, where players can either complete the story together or face off in survival mode, in which they have to stand against endless swarms of enemies. Steam is fully supported for the game, allowing players to compete using leaderboards and challenge each other to beat their scores.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":12318,"name":"Multiwinia","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d6c/d6ca63f03cfd918d0cb51fa2735cab52.jpg","description":"Multiwinia is a sequel to Darwinia. The game is set in a virtual world formerly known as Darwinia that was created as a science experiment. Its virtual tribes eventually went to war on each other to control the world that was now renamed Multiwinia. The Multiwinians are two-dimensional creatures, hence the subtitle Survival of the Flattest. The world around them, however, is surprisingly three-dimensional, albeit with very minimalistic, intentionally low-polygonal graphics that are meant to represent a virtual simulation. Hence, Multiwinia is all about gameplay, not the plot or visuals.\nYou control a tribe of Multiwinians, who look as small, static, vaguely human-like silhouettes. Each tribe is distinct from another in color only. There are six modes, each with its own conditions of victory; those are Assault, Blitzkrieg, Capture the Statue, Domination, King of the Hill, and Rocket Riot. Some of this modes require Multiwinians to capture certain points on the map or to destroy a specific enemy unit, such as a weapon of mass destruction. Each mode allows both a single-player game against the CPU and a multiplayer for up to four players. The controls in Multiwinia are innovative and somewhat unusual yet intuitive. A  WASD-controlled camera is meant to allow a variety of views on the map.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Introversion Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21,"name":"DiRT 4","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b30/b30ea243cef7c8f3cd498c103c29eda7.jpg","description":"Motorsport by its very nature is dangerous. DiRT 4 is all about embracing that danger. It’s about the thrill, exhilaration and adrenaline that is absolutely vital to off-road racing. And more than that, it’s about loving that feeling. It’s about pushing flat out next to a sheer cliff drop. Going for the gap that’s slightly too small. Seeing how much air you can get in a truck. They call it ‘being fearless’.\nDiRT 4 also features a game-changing system called Your Stage; an innovative rally route creation tool that allows you to produce an almost-infinite number of unique stages at the press of a button. You choose your location and set the route parameters, then Your Stage does the hard work to create a unique rally stage that you can race, share with your friends and then challenge them to beat your time. Your Stage allows experienced rally players to create longer, more technical routes, whilst newcomers can create simpler shorter routes as they hone their skills.\nWith DiRT 4, Codemasters have sought to bring the levels of thrill from last year’s DiRT Rally with the fearless excitement, accessibility and adrenaline-fueled races previously seen in its critically acclaimed prequels DiRT 2 and DiRT 3.\nFeaturing classic rally racing that continues to build on the foundations set by the Colin McRae Rally games, the bruising contests from the official FIA World Rallycross Championship, the crazy battles of racing trucks and buggies, and the outrageous fun of open events in Joyride, players will face challenges from locations that span three continents.\n• OVER 50 OF THE MOST BREATH-TAKING OFF-ROAD CARS EVER BUILT – Including Ford Fiesta R5, Mitsubishi Lancer Evolution VI, Subaru WRX STI NR4 and Audi Sport quattro S1 E2\n• 5 INCREDIBLE RALLY LOCATIONS WITH MILLIONS OF ROUTES – Australia, Spain, Michigan, Sweden & Wales\n• THE OFFICIAL GAME OF THE FIA WORLD RALLYCROSS CHAMPIONSHIP – Race at Montalegre, Lohéac Bretagne, Hell, Holjes & Lydden Hill in a multitude of different series\n• LANDRUSH – Short-course dirt track racing in Pro Buggies, Pro-2 Trucks, Pro-4 Trucks and Crosskart vehicles in California, Nevada and Mexico\n• JOYRIDE - Laptime challenges, smash challenges, free-play area and send challenges to friends\n• DiRT ACADEMY – Taking place at the DirtFish Rally School in Washington, USA, learn the skills, techniques and practice to become the best!\n• CAREER MODE – create your driver, compete across the disciplines, gain sponsors and build your team with clear goals and rewards\n• COMPETITIVE GAMING – Daily, weekly and month-long challenges against fellow players from around the world\n• NEXT GENERATION OF RACENET – Live ladder, leagues and tournaments, cross-platform leaderboards, enhanced CREST telemetry system\n• TUNING – Tweak your set-up based on vehicle, track and weather conditions to best suit your racing style\n• DAMAGE & REPAIRS – Wear and tear is faithfully recreated with an improved and realistic damage model. Damage can be repaired by hiring Engineers to work in the team’s Service Area between stages but with a finite amount of time available.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":5718,"name":"Starpoint Gemini 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95a/95a33413f84e474ada45f4c9ff2d5766.jpg","description":"In Starpoint Gemini 2, you assume the role of a starship captain in the distant future. Set in the open world of Gemini system, the game continues the original Starpoint Gemini. The player controls a single vessel that can be used not only for battle but also for many other missions. There are many occupations in the game, and the player can trade, mine resources, explore new planets, enter wars, rescue other ships in distress, hunt for space pirates, or even become a pirate. In the freeroam mode, your missions are randomly generated, while in the campaign mode, there are also scripted quests that form the game’s plot. It offers you a role of a young space cadet who seeks revenge for his dead father. The plot is not binding, however, and the game is more oriented towards free exploration.\nThere’s a roster of more than sixty ships to choose from, and three classes to which your captain character can belong: Gunner, Commander, or Engineer. Each of them has special perks. The ship can be upgraded with new weapons, defenses, and engines. As your influence and wealth grow, you can buy more ships and expand your fleet. You will still only control one ship at a time, while the others may serve as wingmen.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Little Green Men Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":2857,"name":"Not A Hero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37f/37f58feca84811904d56a0ebfdc3531e.jpg","description":"Not A Hero is an indie cover-based 2D shooter game developed by Roll7.\n\nA purple rabbit named BunnyLord uses time travel to become a mayor and save the world from the alien invasion. In order to prove to the people that he has to be elected, he hires freelance anti-heroes to get rid of the crime in the city.\n\nNot A Hero features a unique pixelated style. At the beginning of each level, the player chooses one out of nine characters. Each character has their own traits and a set of unique gameplay changes. The players have a primary weapon that they can upgrade either temporarily or until the level is completed. Special weapons are also available, such as automatic turrets or exploding cats.\n\nThere is no jumping in the game, yet the player can slide. Sliding can be used to get into cover against the in-game objects or tackle enemies which makes them easier to kill. The characters can withstand several hits and the health is restored pretty fast.\n\nThe game features different objectives for each level, but every one of them is issued by BunnyLord.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":89,"name":"Geometry Dash","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fba/fbad5c48939e7887872754c9167c3f68.jpeg","description":"Jump and fly your way through danger in this rhythm-based action platformer!\nPrepare for a near impossible challenge in the world of Geometry Dash. Push your skills to the limit as you jump, fly and flip your way through dangerous passages and spiky obstacles.Game Features\nRhythm-based Action Platforming!\nLots of levels with unique soundtracks!\nBuild and share your own levels using the level editor!\nThousands of high quality user generated levels!\nUnlock new icons and colors to customize your character!\nFly rockets, flip gravity and much more!\nUse practice mode to sharpen your skills!\nLots of achievements and rewards!\nChallenge yourself with the near impossible!\nSteam users get two exclusive unlockable icons!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"RobTop Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":5940,"name":"NightSky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea9/ea9036e881db5e334e10b2b61aecb29e.jpg","description":"NightSky is an 2D action-puzzle indie video game with elements of platforming. The game offers uniquely challenges in various colorful worlds. There is a mechanic in the game which lets player to move a sphere using realistic physics. Every world in the game is broken into different areas which the player has to explore. The game is known for its surrealism and the experimental jazz music soundtrack helps to deliver the weirdness for the game as well as weird yet imaginative visuals. \nNightSky has multiple difficulty selection, 2D physics models, 11 big levels with many various areas to explore, multiple vehicles with specific uses and additional secrets in levels of the game. It’s one of those small yet artistic indie video games which tells a story through the atmosphere, music and unique visuals. It is a must play indie for fans of games like Limbo and for lovers of dark, strange and surreal atmosphere.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nicalis","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":2453,"name":"Halo: Spartan Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/93f/93f10d635566ff67e4f743c2c8f2c4dd.jpg","description":"Halo is a franchise of first-person shooters that is set in the far future, on the frontiers of colonized planets, in a war with the Covenant. But Halo: Spartan Assault takes the formula and changes one element of the setting. Now players are experiencing the series through an isometric top-down twin-stick shooter. The game story takes place between Halo 3 and Halo 4, where humans and Covenant signed a ceasefire to stop the war. Through the treacherous attack that some rogue Covenant group carried out, the leadership of the aliens learns that one of the moons surrounding Draetheus V is an ancient planetary weapon. And it’s up to Spartans Sarah Palmer and Davis to stop the destruction and fight back.\r\nThe game allows players to participate in weekly challenges on top of story campaign consisting of 30 levels. All Halo weapons and transports up to the release date were added, players access armor abilities and even customize their Spartan.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"343 Industries","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":582,"name":"Dex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/208/208e7b762854229b044ba376d673ce6a.jpg","description":"Discover the truth behind an enigmatic AI striving to reach the Singularity, a theoretical “event horizon” in which artificial intelligence will surpass human intelligence and all bets about the future will be off. How will you play your part in the story?\nExplore the futuristic city of Harbor Prime and meet its many inhabitants, answer the challenges the city has to offer, roam the neon-lit streets, and augment your character with skills and implants.\nDesigned as a tribute to the classic RPGs from the ‘90s, updated for a modern audience, Dex invites you to become part of a living, breathing cyberpunk universe as you decide which ultimate path you will embrace.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Badland Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":21717,"name":"Serena","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ede/eded5812fefb48ac4477b0ef947b0f21.jpg","description":"Serena is an adventure game made by numerous developers, mainly Senscape, and released as a freeware title with the intention to show off Senscape’s Dagon engine. The game features voice acting from famed adventure games developer Josh Mandel, and Sarah Wilson was also known as Pushing Up Roses. \n\n### Plot \nSerena is a small story-driven point-and-click adventure game that can be completed in roughly half an hour. You play as an unnamed protagonist, waiting for his wife Serena in a wooden cabin in the middle of the forest. He cannot remember anything about her, and as a player, you have to evoke memories. The game’s atmosphere changes throughout the game. It starts as a romantic story, but as the protagonist recollects the event of the past, it becomes gloomier and darker. \n\n### Gameplay  \nSerena consists of exploring the cabin and interacting with items. The game does not let you walk freely and only needs a mouse to control. Finding different items restores fragments of the main hero’s memories. After some time, his attitude towards different objects in the cabin changes so does his emotional condition. Serena’s design intends the completion in one sitting, There are no settings and pressing ESC key closes the game without saving.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Senscape","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":7536,"name":"Dead Rising 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e0/7e09315d72e12b6cd8995ba18b5f70d0.jpg","description":"Dead Rising 4 marks the return of photojournalist Frank West in an all-new chapter of one of the most popular zombie game franchises of all time. All of the classic hallmarks of the ground breaking series return, including a huge array of weapons and vehicles players can combine to combat the horde ranging from the practical – to the practically insane. Players will also enjoy ambitious new features including new zombie classes, EXO Suits, and 4-player co-op multiplayer. With intense action and an unmatched level of weapon and character customization, Dead Rising 4 delivers a heart-pounding experience as players explore, scavenge and fight to survive in an epic open world sandbox.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Capcom Vancouver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":471027,"name":"Tetris Effect: Connected","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/377/3770f2c7020bcb6cc2072f073f27fb4c.jpg","description":"Tetris® Effect: Connected adds an all-new robust multiplayer expansion to the huge variety of addictive and innovative single-player modes that Tetris Effect is known for with all-new co-op and competitive online and local multiplayer modes!\nTetris Effect is Tetris® like you've never seen it, or heard it, or felt it before—an incredibly addictive, unique, and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite and legendary puzzle game Lumines.\nMusic, backgrounds, sounds, special effects—everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing, making any of the game's 30+ stages and 10+ modes something you'll want to experience over and over again.\nA challenge for the mind and a feast for all the senses, TETRIS EFFECT is the perfect excuse to play Tetris again... and again...and again, and again, and again and again and again and again and again and again and...\nGame leverages Smart Delivery allowing access to both the Xbox One title and the Xbox Series X|S title when available.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Resonair","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":391397,"name":"Grounded","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d7/0d7b7a687bf665b61337904193c56855.jpg","description":"The world is a vast, beautiful, and dangerous place – especially when you have been shrunken to the size of an ant. Explore, build, and survive together in this first person, multiplayer, survival-adventure. Can you thrive alongside the hordes of giant insects, fighting to survive the perils of the backyard?","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":11189,"name":"Immortal Redneck","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/871/87114f517a29b1e45ac062ddcae8aef0.jpg","description":"Immortal Redneck is an FPS set in Egypt with rogue-lite elements. The game mixes old-school first-person shooter action with a rogue-lite mechanics. Frantic gameplay, twitch controls and an arcade-style feel meet randomly generated dungeons, a complete skill tree, permanent death and 9 classes with different traits.\nThe game revolves around a redneck tourist who wakes up mummified in ancient Egypt after an accident. Why is he here? How did he survive the accident? And why the hell is he mummified?!\nThe answer lies within the three danger-filled pyramids of Giza, all protected by an army of monsters and huge bosses. Obviously, your mission is to get inside the pyramids, kill all the enemies and discover what's going on!\nOld School FPS: frantic gameplay, twitch controls and an arcade-style\nRogueLite mechanics: randomly generated dungeons, classes, skills, permanent death but with gameplay progression\nNine playable classes: all with different skill sets. Players can switch classes between each play through, selecting the one most suitable for their current run\nComplete skill tree: evolve your character, buying equipment and weapons, upgrading and acquiring new skills\nOver 50 different weapons: traditional firearms, magical, mythological, futuristic or just plain weird weapons including a Potato Launcher. You name it, this game has it\nOver 100 scroll modifiers: Each scroll picked up in-game changes your current run, for good (convert your enemies in to chickens) or for bad (reduces your speed of movement) and everything in between!\nOver 35 enemies: mummies, sarcophagus, flying skulls, humanoid snakes, big fat warriors... All willing to kill you\nHuge bosses: two in each pyramid with unique gameplay\nMerchant: Buy equipment and supplies that will be maintained between different games, even when you die\nSkill Rooms: hone your skills in rooms focused on platforming and avoiding a variety of traps\nTwitch Quest: special mode for streamers, your community will vote on what happens next","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Crema","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":727315,"name":"Ratchet & Clank: Rift Apart","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccf/ccfd3fd488a8ed61145a3da96c080131.jpg","description":"BLAST YOUR WAY THROUGH AN INTERDIMENSIONAL ADVENTURE\nThe intergalactic adventurers are back with a bang. Help them stop a robotic emperor intent on conquering cross-dimensional worlds, with their own universe next in the firing line.\n- Blast your way home with an arsenal of outrageous weaponry.\n- Experience the shuffle of dimensional rifts and dynamic gameplay.\n- Explore never-before-seen planets and alternate dimension versions of old favorites.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":12166,"name":"Blackguards","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d6/5d6ab867b41a604eceee6c4026292e41.jpg","description":"Blackguards is a tactical RPG based on pen and paper game The Dark Eye and followed by the sequel, Blackguards 2. The protagonist of the game is blamed for killing a princess. To prove his innocence he starts an adventure and investigates the murder. Accompanied by a dwarf and a mage, he slashes the way to the truth through hordes of enemies.\n\nThe game places the focus on fights. The first feature is that every hit has a 95% chance to work; this means that even a close punch can be failed. The second feature is the interactive entertainment: during fights you can set things on fire or destroy buildings to hurt or distract your enemies.\n\nThe game also features a development system. You can upgrade members of your party with experience points you get from battles. Imbalanced resource management can lead to huge problems during the fights.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58861,"name":"The Surge 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24b/24bf67a50cb870ed6aad844f8b276115.jpg","description":"On the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm looms over the cityscape...\nIn a bid to survive, explore the sprawling, devastated city of Jericho. Fight its numerous, ferocious threats in brutal, unforgiving combat, slashing and tearing the limbs off your opponents to steal valuable equipment that will make you stronger - strong enough to face the most fearsome, imposing foes lurking in the city. With an expanded arsenal of weapons, armors, abilities, implants, and drones to build your character, and a bigger, more varied and more ambitious world, The Surge 2 challenges you to survive and unravel its hidden secrets.\nHardcore, brutal melee combat\nFace deadly foes and colossal bosses\nCut off parts of the enemy you want to loot\nRich character progression and customization","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10165,"name":"Orcs Must Die! Unchained","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/968/968df3dbb85d2d7aa96ace33a7b2c9af.jpg","description":"Orcs Must Die! Unchained is a tower defense action game where you not only set different traps to prevent enemies from destroying your base but also fight them directly.  Unchained is the third installment in the series, that includes Orcs Must Die! and Orcs Must Die! 2.\n\nThe core gameplay in Unchained doesn’t differ from its predecessors, mixing classical tower defense features with elements of a hack and slash game. To buy and upgrade your traps you can use both in-game currency you get from matches and real money.\n\nHowever, Unchained introduced two new modes to the franchise. The game puts a heavy focus on cooperative playthrough in its  Survival mode. It doesn’t differ much from the single-player mode, as you need to protect the base from a certain amount of enemy waves. But here you work together with other players and need to unite your actions to be more efficient. Another new mode is Sabotage. Here you compete with the second team, killing enemies. The team that survives the most waves wins; you can prevent your opponents from the victory, summoning monsters and ruining their traps.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Robot Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":3533,"name":"The Unfinished Swan","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a3/5a335ee04477c97d393e8ba03f8e6d91.jpg","description":"\"Sony exclusives are mostly story driven experiences and Unfinished Swan is no exception. It’s a first-person adventure game about a young boy named Monroe, who recently lost his mother, famous artist known for not finishing a painting, adding up to the number of her incomplete works. And out of all her works, Monroe is permitted to keep only one favorite, a swan with a missing neck. And one night he wakes up to see the swan escape, and after the short chase players will find themselves in a painted unfinished world, finding the missing swan.\nOver the course of the game, players will use a magic silver brush to spread the black paint over the blank and completely white environment, to locate a way to progress and solutions to puzzles, while the narrator tells a story of a Lonely King. Most of the environments and the painting tool are used to show players, that Unfinished Swan is more of a narrative experience, where puzzles are not stopping your progress entirely, but act as an obstacle. There is no active combat in the game, so the actions of the player will wholly dictate the pace and completion.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5432,"name":"Bionic Commando: Rearmed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f9/3f9413c8f5844bc82214cc59886fc559.jpg","description":"The game is an improved version of the game Bionic Commando, previously released for the platform Nintendo.\n\nTwo states, the Federation and the Empire, compete with each other. One of the trump cards in this game is the project \"Albatross\", which at first is known only that this superweapon. The Federation suspects that the Empire is working on this project and will soon finish it. The Federation sends a national hero named Super Joe to disrupt the plan. But Super Joe fails the mission and becomes a prisoner. The detachment led by Nathan Spencer goes to help Joe. Nathan is more fortunate, he gradually learns about the project \"Albatross\" more and more - in the end it turns out that the goal of the project was the resurrection of Adolf Hitler. Moreover, the project is completed and Hitler has already come to life. Nathan will have to destroy Hitler again.\n\nThe gameplay consists of moving the hero through the levels and destroying the enemies. Nathan has a bionic hand - it adds novelty and variety to the game. Nathan with this hand can move through the levels to get to the bosses and transitions to the next level, and to gain access to bonuses. On the other hand, because the hand is very heavy, the hero can not jump. The theme of bionic devices is the basis of puzzles, which are also present in the game.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":854354,"name":"Portal with RTX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f72/f728954e667e580ba2ac507db226ae48.jpg","description":"Portal with RTX is a free DLC for all Portal owners developed by NVIDIA Lightspeed Studios. Experience the critically acclaimed and award-winning Portal™ reimagined with ray tracing. Every frame of gameplay is upgraded with stunning full ray tracing, new, hand-crafted hi-res physically based textures, and new, enhanced high-poly models evocative of the originals, all in stunning 4K. In Portal with RTX, full ray tracing transforms each level, enabling light to bounce and be affected by the scene’s geometry and materials. Every light is ray-traced and casts shadows, global illumination indirect lighting naturally illuminates and darkens rooms, volumetric ray-traced lighting scatters through fog and smoke, and shadows are pixel perfect. Portal with RTX is compatible with all ray-tracing capable GPUs.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Lightspeed Studios™","platforms":[{"id":0,"name":"PC"}]},{"id":44931,"name":"Do Not Feed the Monkeys","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cef/cef4e36ef6ecf82f9e36e32fb0f9c612.jpg","description":"Do Not Feed the Monkeys is a unique digital voyeur simulator.\nNow that you’ve been accepted by “The Primate Observation Club” you can invade the privacy of dozens of strangers and witness their most intimate moments while you make your living. Progress in the Club and don’t forget its number one rule: do not interact with the spied specimens. Do Not Feed the Monkeys.\nBrowse social networks, wikis, websites, newspapers, online stores… and use chat and email tools. Once you’ve got information about the spied people… will you intercede in the name of justice, will you sabotage their dreams, or will you sit idly by while the world burns?\nWhatever you do (or don’t do) will have consequences!\nMONITOR hacked surveillance cameras\nPRY INTO the lives of dozens of subjects\nINTERACT (or not!) with fun, sad, horrific, surprising, dramatic, or sci-fi themed narratives\nDECIDE THE FATE of the subjects: will you help them? Will you expose their most intimate secrets?\nBROWSE social networks profiles, wikis, websites, newspapers, online stores... Use chat logs, email tools and more!\nMANAGE your resources: will you spend all your savings on buying more “cages”, or will pay rent? Are you healthy enough to work? How many sleepless nights can you stand before collapsing from exhaustion?\nREPLAY to experience different climactic endings\n\"The Primate Observation Club” is not a wildlife conservation society as the name would suggest. It is a front for a shadowy group used to watch others through surveillance cameras and compromised webcams. Tired of your ramshackle apartment, dull existence and boring jobs, you’re accepted into the exclusive organization, so you can pry into the privacy of the “caged monkeys” as they go about their lives…\nThe Club urges you to not interfere with those observed, though you need to progress in it to access the mythical “Big Primate Cage”. But... will you resist? Will you help those you’re spying on, extort them, expose them, or will you follow instructions and just watch?\nWhatever you decide to do, or not do, there will be consequences!\nDo Not Feed the Monkeys includes a little of uncensored pixelated violence and pixelated nudity. It might not be suitable for younger players or photo-realistic nudity lovers.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":3759,"name":"Castlevania: Lords of Shadow 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df1/df1214c2454b88285fc78fc36bc12cde.jpg","description":"Castlevania: Lords of Shadow 2 is an action-adventure and a straight continuation of the first part of the franchise. It is also 39th part of the vast Castlevania series. The game currently features no successors.\n\n###Gameplay\nThe game, unlike its predecessor, features an open-world structure. The player follows the adventures of Gabriel Belmont through medieval settings and modern environments. Sometimes — at the start of the story, to be precise — the players gain control of Dracula who possesses Gabriel and gives him similar powers. The game consists of many fighting sequences in which combos are of importance — the various swords and claws, some allowing the protagonist to replenish his health and the other dealing massive damage to the enemies.\n\n###Story\nThe game is highly story-driven. At the start, the developers present the players with the scenes of flashbacks, in which the transformation to Dracula is shown. While set in medieval settings, events depict Dracula as he quickly gets ambushed by his resurrected son and thrown back into the modern times where he starts his adventures.\n\n###DLC\nThe Revelations DLC released a month after the initial game announcement brings some story arc to the game, while the others: \"Dark Dracula\" and \"Armored Dracula\" bring only new characters skins and sprites.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mercury Steam Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":59352,"name":"ACE COMBAT 7: SKIES UNKNOWN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c28/c2802dffd26db3d5af8244044fa1e78c.jpg","description":"Ace Combat 7: Skies Unknown is the eighth major installment of the Ace Combat series of flight simulators.\n\n###Premise and setting\nThe series is set in the Strangereal, a fictional alternate version of Earth. This world has different geography and history, albeit its countries and cultures are based on prototypes from our real world. Skies Unknown follows the Lighthouse War (also called the Second Continental War) a conflict between the Kingdom of Erusea and the Osean Federation in an alternate 2019. The goal of the war is to control the International Space Elevator. The Erusean army attacks the Osean military that protected the Elevator. In response, Osea launches a large-scale attack against Farbanti, Erusea's capital city, causing massive loss of civilian lives.\n\n###Main characters\nThe main protagonist in the Skies Unknown story campaign is Trigger, a pilot in the Osean Air Force. He was framed for murder and transferred to the penal squadron. While the player starts as an Osean military, the game does not favor any side in the conflict. Rosa Cossette D'Elise, a princess and heir to the throne of Erusea, also plays a major role in the plot.\n\n###Gameplay\nThe player controls Trigger's fighter plane, F-22A Raptor, and completes various missions against enemy fighter jets. Other types of aircraft do not appear in this game, unlike in the previous games. The game reintroduces some of the mechanics from the previous installments, such as checkpoints and player-controlled flares. Skies Unknown is also the first game in the series to make clouds influence the gameplay.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":13694,"name":"Sid Meier's Civilization: Beyond Earth","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f1c/f1c816c29db3b394d915101eaa09808a.jpg","description":"Sid Meier’s Civilization Beyond Earth is a 4X strategy game, the follower of  Sid Meier's Alpha Centauri. You need to develop a new civilization from a colony that arrives on another planet. You can choose a nation from 8 available expeditions, a settlers’ class and some other parameters that give you start bonuses and define the path your colony will follow. The goal of the game is to dominate the world.\n\nLike in the previous games of the series, Beyond Earth features resource mining and management, technology development, trading and diplomacy. However, ways to the victory differ from classic Civilization ones. Here they depend on the resource type you focus on. As a result, you can rather co-exist with the planet, become the technological leader, make this new planet more Earth-like by changing its landscape or establish contact with aliens.\n\nAdditionally to general civilization development Beyond earth often gives you tasks to progress through the game. A huge part of the game is dedicated to exploration and interaction with aliens who protect their homeland from invaders.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13514,"name":"And Yet It Moves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ef/1ef455141543c9e27ef0856a68a52b48.jpg","description":"And Yet It Moves is a platform video game which was originally designed as a computer science project at the Vienna University of Technology in 2007. The original prototype of game got various awards and creators decided to create and release a full-version of the game. \nIn this game, players have to move their pencil-drawn character who can run and jump through various hazardous environments. There is an ability to freely rotate the entire game world, like changing floors into walls and every level of the game is built with that having in mind. Also, the spinning of the game world has an effect on the main character as well as the world - walls can become flat, or walkable surfaces may move or react to the change of gravity. The game has a unique paper collage style of visuals and a beatboxing soundtrack made by Christoph Binder. The game was praised for its innovative gameplay mechanics as well as the visuals.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Broken Rules","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Wii"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9712,"name":"Overgrowth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85b/85be8468eabaacadb361eb88e92ee41f.jpg","description":"Overgrowth is an indie action game developed by Wolfire Games. It serves as a sequel to Lugaru, another title by the company.\n\n###Plot\nOn a fictional island of Lugaru, after many years after the extinction of humanity, the world is run by humanoid wolves, rabbits, rats, cats, and dogs.\n\nMost of Overgrowth's plot is not revealed yet, as the game is still in early access stage of production. The main character was carried over from the previous game. A rabbit named Turner that avenged his family by killing the Alpha wolf and a corrupt king. Turner refused to become the next king and left to explore the island.\n\n###Gameplay\nSimilar to the previous game, Overgrowth puts a strong emphasis on hand-to-hand combat. Attacks and counter-attacks are based on timing and contextual actions rather than the usual combos. \n\nThe game features an advanced physics-based animation system which allows for seamless transitions between animations. Every animation will be different based on the environment, the character's mood and even individual traits. \n\nLevels in Overgrowth introduce the players to their environment, tasks, and means of completing such tasks. Despite that, the players are free to explore the level as they see fit. This allows the players to find their own path to level completion. \n\nThe game features a sophisticated AI. The enemy characters can attack from the back or get together for an ambush. If the AI decides that it has no chance of winning, the enemies fall back.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Wolfire","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":422859,"name":"NieR Replicant v1.22474487139...","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ac/3ac2b5356ad764a87092d15cdcbee809.jpg","description":"A thousand-year lie that would live on for eternity...\n\nNieR Replicant ver.1.22474487139... is an updated version of NieR Replicant, previously only released in Japan.\n\nDiscover the one-of-a-kind prequel to the critically-acclaimed masterpiece NieR:Automata. Now with a modern upgrade, experience masterfully revived visuals, a fascinating storyline and more!\n\nThe protagonist is a kind young man living in a remote village. In order to save his sister Yonah, who fell terminally ill to the Black Scrawl, he sets out with Grimoire Weiss, a strange talking tome, to search for the \"Sealed verses.\"\n\nExperience the NieR Replicant story for the first time in the west through the eyes of the protagonist as a brother.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Toylogic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":20568,"name":"X-COM: Terror From the Deep","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75c/75c109a3b66c84787f137d948292c44a_DIwNRKi.jpg","description":"X-COM: Terror From the Deep is a strategy game, the second installment in the X-COM series and a sequel to  X-COM: UFO Defense that moves action from the outer space into the Earth’s oceans. The story unexpectedly references to Lovecraft’s novels, as you fight aliens that want to reawaken their unstoppable leader who slept under the sea for hundreds of years. \n\nThe gameplay is divided into two parts: on the one hand, you built bases, develop your technology and upgrade the squad. On the other hand, you fight aliens during turn-based battles. As the game is set underwater, your weaponry is limited and you have to study new technologies to produce and improve it. Unlike in the previous title, in Terror From the Deep you can use melee combat along with guns and special devices.\n\nThe game features various missions with different goals. Some of them include fights on several locations, the others are terror missions on huge map layouts.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":21759,"name":"Master Levels for Doom II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8a/f8ad3beca3f31d3d5033b6442ae4713a.jpg","description":"Master Levels for Doom II is an expansion pack for an action FPS Doom II. Since it is a map pack, many developers were involved with ID Software releasing the maps to the public.\n\nThe expansion pack features 21 maps (the 21st one is a secret map) with some of the maps offering their own story.\n\n###Story maps\nTitan.wad\nThere is a secret science building on Titan, which contains a mighty alien weapon. Get in, kill the guards, solve puzzles, get out.\n\nCabal.wad\nOnce upon a time, you were the biggest and the angriest cyberdemon in existence. You were the head of the council that ruled Hell, at least you were before you were betrayed. Go out there and get revenge.\n\nInferno.wad\nAfter all the trouble you've gone through at the UAC facility, you've lost track of your girlfriend Beatrice. It's no mystery how you got separated with all the demons running around. Go back to Hell and get her out.\n\n###Gameplay\nThis expansion pack brought no changes to Doom II's gameplay. Every aspect of the game stayed largely the same.\n\nThe main objective of Doom 2 is to find an exit off the level to continue to the next one, killing any demon you find on your way. Many weapons are at your disposal, such as a shotgun, a double-barrelled super-shotgun, and last, but not least, the iconic chainsaw. \n\nThere is no health regen in the game. Instead, the players have to look for medkits on the level they are in at the moment.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"id Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Classic Macintosh"}]},{"id":16961,"name":"Space Hack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac4/ac4f75a956266aea8efa640943e5e547.jpg","description":"Set in the 23rd Century, Space Hack follows the adventures of the eponymous Hack, a space marine onboard the starship Maximus. Back on Earth, the overpopulation forced the humanity to launch several expeditions to colonize the alien worlds. The game is set on Maximus after it was attacked by the insectoid alien invaders. The levels represent various Earth biospheres contained within the ship.\nJudging by its main gameplay features, Space Hack is, basically, Diablo in space. It’s a straightforward hack-and-slash game that uses the same point-and-click controls and even a level design similar to Diablo. There’s a safe base where you heal your wounds and purchase equipment, and from there you lead Hack through the monster-infested Maximus. Compared to Diablo, the game puts an even stronger emphasis on the combat and has fewer RPG elements. The game has no character selection and no classes. There’s a skill system, but it is your equipment that has the most influence on gameplay. Hack uses a variety of sci-fi firearms that freeze, burn, or explode the alien bugs, as well as melee weapons, armor, and special items. His health regenerates over time, but the process is slow, so the protagonist will require Medpacks to restore HP.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Meridian4","platforms":[{"id":0,"name":"PC"}]},{"id":4046,"name":"Sacred Citadel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/198/19891af3c3e0b2d0b9414ec101a9e822.jpg","description":"A warrior, an archer, a sorceress and a witch are fighting with crowds of monsters, mining armor, weapons, money, potions and so on. Eatable things will also come in handy - from their absorption health is restored, which is very necessary in battles. Useful things meet abundantly, their qualities are diverse, and they have a stable demand - you can sell or change them for something else in the city. The city is present at each of the levels of the game. In the city you can even play on the sweepstakes - to bet on yourself. For example, that you will never be killed, do not suffer damage more than the specified amount, or perform the task strictly up to a certain time. Heroes of the game are skilled in battles - they can even hold several different weapons in the same hand, summing their effects in one stroke. As you progress, the characters gain experience. With experience comes skill. If the experience is not enough, you can always recruit more, having passed any level repeatedly.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":12729,"name":"LEGO Star Wars III - The Clone Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55f/55f3e8983c17a0ef9e6b18aedd4f6794.jpg","description":"The beloved and critically acclaimed LEGO® Star Wars™ franchise is back.  LEGO Star Wars III:The Clone Wars, combines the epic stories and iconic characters from the Star Wars universe and hit animated TV series Star Wars: The Clone Wars™ with all new gameplay features.\n\nPlayers will enjoy brand new game mechanics allowing them to create, control and explore in a galaxy far, far away like never before.  Promising breathtaking visuals as well as new characters and levels, the game also features the signature tongue-in-cheek humor from the LEGO universe.  With over 20 story-based missions and 40 bonus levels spanning the entire Clone Wars era, LEGO Star Wars III:  The Clone Wars will allow fans to explore endlessly and laugh their way through the Star Wars galaxy in the most humorous, accessible and action-packed LEGO game to date.\n\nProduct InformationNew Story – For the first time, players will experience their favorite stories from Star Wars: The Clone Wars, retold in the amazing LEGO world that fans know and love.\nMassive Ground Battles – Brand new to the LEGO Star Wars experience, players will take control of battalions of clone troopers against the relentless droid army - building bases, deploying vehicles and calling in reinforcements to defeat opponents.\nSceneSwap – Authentic to the Star Wars experience, a new feature allows players to take control of multiple teams in separate locations. Working together to complete various objectives, players will control each team through the press of a button, while playing in single player or in multiplayer co-op modes.\nAll New Boss Battles – For the first time in the LEGO Star Wars franchise, fans will fight against massive bosses as seen in The Clone Wars animated series, including Gor, the epic Zillo Beast and many other favorites.\nMulti-Layered Space Battles – Players will be able to take off in their favorite ships to navigate and fly through multi-layered combat throughout the galaxy.\nNew Combat Abilities – Characters will have more dynamic moves allowing players greater freedom to battle their opponents.  Characters will also have new lightsaber abilities including Lightsaber Cutting, Lightsaber Throwing, and Lightsaber Climbing.  The game will also feature new grappling abilities allowing players to climb their way through puzzles and defeat enemies.\nExplore the Galaxy – Players will be able to explore exotic locations in a variety of ships throughout 16 different star systems.  Fans will play as villainous Separatists, the noble Republic  heroes or even as bounty hunters, tracking down characters across the galaxy.  \nExpanded Force Abilities – Using the Force in all new ways to control LEGO objects, players will solve puzzles, access new areas, pick up and throw enemies - even turning them into weapons.    \nBrand New Clone Weapons, Vehicles and Characters – New clone weapons including rapid fire guns and rocket launchers, as well as all new massive capital ships to explore, such as Anakin Skywalker’s  flagship the Resolute and Grievous’ devastating warship , the Malevolence.    Players will also navigate through the galaxy in new vehicles such as the Republic gunship, Clone Turbo Tank and even Anakin’s Jedi Intercepter and the Twilight.  Fans will also  discover their favorite classic characters such as Darth Vader, Chewbacca and Luke Skywalker.\nPuzzle Solving – The game will feature all new puzzles that reward creative thinking through the use of teamwork and unique building situations only possible in a LEGO galaxy far, far away.  \nAll new lighting and animations – A brand new engine brings characters to life, giving players a whole new level of control in a vibrant environment, unlike anything ever seen before in a LEGO game.  \nSplit Screen – Improved dynamic split screen for multi-player co-op with jump in/jump out abilities for friends and families to play together.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"}]},{"id":58776,"name":"Generation Zero (2019)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b6/4b6153da124f0e1eca8f196b1fc37236.jpg","description":"Experience an explosive game of cat and mouse set in a vast open world. In this reimagining of 1980’s Sweden, hostile machines have invaded the serene countryside, and you need to fight back while unraveling the mystery of what is really going on. By utilizing battle tested guerilla tactics, you’ll be able to lure, cripple, or destroy enemies in intense, creative sandbox skirmishes.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Avalanche Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":17094,"name":"Dungeons of Dredmor","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bd6/bd68435d8cd3dd8d1bed8fc4021602f7.jpg","description":"Dungeons of Dredmor combines traditional dungeon crawler with rogue-like mechanics. The player controls the only character who enters a dangerous underground maze to find and defeat the evil Lord Dredmor. As you descend deeper into the ground, the difficulty will grow. Each dungeon is generated randomly with each replay. There are three levels of difficulty, and also an option to turn on the permanent death mechanic. If you choose it, the game will leave you with only one save file to overwrite, and no save-scumming. There’s a traditional turn-based combat system and a variety of melee and ranged attacks, as well as magic. When the characters levels up, the player can improve his or her set of seven skills that can allow, among other things, to craft, disarm traps, use spells or wield more powerful weapons. \nThe game is played from the overhead point of view on a map divided into square tiles. The visuals are relatively simple, albeit not as minimalistic as traditional ASCII-based rogue-like games. The imagery is quite cartoonish and ironic, which adds to the game’s self-aware dark humor. The main character will complain about his or her fate, and when he or she dies, which is quite often, the game will “congratulate” you for each death.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Gaslamp Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1890,"name":"Cogs","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1b/b1bde44ad4c3164f81d1249f866ad83c.jpeg","description":"Cogs is a puzzle video game in which a player has to manipulate a three-dimensional object's sides as sliding block puzzles to complete specific goals, such as meshing gears to complete a clockwork mechanism or routing gas flow through pipes to a balloon.\nEvery level of Cogs represents three-dimensional object, there are various objectives but mostly a player has to move tiles to connect sets of gears, piping and do other manipulative things to make that object behave in ordered way, for example to provide power to turn wheels. All the objects in Cogs are three dimensional, so it needs to be manipulated on different faces which could wrap around the object, or consider sides of tiles. The player has the ability to turn the object in any manner he or she wants to complete the task. \nIn the Cogs, the player mostly has to manipulate various gears, pipes with steam gas which purpose is to drive motors of gears or fill balloons and bell strikers which plays a specific melody if manipulated correctly. There are lots of levels in the game and each of them is more difficult than the previous one, adding more puzzle elements and more objects to manipulate.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Lazy 8 Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]}]