[{"id":301539,"name":"ISLANDERS","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a62/a62fb9a34ba7d37b87679387beabc970.jpg","description":"A quick note from the developers:You want to build beautiful cities without investing hours on end into stressful resource management? Say no more! ISLANDERS should be right up your alley.\nISLANDERS is a minimalist strategy game about building cities on colorful islands. Explore an infinite number of ever-changing new lands, expand your settlements from sprawling villages to vast cities and enjoy the relaxing atmosphere.\nIf you’re thinking about buying ISLANDERS please keep in mind that we are a very passionate but small team of three. This is not a blockbuster experience with hours and hours of content. What we’d like to offer you is a simple game that lets anybody create and explore their own little worlds, while providing enough depth for players who want to challenge themselves. And you can get it at the price of a medium sized pumpkin spice matcha caramel latte.\nPlease don't hesitate to contact us if you have feedback, questions, or problems with the game. We’ll do our best to get back to you as quickly as possible and provide support if needed. Also let us know if you enjoyed the game, because that makes our day!\nThis game offers you:\nIntuitive and rewarding city building gameplay\nEndless amount of procedurally generated islands\nA relaxing atmosphere\nBeautiful, vibrant colors\nGreat for playing every now and then, discovering some new islands and beating your high scoreThis game doesn’t have:\nHelicopters\nGuns\nLootboxes\nA cinematic story\nHuge explosions (not even small ones actually)\nOnline multiplayer\nMicrotransactions\nOrcsWanna know the specifics?\nThe gameplay of ISLANDERS is pretty intuitive. You start with a set of buildings in your inventory that you can place on your island. Placing buildings is rewarded with points. The amount of points you get depends on what surrounds the buildings when you place them. Gather enough points to refill your inventory and unlock new buildings.\nOnce your city is big enough you may choose to travel to the next island (they are generated procedurally, so you can literally keep exploring forever). If you run out of buildings the game ends. This is where you high five yourself for beating the high score, take a proud last glance at the epic city you've built and start just one more round...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Coatsink","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":23390,"name":"Distrust","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/266/26650dfc6f675592f7062ecd8f1dde88.jpg","description":"Inspired by John Carpenter's \"The Thing\".\nA helicopter crash left a group of explorers stranded near an Arctic base. As they try to find a way back, all they are doing is sinking deeper into a nightmare scenario. When they sleep, they attract a terrifying force that sucks the life out of their bodies, but the longer they battle exhaustion and stay awake, the less likely they are to survive...\nAs the survivors try to sleep just enough to stave off fatigue without dying, they slowly go mad and eventually reach the point where they can no longer trust their senses. In time, they can't even tell the difference between reality and a hallucination.\nGuide the survivors through a randomly generated Arctic base, overcome the severe climate and fight the unfathomable!\nGameplay involving an extreme climate\nRandomly generated levels\n15 characters with unique skills and abilities\nTons of quests, game events and plot twists\nAltered perception of reality: you cannot trust what you see","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":17365,"name":"One Piece Pirate Warriors 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4e/c4e663905c6ad9aa0b42fe0d26e7ce5a.jpg","description":"ADVENTURES OF LUFFY AND HIS STRAW HAT CREW ARE COMING TO PC!\nEnjoy the original story of ONE PIECE from Fuschia village, where everything has started, to the kingdom of Dressrosa, a mysterious island dominated by the evil Donquixote.Doflamingo.\nWill your resolution be strong enough to defeat the most dangerous pirates, including Doflamingo and many more?\nGather every member of the Straw Hat Crew, like in the original story, sail to the most emblematic places and enter the most epic battles: Marineford, Fish-Man Island, Punk Hazard and Dressrosa!\nOne Piece Pirate Warriors 3 brings you many exciting improved and new features, including:\nHigher quality graphics and animation: the One Piece universe has never been depicted so faithfully\nNumber of Popular characters weaving the stories greatly increased: Sabo, Doflamingo, Fujitora and many more!\nImproved gameplay and incredible new co-op actions (no Online Co-op)\nMore action than ever in the latest installment of the PIRATE WARRIORS series, created by KOEI TECMO GAMES and BANDAI NAMCO Entertainment.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":10082,"name":"The Wild Eight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa2/aa20b948cacf78b2be2f3b58812317c4.jpg","description":"The Wild Eight is in a constant state of improvement, and it is not yet complete. If you are not ready for rare bugs and wipes, we recommend waiting for the full release. This does not mean that the game is unplayable or lacks features, it’s actually vice-versa! Right now The Wild Eight is fully enjoyable and has all main features such as the multiplayer, storyline and side quests. Buying the game and providing your feedback during Early Access will support us in improving the game. For more details check out our Early Access section above.\n***\nThe plane crash was only the beginning. Eight survivors are stranded in the middle of an unforgiving Alaska. Don’t let it consume you. Survive and live to tell the tale of The Wild Eight.\nIn The Wild Eight always keeping on the move is your only way to survive and find out what happened with this mysterious place. It doesn't pretend to be a realistic survival sim, but very challenging and fun game designed for both, a teamwork multiplayer and an immersive singleplayer experience.\nEXPLOREUncover the mystery behind the plane crash by following the quest lines and find all the anomalies that lie hidden in this snowy region. Follow the side quests to abandoned buildings, strange laboratories, facilities for unique loot and something out of this world!\n\nCOOPERATEJoin with other players online to take on the toughest of all the challenges.\n\nSURVIVEBrave new horizons in this beautiful, yet deadly random generated low-poly world. Warm your body around the campfire at night. Take shelter from blizzards and share the food with other survivors!\n\nCRAFT & IMPROVEGather whatever you can to create the tools that will ensure your survival - weapons, clothing and gathering tools. Upgrade survival skills in your shelter to tailor the gameplay to your needs.\n\nHUNT OR BE HUNTEDFlee from the ferocious beasts or turn the tables and let them taste your fear. However, there are things lurking in the wild that are even more dangerous than wild animals and blizzards.\nAll of this and more awaits you in The Wild Eight that gets updates with new features on a weekly basis. There’s more than the cold earth beneath the snow…","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"HypeTrain Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9733,"name":"Zombie Night Terror","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/515/515916e3835e45b282ab8897b48e049e.jpg","description":"Special EditionThe Digital Special Edition of Zombie Night Terror comes with a Pack of Exclusive Wallpapers, and the thrilling Original Digital Soundtrack.\nAbout the Game\nPrepare yourself for the most thrilling night of your life! Something strange has happened and people everywhere are turning into blood thirsty walking corpses.  But guess who’s the brains behind this hungry undead army? YOU! So spread this pandemic to wipe humanity off this planet. Because the only way to survive the zombie apocalypse, is to BE the apocalypse!\nBut the brainless undead are quite dumb… even dumber than you might expect given their lack of grey matter. Because when left to their own devises, they will just endlessly walk forward and fall into permanently deadly booby traps placed by not-so-helpless humans. So to accomplish your mission of world extermination, you will need to help guide them to their next yummy meal.  Luckily you can utilize numerous special mutations to make your troops evolve and fulfil their appetite for flesh. But beware! Humans will not facilitate your dark will….they will fight to survive.\nSpread terror through 40 levels and enrol more zombies into your undead army. Along the way you’ll have to solve brain tingling puzzles, and fight increasingly powerful foes that are hell-bent on staying alive. The closer you get to total world extinction, the harder survivors will fight to put you in the ground….for good.\nBlood, tears, non-sexual moans, inappropriate laughter, and tons of puzzles that will literally blow your brains out... This is Zombie Night Terror!\nCommand a Zombie Horde: You are the brain, they are the muscles. Your zombie horde will obey your commands without any strike risk or complaints … On the downside; you can’t have any heated conversations about late night movies or cool books anymore tough!\nUnique Mutation System:  Having an army of deadly zombies is awesome. Having an army of mutated zombies is way better! Take advantage of our mutation system to overcome the enemy’s defences, by creating powerful new zombie types. Each has their unique power and abilities that can help you overcome different situations.\nCombo System: Because you thought mutations were your only way to facilitate your meat feast, we spiced it up allowing you to combine those and see what your enemies are made of (literally). Let’s show those pesky humans how to have fun!\nYou are not alone: Having zombies is kind of like having a pet; it’s fun but you need to take care of them… That’s what humans are for, as they are the perfect way to keep your zombies well fed and busy. But beware! Humans are well armed and they do not appreciate the toothy company of the undead.\nContaminate: Don’t have enough company? Do you need a bigger horde? Well, just convert Humans to your cause then! You don’t necessary need to bring flowers and be charming, as a single bite right into the neck (or anywhere that pleases you) should be enough to do the trick!\nDestructible Environments: In times of a zombie apocalypse, humans love to take their time playing hide and seek. However when the hunger for tasty flesh is this painful, you don’t have time for such childishness. So use the power or your horde to destroy their playground and spread terror among them… PEEKABOOM!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":45704,"name":"Deep Sky Derelicts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e13/e130271b48831145b1e073adc8f0d4b4.jpg","description":"In a grim dystopian future, where mankind has scattered across the galaxy and the human society has split into two distinct classes, you are a poor stateless outcast forced to live off scraps from derelict alien stations and ships in the outer space, yet you dream of becoming a privileged citizen and living on the surface of a habitable planet, enjoying non-synthetic air, water and food. A fabled alien derelict ship somewhere within the Deep Sky sector of space is your voucher for a citizenship and a promise of cozy life on a hospitable planet.\nHire and control a squad of up to three mercenary characters and set on to explore derelict ships within your reach from the scavenger's base. Searching the derelicts for loot and clues, you come across many friendly inhabitants and traders, but more often – various enemies. Challenge and defeat them in tactical turn-based fights, where randomly-drawn cards form your changing arsenal of combat actions, gain experience for yourself and your crew, loot dead bodies, resupply and upgrade once back at your base. The scavenger's home ship gives you the opportunity to heal and level-up your mercenaries, recruit new ones, equip them, upgrade their gear or recharge energy for life support during missions.\nKey Features:\nFresh take on turn-based combat with cards\nRefined sci-fi comic book look & feel\nEndless customization options for characters and scavenging teams\nHigh replay value thanks to procedural generation of content\nStory of the human society divided within a dystopian universe\nTwo game modes: story and arena","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Snowhound Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11026,"name":"Call to Arms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eed/eedc207cff3be6460de336752634b746.jpg","description":"FREE VERSIONWe think you should try before you buy! Grab the game for free and play multiplayer matches or skirmishes versus bots. Furthermore, you can unlock all multiplayer units in the free version via the progression system. In case you want to enjoy singleplayer or Workshop content, then you can upgrade your game to full version at any time!For returning customers: Your game did not change into a free game. Please read the fact check, or scroll down to the info sheet!\nFULL VERSIONEnjoyed what you saw in the free version? Now everything gets better! Experience the cooperative campaign with your friends, play user generated content and mod your game from ground up. Endless possibilities await you to increase your singleplayer and multiplayer experience. Only got so much time? Don't worry, your base factions are unlocked right away and extra items will make it even more fun to customize your army!\nDELUXE EDITIONThe Deluxe Edition of Call to Arms is designed for the biggest supporters of the game, it includes the following bonus content:\nThe Allied Army DLC, including two minor factions and a GRM singleplayer campaign\nA clan tag item\nExclusive squad logo items\nEmoticon items for the in-game chat\nA slight XP boost to speed up your progress in the leaderboards\nAn outstanding HUD element visible while playing and recording matches\nULTIMATE EDITIONIncludes the Deluxe Edition and Season Pass! Please read before you buy: There will be no DLC released during Early Access, if you buy the Season Pass now, you can support the development of new factions and speed up the progress. We will also allow you to beta test new factions before anyone else!\nThe Season Pass includes:\nThe Allied Army DLC, including two minor factions and a GRM singleplayer campaign\nThe German Army DLC, including the German faction and a new singleplayer campaign\nThe Russian Army DLC, including the Russian faction and a new singleplayer campaign\nDo I get new factions without owning the Season Pass? Yes. You will have to wait until each DLC is completed and on sale, then you will be able to unlock new units in multiplayer. Singleplayer content is exclusive to DLC owners and if you own the Season Pass, you can use all multiplayer units out of the box, as soon as they are available. The content will be released throughout 2017.\nFeature List\nAbout the GameCall to Arms offers an innovative new look into modern era combat. Initially offering two playable factions with realistically modeled vehicles and heavy weaponry, as well as dozens of firearms and customizations. Command your troops to victory or fight by yourself in the 3rd or 1st person action mode.\nConquer rural areas, factories, railway stations and towns during intense missions and use the environment to your advantage. Cover is everywhere, and almost everything can be destroyed. An unseen amount of challenges are awaiting you in exciting, yet competitive online combat supported by Steamworks!Real-Time Strategy\nControl several dozen units and place your squads in cover, flank your enemies and support your allies while advancing to the next key objective. Plant claymores, fortifiy FOBs, or set up mortar positions. There is an endless amount of options to choose in the RTS mode of Call to Arms.1st/3rd Person Controls\nNot only can you defeat your enemies as a commander, but also by taking over any of your individual soldiers. You can control them in 3rd person view, as well as first person. The game has no limits!Tanks\nTake over one of your vehicles at any time and join the heat of combat during intense tank warfare! Call to Arms offers you the ability to control every single unit to the last bit, including the type of ammunition you can use to take out enemy targets.Helicopters\nIf you need that little bit of extra fire power, then hop into a helicopter and support your allies in online matches with some serious air support that leaves no room for escape!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digitalmindsoft","platforms":[{"id":0,"name":"PC"}]},{"id":4302,"name":"Sound Shapes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45b/45bafb110e65591ae5472179454095f5.jpg","description":"###Sing a song\nExclusive for PlayStation, released on PS3, and PS Vita in 2012, and later - in 2013 and on PS 4. Sound Shapes - is a game about music, in which you can and should not only listen but also create it yourself. Game events are tied to music. The player takes control of a dynamic ball, and find the music during the gameplay. It is a combination of side-scroller and music. Locations, through which the protagonist passes - are pierced with characteristic rhythms that create the appropriate atmosphere. The player after half an hour of the game can catch himself on what he unconsciously sings the motives from the game to himself.\n\n###Key features\nBack Hensen, who participated in the development, gave the game three of his compositions - “Cities,” “Touch the People,” and “Spiral Staircase.” Each of them in its own way is played out within the game process. The original execution of the game, intuitive control, as well as uncomplicated but perfectly matched mechanics, making the game a real find for both a music lover and an ordinary player. The feeling of unusual events on the screen does not leave even after the game. There is no multiplayer in the game, but it is unlikely that it can be considered a minus for Sound Shapes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":452657,"name":"Bugsnax","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/313/3137f0b7fb36b53e34abcde6e7607909.jpg","description":"We are what we eat. Bugsnax takes you on a whimsical adventure to Snaktooth Island, home of the legendary half-bug half-snack creatures, Bugsnax.\n\nBugsnax takes you on a whimsical adventure to Snaktooth Island, home of the legendary half-bug half-snack creatures, Bugsnax. Invited by intrepid explorer Elizabert Megafig, you arrive to discover your host nowhere to be found, her camp in shambles, and her followers scattered across the island alone... and hungry!\nIt's up to you to solve the mysteries of Snaktooth Island: What happened to Lizbert? What are Bugsnax and where do they come from? But most of all, why do they taste SO GOOD?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Young Horses","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":366882,"name":"Humankind","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5d2/5d2c081494438ffa0642ca2a9b4baa00.jpg","description":"HUMANKIND™ is Amplitude Studios' magnum opus, a Historical Strategy game where YOU will re-write the entire narrative of humankind – a convergence of culture, history, and values that allows you to create a civilization that is as unique as you are. HOW FAR WILL YOU PUSH HUMANKIND?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Amplitude Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58618,"name":"Age of Empires IV","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23e/23e45acbf29bd241913ddcf5cf4053d5.jpg","description":"One of the most beloved real-time strategy games returns to glory with Age of Empires IV, putting you at the center of epic historical battles that shaped the world. Featuring both familiar and innovative new ways to expand your empire in vast landscapes with stunning 4K visual fidelity, Age of Empires IV brings an evolved real-time strategy game to a new generation.\n\nReturn to History – The past is prologue as you are immersed in a rich historical setting of 8 diverse civilizations across the world from the English to the Chinese to the Delhi Sultanate in your quest for victory. Build cities, manage resources, and lead your troops to battle on land and at sea in 4 distinct campaigns with 35 missions that span across 500 years of history from the Dark Ages up to the Renaissance.\n\nChoose Your Path to Greatness with Historical Figures – Live the adventures of Joan of Arc in her quest to defeat the English, or command mighty Mongol troops as Genghis Khan in his conquest across Asia. The choice is yours – and every decision you make will determine the outcome of history.\n\nCustomize Your Game with Mods – Available in Early 2022, play how you want with user generated content tools for custom games.\n\nChallenge the World – Jump online to compete, cooperate or spectate with up to 7 of your friends in PVP and PVE multiplayer modes.\n\nAn Age for All Players – Age of Empires IV is an inviting experience for new players with a tutorial system that teaches the essence of real-time strategy and a Campaign Story Mode designed for first time players to help achieve easy setup and success, yet is challenging enough for veteran players with new game mechanics, evolved strategies, and combat techniques.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16752,"name":"Ace of Spades: Battle Builder","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2cb/2cb25e6c9f11c9b0cc41fba078009070.jpg","description":"Ace of Spades: Battle Builder is a voxel-based first-person shooter with sandbox elements. \n\n###Gameplay \nThe gameplay mixes class-based FPS with the Minecraft-like sandbox. All of the game's maps are made of blocks that players can manipulate. There are five classes available for a player: Commando, Marksman, Engineer, Miner, Gangster. Each of them can build structures with blocks as well as dig through them. However, every class has its distinct set of weapons and abilities. The engineer uses jetpacks to fly over the map and quickly reach enemies’ bases, Miner digs faster than any other class, Marksman uses long-ranged rifles, Gangster can throw Molotov cocktails that set area on fire and commando uses assault rifles and rocket launchers. \n\n###Game modes \nThere are several game modes in Ace of Spades Some of them are typical for multiplayer shooters: Team Deathmatch, Capture The Flag, Territory Control, King of the Hill. Several game modes take advantage of the game’s unique features.\nIn Demolition, your team has to destroy the enemy base and protect yours. In Diamond Mine, you have to bring a diamond to the particular drop-off point. The diamonds are hidden in blocks so to find it players have to dig through terrain and destroy blocks. In Zombie mode one of the players becomes a zombie and must kill other players. Zombie is faster and stronger than any other class in the game, so all the other player has to team up to defeat it.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Jagex","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14948,"name":"METAL SLUG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c3/3c39531ddeb8cf8c12ab3f0b6ec968d3.jpeg","description":"Metal Slug, is a run and gun video game developed and originally released by Nazca Corporation and later published by SNK. It was originally released in 1996 for the Neo Geo MVS arcade platform. The game is widely known for its sense of humor, fluid hand-drawn animation, and fast-paced two-player action. It is the first title in the Metal Slug series. It has been ported to the Neo Geo AES, Neo Geo CD, Sega Saturn, PlayStation, Virtual Console, PlayStation Network, iOS, Android and Neo Geo X, and to the Wii, PlayStation Portable, PlayStation 2, PlayStation 4 (as part of the Metal Slug Anthology) and Nintendo Switch.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"DotEmu","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii"}]},{"id":14671,"name":"Turbo Pug DX","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e84/e8442b92414884afac2c25622e7bd64f.jpg","description":"Turbo Pug DX is an indie platforming game developed by Back To Basics Gaming. It is a spiritual successor to the original Turbo Pug with extra content.\n\n###Gameplay\nThere is no plot present in the game. Turbo Pug DX resembles the classic platformers such as Super Mario Bros. and Sonic The Hedgehog. The players have to reach the end of the level as quickly as possible.\n\nOn their way, players will encounter various environmental hazards, such as spikes, water bodies, pits, and fires as well as a certain amount of enemies. If the players touch a hazard or an enemy touches them, it will result in an instant death.\n\nWhile playing a level, the players can collect letters scattered on it, as well as coins. These collectibles will increase the player's score and put them higher up the global in-game leaderboards.\n\nPlayers can unlock several pug skins as well as completely new characters, which are different in their movement and gameplay. Moreover, level skins are available for purchase. The game also comes bundled with a skin editor, where the players can create their own skins, send to the developers for approval, and, if accepted, get their skin into the game.\n\nThe levels of Turbo Pug DX are procedurally generated meaning that no playthrough will be the same. The game also boasts a random weather system, which affects the level's environment.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Back To Basics Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":23114,"name":"War Wind","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/338/338a51ae1446dd070a8ae9a3ccf74c51.jpg","description":"The Ancient, alien world of Yavain teeters on the brink of anarchy as the winds of change threaten to blow civilisation asunder!\nFor centuries, four diverse races have tolerated a precarious balance of power. But the time has come for change. A new order is in the wind - AND IT WILL BE BORN OF BLOOD AND FIRE!\nWar Wind  allows you to view this epic struggle through the eyes of four unique races, each with its own strengths, weaknesses and distinctive A.I.\nA real-time strategy masterwork,  War Wind features 28 read-to-play scenarios. A powerful Scenario Editor that allows you to place units and build new battles. And a story of such compelling depth you won't believe it's just a gameCarry your 8 favourite units from scenario to scenario\nAdvanced combat options, including stealth movement, bio mechanically enhanced units and monstrosities\nUnits can advance in rank through training, gaining power along the way\nAchieve vicory through diverse means, such as combat, spell-casting and alliances\nforces can gain prestige, attracting wandering heroes to aid in campaigns","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"DreamForge Intertainment","platforms":[{"id":0,"name":"PC"}]},{"id":4587,"name":"SEGA Bass Fishing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d62/d622d45529472fe92bcabd1ecad06fda.jpg","description":"Explore the exciting sport of Bass fishing! Based on the Dreamcast hit, motor out to eight different fishing locations to catch the biggest and baddest Bass possible! Choose between fourteen different lures, and compete in four tournaments. Start off as an amateur, and work your way up to the pros in the Masters Classic tournament. Get hooked!\nFeatures\nHone your fishing skills:\nVariable weather and water conditions will affect the fishes’ behaviour, so you’ll need to master a wide variety of special lures and angling techniques to catch the one that got away. Are you fishing in the morning? Try a surface lure. Is it hot out? Better drop to cooler water.\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"}]},{"id":23599,"name":"World of Warcraft","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d9/0d930ea604ee240c5af30c58f73ddf48.jpg","description":"You were meant for more. You were meant for epic adventure. Maybe even greatness. To charge your enemies without fear. To live boldly and run with comrades you never knew you had. To experience the impossible. Descend into World of Warcraft and join millions of mighty heroes in an online world of myth, magic and limitless adventure. An infinity of experiences await.\n\n### Create Your Hero\n\nBuild your own unique hero from one of thirteen player races and ten different classes. Then rise to epic heights of power as you challenge the deadliest evils and claim the greatest rewards in the land.\n\n### Form Powerful Alliances\n\nPlay solo or enlist your friends to join forces with you as you negotiate the vast, battle-scarred landscape of a world at war.\n\n### Embark on Epic Quests\n\nEngage in thousands of custom quests – with more being added all the time. Confront Illidan the Betrayer, shatter the Lich King’s undead armies and much, much more.\n\n### Explore the Ever-Changing World of Azeroth\n\nWorld of Warcraft is constantly updated with new adventures to undertake, lands to explore, and monsters to vanquish. For a change of pace, join the party at a seasonal event like Brewfest or Hallow’s End!\n\n### Engage in Player-vs-Player Combat\n\nTake part in the war between the Alliance and the Horde, the two factions who battle for control of Azeroth. From Arenas and Battlegrounds to large-scale PvP zones and open world combat, there’s always glory to be won.\n\n### Battle to Level 100\n\nAscend to new heights of power as you explore the verdant reaches of the Jade Forest, dodge the boiling vents of Gorgrond, and journey to Tanaan Jungle to battle Supreme Lord Kazzak.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15075,"name":"RADical ROACH Deluxe Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93c/93ca2e6654260a43fa89b4e02d6ee5dc.jpg","description":"RADical ROACH Deluxe Edition is an indie horizontal side-scroller developed by Decaying Logic. The game was later remastered and re-released by the developers.\n\n###Plot\nWho will most probably survive the nuclear war between multiple countries, which lasts several hours? Roaches, of course! And they will fight for their survival with other insects too. Thankfully, radiation gives everything superpowers! Well, in most cases. You are a tiny irradiated roach that can now fly. But can you fly fast enough to escape the fleas?\n\n###Gameplay\nRADical ROACH Deluxe Edition is a typical rendition of side-scrolling games, where the player-controlled character is placed in the left part of the screen and obstacles and enemies come from the right side with the players being able to move up and down. \n\nPlayers control a small roach that did not only survive the nuclear war but also got superpowers, thanks to the radiation. Fly away from the enemy fleas, which are now deadly. As the players fly away from their enemies, they also have to avoid fast approaching obstacles, touching which will result in a one-hit kill, as well as other fleas, that overtook you.\n\nThe game features an upgrade system, which allows the players to upgrade the tiny roach by improving its speed, getting several lives. It is also possible to change the skin of the roach that better suits the player's taste.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":47430,"name":"Arcade Moonlander","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e6/4e602d0ebb42f402c742f4bd6bfdccf9.jpg","description":"Arcade Moonlander is a challenge of precision and timing. Maneuver the craft to the landing pad before the fuel runs out. Be sure to land gently and vertically. And look out for satellites and space-worms! They will get you.\nThere is no time limit or lives, and the game saves progress automatically upon level completion.\nFollow the radar toward your goal and access the tutorial at any time during play.\nArcade Moonlander was designed for speed runs from the start and features a robust timing and score system. While secrets and hidden fuel tanks provide casual replay-ability. There are best times saves out for each level, as well as an over all best time for completing the 10 levels.Features:\n10 exciting, fast paced 'Arcade' levels.\nExpansive 'Adventure' level that focus on exploration and more dynamic fun.\nRobust collision and timing to ensure reliable speed runs.\nRetro Sci-Fi art style and soundtrack.\nHighly refined controller support (recommended for best experience).\nKeyboard and mouse support.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daniel Griffin","platforms":[{"id":0,"name":"PC"}]},{"id":20770,"name":"Anomaly Warzone Earth Mobile Campaign","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db4/db41d42fc1d0540daf1ea327e6e5100f.jpg","description":"Anomaly Warzone Earth Mobile Campaign continues Steam's Anomaly Warzone Earth in extra 15-level campaign. Originally released on mobile devices, the campaign is brought to Steam for PC, Mac and Linux exclusively in Anomaly Bundle.\nAWE Mobile Campaign turns tower defense on its head. This time you take control of the attacking force, pitting your heavily armored squad against the destructive towers of an alien horde. Carefully lead your squad through the invaders' defenses, shattering their towers and turrets with special weapons and power-ups in this experience of tower offense.\nAnomaly Warzone Earth Mobile Campaign Features\n• Ultimately twist tower defense formula - it's tower offense! You’re the attacking side.\n• Deploy special weapons to break through alien defenses or use stealth to slip through unscathed.\n• Think tactically and choose the right squad and route to guarantee success.\n• Strategically gather resources to buy and upgrade new and more powerful units.\n• Play for hours on end in three unique and engaging Squad Assault modes","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":411,"name":"How to Survive 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/203/203c7ef2bd4780cb6fabee0cf940216f.jpg","description":"Special OfferSurvivalist, I’ve got a little something for you…\nJust a little surprise…I love surprises…\nReminds me when I was kid in…oh, I’m getting emotional again…\nSurvivor Loyalty Item: “Primal Fear” Armor Set.If you are already a survivor who has How to Survive or How to Survive: Third Person Standalone on Steam, we welcome you back with a very special treat: the “Primal Fear” armor set! A set of protective gear finely crafted out of the best bones and scrap metal that can be found in the dumpster. Made by master Survivalist Kovac himself, it promises to keep bites and scratches to a minimum while displaying a distinctive Swamp-chic style!\nJoin us slip it on and knock’em dead!\nAbout the GameSeveral years have passed since the original How to Survive events on Los Riscos’ archipelago.  Now the local infection has turned into a worldwide pandemic.  Everyone around the world, groups of people or lone wolves, try to survive one more day among the infected, attempting to recover a semblance of normal life.  You find yourself in Louisiana and your survival chance starts by building a safe camp and becoming a skilled survivalist.\nFind water, food and shelter and talk to the unconventional locals to make your way around.\nAn eccentric masked stranger offers you help? Sure, sounds way better than zombies!\n• Multiplayer is here! You can invite up to 16 players to access your camp and 4 of you can play simultaneously online\n- Local coop : up to 4 player simultaneously on the same PC\n- Players in local Coop can join an online game (i.e. 16 players can play simultaneously)\n• Teamwork: all players can contribute to a bigger, better camp and can perform co-op actions and strategies.\n• New improved camera follows your character, allowing you to zoom in and out on the fly!\n• New randomized environments: from the unforgiving Mississippi Delta bayous to the abandoned streets of New Orleans’ French Quarter.\n• Create your own character: learn new and different skills to specialize as you level up and equip with scavenged and handcrafted armor, tools and weapons.\n• A new deeper crafting system will allow you to use items and materials to create hundreds of items, tools and weapons to upgrade your character and your base camp.\n• You are an expert in survival ? You want real challenges ? Elite quests are made for you !\nIn this special quest type, you have only one try to reach your objective. If you die, you will directly be sent back to camp and you’ll have to deal with the judgemental look of your friends...\n• Set-up, upgrade and protect your camp as you want: choose from a wide upgradeable variety of traps, barricades, obstacle and workshops that will provide you new recipes and allow you to create more materials and items.\n• Protect your camp and survive, alone or with your friends, to the Kovac’s Challenges ! Place your traps in a strategic way and prepare to fight hordes of powerful zombies.\n• Night & day cycle and weather conditions.\n• Be careful when you got out by night, some nocturnal zombies are hiding in the darkness, ready to attack you.\n• Meet new survivors by creating a public camp and use your special private chest to keep safe your precious objects.\n• You can now kill zombies in a cooler way thanks to the finish moves and gory effects !\n• Watch your hunger and your thirst if you want to be capable of fighting zombies.\n• Watch the weight of your inventory. You don’t want to be slowed down while a horde is chasing you.\n• Kovac’s more diligent students will be happy to find his precious advice in a new video format ! Paper is for losers...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":793647,"name":"Star Wars Jedi: Survivor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e4/3e43e29ae126ef951842393f5ff7f33a.jpg","description":"Star Wars Jedi: Survivor picks up five years after the events of Star Wars Jedi: Fallen Order. Cal must stay one step ahead of the Empire’s constant pursuit as he continues to feel the weight of being one of the last remaining Jedi in the galaxy.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Respawn Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":502117,"name":"Need for Speed: Hot Pursuit Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b6b/b6b3811ed0d2488c20d027e9f53d5b8f.jpg","description":"Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponry at your disposal in a heart-pumping, socially competitive racing experience. Updated with enhanced visuals, cross-platform multiplayer – including the asynchronous competition powered by Autolog – plus all additional DLC content, this is the ultimate edition of Criterion Games’ critically acclaimed Need for Speed debut. It’s time to reignite the pursuit.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Criterion Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":2774,"name":"Knock-Knock","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f9/3f99d409124962fa6e125409254528c3.jpg","description":"Knock-Knock is a survival horror game developed by Russian studio Ice-Pick Lodge on Unity.\n\nThe main difference from most horror games is that the fear factor itself is achieved by using the environment. Sounds, creepy texts, suspense - all of that affects the players.\n\n###Plot\nThe game's plot is full of unclear moments and allows for multiple interpretations. There is a house in a middle of the forest. It has been used as a lab and a home for three generations of its residents. The Last Resident, just like his ancestors, studies the world around him. One day, the Resident notices that his environment weirdly changes - sounds appear here and there, items get missing. The Resident wants to figure out what's going on.\n\n###Gameplay\nThe main objective of the game is to help the Resident survive in his house until dawn. This can be achieved by walking around the house and turning the light on in its rooms. Only if the player turns on the light in the room, it becomes possible to interact with the items placed inside that room. Such items are the clock, that can be used to speed up time, or hiding spots. \n\nLighting is an indicator for the appearance of your enemies as it turns off when someone is close to the player. The gameplay is affected by the Resident's bad memory and eyesight. \n\nThe time in the game is relative. It can pause, pass as usual, or go back. This depends on the player's actions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ice-Pick Lodge","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1366,"name":"140","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/560/560f7bd45d2f8ce3deb42c97fd1d1f49.jpg","description":"140 is a platformer developed by Jeppe Carlsen. \n\n###Gameplay \n140 uses music synchronization as an important part of the gameplay. The player leads a geometric object – a circle when moving, a square when standing still.\nThere are four levels; each one has its soundtrack. As the game gets harder, the music intensifies. The player has to avoid enemies presented as other geometric shapes. There are also static noise platforms that should be avoided as well. The game is known for its synesthesia effect – a cognitive phenomenon associated with graphene, color, number or music-related experience. Someone with synesthesia can simultaneously observe things – for example, colors – like everybody else but at the same time distinguish their colors. Everything in the game moves according to the music beat, so to jump over an obstacle or to climb on a lift, the player should synchronize his moves to the rhythm. \n\n###Development \n140 was developed independently. It grew out of other Carlsen's works and proceeded similar features, for example, its minimalistic old school design and simple mechanics. The game was released on several platforms, such as Microsoft, PlayStation, and Linux. \n\n###Reception \nThe game aroused interest due to its minimalism and synesthesia traits. It was widely tested by critics and journalists and was praised for its design and audio background.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":791636,"name":"Call of Duty: Modern Warfare II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1af/1af8edc7491c6d9d0776fc423d93548d.jpg","description":"Welcome to the new era of Call of Duty®.\r\n\r\nCall of Duty®: Modern Warfare® II drops players into an unprecedented global conflict that features the return of the iconic Operators of Task Force 141. From small-scale, high-stakes infiltration tactical ops to highly classified missions, players will deploy alongside friends in a truly immersive experience.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":327258,"name":"Dragon Ball Z: Kakarot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf0/cf062fb221995e3e04294ba5f9dabbb9.jpg","description":"Relive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":20407,"name":"Caster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c1/1c1b874e7dc228d22c11a65870513236.jpg","description":"Caster is an indie third-person action-adventure game developed by Elecom.\n\n###Plot\nMysterious beings who are known as the Flanx start appearing around the world. They are highly hostile towards humans and annihilate every city they come across. A special organization is established to combat the bug-like monsters and fight back. You are one of its soldiers sent to prevent the extinction of humanity.\n\n###Gameplay\nCaster focuses on fast-paced massive combat. The players can interact with terrain and plants as the main character is a descendant of a legendary clan the members of which had such abilities. The main objective of each level is to clear it off the bugs.\n\nAt the beginning of the game, the main character is weak and can easily be killed. His attacks do not do much damage. The players are awarded upgrade points after completing a mission. It is possible to purchase both offensive and defensive abilities using these points.\n\nAs for their defense, the players can use a set of movements, and their shield. The game follows the “movement equals life” principle, as if the players stop moving around the level, they will be quickly overwhelmed by the enemy forces.\n\nA wide range of attacks is available to the players. Most of these attacks are the result of the main character's ability to manipulate energy. Blasts and pulses of energy are available to the players. The most powerful attack is the Eruptor. It launches a ball of energy, dealing heavy damage and raising the terrain.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Elecorn","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9913,"name":"Splasher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/942/942c57fe3a5a0edc24ac61869214a2e7.jpg","description":"Splasher is a 2D platformer with unique arcade/action gameplay. It offers gamers challenges that require agility, speed and fast reflexes, and is set in a crazy cartoon universe.\nThe Splashers are in great danger! The quiet and peaceful workers from Inkorp are being led to their doom by the greedy Docteur, the paint factory's evil boss.\nA young hero rises to fight for what's right. Armed with a splatter cannon, he launches an attack in order to save the Splashers and stand up to the dictator. His amazing paint cannon grants him color superpowers\nFISTFUL OF INK\nUse different paint colors to stick to walls and roofs, bounce high in the air, and trick your opponents.\nMASTER CHALLENGING LEVELS\nBrave the traps and beat the gigantic factory's security devices. Learn from your mistakes to find the best path and get the best time in order to perfect the level.\nTIME ATTACK & SPEEDRUN\nChallenge gamers from around the globe with your best times, and share your scores on the leaderboards.\nSplasher is the latest project from Romain Claude, former Game Designer and Level Designer at Ubisoft (Rayman Origins, Rayman Legends). He gathered a small, talented team, including Richard Vatinel a.k.a Gromy, Art Director, and Aymeric Schwartz, composer and sound designer (Absolver, Rayman Origins or Valiant Hearts), to create Splasher. The game was also developed in partnership with famous speedrunners.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":44707,"name":"DESOLATE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/543/543c2559fa4273c72fe531a8796b49e2.jpg","description":"A man-made island is slowly turning into a shadow of its former self, as danger lurks around every corner. Firearms are rare - so survivors have to prove their worth with their fists. But simply surviving is not enough this time around - the island tracks and remembers your every movement and action. Think on your feet and act unpredictably to stay alive!\nPlay the role of a volunteer, sent on a special research mission to a remote island. A place filled with threats of every shape and size - from monsters and madmen to supernatural anomalies and seemingly impossible weather patterns. Journey through the present of this forsaken world to uncover its forgotten past.Features:\nUnite with up to 4 players, or act as a lone wolf to prove your mettle - the choice is yours.\nExplore the enigmatic island to investigate its secrets - find notes and diaries from the island’s previous settlers to uncover its dark past.\nFight for your life against monsters, other humans, supernatural threats, and even nature itself.\nA living biome - the island and its inhabitants track your movements and actions and learn from them, adapting to your playstyle.\nUnlock new abilities and train them to increase your chances of survival\nMilitary bases, abandoned settlements, top secret facilities and other unique locations await a curious explorer - whether you set out to complete a mission or to simply explore  the island, you’ll find something new everywhere you look.\nGather recipes and components to craft, modify and upgrade your weapons and equipment.\nCreate your own Volunteer and customize him or her with new clothing and armor you scavenge among the wastes.\nSurvive, explore and investigate in the dark world of DESOLATE, alone or with friends in a party of four.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"HypeTrain Digital","platforms":[{"id":0,"name":"PC"}]},{"id":10981,"name":"Battle Chef Brigade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/acc/acc8043de84c89b3eb21f7659b05cf3d.jpg","description":"Battle Chef Brigade features fantasy chefs, including Orcs, Elves, and Humans, who need to hunt dangerous monsters for ingredients. With those ingredients, before the critical eye of the judges, the chefs create culinary masterpieces in an intense tournament. Battle Chef Brigade pairs one part combo-based action hunting and one part puzzle-based cooking, all as the round clock ticks down.\nFeatures\nHand drawn 2D animated characters and monsters.\nFour playable chefs each with their own short campaign which delves into each character's personality and cuisine.\nA chef's pairing of equal parts old-school brawler, match-three puzzler, served with a side of light RPG progression.\nDaily challenge leaderboards where Battle Chefs can boast about their day's best culinary creations.\nDeadly and delicious monsters. Subdue them in the arena!\nPuzzle Rush and Break the Targets modes for leaderboard domination.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Adult Swim","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":4052,"name":"Guacamelee!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/13d/13de6701089d2e84bab0a17d75b86857.jpg","description":"This is a game in the action platformer genre with Metroidvania elements, developed by the Canadian studio DrinkBox Studios. This is the third game in the studio's portfolio.\n\nThe player gains control over the protagonist - an ordinary Mexican farmer named Juan Aguacate, who seeks to save the daughter of El Presidente and the love of his life from the hands of the evil skeleton charro named Carlos Calaca. To do this, he puts on the mask of the wrestler and bares the torso. The main character has several special moves, for coins from the defeated monsters you can buy upgrades for these moves and the skills. New abilities the main character receives after the opening of Chozo Statues. Some of them will give him new movements in combat. Other abilities will allow reaching previously inaccessible places on the level.\n\nA separate element of the gameplay - boss-fights, each with a separate puzzle. And the new techniques and capabilities of the character open during the gameplay. The game became so popular that Juan Aguacate appeared in several projects from third-party developers and the developers of Guacamelee! together with IndieBox released a limited number of physical copies of the game for collectors.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"DrinkBox Studios","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":313783,"name":"Automachef","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5c/d5c112af49a4ab121647c09e4eb98ce1.jpg","description":"Welcome to Automachef, a resource management puzzler where you design kitchens, program machinery and watch your genius come to life! It’s time to engineer tomorrow’s kitchens, today!Plan. Position. Program: Design and build automated restaurants, then program them to run like well-oiled machines! Do you have a can-do attitude and the know-how to conquer the world of automated restaurants?\nChallenging Puzzles: Fine tune your mind as you tackle intricate spatial, resource management and scenario puzzles! Not enough hot dogs? You’ll sort it! Kitchens on fire? No problem for a smart human like you!\nMultiple Brain-Tickling Modes: Take on the campaign levels, traverse your way through the business world in contracts mode, or just go nuts and bolts in the sandbox test mode and play until you get your fill!\nEndless Charm and Quirky Humour: All delivered in an abundance by our helplessly misguided human protagonist- Robert Person. Who is definitely a human. Don’t ask questions.\nMod Support: Think you could bring some more pizazz to the table? GREAT! Step on up to the plate and create your own ingredients, recipes and scenario levels via Steam Workshop!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":22067,"name":"Trailmakers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/885/885a7caffb0899f083f095502c968e7d.jpg","description":"Welcome to the Ultimate Expedition!\nJourney over grueling mountains, hazardous swamps, and bone-dry deserts on a distant world far from civilization - it is just you, your fellow adventurers and the amazing, jet-powered hover-buggy you built yourself. Explore, crash your vehicle, build a better one, and get as far as you can with whatever spare parts you find on your way.Engineering made easyTrailmakers is about building very awesome vehicles and machines, but you don’t need an engineering degree to get started. The intuitive builder will get you going in no time. Everything you build is made from physical building blocks. Each block has unique features like shape, weight and functionality. They can be broken off, refitted and used to build something new. Individually the blocks are fairly simple, but combined the possibilities are endless.Expedition in the makingExpedition Mode is the challenging survival mode of Trailmakers. You have volunteered to join a DIY off-road rally expedition in a distant world. With only a few building blocks, you must build, tinker with and rebuild your machine to progress. Traverse a big world, overcome deep gorges, angry wildlife and all kinds of weather to progress and find new parts that will juice up your machine. The world in Expedition Mode will test your survival skills and ingenuity. With the next checkpoint in sight but no wheels or wings, how do you and your four jet-engines get across the canyon?Pure creative freedomCreative Mode is where you want to head for an unrestricted, sandbox, vehicle-building experience. Here you can build anything you can dream of, and play around with it in the world of Trailmakers. It is a great place to test out crazy machines, and experiment with the physics engine. With tons of different blocks, hinges, thrusters and interactive vehicle parts - the sky is not the limit.Play with friendsTrailmakers is even more fun if you play it with a friend. Put two seats on your vehicle or race each other towards the next checkpoint - it is up to you. Both Creative and Expedition Mode support multiplayer.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Flashbulb","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":12061,"name":"Codename CURE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/357/35728d1e5051a0db48daf187d5817370.jpg","description":"WorkshopCURE now includes Steam Workshop support\nAbout the GameCodename CURE is a first person, co-operative zombie game with support for up to five players, providing dynamic, fast-paced zombie fragging with both objective, and survival-based missions.\nIn objective mode play as a team of special military operatives, tasked with “curing” infected areas of a post-apocalyptic world, by planting controlled explosives before pulling a short sharp exit. Pick your speciality out of five player classes: Pointman, Support, Assault, Technician and Sniper, using each ones unique play style and equipment to support your team, and successfully complete each mission.\nSurvival mode is a wave based no-win scenario, test your skills with the odds increasingly stacked against you. Resupply in-between waves with a dynamic selection of weapons and equipment for your best chance to survive until the next round.\nCURE can be played both on and offline, with or without computer controlled team mates. The game sports a variety of difficulty options which adapt dynamically with the number of players.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hoobalugalar_X","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":761405,"name":"Knightfall: A Daring Journey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ab/6abb5456a795b7713919db7568a2fd96.jpg","description":"In Knightfall: A Daring Journey, up to 20 players pair up in teams of two with the goal to reach the castle and pluck the rose before anyone else.\nThe journey will take many days and the knights must take shelter in different villages on the way so as to not freeze to death during the harsh nights.\nAs the journey continues there are fewer and fewer villages, and each team can expect to have to fight other pairs of players to take shelter.\nBy being the first team to reach each village, they ensure the first pick of the weapons and healing bandages that they’ll need to defend themselves against the approaching pair of knights.\nEach morning it’s time to quickly get back on the horse and race towards the next destination until finally they have their chance to pluck the rose!Features2 Player co-op (invite your friend or get matched with another player)\nUp to 20 players in each round\nKnight on knight action\nHorse drifting\nGuns and grenades!\n2 knights\n1 rose","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Landfall","platforms":[{"id":0,"name":"PC"}]},{"id":42145,"name":"Magicka: Wizard Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bd0/bd0ae747540a2b38740eb5f59c284a81.jpg","description":"Magicka: Wizard Wars was a MOBA game set in the world of the Magicka franchise. While its core gameplay was 4v4 battles, the game had a heavy focus on the sandbox aspect. The game had no single campaign and was free-to-play. Servers were shut down in 2016 due to the lack of audience.\nDuring arena battles, players controlled wizards who used elements to create spells. There were eight elements tied to keyboard buttons; every combination of three elements gave a certain effect on the wizard himself, his teammates or enemies. As the amount of combination was huge, their usage was limited only by players’ imagination. This mechanics was, in fact, a slightly reduced version from Magicka. As every element has an opposite one that counterattacks the spell, battles were based on the reaction rate of players.\nThere were three modes: a classic three-lane map with mobs and bases, a team deathmatch, and a 1v1 duel.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Paradox North","platforms":[{"id":0,"name":"PC"}]},{"id":22936,"name":"The Adventures of Shuggy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2c/c2cbced9e4721fb08b4aaf6c3b1cb9ee.jpg","description":"The Adventures of Shuggy is a 2D platformer game with a heavy emphasis on puzzle solving. \n\n###Plot and setting  \nThe player controls Shuggy, a vampire that inherits a mansion in Scottland from his grandmother. However, Shuggy finds out that the mansion is filled with hostile creatures so now he must vanish them from every room in the mansion. The levels are divided into five areas of the mansion: The Dungeon, The Boiler Room, The Gallery, The Graveyard and The Clocktower.\n \n###Gameplay  \nThe game consists of more than 100 levels. The goal of each level is to collect every gem in the room to get a key that unlocks the next one.\nPlayer's movements consist of walking and jumping. However, most levels incorporate unique mechanics that alter the playstyle and give Shuggy special abilities. Some rooms change the gravity; some give the player the ability to fly, swing on ropes. Some rooms incorporate blocks-based puzzles, teleportation spots, allow Shuggy to change his size and many more. Most levels are comparatively small and consist of one screen. \nThe game also offers a multiplayer mode. It can both be played online or locally. There are 36 level available for multiplayer and two modes: cooperative, where players have to work together to complete the level, and competitive, where players complete levels to earn squares on tic-tac-toe playfield.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Smudged Cat Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19570,"name":"Hostile Waters: Antaeus Rising","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f4/9f4cc216211ab6be61d8647383354e45.jpg","description":"Hostile Waters: Antaeus Rising is a real-time strategy game developed by Rage Games Limited. It is often classified as a hybrid of both a simulation game and a real-time strategy one.\n\n###Plot\nIn 2012 the last war on Earth took place. After the people defeated the corrupt government leaders, the world was rebuilt into a utopia in just twenty years. People started using the nanotechnological assemblers, which can create anything out of energy and useless objects. Even military equipment can be created.\n\nMany cities suffer from missile attacks from an island in the southern Pacific Ocean. A spec-ops team is sent out to investigate. You are a part of it.\n\n###Gameplay\nEach mission of the game takes place near the enemy island, which is protected by all kinds of anti-air defenses. All the player's vehicles are created using the assemblers aboard a military ship and are transferred to them using a boat. The vehicles are built up with the trash the player collects on the island.\n\nThe players have three ways of controlling their units. The first way is based upon the fact that the game allows for full control of a unit with a first-person camera and simulation-style controls. The downside of this is the need to control multiple units at one time.\n\nThe second way resembles the typical real-time strategy games. The players control their units by issuing orders on a schematic map. The third way is practically the same, yet it allows for much more complex orders.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Rage Software","platforms":[{"id":0,"name":"PC"}]},{"id":18728,"name":"Gothic 3: Forsaken Gods Enhanced Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2f7/2f79dd7183c535d5d37bbe9b7a69cb02.jpg","description":"After having banned the influence of the gods in Myrtana, the nameless hero and Xardas have left this world in order to prevail the balance of power. In their exile located somewhere between space and time, they watch the actions of the mortal beings. As they discover a growing of the differences between orcs and humans again, they start to accuse each other and finally even a fight between the companions breaks loose. The nameless hero leaves the secret realm and wakes up in Myrtana, where he tries to unite Myrtana once for good - in a new empire for both orcs and human.\nGothic 3 - Forsaken Gods Enhanced Edition includes new quests, new monsters and many of the old friends who gamers around the world got to know before. This standalone add-on will answer all the questions which have risen in the past and will slowly introduce the fans to a new chapter...\nKey Features:\t\t\t\t\t\tHuge lively environment which reacts to the player’s actions, creating a very intense and realistic atmosphere\nImproved graphics quality thanks to updated engine technology\nMany intense hours of gameplay\nImproved combat system with new moves\nPlenty of new weapons, armors, monsters and quests\nEnhanced Edition Features:\t\t\t\t\t\tCompletely revised gameplay & combat system\nMajor graphic & sound improvements for even greater atmosphere\nNumerous upgrades, additions and little extras","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Mad Vulture Games","platforms":[{"id":0,"name":"PC"}]}]