[{"id":593319,"name":"Gas Station Simulator: Prologue - Early Days","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a39/a395e230f212465ab7710689e44626e3.jpg","description":"THIS IS NO ACCIDENT. REALLY CHECK OUT WHAT OUR FRIENDS MADE HERE:https://store.steampowered.com/app/852220/Accident/\nTHE DESERT TOO HOT? HOW ABOUT SOME SNOW?https://store.steampowered.com/app/1394960/Winter_Survival_Simulator/\nAbout the GameGas Station Simulator is all about renovating, expanding and running a gas station along a highway in the middle of nowhere USA. This prologue to the game serves as an introduction to the beginnings of it all, where you find an abandoned gas station, buy it and start renovating it in order to be able to service your first customers. That's why we call the prologue \"Early Days\".\nCheck out Gas Station Simulator for more information, DevLogs and discussions:\nhttps://store.steampowered.com/app/1149620/Gas_Station_Simulator/\nOn the full game’s page you can also download the regular demo of Gas Station Simulator that allows you jump in right into running a gas stations that has already been mostly restored and offers additional services allowing you to get a good idea how the game will play about the mid-game.\nYou acquire the gas station is a pretty rundown state. It has been exposed to the elements for years and you will need to put some serious work into it in order to restore it to a useful state.\nYou will have to clear the area of sand and rubble, fix the place up and take care of the inside as well.\nThere are plenty of tools at your disposal to renovate the place and bring it to a state that won’t repeal customers by how it looks. The renovation itself is just part of the job, you will also have to keep in clean and tidy.\nOnce you fixed the place up a little bit, you can think about customizing it and adding some personal touches. The prologue offers some of the customization features of the full game to give you a solid idea what types of customizations you can look forward to. Both the outside and inside of the gas station are covered giving you a solid idea of what to look forward to.\nYou have spend all the money you had to buy the gas station and had to borrow some cash on top of that. Restoring the gas station to its former glory will cost you a bit, too. Hence any money that comes in becomes crucial. Thankfully you don’t need to wait for the gas station to be fully restored to start earning some money. Some fuel, fixing up the gas pump and you can start serving the occasional customer already. While you can’t offer your customers much else at this point, it’s a start toward a full fledged gas station offering lots of different services.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Drago Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":537742,"name":"The Last Stand: Aftermath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4f1/4f1b60a8c9bcee65a81bc3a9176d81af.jpg","description":"From the creators of The Last Stand: Union City and Dead Zone comes an all-new single player rogue-lite action adventure. After you become infected by the zombie virus, you set out to explore the post-apocalypse and find hope for your fellow survivors. You can still make a difference. Don't give up. \n\nThe latest from veteran developer Con Artist Games, creators of The Last Stand series of games, The Last Stand: Aftermath is an all new, premium single player standalone action adventure rogue-lite. Choose a survivor to set forth and explore the ruins of civilization, finding fuel to travel to new locations and gathering supplies to craft weapons and more.\n\nYou'll need to stay on your toes, since hordes of zombies still roam the streets, and you're no superhuman. In fact, you're one of the infected yourself, and eventually you'll die, be it from the hostile undead or the virus rampaging through your body. But when that happens, you'll pick up the game again as a new survivor, with perks and upgrades earned based on your progress from the last, and set out to try again.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Con Artist Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":262498,"name":"Rain of Reflections: Chapter 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2c5/2c5608ee58022c4a1beb5899f163e04f.jpg","description":"Rain of Reflections is an atmospheric, dystopian adventure game. Its turn-based strategic confrontations are uniquely centered around a motivation mechanic. Every move and choice made by the player is permanent and will have consequences on the world and its characters.\nThe introductory chapter – “Set Free” – centers around Wilona, a scientist working towards a solution to our future world's sudden infertility. As she starts doubting the morality of the experiments, she decides to free the live subject – the lastborn child – from captivity. This will prove difficult, as powerful forces try to stop her.\nActively choose every single line spoken by the protagonist, to convince, defuse or outsmart a variety of strong-willed, multifaceted characters in fully voice acted dialogues.\nExplore richly varied environments ranging from the sophisticated upper class Stem, to the flooded slums of the Trench, the twisted Temple, the heavily guarded Waste Plant and the coldly clinical Labs.\nEngage in a turn-based strategy system with a range of tactical options where you seamlessly can choose to move stealthily, speak or open fire with precise, calculated shots causing environmental destruction and affecting the enemy's motivation.\nBreach computer systems, crack locks and eavesdrop on radio frequencies through a variety of hacking puzzles.\nChoose how you play – point and click your character to where you want them to go using a mouse, or gain direct control of their movement with a gamepad.\nContemplate every choice in a system that halts to await your every input, but make sure you tread lightly – once a choice is made, its consequences will be definitive and may affect characters living or dying and even the very outcome of the story...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Lionbite Games","platforms":[{"id":0,"name":"PC"}]},{"id":51978,"name":"Those Who Remain","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a5/4a5f03f5da8ec2906f3022e16d7ced99.jpg","description":"Those Who Remain is a psychological thriller that takes place in Dormont, a small town in the US.\nDormont appears to be a regular and typical American town at first glance. However, it is cursed by a demon who shrouded everything in darkness.\nMost of the town's population has been trapped inside the darkness, with no means of escape.\nEdward Turner is just an ordinary man with troubled past, who arrives in the wrong place at the wrong time. He soon finds out that something is very wrong in Dormont.\nThere are strange creatures roaming in the dark, killing everyone that gets close. The only way to survive is by staying in the light.\nThe danger in the dark is not the only thing at play in Dormont.\nThere are strange portals that emanate a bright light, that seem to bring anyone that goes through them to another place, similar yet different, apparently unreal but very real.\nActions taken in one place have repercussions in the other.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Camel 101","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":51601,"name":"The Lion’s Song","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27e/27e0254bdbdbd9fa45ee3243f96e22aa.jpeg","description":"Includes all 4 episodes of The Lion’s Song\nThe Lion’s Song is a narrative adventure game series about creativity and its demons, with each of the first three episodes taking a closer look at a fictional Austrian artist or scientist. Steeped in culturally vibrant 20th century history, the game lets players travel back in time and gives them an intimate insight into the creative struggle of the young composer Wilma, the haunted painter Franz, and the genius mathematician Emma. The season’s finale, Episode 4 - Closure, will take players on a mysterious train journey that connects the storylines of all previous episodes. What stories will these four strangers share along the way, and where will their journey end?\nThe choices players make in The Lion’s Song will have a direct impact on the storylines of all future episodes and ultimately determine if the protagonists do find the success they are working for.Story driven adventure game\nNarrative point & click\nImmersive emotional experience\nEpisodic content\nUnique setting","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mi'pu'mi Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":51531,"name":"TT Isle of Man","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7cc/7cc47e80ec8e3453138a5b1bca97d2be.jpg","description":"For bikers, there are two types of speed races: the Isle of Man TT and the rest. No other race is as gruelling for the motorbikes and demanding for the riders. Take up the challenge of the Snaefell Mountain course: all 37.73 miles faithfully reproduced with the champions and their bikes.\n110 years of history have made TT a motor racing legend. Memorise each section of the course, round each bend to perfection, keep your concentration throughout the 6 laps, get the best time and write your name alongside the greatest champions.\n• THE SNAEFELL MOUNTAIN COURSE FAITHFULLY REPRODUCED: 37.73 miles of roads and 264 bends for a race that is longer and more difficult than all GP circuits together.\n• THE OFFICIAL RIDERS AND THEIR ULTRA-POWERFUL MOTORBIKES: 25 riders and 38 motorbikes hurtling along mountain roads at over 180 mph.\n• REALISTIC DRIVING APPROVED BY TT RIDERS: lifelike motorbike behaviour to experience the real sensations of driving, just like on the actual course.\n• ONLINE COMPETITION FOR UP TO 8 PLAYERS.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":50000,"name":"Star Control: Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40f/40f61f9816192f9914e59a4b4d7519f7.jpg","description":"Explore a living galaxy filled with alien civilizations, new and exotic worlds, pulse pounding combat, and a deep, rich history that is yours to unravel!\n\nCongratulations! You are the Captain of Earth's very first interstellar ship. That's good. Really good. So very good. There's just one small problem. Barely worth mentioning but a hostile alien race known as the Scryve want to exterminate us. We need you to go find allies, discover and use these so-called Precursor relics to upgrade your ship and try to avoid getting eaten along the way so that you can save humanity. We don't want you to feel pressure though. Just the very future of the human race rests on your shoulders.\n\nYou can pre-order Star Control®: Origins now and get access to the Betas. Do so and you get the game at a discount as the price will rise the closer we get to finishing.\n\nBeta 1: Fleet Battles. Assemble your ships into a fleet and take them into combat online, against devious computer opponents or against your soon-to-be former friend sitting next to you. You can also craft your own ships and fight with them and share them online. Available 11/16/17\nBeta 2: World Maker. Build your own worlds, share them or add worlds others create. Then send your Lander to explore the surface, find relics and fight alien creatures. Available: This Winter.\nBeta 3: Creator of Universes. Create a universe...within a universe! Alternatively, download universes others make and visit them and find out their stories, aliens, ships, planets! Available: After this Winter.\nFinal release: When it's done. Seriously, you'll tell us when it's ready. Right? I mean you wouldn't just make us work on this forever. That would be wrong. Cruel even. Star Control: Origins has a lot to live up to.\n\n**Features:**\n\n* Interact with aliens, both malicious and absurd.\n* Explore a living universe that frankly can't believe you're flying around in that...thing.\n* Travel across exotic and amazing worlds searching for relics, Precursor artifacts, and treasures.\n* Navigate through thousands of planets in a universe that has a deep history spanning back hundreds of thousands of years.\n* Interact directly with the development team, post your ideas, and be part of something amazing!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":43970,"name":"1982","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/181/181cfa30dfae48a2a61a152f01c6e641.jpg","description":"1982 is a FREE retro inspired blasta-thon that will test your gaming skills to the max.\nThe game was created using AppGameKit an easy, quick and powerful game development tool.\nhttp://store.steampowered.com/app/325180/1982 GAME MODES\nArcade - battle through 50 progressively difficult levels against some familiar early 80's home computer and arcade enemies.\nSurvivor - how many points can you score with only one life?\nTime Attack - score as many points as you can in 3 mins.  Unlimited energy, but each hit reduces your score multiplierPOWER-UPS - Kill, Catch or Collect\nEach power-up has 2 uses, one when collected by the players ship and the other when shot and destroyed.\nIf you catch a power-up before it hits the ground then it's effect is increased. (ie. More energy is regained or lasers, rockets or shield last longer.)  A successful catch is indicated by a heart.\nKill, Catch or Collect?\nThe 4 types and uses are as follows:\n1. Energy Power-ups (green)\nKill - creates a large explosion\nCatch or Collect - restore player energy\n2. Laser Power-ups (red)\nKill - deploys a temporary horizontally firing laser turret\nCatch or Collect - grants the player a temporary weapon increase\n3. Rockets Power-ups (purple)\nKill - deploys a temporary rotating rocket launching turret\nCatch or Collect - grants player a temporary rocket power-up\n4. Shield Power-ups (cyan)\nKill - creates a temporary portal that destroys all enemy bullets\nCatch or Collect - grants the player a temporary shield protecting against all impactsSCORING\nGeneral\nEach enemy kill is worth 1 pt x score multiplier.\nThe Score Multiplier is increased by filling the kill gauge on the left of the screen.  To do this string a lot of kills together quickly.  Failing to kill anything causes the gauge to drop.\nAbductions...of Man & Multipliers\nWhen a certain number of enemies reach the ground a Man will be abducted by a yellow saucer.  As well as abducting Man the saucer takes x3 from your multiplier.\nKill the saucer and allow Man to fall safely to the ground and your x3 multiplier is returned.\nThe number of enemies reaching the ground needed to trigger an abduction reduces as your multiplier increases.  High multipliers are hard to defend.\nCoins\nMany in game actions such as killing certain enemies trigger a coin drop.  Pick up the coins for extra points (5pts x multi), catch them for a further bonus (10pts x multi).  Caught coins are indicated by a heart.\nBonuses\nComplete any of these in game actions to trigger a bonus coin drop...\nArcadia - Survive a level\nAstro Blaster - get a new high multiplier for your current game\nMajor Havoc - trigger 2 Astro Blasters within 5 secs\nMissile Command - have 2 remote missile launchers active at the same time\nLaser Zone - have 2 remote lasers active at the same time\nBomberman - kill lots of enemies in an energy power-up explosion\nDefender - stop any enemy reaching the ground for 30 secs\nRepulsar - Ram an enemy with your shields\n2084 - rescue Man from the saucers 3 times in a row\nIf you like 1982 then checkout this other game made by Binary Zoo:\nhttp://store.steampowered.com/app/338000/Echoes/","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Game Creators","platforms":[{"id":0,"name":"PC"}]},{"id":29305,"name":"PLANETS OF WAR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/294/29420c998c753898e174d0cc58908a0a.jpg","description":"This is a Short Clicking Adventure Game in which you Save Earth from an Alien Invasion.\nClicker Game\nShort Game (15 Minutes)\nEasy to Play\n50 Amazing Achievements\nAchievements","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Indiecode Games","platforms":[{"id":0,"name":"PC"}]},{"id":27235,"name":"Luigi's Mansion: Dark Moon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad8/ad81fb8258c036ac5ae538a9facc03ab.jpg","description":"The new Luigi's Mansion: Dark Moon gives players multiple mansions to\nexplore, a variety of puzzles to solve and new ghosts to capture. Armed\nwith the Poltergust 5000, a ghost-sucking, vacuum-like invention, Luigi\nmust complete a number of missions assigned to him by Professor E. Gadd.\n\nFeatures:\n\nShining a light on the ghosts is no longer enough to stun them into\nimmobility. Players need to activate a new strobe function to stun the\nghosts before sucking them up with the Poltergust 5000.\n\nEvery mansion is filled with unique puzzle elements and ghosts.\nPlayers must figure out how to defeat each one of them and find hidden\nclues and keys to unlock new areas.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Next Level Games","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":22699,"name":"Might and Magic 7: For Blood and Honor","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dab/dabe01ecfeec69c41310e6a4fe6b13ab.jpg","description":"To experience great adventures, you’ll have to take a step back in time.Might and Magic VII - For Blood and Honor brings back the fantasy role-playing genre with an enhanced game engine and thrilling gameplay. It brings to life a fantasy world replete with fearsome dragons, horrifying monsters and exotic races. This game has everything the experienced role-player desires, including new character classes, skills, spells, magic items and a compelling story that will keep you absorbed for hours on end. Might and Magic VII - For Blood and Honor brings to life the most fantastic, engrossing and intense role-playing experience ever created.Arguably the best installment of the Might and Magic series.\nOver a hundred hours of great adventure in the Might and Magic universe.\nA great soundtrack, an epic story, memorable locations and an addictive card game: Arcomage!","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":18305,"name":"Regimental Chess","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/620/620806b0ec1968bc4074eb3760d29fa5.jpg","description":"Just UpdatedUpdate Version 1.1.0 –Chats and Makeovers\nWith this new update we have completely revamped the UI and its functionality. We wanted to make the visuals much better, easier to use and understand. We have also upgraded from Unity 4 to Unity 5, which gives us more stability, and some better visuals, as the lighting and coloring for the games are now much softer, and easier to look at.\nChange Log\nCompletely new UI and functionality\nNew Report bug button\nNew Options setting button\nNew Tips/Help button\nSee which friends are online\nAdded Chat to main menu and in game\nAbility to use private chat\nIn Game lighting revamped\nFixes\nFixed bug with logging in where user name was not case sensitive\nRegimental Chess is undergoing some major overhauls, so please bear with us as we work to fix bugs, and improve the overall game experience.\nWe want to hear from you! Please send all comments, questions and feedback to info@regimentalchess.com\nTo stay informed with the latest news and updates, follows us on Facebook. http://www.facebook.com/regimentalchess\nAbout the GameRegimental Chess was generated from the desire to create a solid game emulating the strategy and tactics of battle. Strategy being the art of positioning ones formations. Tactics being the art of how they fight. At first, the creator of this game increased the number of pieces and the size of the battlefield.  The quick realization is that chess evolved into, and solidified, into a board 8 squares by 8 squares for good reason. The two small armies are therein locked into combat where every position counts.  Increase the size of the field or the army, and all that is lost.\nThen came the epiphany: move multiple pieces in formations rather than just one piece at a time. Formations that are governed by rules.  Formations that can be broken apart.  No point system is necessary. If a formation breaks up or loses pieces through attrition, it simply becomes less effective as a fighting unit until it is either annihilated or becomes too small to remain relevant to the battle.\nIt then became a matter of experimenting with the numbers of pieces and size of the board to create a balance whereby every formation plays an important role in any given game.\nIn the Napoleonic Wars, well formed infantries defeated the cavalry charge because horses refused to charge into a wall of bayonets held by foot soldiers that no longer turned to run. But the same densely packed infantry made an easy target for an artillery strike. The artillery, in turn, was itself  vulnerable to a cavalry charge. This historic dynamic of rock-paper-scissors underpins the balance of Regimental Chess.\nThe king is most often captured by a formation of rooks and queens, acting like a heavy artillery.  However, this group has a difficult time capturing the king if he is surrounded by his horses. Because of the way they are formed and move, the horses are extremely vulnerable to charge of densely packed infantry. This infantry, in turn, can be quickly wiped out by the rooks and queens.  It is all a matter of how many pieces are in each formation, how the formation is shaped and where it stands in relation to its enemies. For this reason, an immediate strike by bishops, albeit sacrificial, is best intended to wipe out as many rooks, queens and horses as possible, break up their formations and thus reduce the opponent’s offensive and defensive capabilities.\nMultiple Board Regimental Chess emulates the battle a general must wage along a broad front, with multiple divisions and commands, each carrying out and issuing orders. Each division protects the flank of the next division. Forces must shift along the backfield to defend against points of attack, or to mass forces and attack where opportunity presents itself.\nAfter all is said and done, we’re extremely pleased with the game we’ve created and we hope you enjoy it as much.\nIf your intellect has a brutal streak, or your brutality has an intelligent edge, this is the game for you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Thomas Bacon","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17722,"name":"Dead Hungry Diner","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1a/b1a6f4db2455751bfb0a5f18dd4d1bb7.jpg","description":"Just UpdatedUpdate 1.9 - What's new:\nTrading Cards\nAchievements\nLeaderboards for All-You-Can-Eat  levels (and new difficulty progression)\nUpdate NotesUpdate 1.8\nImprovements:\nFullscreen mode completely redone: Less black borders!\nAdded all the polish and little fixes from the iOS version to the PC version (for the iOS version see {LINK REMOVED}here)\nFixed single click sometimes reported as a double click (and killing a streak sometimes :-( )\nChanged DRM wrapper. Should fix cases where game wouldn't start in Steam client but worked as DRM free version.\nSprites grouped in texture atlases and use of hardware texture compression for better support of low spec machines\nAdded user config file with additional options (for example to fix a missing mouse cursor). These options are published on the Community Forum\nUpdate 1.5\nNew Features:\nThree new monster customers: Mummy Girl, Skelley the skeleton lady and the Crazy Weerwolf.\nNew \"affection\" game mechanic: Some monsters admire some other monsters so much that they do not engage in a brawl.\nLevel selection screen: You can replay any level you have played before to get all three stars (with all upgrades you bought so far). And Shady, the shop keeper, only accepts stars as currency to buy upgrades!\nLevels are reworked with the new features\nArtwork polished\nAbout the GameDead Hungry Diner is all about big combos, spells, monsters fighting monsters and finding your flow within the monstrous mayhem!\nHelp Gabe and Gabby, patrons of “The Dead Hungry Diner”, as they feed the creatures of the night buckets and buckets of juicy Brain Berry goop!\n(Well... that’s the easy part!)\nDo you know what happens when you place werewolves near vampires?\nThey fight!!! And you don’t want fighting when you have so many other things to take care of... Key Features55 Levels across 5 worlds\n6 Unique Monster Types to Manage\n2 Game Modes - Story and All-You-Can-Eat\nStrategically use Spells and Abilities to Overcome Challenges\nGrab Upgrades from the Blackest Market\nKeep the Peace with Frankie the Bouncer\nHelp Defeat the Evil Monster Hunter\nEasy to Follow In-Game Tutorials\nCan You Achieve Master Ratings on all Levels?\n(It’s Very Pretty!)DISCLAIMER:\nOur Vampires Are 100% Sparkle and Love Triangle free!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Black Market Games","platforms":[{"id":0,"name":"PC"}]},{"id":14764,"name":"Shift","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0d/c0dbac89005b2c3e4330b762e2e3578e.jpg","description":"It's a fun puzzle game. You have to connect as many figures as possible together. Use yellow \"shifters\" to change direction of the line. Get more points for longer line.\n- Different modes (Ranking levels, Randomly generated levels)\n- Different elements (Blank, Connectors, Shifters, Locked Shifters, Bonus connectors)\n- Different difficulty levels (Grids: 7x7, 9x9, 11x11, 13x13)\n- Great soundtrack","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Black Lime Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":14516,"name":"One Night Stand","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/983/9832c275a3e720b02291635a61f8907a.jpg","description":"After a night of fun, passion, and one too many drinks, you wake up the next morning to find a complete stranger lying naked beside you in bed. What do you do?\nIn One Night Stand, explore the unknown bedroom and seek out clues to identify who the stranger is and what happened to bring you both together.\nYou may resort to some unusual methods to find the answers you’re looking for, but take care not to prod and pry too much – a nosy guest quickly becomes an unwanted one!\nWill you stay and explore your relationship with this stranger, or will you escape when the opportunity presents itself? With 12 unique endings to discover, can you keep up the act long enough to find out what really happened?\nFeatures:\n•\tLife-like rotoscope animations\n•\tHand-drawn artwork\n•\tAn interactive story where your choices matter\n•\t12 different endings that reveal new insights into what really happened\n•\tPoint-and-click investigations\n•\tAn original soundtrack\n•\tAvailable on Windows, Mac and Linux\n•\tPlayable in English and Russian","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kinmoku","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":13805,"name":"Curvatron","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35f/35fa94f02afc20da728077bf122b70e3.jpg","description":"Community levelsFind new levels made by the community or share your own!\nAbout the GameSingle-button controls that are easy to learn, but hard to master\nQuick, bite-sized sessions. Can become quite addicting!\nState of the art minimalist visuals (please help we need real artists)\nSoothing sound effects will make you chill so hard you won't know who you are anymore\n30 different soundtrack pieces made by people around the world\nLevel editor (the same that was used to make the available levels)\nWorkshop support to get new levels and share your own\nSeveral game modes:\nAdventure: complete several levels with increased difficulty, until you quit in frustration\nClassic: collect points and survive as long as possible, until you quit in frustration\nEvergrowing: no points to collect, just try to get as big as you can\nCreative: share your pretty snake art with your friends\nMultiplayer: tron-like mode, for up to 8 players on the same system","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Brave Bunny","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13426,"name":"Farnham Fables","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/767/767230c4f715ff01bec9b797fdc5d42a.jpg","description":"When Naigye and her niece Cally visit the castle, a surprise encounter with King Farnham leads to a short story about his three sons visiting a village of native lizard people.\n*\nDo you like, or at least, are able to tolerate:\n-Point-and-click adventure games?\n-Simple yet honest \"old school\" 216-color graphics?\n-An 800x600 windowed resolution?\n-The ability to go full screen with either stretched or un-stretched pixels?\n-A single EXE file that's less than 5 MB?\n-Lots and lots and LOTS of reading?\n-A unique response for every single possible interaction?\n-Lizard girls?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ethrea Dreams","platforms":[{"id":0,"name":"PC"}]},{"id":10880,"name":"Aeon Command","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/919/919f0dcb884104b3b56a965729c17dd5.jpg","description":"The three factions of the Aeon Nebula have broken out into war.\nAeon Command is a tug of war strategy game, where you play as one of three unique factions to help gain dominance over the Aeon Nebula! Take control of your mother ship to gather resources, produce ships and fight off the enemy mother ship.  Grow stronger as you progress through the 24 mission campaign and unlock new upgrades.\nGo head to head using our match making system with cross platform multiplayer, or take on your friends directly using Steam.Key Features:3 factions each with unique ships and abilities.\n24 mission single player campaign. 8 missions for each faction.\nPlay through the Alliance, Cyborgs and Exile campaigns to unlock upgrades and abilities.\nSkirmish modes including Classic, Close Quarters and Resources and 3 difficulties.\nMultiplayer! Go head to head with a friend or stranger with your favorite faction.\nCross-platform multiplayer support. (iOS and Android restricted to match making).\nPersistent upgrade system. Unlock upgrades as you play the game to constantly improve your fleet.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bat Country Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9954,"name":"Go Mission: Space Travel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/462/462a44f6cf494873ff0c65e53065469a.jpg","description":"The space pirates are terrorizing our neighboring planets and their next target is Earth.\nYour mission is to take down these invaders and prevent them from reaching our home planet.\nAfter completing a objetive you will receive a new objetive coming from the EFS with the purpose to\ndefend our home planet.\nYou can play this game as a lone solider, or team up with a friend and enjoy double the destruction.\nAs you travel through space you must collect energy, this will boost your ship's constantly draining power.\nThe enemies will also drop money, which can be used to purchase powerful upgrades.\nIncrease your armor, firepower, and level up your craft.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"André Bertaglia","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":6656,"name":"Kinectimals","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa0/aa094734c533a4c8636f095fcf9ec76e.jpg","description":"This irresistible mobile experience gives you the chance to use your phone to visit the island of Lemuria and play with, care for and fall in love with your very own cub.  Bring your pet with you wherever you go!  If you’ve already experienced Kinectimals on Kinect for Xbox 360, your phone becomes the key to unlocking five new cubs on your console.  Stand-alone mobile game features Kinectimals’ signature visual quality, delightful animation and brand new ways to play with your cub!\nTo learn more, go to www.xbox.com/Kinectimals, http://forums.frontier.co.uk/forumdisplay.php?f=6\nSome functionality not available in all regions.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Frontier Developments","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"}]},{"id":3264,"name":"EA SPORTS Rory McIlroy PGA TOUR","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/969/96911ffdc5bb01893eef4fd2af340498.jpg","description":"Golf without limits in EA SPORTS Rory McIlroy PGA TOUR. Usher in the next generation of golf with the power of the Frostbite 3 engine and play the most beautiful sports game to date with no load times, enabling you to explore authentic tournament courses or unique fantasy environments, opening up your golf experience like never before. Don’t just play the course, explore it!\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-8\n200MB minimum save size\nDUALSHOCK®4\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). Download is subject to the PlayStation®Network Terms of Service and User Agreement and any specific additional conditions applying to this item. If you do not wish to accept these terms, do not download this item. Purchasing account will be required to log in to PlayStation®Network to use the content.\n© 2015 Electronic Arts Inc. The mark 'Rory McIlroy' is a trademark of Rory McIlroy and may not be used, in whole or in part, without the prior written consent of Rory McIlroy. The name, image, likeness, and other attributes of Rory McIlroy reproduced in this product are trademarks, and/or other forms of intellectual property of Rory McIlroy, used under license by Electronic Arts Inc. PGA TOUR, TPC, and the Swinging Golfer Design are trademarks of PGA TOUR, Inc. and are used under license by Electronic Arts Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":850683,"name":"Octopath Traveler 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d1/2d1439e74ece0eae3f571211410646dc.jpg","description":"This game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\nIn the world of Solistia, eight new travelers venture forth into an exciting new era.\nWhere will you go? What will you do? Whose tale will you bring to life?\nEvery path is yours to take.\nEmbark on an adventure all your own.\n\n■Selling Points\n1. Begin your adventure as one of eight new travelers, each with their own origins, motivations, and unique skills.\n\n2. The series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, have reached even greater heights.\n\n3. The story takes place in Solistia, where diverse cultures thrive from east to west and the industries of the new era flourish. You can sail the seas and explore every corner of a world that changes from day to night.\n\n4. Each traveler has a unique set of Path Actions they can use to battle townspeople, obtain items, take others along in their travels, and more. Where will you go? What will you do? Every path is yours to take.\n\n5. Familiar mechanics from the original game have been preserved, like the freedom to develop your travelers’ jobs and skills, as well as the Break and Boost system that made battles so exhilarating. New mechanics have also been added.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":600944,"name":"Patch Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff7/ff79f09e98bff78fe813c50e74a290e0.jpg","description":"Patch Quest is the only Roguelike-Metroidvania fusion where you can mount and ride EVERY monster in the game! Get ready to Leap, Glide, Tunnel, Bite, Slither, Websling and Explode your way through a shuffling patchwork maze. Survival depends on bending the forces of nature to your own ends! (Supports 2P Local co-op)Discover Patchlantis\nOnce home to a lost civilisation, Patchlantis has now been fully reclaimed by nature. Fierce monsters, rugged terrain and booby-trapped ruins are all a fact of life, here.\nEven the island's patchwork terrain will get shuffled each night by a powerful storm!\nSet up camp in the middle of an Open-World map!\nJungles, Desert, Mountains and Coastline. Which way will you explore next?\nPlunder dungeons, unlock shortcuts, and travel deeper into the island.Claim Your Mount!\nPatchlantis is packed with deadly monsters. But that's not always a bad thing - because your Lasso lets you claim a monster as your mount!\nEvery species can be mounted, and they all have unique skills!\nBuzzerker can take flight\nSandamander can tunnel underground\nTorrentoise has a hard, reflective shell\nCombusdile can spit hot fire\nVelostrich has lightning-fast reflexes\nThere's dozens more monsters with dozens more skills!Level Up, Power Up!\nThe Explorer's Guild has your back - we wouldn't drop you into all this danger unprepared!\nEvery single run will help you get a little bit stronger, until you can face even the toughest of beasts.\nEarn 20 Exploration Gadgets that unlock extra gameplay mechanics\nLevel up your affinity with each monster to gain new Mount Skills\nDraw power from the mysterious shrines scattered over the island\nUnlock gates, open shortcuts, and expand your reach!Bond with your Pets!\nAs you explore, you'll collect and catalogue the islands many plant species. Bring the right plants back to Base Camp to bond with your Pet Monsters, levelling them up! Every monster has unique likes.\nYou can summon your pets to help out with combat, especially when they're well looked after!\nCollect over 100 unique plants!\nGrow your Base Camp garden and level up your pets\nSummon your pets while exploring the world\nAnd travel deeper the next time your explore!\nCan you unravel the mystery of why Patchlantis fell? I sense that something sinister lies beneath the island's surface.\nHey, I see you read all the way to the bottom! Patch Quest is my passion project and I want to keep bringing new mounts, dungeons and treasures to the game for a long time yet to come. Thanks for checking it out - and feel free to join the Discord Community to learn more about future development! :D","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Lychee Game Labs","platforms":[{"id":0,"name":"PC"}]},{"id":51293,"name":"Troubleshooter","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23d/23def491dec702af533452b1a462968c.jpg","description":"Troubleshooter is a turn-based RPG with the story of Albus and the events happening around him. The story begins with Albus becoming an official Troubleshooter who then returns to his hometown to begin his journey as he meets new friends and colleagues on the way.\nThe story of Albus will be updated with at least 1 scenario stage every week.\nYou will experience different events and meet different people and make it through the missions by playing as Albus and controlling his colleagues.\nThe characters appearing in the missions will have different decisions to make, and this will affect the relationships of the characters within the game to provide a slightly different story depending on the decisions.\nThe current version contains 6 scenario stages.\nThere are colleagues who accompanies Albus through the game. You will be able to meet different characters as you play his story. You might meet them during missions and become friends or you can recruit them to make them an official member of the company.\nUsers may recruit different characters and choose different combinations for each mission to suit their style of play.\nThe current version allows you to recruit Sion as your first colleague.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kodobur Yazilim","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":50825,"name":"Banyu Lintar Angin - Little Storm","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ca/0ca0969a3a09e69bf9d1a426f1f179cd.jpg","description":"Banyu Lintar Angin is a series of experimental illustrations about three siblings, living together independently in a rural Indonesian environment. Follow the down-to-earth daily life of these siblings, accompanied by music that perfectly captures their activities.\nThis experiment was part of #MojikenCamp2, an internal upgrade program by Mojiken Studio to experiment with how to tell stories or to communicate an experience using a constrained work of interactive art.\nIt features:\nA sneak peek to the ordinary life of kids from the other side of the world\nHand drawn illustrations\nA simple short experiment for you to experience","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mojiken","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":43885,"name":"Flow:The Sliding","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/019/0199d5feaae827d66a94d2d292983b67.jpg","description":"The musical rhythm game. In the center our character moves - the ball. We need to go as far as possible and do not encounter obstacles, black bars. As we move, points are added and the speed of movement is gradually increased. And it's already hard to dodge ...\n- Achievements (easyest in the world).\n- Steam Leaderboard.\n- Collectible cards (in plans).\n- Controller support.\n- A lot of heartbeat tunes & visuals.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cubamano","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":32986,"name":"Indiana Jones and the Infernal Machine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fae/fae5021c1550cd88d2f9b1a97431ca4b.jpg","description":"The year is 1947. The Nazis have been crushed, the Cold War has begun and Soviet agents are sniffing around the ruins of the fabled Tower of Babel. What are they up to? The CIA recruits renowned archeologist and adventurer, Dr. Henry \"Indiana\" Jones, to find out. Grab your whip and fedora and join Indy in an epic globe-spanning race in search of the mysterious \"Infernal Machine.\"\n• Experience an action-adventure epic starring Indiana Jones.\n• Whip, leap, run, swim and crawl your way through amazing 3D environments.\n• Puzzle your way through 17 chapters of a gripping, action-packed story.\n• Explore dozens of exotic locales, from the mysterious ruins of Babylon to the labyrinths of the Nubian kings.\n• Choose all the weapons you'll ever want, including post-WWII-era assault rifles, Red-Army machine guns, bazookas, satchel charges and, of course, Indy's trusty whip and pistol.\n• Outwit enemies including Communist goons, strange monsters, robot guardians and more.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"}]},{"id":21524,"name":"Earthworm Jim 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5e/f5e58ad6c73f36e0c7878729027b0591.jpg","description":"Earthworm Jim, spineless superhero, wriggles back into action as the Groovy Guardian of Goodness in an incredible journey of cheese-curdling proportions. Left unconscious by a massive cow-induced blow to the head and clad in his indestructible, high-tech super suit, Earthworm Jim continues the battle for truth, justice and well aerated soil. He sure is going to need your help to guide him through his 3D fun-house of a brain.\nBut beware, the is an evil lurking, a presence in his mind, a dark unseen force at work - Jim's brain is a dangerous place!\nIn the game you can enter Jim's psyche where he comes face to face with his own fears, happiness, memories and fantasies. Each environment has games-within-games, ludicrously large levels where you go wild pig-sliding, grandma wrangling and much more. You will face the weird enemies like Psycrow or the Disco Zombies. Explore any area you choose while keeping the trigger ready for action.\nThe wacky worm is back in a massive 3-D serach for sanity.\n4 brains to navigate\n5 evil bosses to battle including: Professor Monkey for a Head, Psy-Crow, Bob the Goldfish, and Fatty Roswell.\n13 weapons including the Groovy Gun, the Chicken Gun, Banana-Myte, and the good old hair flamer!\n15 levels + final mega-boss showdown!!!\n40 of Earthworm Jim’s allies and enemies!\nHundreds of puzzles to solve","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"VIS Entertainment","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"}]},{"id":21050,"name":"Necromonads","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73c/73c4042db599a7aecabee906d52a533d.jpg","description":"Space Colony Alert Bulletin!\nThe Necromonads are at it again!! Colonists must in a orderly fashion proceed to the nearest shelter while the highly trained star pilot provides cover. Inspired by classic arcade shooters but with a twist. Captured colonists become infected and spread it to others. stop the Necromonads infection invasion now!Features\nBlistering Arcade Action\nKeyboard or Joystick Control\nLasers, and yes that's right, Bombs!\nMultiple Enemy types\nSteam Leaderboards & Steam Achievements\nSpace Zombies Gameplay\nEach level of Necromonads consists of a number of Colonists and Infection shelters that the colonists try to run to. The Necromonads will attempt to capture and infect the fleeing colonists. To accomplish this they upduct them as the flee and bring them to the top of the screen. Once to the top of the screen the colonist becomes infected and dropped back down them.\nOnce infected they spit virus bile to nearby colonists causing the infection to spread. Your job as Star Pilot is to stop the Necros long enough for the colonists to get to the shelters, Moving to the next level occurs when all colonists are accounted for and more then 50% of the remaining colonists are safe in the shelter. The Necros will send various different forms after you to stop you as you progress.Tips\nBombs can change Colonists Direction\nNecros are not affected by Crystal Barriers\nCrystal Barriers can be helpful\n#MadewithFusion","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gamesare","platforms":[{"id":0,"name":"PC"}]},{"id":20062,"name":"Project Temporality","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e40/e4018ea296af04361fe40816d2ba783e.jpg","description":"Experience the mind bending power of single player cooperation.\nProject Temporality is a third person action/puzzle game built around the concept of allowing the player to play with time. Thanks to our proprietary engine Sparta 3D we make the fourth dimension as available as the other three. Just as with a VCR you can rewind time or fast-forward through it seamlessly.\nCombining this and our time line concept you will solve mind-bending puzzles, by giving yourself a helping hand. Any time you need a friend, you can be that friend. Create a new timeline at any time/any place there are no restrictions. This game is all about giving you full freedom in four dimensions.\nSolve puzzles involving lasers, mirrors, force fields, trap doors, platforms, keys etc. Exploit time to do the impossible. Explore the world and see into the mind of its people. We hope that you will enjoy the result of our years of evenings and weekends.\nContains 6-14 hours of gameplay.Key Features\n4D Gameplay\nThe fourth dimension Time is as accessible to you as the other three since at any time you can rewind to any earlier point in time, to find that perfect moment for you. No more frustrating replays performing the same sequence over and over again. Just rewind and fix.\nSingle Player Cooperation\nThis is the key part of the game. You can exist in many parallel timelines using time clones. It means that every time you need a friend's help in the game, you can be that friend. You can spawn a new time clone at any position and time in the game, and once you create a new one it’s there forever.\nMultiple true timelines\nTime clones will continue to perform the actions you recorded. They are, however, still a part of the game world, and if you change the game world the end result will also change.\nTemporality fielded objects\nA temporality fielded object is an object that won’t be affected by your time manipulations, because it is inside a field that cancels out all timelines except the original one.\nThe Paradox Effect\nCombining the true timelines with the temporality fielding allows us to create paradox based puzzles where one single timelines performs multiple different actions depending from where in time it is viewed. Mathematically every temporality fielded object increases the number of dimensions with one which is what allows the paradox effect.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Defrost Games","platforms":[{"id":0,"name":"PC"}]},{"id":19504,"name":"Space Empires V","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c1/2c19407b1c9da099677e1c5c4c2bd22c.jpg","description":"Space Empires V is the latest edition in the Space Empires series. This new chapter completely updates the UI and takes the player into a real-time rendered 3D universe. Watch space battles played out in glorious detail and realistic effects. Expand, Explore, Exploit, and Exterminate in a huge living breathing galaxy. New features abound with political alliances between multiple empires, a top-down ship design system, a hexagonal movement grid, and many more. Due to player demand, the game is completely 'moddable' and even adds a scriptable AI system to the mix. Space Empires V boldly takes the next step in the genre of space strategy\n24 bit 3D real-time rendered graphics.\nDetailed Tactical Combat (and a combat simulator to test your designs!).\nNew vehicle types and sizes: Ships, Bases, Freighters, Fighters, Mines, Satellites, Troops, Drones, and Weapons Platforms.\nAbility to completely design and customize all of your vehicles.\nLarge Galaxy: 100 solar systems with 15 planets each.\nHuge Technology Tree: Thousands of tech levels with hundreds of components and facilities.\nCompletely customizable game graphics: Create your own planets, stars, vehicles, etc.\nCompletely customizable AI players: Create your own AI players with unique traits, styles, and speech.\n14 unique races to play or customize (or just create your own!)\nRandomly generated map for every game (or load an existing map).\nComplete game customization allowed by players (\"mods\").","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Malfador Machinations","platforms":[{"id":0,"name":"PC"}]},{"id":18309,"name":"The Stalin Subway: Red Veil","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/484/484986b544168fa16b6efef15af36326.jpg","description":"Darkestville Castle Coming Soon\nAbout the Game\nWith the death of Stalin, all those who surrounded him, are now fighting for the supreme power and control over the nation. Lena, our heroine, has found that her husband has been kidnapped and possibly murdered. She has no clue about who did it, but she knows whom to ask.\nThe Stalin Subway: Red Veil brings an exciting continuation to the storyline of this saga, with many new locations, all of them based on the Moscow of 50s. Never before a game reproduced with such realism the capital of Russia, from the subway stations of the world-known underground of this city, to famous places like the Red Square.\nIndoor and outdoor locations created following real designs of the 50s. The subway stations will be based on the real ones as well as emblematic places of the city like the Red Square.\nImproved AI makes enemies more dangerous and cunning.\nDefend yourself on the streets of Moscow, even on vehicles while you try to discover where your husband is.\nAuthentic weaponry.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Orion Games","platforms":[{"id":0,"name":"PC"}]},{"id":16939,"name":"Fall of the New Age Premium Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/882/88281424dfb16e944cde4f721b5f2044.jpg","description":"Back Story\nMankind has just got out from the dark Middle Ages. Superstitions and fears still reign the minds of the majority of people, but the germs of science and culture rapidly emerge and grow stronger. But, as it turns out, it doesn’t play into the hands of some of those in power. They are willing to make every effort and use all means to prevent the development of noble minds. The coup brews after sudden death of King in one kingdom and childless Queen is in mortal danger. A group of officials, financiers - merchants, local mafia and some members of the highest ranks of police belong to secret cult, whose goal is the destruction of any educational programs and new scientific achievements, which were very supportive and strongly promoted by the deceased king.\nThey're going to kill the Queen and enthrone his person - cruel and ignorant bastard. Police behaves outrageously in the capital, bandits openly run their dirty deeds, officials drown in corruption and are busy with their own profit. Common people are dark, terrified and trying to survive in every possible way.\nSynopsis\nThe main character, young thief Marla is caught for stealing and thrown into the town prison, and her little brother Ray is kidnapped by the people in strange leather masks. With help of the former secret policeman Herbert Marla escapes from the cell and runs away to the underground catacombs. On the road she finds out that several other street boys were stolen from the town besides Ray. Herbert gives Marla task to steal mysterious cipher from the house of one merchant.\nDecrypting coded message Marla finds out about the existence of a cult that stole her brother and also set a goal to destroy all the achievements of science and culture. During the search of Ray the girl encounters various representatives of science, who to some extent suffered from actions of the cultists. With their help, Marla finds a secret gathering of the cult and saves missing children from there.\nAfter successful rescue, Marla with Herbert intrudes into the royal palace, where they reveal the head of the cult Morgana, who disguised as maid of honor of the queen for a long time. It is this maid of honor who was behind the assassination attempt on the king, because of which Marla’s father was killed.\nWith the help of Herbert, Marla prevents cult activities and reunites with her brother. A former secret policeman regains favor of the Queen and becomes at the head of security of the kingdom in general and of science in particular.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Shaman Games Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14957,"name":"TWINKLE STAR SPRITES","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cbd/cbd7dfdd347012c874dc896883d439b4.jpg","description":"“TWINKLE STAR SPRITES ”, a competitive 2D top-down view scrolling shooter released on NEOGEO MVS in 1996, departs for new adventures on the Steam gaming platform!\nMaster your shots, and aim for the magical Twinkle Star”! MAIN FEATURES・ARCADE:\nPick up your favorite character among the 9 cute characters available in “CHARACTER MODE”, and play until you clear the game. Choose “STORY MODE”, and accompany “Lord Ran” in her adventures in search of the lost “Twinkle Star”.\nPlay locally in “VERSUS MODE” with a friend for intense and epic shooting battles!\n・MULTIPLAYER:\nConnect to Steam, and use the “INVITE A FRIEND” and “LOBBY” features to play against a buddy or challenge the best players worldwide!\n・LEADERBOARDS:\nCheck your current rank & score in “TWINKLE STAR SPRITES”  at any time, as well as those of your friends and other top shooters!\n・SETTINGS:\nConfigure your language, video, and sound volume settings to your preference for the most pleasant “TWINKLE STAR SPRITES” experience ever.\n** WILL NOT RUN ON Windows XP **","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":14112,"name":"Eleusis","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/622/6221a4ac8a62d62cb51c9dcc3667c502.jpg","description":"Steam Greenlight\nAbout the GameEleusis is a 3d first-person adventure game for Windows developed by Nocturnal Works using the technology of the unreal engine. It takes place in a seemingly abandoned village in Greece where the player character, while trying to seek refuge, finds himself in the center of a whirlwind of mysterious events.As the plot unfolds he finds clues that indicate that the village is a nest of a cult which plans to revive a dark force through an ancient ritual and harness its power. The player character faces the challenge of unlocking the forgotten knowledge of the ancient mysteries in order to stop the cult from accomplishing their goal.\nIt is a story-driven game with emphasis on exploration, information gathering and also includes horror-survival elements. The player is called to solve inventory item based puzzles in order to proceed to unlock new areas and solve the mystery. The game’s puzzles are made to challenge the player and are based on actual history, mythology and technology of ancient Greece. The player also needs to be cautious and use stealth tactics and agility to survive the threats looming the area.Key Features:\nHigh detailed realistic graphics.\nExplore open environment with realistic physics in the Greek countryside.\nUse stealth tactics and agility to survive.\nUse physics-based objects to defend yourself.\nChallenging item–based Puzzles with simple interface.\nDark atmosphere with eerie sounds.\nOriginal storyline","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nocturnal works","platforms":[{"id":0,"name":"PC"}]},{"id":13857,"name":"The NADI Project","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8a/b8aee95f4a563d6425f6f659ddc9f8f3.jpg","description":"The NADI Project it is a graphic adventure, inspired by the already best-known successes of \"The Vanishing of Ethan Carter\" and of \"Ether One\", in which you will face various obstacles.\nIn this adventure, you will be catapulted into a reality set in a future not too far away.\nYou will play Jeremy Parker, a famous businessman in his field, but forced by misfortune to go where money has no value.\nYou will face the difficulties of a shipwreck, in an anonymous island, forgotten by every nautical map. You can't count on anyone, just on your intuition.\nBur nothing is like it seems, even the desert islands do not escape out of this law.\nAnd so you'll find yourself on a journey through ancient ruins, traces left by one of the biggest electronic company in the world, the \"Ceberus Electronics\"\nThis giant business made this atoll one of his research bases and your destiny has made it your struggle for existence. You will be forced to explore thoroughly everything that surrounds you, without forgetting your main goal.\nRUN AWAY !","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Monkeys Tales Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":13413,"name":"The Land of Pain","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d4/7d448fc645ac50c515f19f4177972a97.jpg","description":"Something strange appears in the woods. Rain pours, and darkness hangs in the air.\nLife as you know it is about to change forever.\n\nIn this Lovecraftian horror adventure, you'll have to learn how to survive as you fend off a dark and disturbing evil. Explore a huge and terrifying world, flee from a unrelenting enemy, solve puzzles, and unravel the ancient mystery that's befallen this land.\nYOU ARE UNARMED -- Your only chance of survival is to run as fast as you can, and exploit the environment to hide yourself.\nHUGE MAP -- Explore buildings, caves, swamps, graveyards and more.\nBEAUTIFUL VISUALS -- CryEngine-powered graphics with photogrammetric technology and ambient sound creating a fully immersive game world.\nSOLVE & INTERACT -- Use objects to solve puzzles, and seek out clues to help unravel the mystery.\nSHROUDED IN DARKNESS -- Use a lantern to light the way, but be careful: you'll be more vulnerable when away from the darkness...Quotes MULTIPLAYER.IT: \"The Land of Pain is an interesting Italian title full of shivers and exploration.\"\nCRYENGINE: \"The Land of Pain is a beautiful example of what can be achieved with CryEngine by a single developer.\"","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Alessandro Guzzo","platforms":[{"id":0,"name":"PC"}]},{"id":10891,"name":"Secrets of Grindea","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d12/d12d19a4309b91defea62e209d3e524b.jpg","description":"Hey there! Glad you found our store page! Be sure to read the Early Access information above so you know what you're buying!\nSecrets of Grindea is an old-school Action RPG with co-op support for up to 4 players. It is a tribute to and sometimes a parody of the old SNES games so many of us grew up with and loved! Journey through fantastical lands and battle tons of different enemies and bosses in your quest for truth, friendship and, above all, finding the world's rarest treasures!\nIntrigued but not sold? Try out the demo!\nWant to get some insight into development? Visit our DevBlog!Key Features\nCharacter customization. There are no class restrictions, which gives you precise control over how your character develops! A flaming ice mage smashing faces with axes? Sure thing! On top of this, there’s a wide variety of haircuts, hats and head gears that will make your character look unique as well.\nCo-op support for up to four players! Bring your friends on the adventure by inviting them directly via Steam!\nA story filled with mystery, laughs and suspense will take you through dungeons and fields of all shapes in the rich and varied world of Grindea. A ton of side quests and hidden content will keep you busy for hours after finishing the game!\nArcade Mode features a unique experience of procedurally generated Action RPG madness, truly putting your skills to the test. Help build the town of Arcadia by rising to the challenge of this extremely tough and replayable mode!\nA pet system that makes sure you never have to be alone, even when playing by yourself. Catch any of the cute tameable animals and have them accompany you on your adventures while also boosting your skills!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pixel Ferrets","platforms":[{"id":0,"name":"PC"}]},{"id":10351,"name":"ChromaGun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e73/e73a5eb05f93141cf3be5336c4c31349.jpg","description":"\"Totally, totally loving this game!\" – TangoTek, YouTube\n\"Absolutely phenomenal\" – BUBisAwesome, Twitch\n\"A great mixture of careful puzzle solving and hectic danger-avoiding\" – Jillian Werner, Gamezebo\n============\nWelcome to ChromaTec’s test lab! You’re here to test our newest, state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to try and solve our meticulously designed test chambers. The basic principle is as easy as applying it is complex: Exit the chambers via the exit doors. But be weary of the WorkerDroids in charge of maintaining the chambers. They’re not exactly what you and I would call “human friendly”.\nUse the ChromaGun to colorize walls and WorkerDroids to progress in the chambers. WorkerDroids are attracted to walls of the same color. Using that mechanic, try to reach the exit door of each chamber. Some doors are more complicated to use than others: They can only be opened using door triggers and only stay open as long as the triggers are occupied.\nIf all of this sounds like your brain can handle it, congratulations! You’re the perfect candidate for our test chambers!\nThat being said, welcome and good luck!Help! Steam crashes when I launch ChromaGun!If you're having trouble getting ChromaGun to launch, try deactivating your firewall and anti-virus software. Sometimes these seem to cause crashes when launching certain games through steam. You can read up on the issue here: https://support.steampowered.com/kb_article.php?ref=9828-SFLZ-9289","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pixel Maniacs","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":2068,"name":"INVERSUS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/969/969775139d7ca4de22031cefdd6c5f6d.jpg","description":"The playfield looks simple at first glance, but once the action begins, complexity unfolds at a rapid pace. INVERSUS is a negative-space shooter for one to four friends. Player movement is constrained to opposite colors of a black and white grid. My walls are your paths and your walls are my paths. Each shot flips tile colors in an attempt to block, trap and close in on the enemy. Firing a bullet opens up a path for you while also closing off a path for me. Both online and local couch play are supported. The competitive versus mode pits players against each other in 1v1 or 2v2 battles. The single-player and cooperative two-player modes pit players against endless waves of enemies as they fight for high scores on an ever-changing board.\nFeaturesOnline and local multiplayer\nCompetitive battles in 1v1 and 2v2 modes\nFight for the world record in single-player and cooperative multiplayer arcade modes\nTwenty-seven versus maps encouraging varied playstyles and strategies\nSix arcade maps with distinct challenges to master\nOver 60 unlockable color palettes\nOver 250 unlockable emotes\nMind-bending levels in ever looping worlds\nA constantly changing board makes every game a fresh experience\nRewarding for both strategy and skill as you balance spatial control with quick reflexesSupported ControllersDualShock 4 (PlayStation 4)\nXbox 360\nXbox One\nKeyboard","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hypersect","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]}]