[{"id":19606,"name":"Earth 2150 Trilogy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9a/f9a4a1852ac9ddb264b026f682e4fc68.jpg","description":"Your heroes and your armies will need strong leadership to take them on a spellbinding odyssey that has everything a gamer’s heart could wish for breathtaking worlds in space, battles against cunning enemies and even downright treason from your own government faction - are you up to it?\nAccept the challenge…let this gripping EARTH 2150 RTS trilogy thrust you into the far future… and YOU will decide the fate of the universe!\nThe Trilogy includes EARTH 2150 Escape from the Blue Planet, The Moon Project and Lost Souls!\nFEATURES:Over 150 non-Linear missions in 9 campaigns and a high-action Skirmish Mode\nAggressive and intelligent computer-controlled opponents - a true challenge\nOver 100 different units and structures\nEasy-to-use map editor for creating own missions and campaigns\nAt least hundreds of hours Single player action and endless Multiplayer fun\nOver 50 Multiplayer maps for LAN, Internet and EarthNet\nUnmatched battle variety: build fortified bases, blitz the air, storm with armor, engage with naval units, even dig tunnels for surprise attacks.EARTH 2150: ESCAPE FROM THE BLUE PLANETThe 21st century was supposed to herald the dawn of a new age. The wars, famines and suffering of the last 20 millennia were to become a distant, fading memory, as scientific advances brought global peace and prosperity. Toward the end of the 20th century, a now forgotten US president even went so far as to officially proclaim the arrival of a New World Order, in which right, not might, would govern international relations. This bright future was not to be. First came a meltdown of the international stock and currency exchanges. Then the major international conglomerates were dissolved in a vain attempt to stop the fiscal hemorrhage. By 2012 the world economy had collapsed. Poverty and hunger caused social and political tensions to flare. As the crisis wore on, few were bold or naive enough to predict anything positive for the future. Most realized that the planet was on the verge of global conflict.\nIn 2048, the anticipated global conflict broke out with a violence that shook the planet to its core. All major centralized governments were destroyed in the maelstrom. Europe and Eastern Asia bore the brunt of the devastation, as entire urban centres, from Madrid to Moscow and from Seoul to Singapore were literally wiped off the map.\nThe human race has always been known for its resiliency. Within a dozen years, the Earth's inhabitants had begun to restore their old nationalities - with a few twists. Twelve states of the former United States joined together to form a new country, called the United Civilized States. The UCS citizens had essentially given up their old roles as producers and leaders. Nearly all work was being performed by robots which are controlled by expert computer systems. Not surprisingly, the human inhabitants of the UCS had become lazy and decadent.\nThe 20th-century dream for a better world had ended in death and destruction.EARTH 2150: THE MOON PROJECTThe year 2150 … one of the blackest chapters in the history of mankind. While the Lunar Corporation, Eurasian Dynasty and the United Civilized States are preparing themselves for the last all-encompassing battle, work is being feverishly carried out on a secret project on the Moon. Only the code name of this project is known ………… \"SUNLIGHT\"EARTH 2150: LOST SOULSIt is the 7th of December 2150 – in a few hours our beloved planet Earth will no longer exist.\nDevastating wars between the Eurasian Dynasty and the United Civilized States have wreaked havoc and caused mortal wounds to our planet, but that is not all, a series of nuclear explosions close to the Antarctic had changed the Earth’s orbit around the sun, glaciers melted, the sea rose to a threatening level, and meteorite showers buried whole parts of the world. Famous scientists from the Lunar corporation, a long forgotten colony on the moon first recognized the signs of the imminent catastrophe. According to their calculations  the distance between the sun and earth would decrease in the next few years by 17%, which would lead to terrible consequences.\nThe only hope left for the population was the escape to the red planet Mars. Hurry up, cause time is ticking away....","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Reality Pump","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18324,"name":"Turbo Pug","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ad/4ada32520f1363deec65dc35bde10ba6.jpg","description":"It's time to unleash your inner Pug! Turbo Pug is a casual runner with difficult, random, procedurally generated levels.\nEnjoy random weather and try to avoid getting zapped by lightning.\nUnlock new costumes for your pug and new characters to play as.\nPlease try not to squish your pug!\nTurbo Pug has an awesome original soundtrack, created by the super dude Felix Arifin.\nFeatures!  Random, procedurally generated levels.\nRandom weather\nGet pug points by running as far as you can without dying and by collecting super shiny Pug coins.\nWorld Leaderboards! Run further than your friends and other Steam users, be top of the leaderboards and win real prizes! (Prizes include things like Steam keys, Steam gift cards etc)\nA cute-awesome soundtrack featuring real life doggies!\nUnlock new costumes for your pug and new characters. Each with special traits that change how your character runs, jumps and falls.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Back To Basics Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":15077,"name":"Pixel Puzzles: UndeadZ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9cc/9ccedae5441640c8479bc991c4e01d26.jpg","description":"Pixel Puzzles: UndeadZ is a traditional style jigsaw puzzle game with top down shooter gameplay thrown in to ruin your day and peaceful puzzling experience. Dead things want to eat you whilst you puzzle. You'll have to keep the dead dudez at bay with a mixture of mines, barricades, bullets and nades.\nYou'll need to spend Zombucks on defences to help you keep back them shamblers. Barricade the roads, line the floor with mines, do anything you can to fortify the path before the hoards of reanimated reach you (an mess up all your pieces).Features:Traditional puzzle gameplay mixed in with some top down shooter action.\nIntense gritty atmosphere.\n19 puzzles in a range of sizes from 60 to 350 pieces.\nMultiple FREE DLC bonus puzzles.\n34 Steam Achievements.\nAwesome fully hand-draw images.\nInteractive play environment.\nHorrible dead things to shoot at whilst you puzzle.\nPerks & equipment.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":12157,"name":"POSTAL Redux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/129/12989022cbe47a25cdfd1f6bf8c43247.jpg","description":"The classic dark and surreal twin-stick isometric shooter returns with a vengeance!\nPOSTAL Redux is a high definition remake of The Postal Dude's infamous first foray into the world. Prepare to experience his psychological journey with faithfully recreated high resolution visuals, remastered music, sounds, and dialog, and revamped and modernized gameplay. Crazed gunmen out for your blood await you around every corner. The only choice is clear: Get them before they get you. Fight back with a devastating arsenal as you make your way through a violence-stricken town.\nIt's time to relive the madness of GOING POSTAL!\nOnline Co-op: Go POSTAL together with up to four players! Join up with your friends to wreak carnage together.\nOnline Deathmatch: Engage in free-for-all frenzies with up to eight players!\nBrand new Rampage mode: Take aim for the high score in this frantic mode that awards points for sustained kill streaks, creative methods of destruction, and blistering fast action!\nBattle through 17 levels in the classic Campaign: Beginning from your humble Home, traverse through The Mine and Trailer Park, witness the mean streets of The Ghetto and the bright lights of The City, all the way to the final standoff at the Air Force Base, including a stop at the all-new Carnival.\nIncludes the original add-ons: Blast through Special Delivery's EZ Mart, Shanty Town, Earthquake, and the luxurious La Palamino Resort, and then head to Japan in Super POSTAL's Tokyo and Osaka! Play through everything together in the massive combined 23-level Excess Postage campaign!\nA wide range of foes: Defend yourself against gun crazy Vigilantes, trigger-happy Police Officers, trained and efficient SWAT and Military squads, the quintessential Marching Band, and angry Ostriches!\n10 weapons of destruction: Lay waste with the mighty Shotgun and Spray Cannon, roast attackers with Molotovs and the Flamethrower, fill the streets with fire with the Napalm Launcher, clear out entire groups with Grenades and the Rocket Launcher (Heatseekers included!), lay traps for unsuspecting pursuers with varied types of Mines, and introducing the commanding Revolver!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Running With Scissors","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":430439,"name":"Atom RPG: Trudograd","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/478/47832d33759d76edd1c8e22a6cf65f70.jpg","description":"Please note: Since Trudograd continues the story of Atom RPG it is recommended to play the previous title before the sequel.\nTrudograd is a stand-alone story expansion to Atom RPG - a turn-based roleplaying game set in post-apocalyptic Soviet Union.\nIt is inspired by classic cRPG titles of the past, such as early Fallout, Wasteland and Baldur’s Gate series.\n22 years ago the USSR and the Western Bloc destroyed each other in a nuclear inferno. Millions died instantly, society collapsed and technology was sent back into the Middle Ages. You are a member of ATOM – an organization tasked with protecting the post-apocalyptic remnants of humanity.\nTwo years ago you – a rookie agent of ATOM – were sent on a dangerous mission into the Soviet Wastes. As a result, you uncovered certain information about a new threat that can potentially destroy the struggling remnants of humanity.\nIn Atom RPG: Trudograd your goal is to travel to a giant post-apocalyptic metropolis that withstood the tests of nuclear obliteration and social collapse. There you must find what is thought to be humanity’s last hope in fending off the menace from outer space!\nTrudograd features:\nA large city with its own lore and dozens of varying locations to fight, trade, talk and explore in;\nA hardcore turn-based experience with huge amounts of character development paths, combat styles, skills, perks and distinctions;\nUnique characters each with their own personality and a robust branching dialogue;\nMultiple-solution quests, which actively change the city around you;\nAbility to transfer your hero from our previous game (Atom RPG);\nAn easy game to pick up. While Trudograd is a continuation of the first game’s plot, it is also friendly towards new players, and will quickly fill you in on the lore and major developments you might have missed;\nA result of a two year long community effort, made by players for players. This game encompasses a lot of changes from our previous title, that were inspired by user feedback.\nWe really hope you will enjoy Atom RPG: Trudograd!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"AtomTeam","platforms":[{"id":0,"name":"PC"}]},{"id":56092,"name":"The Legend of Zelda: The Wind Waker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/45f/45f6d31b0fcefe029e33d258a7beb6a2.jpg","description":"The Legend of Zelda: The Wind Waker is an action-adventure game developed and published by Nintendo for the GameCube home video game console. The tenth installment in The Legend of Zelda series, it was released in Japan in December 2002, in North America in March 2003, and in Europe in May 2003.\nThe game is set on a group of islands in a vast sea, a departure for the series. The player controls series protagonist Link as he attempts to save his sister from the sorcerer Ganon and becomes embroiled in a struggle for the Triforce, a sacred relic that grants its holder's wishes. Aided by allies including pirate captain Tetra – an incarnation of Princess Zelda – and a talking boat named the King of Red Lions, Link sails the ocean, explores islands, and traverses dungeons to acquire the power necessary to defeat Ganon. Wind, which facilitates sailing, plays a prominent role, and can be controlled with a magic conductor's baton called the Wind Waker.\nThe Wind Waker was directed by Eiji Aonuma and produced by Shigeru Miyamoto and Takashi Tezuka. It retains the basic 3D gameplay of its predecessors, Ocarina of Time and Majora's Mask, but with a distinctive cartoon-like art style created through cel shading. The game received widespread critical acclaim, but the art style proved divisive among players, which contributed to comparatively weak sales. As a result, Nintendo changed directions with the next Zelda installment, the more realistically-styled Twilight Princess. However, The Wind Waker's reputation improved over time, and it is now widely considered one of the greatest video games ever made. The Wind Waker originated the \"Toon Link\" variant of the main character, and received two direct sequels for the Nintendo DS, Phantom Hourglass (2007) and Spirit Tracks (2009). A high-definition remaster, The Legend of Zelda: The Wind Waker HD, was released for the Wii U in 2013, to critical acclaim.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Nintendo","platforms":[{"id":0,"name":"GameCube"}]},{"id":10575,"name":"The Shrouded Isle","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8c/a8c8cf05e16b29bb86508d37f71c1b38.jpg","description":"As the high priest, uncover and purge heretics to prepare for the awakening of your beloved god beneath the waves.\nVillagers with secret, randomly assigned virtues and vices create a different strategy every time.\nManage your resources without angering your allies.\nCarefully choose who to serve as your advisors, as one of them must be your sacrifice at season’s end.\nWatch your advisors carefully to deduce their possible virtues and vices.\n4 different colour schemes available.\nRename villagers at whim, and thereby sacrifice simulacrums of your friends, family, or followers.\nSearch out the true heretics with unforgivable sins, to quiet the voices in your dreams.\nCan you survive all three years, and meet your Lord’s expectations of purity?\nFind all six cinematic endings.\nFor the past 497 years, a secluded island village has adhered to bloody yet sacred traditions. They speak of a sleeping God beneath the waves, whose awakening shall birth a new era for the worthy.\nIn this cult manager, there are sinners aplenty, and not all are eager to confess. Each member of your community has 2 hidden traits - one virtuous, one heretical. If you’ve earned the favor of their House, you may investigate their reputation. Otherwise, you may appoint them to your seasonal council and watch their work for clues.\nFive powerful aristocratic families help maintain the village, seeking salvation through book burning, monument building, and heretical investigations. Choose one advisor from each family to assist in their ancient appointed task. However, every season, you must make the ultimate choice, designating a human sacrifice.\nClosely examine your citizenry to find the best strategy for your people and beliefs, knowing that nobody wants their child sacrificed, even for the greater good.\nWhen our Lord awakens, will He find you worthy?\nThe five families of The Shrouded Isle each supervise a different aspect of the community. Be cautious, as their loyalties are fickle as the tide.\nHouse Kegnni manages the farmlands of the village, and is charged with protecting the sacred ignorance of the community. Matron Kegnni trains her sons and daughters in the art of book-burning, erasing any trace of the old world and its many sins.\nHouse Iosefka are the village builders, using carpentry and masonry to create grand structures that ensure our Fervor may never be extinguished. Adjudicator Iosefka has designed a variety of monuments over the years, and is said to favor pyromaniacs, as their ritual fires burn brightest.\nHouse Efferson are the judges of our souls, wielding the whips that punish sinners and ensure Penitence. To confess to Vicar Efferson is to discover the newest and most effective flagellation techniques to appease our Lord.\nHouse Cadwell carefully count the wealth of the village, made up primarily of merchants and miners, and enforce Discipline. Lord Cadwell and his sons and daughters scour the village for forbidden delights that might distract from prayer and (we trust) dispose of them appropriately.\nEveryone in the village dreads House Blackborn, the guards and enforcers of Obedience. Stories abound of the dungeons of Inquisitor Blackborn, but lawful, peace-keeping citizens have nothing to fear.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kitfox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5699,"name":"Transformers: War for Cybertron","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd4/dd43f221a21fce6eb3d27381569779d5.jpg","description":"Become the ultimate weapon.  Fight to the end in the war that started it all. Wield an arsenal of lethal, high-tech weaponry and change form from robot to vehicle at any time as you battle through the living, metallic world of Cybertron. Separate Autobot and Decepticon campaigns take you from Autobot and Decepticon cities, to the Energon core of Cybertron, to the outer reaches of the orbital debris while pitting brother against brother and friend against foe.  Experience Optimus’ rise to greatness and Megatron’s thirst for destruction. The balance of power between Autobots and Decepticons is in your hands.\nKey Features\t\t\t\t\tTWO DISTINCT CAMPAIGNS, ONE EPIC STORY\nPlay both the Autobots™ and Decepticons™ campaigns\nBattle as your favorite Transformers character in this 3rd Person High Action Shooter\nWAGE WAR ONLINE\nDeep multiplayer game modes thrust you into a global battle\nTeam up with your friends and battle waves of enemies in Escalation Mode\nCREATE YOUR OWN TRANFORMERS CHARACTER\nChoose your character class, vehicle, weapons, attributes, skills, and upgrades\nLevel up and customize your character to fit your playing style\n3-PLAYER DROP-IN/DROP-OUT ONLINE CO-OP\nTeam up with your friends and fight through epic campaigns\nCHANGE FORM FROM ROBOT TO VEHICLE AT ANY TIME\nInstantly convert from robot to car, jet, tank or truck mode and attack your enemies from any angle","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Activision","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":419295,"name":"Command & Conquer Remastered Collection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ed0/ed05e3f2303b644e3b95b409a7909f5a.jpg","description":"Command & Conquer and Red Alert defined the RTS genre 25 years ago and are now both fully remastered in 4K by the former Westwood Studios team members at Petroglyph. Includes all 3 expansion packs, rebuilt multiplayer, a modernized UI, Map Editor, bonus gallery of unreleased FMV footage, and over 7 hours of legendary remastered music by Frank Klepacki. Welcome back, Commander.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Petroglyph","platforms":[{"id":0,"name":"PC"}]},{"id":56,"name":"The Inner World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0a/f0ac790f56b4269ccb5322f7a2e7bfe5.jpeg","description":"The Inner World – A 2D-Point’n’Click Adventure\nRobert is a novice, a bit clueless, but with a heart of gold. He lives a peaceful life as a court musician in Asposia's largest wind monastery. Contrary to the laws of physics, Asposia is an enormous, hollow space surrounded by an infinite expanse of earth. The world's air is provided through three wind fountains, but as one wind fountain after the other petered out and the wind gods came to Asposia, all of the sudden Robert found him in the middle of a whirlwind.\nTogether with the help of the mysterious thief Laura, his best intentions and no clue whatsoever, Robert sets off on his adventure to discover the secret of the wind's disappearance. Will the young adventurer be able to save his world? And what are Laura´s secret intentions…?Features, Features, Features! This is where The Inner World shows what it means to be lavishly with tons of content waiting for you:\nScreamingly funny dialogues!\nNumerous tricky puzzles!\nA handmade world fully drawn with love and devotion invites you to discover countless details (at least 325!).\nA patented multi-level hint system enables everyone to finish the game!\nA wonderful comforting atmosphere!\nEye-pampering backgrounds in non-stereoscopic handmade 2D (!) – going up against all current graphic trends!\nFive spectacular chapters!\nA story with more twists than any Asposian nose!\nStunning cartoon-like animations!\nThe most epic soundtrack since the origin of Asposia as well as professional voice overs – even lip sync!\nLots of cut scenes! Optional hotspots!\n... And of course: Robert, the very-very-very-VERY-last hope for Asposia!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":372603,"name":"Gas Station Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/050/050288ef5c2ecb1e8272caf0ce077d7e.jpg","description":"Something else we did:Have a look at another game we made that is already released: Treasure Hunter Simulator https://store.steampowered.com/app/748300/Treasure_Hunter_Simulator/\r\nHAVE A LOOK AT THESE GAMES FROM OUR FRIENDShttps://store.steampowered.com/app/849100/Alaskan_Truck_Simulator\r\nhttps://store.steampowered.com/app/992840/Car_Wash_Simulator\r\nhttps://store.steampowered.com/app/803980/Plane_Mechanic_Simulator\r\nAbout the GameGas Station Simulator is all about renovating, expanding and running a gas station along a highway in the middle of a desert. Freedom of choice and multiple approaches to run your business and deal with pressure are key ingredients in this game.\r\nBuy an abandoned gas station in the middle of nowhere and restore it to its former glory. Get rid of the broken furniture, fix up the walls, paint and decorate. Just don’t spend all your cash on the looks right away, you bought a gas station after all. Repair the equipment, buy those that can’t be repaired and start serving your customers to earn money for further renovations and improvements.\r\nThe more you widen your gas station’s appeal, the more customer demands will vary. The truckers want a healthy meal and a shower while the Tesla driver wants a Latte while he waits for his car to charge up. Expand the range of services you offer by adding stations, buildings and appropriate equipment. Why not expand and build a shop area, build a car wash station or even a small motel? How about some slot machines to ramp up the profits?\r\nRestoring your gas station is one thing, giving it a personal touch another. The game offers a wide array of options to customize what you have already built, ranging from your own color schemes, the name of your gas station to decorations inside and outside.\r\nDon’t forget to advertise! Letting people know about your existence and services you expand will drive even more customers to you. It might not come cheap, but pays for itself in the long run.\r\nServing your customers is key in running your gas station with success. They all expect to have their cars filled up and their food served right away. You are going to be dealing with some serious time pressure at peak hours and have to schedule various tasks for when it’s less hectic. Proper time management and closing the right priorities becomes very important when it comes to keeping your customers happy.\r\nYou can try, but the more you expand the less likely that you will be able to manage it all on your own. Hire the right people to help you run your business, but keep a close eye on them. Some employees might just not do their job right, slack, lack the right attitude to serve customers or even steal.\r\nYou can’t sell what you don’t have. Keeping track of your stock is important and ordering at the right time for the right price helps to keep profits up. You can also opt to increase your profits further by procuring from less reputable sources. Remember the gas truck that went missing last week the newspaper wrote about? Well, a shady character is just offering you a full gas delivery at half the price…\r\nOr maybe you want to take some shadier goods into your offer, the profit margins certainly are enticing.\r\nSometimes it just isn’t possible to keep every customer happy, some are just out to get you. Don’t worry, you have many stupid and mean things you can do to take revenge on such people. Drop their food, be extra slow to hand things over, shake their soda real good or just throw stuff at them. Dozens of ways to get back at those nasty ones. Just don’t overdo it, others might be watching.\r\nIrritating or shady customers, your staff breaking or stealing things or too much pressure are by far not the only situations you’ll have to deal with. You have a triving business and some people just want a piece of it. You will have to find means and ways to deal with robbery or extortion attempts not to mention vandalism or the occasional level of stupidity.Key FeaturesWide range of choices and approaches in every aspect of the game.\r\nExpansive feature set for renovation.\r\nin-depth features to expand and run your business.\r\nHigh level of customization in all areas.\r\nDetailed financial aspects of the entire operation.\r\nMore than 100 expansion and upgrade options.\r\nMore than 20 customer types and 50+ customers.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Drago Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":15488,"name":"Melissa K. and the Heart of Gold Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecb/ecb1a53299b7533c25b8c37112ff65a2.jpg","description":"Melissa K. and the Heart of Gold Collector's Edition is a 2D puzzle “Hidden Object” game. This is the only game within the franchise.\n \n###Plot \nThe story centers around the young teacher who travels to Thailand to uncover the true nature of her adventurous past. While traveling, the player meets some characters who follow the heroine to her destination.\nThe game widely exploits the misunderstood Asian mythology plentifully flavored with fantasy elements revealing Frankenstein born as a result to the players. As to fantasy elements: the traditional oriental myth here is mixed up with Nazis, aliens, clones, and ghosts. The plot in the game, in contrary to many titles of that sort is composed entirely out of a will to interconnect the gameplay branches into one examinable piece of a video game. There are some bonuses to a plot, uncovering when the certain collectibles amount is met. They disclose some of the main story's arcs.\n\n###Gameplay \nAs in every Hidden Objects game, the player is forced to investigate the multiple backgrounds on the subject of missing items. That is the only gameplay explanation there might be. The title offers a variety of locations across the globe and the similar backgrounds to fit the aesthetics. Not only would player search for the objects but also he would be faced with 2D riddles to overcome and even actions scenes to quickly react in.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SDP Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":428741,"name":"Ultrakill","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/096/096856c7b8b790cdf35c327652e4055e.jpg","description":"MANKIND IS DEAD. BLOOD IS FUEL. HELL IS FULL.\nULTRAKILL is a fast-paced ultraviolent old school FPS that fuses together classic shooters like Quake, modern shooters like Doom (2016) and character action games like Devil May Cry.\nMankind has gone extinct and the only beings left on earth are machines fuelled by blood, but now that blood is starting to run out on the surface, machines are racing to the depths of Hell in search of more.\nUse your many movement abilities to stay mobile and avoid the relentless attacks of the dead, demons and other machines.\nDestroy them with an arsenal of incredibly powerful weapons, each with multiple available variations.\nSoak yourself in their blood to regain health and keep fighting.\nKill fast and with style to rack up a combo and gain style points that can be used on weapon variations between missions.\nMaster the many levels to achieve high ranks and take on unique optional challenges\nExplore the varied and unique environments inspired by Dante's Inferno to find plentiful hidden secrets\nIT'S KILL OR BE KILLED... AND EVERY SPLIT SECOND IS A MATTER OF LIFE AND DEATH.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Arsi \"Hakita\" Patala","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":259827,"name":"Out of Space","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e51/e51d0bcf05b63ae8504f6432f9fa767a.jpg","description":"Out of Space is a cooperative multiplayer game about trying to live together in space.\nTo live with your folks, or your boyfriend or your best friends is not an easy task. Who is going to take the trash out, do the dishes, or even walk with the dog? Oh... our mundanes things that makes us humans!\n-- But in outer space, it is not just a matter of making your home feel cozy, but actually, avoid getting killed in the process. :o\nMORE INFO THROUGHOUT 2019!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Behold Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17754,"name":"RollerCoaster Tycoon: Deluxe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7dc/7dc9e27d38e7e2ec0060c1403764bc76.jpg","description":"Take a trip to fame and fortune by building the biggest, best, scariest, and most thrilling rides ever seen in any theme park. Can you make money in this volatile business? Can you become the ultimate Roller Coaster Tycoon?\nOne of the best games from acclaimed Tycoon series, with well designed gameplay mechanics, appealing graphics, and really high re-playability value. There’s no limit to what you can create so design and build the most thrilling roller coaster the world has ever seen - and buckle up for the ride of your life!\nIncludes RollerCoaster Tycoon and its two expansions: Corkscrew Follies and Loopy Landscapes\n4 out of 5 scientists agree: this is one of the most enjoyable and addicting games in existence!\nDesign and construct your own roller coaster rides or choose from fantastic pre-built designs, all with accurately simulated motion physics","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Chris Sawyer Productions","platforms":[{"id":0,"name":"PC"}]},{"id":10025,"name":"BRAIN / OUT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/472/4727b88974e4841c3b53c974c175b448.jpg","description":"► RUN AND GUN.\nBrain / Out is a multiplayer shooter with a nostalgic post-Soviet feel. Experience dynamic battles and exterminate your enemies with a large arsenal of modern weaponry. Lock'n'load!\n**************************************************************\n► KNOW YOUR ENEMY.\nMercenaries and Marauders fight not for the ideals of their country or society, but for cash. Stay alive and earn money with every kill — the only driving force of this conflict taking place at a former Soviet republic.\n**************************************************************\n► NO \"PAY TO WIN\".\nIt doesn’t matter how well your enemy is equipped — a skilled fighter will always have a chance to win. You can change the outcome of any fight without a single round fired — take out your knife and bring the opposition to their knees.\n**************************************************************\n► CUSTOM LOADOUT.\nBrain / Out offers a wide range of weapons — both NATO and Warsaw Pact rifles, shotguns, pistols, sniper rifles and melee weapons.\n**************************************************************\n► MODIFY AND UPGRADE.\nImprove your weapon stats and upgrade the level of your favorite weapons with different parts — scopes, handles, barrels, receivers, mounts and bars. Collect and disassemble trophies to get new parts and improve your Tech level.\n**************************************************************\n► ADDITIONAL EQUIPMENT.\nUse special equipment to survive a bit longer. Bulletproof vests and helmets, stun and frag grenades, under-barrel grenade launchers, anti-personnel mines and more.\n**************************************************************\n► CLIMB THE SKILL LADDER.\nThe better you fight, the more weapons you get! Get to the TOP 100 and receive a unique weapon set.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desertkun","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":6145,"name":"SKYHILL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8a/c8ac48c97a64b6c4d6a8cd0657daf97c.jpeg","description":"World War III was one cruel tragedy, at least for the others. You seemed to have a quite nice time, hidden in your fancy penthouse at the Skyhill Hotel... Till the impact of a bio-weapon blew away the life you once knew.\nNow there are mutants everywhere, and they're eager to rip you to shreds with their vicious claws. But they aren't your only problem: Your supplies are running out. You have to leave your luxurious penthouse and search for food. Walking through the skyscraper means going through hell. There is danger around every corner and death is a steady companion. But seriously, how would someone prepare for something like this?\nIt doesn't matter anymore. Nothing matters but survival. And time is running out.\nRoguelike RPG gameplay in an apocalyptic survival setting\nFeels fresh every session – randomly generated maps\nGain experience, craft weapons and look for useful objects\nFace an army of nightmarish creatures\nGo for the head or land a body shot – but choose wisely\nEverything you find can be helpful\nDifficulty levels give you the chance to actually survive this, or try to outlast this hell under the worst conditions\nOpen end – is there still hope? Come and find out!\nVarious special abilities to unlock\nTurn based combat with a sophisticated risk and reward system\nFast travel with the elevator","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2384,"name":"One Piece: Burning Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/520/520ed5686073be29438e995febc4426d.jpg","description":"Set sail with the Straw Hat Crew and collect your bounty in One Piece: Burning Blood, the most epic anime fighter this side of the Grand Line!\nFeatures –\nKing of the Pirates - Take to the sea in this dynamic fighter staring the world’s favorite pirate crew. Use Devil Fruit, Haki techniques, and punishing combos to turn the tide in the ultimate 3 vs. 3 One Piece battle royale!\nAssemble Your Crew: Build your crew with a roster of 40+ characters each with unique abilities and battle tactics! Swap crew members on the fly utilizing strategic offensive and defensive Unity attacks! Select from a massive 60+ support characters to aid your crew in battle.\nChoose Your Side and Relive the Paramount War: Relive the drama of the Marineford story arc. For the first time in a One Piece game, fans can choose between either Luffy, Ace, Whitebeard or Akainu to experience the original story from a whole new perspective!\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nNetwork Players 2-4\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©EIICHIRO ODA/SHUEISHA, TOEI ANIMATION. License coordinated by FUNimation® Productions, Ltd. All Rights Reserved.\n©BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":990,"name":"WORLD OF FINAL FANTASY","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/daf/daf2a24d9727b1511673fbfece306b94.jpg","description":"Day-1 Edition\nThe WORLD OF FINAL FANTASY® Day One Edition will be available from November 21, 2017 until November 28, 2017 and includes the following bonus content:\nA digital soundtrack sampler featuring enchanting tracks from the game.\nA stunning wallpaper showcasing legendary FINAL FANTASY heroes and creatures (Sizes: 1024 x 768, 1280 x 1024, 1920 x 1080, 2560 x 1600)Don't miss out, add it to your wishlist!\nAbout the Game\nCAPTURE, CUSTOMISE AND EVOLVE! Embark on a magical journey with siblings Reynn and Lann as they explore the vast land of Grymoire to rediscover their past and save the future. With charming and stylised visuals, players will capture, customise and evolve iconic creatures by stacking them to form adorable yet strategic monster towers. The memorable legends of FINAL FANTASY come to life in this imaginative, colourful world as an epic story fit for the smallest of heroes unfolds.\nKey Features:\nA New Twist on Classic Battles: master an all new battle system where players can utilise their captured monsters to create powerful towers of monsters to fight foes. Use the monsters´ size, element, and order effectively to win the battle!\nCapture, Customise and Evolve: strategise over endless customisation options by turning creatures into ability-boosting magicite, leveling and evolving them to gain new specialisations, or simply ride them to travel faster over the vast landscapes of this enchanting world.\nA World of Vertical Possibility: dive into vertically stacked dungeons and use creature abilities and magicite effects to get past obstacles and progress. In this world of stacking objects, the sky is truly the limit!\nAlso included are the following bonus legendary creatures:\nSephiroth summon\nWhite Chocobo\nGlow Moogle\nRed Bonnetberry\nSky Dragon\nKaguya Flan\nNidhogg\n2P Serafie\nIris\nDark Behemoth\nAstraea\nKobold Mimic\nTopaz Carbuncle\n2P Tama\nBalthier\nBoko","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":17618,"name":"Galaxy on Fire 2 Full HD","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94a/94aa2cc62ac89547f10d333b4777a68b.jpeg","description":"Galaxy On Fire 2 is the second part in its series and the sequel to the original Galaxy On Fire. It is a game about futuristic spaceflight.\n\n###Plot\nThe protagonist is Keith T. Maxwell, a space pilot who was also the main character in the original game. When his ship malfunctions, he accidentally travels thirty-five years to the future. There, a space trader Gunant Breh rescues Maxwell, hires him and gives him a new ship. Keith has to gather ore, fight against pirate attacks and investigate lost space stations.\n\n###Gameplay\nThe player navigates the protagonist's ship through space. He or she can mine ore to gain money, explore multiple star systems, fight pirates, and complete other missions. The \"jump gates\" connect the star systems, allowing the player to travel between them instantly. However, within the systems themselves, the player has to pilot his or her ship manually.\n\nWhile in spaceports, the player controls Maxwell himself. There, the protagonist can sell his ore and loot, buy upgrades for the ship, such as better engines or weapons, repair the ship, or even buy an entirely new vessel. There's also a bar, in which the NPCs can provide the main character with optional quests that earn him money.\n\n###Full HD version\nThe original Galaxy On Fire 2 was developed for mobile devices. The Full HD version features enhanced graphics and can run on a PC. This version has a slightly reduced content and does not include the DLCs and some of the original game's star systems.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Deep Silver","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":41115,"name":"Deus Ex: Human Revolution - The Missing Link","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/79f/79f8501ddc649fda4d886f332bbf2758.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Eidos Montreal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":29383,"name":"HeXen II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fe/0fece94ba577d93b20e791e5976c81f7.jpg","description":"The Four Horsemen of the Apocalypse lurk in the shadows before you. They are Death, Pestilence, Famine, and War. They are the root of all that is evil. They are the least of your worries. The last know Serpent Rider, Eidolon, lives. As the Necromancer, the Assassin, the Crusader, or the Paladin, you must defeat the dark generals and their Hell-spawned legions before you can face the Archfiend and attempt to end his ravenous onslaught. Go in peace and you will surely die.\nExperience the Quake Engine's true, polygon-based modeling for the most realistic, detailed environments ever seen in 3D gaming.\nPossess distinct spells, powers and 32 new weapons. With experience, gain levels, more hit points and certain abilities that apply to your specific character class, such as increased speed, firepower, and jump distance.\nBludgeon your way through four demon-infested worlds - Medieval, Egyptian, Mesoamerican and Roman. Smash stained glass windows, collapse structural beams, and pulverize trees.\nCome face-to-face with Knight Archers, Fire Imps, Were-Jaguars, Skull Wizards and more. Go in with friends, or go against foes in a bloody Deathmatch. Up to 16 players can go at it via LAN and over the Internet.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"}]},{"id":5304,"name":"Battlefield 1943","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fb/3fb4cecfa42d7cdf98dabb59bb42925e.jpg","description":"It's time to do your part in the action packed battles of the World War II Pacific campaign! Pick your path - be it as a rifleman crawling the trenches, a steel fisted tank commander, or ace fighter pilot dog fighting to protect the skies. Play as a lone wolf or with your friends, coordinating to turn the tide of battle. Whatever you choose, you get to enjoy the thrill of a fully featured online shooter with the unique Battlefield™ gameplay.\nSo, whether you are flying your Zero fighter for the glorious Japanese Imperial Navy over Wake Island or rushing the shores on Iwo Jima with other battle-hardened U.S Marines, you´re in for an intense battle.  Use the built in squad features to team up with up to 4 other soldiers and make your way across the Pacific Theatre together.  Thrash an enemy bunker, setup camp and snipe across the map, steal a tank in the enemy’s stronghold while your comrades launch an all out bomber attack the choices are endless!\nBuy now for a complete, action packed Battlefield™ gameplay right at your fingertips with quick and easy access.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n© 2009 EA Digital Illusions CE AB. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":3704,"name":"Sportsfriends","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e5/2e5a94a8ec2b21ce543e302870df83bf.jpg","description":"Sportsfriends is a set of four party games designed by Die Gute Fabrik: BaraBariBall, Super Pole Riders, Hokra and Johann Sebastian Joust.\n\n### Gameplay \nBaraBariBall is generally a fighting game in which the player’s objective is to keep the ball possessed by pushing off the opponents and jumping to throw it into their water space. In Super Pole Riders, a player is supposed to keep the ball on the end of a zip line by operating a pole – the ball can be either pushed along or kicked. Hokra is a minimalist competition between two teams which objective is to possess the ball for the maximum of time and to keep it in the team’s territory. Johann Sebastian Joust (or simply J. S. Joust) is an individual game in which player attempts to interfere other players’ controller manipulations by increasing the speed of background music playing.\n\n###Key features\nThe whole game is simulating a retro-fashioned aesthetics. It is a multi-feature competition which can be focused not only on graphics but also on audio and provides various forms of participation to 2-4 players. Johann Sebastian Joust is compatible only with Linux or Mac OS. It is the most minimalistic variation of the game as it does not require the use of the monitor and is non-graphic. Super Pole Riders is a sequel to Pole Riders, providing more options of the ball’s control.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Die Gute Fabrik","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19626,"name":"Dropsy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fd/6fdb00ba7c672b9e2bde347445bbbfe8.jpg","description":"Dropsy: Warm Damp Hug EditionThe Dropsy Warm Damp Hug Edition includes the official Dropsy digital soundtrack by Chris Schlarb, the Eternal Hug music EP by Jay Tholen, and Dropsy's Book of Secrets - a collection of over 100 pages of tips, sketches, concepts and ramblings from designer Jay Tholen.\nAbout the GameAfter a deadly circus fire shatters his world and tarnishes his name, Dropsy the Clown finds himself on a journey of self-discovery through a story that harnesses themes of love and unmerited kindness. With his father gravely ill and the world turning its back on the once celebrated clown, Dropsy will need to help those in need, hug total strangers, and unearth dark secrets on the winding road to redemption. Oh, and Dropsy can also talk to animals.\nDropsy is a non-traditional take on the classic point and click adventure formula starring the game's perpetually carefree namesake clown as he explores a richly detailed world full of colorful characters and sinister secrets, doling out hugs along the way. Rather than lead players on a singular narrative path, players are free to determine which avenues of adventure they want to explore in an open world setting and can piece the puzzles together at their own pace.\nOpen World Adventure – Players are free to choose which avenues of adventure they want to explore in an open world setting and can piece many of the puzzles and story bits together however they choose.\nText Free Experience – Communicate with a bizarre and colorful cast of characters through an innovative use of visual icons rather than traditional text-based dialog trees.\nPuzzles and Hugs – Challenging puzzles and complex conundrums stand between Dropsy and the secrets behind his shrouded past. With clever thinking, tender hugs, and the help of his animal friends, Dropsy can overcome evil and win the hearts of the people around him.\nEvocative Soundtrack – From gentle electric piano and saxophone melodies of the starting area, to the space echo drenched dub reggae tracks of a vampire-hunting swamp village, to the bombastic fuzzed out quasi-prog-rock of the endgame sequences, Chris Schlarb and his band of minstrels give every area in the game a distinct sense of place.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":18693,"name":"Painkiller: Recurring Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3f/c3fc90973f154c722c4f5ccbcf61127a.jpg","description":"Battle never ceases in the realm known as Hell. This time around it's a battle for the freedom of your very soul. Will you be able to escape from the prison hidden in the darkest deepest chasm of Hell? Do you have enough courage to travel through the most dangerous and twisted areas, infamous for their unsafety, even among demons themselves? Are you prepared to significantly reduce the demonic population?\nOnce again you have the chance to experience the magnificent dark atmosphere of the good (or evil?) Painkiller, the only true oldschool First Person Shooter, tough as nails, without a trace of remorse, without a glimpse of motion blur or other technological makeup. Just Painkiller and nothing else matters!Key features:5 completely new levels with impressive locations like an Angkor temple, a massive old warehouse and a highway where hundreds of cars crashed.\nA new campaign of 5+ hours of new and genuine Painkiller action!\nEven more bloodshed and action per square meter: immerse into freaking intense gameplay & ultimately challenging FPS action\nMore dense maps and sick enemies than ever before: kill over 6,000 uniquely spawned wicked monsters\nContinues the story of Bill Sherman\nImproved graphics, AI, environments as well as new atmospheric soundtrack","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Med-Art","platforms":[{"id":0,"name":"PC"}]},{"id":16629,"name":"TSIOQUE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/871/87167cbda7085dbeb98bfc92c19d5a42.jpg","description":"Tsioque (pronounced /tsɪɒk/) is an animated adventure game inspired by classic 80s and 90s point and click titles. Craftily mixing influences of games like Day of the Tentacle, Dragon's Lair or Humongous Games' Pajama Sam, it offers its own, original narrative experience, which can be described as both dark and adorable.\nWe take the role of a young princess Tsioque, imprisoned in a castle ruled by the Evil Wizard. At first glance, with her blond hair and big blue eyes, she may seem like your typical princess, but she's anything but typical. She doesn't wait for Prince Charming to rescue her - she rescues herself, using her wits, stubbornness, and an unusual talent for bringing unintended chaos and destruction wherever she goes.\nHumor? Check. Darkness? Check. Suspense? Check! What more could you ask for?\nLOTS of 2D animation – all characters and items are hand-animated, frame-by-frame, old-school-style.\nBeautiful, hand-drawn backgrounds.\nFully voiced dialogue tracks.\nA living, breathing environment, full of hidden interactions.\nExceptional soundtrack by Edward Harrison (NEOTOKYO, LUCKY DAY FOREVER) and Elle Kharitou, dynamically illustrating the gameplay and adjusted to your every action.\nNon-episodic storytelling – you will find no \"Find out what happens next, pay more money!\" cliffhangers here.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Smile","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11499,"name":"Merry Snowballs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44e/44e2afb0c846b0c9e1f9d3a0fc8020b6.jpg","description":"\"this one certainly stands out. Merry Snowballs is a visually appealing and charming snowball fighter\"\n- Upload VR\n\"for a two man team, I think they did an incredible job of creating a game for the Vive\"\n- VR Today Magazine\n\"Honestly for the cost of a cup of coffee I was truly surprised by the graphics/polish of this little title.\"\n- dlpardoposton, Steam reviewer\n\"Merry snowballs is absolutely great, it's fantastic, it's true! It has a snow gun, it's the best snow gun in the world, it is unbelievable\"\n- LamerDeluxe(tm), Steam reviewer\n\"Beautiful graphics, magical atmosphere, great game mechanics! You will enjoy it as much as your kids will.\"\n- Kris.vdv, Steam reviewer\nMerry Snowballs to everyone!\nRelive your childhood snowball fights - this time with gadgets you wish you had and without freezing your hands off! Merry Snowballs takes the player to an American neighborhood in late December with a heart-warming christmas spirit and plenty of frosty projectiles in the air! The game lets you utilize room scale to duck, take cover, attack, parry and experience the potential and fun of VR.\nSurvive through 25 challenging waves with increasing difficulty! Can you make it to the end and also beat the global Merry Snowballs highscore?\nBATTLE AGAINST Theo, Blondie, Big Joe and Lily, the next-door kids that share one goal – to make your life more difficult!\nCLAIM PICKUPS like snow guns, shields, blizzards, extra lives and use them wisely to progress as far as possible!\nSCORE POINTS to reach the top in the global leaderboard!\nGet your Christmas spirit up and join the fun!\nIMPORTANT NOTE: Game is primarily built for HTC Vive  but is also playable on Oculus Rift with touch controllers. Because of this we cannot guarantee a glitch-free experience on Oculus. If you experience any irregularities please send us a message at support@hatrabbit.se\nMerry Snowballs is released under the Hatrabbit Playground label.\nhttp://www.hatrabbit.se/playground","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hatrabbit","platforms":[{"id":0,"name":"PC"}]},{"id":364,"name":"Breach & Clear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b26/b26d0e99c94a49553dba749c2667fd0f.jpeg","description":"Breach & Clear brings deep tactical strategy simulation to PC, Mac and Linux! Build your Special Operations team, plan and execute advanced missions, and own every angle.\nChoose your real-world squad -- US Army Rangers,  Germany's KSK, Canada’s JTF2, UK SAS, and more -- and take on a variety of foes with different skill-sets and abilities. Learn to approach, engage, and dominate your opponents through superior tactics and training. The Steam version of Breach & Clear includes all the premium content from the original mobile game at no additional cost.FULL CUSTOMIZATION\nBuild your arsenal with thousands of gun combinations, and specialize each soldier with a combination of perks, tactics, camo, armor, and inventory all tailored by you. Tune your load-out with consumables like UAV Drones and Breaching Charges that can change the course of battle!OWN EVERY ANGLE\nEach soldier matters, every decision counts. Plan your mission step-by-step: split up your team and assault the map from multiple entrance points, set routes and fields of fire, use cover and outflank your foe.REALISTIC, TACTICAL COMBATDeveloped with help from members of the Special Operations Forces community, Breach & Clear features actual close-quarters combat tactics and a variety of door-breaching techniques. Soldiers equip real-world weapons and gear. Firefights take place in real time.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Mighty Rabbit Studios","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":16381,"name":"The Incredible Adventures of Van Helsing III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ce/5ceb0a9a664a4f1e5d06539bc0d0cf8e.jpg","description":"In Van Helsing III, the civil war is over in Borgovia, but the future looks grim. The city of weird science is in ruins, squabbling factions and criminals fight for power and a strange cult prophesizes the coming of “The end of times.” And they might be just right: A wave of uncanny events shakes the land, and it’s all connected to a mysterious creature, a former ally turned into a fearful arch-villain. Which means that Van Helsing will do what he does best: He wields weapons, prepares his deadly tricks, and hunts down the most dangerous monster who has ever lived… and this time it’s personal. He’s prepared to do anything to achieve his goal, even to face the darkest secret about the birth of the modern Borgovia.\nMain features\nStory - Prepare to meet your darkest fears in the conclusion of this gothic-noir adventure trilogy. This is the finale, the darkest chapter of the adventures of Van Helsing.\nClasses - Choose from six playable classes: defeat your foes as the melee-specialist Protector, be the most accurate shooter as the Bounty Hunter, master the weird science as the Phlogistoneer, engineer your tactics as the Constructor, control the magical forces as the Elementalist or become a dark, stealthy killer as the Umbralist.\nLeveling - Become more powerful as you advance through the game: the level-up customization is more detailed and diverse than ever.\nExploration - Explore new areas in this war-torn land of darkness - both in the physical world and the Ink.\nCamaraderie - Engage in witty banter with your loyal follower, Katarina - and finally, find out her secrets: the story of her past.\nCombat - Fight hordes of bloodthirsty enemies, now more feral and terrifying than ever. Take all the weapons and tools you need: choose from plenty of new powerful items for this adventure.\nMultiplayer – You and your friends can test your skills against each other via the PVP mode (8 players) or join forces and complete the story in the co-operative campaign (4 players).","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":482920,"name":"TOEM","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e5/1e59099701f55d861ae26905164156fa.jpg","description":"Follow an amateur photographer on a journey through Scandinavian inspired landscapes with the goal to see the magical phenomenon TOEM. Travel by bus to different regions with distinct architecture and sights to behold! Encounter different characters and solve smaller problems.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Something We Made","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":362941,"name":"The Walking Dead: The Telltale Definitive Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/810/8101cb5bf4db5f85ca1b6fab14cab5ee.jpg","description":"The Walking Dead: The Telltale Definitive Series contains all 4 Seasons, 400 Days, and The Walking Dead: Michonne, which includes over 50 hours of gameplay across 23 unique episodes. With graphical enhancements, behind the scenes bonus features and faithful recreations of classic menus, this is the definitive way to experience Clementine’s journey and find out how her story ends.\n· Graphical Enhancements: “Graphic Black” art style brings Season 4’s enhanced visual style to all previous seasons of the acclaimed series.\n· Behind the Scenes Bonuses: Exclusive looks at the making of the game from the developers, VO artists, and other team members that brought Clementine’s story to life.\n· Even more digital bonuses: Music player that includes 40+ tracks across all seasons, art gallery, 3D model viewer with playable voice lines, and new 3D front end that still includes the original menus and music from all past seasons.\n1 player\n45GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2018-2019 Skybound, LLC and/or its affiliates.  Based on the Comic book by Robert Kirkman, Tony Moore and Charlie Adlard.  The Walking Dead is a trademark of Robert Kirkman, LLC, used with permission.  The Skybound mark and any related logos are trademarks of Skybound, LLC.  Telltale is a trademark of Telltale, Inc., used with permission.  All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":602,"name":"Iesabel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/015/01533c576239283ad4d052c705342c92.jpeg","description":"In the times of darkness, only the mightiest of heroes can save the world. Stand out against the evil all by yourself in epic single player mode. Swarms of bloodthirsty monsters, loads of epic gear to collect, dozens of skills to obtain. Grab your sword and fling yourself into action now!\nAMAZING SCENERY:\n- Simply breathtaking 3D visuals.\n- Multitude of unique locations, villages, swamps, caves, crypts and more.\n- Action-packed fights with variety of enemies: wildlife, undead, trolls, renegades and many more.\n- A climatic soundtrack perfectly fitting the atmosphere of darkness.\nCOMPLEX RPG MECHANICS:\n- Powerful range and melee characters.\n- Dozens of powerful skills to learn and use in your battles.\n- Thousands of weapons and items to collect.\n- Four categories of items: Normal, Unique, Epic and Legendary.\n- Multitude of immersive quests to complete.\n- Challenging fights with giant bosses.\n- Engaging story of hope, heroism and betrayal.\n- Hours of hack and slash mayhem.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":446323,"name":"shapez.io","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbf/dbf940cca18bb71e52c60e3efdc5ec52.jpg","description":"Official Discord - Chat with me!\nWires update & Price changeI'm currently working on the wires update which adds a huge amount of content - The price of the game will be raised to $5.99 afterwards!\nIf you plan to buy the game, I recommend to get it now - the current price is the lowest you'll ever get (even with discounts)!\nAbout the Game\nshapez.io is a game about building factories to automate the creation and processing of increasingly complex shapes across an infinitely expanding map.\nUpon delivering the requested shapes you'll progress within the game and unlock upgrades to speed up your factory.\nAs the demand for shapes increases, you'll have to scale up your factory to meet the demand - Don't forget about resources though, you'll have to expand across the infinite map!\nSoon you'll have to mix colors and paint your shapes with them - Combine red, green and blue color resources to produce different colors and paint shapes with them to satisfy the demand.\nThis game features 18 progressive levels (Which should already keep you busy for hours!) but I'm constantly adding new content - There's a lot planned!\nPurchasing the game gives you access to the standalone version which has additional features, and you'll also receive access to newly developed features.\nDark Mode\nUnlimited Waypoints\nUnlimited Savegames\nAdditional settings\nComing soon: Wires & Energy! Aiming for (roughly) end of July 2020.\nComing soon: More Levels\nAllows me to further develop shapez.io ❤️\nI am updating the game often and trying to push an update at least once every week!\nDifferent maps and challenges (e.g. maps with obstacles)\nPuzzles (Deliver the requested shape with a restricted area / set of buildings)\nA story mode where buildings have a cost\nConfigurable map generator (Configure resource/shape size/density, seed and more)\nAdditional types of shapes\nPerformance improvements (The game already runs pretty well!)\nAnd much more!\nAnybody can contribute, I'm actively involved in the community and attempt to review all suggestions and take feedback into consideration where possible.\nBe sure to check out my trello board for the full roadmap!\nOfficial Discord\nRoadmap\nSubreddit\nSource code (GitHub)\nHelp translate","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tobias Springer","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":35629,"name":"Star Wars: Battlefront (2004)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f0e/f0ec103fb02562f9eafbcd73f124deb0.jpg","description":"LIVE THE BATTLES\nSTAR WARS™ Battlefront is an action/shooter game that gives fans and gamers the opportunity to re-live and participate in all of the classic Star Wars battles like never before. Players can select one of a number of different soldier types, jump into any vehicle, man any turret on the battlefront and conquer the galaxy planet-by-planet online with their friends or offline in a variety of single player modes. Single player modes include \"Instant Action\", \"Galactic Conquest\" and the story-based \"Historical Campaigns\" mode that lets gamers experience all of the epic Star Wars battles from Episodes I-VI, fighting from the perspective of each of the four factions within the game.\nFight as a soldier on the front lines where every weapon and vehicle you see is yours. Take the Empire head on or crush the Rebellion - by yourself or with an army behind you.\n* Pick your side - Rebels, Imperials, clone troopers or battle droids.\n* Choose your weapons wisely - each soldier has different weapons and capabilities.\n* Battle on unique planets from the entire Star Wars saga.\n* Pilot over 30 vehicles including AT-ATs, X-Wings and Snowspeeders.\n* Fight up to 32 players in massive online battles!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Electronic Arts DICE","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16450,"name":"Alpha Prime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c4/5c4272c2d42e647a4651cd9703a9fa2e.jpg","description":"Alpha Prime is a singleplayer FPS game developed by Black Element Software.\n\n###Plot\nIn a distant future, a space asteroid mining corporation successfully find a never before seen asteroid with the richest deposits of a mineral, that is used for powering the intergalactic space vessels. When the State Business Federation deployed miners on this asteroid, it was discovered that this amount of a valuable resource causes insomnia, drives the miners both suicidal and homicidal. Further mining was deemed highly dangerous, causing further evacuation of the miners. The asteroid was sealed off. Arnold Weiss is recruited by his old friend for a search and rescue mission.\n\n###Gameplay\nThe game features ten fairly open-ended levels. The environments of the game are highly interactive. The gameplay of the game resembles the classic first-person shooters of the early 2000s with several new additions. The players can hack terminals that reveal the events happened on the asteroid before the evacuation of a mining mission. Sometimes, the players have to solve basic hacking puzzles to proceed further. A classical Max Payne influenced bullet time is also present in the game. This allows to slow down time in the most complicated combat situations. \n\n###Soundtrack\nThe game's soundtrack composed by the Czech musician Kasny Jaroslav was highly praised by the critics. All the sixteen tracks were released to the public free of charge.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Black Element","platforms":[{"id":0,"name":"PC"}]},{"id":15406,"name":"Hand of Fate 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/349/349ee812051946a3d5591acf885c887c.jpg","description":"Deckbuilding returns to life in Hand of Fate 2.\nOnce more the Dealer sits at the table, and the Game of Life and Death begins once more.\nAt stake is more than mere lives.  This time, you play for the fate of empires.\nHand of Fate 2 brings a host of new mechanics to the table, and improves on every element of it's hit predecessor.  Companions will fight at your side, new challenges will test your skills, and a swathe of new opponents will fight against you.\nHand of Fate 2 is currently in development.  Follow here to keep abreast of news and updates towards it's release.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Defiant Development","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2188,"name":"The Room Three","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d0/4d0019048c722dee6e4f8dbd4e6b1914.jpeg","description":"Continuing the critically acclaimed ‘The Room’ game series, Fireproof Games are proud to bring the third instalment to PC.\nThe Room Three continues the tactile puzzle-solving gameplay of its predecessors while considerably expanding the world for the player to explore. Once again, Fireproof Games have re-built, re-textured and re-lit every asset and environment to bring the mysterious world of The Room to life.\nIn The Room Three you find yourself lured to a remote island, where you must draw upon all your puzzle-solving ability to navigate a series of trials devised by a mysterious figure known only as “The Craftsman”.\nFireproof Games are a small independent team working in Guildford in the UK. We self-published our first game The Room on iPad in September 2012 and were stunned with both the critical success and our new-found fan-base, not to mention multiple international awards. The Room games have since changed our lives and we hope you enjoy playing them as much as we enjoyed making them.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fireproof Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":419905,"name":"Blue Fire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7d5/7d5bfa5864abe9ff41bf9e068ce6d51f.jpg","description":"A Dark World Awaits – Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles, and more.\nEmbark on an extraordinary journey through the desolated kingdom of Penumbra and discover the hidden secrets of this long-forgotten land. Explore mystical temples, encounter survivors and take on strange quests to collect valuable items. Along your adventure, slash your way through daunting adversaries, roam across mysterious and abandoned regions, leap through deadly traps and ultimately master the art of movement.\n\n \n\nFeatures \n\n• A Haunting World – Travel through the perished world of Penumbra to explore unique areas filled with diverse enemies, sharp 3D platforming challenges, quests, collectibles and more. \n\n• Slash Your Way Through Great Adversaries – Encounter dangerous enemies with distinct fighting styles and partake in intense combat-platforming boss fights. \n\n• Encounter Peculiar Survivors – A long time has passed since Penumbra fell into darkness, but those that survived the kingdom’s fall will aid your journey to unlock valuable rewards.\n\n• Collectibles – Once a rich and lush kingdom, Penumbra is filled with many collectibles and items to discover, loot, collect, sell, trade and purchase. \n\n• Upgrades – No great warrior can battle the dangers lurking in Penumbra without the proper equipment. Upgrade your swords, collect valuable amulets and unlock new abilities to transform into a fierce fighter. \n\n• Lost in the Void – Far from Penumbra, there is a lost land called The Void. Find Void entrances throughout the world to uncover abstract platforming challenges that require great mastery to gather the valuable rewards hidden inside.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"ROBI Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10202,"name":"Crush Crush","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ede/ede5b57bb963e09584b5ec00a80323fb.jpg","description":"Hey hot stuff! Are you looking for a fun and flirty game to kill some time and make you laugh out loud? That’s a crazy coincidence, because it’s been looking for you!\nWelcome to Crush Crush – the Idle Dating Sim! Begin your quest to win the hearts of your town’s lovely ladies… after a disastrous intro or two! To do it you’ll have to build your stats, unlock amazing new jobs, and then sweep your waifu off her feet with exotic dates, the perfect gift, or maybe a tickle fight or two.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sad Panda Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]