[{"id":46181,"name":"SINNER: Sacrifice for Redemption","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e71/e7172f774bf6d8dbcb206d90f122d6bc.jpg","description":"Rise from the depths a crumbling kingdom and to the challenge of defeating increasingly difficult demonic bosses.  Choose aspects of yourself to weaken before defeating the avatars of Sin in the action-RPG Sinner: Sacrifice for Redemption. Inspired by classic boss-battlers and modern skill-based action RPGs, with a dash of gothic anime styling and horror storytelling, Sinner promises a thrilling and bone-chilling experience.\nA lone warrior stands on a strange shore, his mind clouded and his past forgotten, but an unstoppable force drives him on. He is Adam, guilty of a great sin and drawn to this place by powers as secret as they are terrifying. As his home, the Kingdom of Cavanis, languishes in blasphemy, Adam must face a series of trials in a desperate quest for redemption.Game FeaturesChallenge yourself against eight distinct, brutal bosses\nSacrifice strength and stats in Sinner’s “level-down” gameplay\nEquip a plethora of unlockable weapons and items to adapt to your weaknesses\nMaster Sinner’s hard-but-fair combat\nBring peace to a tortured soul in a dark and harrowing tale with multiple endings\nTake on new challenges in a variety of game modes for replayability","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Dark Star","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":44961,"name":"MINDNIGHT","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f7/7f718f0dace27a5cb3f1f1519435e39c.jpg","description":"Steam GreenlightThis game was possible with the help of the Greenlight process and Valve. Thanks a lot for the support and trust that you gave us.\nAbout the Game‰‰ Secure. Seek. Subvert. ¬þ±±\nBe an agent attempting to secure the city network, or be a hacker attempting to compromise and defeat them. Utilize your communication, manipulation, and deduction skills to persuade others and win the game.  You’ll never play the same game twice.\nSet in a future cyberpunk San Francisco, in 2038, cities have crushed the open internet. Networks are locked by security nodes and need to be maintained by NTF agents. Hackers have been searching for a way to break into them for years.\nSave or corrupt the network by working together. Remember...in the future, anyone could be compromised. Who can you trust? ±\nThe game is a tribute to social party games such as The Resistance and Werewolf. As MINDNIGHT is heavily inspired after these games, we are looking into other table-top deduction social games to bring new features and modes along the way through updates.GAME FEATURES\nOnline Multiplayer and Custom Game with Friends (5-10 players)\nTurn-based Structure\nOpen Chat System\nTricky and Subversive Opponents\nUnpredictable Gameplay","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NO MOON","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":39530,"name":"Final Fantasy XIV","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f7/8f73b974f60a58362532440e9183188c.jpg","description":"Set in the fantasy realm of Eorzea, players take control of a customized avatar as they explore the land and are caught up in both an invasion by the hostile Garlean Empire and the threat of the Primals, the deities of the land's Beastmen tribes. Eventually, they are embroiled in a plot by a Garlean Legatus to destroy the Primals by bringing one of the planet's moons down on Eorzea.\nAfter its alpha test and a delayed beta test, the game went live on September 30, 2010, remaining active until its servers were closed on November 11, 2012.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":26226,"name":"Silent Hill: Shattered Memories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a9/0a9889bfe5678ebbafd602f5fb7da578.jpg","description":"A true Survival Horror re-imagined for the next gen that watches you\nand adapts to expose your innermost fears.\n\nThe story follows Harry Mason, who wakes up after a car accident to find\nthat his daughter Cheryl is missing. Harry will wander the snowy streets\nof Silent Hill searching for answers of her disappearance, but when the\nworld freezes over, he will need to escape the lumbering demons that\nhaunt his steps. Harry will need to navigate both worlds to discover the\ntruth; not just about his missing daughter, but also the type of person\nhe actually is.\n\nSilent Hill's debut on the Nintendo Wii makes the fear more real than\never before. Players will be drawn into the mysterious town using the\nWii Remote as a flashlight and a cellphone as they search for clues.\nChoices they make will shape Harry Mason, as well as the people he meets\nand the places he visits. The enemies evolve as well, taking the form of\nthe player's deepest fears. Silent Hill promises to be more terrifying\nthan ever, bringing the fear to the Wii.\n\nA re-imagining of the original Silent Hill that turns everything you\nthought you knew on its head.\n\nThe game watches you and adapts to your actions to create a unique\nexperience to each player and intensify their fears.\n\nImplementation of a cell phone as the user interface, which acts as a\nstory telling device, map, puzzle helper, and camera that provides\nseamless flow with no interruption in gameplay.\n\nNew nightmare sequence focus on escape and evasion rather than direct\nconfrontation.\n\nSilent Hill: Shattered Memories will feature an all-new\nsoundtrack by acclaimed series composer Akira Yamaoka","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Climax Studios","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"}]},{"id":21012,"name":"Cloning Clyde","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6bb/6bbbbc0c3cd70067881bf522c0ca345d.jpg","description":"Have you ever been cloned?  Ever wonder what it would be like to be half chicken? Half monkey? Half frog?  Well, wonder no more when you play Cloning Clyde.\nAs Clyde, or one of his clones, work your way through the levels of the nefarious Dupliclone, Inc. building.  It houses bizarre simulated environments created specifically to accommodate their unconventional cloning experiments.  Have fun utilizing the many clones running amok inside Dupliclone, as you try to free yourself…or should we say yourselves.  Be careful of the traps set by the sinister corporation, and watch out for mutant clones!  Get even more inventive and you can use the cloning technology to combine the Clyde clones with some of your co-inhabitants to make mutant Chicken-Clydes, Frog-Clydes, Ape-Clydes and more.  Many of the mutant Clydes have special abilities that can help you to escape from the evil Dupliclone, Inc.\nCloning Clyde is a 3D side-scrolling adventure.\nKey features:\nExplore a visually compelling world filled with hilarious action and crazy adventure as you struggle to escape the clutches of the evil company Dupliclone, Inc.\nPlay as a variety of mutant Clydes, each with unique abilities, including 'Chicken-Clyde', 'Frog-Clyde', 'Sheep-Clyde' and more.\nSolve exciting and addictive puzzles with a variety of resolutions.\nPlay not only as one character but also switch between hundreds of clones.\nHours of fun with 40 compelling levels.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bacon Wrapped Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":20508,"name":"HotLead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f65/f65139da33456b27491a476a03528e82.jpg","description":"HotLead is an arcade third-person shooter set in industrial surroundings. The game takes the players in a world  where mankind has reached the deepest corners of space and has encountered new alien species. Humans wanted to defend themselves in the event of a war for space supremacy and built droid bases on strategic planets, which were each supposed to protect a certain area and launch a defensive attack in the event of war.\nBut the war never came and the droids were left abandoned, while their mission still remains the same – to attack anyone that might seem hostile. This leaves open the possibility of a battle happening by chance any time, where droids could attack even a peaceful visitor.\nHumans created an enhanced species to help them decommission these settlements and the remaining droids. They form a division of soldiers with special skills called HotLead.\nThe central mission requires players to disable an enemy base and then get to the extraction point. To complete their mission they will need to go through a series of smaller, independent tasks – each more challenging than the previous one. Through these side-missions players will uncover and use new skills. Each enemy has its own ability, so they need to adapt their strategy based on their opponents.\nThe game requires players to use all their functions and skills and make fast decisions. Among the skills they could use, the most helpful are running and wall climbing, using their environment and surroundings as ammo, dodging, special moves or magic.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Thrill Pill Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20172,"name":"City of Steam: Arkadia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/365/36597d93c79fdaafb83e528602f741f6.jpg","description":"Feature ListSo Much to Do!Stunning variety of quests, goals and challenges.\nLightweight!Play from any computer without bulky client installation.\nSystems!PvP, Company, Events, etc, features of an MMO and more.\nGameplay!Hardcore or Casual, Ten Minutes or Ten Hours.\nGraphics!Sets a new audiovisual standard for a cross-platform web & client game.\nTeamwork!Go at it alone or adventure with friends.\nCustomization!Augment weaponry with visible components.\nAbout the GameFree-to-play 3D MMORPG in a massive industrial fantasy world! Steambikes, swords, airships, sorcery and steampunk science in a fully realized urban universe! A city of industrial wonders sits on the brink of collapse. A world of mechanical precision has been brought to the verge of war. The New Epoch is ending, and what comes next will change the Great Mechanism forever.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mechanist Games","platforms":[{"id":0,"name":"PC"}]},{"id":18154,"name":"99 Spirits","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f2/3f2793599a4b38239b6d5208a462f2de.jpg","description":"99 Spirits is an RPG/Puzzle game that revolves around the popular Japanese folklore of Tsukumogami, everyday objects coming alive on their 100th birthday.\nHanabusa is a young headstrong girl living in the Heian capital within medieval Japan. But when her mother is slain by evil spirits, her life turns into one of vengeance as she sets out to hunt and destroy the spirits.\nDuring Hanabusa's travels, she meets a white fox who turns out to be a servant of the mountain god. Hanabusa receives a special sword passed down from her mother, which gives her the ability to see the true forms of spirits to help slay them. Shortly after, a spirit claiming to be Hanabusa's long-lost father, Hidetada, breaks her sword and leaves Hanabusa powerless and confused.\nNow to mend her broken sword and learn the truth about her father, Hanabusa embarks on a journey to annihilate every last one of the evil spirits.Key FeaturesWork out the true identity of your enemies in a unique battle system\nCapture enemies, master their skills for battle and use them to solve puzzles on the field\nInteract with over 40 unique characters and battle over 100 monsters\nBeautifully detailed art and an atmospheric original soundtrack bring feudal Japan alive\nDiscover multiple unique endings that change based on the player's actions\nDual audio: Toggle between English and Japanese voice\nIncludes the original Japanese version of 99 Spirits, 'Tsukumogami' (九十九神)*\n*Tsukumogami will be added as a separate item to your Steam Library.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"TORaIKI","platforms":[{"id":0,"name":"PC"}]},{"id":17648,"name":"Paganitzu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b83/b837bffaac80ef68b7dc8db51b5ab7de.jpg","description":"This is a genuine adventure - not just a series of levels to conquer. You can follow different routes to achieve the winning goal. In fact, you can finish Paganitzu and still have missed many of the game's intriguing situations or animated sequences, which carry you through the entire pyramid to a dramatic conclusion.\nPart one - Romancing the Rose: Al discovers that the ancient Aztec pyramid, known as \"Paganitzu\", holds many dark secrets. Al inadvertently releases a spirit of immense power, who's desire is to ravage the world.\nPart two - The Silver Dagger: finds Al exploring deeper into the Aztec ruin, in search of clues to help halt the powerful force he's released. Al enters a world of fiery devastation, filled with all new graphics and perils. This game has two huge animated sequences that are worth the price of admission themselves!\nAnd finally, part three - Jewel of the Yucatan: Al discovers the horrifying truth--the pyramid of Paganitzu is actually a living entity, which he could not see as a living person! Can Al still save the world? Will he escape with his life! The chilling end awaits.Features\nSave Your Game: Save and restore up to five games.\nController Support: Partial Xbox 360 Controller support.\nHarrison Hoard: Secret treasures to find and hidden rooms to discover.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17072,"name":"Super Panda Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/620/6207a89ac28a46611709b80a118b6b85.jpg","description":"In Super Panda Adventures, you play as the brave panda-knight Fu, who is about to finish his training to become the new guardian of the Princess. At the same day of the big celebration party, some uninvited Robots show up to conquer the planet and take the Princess away in their Space Ships!\nTell me more about the game!\nThe game plays like a modern platformer (Metroidvania) combined with a new combo fighting style and lots of adventure elements. You can fight with a sword, throw shuriken or use magic abilities and combine these attacks to get combo points that increase your experience. Level up your character and unlock new abilities and upgrades! Explore two different worlds in a non-linear way to find lots of hidden items. Talk to many npcs, solve quests, find magic items and rescue the Princess!What makes it special?single player action platformer (Metroidvania) with adventure and rpg elements\nunique combo fighting system that rewards players for combining attacks\nnon-linear gameplay that let’s you explore two different worlds\nunlock over a dozen new abilities, find magic items and talk to crazy npcs\ncustom keyboard and gamepad support\naround 6-10 hours of gameplay\nin-game dialogues in English or German\nfun for all ages\nInterested in the Soundtrack?\nPlease visit the discussion board for more information.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BlueEagle Productions","platforms":[{"id":0,"name":"PC"}]},{"id":16937,"name":"Sherlock Holmes and The Hound of The Baskervilles","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dff/dff1b37f59349a41867eea9a81d710e2.jpg","description":"Help Sherlock Holmes, the famed detective, investigate the legend of a supernatural hound on the fog-shrouded moorland in England of the 19th century. Immerse yourself into the dangerous world of diabolical curse and discover the truth of the monstrous creature.Key features:Unusual representation of Sir Arthur Conan Doyle’s most read book\nIncredible gameplay combining hidden object and puzzle game\nOver 35 locations to explore\nChoose your level of difficulty: additional or limited help and hints, quick or slow hint recharge, easy or hard puzzles and Hidden Objects","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Waterlily Games","platforms":[{"id":0,"name":"PC"}]},{"id":16927,"name":"RACE - The WTCC Game","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/712/712a879d50ebc2a86601a7a2fd08e5db.jpg","description":"The Official WTCC Game | RACE is the first ever game to be focused on the hard hitting, intense action of the exciting WTCC championship which is exploding in popularity all over the world. Based on WTCC, one of only three official FIA world championships next to Formula 1 and WRC, RACE features the complete WTCC championship season of 2006, all the cars, drivers and locations, including several official tracks and cars brand new to the racing game genre.\nThe game recreates the championship as close to real life as possible and simulates the cars and the driving style in a ultra realistic fashion.\nRACE features various difficulty levels to attract everyone, from hardcore simulation gamers to beginners level still featuring the same elements and a highly realistic driving experience.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"SimBin","platforms":[{"id":0,"name":"PC"}]},{"id":16770,"name":"Qbeh-1: The Atlas Cube","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a62/a629531eb72e494e5ddd3dd21bf87822.jpg","description":"Level Editor & Steam Workshop\nGet Virtual! Oculus Rift DK1 & DK2 Support now Included\nTry Before You Buy!\nStill not sure after all the rave reviews, videos and pictures if you want to pick up the game? Check out the DEMO and get some hands on experience!\nAbout the GameQBEH-1: The Atlas Cube is an atmospheric 1st-person puzzle platformer by Liquid Flower that takes players on an inspired quest through a variety of divergent worlds, each filled with new mysteries and secrets to uncover. In each world, players find special cubes that must be collected and used to navigate to the next portal. Some cubes will simply be used as stepping stones to new areas while others are imbued with magical properties such as gravity and propulsion.\nCreated by Liquid Flower, QBEH-1: The Atlas Cube is a prequel to their much beloved Qbeh, a small student project that found its way online and into the hands of gamers and journalists alike who wanted more after feasting on the appetizer. Now, QBEH-1: The Atlas Cube builds on the core concept and aesthetics introduced in the original and brings even more polish, passion and gameplay into the new game.\nNow includes a LEVEL EDITOR with STEAM WORKSHOP support! Build your own levels then share and play those made by the community.MAIN GAME FEATURES:Solve elaborate puzzles using a variety of Cube types such as Building Blocks, Energy Cubes and Gravity Manipulators\nExplore atmospheric Worlds, each with 6 challenging levels and unique themes\nDiscover alternate paths, intriguing platforming elements and secrets to unlock an unfolding mystery\nExperience an immersive & mesmerizing Soundtrack that pulls you into the adventure\nUncover the game’s narrative through interpretive imagery\nOculus Rift Support (supports DK1 & DK2)STEAM WORKSHOP FEATURES:Create levels using similar (world) styles found in the game\nMix and match styles from multiple themes in one level\nAdd doors, switch activated doors, moving platforms, fans and more\nAdd special cubes (basic, energy, gravity and force)\nAdd geometry blocks such as walls and floors with different styles\nMove, resize and rotate objects (only geometry blocks are resizable)\nChange lighting and add light cubes as light sources\nChange skybox\nSelect your background music from tracks available in the game\nTest levels right in the editor\nShare levels through Steam Workshop\nPlay levels made by others","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Liquid Flower","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16505,"name":"RaidersSphere4th","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/307/3076866ad8d799a2cdef61eb1f1921c7.jpg","description":"In the distant future, humanity has turned Venus into a livable environment. However, not all is well on Venusian soil as political intrigue pushes the way to help a young girl, the ace pilot known as Sonic Venus, to find the whereabouts of her missing father. Take to the skies of the second planet of the sun in this thrilling Ace Combat-like indie game, where you will find much more than just the story of one family’s heritage, but also something that will change the planet entirely.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rectangle","platforms":[{"id":0,"name":"PC"}]},{"id":15521,"name":"Super Blue Fighter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e85/e85977582f82cc5e1549992e767619bd.jpg","description":"Humans are in danger. Artificial Intelligence controls planet Earth and robots enslave humans. Super Blue Fighters (military ellite division) have been sent to detroy the evil forces and make the planet a safe place again\nThe game\nThe mechanic is simple. Hit the green or red enemies when their color matches the stars color\nGet combos using the bombs and special items to get more score.\nYou can slow down the time to move precisely and dodge enemies and shot, but be careful with the round time counter. You will lose if it goes to 0.\nEnemies\nYou will meet a lot of different enemies, not only the red/green ones. Each one has its own shotting and movemenet mechanic\nSome of them will make the round time counter move faster, and some others will change the robots color....\nDestroy all of them mercyless\nRanking\nWho will be the number one?\nPlay with players from all the world and become the best Super Blue Fighter player.\nMultiplayer\nPlay solo or with your friend.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Herrero Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4983,"name":"Death Track: Resurrection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/243/2436bd47c928a7c85e42a049cc125721.jpg","description":"Do you have what it takes to Survive?\nDeath Track: Resurrection is a racing/action title that takes players into a post-apocalyptic, not-too-distant future where traditional sports have been replaced by far more violent entertainment. The main event, The Survival Race, is a deadly combat racing tournament that draws the world's best drivers to compete in spectacular road battles with powerful, weapons-laden hot rods. Gamers will drive, battle and try to survive in races that take place in twisted future versions of the planet's biggest cities.\nFeatures:\nCombat racing across post apocalyptic versions of 10 major cities: Bangkok, Vatican City, London, Moscow, New York, Paris, Prague, San Diego, Istanbul and Tokyo.\nDestructible environments add to the chaotic destruction surrounding each race.\n10 powerful car models, customizable with multiple weapons, upgrades and paint jobs.\nThrilling suspense story drives the single-player narrative.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Gaijin Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":1206,"name":"Rogue Stormers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fc/1fc7c4753b26482231939547b03f027c.jpg","description":"Deluxe EditionThe Rogue Stormers Deluxe Edition contains the game, the game’s official score by Jonathan van den Wijngaarden with 9 tracks and the official, 48-page digital artbook. The artbook can be found in the games installation folder.\nAbout the GameDelve deep into the oil rig city of Ravensdale. A medieval metropolis that went bonkers after the people discovered goop - a raw fluid that provided energy, skin cream, bread spread and powered diesel engines. And it turned the people of Ravensdale into raging, bloodthirsty monsters. Lucky for them they have you, leading a pack of lunatic knights on a killing spree to save the city.GameplayRogue Stormers combines classic run ‘n’ gun gameplay with a modern art style, twin stick shooter configuration and all the good things rogue like has to offer. Did we mention that you can have up to three friends join you on your rampage in either online or couch co-op mode?\nYour goal is to fight and beat the ultimate evil threatening Ravensdale - but in order to beat him, you need to fight your way through 7 increasingly challenging levels. If you die, you'll be back at square one. Earned perks are yours to keep, allowing your character to grow stronger with each new raid.\nOur technology enables us to layer and combine level chunks to create meaningful level combinations with infinite replayability. An ever-growing cast of enemies, hazards and loot is layered within each chunk, generating incredible diversity.\nTons of different upgrades and weapons will cause each new session to play in a unique fashion, depending on which weapons or upgrades you pick and get. Adding to that are five unlockable character classes, each with its own skills and base weapon.\nThe further you delve into the vast undercity of Ravensdale, the more you will learn about the city's history and that of its citizens, as well as the tragic backgrounds of the five heroes who took arms to save the city.\nAll these factors combined determine how you’ll engage the sprawling city of Ravensdale. Will you go toe to toe with your enemies or pick them off them from a distance? Will you cripple your enemies, block attacks or just blast everything apart with pure damage?Features:I'm So Ronery: Single player mode\nGun Together for Fun Together: Up to four players local/online co-op\nAll You Can Kill Buffet: 5 character classes to decide whether you feel like murdering people with fire or goop or guns\nSick Arse Biomes: All generated procedurally with random placement of enemies, traps and upgrades for infinite replayability\nFarting Angels And Things that Have Teeth But Shouldn't: Deal with classic orcs, goblins, floating weapon platforms, eldritch horrors and battlegates bristling with weapons\nSet Things on Fire: Trigger environmental chain reactions that will kill both you and your enemies, but idk, it looks cool\nIt's So Shiny: Game world modeled in blistering 3D\nDiscover New Stuff: Unlock tons of crazy updates and new weaponry that give you even more ways to murder your enemies.\nStory Time:  Unravel Ravensdale's dark history piece by piece and learn your character’s gruesome history","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Black Forest Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":50350,"name":"Desert Bus VR","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e63/e63fc3248838e1be89bd15ccf3f2841c.jpg","description":"Desert Bus is back and better than ever! The 1998 Penn and Teller cult hit mini-game is coming to virtual reality, so you can fully immerse yourself in the thrilling eight-hour trip from Arizona to Nevada. It’s almost like you’re driving the “wheel” thing! Desert Bus VR can also be played in standard digital reality if you don’t own a VR headset.\nFEATURES\nPut the Pedal to the Metal\nShow everyone who rules the road as you take the wheel of a commercial passenger bus. With blistering speeds of up to 45mph and a prominent passenger side misalignment, only the hardest drivers can make it to Nevada and back!\nGetting Towed Has Never Been More Fun\nExperience the realistic consequences of driving off the road with a tow service that takes you back to the start in real time!\nPlay Non-Stop for Hours of Amusement\nEnjoy the action-packed eight-hour road trip from Tuscon to Las Vegas. When you make it to Nevada, turn around and do it all again!\nFill the Crushing, Oppressive Silence\nTune in to a variety of engaging radio programs, including one featuring the dulcet tones of Penn Jillette himself. You can even turn the radio on and off!\nGet the Authentic Bus Driving Experience\nLearn what it’s like to be a REAL bus driver with exciting gameplay that allows you to honk the horn and open the bus door! Tap the fully-interactive air freshener for some hardcore, pine-scented* action!\n*Purchase of air freshener required for full effect.\nJoin Your Friends on This Road Trip\nPlay with up to four friends in Desert Bus VR’s groundbreaking new multiplayer mode. Passengers can sit, wave, and even throw wads of paper at the driver!\nDesert Bus for Hope\nDesert Bus VR was made in-part to support Desert Bus for Hope, a volunteer organization that holds the eponymous annual event to raise money for game industry charity Child’s Play. Participants play Desert Bus in a telethon-style stream, with others pledging donations in exchange for incentives that can include everything from prizes to increasing the length of the Desert Bus play time.\nDesert Bus VR released on November 27, 2017 – the date selected by Robert “DoctorBobtastic” Nix, the winning donor during the Desert Bus for Hope 2017 “Choose the Desert Bus VR Release Date” charity drive. November 27th is also Robert’s birthday, so if you see him on that day this year, or any other year for that matter, be sure to give him a nice, big cake.\nHe also chose to make the driver’s default signature Bill “BWOS” Watt, a tribute to the late LoadingReadyRun crew member. This will be patched in with a future update that also includes the winning stickers Desert Bus Sticker Art donation drive. Thanks to the great artists who contributed!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dinosaur Games","platforms":[{"id":0,"name":"PC"}]},{"id":21805,"name":"Exowar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/345/3457e93b299f36d6fc8e5744c8f75733.jpg","description":"Exowar is a 2D top-down shooter game placed in close future. You play as a cybernetically enhanced soldier, who ventures inside scientific facility searching for truth. Ultimately you will have to face many enemies, while being in the middle of human vs alien warzone.\nIf you like stealth gameplay, you can avoid direct enemy contact and try to outsmart them, if you like fast action, nothing stops you from jumping into the room full of enemies, evading their bullets and eventually eliminating them with your favourite weapon.\nThe game contains 7 levels + bonus test level.\nThere are also 4 difficulty levels that will allow to either choose level according to your skill or increase difficulty when you beat the game on easier level.\nPlayer is offered 5 weapons to choose from, pistol, shotgun, automatic rifle, grenade launcher and rocket launcher.\nOn your way through the game you will face 3 kinds of aliens and 1 kind of guards. While doing so you will be accompanied by 5 top quality music tracks.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Aleksander Ciesielski","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21674,"name":"Lucid","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c1e/c1ec64d3d77af2219cd26e93bb049173.jpg","description":"Discover a new way to match blocks in this otherworldly, Zen-like, relaxing puzzle experience.\nLucid is the world's first Match-All puzzle game, in which you clear areas by combining all the blocks of an area. Enjoy the stunning visuals and relaxing sound effects as you make combos and hunt for the next perfect area to clear.\nGain score multipliers by chaining Color-Tasks and earn Lucid-Blocks to use later on for clearing up the whole playfield to get you out of a tough situation. Come up with new strategies to get high-scores. Earn additional special Area-bonuses for square shaped areas, inside the group you have cleared.\nKey features:\n\nUnique Match-All Gameplay\nAchievements\nAmazingly detailed colorful animations\nRelaxing Zen-like ambient music\n55 Levels with unlimited replay value\nSupports up to five player profiles to save your progress\nPlay for high-scores or just relax and get into the zone\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"YeaBoing","platforms":[{"id":0,"name":"PC"}]},{"id":21458,"name":"Luxor 2 HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a68/a6864418bf4d046c45ef7000c1dbf985.jpg","description":"The much anticipated sequel to the #1 casual game of 2005, LUXOR 2 HD has been re-imagined and sets the new standard for action-puzzlers with dazzling new HD graphics & effects.\nLuxor 2 HD still offers the addictive and easy-to-learn, yet difficult to master game play which made the award-winning Luxor franchise such a smash hit, while taking the game to a completely new level.\nLuxor 2 HD takes you on a beautiful voyage through the land of ancient Egypt. Play 88, gorgeously rendered levels in brilliant, widescreen HD graphics set amongst the pyramids and temples of ancient Egypt. Use your mystical winged scarab to shoot and destroy the approaching magical spheres before they reach the pyramids at the end of their path. And to help you shoot down those enemy spheres, Luxor 2 HD features more explosive power-ups than ever before.\nKey Game Features\n88 explosively challenging levels with 26 re-mastered HD Widescreen Backgrounds\nSpectacular new Visual Effects throughout\nFour invigorating levels of difficulty, including the expert level that unlocks the mind-blowing Challenge of Horus\nOver 80 statistics and badges, plus bonus rounds at the end of each stage\nRanking system to let players work their way from Farm Hand to Pharaoh\nThree stimulating modes of play, including the Survival and Practice modes\n13 explosive and unique power-ups, including the Color Cloud, Net, Dagger and Lightning Storm, to help destroy the oncoming enemy spheres\n13 intense and rewarding bonus rounds at the end of each stage in the game","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":20884,"name":"Let the Cat in","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/696/696947476793a7c8c8fd7e3db1bb97e6.jpg","description":"Let The Cat In is the cute puzzle game about little kittens that you need to help get into the house. The player's task is to arrange all the things and mechanisms inside the house for creating fantastic chain reactions, in order to open the door, let kittens come in and reach their favorite basket. Once the aim is reached, they can finally cuddle and fall asleep. Enjoy realy challenging logic levels, collect stars which will help you open the next rooms, play and interract with the cute kittens that will definitely cheer you up. By earning stars in each level you will be able also to pamper your kittens with various cool things and new colors available in the store.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Eforb","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20472,"name":"Rush for Glory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/779/779bbb5fa5b74aecc5a5f2fbe4a54b87.jpg","description":"Plan your defense, place your towers, get ready for action!\nRush for Glory is a challenging and rewarding 3D Tower Defense Game, in which players are defending their base against an alien invasion. By strategically building towers and upgrading them, the player can keep his base safely and further progress through the extensive singleplayer campaign.\nOver 30 types of enemies, terrifying level bosses as well as a wide variety of towers and upgrades are making Rush for Glory a unique Tower Defense experience.\nThe main features of the game include: Campaign with 10 different scenarios 3 difficulty levels Multiple achievements 5 types of towers with 3 Different upgrades and 3 special abilities each 5 power attacks. Dead rain, trap, slower, golden tower… More than 30 enemy types with especial behavior PLUS boss fights Attackers, healers, supporters, turbo types… Game speed controller to make game speed slow and fast Additional 10 mini games for each level Elaborate techtree with more than 40 upgrade options Additional cinematic cameras Encyclopedia with detailed descriptions of all units, towers and weapons","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Parseh Game Studio","platforms":[{"id":0,"name":"PC"}]},{"id":19401,"name":"Helldorado","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/217/217ea6c63a613e2b687280f88c78f461.jpg","description":"1883, SANTA FE. Peace in this town has been shattered by a shocking kidnapping. Gather your men and ride on a series of challenging missions to stop treacherous, marauding outlaws in this story of vile blackmail and revenge. Capture a train load of loot, dodge through saloon fights, a jail-break, and shoot-outs!  The stage is set for this Wild West Adventure. Will you live to tell the tale?\nWild West: Experience truly authentic Wild West locations on the PC, from a stormy rain robbery to bloody sunsets and beautiful old New Orleans, and more\nSmart Enemies: 60 different enemies with tactical behavior driven by an advanced AI system\nMulti-character game play: Play as six different characters, each with different specialist skills, abilities, and weaponry\nMovie Mode: Record your heroic deeds!\nHistorical Weapons and Equipment: 6-shooter pistol, shotguns, rifle, bow and arrow, derringer, knifes, tomahawks and other weapons found in an 1880's arsenal\nTechnology: Switch between tactical view and actions view seamlessly, Bloom and HDR rendering, PhysXageia technology\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Spellbound Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19376,"name":"10 Second Ninja","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/11c/11cf210d4ca4afd259afb88c8975e7d8.jpg","description":"Ninjas are cool, this is an established fact of the universe. Nazi Robots from space are not cool, they are the complete opposite of cool, and Robot Hitler is out to get you, the world's first ninja.\nYou have 10 seconds to destroy all Nazi Robots in your vicinity. IT. IS. ON.\nBecome the ultimate Ninja and  take down Robot Hitler’s automated autocracy in this blisteringly fast platformer.\nReady, Steady, Ninja!\nFeatures\nBlitz through 40 challenging levels!\nFight again and again to get the best time possible and a glorious three star rating!\nBreak your controller or keyboard out of anger!\nBattle your friends down to the millisecond on the leaderboards\nProve you know how to play games and collect all 30 achievements\nWarning: This game contains flashing images. It is advised that you do not play if you suffer from photosensitive epilepsy.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Four Circle Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19146,"name":"The Last NightMary - A Lenda do Cabeça de Cuia","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d30/d30130dd1728ad565be2bc1af8114167.jpg","description":"Back to her Hometown in the outback of the State of Piaui – Brazil, Maria came to visit her mother, who was ill, and finds herself trapped by a legendary local curse. They said that the curse will finish only when the beast successfully catches and kill seven Virgin Mary, but maybe there is another way to defeat this terrible beast.\nThe Last NightMary – A lenda do Cabeça de Cuia is a point and click survival genre game, based on a local regional legend from the State of Piaui, Brazil. The player will be Maria and needs to find a way to escape from Crispim (The beast), avoiding to be another victim of this curse.\nMain features:\n•A maze forest that you have to escape from the beast\n•Discover a deep plot about a new horror legend, in games\n•A different aesthetically regional environment, rarely seen before in games\n•Well acclimated soundtrack horror\n•Instigating puzzles. It's not just running around\n•Alternative endings depending of your gameplay\n•Secrets / Easter Eggs\n•Some references about classic horror games and movies\nThe game was developed as a final work from Visual Arts Course at Federal University of Piauí (UFPI).","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Submersivo Game Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17537,"name":"Phantom Brave PC","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/efc/efca40b2bf16153641e6799f30b4a1bb.jpg","description":"~The DEFINITIVE edition! Includes all Phantom Brave: The Hermuda Triangle and Phantom Brave: We Meet Again content!~\nOn a small, lonely island in Ivoire lives Ash, a Phantom who lost his life in battle, and Marona, who has the ability to communicate with Phantoms. Sometimes, Marona receives Bottlemails that float along the sea.\nMarona, who lost her parents when she was very young, makes her living by completing the requests inside the Bottlemails as a Chroma, a person who accepts freelance work to solve problems for people. However, because of her abilities, the people call her the \"Possessed.\" Even if she completes her work, some clients will hesitate to pay her the reward because of her reputation.\nStill, Marona stays optimistic and follows what her parents told her long ago: \"Help people, and someday everyone will start to like you.\" Her goal is to save enough money to buy Phantom Isle, which she's currently renting. Like a subtle wave in the sea, the adventures of Marona and Ash are about to begin.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nippon Ichi Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":16984,"name":"Tsukumogami","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56d/56ddb9d7e0fe597fb444ea1e25a06972.jpg","description":"Tsukumogami is the original Japanese version of 99 Spirits.\n99 Spirits is an RPG/Puzzle game that revolves around the popular Japanese folklore of Tsukumogami, everyday objects coming alive on their 100th birthday.\nHanabusa is a young headstrong girl living in the Heian capital within medieval Japan. But when her mother is slain by evil spirits, her life turns into one of vengeance as she sets out to hunt and destroy the spirits.\nDuring Hanabusa’s travels, she meets a white fox who turns out to be a servant of the mountain god. Hanabusa receives a special sword passed down from her mother, which gives her the ability to see the true forms of spirits to help slay them. Shortly after, a spirit claiming to be Hanabusa’s long-lost father, Hidetada, breaks her sword and leaves Hanabusa powerless and confused.\nNow to mend her broken sword and learn the truth about her father, Hanabusa embarks on a journey to annihilate every last one of the evil spirits.Key FeaturesWork out the true identity of your enemies in a unique battle system\nCapture enemies, master their skills for battle and use them to solve puzzles on the field\nInteract with over 40 unique characters and battle over 100 monsters\nBeautifully detailed art and an atmospheric original soundtrack bring feudal Japan alive\nDiscover multiple unique endings that change based on the player’s actions\nDual audio: Toggle between English and Japanese voice\nIncludes the original Japanese version of 99 Spirits, 'Tsukumogami' (九十九神)*\n*Tsukumogami will be added as a separate item to your Steam Library.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"TORaIKI","platforms":[{"id":0,"name":"PC"}]},{"id":16310,"name":"Bayla Bunny","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d4/2d4835dc450157845c1ea605321614e7.jpg","description":"Bayla Bunny has discovered a book full of maps to magical treasures and loot, and sets out on an exciting adventure to discover them all. Energized and ready to explore, she takes off running and once she gets going, she rarely stops!\nBayla Bunny offers a fun gameplay experience combining the best of platform- and runner-games, and your task is to control Bayla as she hops, runs, jumps, bounces, ducks, swings, rides and rocket herself through 27 challenging levels collecting coins, keys and treasure chests full of goodies. The faster you complete a level, the higher ranking you will achieve. But this is not an easy task … Obstacles will hinder your progress, and you will encounter enemies such as rowdy raccoons, pushy porcupines, raging bulls, evil mushrooms, crazy plants and frog kings all while avoiding flying arrows, rolling barrels, dancing fireballs, speedy cannonballs, pounding hammers and dangerous dynamite!\nBayla Bunny is not only cute; it is a fun game suitable to anyone looking for an exhilarating platform experience full of rewards and surprises.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":15595,"name":"Mad Father","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/600/60073741ea81d055761fb702743e95f7.jpg","description":"On the eve of the anniversary of her mother’s death, Aya reflects on the past. Sad, lonely, and desperate for something to help her relive happier times, Aya asks her father if they can do something special in memory of her lost mother. Aya’s father agrees and puts her to bed, promising to make tomorrow a better day. But this fleeting glimpse of light is quickly extinguished when Aya is jolted from her slumber by the sound of her father screaming. She jumps out of bed and runs to find her father, only to find the once-peaceful and somber home now littered with corpses and other horrors. Will Aya end up reuniting with her mother in the most horrific way imaginable at the hands of the undead hordes? Will she manage to escape the manor together with her father’s assistant, Maria? Or will she somehow manage to save her father from the unknown terrors awaiting her around every turn?\nMad Father is an exploration-based horror-adventure game, created by Japanese developer sen.\nAs Aya, the main character, explore your family’s sprawling manor while making use of the items you find along the way and doing whatever you can to survive the night.\nAyaThe young heroine of the story. She consciously avoids getting too close to her father's \"research\", and does her best to remain blissfully unaware of what her father’s work may entail...\nFather Aya's father. Night after night, he performs horrific experiments in the basement of the family mansion.\nMotherAya's late mother. She passed away exactly a year before the story begins.\nMariaAssistant to Aya's father.\nOgreA mysterious salesman who suddenly appears before Aya, seemingly out of nowhere...\nBlonde-haired YouthA mysterious boy who guides Aya along.\nChainsawCan be used to destroy objects made of wood, etc.\nCommand-based actionInput the key/button commands displayed onscreen to perform various actions.\nGemsCrucial items in the game which can be found hidden in various places.\nFinding all of them will be tough, but well worth the effort...\nMultiple endingsThere are three possible endings to the game.\nThe ending you are shown will depend on your actions.\nCorpsesUndead spirits out to attack Aya. If caught, she will gradually lose stamina, and the game will end.\nCorpses armed with weapons can kill Aya with a single blow, so be careful.\nI hope you enjoy this enhanced version of the original free game, featuring an array of new content, including:\n-Enhanced graphics\n-Newly added events, etc.\nCheck the news for detailed info on updated content!\nhttp://steamcommunity.com/games/483980/announcements/detail/990053830259306529","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"sen","platforms":[{"id":0,"name":"PC"}]},{"id":11969,"name":"ANIMALITY","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cc/6cc624135890185ed15fc59f79fe65b1.jpg","description":"ANIMALITY is a skill based animal runner game, the goal of the game is to avoid dragons and demons all whilst trying to grab life gems, either do this singleplayer or with your friend in local multiplayer co-op, you can collect 9 fabulous pixel art animals which are purchased using your running cash!\n★ DIFFICULT GAMEPLAY!\nThe game gets faster and harder as time goes by, you will need to practice and improve your reflexes\n★ MULTIPLAYER CO-OP!\nPlay with a friend to beat other teams on the Steam Leaderboards, work together to grab the highest score!\n★ STEAM LEADERBOARDS!\nPlay against other players and grab that high score, join your friends to chase the top of the co-op leaderboards!\n★ ACHIEVEMENTS!\nAre you an achievement hunter? we will soon have over 100+ achievements that can be earned by just playing the game!\n★ TRADING CARDS!\nCollect Steam Trading cards and trade them with your friends!\nProgramming & Development: Lee\nMusic: Incompetech (Kevin MacLeod)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ColloseusX","platforms":[{"id":0,"name":"PC"}]},{"id":11605,"name":"Dungeon Rats","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b62/b620b858830d9c99a4311869b48e10ad.jpg","description":"Starting out as a new prisoner at the bottom of the gangs-ruled prison hierarchy, and of the prison itself, you must fight to survive and develop your combat skills, acquiring better weapons and equipment as you go. Recruit allies to your struggle or carry on as a lone wolf, and kill anyone foolish enough to stand in your way.Features include:Tactical combat system, including standard attacks, aimed attacks targeting specific body parts, and per-weapon special attacks such as Whirlwind and Impale.\nDetailed crafting and alchemy systems: forge your own weapons, brew potions and poisons, experiment with Liquid Fire and Black Powder.\n8 weapon types: Daggers, Swords, Axes, Hammers, Spears, Bows, Crossbows, and Throwing Weapons, each with its own advantages and disadvantages.\nFully customizable main character, as well as 10 possible companions, not all of them human (maximum party size is 4).\n50 challenging fights and 4 different endingsNotable changes from The Age of Decadence:Party-based - the most frequently requested feature.\nFlanking and other strategic bonuses. Positioning matters a lot.\nManual placement of your characters before a fight.\nCharisma determines the number and quality of your party members.\nSkill points are split between the party members: more people means fewer skills points per person and slower level ups.\nNew weapons, armor, and creatures.\n3 difficulty levels: Nice Guy, Tough Bastard, Murderous Psychopath","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Iron Tower Studio","platforms":[{"id":0,"name":"PC"}]},{"id":3032,"name":"DYNASTY WARRIORS 8 Empires","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/795/795186e3e2ed285403ec68ed93682b3d.jpg","description":"DYNASTY WARRIORS 8 Empires is the latest installment of the \"Empires\" series, in which you aim to conquer ancient China using both strategy and the one warrior versus one thousand tactical action the WARRIORS series is known for.\nThe player becomes a hero from Three Kingdoms era, with the goal of unifying all of ancient China under their rule via strategy and battles!\n* The images are from an in-development build and may differ from the final version.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2330,"name":"Attractio","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7b/e7bca62abdf2ffdd794a0939a503c6b3.jpg","description":"Be the first to change gravity and solve hard deadly puzzles in Attractio! Control the 3 contestants: Dalek, Mia and Keir, who compete to win the controversial reality show. You will need dexterity and cleverness to pass throughout the challenging levels. Are you up for the challenge?\nMen and women risk their lives in live TV, desperate for a better life. Millions of inhabitants of the Solar System look forward to the new season of Attractio. The reality show where contestants solve deadly puzzles; so deadly in fact, there’s only one way they can leave there with their lives: to win.\nThis season: Keir, a man with a humble origin, looks for the monetary prize. Mia, a policewoman from mars, wants to take home the advanced technology prize. Dalek, a dangerous criminal, plays to win his freedom back. Each one will have to solve different deadly puzzles using different gadgets that will allow them to manipulate gravity.\nAttractio takes place in the amazing Entertainment Space Station (ESS), an artificial satellite orbiting Mars. This station was created specifically to broadcast Attractio, being the only place that meets the requirements to host the games of the gravity manipulation. As usual, Darius will be the host of this exciting reality show.\nAttractio is the first person shooter where you will be able to manipulate the gravity direction of different objects which, in turn, will make you rethink your expectations about physics. The implications of these slight changes of the laws of physics are considerable enough to allow you to solve each room in a variety of ways: your imagination and dexterity will be your greatest tools. Nevertheless, you’ll be facing some of the most challenging puzzles you’ve ever come across.\nThroughout the game, you’ll play as the contestants of the reality show, Mia, Keir and Dalek, each one with different puzzles and gadgets designed for their particular abilities.\nMia: The most renowned detective of Mars will use gravity boots that will test her physical abilities and allowing her to change her own gravity so she can avoid the deadliest traps of Attractio.\nKeir: From the poorest region of the Solar System, Keir will use the Shifter gun in Attractio which will allow him to manipulate the gravity direction of certain objects in Attractio.\nDalek: The ruthless criminal who will try to win his freedom back in Attractio, using both the gravity boots and the shifter gun inside the most complex rooms of Attractio.\n¿Who will emerge victorious? In order to get to know them you will uncover their controversial pasts and save them from a certain death in Attractio, the most watched reality show in the Solar System.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":1328,"name":"EA SPORTS NHL 17","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2c/c2cf05037231f0286f0b443e2a62b7da.jpg","description":"Shape Your Legacy in NHL® 17, the biggest and most exciting EA SPORTS NHL game to date.\nOwn Every Zone with more end-to-end control with Authentic Goalies, all-new Net Battles for offensive and defensive zone play, and new goal celebrations that capture the excitement of scoring the biggest goals.\nLive your hockey fantasy in all-new modes, including The World Cup of Hockey, or run the business in Franchise Mode. Take your EA SPORTS Hockey League team on a journey with a new Player Rank System and unlock customizable items and arenas and immerse yourself into Hockey Ultimate Team.\nWhether you compete online for glory, live out your hockey fantasy in offline modes, or hit the ice for exciting and innovative hockey gameplay - NHL® 17 lets you Shape Your Legacy on and off the ice.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1-4 players\nNetwork Players 2-12\n30GB minimum save size\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCONDITIONS AND RESTRICTIONS APPLY. SEE https://www.easports.com/nhl/game-and-offer-disclaimers FOR DETAILS.\nNHL, National Hockey League, the NHL Shield and the word mark and image of the Stanley Cup are registered trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2016. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":743,"name":"Orbital","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f0/3f02339575b806f2f667d958ff5cdbfd.jpeg","description":"The game is a simple but exciting arcade. You have to control the satellite, one of the few planets in the solar system. Destroying enemies you get points, thereby to set new records!\n#Nice graphics\n#Good soundtrack\n#Simple but addictive gameplay\nThe game is perfect after a hard day!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ardi Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":34973,"name":"Command & Conquer: Generals - Zero Hour","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a5/2a5d4cadafa4b926eabd1388b330bc48.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":27988,"name":"LEGO DIMENSIONS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42c/42c6f4f40410a311e19f09a7c5b8a75f.jpg","description":"The LEGO® DIMENSIONS™ Starter Pack has everything you need to set out on\nepic mash-up adventures filled with iconic worlds and unlikely allies as\nyou've never seen them before. There's a whole multiverse of puzzles to\nsolve, and challenges and enemies to face, and when you’re ready for\nmore, collect level, team & fun packs to expand your collection.\n\nThe LEGO® Dimensions™ Starter Pack is all players need to embark on a\nfantastic quest. Included in the LEGO Dimensions Starter Pack:\n\nLEGO® Dimensions™ videogame\n\nLEGO® Toy Pad\n\nBricks to build the LEGO® Gateway\n\n3 LEGO® minifigures (Batman™, Gandalf™, and Wyldstyle™)\n\nLEGO® Batmobile vehicle","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"}]},{"id":23658,"name":"Doodle God Blitz","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c97/c979c98369e1466ec4aa02b63a7e1efb.jpg","description":"Check Out More Doodle Gameshttp://store.steampowered.com/app/598940\nhttp://store.steampowered.com/app/608760\nhttp://store.steampowered.com/app/538060/\nhttp://store.steampowered.com/app/431640/\nAbout the GameDoodle God is an addicting puzzle & world building game where players use logic and ingenuity to create the entire universe.\nStarting with the basic elements of earth, wind, fire and air players can build a world filled with locomotives, Dragons, skyscrapers, Aliens and more. In Planet mode players will discover a challenging new way to develop the universe of their dreams.\nAs you create elements watch the world come to life as new combinations create new elements, life-forms and objects that propagate the planet's surface.  But beware with great power comes great responsibility. Players need to be aware of unintended consequences like a zombie plague and other catastrophes! Test your divine knowledge and challenge your friends online with the new Tournament mode. Each time players successfully create a new item they’ll be rewarded with wit and wisdom from some of the greatest philosophers and comedians of all time. Unleash your inner god with Doodle God™ for Steam!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JoyBits","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19975,"name":"Time Mysteries 2: The Ancient Spectres","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df7/df78664e71a246401d9fc053428265f8.jpg","description":"It is the year 1830, and a young governess named Ester has just received a letter that will change her life forever.\nThe message from her aunt tells Ester that her parents, whom she never met, left her an inheritance – a mansion in London. But when she goes there, it turns out that the residence is abandoned, run-down, and haunted.\nWhen she explores the mansion, slowly learning her family’s secrets, she discovers that for many centuries, members of her family have been investigating the phenomenon of time travel. Soon Ester finds a strange object that confirms the extraordinary legacy of the Ambrose family. This is how her exciting journey, which will lead her to places – and times - she had previously only seen in dreams, begins.\nDuring her adventure across time and space, she will discover forgotten artifacts, meet extraordinary beings, and experience supernatural events. Trying to unravel the secrets of her heritage, Ester grows ever more entangled in an ancient struggle between the wizard Merlin and his rival, Viviana.\nWill the young governess change the course of history and solve her family’s ancient mystery?\nFeaturesA portable time machine – change the history according to your will!\n21 diverse mini-games and 16 hidden-object scenes\n52 beautiful, hand-painted locations\nTime manipulation puzzles\n7 intriguing heroes, each with their own secrets\nPossibility to re-play 9 mini-games and 16 hidden-object scenes\nAdditional second adventure\nGame world encyclopedia\nUnique wallpapers from the game (Steam exclusive)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]}]