[{"id":15987,"name":"Secret Files: Tunguska","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3c/d3cbe235f6c433c9f8d10163db54af71.jpg","description":"Unravel one of the greatest mysteries of our time!\n\nOn the 30th June 1908 an explosion with the combined energy of 2000 Hiroshima bombs rocked the region of Tunguska in Central Siberia and felled over 6,000 square km of trees. The explosion could be heard from as far as 1,000km away. Eye witnesses saw a long object fall from the sky which was illuminated in a blue-white light. A 20km high column of light was followed by a black-mushroom shaped cloud. It has been reported that for the next three nights it was so bright across all of Europe that you could read a newspaper outdoors.\n\nTo date it still remains a mystery as to what happened that day, and now YOU will find yourself immersed in a race against time to uncover a global conspiracy that will carry you to the far reaches of the world. Prepare to have your detective skills challenged like never before in the dark world of cover-ups and corruption.\n80 highly detailed and atmospheric pre-rendered backgrounds\nAtmospheric weather effects (e.g. rain and snow)\nCinematic full screen videos for intro and cut-scenes\n25 beautifully rendered 3D characters to interact with","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Animation Arts","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":343593,"name":"Batman - The Telltale Series - Episode 1: Realm of Shadows","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c64/c6468dd8debde0e900313e85e0628ee6.jpg","description":"Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. In this gritty and violent new story from the award-winning creators of The Walking Dead – A Telltale Games Series, you'll make discoveries that will shatter Bruce Wayne's world, and the already fragile stability of a corrupt Gotham City.\nYour actions and your choices will determine the fate of the Batman.\nDownload Episode One of Batman: The Telltale Series, a five part episodic game series from the creators of The Walking Dead: A Telltale Games Series, The Wolf Among Us, and Tales from the Borderlands.\n","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Telltale Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":28551,"name":"Trials Evolution","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f6/9f6d4bcec6f90c222f8c2389aa3cd4b9.jpg","description":"(Online Interactions Not Rated by the ESRB) It's survival of the fastest with Trials Evolution! Your favorite physics-based motorcycle racer is back in a brilliant new outdoor setting. Ride in real-time multiplayer with 2-4 players, either locally or through Xbox LIVE. Enjoy a deep, rich single player career with 50 brilliant tracks, challenging unlocks, and tricky achievements. A massive, powerful track editor lets you build the track of your dreams and easily share it with the world. Or simply download top-rated tracks from around the world, using the all-new Track Central. Customize your bike and rider with awesome gear and unique parts, enjoy unique skill games, try ghost racing, beat your Friends' scores, and more! Don't miss the madness!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Redlynx","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":25282,"name":"The Simpsons Game","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2dd/2dd6e0715c8cbaa1e107a88aa5aa612f.png","description":"THE SIMPSONS GAME features a hilarious, sprawling, and mind-busting\nstoryline crafted by the TV show's Emmy Award-winning writers. The\naction-comedy will also feature the full cast of voice actors from the\nTV show who will reprise their roles for the game.\n\nIn THE SIMPSONS GAME, Homer, Marge, Bart, and Lisa use exciting, all-new\npowers to save the world from rising chaos. To help the Simpsons, gamers\nat home must journey through all of Springfield (as well as vast worlds\nbeyond!), vanquish an amazing array of villains, and fight their way\nthrough parodies of multiple popular games.\n\nAction-comedy with hilarious, sprawling, and mind-busting storyline\ncrafted by TV show's Emmy Award-winning writers\n\nFull cast of voice actors from the TV show and movie lend to the\nultimate authenticity and realism of the game\n\nPlay as all members of your favorite dysfunctional TV family as you\nbattle to save them from video-game purgatory\n\nHomer, Marge, Bart, and Lisa use exciting, all-new powers to save the\nworld from rising chaos\n\nJourney through all of Springfield, vanquish an array of villains, and\nfight through parodies of multiple popular games","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":23033,"name":"Warhammer: Shadow of the Horned Rat","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68f/68f68159604e04f01059ef94dadeb542.jpg","description":"Warhammer: Shadow of the Horned Rat follows the adventures of Morgan Bernhardt, the commander of the Grudgebringer mercenaries and leader of the Grudgebringer Cavalry regiment. Once a star student of the great Gunnery School Officer Academy, Bernhardt’s love for gold and glory had him cast out of the school and into the welcoming arms of the mercenary life. With a fine steed to carry him to battle, his dwarven-forged, magical sword Grudgebringer in his hand and an army at his helm, he and the Grudgebringers have travelled the length and breadth of the Old World, bringing honour and fame to his house. However, an insidious plot by the Skaven Grey Seer, Thanquol and his accomplice, Orc Warboss Urgat Rip-Eye, is uncovered by Bernhardt, forcing him and his troops to defend the Empire. With Paymaster Dietrich ensuring that your efforts are justly rewarded, join Bernhardt and the Grudgebringers as they enter the maelstrom of war and fight for glory, the Empire and, most importantly, gold!\nAs the first ever video-game adaption of the Warhammer world, Shadow of the Horned Rat not only brings the table-top adventure to life in this real-time strategy, but adds its own story to the wondrous mythos. With over 25 individual troops to choose from, you can create and lead your own army to battle across the many fields of the Old World. You can also forge your own story in this adventure, choosing to follow the main story and defeat the Skaven and Orc forces, or accept the work of the many patrons Paymaster Dietrich can procure. With increasing difficulty and expansive lore, this adaptation is a fine first-step for the franchise and a must-play for both RTS and Warhammer fans alike. Lead Imperial forces against the Skaven and Greenskin Forces and defend the Empire from their nefarious plot\nCo-ordinate your army and strategise victory in real-time\nCreate your own legacy - Follow the campaign and uncover the Skaven plot, or complete your patrons’ missions and earn fame, glory and gold\nFully customise and augment your army, with over 25 troops to choose from","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Mindscape","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":17456,"name":"Surfingers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c18/c1839c9150aa6e62abea8bbb2bfc0b00.jpg","description":"Surfingers – The new game by the creators of the cult Timberman.\nAfter a spectacular success of the Timberman game (over 30 million downloads worldwide) , Digital Melody Games' new arcade game is ready. It's all about surfing this time.\nSurfingers is a arcade game with controls based on up-and-down movement. The player must change the height of the wave in a dizzying pace, bypassing many obstacles (ships, balloons, rocks, trees, bones, pyramids etc) and try to get as long as possible without touching anything.\nThe game offers surfing through various worlds, including: ocean, snow, desert or hell. There are over 20 characters available to choose from, which can eventually be unlocked for the achievements or gained stars.\n\"The graphic design of the game was inspired by 1970s California, colorful posters and the Surf Rock music genre. In addition, we used a variety of colors to make the game more enjoyable\"\n\"That was close, we would never have released Surfingers. You need to prepare many prototypes of the game to find the perfect gameplay. I remember that we have reached the milestone in that single moment we introduced the diagonal waves and changing worlds. Thanks to these changes the game got incredible playability.”\nGame features:\nOver 20 characters to unlock\nSurfing music and graphic\nWorlds full of dangers\nInnovative gameplay\nGABEN surfing at 100 bill! What could be more cool then that!!! Come on!!!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digital Melody","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":17100,"name":"Champions of Regnum","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/570/5709d231e1d32c1817cf88b44388064a.jpg","description":"Champions of Regnum, is a free to play MMORPG focused in epic Realm versus Realm (RvR) and\nPlayer versus Player (PvP) battles.\nChoose your Realm and engage in the most dynamic player driven battlefield available on any MMO. Fight for the Alsius Empire, protect the woods of Syrtis or avenge the Brotherhood of Ignis.\nChampions of Regnum is a deep and engaging old school RvR MMO developed by an independent studio.\nIt’s not a grindfest, it’s all about large scale player vs. player gameplay, it’s FREE! and runs on Windows, Linux and Mac natively.Join the Battle Now!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"NGD Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":484875,"name":"Crucible Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da6/da6f74170b9620b1cdab79929d53a3c2.jpg","description":"Join our closed beta and help forge the future of Crucible! You can participate in our weekly playtests to try out the most recent changes and give feedback to help us improve the game.  Learn more and sign up for the closed beta here.Beta Gift\nAs a limited-time thank-you to players who are joining us in beta, if you download the game and log in during Pre-Season, you’ll receive 1,000 Credits for use in the in-game store! Learn more.Welcome to Crucible\nCrucible is currently in Closed Beta, so we’ll be adding core features and improving the game to prepare for the launch of our first major season in the future.\nCrucible is a team-based action shooter driven by the choices you make. Each match in Crucible is a fight for survival and control. Not only will you be going toe-to-toe with your fellow competitors, but you’ll have to adapt and overcome all the challenges the planet itself throws your way. You and your teammates will need to work together to take down alien creatures, capture objectives, and pursue your opponents in search of victory.\nHUNT LEVEL ADAPTWhether you prefer to bring an axe to a gunfight, think that the best way to solve problems is by lighting them on fire, or want to keep your options open with multiple weapons, there’s a hunter to suit your playstyle. Crucible's 10 hunters each come with their own unique set of abilities—how you use them is up to you.\nBegin every match on a level playing field. Each hunter has their full array of weapons and abilities at their disposal from the word “go.”\nBefore each match, you’ll select which upgrades to unlock as you level up. With these upgrades, you can define how your hunter fights. Bring along additional utility and tricks or go all-in on your damage output—it's up to you.\nEssence is a strange substance with incredible properties, and it's the object of all the commotion on the planet Crucible. You can get it from opponents and creatures you kill, or by controlling objectives. As you collect Essence, you'll level up.\nYou'll get access to your pre-selected upgrades with each of your first five levels. After that, more levels mean more power and health.\nUse your abilities and your wits to master the environment and battle conditions around you. Learn the lay of the land and use it to your advantage. Capitalize on events, grab all the Essence you can, hunt down the opposition, and claim victory.\nHeart of the Hives\nHives are lethal drone-spitting terrors that spawn across the battlefield. Capturing the hearts they leave behind as they die is your key to victory. Each match is a four-on-four fight to be the first team to capture three hearts.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Relentless Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18396,"name":"Dracula's Legacy","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b3/9b3528b9cc7d83a08d76ac706c946ba5.jpg","description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other adventures:http://store.steampowered.com/app/431260/\nhttp://store.steampowered.com/app/497400/\nTry other adventures:http://store.steampowered.com/app/326180\nhttp://store.steampowered.com/app/326190\nhttp://store.steampowered.com/app/347430\nAbout the GameHaunted by frightening dreams about her forgotten past, Isabella, along with her fiancé, were able to decipher one clue from the depths of her memory that leads them to an old ghost town. While exploring, they encounter a terrifying creature and the pair are separated. Help Isabella traverse dungeons inhabited by deadly vampires to reach the city of lost souls and rescue her fiancé!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10113,"name":"SpellForce 2 - Demons of the Past","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99f/99f25e78d6f3b9db7208dab329df0988.jpg","description":"Demons of the Past is the epic new chapter of SpellForce, the unique blend of RPG and RTS. Experience this worthy conclusion of all previous games in the SpellForce-series. Check out the new single player campaign with 25+ hours of gameplay, in which nearly all races are playable – Pact, Clan, Shaikan…The StoryZazhut is free, and his wrath now descends upon Eo. The Shaikan are hopelessly outnumbered – but you, an Elder of the Shaikan, are not willing to give up hope. Joined by companions old and new, you head out towards the Realm of the Gods, for only they seem able to oppose Zazhut's power.\nHowever, the Gods play a game of their own, and don't seem to be inclined to help you... The fate of Eo now rests within your hands; face the demons of the past, collect information about Zazhut and banish evil from this world, once and for all. Much has changed in time... are your foes as dangerous and your friends as faithful as they used to be?Key Features5 totally new worlds – 8 worlds in total\nMany side quests and optional gameplay (Around 50 main quests and around 40 sidequests with lots of subquests)\nA gripping story that continues the narrative of all previous SpellForce games\nA lot of new items and item sets (used as rewards, loot and at merchants), new spells, new weapons\nVarious Single- and Multiplayer modes: Campaign, Free game, Free game Coop, Skirmish, Domination\nFirst SpellForce series appearance: Survival multiplayer mode up to 3 players with new Boss Fight mode\nMajor Engine & Technical Re-Design/Re-Work\nChoose between a Female and Male Avatar\nStand Alone Add-On, no previous SpellForce titles are required to play Demons of the Past","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":269475,"name":"The LEGO Movie 2 Videogame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2bd/2bd5f39a1997000497d674c9cabb9e28.jpg","description":"The alien monster invaders have left Bricksburg in ruins and taken Emmet’s friends!  It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System.  Journey into outer space, discover new worlds, and test your Master Building skills.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":60862,"name":"Gloomhaven","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32c/32cfc18e11d9030b5945f8102d2e6488.jpg","description":"We warned you!\n\nWhether you are drawn to Gloomhaven by the call of adventure or by the call of gold glimmering in the dark, your fate will surely be the same. Flaming Fowl and Asmodee Digital have teamed up to make you once again live through the epic journey of Gloomhaven… digitally!\nOur development minions are working days and nights so that you can discover or rediscover this one of a kind tactical, turn-based RPG.\nIn this rogue-like dungeon-crawling adaptation of the famous board game, you will journey through terrifying randomly generated dungeons, fight against increasingly horrific and powerful foes…or die trying.\n\nThe art of dungeon-crawling:\n\nOur game designers are channeling Gloomhaven’s quintessential spirit day after day: deep tactical mechanics, battle preparations… and also dying.\nIn Gloomhaven, you play as a team of mercenaries on their own personal quests to go conquer a world of darkness and trials. Choose your group members wisely, because in the turmoil of battle you can only rely on your wits, skills and spells, to fight your way through the putrid dungeons and forgotten ruins.\nIf you survive your perilous journeys, you might have the opportunity to expand your team, improve your spells or fill your coin purse. You’ll need these things to overcome the hordes of malicious beasts, demons, and whatever else may find itself in your path towards victory and domination of all. No decision should ever be made lightly, so choose with caution!\n\nFeatures:\n\n* Discover the digital adaptation of Isaac Childres’ ultimate strategic board game.\n* Face countless enemies in the dungeons of this turn-based rogue-like game with addictive and tactical gameplay.\n* A huge variety of hero classes are available so that you can create your own custom group of formidable champions!\n* Each hero class may be played in various ways. Do you prefer the Cragheart to be soaking up damages on the frontline or crushing your enemies in a crater? It’s up to you to choose your specialty.\n* Don’t forget to consider all of your characters’ skills to create a truly epic team!\n* Also, please do not feed the development minions after midnight. Who knows what could happen?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Flaming Fowl Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18348,"name":"ProtoGalaxy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a1/7a1655e29a678ebbcaf7029f01b7433b.jpg","description":"Earth is under siege!\nA mysterious and powerful alien race has come to enslave the entire galaxy, and your fleet is humanity's last hope. You must put an end to the attacks and rebuild a home for the survivors. With the invaders in hot pursuit, and the dangers of the unexplored at every turn, do you have what it takes to forge a new galaxy?\nKey features:Team up with up to 4 players and explore the galaxy.\nEnjoy challenging action, smart puzzles, and deep adventure.\nCustomize your ship with a huge selection of parts.\nUse physics to solve puzzles or defeat your enemies.\nCreate your own galaxy using the built in editor.\nDownload new galaxies from other players for endless gameplay. Proto Defense DLC\t\t\t\t\tSource Studio is pleased to announce it's first Arcade map: Proto Defense!\nProto Defense is the first online multiplayer co-op turret defense game for ProtoGalaxy. Team up with your friends to defend Earth from alien invaders in this unique turret defense experience.\nKey features:Team up to defend Earth from alien invaders.\nPick from a big selection of turrets.\nReposition your turrets at any time to deal extra damage.\nTake down huge bosses.\nCompete in leaderboards for the highest score.\nTackle 8 new challenging achievements.\nBuilt using the ProtoGalaxy Editor.M","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Source Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18285,"name":"Trainz Simulator 12","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad2/ad2a1fe0a388a47c0eb10cd886f37170.jpg","description":"Build And Operate The Railroad Of Your Dreams....With Your Friends!\nTrainz Simulator 12, Now With Multiplayer\nTS12 includes the most exciting new feature in the history of Trainz. The players have asked for it and we have delivered Trainz Multiplayer. Now players from all over the world can build, play and operate railroads together!Key Features\nFeel what its like to put your hands on the controls of powerful locomotives as they steam through towns, cities and rolling countryside\nDesign and Build your own railroads with Trainz Surveyor and access hundreds of thousands of assets from the Trainz Download Station\nShare your enthusiasm with other rail fans as your combine your efforts to operate a working rail line in the new Trainz Multiplayer.\nSatellite View - Zoom all the way out and view your railroad from satellite distance\nMore realistic trees with new SpeedTree Assets\nBackward compatible with TS2010 contentNew Routes\nSouthern China\nECML Kings Cross - Newcastle\nBalezino - Mosti\nDebrecen - Nyiregyhaza\nMojave Sub Division\nMunicipal transit railway\nNorfolk & Western - Appalachian Coal\nNortheast Corridor - Wilmington To PhiladelphiaPlay and Interact with other Trainz players from all over the world\nDrive Steam, Diesel and Electric Trains (and even trams, boats and cars)\nOperate a complete working rail line with interactive industries\nBuild and customize your own living railroad\nShare your creations and your passion with other rail fans","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"N3V Games","platforms":[{"id":0,"name":"PC"}]},{"id":11102,"name":"Memoir '44 Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ac/1ac24d9f94cc5340a9af6295dee68361.jpg","description":"Days of Wonder’s best-selling World War II board game is now available as a turn-based multiplayer online game on Steam!\nThis fun, easy-to-learn, wargame lets you relive all the greatest battles of World War II in quick, one-on-one multiplayer confrontations. The scenarios are short and varied, forcing you to adapt your skills to the troops and cards at hand, and your command style for the Nations you play. Countless achievements and new medals can be gained as you progress through the ranks. An active community with tens of thousands of Online fans awaits you, 24/7!\nDownload and try the game out for free! When you first enroll and download the game, your account will be automatically credited with 50 Free Gold Ingots (Memoir ’44 in-game currency). That is enough for hours upon hours of free play in dozens of hard-fought battles. Once you start progressing through the ranks (typically by around the time you make it to First Lieutenant), you will be offered the opportunity to purchase a variety of Gold Ingot packages that fit all play styles and budgets, with some starting as low as $5, using your Steam Wallet.\nKey Features\t\t\t\t\t\t\t\t\tOver 40 historical WWII scenarios (new ones added regularly)\nTurn-based, card-driven war game with various units and nations skills\nEasy-to-learn but rich, thoughtful tactical gameplay\nQuick to play: each battle takes between 15 to 20 minutes\nExtensive video tutorial and in-game help\nAdvanced A.I. for solo training\nComprehensive Officer Ranking and Achievements system\nMultiplayer gaming without the wait – you will always find an opponent, 24/7\nFriendly community of players, made of fans of strategy games and History buffs\nAccurately reproduces the fun of the best-selling Memoir ’44 board game\nFree-to-try download, affordable pay-to-play model using your Steam Wallet once you run out of Free Gold Ingots\nSeamlessly integrated with Steam: no sign-up, use your Steam ID directly\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Days of Wonder","platforms":[{"id":0,"name":"PC"}]},{"id":9873,"name":"Cossacks 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/149/149e4ff4a44f05dc8ea0cbd43153f8e3.jpg","description":"Return of the legendary Cossacks! The sequel of the award winning strategy series.\nLeaning on the history of the 17th and 18th century, the real time strategy game awakens colossal mass battles with up to 32,000 soldiers simultaneously on the battlefield.\nThis remake of the classic game, that originally launched in 2000, contains all of the elements that distinguish the successful Cossacks games and combines them with contemporary 3D-graphics. Cossacks 3 provides the player with infinite tactical options, including not only the construction of buildings, the production of raw materials, but also the broad selection of various units and the influence of the landscape.\n20 nations, 120 different unit types, 100 research opportunities, and over 220 different historical buildings are available to the player. Besides the battles ashore, players can build an armada and attack their enemies at sea. Cossacks 3 offers five historic single player-campaigns and up to eight players can fight each other in multiplayer-mode on one map. The player can forge alliances with or against others as well as challenge the computer. Randomly generated maps provide endless variations and can be adapted to the gamer’s needs.\nGame features:\nGrandiose battles of up to 32,000 soldiers on the battlefield\n20 playable nations\n100 research opportunities\n220 different historic buildings\nBattles ashore and at sea\nFive singleplayer historical campaigns\nInfinite variations of battles on randomly generated mapsAs a free DLC all the players will receive 8 additional playable nations with the unique music main themes.\nInformation about Digital Deluxe Edition (no longer available for purchase):\nDigital Deluxe - is a game edition, that contained both base game and 4 previously announced DLC, which are getting consequent releases during 1 year after Cossacks 3 release, along with few great bonuses.\nWe have already released 4 promised DLCs: Days of Brilliance, Rise to Glory, Path to Grandeur and The Golden Age. They include:\nEarly access to new nations:\n[Days of Brilliance] Denmark\n[Days of Brilliance] Netherlands\n[Rise to Glory] Bavaria\n[Rise to Glory] Saxony\n[Path to Grandeur] Hungary\n[Path to Grandeur] Portugal\n[The Golden Age] Switzerland\n[The Golden Age] Piedmont\nCampaigns:\n[Days of Brilliance] Pro Fide, Lege et Rege\n[Rise to Glory] Huge gambles and great achievements.\n[Rise to Glory] The Lion of the North.\n[Path to Grandeur] St.Jacob with us, Spain!\n[Path to Grandeur] In the Service of the Grand Vizier!\n[The Golden Age] Oranien bovem!\nSingle-player missions:\n[Days of Brilliance] Konotop\n[Days of Brilliance] Clash at Nordlingen\n[Days of Brilliance] Stuart Restoration\n[Days of Brilliance] Peasants' War\n[Days of Brilliance] Landing in Brittany\n[Rise to Glory] Second Northern War\n[Rise to Glory] Great Northern War\n[Rise to Glory] Franco-Dutch War\n[The Golden age] War for Brazil\n[The Golden age] War in the Caribbean\n[The Golden age] The Portuguese War of Independence\n[The Golden age] Siege of DunkirkHistorical battle:\n[The Golden age] Battle of Nieuwpoort (1600)\n[The Golden age] Battle of Pyliavtsi (1648)\n[The Golden age] Battle of Prostki (1656)\n[The Golden age] Battle of Saint Gotthard (1664)\n[The Golden age] Battle of Villaviciosa (1710)\n[The Golden age] Battle of Sheriffmuir (1715)\n[The Golden age] Oran (1732)\n[The Golden age] Battle of Soor (1745)Environments:\n[Rise to Glory] Winter maps\n[Path to Grandeur] Desert maps\nDigital Deluxe Edition owners would also receive soundtrack in lossless quality (wav format).\nDigital Deluxe Edition is no longer available for purchases. Its owners have already got 4 DLC for free, as we`ve promised.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"GSC Game World","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":38067,"name":"StarCraft II: Wings of Liberty","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f7/5f7191716faebcf102a357c5c2889394.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Desconocido","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28774,"name":"Test Drive Unlimited","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7df/7df2ab3d35eb5b6b89ae06b7be9e9b2f.jpg","description":"(Online Interactions Not Rated by the ESRB) This game supports English, French, and Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". Take part in MOOR: Massively Open Online Racing. Logon to a persistent world and live the lifestyle you've always dreamed of with the most  exclusive car line-up. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Eden Games","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":22003,"name":"The Archotek Project","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0e/c0eedcbffda05d872e98f32f9aac12fc.jpg","description":"The Archotek Project focuses on a multiplayer experience, giving you the chance to play with other people on dedicated servers.\nPlay as 1 of 9 dinosaur species and explore various exotic locations on a map of your choice, role-play with your friends and create your own stories or stick to the basics of PvP and get involved in deadly fights with other players.The Early Access Game Includes\n3 Different Maps\nSanctuary\nA massive map, which includes several tropical islands.\nGreen Valley\nA small map for players, who don’t like exploring and just want to meet up with other people or have less powerful PC builds.\nAran Desert\nA medium sized map, which represents a large desert surrounded by canyons and several oases.\n9 Playable Animals\nArchaeopteryx, Coelophysis, Deinonychus, Gallimimus, Psittacosaurus, Stegosaurus, Styracosaurus, Triceratops, and Tyrannosaurus.\nGame Modes\n“Be the Dinosaur”\nPlanned Content in Full Game\nGame Modes\nEcosystem:\n‘Ecosystem’ is a game mode focused around the creation and maintenance of animals in an environment designed by the player. Unique items can be placed to create a detailed habitat that can effectively satisfy the needs of each animal within your ecosystem by generating in-game points. Manipulating the DNA and genomes can drastically change the appearance, behavior, and stats of animals in your ecosystem.\nSandbox:\n‘Sandbox’ allows players to push the boundaries of their creativity with all of the game’s content unlocked.\nBe the Dinosaur:\n‘Be the Dinosaur’ allows players to roam free within custom or pre-made maps as one of several animal types. This game mode can be customized to support a survival experience involving a dynamic thirst, hunger and health system, AI creatures, and more.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Archotek Project Development Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18201,"name":"Agarest: Generations of War","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f8/3f874a3834e913c19900a8db450bd9e9.jpg","description":"At the dawn of time, a terrible war raged between the forces of good and evil, ending in the destruction of the world of Agarest. After their victory, the Gods of Light unified the decaying bodies of the Gods of Darkness and created a new world.\nNow, the forces of darkness are awakening once again…\n•\tChoose the path of Darkness or Light through a truly epic story, spanning multiple generations\n•\tBattle hundreds of different creatures using an array of character abilities, in a compelling and innovative turn-based combat system\n•\tBuild your ultimate army of warriors and master Extra Skills, Special Arts and Over Kills to defeat colossal enemies!\n•\tUnite with your chosen heroine and use the “Soul Breed” system to shape the fate of the next generation of heroesAgarest: Generations of War - Exclusive game features!Agarest: Generations of War includes many unique features that cannot be found in any other Strategy Role Playing Game. Here's a summary of some of the best:\nExtended Area\nExtended Area is the \"Linked Area\" set for both your party and your enemies. Each character in the game has a uniquely shaped extended area. When a character's turn comes around, all other characters in the Extended Area of the character in play (and characters in the extended areas of those characters!) can combine in an extended attack. This allows you to chain your party's attacks together, allowing access to more Arts and huge Combos!\nBlacksmith's Guild\nYou can upgrade various Items and Equipment at the Blacksmith's Guild in two different ways:\nBy Enhancement: You can enhance equipment to a maximum of Level 5. Once an Item is enhanced to Level 5, you can convert the Item, changing it into something else. This process is irreversible and the original item is lost. Experimentation reveals some great new items!\nThrough Alchemy: Alchemy allows you to combine several items to create a single, more powerful piece of equipment. While you lose the items used in the alchemy, you gain a powerful new piece of equipment and permanent access to your new item in the Shop! Alchemy can create powerful new weapons and armour but occasionally a Smithing Accident will occur and the smith will create a different item than what you expected!\nThe \"Soul Breed\" system\nAgarest takes place across 5 generations of heroes, starting with your first character, Leonhardt. During each generation you will build relationships with 3 different female party members, and at the end of each generation's story arc you must choose to marry one of the girls.\nYour choice of marriage partner is restricted to girls who've grown fond of you over a particular generation. Your options are determined by your choices during conversations at certain points of the story.\nThe girl you choose as your wife - and the strength of their relationship with you - will determine the abilities of the main character in the next generation of the story. You'll have to experience multiple play throughs to see all of the character possibilities open to you! What heroes might you create?Free DLC includedBasic Pack - A basic package. It contains 1 each of Resurrect, Capture, and Resist Direction, 2 each of Heal and Refresh, and 5 Vessels of Life.\nOffense-Defense Pack- Contains 1 Adaka, 1 Shield Sword, 1 Bird Eye, 1 Magic Frame, 1 Critical Hit, and 2 Seeds of Happiness.\nAdditional-Points Pack 1 - Contains 10,000G, 100PP, 250TP, and 500EP.\nRecovery-Skill Pack - Contains 2 Light Heals, 2 Harvest Heals, and 2 Cure Alls, as well as 1 Prayer, 1 Gospel, and 1 Counter.\nFlower Pack - Contains 1 Lucky Charm, 1 HP Up, 1 Resist Ailments, 1 Restore HP 15%, and 1 Restore AP++, as well as 2 Moonlight Flowers, and 3 Tree Spirit Souls.\nGeneral-Purpose Pack - Contains 1 Magic Blade, 1 Partisan, 1 Battle Frame, 1 Bracelet of Feicui, and 1 Item Drop Rate Up, as well as 2 Shiny Fangs, and 2 Advanced Heals.\nAdd-on Dungeon 1 - An add-on dungeon for generation 1. An uncharted adventure awaits you on the Holy Island of Erin!\nAdd-on Dungeon 2 - An add-on dungeon for generation 2. A new frontier waits to be explored along the Trum Coast!\nAdd-on Dungeon 3 - An add-on dungeon for generation 3. It's time to reunite with old friends at Magna Val!\nAdd-on Dungeon 4 - An add-on dungeon for generation 4. Embark on an exciting journey to the mysterious Tresor Island!\nAdd-on Dungeon 5 - An add-on dungeon for generation 5. Embark on one last adventure into the Deep Forest Naruvia!\nAmateur-Breeder Pack - Contains 2 Mithril Beast Claws, 2 Large Mithril Claws+, 2 Big Beast Fangs+, and 2 Stardust Fangs+. This is the week to adore your dog.\nThe Role-model Pack - Contains 1 Langguth Sword, 1 S.O.C., and 1 Extra Frame. \"Langguth Sword. A holy sword that shines with the sacred light of god.\" Wow, it couldn't be more perfect!\nCeremony Pack - Contains 1 Alfa Beld Spear, 1 Gate of Hell, and 1 Chaos Frame. These seem like something you use to open a portal to the netherworld, don't they? Be careful...\nElegant-Holiday Pack - Contains 1 Washer, 1 Man's Fist, and 1 Halper Scythe. Wash your dog with the Washer, equip yourself with the Man's Fist, and throw the Halper Scythe. Go fetch! This will add a little spice to your weekend--uh, no. Scythes aren't meant for throwing. That would be really dangerous. Seriously.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Aksys Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"}]},{"id":16414,"name":"Dracula 4 and 5 - Special","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/337/3371c8c04e0be6eb49a9d00972b60c7f.jpg","description":"Dracula 5 - The Blood Legacy\nDare you face the Prince of Darkness?\nTHE ADVENTURE\nBack at the Metropolitan Museum of Art, Ellen Cross finally unveils the Dracula Portrait that she’s brought back from Istanbul. This highly prized work is unfortunately stolen during its first night in New York. While tracking the thief, Ellen discovers new information about the Shadow of the Dragon—the mysterious brotherhood that the infamous Vlad Tepes might have been affiliated with.\nTHE HIGHLIGHTS\nUnique puzzles to solve\nHigh Definition graphics and movies\nOriginal interactive inventory system allowing you to combine and create new items\nCaptivating atmospheric sound effects and a spellbinding original soundtrackDracula 4 - The Shadow of the Dragon\nWill you be able to solve the mystery of the Dragon?\nA cargo ship carrying a valuable collection of artwork for the Metropolitan Museum of Art sinks. A few months later, one of the paintings resurfaces in Hungary.\nTHE ADVENTURE\nThe Museum sends the art restorer Ellen Cross to authenticate the painting. She would never have guessed that this mission would take her all across Europe, on the trail of the portrait of the famous prince of Wallachia, Vlad Tepes.\nThe young woman is afflicted with a serious illness. From Budapest to Istanbul, she follows the trail of the painting and plunges into a conflict between the first vampire and the \"Shadow of the Dragon\"—a secret order which dreams of producing a new lineage of creatures, free from Dracula's grasp.\nTHE HIGHLIGHTS\nHigh Definition graphics and movies\nOriginal interactive inventory system allows you to combine and create new items\nDifferent puzzles to solve\nSound effects immersives atmospheres and enchanting original musics\nFluid and intuitive Point-And-Click navigation using a 360° engine\nVoices and text in 5 languages (English, German, French, Italian and Spanish)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microids","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2777,"name":"Ninja Senki DX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ff/5ff5d987a1ba03573029649e2bee3227.jpg","description":"LeaderboardsCheck out the global leaderboards:\nhttp://steamcommunity.com/stats/405540/leaderboards\nWe recommend playing Ninja Senki DX with a controllerMac OS X users: Ninja Senki DX was tested using a XBox 360 controller. Other types of controllers might not work. We recommend using these drivers on OS X 10.9 or later (El Capitan): https://github.com/360Controller/360Controller/releases/tag/v0.15_beta3_unofficial\nAbout the Game\nOn its 5th anniversary, Ninja Senki leaps from the shadows onto Steam to become Ninja Senki DX! When Princess Kinuhime is slain by a demon, Hayate becomes obsessed with revenge! Casting aside the art of invisibility, the blue ninja unleashes the power of shurikenjutsu upon mythological creatures, demons and other adversaries in his action-filled quest for vengeance!\nFight your way through 16 deadly scenes!\nDiscover multiple endings!\nRemixed soundtrack by Patrice Bourgeault\nTest your speedrun and superplayer abilities with a brand-new Challenge mode!\nUnlock 2 secret modes!\nSupports achievements\nSupports Steam Leaderboards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tribute Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":586195,"name":"Lost Ruins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f19/f19a4ae83ee78d1ca9ac533c3b02ab88.jpg","description":"A young girl wakes up in a dimly lit dungeon without any of her memories. Surrounded by horrible, bloodthirsty monsters, she is rescued by a mysterious magician, Beatrice. With Beatrice’s help, the girl goes on a perilous journey to find answers and unlock the secrets of the Lost Ruins.\nEngage in CombatCombat in Lost Ruins is in real time, and can be both fast and methodical. Slash away at enemies, burn them to a crisp, or even deflect their projectiles back at them. Arm yourself with a variety of swords, axes and other assorted medieval weaponry, and hack monsters to pieces.Master SpellsFor those with an affinity for magic, Lost Ruins allows you to cast a variety of spells through wands, tonics, and scrolls. Burn monsters, freeze bosses, and heal yourself when in danger. Choose what works for your playstyle and make a magic casting character that’s totally your own.Choose Your AccessoriesThe world of Lost Ruins is a dangerous one and being armed to the teeth with awesome weaponry is sometimes not enough. That’s where accessories come in. Accessories are unique pieces of equipment with all manner of effects. One accessory might protect you against fire, while another might heal you when you’re poisoned. The right combination of accessories can create different strategic options for your adventure.Make Use of the EnvironmentAs you explore the depths of Lost Ruin’s dimly lit dungeons, you will find that while everything around you might bring about your death, you can also use the environment around you to your advantage. Elements within the world will react with other elements realistically. Flammable liquids will be set ablaze when in contact with lit lanterns. Ice magic will freeze bodies of water, making them dangerously cold. The more you understand the environment and how to use it to your advantage, the more dangerous you will become.\nMain Character\nA young school girl who wakes up in a dangerous underground maze with no memory of her past. Desperate to find answers to who she is and how she ended up in this place, she begins exploring the ruins.Beatrice\nA mysterious woman with incredible magical ability, Beatrice acts as the main character's guide through the lost ruins. She seems to be hiding something, however.Goblin Merchant\nThis helpful little guy works for Beatrice, and appears throughout the game to assist the main character.Sora & Mingie\nThese two girls aren't just zombies, they're also big fans of pop music idols, evidenced by the glow sticks they carry wherever they go.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Altari Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":574766,"name":"We Were Here Forever","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b2d/b2d4e1f3fc468c104efb7c5a576b4206.jpg","description":"You and your friend are trapped in the realm of Castle Rock with no way out - were you betrayed, or simply not that clever? Work together to explore and solve puzzles in this mysterious Antarctic adventure. Be aware, nothing is what it seems - there are dark secrets hidden in the shadows. Will you be able to escape?\n...starting with a message from the Jester...\nVermin of Castle Rock\nHear my whispers as you walk and talk\nYou were left behind, in my majesty's keep\nBETRAYED… or simply not that clever?\nBring me what I seek\nOr suffer-r-r… hahahahaha FOREVER!\nThe newest entry in the We Were Here series is coming…\nNo need to wait around though! Try the other games in the series: there is much to discover in Castle Rock, as you’ll see in We Were Here, We Were Here Too, and We Were Here Together.\n\nEvery game in the We Were Here Series is a standalone co-op adventure – the stories are connected but you don’t need to play them in order.\nFeature list\nTwo player co-op: the puzzles you encounter take two to solve - you both have a role to play! Communicate via walkie-talkies, and act as each other’s eyes and ears\nConnect through experience: when you find yourself in sudden danger, will you freeze, or can you keep cool and explain things clearly to your friend - before your time runs out…\nOn the edge of your seat: be part of a thrilling adventure in the lively world of Castle Rock as you and your friend take on the ancient powers aligned against you\nSpine-tingling story: there is much to discover… and much to fear - you’ve met the Jester, but is he even the most powerful being within the walls of Castle Rock?","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Total Mayhem Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":16985,"name":"Super Splatters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/419/419f2df58f3074a0f9487dabd2634653.jpg","description":"The incredibly challenging and addictive Super Splatters!\nIn Super Splatters you'll be throwing a band of semi-suicidal Splatters across the stage, blowing them up in an attempt to ignite the most impressive series of explosions possible.\nPerform awesome stunts, boost your speed on slides, invent your own moves, redirect your shots, or even merge several Splatters together - all in an attempt to reach the most spectacular finale that will amaze your in-game fans!\nWith elastic suicidal blobs and extraordinary liquid physics that actually affect the way you play, Super Splatters delivers fresh gameplay, ripe with tons of tricks to explore. Play it causally or get into the combo-hungry-fast-paced-action-packed-arcade-mayhem - it’s really up to you!Key Features:Cheerful suicidal Splatters - in colors!!!\nDiscover an arsenal of mind boggling stunts.\nPainfully challenging and positively addictive.\nCombo system that rewards recklessness.\nCrude humor.\nBatteries included.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SpikySnail","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13733,"name":"Save Jesus","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f8/1f85a1808db5318dcea88b4f78d78185.jpg","description":"In this fantasy puzzle game you need to kill Romans, by redirecting traps and keeping Jesus and his friends alive.\nSomeone is trying to murder Jesus. Disguised as Caesar with the Roman Empire by his side, an evil impostor from the future has set hundreds of deadly traps.\nYour Mission:\n- Redirect the traps\n- Kill the Romans\n- Protect Jesus & his friends from an onslaught of weapons\nFeatures:\n- Boulders, Spikes, Skulls, Fireballs, Holy Balls, Holy Cows\n- 50 Levels of increasing difficulty\n- A variety of physics-based challenges\n- Steam Trading Cards\n- Steam Achievements\nFind the impostor & destroy his Time Machine, before his machine destroys Time!\nOnly YOU can Save Jesus!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Almighty Games","platforms":[{"id":0,"name":"PC"}]},{"id":12574,"name":"Lowglow","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8eb/8eb5621068f02724586cfaf0419f93fa.jpg","description":"Lowglow - an audiovisual puzzle journey.-Beautiful graphics that play with glow and darkness like no other game before.\n-Tranquil ambient musics combined with dynamic sfx create a soothing and engaging gameplay experience.\n-As the game progresses it offers the player lots of different mechanics, keeping the gameplay fresh.\n-All of this is being tied together with a story that takes the player on a journey to save the realm of Umbralite.\n-Be warned! You will forget the surrounding world when you get sucked into the Lowglow!FeaturesThe game includes over 100 mind-bending levels. The gameplay is physics driven and plays with different gravitations, pushes, pulls and portals for starters. You are an astral light drop in the endless sea of darkness, trying to bring shine where it's needed the most.\nEach set of levels has a strong theme where the coloring, audio and mechanics vary greatly. The levels have lots of weird mechanics that are sure to keep you entertained throughout the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rockodile","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10123,"name":"Gyromancer","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41f/41f78fe67c507d7ec028fccc27035ac3.jpg","description":"Gyromancer is a Pop Cap / Square Enix collaboration. This is a Puzzle RPG.\nJoin Rivel and his companion, Laska, on a grand chase spanning twelve stages. What awaits at the end of the hunt?\nEach stage contains its own objectives, from defeating the beasts that block your way to solving puzzles before time runs out. Rivel can learn to summon dozens of the beasts he encounters, bending their power to his will. Each beast you command in battle is unique, so find the one that best suits your play style.\nHidden within each stage are a number of awards earned for completing feats great and small. Finding them all won't be easy. Are you up to the challenge?\nNew battle system based on Bejeweled Twist\nCommand unique beasts to battle your foes\nSearch the map for items, coins, and new beasts to fight at your side\nGain levels in battle and acquire powerful new beasts\nAssume the role of Rivel, a deadly mage, as he rids Aldemona Wood of a brooding darkness\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3573,"name":"Persona 4 Arena Ultimax","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9d3/9d3e5f3b9fbe3769e693c93b5b91300a.jpg","description":"ATLUS and Arc System Works team up once again to produce the next deadly broadcast on the Midnight Channel! The P-1 Grand Prix tournament is barely over, but the P-1 Climax has already begun. A mysterious red fog settles over the real world and the Persona-users assemble anew to apprehend the culprit once and for all. The time to settle accounts has come.\nThe events of Persona 4 Arena reach their thrilling conclusion in the massive story mode of Persona 4 Arena Ultimax! New playable characters, including fan favorites from the Persona 3 and 4 RPGs, add even more breadth to the already diverse roster.  Master new skills, systems, modes, and “Shadow” versions of characters, and challenge the world’s best players in online matches.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Atlus","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":2742,"name":"Gunscape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/691/691d1a0def09672fc1053cfca40c58fb.jpg","description":"Inspired by the first-person shooters of the past that we loved, we're taking all the most memorable elements and putting them in a toolkit to be used and combined however you want. At its heart, Gunscape is an FPS construction kit. It's a game that lets you go wild with your creativity in a pumping action sandbox! Gunscape does this by providing easy-to-use tools based on a block-placement interface everybody's already familiar with to create single-player campaigns, co-op maps and multiplayer arenas and the functionality to share your creations with your friends. Don't like building stuff and just want to blast your way through hordes of monsters or duel with other players? Maps can also be shared, played and voted on by the whole world, so you'll always have new levels at your fingertips!Standard Edition\nGet access to all main game themes with the Standard Edition of Gunscape! It includes blocks, props, enemies, avatars and weapons from the Bathyscape, Bierenstein, Final Fortress, Electro, Relay, Too Rockin’, Siegecraft, Orifice and Tremor.Gold Edition\nGet access to all current and future game content with the Gold Edition of Gunscape! Initially it includes blocks, props, enemies, avatars and weapons from the Standard Edition plus the Seasonal, Alienware and Gold theme packs. Also receive the Gunscape Original Sound Track DLC! The first extra DLC will be the Seismic pack, coming in Q2 2016 and this will be available free of charge to Gold Edition purchasers.World Building\nThe game is organised into themes taken from the entire genre of FPS games, from the early classics to the modern triple-A stealth and war shooters. Each theme set contains unique world building blocks, player models, enemies (and bosses!), music tracks, skyboxes, special level elements (like traps and teleporters) and--of course--GUNS (plus bombs, bats, swords, flamethrowers, chainsaws, rocket launchers and much, much more. 38 weapons planned so far!). Assets from different sets are meant to be combined freely when building your worlds and the selection of content contained in each one has been carefully selected and planned out to avoid redundancy and to represent the truly iconic parts of the game it was inspired by.\nIt's important to us that anybody should be able to create their own levels. In the days of Doom and Build engine games level editors were simple enough that it didn't take long to learn how to create a whole new adventure for the player. The truly skilled could create impressive feats of architecture, but the rest of us could still create enjoyable challenges thanks to tightly-designed game engines that focused on making the core gameplay pure fun. In a game like that it doesn't matter how many times you test and tweak the layout to make your map the best it can be, or how abstract the level becomes as a result. This is the driving philosophy behind Gunscape. It's also the reason we've chosen to start by polishing the multiplayer experience in the pre-alpha demo, as we feel this is one of the best ways to develop and tweak the core gameplay.World Sharing\nOf course, there's no point in creating great play experiences if nobody else gets to play them! Gunscape has a server to share your creations and the game has a built in map browser with filtering and voting system, so that anybody can have full access to every public player-created level, regardless of which theme packs were used to make them. The available demo (more on this later) has game levels we have put together and we'll continue to add more as we complete new content to help show how much potential there is for you to create some truly amazing things with Gunscape!Game FeaturesSolo, split-screen and online co-operative multiplayer level creation! Build maps at your own pace or invite friends to help out! Jump in and out of action mode while editing to test your level on the fly or just to blast one another.\nSingle-player campaign mode: play or create a sequence or branching tree of levels with or without a story. Build a whole self-contained adventure or a gauntlet of fearsome challenges.\nCo-op mode: invite one or more friends to tackle a dedicated co-op map with you or take a single-player map and crank up the difficulty.\nMultiplayer arenas: build a map with multiple spawn points and powerups and invite your friends or host a public game for some brutal online action using one of many multiplayer modes, including classics such as free-for-all and team deathmatch, capture the flag variants, king of the hill and domination/point capture modes and different tag/infection variants. We plan on including a lot of these, and to continue adding more, including flexible objectives like race to the finish which could be used to build multiplayer rocket jump courses or other types of challenge maps such as a competitive adventure through trap-filled dungeons, or hunter which awards points for killing monsters so you can create your own MP dinosaur safari.\nCross-platform multiplayer: optional where it counts, but great to have for cross-platform co-op!\nGlobal and persistent map sharing: anyone can play the levels you share regardless of platform\n8 multiplayer match modes","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"LEVEL 77","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":440072,"name":"Black Book: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/180/180b7362cc5ae93a90bee70194916a0a.jpg","description":"Black Book: Prologue is a free standalone version of the game, featuring an essential part of the story - the First Day of Vasilisa becoming a witch.\n\nWelcome to the mysterious, yet intriguing world of Black Book - an Adventure game mixed with deck building turn-based combat, inspired by the likes of Slay the Spire.\n\nIn the game, you’ll step forth into the rural countryside as Vasilisa - an apprentice sorcerer, trained in witchcraft. Travel across the lands as you aid common folk by persuading - and sometimes battling - the otherworldly creatures of Slavic myth.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Morteshka","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28807,"name":"Too Human","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/938/938dcd4a510cfbd8889ecc3403c26fa5.jpg","description":"As the Cybernetic God Baldur, you get thrust into the midst of an ongoing battle that threatens the existence of mankind. An ancient machine presence has forced the Gods hand. In the first of a three part trilogy, Baldur is charged with defending mankind from an onslaught of monstrous war machines bent on eradication of human life. It takes more than brawn and raw strength to supplant the machine hordes. Utilize a sophisticated blend of seamless melee and firearms combat to vanquish foes close and far. Feel each punishing blow through advanced visual effects. Intuitive combat provides new level of accessibility: Perform Baldurs elaborate and complex combat maneuvers through the press of a button and chain together rapid-fire combos with ease. Through the use of an intuitive combat system, Too Human provides gameplay that is easy to learn and rewarding to master and introduces combinations of weapons combat on a high level. The story chronicles the ongoing struggle between Cybernetic gods, machine giants and mortal men on a massive scale never before seen. Play the role of a cybernetic god charged with protecting the human race against a relentless onslaught of machines.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Silicon Knights","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":24933,"name":"New Super Mario Bros.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ada/ada90672691bd75745ee88cd43d49657.jpg","description":"Princess Peach™ has been kidnapped by Bowser Jr.™! Run, jump, and stomp\nyour way across eight worlds as you smash through your foes and save the\nday! Take a break from the adventure to play minigames in four\nfun-filled categories!\n\nWhen lightning suddenly strikes Peach's castle, Mario goes to\ninvestigate the disturbance. But Bowser Jr. seizes the opportunity to\nsneak up from behind and grab ahold of Peach! It's up to Mario to save\nthe day! Run, jump, and stomp your way through raging volcanoes,\ntropical islands, snowcapped peaks, and unimaginable challenges. Grab a\nMega Mushroom and grow to incredible proportions, or smash through your\nfoes in a blue Koopa shell. Collect Star Coins to unlock helpful items,\nbackgrounds, and even new paths on the map.\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"}]},{"id":18289,"name":"Runespell: Overture","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/554/554b2290d599ca298f9564828a539d81.jpg","description":"Runespell: Overture is a role-playing game combining poker mechanics with power ups and collectable cards. The world is set in an alternate medieval Europe linking historical characters with Norse mythology and sagas. The player takes on the role of the Changeling, the son of a monster god, in search of his nemesis.\nKey Features:\t\t\t\t\t\t\tInnovative mythic poker system using poker mechanics to battle your opponents\nUnlock power ups and special attacks available as collectable cards in the game\nCombine your skills in short bursts of active play or long sessions of questing and battles\nDefeat more than 30 monsters types each with a unique card set and attack style\nDefeat enemies and make them your pets or allies\nUnlock new battle locations through questing\nMix of beautiful hand painted backdrops and evocative 3D characters\nA compelling and original story set in an alternate medieval Europe\nLocal and online leaderboard\n20 Steam Achievements\n\nThe game is available on PC and iPad","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Mystic Box","platforms":[{"id":0,"name":"PC"}]},{"id":15089,"name":"Fly and Destroy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f8/4f893ba7edf16133e6e33994ef95e23c.jpg","description":"Fly and destroy is a hectic bullet hell shoot em up. Strap yourself into the cockpit of your fighter and get ready to blow up some asteroids! The onslaught of asteroids that awaits you would make anyone tremble in fear, but don’t worry – your trusty ship can suck up random power ups to help you get through. You just have to survive long enough to collect enough energy from the asteroids and escape with your life and the asteroids’ loot.FEATURES\nBlaze through challenging levels and survive to face the final boss\nNavigate through devious traps that wait to take you out when you least expect it\nCombine four different abilities to pull of skill shots and devastating combos\nCollect different power ups to give yourself the much-needed edge\nRub your high score in your friends’ faces (note: we are not responsible for broken friendships)\nChallenge yourself with our hardest difficulty and cry salty tears of frustration (note: we are not responsible for broken keyboards)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14822,"name":"hack_me","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03b/03bbd922963f69aa771718666a5e033a.jpg","description":"Hack_me is a hacker simulator game. The main objective in game – is to hack big companies's servers to show people that there is nothing in this world that protected on 100%. You’ll need to use your cmd, bruteforce, SQL-injectors and other programs to hack servers.\nFEATURES\n• References to Mr. Robot and other films and games\n• Dozens of hacker’s stuffs to achieve your goals\n• Dynamic gameplay\n• Real hacking - you'll use real ways and programms to achieve your goals (all programms were renaimed for for general security ;D )\n• Pleasant atmosphere – music, graphics, and your partner – Elena, prepare you to have a good time","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Egor Magurin","platforms":[{"id":0,"name":"PC"}]},{"id":2852,"name":"Megadimension Neptunia VII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3d/f3dce7f1cdac97323ef27dacce6ee7dc.jpg","description":"New challengers are taking control of Gamindustri, and Neptune's nowhere in sight. Now she’s gotta help a mysterious stranger fight a colossal new evil, reclaim her Goddess title, and find some time for pudding! Go next gen with Giant Battles, multi-worlds, and multiple storylines in this JRPG!\nNew Battle Features Characters can link up for stronger attacks, “Parts Break” allows you to split enemies into pieces to lower their stats and disable special attacks, and “Giant Battles” impose limits that will challenge the strategist in you!\nNEXT mode A second transformation is now available! You can break those big baddies into bits with NEXT mode, which features new special skills and a new costume for the CPUs!\nThree Worlds, Three Stories Three different story modes! With new CPUs and characters at your side, you must fight through three dimensions to save Gamindustri!\nNew Dungeon Minigame! An homage to the classic “Spelunker,” you receive special items when you clear this dungeon under the time limit!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Idea Factory","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":956,"name":"Just Dance 2017","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c1/3c1e8e28ba87b981d69fca36850cad2d.jpg","description":"Grab your friends and family: it’s time to dance! Just Dance is back with over 40 new tracks, 6 game modes, updated content all year long, and access to 200+ songs through Just Dance Unlimited!  A 3-month trial is including with every new copy.\nFrom the hottest hits to family favorites, dance to over 40 new tracks including Lean On by Major Lazer Ft. MØ & DJ Snake, Sorry by Justin Bieber, Cheap Thrills by Sia Ft. Sean Paul and many more!\nHow to play? It’s easy! You only need to download the free Just Dance Controller App and follow these steps:\n1- Buy Just Dance 2017 and install it on your PC\n2- Download the free Just Dance controller App (on iOS or Android) that turns your smartphone into a controller that scores your moves.\n3- Connect your smartphone to your computer by making sure that both of your devices are connected to the same wireless network.\n4- Dance!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"}]},{"id":830255,"name":"PlateUp!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f7/4f7d3cbeeb01374e9fa5ebb7fbce293f.jpg","description":"Join us on Discord!\nAbout the GamePlateUp! combines chaotic kitchen and restaurant management with strategic planning and development to create a delightful roguelite dish unlike any other.\nUp to four players build and run a restaurant from scratch, choosing dishes, buying and placing appliances – some of which can be daisy-chained together to create ambitious automatic kitchens – cooking food and serving customers.\nPlayers have free rein to design their restaurant which will expand and develop between shifts – with additional content and challenges unlocked through progression.\nCan you cook, serve and manage your way through 15 hectic days in your restaurant and unlock a brand-new franchise?\nClassic co-op cooking action, with a wide selection of mains, sides, sauces, toppings, desserts, and starters.\nChoose your equipment, lay out your kitchen, curate your menu and plate up your dishes.\nFrom bubbling soups to sublime salads, tender steaks to hearty pies, there's something for everyone.\nLook after front-of-house: seating customers, delivering orders, and managing patience.\nEquip your restaurant to handle the most fickle of customers and deliver them what they need, right when they need it.\nCo-operate with your team like a well-olive-oiled machine or build a name for yourself going it alone.\nExceed your goals and take your franchise to greater heights at a new location, bringing with you new unlocks and upgrade\nUpgrade and rearrange your restaurant to your personal taste: when the restaurant closes for the day, the planning begins!\nDecide what new equipment to purchase, and place it wherever you want.\nWant to go high-tech? Install the turbo-ovens, crank up the conveyors, and make way for the robo-kitchen of the future.\nFancy something a little more... fancy? Curate your art collection, fix up that wallpaper, enlist a friend as a maître d' and get ready to provide the culinary experience of a lifetime.\nExceed your goals and start over at your next location, bringing with you new unlocks and upgrades.\nTailor your brand towards gourmet dining, or fine-tune your fast food franchise.\nEvery restaurant is procedurally-generated with its own climate, customers and conditions.\nReturn to your franchise HQ to view your achievements, customise your characters and upgrade your kit, ready for your next adventure!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"It's happening","platforms":[{"id":0,"name":"PC"}]},{"id":637473,"name":"Arcade Paradise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/755/75576bd83718be851cfdb7a2bfdc4b29.jpg","description":"OTHER GAMES BY WIREDhttps://store.steampowered.com/app/1579280/The_Last_Worker/\nhttps://store.steampowered.com/app/1299690/Gori_Cuddly_Carnage/\nhttps://store.steampowered.com/app/1374350/Tiny_Troopers_Global_Ops/?beta=1\nAbout the Game\nWelcome to Arcade Paradise, the 90’s-fuelled retro arcade adventure. Rather than washing rags for a living, you decide to turn the family laundromat into the ultimate arcade. Play, profit, and purchase new arcade machines, with over 35 to choose from, to build your very own Arcade Paradise!\nRags to riches… literally! Take the laundromat business made up of dull chores from washing clothes to throwing out the trash, and turn it into a booming arcade with the coolest games in town raking in all the money!\nInsert Coin Over 35 arcade games, each fully realized with its own gameplay, stories, missions, and high scores to set! Inspired by 3 decades of gaming, from early vector games right up to the 32-bit era.\nHere comes a new challenger Insert a second coin and play against a friend in a number of co-operative & competitive arcade games with up to 4 players locally.\nSet the high scores Prove yourself across each game, set your high scores, make your favourite arcade game more popular and upload to the online leaderboards.\nSoundtrack worthy of the cassette collection From the individual games to choosing what song to put on the jukebox inspired by some of the great records of the early 90s, the soundtrack captures the heart of a bygone era.\nThe greatest gaming era ever Hello 90’s. If you could smell this game, it would smell like memories. Everything from the look and feel of the arcades, to using the latest PC connected to the mind-blowing dial-up connection, all have been recreated with pure love.\nGerald in the Riviera Doug Cockle (famous for his voice acting in Victor Vran and The Witcher series) plays the role of Ashley’s berating father. Being too busy in the Riviera to see King Wash for himself, you will receive many phone calls from Gerald sharing his wise words of advice and constant reminders to fix the toilet.\nCode - ABACABB","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Nosebleed Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]}]