[{"id":19628,"name":"FlatOut 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3e/d3e2a3bc62a62bc9b70d6ebe0f54f040.jpg","description":"The second part of the FlatOut series offers a variety of racing options. This part of the series has street racing as its main theme. \n\n###Gameplay\nThe game includes 34 cars divided by three types: \"derby\", \"race\" and \"street\". As the player's career progresses, he or she can unlock more cars that include everything up to school buses. Each car has its unique characteristics and may require different driving styles. The player can also upgrade his or her existing vehicle instead of purchasing a new one.\n\nIn the career mode, the game includes more than 30 tracks with varied environment and length. The levels often allow more than one route to choose from at any lap. AI-controlled opponents have personalities that define their driving style. Besides the races, there are mini-games that offer the player to perform stunts.\n\n###Differences from the original game\nCompared to the first part, the sequel doubled on the number of available cars, tracks, and mini-games. FlatOut 2 also introduced longer tournaments and online multiplayer. There's also an improved physics engine. The tire grip was enhanced, making the controls more sturdy, and the cars are now less likely to bounce off the track.\n\nThere's also a ragdoll physics model that defines the movements of the driver within the car. After crashes and during the stunt mini-games the driver may even fly out of the car. In some mini-games, the goal is to throw the driver's body as far as possible or to land it on a designated target.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Bugbear Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 2"}]},{"id":2119,"name":"Tricky Towers","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df4/df464501be72da0052bc5e4c8896a0aa.jpg","description":"Tricky Towers is a tower-building puzzle game developed by WeirdBeard.\n\nIn Tricky Towers, the players have to stack the falling blocks of a building into one tower. The game bears some resemblance to Tetris with the difference being the objective to stack the blocks instead of clearing rows of them. The rows do not disappear. The game is physics-based, so the player can't win by just dropping the blocks in a random manner. Several in-game events are present, for example, the blocks may drop faster or become slippery. Sometimes the blocks even double in size. You play as a wizard that competes against other wizards and has to build his tower as tall and stable as possible. \n\nIt is possible to cast spells that either assist the players or make the building harder for other wizzards. The players can use 17 spells Throughout a match. Light magic spells are used for making the gameplay easier for the player while Dark magic spells make it harder for your opponents to progress. \n\nThree game modes are present: Race, Puzzle, and Survival. A handful of single-player challenges is also available where the player has to meet certain game conditions to succeed.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"WeirdBeard","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":257192,"name":"Psychonauts 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c3c/c3c536cc4d32623ba928020dfd39a648.jpg","description":"Razputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, and what's worse, there's a mole hiding in headquarters. Raz must use his powers to stop the mole before they execute their secret plan--to bring the murderous psychic villain, Maligula, back from the dead!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":558986,"name":"Capcom Arcade Stadium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a5/2a5072e5b28e1653a10e4f931f1991af.jpg","description":"Relive the Capcom classics!1943 -The Battle of Midway-comes as a free download!\nShooters, fighting, action—all your favorite genres in this exciting collection! Capcom Arcade Stadium brings back all the nostalgia of the arcade, while adding in new and exciting features you'll wish you had back then!\n\nJust Like the Good Old Days\nFrom 3D-rendered arcade cabinets to scanline filters, there's everything you need to recreate that arcade atmosphere. Fully customizable display settings let you craft your own personal experience and truly relive the glory days of arcade gaming.\n\nBrand New Ways to Play\nWith gameplay rewind, speed adjustment, and the ability to save and load your game at any time, your old favorites will feel new all over again!\nEvery game has online leaderboard rankings, so you can see where you stack up against players all over the world!\nCapcom Arcade Stadium, where retro appeal meets cutting-edge features for a fresh take on Capcom's classics!\n\nIncluded Title\n1943 - The Battle of Midway -\nPlayers: 1-2 Co-Op\nGenre: Shooting\nVersions: Japanese & English","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":4480,"name":"Mini Ninjas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/157/1571cdfb52888191eabaf53c2b897240.jpg","description":"Mini Ninjas is set in a cartoonish version of medieval Japan and puts you into the role of a cute ninja. Your village was attacked by an Evil Samurai Warlord, who uses magic to turn the innocent animals into his loyal soldiers. There’s no killing and no blood; defeating your enemies will only make them disappear and return to their natural shape. \nThere are six playable characters, although Hiro is the default protagonist. Each of the ninjas has different skills and weapons. Some of the characters can use stealth to avoid the battle or to perform a wall-jump. There are also spells that allow you to fire lightning bolts at your opponents or to turn you into an animal for camouflage and sneaking. \nThe game is full of visual staples about East Asia, such as traditional Japanese lanterns and hats, architecture, bamboo groves, pandas, masked ninjas, and armored samurai. The “chibi” (baby-like) design of the characters, along with their comically high-pitched voices, make all these look like a light-hearted parody rather than actual stereotypes. There are also elements of Japanese mythology such as Tengu, the friendly magic bird people, who trade with the character, provide training, and offer quests.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":13926,"name":"Prince of Persia: The Two Thrones","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd7/dd72d8a527cd9245c7eb7cd05aa53efa.jpg","description":"Prince of Persia: The Two Thrones is a third-person fast-paced action game developed by Ubisoft. It is the third installment of the series.\n\n###Plot\nAfter changing his fate, The Prince comes to Babylon accompanied by Kaileena. It turns out that Babylon is under attack. Kaileena gets kidnapped, and The Prince sets out to find her. It is also revealed, that by altering his own fate, The Prince prevented the creation of the Sands of Time from ever happening, so the timeline changes. It is your job to fix it back up.\n\n###Gameplay\nThe gameplay of The Two Thrones is closer to the first installment in the franchise - the acrobatics play an important role. The combat system is almost the same as it was in the second game. The player still has two weapons (one main and one temporary) and can perform combos. For the first time in the series, the Prince does not have his swords, and a dagger is used instead (replaced with the Dagger of Time later). The temporary weapons now have a certain amount of damage they can sustain. \n\nThe Prince can now transform into a Dark Prince, whose health goes down quickly, but can be instantly regenerated with sand. Dark Prince's gameplay changes drastically as it encourages fast-paced combat without relying much on tactics. However, all the transformations happen strictly on plot occasions.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":3134,"name":"Wasteland 2: Director's Cut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4f4/4f4c0c0d2127fd67b1e894204029468b.jpg","description":"Wasteland 30th Anniversary BundleWasteland 1 - The Original Classic\nWasteland  - 30th Anniversary Edition remaster (due early 2019)*\nWasteland 2: Director's Cut\nDigital Extras:\n- Wasteland 3 Music Track \"Frozen Waste\"\n- Wasteland 2 Novella: All Bad Things\n- Wasteland 2 Novella: The Earth Transformed Ghost Book One\n- Wasteland 2 Novella: Death Machines Ghost Book Two\n- Wasteland 2 Concept Art Book\n- Wasteland 2 Choir Songs EP\n- Wasteland 2 Original Soundtrack\nThe extras can be found in your Steam installation location for Wasteland 2. (e.g. C:\\Program Files\\Steam\\SteamApps\\common\\Wasteland 2)\n*Remaster will only be available for PC/Windows.\nDigital Deluxe EditionWasteland 2: Director's Cut\nWasteland 2\nA free copy of Wasteland 1 - The Original Classic.\nA free copy of The Bard's Tale.\nThree digital novellas set in the Wasteland world.\nMark Morgan's Wasteland 2 original soundtrack in digital format.\nAn incredible digital concept art book showcasing many of the world's characters and environments.\nThe extras can be found in your Steam installation location for Wasteland 2. (e.g. C:\\Program Files\\Steam\\SteamApps\\common\\Wasteland 2)\nAbout the GameFrom the Producer of the original Fallout comes Wasteland 2, the sequel to the first-ever post-apocalyptic computer RPG.\nThe Wasteland's hellish landscape is waiting for you to make your mark... or die trying. With over 80 hours of gameplay, you will deck out your Desert Ranger squad with the most devastating weaponry this side of the fallout zone, test the limits of your strategy skills, and bring justice to the wasteland.\nKey Features:\nOne Size Does Not Fit All: Don't feel like finding the key for a door? Pick the lock, bash it down with your boot, or just blow it open!\nDecision Making... with Consequences: With both short and long term reactivity, your choices ripple outwards, changing the game's events and forever altering the lives of those in the wasteland.\nHuge & Customizable: Hundreds of characters. Thousands of variations on your Rangers' appearance. Over 150 weapons. No two players will have the same experience.\nSteam Features:  Wasteland 2 supports Cloud Saving so you can sync your saves across multiple computers!\nDirector's Cut New Features:\nComplete Graphics Overhaul: Rebuilt in Unity 5, Wasteland 2's environments and characters have been updated to take advantage of the latest graphics technologies.\nPerks &: Quirks: Customize your squad even more! Perks & Quirks are special personality traits you can use to give your characters even more life, with their own unique bonuses... and drawbacks.\nPrecision Strikes: Fire on your enemies and debilitate them with tactical attacks! Cripple a leg to slow an enemy down, fire on their gun to blast it to bits, or aim for the head to knock them senseless – or blow it clean off.\nExpanded Voice Over: Over 8,000 lines of new voice-over dialog have been added for the game's characters and companions, bringing the Wasteland to life like never before.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"InXile Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":11729,"name":"Gang Beasts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/160/160f894fc774f4cc51a99f435abadd4e.jpg","description":"Gang Beasts is a silly multiplayer party game with surly gelatinous characters, brutal mêlée fight sequences, and absurdly hazardous environments.\nWatch in horror and amusement as gangs of gummy miscreants fight to grab, push, pull, and force their enemies from suspended window cleaning scaffolds, neglected funfair attractions, and commercial haulage trucks.\nGasp with shock and delight at the spectacle of farcically pugnacious thugs punching, kicking, and throwing their foes into unspecified hazardous machinery, flaming incinerator pits, and the path of moving trains.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":54,"name":"Punch Club","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad1/ad15e71b0a3d431ce0a59bcd783efa88.jpg","description":"Punch Club is a cross between sports management and The Sims, packed together in the retro pixel-art style. The plot is based on the 1980s and 1990s action movie staples and is full of ironic references and quotes from them. You play as a young boxing prodigy whose father was murdered by a stranger. Your goal is to become a great sportsman and win a tournament, but also to investigate and avenge your father’s death. The player controls his character around the clock, making him exercise, eat, go to the job, buy food and other items, and interact with other characters. \nWorking out will improve the boxer’s main characteristics, such as strength and stamina, moving him towards his goal. But there are also essential Sims-like attributes like hunger and happiness that wear down during activities and need to be replenished. Money is also essential and can be earned by performing jobs and quests or by winning boxing matches. Before each fight, be it a match or an assault by a street gang, you choose a number of skills that the boxer will use this time. Completing quests will earn you favors from the other characters that will help you to advance the central plot and find the murderer.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 4"}]},{"id":18852,"name":"Poker Night at the Inventory","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1be/1be2141edae05d4ba9858182b081e604.jpg","description":"Four famous characters - Max (Sam & Max game series), RED Heavy (Team Fortress 2 game), Tycho (Penny Arcade webcomic), and Strong Bad (Homestar Runner web series) - just sit around a table in the underground casino called Inventory and play poker. According to its owner, it is hidden under a video game store and is kept secret so that if the government outlaws gambling one day, it will know nothing of Inventory. The player does not control any of the characters but is instead an invisible character on its own, who is literally referred to as The Player by other characters. \nAll players have a reserve of $10,000 at the beginning and leave the game if they're left nothing to put at stake. The ultimate goal for the player is to remain the last one sitting behind the table. Sometimes the opponents will put their recognizable belongings, such as Heavy's iconic bazooka Iron Curtain, at stake. This is essentially a board game, however, funny animation and characters' chit-chat filled with references and jokes may keep one interested.\nAchievements in Poker Night at the Inventory allow unblocking certain special features in Team Fortress 2.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3933,"name":"Tom Clancy’s Splinter Cell Blacklist","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de9/de93cd3e51d2c57e33bbf7dade34f25a.jpg","description":"Tom Clancy’s Splinter Cell Blacklist is a stealth-action game developed by Ubisoft Toronto. It is the sixth main installment in the series.\n\n###Story\nThe game takes place six months after the events of Conviction. The Third Echelon got disbanded, and Sam Fischer became a private security contractor. A terrorist organization known as The Engineers threatens the United States with a series of terrorist attacks if the U.S. Military will not call off their troops stationed in other countries. POTUS comes to Fischer, forms the Fourth Echelon and grants Sam with a Fifth Freedom - the freedom to defend the four first freedoms no matter what it takes.\n\n###Gameplay\nSplinter Cell Blacklist focuses on a stealth mission approach. The player is still free to go in loud, but it will be much harder, as Fischer can sustain a very small amount of damage even on the lowest difficulty.\n\nThe players have a wide range of gadgets at their disposal, such as the snake cam, a throwable sticky camera that can distract enemies, a portable EMP, and a variety of grenades. It is also possible to upgrade Fisher's outfit, making it more stealthy or improve its armor. The players can also upgrade their HQ to gain certain advantages on the battlefield, such as an improved minimap.\n\nThe game evaluates the players' performance. Three play styles are available - Ghost, a complete stealth approach with no kills; Panther - a stealthy approach with enemy kills; Assault - a head-on gunfight with the enemies.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft Toronto","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":58806,"name":"Satisfactory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b0/9b03581c1ba7df63e221eb0828f8bb52.jpg","description":"FICSIT - AN INTRODUCTION\nWelcome to FICSIT Incorporated! A company specialised in the research, development and application of new technology and science, anything to find short-term solutions to long-term problems! As part of our brand-new Save The Day program, you’ll be sent to one of many alien planets in an effort to contribute to Project Assembly, a project I am legally bound to not tell you anything about for fear of our lives. And my job.\nAs an engineer and pioneer, you won’t only be constructing and automating the very factory that will contribute to Project Assembly, but also explore and exploit the planet and its inhabitants as you expand. Don’t worry, we’re super inclusive when it comes to alien lifeforms! We’ll even allow for pets, how cool is that!?\nJust don’t tell R&D.\nBelow you can find the three main pillars of your mission! Time to get to work, and Stay Effective!*\n*This motto is FICSIT Inc. property. Please do not use ironically.\nCONSTRUCT\nTo achieve company milestones according to satisfaction we expect you to construct your FICSIT Inc. factory in such a way that it allows for easy expansion and complexion. Not only will buildings grow more complex over time, so will the parts they produce. Project Assembly isn’t your average high-school science project. We’re making history here! Go big or go home!* Of course, this requires both high-level and low-level power management, good luck getting to nuclear! We even support stuff like multi-floor warehouses so you can stack your buildings, and a whole bunch of navigational constructs like jump pads and walkways! Walkways are the best. They’re attached to the ground and everything.\n*Employee will be expected to fund their own travel expenses\nAUTOMATE\nSo you know how your FICSIT Inc. factory can be turned into this incredibly intricate maze of conveyor belts in every direction, merging, splitting, crossing each other above and below? Conveyor belts carry, after all, the life-blood of our company! Well, since you’ll be in a pretty big area you’re going to need outposts. To make your life easier, we’ve developed self-driving trucks and trains so you can set up your very own transport system between any point in your area!\nEXPLORE & EXPLOIT\nR&D hasn’t figured out how to clone materials yet, weirdly enough, so you’re going to have to go out and use our patented method of extraterrestrial pioneering! This means exploring to find more or new stuff to exploit, to help expand your FICSIT Inc. factory. You’re on an uncharted alien planet, so try to be careful, don’t go alone if you don’t have to, and use protection! Who knows what kind of organisms have made this place their home? Or who knows what awesome treasures you’ll find? Don’t worry, this is why we assigned you your very own FICSIT Inc. handler.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Coffee Stain Studios","platforms":[{"id":0,"name":"PC"}]},{"id":5544,"name":"DiRT 3","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/640/6409857596fe6553d3bb5af9a17f6160.jpg","description":"DiRT 3 is a racing simulator that differs from its rivals because of unusual races and a huge variety of cars that includes modern sports models along with retro cars. Instead of fancy stadiums, the game offers you to drive through snowy landscapes of Finland and dirty roads of London's suburbs. In the career mode, you need to compete with other racers to gain the interest of sponsors. The higher your rank becomes, the more cars become available.  \nWhile DiRT 3 and the series in general is famous for its responsive controls and simple physics that make these games easy to master for newcomers, DiRT 3 features a quite challenging new mode - gymkhana. In this mode, you need to perform different tricks in a limited time period, such as drifting, jumping or spinning around. Gymkhana rounds are unskippable to progress in the career mode. Another key feature that highlights DiRT 3 is flashbacks - the mechanics that allows turning back time if you made a mistake during the race and driving a certain piece of the track again.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":12022,"name":"King's Bounty: The Legend","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1aa/1aa082df2dbde6940e9ccbee4aac0feb.jpg","description":"This spiritual successor to the 1990 King's Bounty revived the franchise and spawned a series of sequels. The plot is set in a fantasy world of Endoria, in the kingdom of Darion, and does not continue King’s Bounty. The protagonist is a rookie hero who offers his services to Mark, the king of Darion, and is to become his Royal Treasure Searcher. The player’s goal is to complete quests that will earn his or her character the titular king’s bounty, be it gold or a rank in nobility. \nUnlike the original TBS game, The Legend combines tactical gameplay with role-playing elements, such as character classes, experience, and a tree of skills. Your class (warrior, paladin, or magician) is assigned automatically based on your actions in the tutorial mission. There are also dialogues, character interaction, and even romance options than allow your character to marry and have children. The player explores the world’s map in real time, like in most RPGs. The combat system, however, is completely different. During battles, the player controls not the hero, but the hero's units, the number of which depends on the character’s “Leadership”. Battles are turn-based and are fought on a grid of hexagonal tiles, just like in the related Heroes of Might & Magic series.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"1C Company","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4473,"name":"Shank 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a6e/a6e83e0f449883b6df57ae52b6805756.jpg","description":"The direct sequel to Shank (2010). The main protagonist, Shank, is a former mafia hitman. His home country is taken over by a military coup led by ruthless General Magnus, and Shank has no choice but to fight the regime's militia. There's also a second protagonist, Shank's childhood friend Corina. She can be played in several story missions, as well as in a newly introduced multiplayer survival mode. Corina's abilities are slightly different from that of Shank's, her moves are swifter, however, her attacks deal less damage.\n\nThe game is played as a 2D side-scroller. To move forward, Shank and Corina have to defeat all enemies they encounter, using three types of weapons: piercing them with knives, smashing with a club or shooting with a gun. The weapons can be switched on a fly during the action, thus allowing a variety of combos. The gameplay has slightly changed since the original game: blocking is not allowed anymore, and dodging is the only option to evade damage. Like its predecessor, Shank 2 features a somewhat cartoonish visual style, that contrasts the quite bloody and grotesque action scenes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58394,"name":"Horizon Chase Turbo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d16/d160819f22de73d29813f7b6dad815f9.jpg","description":"Horizon Chase Turbo is a racing game inspired by the great hits of the 80's and 90's: Out Run, Lotus Turbo Challenge, Top Gear (SNES), Rush, among others. Each curve and each lap in Horizon Chase Turbo recreates classic arcade gameplay and offers you unbound speed limits of fun. Full throttle on and enjoy!\nHorizon Chase Turbo has Multiplayer Split Screen support across all game modes, to rescue the nostalgia of playing with your best friends sitting on a couch all night long. The hard time is to know who is your best friend because this one is also the one to be beaten.\nHorizon Chase Turbo brings back the graphics context of the 16-bit generation and creates a style that is inspired in the past without letting go of its contemporaneity. The apparent polygon and secondary color aesthetic accentuate the visual beauty of the game, resulting in a unique and harmonic atmosphere. You'll feel the retro soul of the game on a completely modern body.\nHorizon Chase Turbo is a race around the world. With each new cup, you'll pilot your car through extraordinary places, watching the sun setting, facing rain, snow, volcanic ashes and even severe sandstorms. Be it day or night each track takes place in beautiful postcards from across the world.\nHorizon Chase Turbo presents Barry Leitch, the musician behind the soundtracks of classic arcade racing games Lotus Turbo Challenge, Top Gear (SNES) and Rush. As you play the game, you'll be hypnotized by his charming tunes that complement the graphical ecstasy of each horizon.\nHorizon Chase Turbo is the new version of the acclaimed and multi-award winning game “Horizon Chase World Tour”, selected as “BEST OF 2015” having a Metacritic of 88. The Steam Edition brings a lot of unseen features and content that enhance the nostalgia of old-school arcade racing games.\n4K resolution graphics\nAmazing old-style split-screen multiplayer up to 4 players\nMusic by Barry Leitch, Sound Designer in 90s racing classics such as Top Gear and Lotus Turbo Challenge, among others\nTons of content: 12 Cups, 48 Cities, 109 tracks, 31 Unlockable Cars and 12 Upgrades\nChallenge your friends in an Online Competitive Ghost Mode\nMake History by adding your name among Friends' and Global Leaderboards","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Aquiris Game Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":58389,"name":"Call of Duty: Black Ops 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/450/4501d8493e6ed172bd4982a16b56e580.jpg","description":"Call of Duty: Black Ops 4 is a multiplayer-only installment in the famous series of first-person shooters. It does not include a single player option.\n\n###Gameplay\nThe players control their characters from the first person view and fight each other in teams or individually using various firearms. While the basics of the game are the same as in previous Black Ops games, there are some additions and some subtractions. The health regeneration was scrapped, and instead, each player has a health pack that he or she must use manually. Advanced movement and wall-running also do not appear in this game. \n\nThe game reintroduces Specialists, who are characters with unique skills. There are ten types of Specialists, with the game introducing four completely new types: Ajax, Crash, Recon, and Torque. The players can customize their Specialists using the Pick 10 system of class creation. Black Ops 4 also includes some of the popular maps from the previous games.\n\n###Modes\nAlongside traditional multiplayer mode, which is the main mode in Black Ops 4, the game features several specific modes. There's the Zombies mode in which the players battle against a horde of zombies. For the first time in the Call of Duty series Black Ops 4 introduces the popular Battle Royale mode under the name of Blackout. It allows a deathmatch between up to 100 players that can form teams of up to 4.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":5488,"name":"Crash Bandicoot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc1/bc141ec3f4ca8d1d14f0ab4e4f9e654d.jpg","description":"Crash Bandicoot is the first installment in the 16 titles-long series. While the game set features various genres: races, beat'em'ups and platformers, the first part concentrates on platforming style. The game is developed by Naughty Dog who is currently famous for making Jax and Daxter, Uncharted and The Last of Us series. \nThe game features self-titled bandicoot protagonist trying to get past the obstacles while crashing enemies by jumping and circling them and collecting fruits and masks that give him various bonuses. All levels emphasize running against or into the screen. \nCrash Bandicoot tells a story of a mutated bandicoot, trapped on Wumpa islands. He fights evil corporation сalled Doctor Neo Cortex which turns every living being into the beasts fighting against each other. The game features two ending — usual and true. With latter ending achieved by collecting all of the gems namely clearing the level without deaths and collecting every bonus there is to grab.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation"}]},{"id":9644,"name":"Planet Coaster","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aea/aea1581227fa10cbc006a6594845a01e.jpg","description":"Surprise, delight and thrill crowds as you build the theme park of your dreams. Build and design incredible coaster parks with unparalleled attention to detail and manage your park in a truly living world.\nPiece-by-Piece Construction: Planet Coaster makes a designer out of everyone. Lay paths, build scenery, customize rides and make everything in your park unique with piece-by-piece construction and over a thousand unique building components.\nLandscape Sculpting: Play with nature and reshape the land beneath your feet. Sculpt the landscape to raise mountains, form lakes, dig caverns and even build islands in the sky, then weave coasters through your park above ground and below.\nTotal Authenticity: Recreate your favorite rides or leave the real world at the door. However you love to play, the most realistic rides and most realistic reactions from your guests make Planet Coaster the most authentic simulation ever.\nSimulation Evolved: The deepest park simulation in gaming history rewards your skills and makes management fun. Control every aspect of your guests’ experience and watch as Planet Coaster’s world reacts to your choices in an instant.\nA Living World: Every park guest is an expressive individual who thinks, feels and explores your park with their own interests and desires. Together Planet Coaster’s guests will tell you at a glance just how well your park is run.\nPark Management: You’re the boss with accessible controls that make management fun. Test your skills in a campaign of creative scenarios, or just build for fun and tweak your parks to surprise, delight and thrill your guests.\nCommunal Creation: Planet Coaster links coaster fanatics and creators around the world with the Steam Workshop community hub. Trade scenery, rollercoasters and even entire parks with other players, and add the world’s wildest creations to your own park.\nBe Inspired: Discover new content from the world’s best coaster park creators every day. Browse and download content from your favorite creators, or choose from the latest designs selected by the Planet Coaster dev team.\nShare Your Creativity: Whether it’s a magnificent ice cream shop or the world’s most thrilling coaster, build it, name it and share it with the planet. Join a community of creators and see your designs appear in parks around the world.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":12761,"name":"Warhammer 40,000: Dawn of War II: Retribution","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae4/ae4a8087739c065fb6ddda1308820ece.jpg","description":"Another game in the Warhammer universe which seeks to replicate the success of the legendary Dawn War released back in the 2000s. Dawn of War II Retribution is a standalone expansion pack that features new faction: the Imperial Guard.\n\nThe game is set in the fictional universe of Warhammer known for its factions and gore visuals. In this expansion, there are new campaigns for all game races. The action takes place in the Sub-sector Aurelia 10 years after the last installment in the series.\nThe developers tried to re-invent the genre of RTS, adding elements of the popular MOBA genre. The player gains control over a squad of units led by a hero and completes missions at different locations in the game’s universe. Hero levels up gather items of different rarity,  learns new skills and abilities to overtop enemies and bosses.\n\nBase building is still present in the game, albeit in a truncated form: in multiplayer, players must develop their outpost. The addition also adds a new hero to the roster and new enemy types to beat.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":59611,"name":"Pathfinder: Kingmaker","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e6/4e6c6259ad910c31261d90b42c45e046.jpg","description":"With the help of over 18,000 Kickstarter backers, Narrative Designer Chris Avellone and composer Inon Zur, Owlcat Games is proud to bring you the first isometric computer RPG set in the beloved Pathfinder tabletop universe. Enjoy a classic RPG experience inspired by games like Baldur's Gate, Fallout 1 and 2 and Arcanum. Explore and conquer the Stolen Lands and make them your kingdom!\n\nBased on our players' feedback and suggestions, this version of the game improves and builds upon the original. This edition includes:\n\n* numerous gameplay-enriching content additions and dozens of quality-of-life features\n* new abilities and ways to build your character, including a brand-new class\n* new items and weaponry\n* improved balance, especially in the beginning and last two chapters of the game\n* enhanced kingdom management system, both in terms of balance as well as usability and player comfort\n* increased variety of random encounters on the global map\n* thousands of fixes and improvements made since the game's initial release\n\nExplore the Stolen Lands, a region that has been contested territory for centuries: Hundreds of kingdoms have risen and fallen in these lands, and now it is time for you to make your mark—by building your own kingdom! To do so, you’ll need to survive the harsh wilderness and the threat of rival nations… as well as threats within your own court.\n\nCustomize your character with a wide range of classes and powers including specialized archetypes, powerful arcane and divine spells, choosing from a multitude of class abilities, skills, and feats. Pathfinder allows players to create heroes (or villains) that fit both their individual gameplay styles and their personalities.\n\nMeet a diverse cast of companions and NPCs, including iconic characters from the Pathfinder setting itself. You’ll need to decide who to trust and who to watch carefully, as each companion has an agenda, alignment, and goals that may differ from yours. Your journey will become their journey, and you’ll help shape their lives both in the moment and well into the future.\n\nConquer new regions as claim them as your own, carving your kingdom from the wilderness. While classic dungeon crawling and exploration lie at the heart of this adventure, diplomacy, politics, and kingdom development are also part of the challenge. Choose your allies well, and keep them close while exploring ancient tombs and ruins — and while dealing with politics in your own court.\n\nYour kingdom is a reflection of your character and your choices throughout the game. It is a living thing shaped by your alignment, your allies, and your ability to lead your people. Not only can your kingdom expand, opening up new territories and allowing you to build new towns and communities, but your capital city will physically change based on your decisions, your policies, and even whom you choose to ally with. As your kingdom grows, a number of factions and neighboring countries will come to you to seek favor—and to test your strength.\n\n**Explore - Conquer - Rule!**\n\nThe Pathfinder Roleplaying Game is an evolution of the 3.5 rules set of the world's oldest fantasy roleplaying game, designed by Paizo, Inc using the feedback of tens of thousands of gamers just like you. Whether you’re new to the Pathfinder® universe or you’re a seasoned veteran, Pathfinder: Kingmaker is the CRPG you’ve been waiting for.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Owlcat Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":748414,"name":"Aperture Desk Job","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/acc/acc3de7aaa850ad998d49b15f8901e23.jpg","description":"Aperture Desk Job reimagines the been-there-done-that genre of walking simulators and puts them in the lightning-spanked, endorphin-gorged world of sitting still behind things.\r\n\r\nYou play as an entry-level nobody on their first day at work — your heart full of hope and your legs full of dreams, eager to climb that corporate ladder. But life’s got other plans, and they all involve chairs.\r\n\r\nDesigned as a free playable short for Valve’s new Steam Deck, Desk Job walks you through the handheld’s controls and features, while not being nearly as boring as that sounds.\r\n\r\nNot Portal 3!\r\n\r\nLower your expectations: This is not a sequel to Portal. Now get ready to raise them slightly, because it is in the expanded universe of those games. Desk Job puts you squarely in the driver’s seat at Aperture Science. Then quickly removes the driving part and adds a desk in front of the seat.\r\n\r\nSteam Deck: A Desk For Your Hands\r\n\r\nUp until now, real life mostly involved sitting, and video games were the virtual fantasy world you could escape to. With the portable Steam Deck, we flipped that, freeing your body to run marathons and jump out of planes while your brain and hands simulate all the sitting you used to do.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4962,"name":"Shank","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c80/c8050355992f431d0efd10a19630b6ea.jpg","description":"Shank, the first game in the series of its name, is defined by its comic-book visual style and graphic violence in the vein of Tarantino and Rodriguez movies. In the single-player mode, the game follows a story of a revenge. The player assumes the control of Shank, who used to be a mafia hitman before they killed his only love, Eva. He goes on a vendetta after her murderers, hunting them down and killing in brutal ways. There's also a cooperative mode that features a different plot, something of a prequel to the main storyline. In co-op, Shank and the other playable character, Falcone, have to save a strip model from a gang of bikers and fix a rigged wrestling match.\nThe game is played as a fast-paced 2D side-scroller. Shank uses three types of weapons: a firearm, a melee weapon, such as a chainsaw, and two daggers. All three should be used interchangeably to create a variety of combo movements, which are essential to master before you reach the late stages of the game. Enemy attacks can be dodged or blocked. Shank can also perform a number of acrobatic tricks and other movements, such as throwing enemies or jumping on them, which makes for a varied gameplay.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":758,"name":"Hue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d9/2d9f74addd8f5b5f83459c2cb700aaf4.jpg","description":"In a one-color world, one scholar, working in one of the universities, suddenly discovers the phenomenon of color. But where she works, nobody needs her discovery. And even worse - the scientist is expelled from the university. At the same time, the color discovered by this scientist is spreading in her one-color world. In punishment, the scientist is sent to another world - the world of impossible flowers. Impossible colors are those colors that are invisible to the human eye, they are outside the visible spectrum.\n\nThe player plays for a little boy named Hue, who one morning wakes up and starts looking for eight visible сolors to save the scientist from the world of invisible colors.\n\n###Game mechanics based on color\nIn the game, objects can be seen, but with them you can do something only if the color of these objects is different from the color of the game's background. For example, you start with a black background, and you can see a black door on a black background - you can see its outline. But you can open it only if you change its color to some other one. or if you change the background color. And you can change the background color only when you find, \"open\" some color. For example, the first color to open in the game is Aqua. After you open this color, you can make this color the background color of the game. And then the door will be black and you will be able to open it. This technique is used in many games - but usually it is implemented only for one color, for example, white on black or vice versa. In Hue, the player deals with eight colors - after the opening of each next color, the game is correspondingly more complicated.\n\nThere are many objects in the game that you need to interact with in order to go further. And each object has to be made real by using the color mechanics described above. And also find a way to properly interact with the object itself. There are many puzzles in the game, and often they seem to be unresolved, but after the decision is finally found, the player is usually surprised how he could not see this decision from the very beginning.\n\n###The Mysteries of the Final\nIn addition to the fascinating mechanics, the game also has a story - a story about a woman researcher who discovered color for a one-color world. This story develops throughout the game, its fragments open gradually and in the end everything will turn into one picture.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Curve Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":16723,"name":"Gunpoint","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a12/a12eecf2feb2df9ceedd6e36ba758245.jpg","description":"Gunpoint is a stealth puzzle game that lets you rewire its levels to trick people. You play a freelance spy who takes jobs from his clients to break into high security buildings and steal sensitive data.\nTo get past security, you'll need to make creative use of your main gadget: the Crosslink. It lets you see how all the security devices in a level are wired up, and then you can just click and drag with the mouse to wire them differently. So you can connect a lightswitch to a trapdoor, then flick it when a guard walks across to make him fall through.Key Features Rewire levels to work however you want\nTrick guards into trapping themselves or shooting each other\nThrow yourself - and others - through plate glass windows\nInvestigate a noir-inspired story of murder and espionage over 20 missions\nChoose what to tell your clients, including lying to trick them\nChoose your own playstyle: quick, quiet, non-violent, no living witnesses, or any combination\nDiscover new solutions to levels that no-one else has thought of\nBuy specialist gadgets to suit how you want to play\nAll story stuff is skippable\nHardest puzzles are optional\nNo bosses - everyone dies in one shot, including you","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Suspicious Developments","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":384567,"name":"Crusader Kings III","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/77e/77e8a4a7b377a081aabd0dbf688417e1.jpg","description":"An Heir is Born in Crusader Kings III\nCrusader Kings III is the newest generation of Paradox Development Studio’s beloved medieval role-playing grand strategy game. Expand and improve your realm, whether a mighty kingdom or modest county. Use marriage, diplomacy and war to increase your power and prestige in a meticulously detailed map that stretches from Spain to India, Scandinavia to Central Africa.\nBut uneasy lies the head that wears a crown! Your cunning is your greatest weapon, and intelligence is the key to all successful strategy. Guard your life and the future of your dynasty, because enemies foreign and domestic envy your status. Engage in espionage, join political factions, punish heretics or use assassins to make sure your throne passes safely to the next generation.\nCrusader Kings III is the medieval strategy role-playing experience that you have been waiting for.\nShape Your Dynasty: Guide unique characters through history, choosing lifestyles best suited to their personalities and your ambitions.\nRewrite Medieval History: Dynasties will change and adapt to changes in family and politics, swimming in a rich world of religious faith and royal pageantry.\nBuild a Mighty Kingdom: Use cold steel or warm words to expand your realm; war backed by cunning, and diplomacy that unites bloodlines.\nExperience High Drama: Stranger than fiction stories leap off the screen, as characters plot against you and events push you to extremes.\nLearn as You Go: Guided advice helps newcomers and veterans navigate a rich medieval world. In-game suggestions tip you off to paths you might not have considered.\nThe Usual Crusader Kings Fun: Keep a stubborn council in line, scheme against your overbearing uncle or marry rich duchesses for their land and legacy.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Paradox Developement Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":59637,"name":"Untitled Goose Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/199/1996ab6448cadb2ce4bea31536466333.jpg","description":"It's a lovely day in the village, and you are a horrible goose.\n\nUntitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village \ngreen, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day.\n\nFeaturing:\n- A horrible goose (that's you)\n- A town full of people just trying to get on with their day\n(you hate them)\n- A dedicated honk button (!!!)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"House House","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13466,"name":"Devil May Cry 4: Special Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8e7/8e79a8e6bd4e71c8ce0006544a17aaf2.jpg","description":"Devil May Cry 4 Special Edition is a remastered version of slasher called Devil May Cry 4 developed by Capcom. \n\n###Setting\nThe game takes place in a city called Fortune which is ruled by the Order of the Sword that worships the Dark Knight Sparda, who protects the city from demons.\n\nDuring the morning prayer, the son of Sparda, Dante, rushes into the church, kills the head of the Order and most of its' knights. Nero manages to stop Dante in his killing spree. Demons start their assault on the city, and with the rest of the knights defending it, Nero follows Dante's trail.\n\n###Gameplay\nThe game's levels are open-ended, as the players can both advance the plot further, or backtrack to previous locations. The main objectives of the player are to complete quests and kill demons.\n\nMost of the quests revolve around finding an item or solving a small puzzle. The game's combat is typical for the slasher genre. It features fast-paced gameplay with the addition of a combo system. The players have to chain their attacks both with their sword and firearms. \n\nIt is possible to level up your character. For completing a mission, the player is awarded Red Spheres and Proud Souls. Souls are used for unlocking new moves, while items are bought using Spheres. \n\n###Special Edition features\nThere is not much difference from the base game. Apart from minor graphical updates, it became possible to complete the story as three new characters.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":10379,"name":"Fishing Planet","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28b/28bec9939d190ba619cad0693ebe304d.jpg","description":"Fishing Planet is a free realistic multiplayer first-person fishing simulator. The game has quite a few fans who are online and offline sharing tips on how to catch, for example, a Grass Pickerel. In the virtual store, the player must buy equipment and bait for virtual currency. The latter can be obtained in two ways: from the sale of caught fish or for real money. The developers tried to make the pay-to-win mechanics in the game present but not interferштп with the main gameplay. As a result, you can play the game without cash investments.\n\nFor fishing, there are available reservoirs of North America from Florida to California, new locations developers add to the add-ons, which for the game regularly come out. In August of 2018, several European reservoirs were added. For the catch are available more than 72 species of fish, each species with its own habitat characteristics and unique behavior, the game also simulates the physical properties of the rods, allowing players to perform different techniques of hacking and fishing.\n\nThe chat is available, and online tournaments are held continuously, the results of which players often receive real prizes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fishing Planet","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11223,"name":"Absolver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/684/684ecc08397479de72c5f89ef6f16f4f.jpg","description":"In the ruins of the fallen Adal Empire, you awaken with a mysterious mask on your face, and faint recollections of an esoteric ceremony. Freeing you from hunger, thirst, and even death, the mask is the creation of the Guides, the rulers of these lands, who have placed you here to determine whether you are worthy of becoming part of the elite corps of Absolvers. As you wander these forsaken lands, encountering other Prospects like you, you will learn new combat styles, acquire weapons, gear and armor, and build a team of warriors with whom to fight side by side in Arenas of combat.\nPlease visit the official Absolver FAQ on the Steam discussion board for more information: http://steamcommunity.com/app/473690/discussions/0/2579854400733819593/\nFluid Real-Time Combat: Position yourself in one of four tactical stances during real-time battles and execute devastating attacks, dodges, and parries. Movement becomes your weapon as you engage in solo duels or intense multiplayer melee battles.\nCustomizable Style and Flow: Players will define their character’s playstyle by picking a combat style, a weapon of choice, and arranging attacks in their Combat Deck to design their unique and personal attack flow.\nOnline Multiplayer Action and Narrative: Prospects and Absolvers will seamlessly encounter others in the world, generating unique stories that emerge through player interaction and choices. These moments are filled with tension as intentions to battle or befriend are never clear: trust is always a leap of faith. Encounters will have lasting consequences and transform into meaningful relationships as you make friends or enemies and find mentors or disciples.\nPvP and PvE: Explore a rich and dynamic world including dedicated PvP battle arenas where champions will receive spoils of victory and progress in the ranks of the Absolvers, and PvE areas in which players cooperatively battle to retrieve rare loot and equipment from the ruins of Adal.\nABSOLVER CONTENT UPDATES\nThe development team at Sloclap is dedicated to improving and expanding Absolver based on community feedback once the game is live. In the coming weeks and months, Prospects can expect regular updates to the game to fix any issues that appear, as well as both minor and major content updates. These updates already include 3v3 Game Mode and a Spectator Mode soon after launch, but many more updates can be expected, from new combat styles and moves to new powers and equipment. Please follow updates here and on absolver.com or @Absolver on Twitter for the latest.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":9828,"name":"Natural Selection 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a2e/a2efc7b5801500e8d5223c3953ef9b0f.jpg","description":"Natural Selection is a unique blend of RTS and first-person shooter that is complex enough it takes some time to master. \n\nTwo teams -- elite marines Frontiersmen and vicious alien Khaara -- compete against each other on robust maps. The number of them is limited only by the play imagination: the game features compelling level editor, scripting and graphical tools to sculpt a unique adventure. FPS mechanic is simple -- you just point and shoot. The beauty of the game mechanics truly shines in intense multiplayer sessions: you have to come up with the cunning strategy to win against players in Khaara team. The goal: clear spreading alien infestation for marines and destroy power nodes for aliens. For a successful completion of all tasks, players need to choose a leader in their midst. The leader rank requires to come up with the cunning strategy as well as with operative control of players. \n\nDevelopers are still polishing their creation, so players are sure to get new patches and maps frequently.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Unknown Worlds Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":41498,"name":"Need for Speed: Most Wanted - A Criterion Game","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/228/228e21229213695c8f6697a6b3387a2b.jpg","description":"Need for Speed: Most Wanted - A Criterion Game is an open world racing game and it is the nineteenth entry in the famous racing series. This is a reboot of the game with the same title released in 2005. \nIn the game players have to select a car and compete against other racers in various events like Sprint races, Circuit, races and Speed runs. There is also an Ambush races mode, where players have to escape from the police as fast as possible. Like in the original Need for Speed: Most Wanted game, cops can start to pursue the player during the race and as well as in the original players have to compete against other racers and if succeeded they instantly get their cars. The game takes place in a regular city called Fairhaven, which has a beach and an industrial district as well as the main highway. \nThe game was praised for those who are fans of Burnout series, especially because of its way of races where there is a start and finish of the race but players have an option to choose which way they want to go.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Criterion Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":54492,"name":"Quake II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0c5/0c5fcdf04048200da14b90e0e6cfaf6b.jpg","description":"Quake II is a first-person shooter developed by id Software. It is a direct sequel to the first Quake game.\n\n###Plot\nIn the distant future, an alien race of Stroggs attack human colonies. As a result, humanity develops operation Overlord as a countermeasure and launches a counter-attack at the Strogg homeworld called Stroggos. The main objective of the soldiers is to close down the portal, which is used by Stroggs to teleport their armies on Earth. The operation does not go as smooth as planned and Bitterman, the main protagonist, is the sole survivor of his squad. He must finish the mission.\n\n###Gameplay\nQuake II is an iconic first-person shooter. There are no health regeneration or weapon reloading systems present in the game. Instead, the players have to pick up health kits, ammo packs, and scavenge ammo from the dead Stroggs. \n\nAs the game progresses, more strong Stroggs appear, their numbers rise, and these aliens become much more accurate. More types of Stroggs also appear, such as the medics, that can revive their fallen comrades.\n\nThe game features 36 levels with the addition of three secret ones. Secrets are hidden on all levels, which contain useful items within them, such as a Quad Damage special boost. \n\n###Multiplayer\nQuake II's multiplayer was one of the first games to be recognized as a competitive discipline. Several modes are present: Free-For-All deathmatch, co-op, Capture the Flag, and Duel.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"id Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Nintendo 64"}]},{"id":490,"name":"The Turing Test","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b90/b90af2554ee2660b2bf79afdabeea30b.jpg","description":"###Turing puzzle\nThe Turing Test is a first-person puzzle game for one on the Unreal Engine 4. The game was developed by the Bulkhead Interactive studio, and published by Square Enix. The game for a long time was an exclusive for Windows and Xbox where it was released on August 30, 2016. It came on the PS4 only in January 2017.\n\n###The story\nIn the game, the player will take control over the main character - Ava Turing, who is an engineer at the space station. Artificial intelligence awakens her from cryogenic sleep since the team didn’t answer for 450 hours. It was sent with a research mission to Europe - a Jupiter’s satellite. Now Ava as the responsible employee is obliged to sit down in the transport module and find out what happened and why the team is silent.\n\n###Turing test\nUpon arrival at the station, it turns out that its structure has been changed and to achieve at least some results - it will be necessary to solve puzzles while communicating with Tom - the AI that was left at the disposal of Ave. The player has to reconstruct the picture of the events that happened here by the bit by finding information. The game takes inspiration from the real Turing Test. The Turing test is a real test that the scientist Alan Turing suggested. In the course of it, a person should communicate with somebody without seeing him. During such a conversation, a person should understand with whom he is talking - with another person or with a robot.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bulkhead Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":28300,"name":"NiGHTS into dreams...","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe0/fe0ccce931cdb5aaff9500a331e5c2eb.jpg","description":"NiGHTS into dreams... is a platforming game developed by Sonic Team. It is the first project of the studio to be developed for the Sega Saturn system. It is also the first studio experiment of creating a 3D platformer.\r\n\r\n###Plot\r\nEvery night, two worlds of human dreams appear, named Nightopia and Nightmare. One day, two teens from Twin Seeds have a terrible day. That night, both of them end up in Nightmare, reliving that bad day, but later they escape into Nightopia. They unravel the Nightmare leader wants to destroy Nightopia and release Nights, who will assist them in their fight.\r\n\r\n###Gameplay\r\nThe levels of the game are two-dimensional, while its characters are three-dimensional. The main protagonists get to Nightopia separately and have three levels otherwise known as dreams for completion. Upon spawning on the level, the protagonist gets attacked by Nightmarens who steal their spheres. The players have to transform into Nights and get all the spheres in a limited amount of time. \r\n\r\nAfter finding all the spheres, the player's performance is evaluated with a rank from A to F. After that. The players are taken over to Nightmare, where a boss fight happens. After completing all the levels on a rank no lower than C, a final level is unlocked.\r\n\r\nThe game also features a multiplayer split-screen mode. Its gameplay is similar to the singleplayer mode. The first player to get all the spheres in time wins.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PC"}]},{"id":14331,"name":"Call of Duty 2","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/50c/50c69996b917ae50d8d319f6ce9bed37.jpg","description":"Call of Duty 2 is a first-person shooter, a second installment in the Call of Duty series.\n\n###Plot and location\nThe game is set during one of the most troubling periods of the 20 century: the 2nd World War. The player can take command of various soldiers from Allied armies, and take part in various campaigns in Europe and Africa. The three playable campaigns focus on the Soviet, American and British soldiers fighting the Axis, each encompassing traditional battlegrounds such as Stalingrad, El Alamein and Hill 400.\n\n###Gameplay\nCall of Duty 2 focuses on combining realism and entertainment in warfare simulation. The playable character can carry two firearms, unique for each country, utilizing each of them in different situations. UI has been changed drastically, removing the visible health bar and overhauling compass HUD. The difficulty system can provide a cinematic experience while keeping the gameplay realistic - on Veteran, each bullet can be fatal.\n\n###Visuals and other features\nThe game boasts a refined graphics engine, with smooth textures, good performance, and stunning effects. Explosions and falling buildings, bullets flying and artillery blasting the ground, every detail is done to ensure the immersion on the battlegrounds of World War II. Multiplayer features include different playing modes, up to 64 players fighting in different locations and using a variety of American, British, Soviet and German weapons.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Infinity Ward","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":1249,"name":"FIFA 17","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a7/1a77ee44d7e91949aa794597d32c2e28.jpg","description":"Get FIFA 17 Standard Edition now!\r\nPowered by Frostbite, FIFA 17 transforms the way you play, compete, and emotionally connect with the game.\r\nFIFA 17 immerses you in authentic football experiences by leveraging the sophistication of a new game engine, while introducing you to football players full of depth and emotion, and taking you to brand new worlds accessible only in the game. Complete innovation in the way players think and move, physically interact with opponents, and execute in attack lets you own every moment on the pitch.\r\nAdditional hardware required for Remote Play.\r\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\r\nOnline features may be terminated at any time.\r\n*Online multiplayer requires a PlayStation®Plus membership.\r\n1-4 players\r\nNetwork Players 2-22\r\n44GB minimum save size\r\nDUALSHOCK®4\r\nRemote Play\r\nOnline Play (Optional)\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\r\nConditions and restrictions apply.  See https://www.easports.com/fifa/game-and-offer-disclaimers for details.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":327219,"name":"Superliminal","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eca/eca35ae10f6e934ca79b7dc17ff71b23.jpg","description":"This is a single player first-person puzzle game that uses perception as a mechanic. You play as someone who wakes up in surprisingly lucid dream. As you complete puzzles to get to the next exit, certain patterns and truths become more apparent.\n\nIn this game, everything is exactly what it seems to be! Wait, no...that's not right. Everything is the opposite of what you think it is? That's not correct either.\n\nThis is a game about breaking expectations and thinking outside the box.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pillow Castle Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":54629,"name":"Crazy Taxi (1999)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d9b/d9bbb8e69f53c4c42b8ff928cb581548.jpg","description":"Crazy Taxi is the renewed version of arcade machine title of the same name that was released in 1999. It’s a taxi driver simulator. The goal of the game is to deliver passengers to their destinations, performing numerous tricks. The game also features 16 mini-games.\n\nCrazy Taxi follows the classic mechanics of score games: you need to get from a passenger as much money as possible. In the beginning you can choose a driver and a car; their stats are quite similar with slight differences in speed and turning. To raise your tips you need to reach the destination on time. To earn extra money you can perform multiple tricks, including drifts, jumps, near-misses, and combos of these moves. \n\nDriving through the city isn’t that easy as it seems to be. There are numerous obstacles in your way, such as frustratingly slowly buses, that make you take risks during your maneuvers on the road. Moreover, the amount of potential passengers is limited: once you pick up a person, it’s unavailable for the rest of the game.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"GameCube"},{"id":0,"name":"Dreamcast"}]},{"id":12344,"name":"Counter-Strike Nexon: Zombies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ff/5ff7e855a4d0f4de1bfa515cd0e19071.jpg","description":"Counter-Strike Nexon: Zombies is a free-to-play multiplayer FPS developed by Nexon. It is a Counter-Strike spin-off developed on the original GoldSrc engine. The game is only available in Europe, CIS countries, NA, Australia, and New Zealand.\n\nUnlike the original Counter-Strike, where the counter-terrorists were put against terrorists, CSN: Z offers a PvP and PvE zombie experience. Most of the original games are present in the game with minor edits. \n\nPlayers are free to choose the character they want to play as with every character offering their own set of skills and abilities. Female characters are also present. \n\nThere is much more weaponry rather than in the original CS. Players can buy new weapons using the in-game store for in-game currency which can be bought using real money. Weapon skins are also present. The game also features a crafting system which allows for either upgrading the weapons you already own or create entirely new ones.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nexon","platforms":[{"id":0,"name":"PC"}]}]