[{"id":18100,"name":"Zombo Buster Rising","genre":"Action","price":0.0,"description":"Shoot zombies from terrace like a boss! Zombo Buster Rising Remastered brings you a nostalgic experience of classic 2D side shooting-defense in enhanced build right from your Steam library!<br/>\n<br/>\r\nFEATURES: <br/>\r\n- Challenging Steam Achievements<br/>\r\n- Steam Trading Card<br/>\r\n- Steam Cloud<br/>\r\n- Two AI-Assisted NPCs <br/>\r\n- Three super abilities <br/>\r\n- Various upgrades <br/>\r\n- Survival Mode <br/>\r\n- Support Windows, Mac and Linux","imageUrl":"https://media.rawg.io/media/screenshots/1b3/1b342a1d5e7cd805858ee555eaadee8a.jpg","releaseYear":2016,"developer":"FIREBEAST","libraryGames":null,"platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":17155,"name":"Hit Tank PRO","genre":"Action","price":0.0,"description":"Hit Tank PRO\nHit Tank is an addictive game of fast action that combines Strategy, Action and Challenge.\nBadges :\nReady to take on the fight? Complete your mission while fighting cunning enemies in unique environments!.\nBecome a hero! Hit Tank will challenge you like never before.\nChallenge players from around the world with the online leaderboards.Features :\n* 60 Unique Levels\n* 9 Different Enemies\n* Retro graphics levels\n* 3 Game Modes :\n- Missions - Challenge\n- Mode PRO* 4 Levels of Difficulty to accommodate all types of players\n* Realistic & Original System\n* Game Options (Hitbox, Speed Etc ..)\n* LeaderboardYour turn to Play!","imageUrl":"https://media.rawg.io/media/screenshots/921/921f65f76a8786cd601835c9e7322239.jpg","releaseYear":2015,"developer":"Bacq Stellan","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16135,"name":"Otherland MMO","genre":"RPG","price":0.0,"description":"Otherland is an action-packed Massively Multiplayer Online Role Playing Game based on Tad Williamss highly acclaimed novels. Embark on exciting adventures in a virtual multiverse with several diverse worlds ranging from fantasy to sci-fi. Built on the Unreal-engine, the Otherland MMO features beautiful graphics, action-based combat with direct controls, PVE and PVP, a rich storyline and complex RPG character development with four classes and numerous skills. The game’s unique virtual reality setting brings several innovative features. The eDNA System, for instance, allows you to craft and clone both Items and NPCs to help you protect your virtual apartment or play a part in clan wars.\nA unique virtual universe\nOtherland is a network of virtual worlds with completely different graphic styles! This allows for an incredible variety in landscapes, NPCs, outfits and weapons. Shop, trade or just hang out in the Bars of the futuristic Lambda Mall. Fight other players in the Hacker Zone, join the medieval war of EightSquared, uncover secrets on Mars, fight fearsome creatures on Bugworld or explore the Chinese-themed FiveIsles... Each world is filled with numerous quests, connected by a rich backstory presented as a sequel to the novels.\nBreathtaking Graphics\nVisually stunning landscapes, gorgeous environments, smooth effects and incredibly detailed characters all created on Unreal Engine.\nAction-based Combat\nCombat in Otherland feels more like an fighting in an action game than in a classic MMORPG. Aiming directly, moving with WASD and using your mouse to look around and control directions contribute to that feeling. Yet, you need to use Skills and Items wisely to defeat your enemies.\nCharacter Customization\nBased on four classes, Otherland bursts with an astonishingly wide variety of character customizations. Heights from tiny to huge, morphologies going fromthin to muscular, and the ability to wear anything and everything you find will give you the chance to  find your own truly unique look in the Multiverse.\nCrafting\nEvery item and NPC in Otherland is made out of electronic DNA. After defeating opponents, players can extract their eDNA to gain unique recipes for items - or even NPCs themselves. This unique feature creates numerous options to customize players’ looks and interact with the world.\nPlayer housing\nSet in Lambda Mall, each player is given their own virtual home called USpace, which can be decorated and customized. USpaces are used to grow Soma, the game’s main resource, and can be attacked by other players, leading to PVP encounters. Afraid to go on vacation? Collect eDNA from creatures and clone them to protect the USpace in your absence.\nClans and Clan Wars\nFound a clan with your friends!. Coming soon: Wage clan wars and choose to donate your eDNA creatures to your clan’s own world: the Clan|Space. Expand your Clan|Space, explore and defend it!\nClasses\n4 Classes are available to the players.\nWarrior: This is as close to the classic tank as possible, specialized in strong close quarter abilities and high endurance.\nAssassin: The second close combat class in the game. Massive damage but low endurance make this class a glass cannon.\nMarksman: Their range advantage lets them keep their opponents away. A strong damage output with the safety of range makes this a survivor’s class.\nEnergizer: With its medium output of damage and average endurance, this class might not seem the best choice at first glance.  But their healing abilities make up for all other shortcomings.\nBusiness Model and Future DLC Plans\nOtherland in Early Access is a Buy to Play game with optional free and paid DLC to be released over time. There are no micro-transactions at this point. The game features two currencies, bits and Credits. While bits are the main in-game currency which you can farm and earn through quests, credits are used for vanity items and currently in the game for testing purposes (given to players as a bonus). Again, the use of credits is optional, they can NOT be bought at this moment and you will be able to earn them through daily quests after the next big update.","imageUrl":"https://media.rawg.io/media/screenshots/21b/21b48f2c734469db9ddf772d4f12e197.jpg","releaseYear":2016,"developer":"Drago Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16134,"name":"Kingdom of Aurelia: Mystery of the Poisoned Dagger","genre":"Adventure","price":0.0,"description":"Collector's EditionThis Premium Edition includes separate bonus storyline, which tells about new story and reveals the previous one in more detail. It also contains 10 additional locations, additional Hidden Object scenes and 3 mini-games, music soundtracks, screensavers and concept art from the game.\nAbout the GamePlaying for Sam, a boy of thirteen years old, who is a friend of Princess Aurora, you get into amazing Kingdom of Aurelia, where the epoch of the Renaissance and development of technologies just have begun. You have to foil the plot directed against the royal family, find the perpetrator who poisoned the princess and rescue her. A little robot Tim and unique device which can read the thoughts of any character will help you in this.","imageUrl":"https://media.rawg.io/media/screenshots/4e6/4e647c5c54317ff4c1096ac90e37746c.jpg","releaseYear":2016,"developer":"Shaman Games Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15495,"name":"Luna Sky","genre":"Action","price":0.0,"description":"I woke up confused.\nWhy did they bring me here?\nWhy did they put a crystal necklace on me?\nAs she wakes up, Luna has no idea where she is. She is alone... or is she? Help her discover this strange world, survive the many challenges that await her, work out the secret of the Crystalline Expanse and ultimately escape.\nLuna Sky delivers a story you will never forget and a game you won’t be able to put down.\nFeatures:\n5 unique worlds. 4 of these levels are dedicated to a special skill you pick up along the way\nFull controller support\nFully voiced cut-scenes\nSuper tight physics-based platform game with much room to improve your skill\nMultiple upgrades\nFantastic soundtrack with 5 different composers, giving each level a special feeling\nLoads of fun extras to enjoy\nPlease Note\nThis is a game of exploration. There are no tutorials.\nHow the game progresses\nThe game starts with Luna being rather weak.\nAs the game progresses, she gets upgrades to her existing abilities - for instance - running and jumping powers on the first level. On the second level, she gains a double jump ability which can be used to gain speed, halting mid-air or overcoming obstacles.\nEach skill you unlock can also be used to play previous levels and maybe access new areas within levels!\nDon't forget\nIt is helpful to read the Hints on each level. They are accessed through the pause menu - press ESC on keyboard or the start button on your gamepad.","imageUrl":"https://media.rawg.io/media/screenshots/426/426c6f6fc25384bba56c0e583470a50e.jpg","releaseYear":2015,"developer":"Vovoid Media Technologies","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14196,"name":"IMSCARED","genre":"Adventure","price":0.0,"description":"\"I need a Heart in order to open it\"\nImscared is a metahorror game that protagonizes the player, putting him in a surreal first-person experience. Find keys, open doors and search for the exit to this nightmare. But I need to let you know, it will try to deceive You as many times as it can.\nWelcome to the metahorror experience, enjoy your stay!\nPlease read carefully the explanation when beginning the game for the first time, it's really important to do so.\nKNOWN BUGS AND FIXES\nSome systems may require DirectX updates for the game to work;\nForce your laptop to use your GeForce: Some computers have dual graphics cards such as an on-board Intel HD card and an Nvidia GeForce graphics card. The game might be using the \"wrong\" graphics card, and forcing the PC to use the other one on IMSCARED.exe can fix graphics issues;\nWindows 10 often recognize IMSCARED.exe as a virus: this causes the game to refuse creating files;\nThe game needs your root to be C:\\\\, other roots COULD give problems for the game to create files on the Desktop. At the time I write this, a solution to this issue is still to be found;","imageUrl":"https://media.rawg.io/media/screenshots/8b6/8b6b63780d8190227cdb8320b34dbcff.jpg","releaseYear":2012,"developer":"Ivan Zanotti's MyMadnessWorks","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13966,"name":"Gimbal","genre":"Action","price":0.0,"description":"Gimbal is the multiplayer shooter with buildable vehicles.\nCraft the perfect ship, and then take to the skies with other pilots in real time combat. Cap flags, race ships, and blow each other up in a social multiplayer environment. Gimbal is the shooter you've been waiting for.FeaturesFast and Gnarly Top-Down gameplay\nReal Time Multiplayer for 16+ players over Internet/LAN\nSuper Customizable Vehicles\nChoose from 142 parts, including engines, turrets, guns, and gadgets\nBuild for power, speed, durability, handling, and awareness\nMultiple game modes [Battlegroup, Deathmatch, Capture The Flag, Racing]\nPlayer hosted servers\nRigid Body Physics engine with Aerodynamics\nBounty/Money system for player advancement\nImage-based ship sharing\nNo DLC or fees. You bought the whole game- you get the whole game","imageUrl":"https://media.rawg.io/media/screenshots/878/8785844097f39a05858fa5341b23e7f8.jpg","releaseYear":2013,"developer":"8888888 LABS","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13321,"name":"Lords of New York","genre":"RPG","price":0.0,"description":"Lords of New York is poker the way it oughta be - with a lot fewer of those boring rules! Cheat your way to the top in style in this stylish 1920s-era Poker RPG, where you'll develop skills over the course of every game to give you an edge on your opponents. Don't like the cards you've got? Switch 'em around. Don't like the way your opponent is betting? Make 'em regret it. Pick your character, and see how fun poker can be.\nEvery character's skills and abilities match their distinct personalities, and they're all lovingly animated and fully voice acted. They'll let you know exactly how they feel about the way the game is going, encouraging players to bond with them over the course of a game. Poker isn't about cards - it's about the people - and Lunchtime Studios has created a cast of characters you won't forget.\nLords of New York features:\nTexas Hold 'EmUnique character skill trees.Single-player Story Mode (upcoming).New 2D Animation technology for body language expression.Humorous characters that react to your every moveAAA voice acting4-player multiplayerCross-play from PC/Mac to iOS on a LAN\nWhat are you waiting for? Pull up a seat at the table, and cheat your way to victory!","imageUrl":"https://media.rawg.io/media/screenshots/387/387c556437999a45dd52b3d153d9932b.jpg","releaseYear":2017,"developer":"Lunchtime Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12110,"name":"Chosen 2","genre":"Action","price":0.0,"description":"Chosen 2 is a heroic RPG sequel to Chosen.\nAfter defeating Akuma, Edge is left behind in a chaotic underworld. Left to wonder if Edge is alive or dead, Edge's companions Serenity, Misty, and Trinity fear the worst has happened.\nEdge awakens in the underworld lost and alone. While exploring a way to escape, Edge hears a voice of his past and discovers his mother's spirit Ayaka. Together with their trusted maiden Sakae, Edge and his mother try to find his lost father's spirit in the hope of helping Edge escape.\nDuring this investigation, Edge's party will uncover a dangerous plot by the lords of the underworld to take over the world above.\nWill you be able to stop the plot to take over the world and find your father? Will the Chosen survive?","imageUrl":"https://media.rawg.io/media/screenshots/f90/f9066890ecf69c364850e7e155cf8a7c.jpg","releaseYear":2017,"developer":"Little Big Lee","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11040,"name":"Power of Love","genre":"Strategy","price":0.0,"description":"This game creatively asks you to control two people simultaneously. You should make them cooperate with each other to solve many puzzles.\nDifferent from the requirements for controlling two people at different times, this game requires you to grasp the movement of two people, which tests computing ability of your brain and coordinate ability of your hands and eyes.\nThis game consists of three chapters. Some new elements will appear in each new chapter, providing new challenges and pleasure for you in solving puzzles.\nThe levels become more and more difficult. At the beginning, some simple puzzles help you to be familiar with the game and all kinds of new elements. Then, the level will be difficult increasingly, especially the last few levels, which is a huge challenge for your brain.\nThis is a perfect puzzle game for those who are willing to use their brains. You can experience great pleasure that other games can not give to you in this game.","imageUrl":"https://media.rawg.io/media/screenshots/075/075524dd1540bca212aaaa37f3d4e9c8.jpg","releaseYear":2015,"developer":"Yang Sun","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5714,"name":"KALIMBA","genre":"Action","price":0.0,"description":"Jump, switch and fly your way through mind-bending subterranean puzzles in this stunning new platforming adventure from the award-winning Press Play!\nThe island of Kalimba has been cast into darkness by an evil shaman, and your totems must journey from the underworld to the heavens in order to restore light to the land. Play solo or share a couch co-op challenge that Official Xbox Magazine called ‘magical’.  Download Kalimba now and begin your adventure!","imageUrl":"https://media.rawg.io/media/screenshots/e51/e51d1a050cab6b27285e258d993ac7f1.jpg","releaseYear":2014,"developer":"Flashbulb ApS","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3615,"name":"Tales of Xillia 2","genre":"Action","price":0.0,"description":"Continue the epic journey from the first Tales of Xillia game in the worlds of Rieze Maxia and Elympios! Shape the course of events through the choices you make as Ludger while exploring beautiful landscapes, lively towns, and challenging dungeons. Customize character appearances and more to truly own the experience!","imageUrl":"https://media.rawg.io/media/screenshots/8cf/8cf6d50dd64968736b6919bb90df7c6a.jpg","releaseYear":2014,"developer":"Bandai Namco Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3352,"name":"Omega Quintet","genre":"Adventure","price":0.0,"description":"In this hybrid RPG/idol simulation, five idols wield Sound Weapons against the dark forces of the world. Build up an arsenal of attacks, get the crowd’s pulse racing with extraordinary skills, and then get them on their feet with a live performance!\nKey Features\n1. Every fight is a performance, so give the audience what they want! Enter “Concert Mode” and get boosts from your music, as well as be able to fill up your Voltage Gauge faster to perform special skills.\n2. Customize your idols’ outfits, accessories, hair, and more! But watch out – hits from enemies can cause a “Costume Break”, which will compromise their outfits and leave them vulnerable to more damage!\n3. Sing your enemies right into the grave with the “Harmonics” system! Create deadly super chains of attacks, using each idol’s skill in the right order to keep the pain coming!\n4. Create performances for your idols and share them! Choreograph each routine and use the PlayStation®Camera to project yourself into the performance!\nVideo output in Full HD 1080p requires 1080p native display.\n1 player\nDUALSHOCK®4\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2015 IDEA FACTORY/COMPILE HEART. All rights reserved. Omega Quintet is a trademark of Idea Factory. Licensed to and published by Idea Factory International, Inc.","imageUrl":"https://media.rawg.io/media/screenshots/ff7/ff785432c62fcb273cc064c33656b2ff.jpg","releaseYear":2014,"developer":"Idea Factory","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":847,"name":"Ittle Dew 2","genre":"Action","price":0.0,"description":"Ittle and Tippsie crash onto yet another island filled with loot, puzzles and mysterious inhabitants! With the help of a magical map, they set out to steal eight pieces of a raft from increasingly improbable locations including beaches, prairies, an art exhibit and some dude's basement.\nIttle Dew 2 is a charming and humorous 3D Action Adventure game with a focus on exploration and combat. Tackle the game’s dungeons in any order and discover the many secrets of its expansive overworld. With only four main weapons, combat and puzzling is streamlined, yet upgradeable inventory items add RPG-like character progression!\nFeatures:\n● Who needs a map, anyway? Tackle the first seven dungeons in any order you want, and use items to open various shortcuts within! The craftiest of adventurers know there’s more than one way to open a locked door…\n● Characters are now in true 3D!​ With a bright art style and tightly focused gameplay,​ Ittle Dew 2​ takes everything that was great with the original ​Ittle Dew and adds what was missing – more exploration and content, vastly improved movement & combat, lightweight RPG elements such as upgradeable equipment, and randomized world events!\n● Discover four weapons that double as puzzle solving items, and upgrade them by finding additional copies of that item!\n● Locate “Secret Shards” to unlock additional challenging secret dungeons!\n● Utilize warps as a mode for fast travel throughout the overworld!","imageUrl":"https://media.rawg.io/media/screenshots/c31/c31a4fa593158d9d62396564ccf50087.jpg","releaseYear":2016,"developer":"Nicalis","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":898354,"name":"Crime Boss: Rockay City","genre":"Action","price":0.0,"description":"Rockay City. A thriving metropolis with excitement buzzing from the sandy bay to the towering skyscrapers. But beyond the glamour, there is a fierce turf war raging on…\nAfter the demise of the previous crime boss, there’s an open vacancy for a new King of Rockay City – but it isn’t just you who is fighting for the throne. Choose your crew based on their skills and expertise, and execute daring missions with the hopes of walking away with the cash, the turf and, ultimately, the crown.\n\nMake Sure You’re Connected\n\nRockay City doesn’t just look and feel like the 90s, you’ll find a few familiar faces there too. From the charismatic Travis Baker (Michael Madsen) and his team of planners and handlers (Michael Rooker, Kim Basinger, Danny Glover and Damion Poitier), to rival gang bosses (Danny Trejo and Vanilla Ice) and the righteous Sheriff Norris (Chuck Norris): it’s not what you know, but who you know.\n\nKeep Your Friends Close\n\nStealing everything from cash and drugs, through to priceless artifacts is more fun with accomplices. Jump into the PVE co-op multiplayer and take on thrilling hits and heists with up to four players. Fail and you leave empty handed, but succeed and you’ll find yourself richly rewarded.\n\nAnd Your Enemies Closer\n\nPlay as Baker as he builds his empire using strategy, cunning and a little fire power to carry out heists and take territory from rival gangs. Winning the turf war won’t be easy though – between Dollar Dragon, Hielo, Cagnali and Khan trying to take the city for themselves, and Sheriff Norris aiming to stop you all in your tracks, this roguelike campaign will reward and punish in equal measure.\n\nThe Best Revenge is Massive Success\n\nThese aren’t just nameless thugs – these are real people, with real big problems. Explore how Ropes, Jupiter, Runaway and the gang ended up in Rockay City and help them pull off different jobs to get back on top. Each story is made up of multiple missions, which allows you to fully experience their life of crime.","imageUrl":"https://media.rawg.io/media/games/508/5082f3a3260ad8d6a18abf6399c1d4dd.jpg","releaseYear":2023,"developer":"INGAME STUDIOS","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":799267,"name":"Aliens: Dark Descent","genre":"Action","price":0.0,"description":"In Aliens: Dark Descent, command a squad of hardened Colonial Marines to stop a terrifying Xenomorph outbreak on Moon Lethe. Lead your soldiers in real-time combat against iconic Xenomorphs, rogue operatives from the insatiable Weyland-Yutani Corporation, and a host of horrifying creatures new to the Alien franchise.\n\nYou are the commander. They are your weapon.\n\nInfiltrate large open levels and annihilate enemies with your squad, dispatching orders strategically and intuitively at the touch of a button. Tread carefully, as your foes will adapt their tactics to your actions while hunting you down because death is permanent. Forge unique paths for survival, uncovering shortcuts, creating safe zones, and setting up motion trackers in a persistent world where your actions impact levels forever.\n\nCustomize your squad with a selection of different classes. Level up and specialize your soldiers with unique abilities and an arsenal of weapons, armor, and perks, for high stakes missions in treacherous territory. Develop your base to research new tech and improve your squad even further.\n\nManage your resources wisely and take calculated risks to outsmart the deadliest creature mankind has ever faced. Can you and your squad stop the outbreak before it’s too late?\n\n• Face off in a gripping original Alien story against iconic Xenomorph creatures ranging from Facehuggers to Praetorians, Alien Queens and many more, including rogue human commandos and a brand-new threat unique to this Alien storyline\n• Lead strategically and change squad tactics from mission to mission, carefully managing your soldiers’ health, resources, and sanity, to avoid permanent team losses and mental breakdowns\n• Forge unique paths for survival in a persistent world, uncovering shortcuts, creating safe zones and setting up motion trackers to stay one step ahead of these creatures\n• Assemble and level up squads composed of 5 starting Marines classes, with dozens of specializations, unique abilities and weapons.","imageUrl":"https://media.rawg.io/media/games/826/8260752e19cc614a56a0a682f050e548.jpg","releaseYear":2023,"developer":"Tindalos Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":766955,"name":"Different Strokes","genre":"Massively Multiplayer","price":0.0,"description":"Check out the Deluxe Edition DLC to unlock 9 additional colors and numerous extra features!\nYour friend, a conceptual artist, has invited you to their latest exhibition.\nYou enter expecting to see their art adorning the walls, but to your surprise, the VISITORS are the ones drawing the art — they’re even drawing over each other’s work! It’s up to you to protect the exhibition from being covered in artwork that is, intentionally or otherwise, truly awful.\nGameplay consists of:\n- exploring the ever-expanding gallery\n- painting your own artwork on blank canvases\n- editing other player's artwork\n- rating completed artwork\nAll of the art exhibited in the game is 100% created and remixed and rated LIVE by other players. Yes, we host all of this art and load it in dynamically. We hope that you will choose to fix the (inevitable) unacceptable art!\nIn addition to the main gallery there is also a portal to the \"gallery of the week\". Every week there will be a new gallery with a particular theme. The main gallery is pretty crowded so your art may have a better chance of standing out in the gallery of the week!\nPaintings have a \"share link\" button that takes you to a web page you can use to share your work with other people outside of the game.\nPlayer's can optionally create a user account. When logged in, any paintings you create/edit will be marked with your username. Other players will be able to click on your username to see all the paintings you have created.\nYou can choose between setting up an account with a separate username/password that can be used cross-platform (Itch.io / browser version) or to login using your steam account in which case your account will always be tied to Steam.\nFrom the logged in screen you can see notifications when other players like your paintings and see how many total likes they've received.\nJoin the Discord and meet your favorite artists!\nhttps://discord.gg/7r7MtVmEnh","imageUrl":"https://media.rawg.io/media/screenshots/660/66080fabbbbd56dc7907954b8f325b26.jpg","releaseYear":2022,"developer":"swsteffes","libraryGames":null,"platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":761343,"name":"One Piece Odyssey","genre":"Action","price":0.0,"description":"The famed pirate, Monkey.D.Luffy, better known as Straw Hat Luffy, and his crew the Straw Hat Pirates, are sailing across the New World in search of the next island and the next adventure that awaits them.\nBut during their voyage they are caught in a storm and shipwrecked. They find themselves washed up on a lush tropical island surrounded by constantly raging storms...\n\nSeparated from his crew, Luffy sets off on a grand, new adventure to find his friends and escape the island!\nDangerous new enemies, terrifying forces of nature, and more await them!\n\nPlay as various members of the Straw Hat Pirates in a classic RPG set in the world of the popular ONE PIECE anime!","imageUrl":"https://media.rawg.io/media/games/cf8/cf8f731368240a2048b9f153b835f529.jpg","releaseYear":2023,"developer":"ILCA","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":372679,"name":"Spin Rhythm XD","genre":"Indie","price":0.0,"description":"Spin Rhythm XD is an interdimensional electronic music rhythm game with fluid, analogue-inspired controls and fully hand-sequenced levels.\nFEATURESTAKE CONTROL. Spin, flick and tap to match colours and beats. Spin Rhythm's smooth controls work seamlessly across multiple devices including mouse and keyboard, Steam Controller and other controllers, motion controls and even real MIDI DJ turntables (BETA).\nMASTER. Precise, hand-made levels across 3-5 unique difficulties.\nMUSIC. Over 30 of the juiciest tunes in the known universe from Nitro Fun, Hyper Potions, Subtact, Panda Eyes, Teminite, Anomalie, Tut Tut Child, Pegboard Nerds, Tristam, Braken, Maxo, Tokyo Machine, Douglas Holmquist, Kitty, Rogue, seejay, Birocratic, 2Mello and more.\nCREATE. Custom levels and backgrounds you can share with the world.\nCOMPETE. Become the best in the universe as you race to the top of the global leaderboards.","imageUrl":"https://media.rawg.io/media/screenshots/6a8/6a8b7c8b4933d0e4f15296efaaf00415.jpg","releaseYear":-1,"developer":"Super Spin Digital","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":368149,"name":"3000th Duel","genre":"Action","price":0.0,"description":"A hero with no memory, and with a mysterious mask covering his face,\nis thrown out into this land of unknown.\nReaching to an end of his journey, he discovers a truth that is hard to swallow - something terrifying about his true identity...\nExplore a huge world with organically connected biomes of more than 300!\nTerrifying monsters, multiple platform-actions and mysteries await you.\nEncounter 150+ monsters and final bosses using the aspects of discovered weapons!\n- Blade-based attacks with an advantage of fast attack speed\n- Sword-based attacks with massive-damaging attack\n- Lance-based attacks with long reach and strategic gameplay\nCollect Occults spread all over the map to use the Forbidden Magic!\nIt is possible to build each player's main character into one's prefered battle type by using Occults and items found during the route.","imageUrl":"https://media.rawg.io/media/screenshots/6f7/6f705fe42b3ed778c749922bcb4616d5.jpg","releaseYear":2020,"developer":"NEOPOPCORN Corp","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":364811,"name":"The Eternal Cylinder","genre":"Action","price":0.0,"description":"In The Eternal Cylinder, players control a herd of adorable creatures called Trebhums and must explore a strange alien world filled with exotic lifeforms, surreal environments, and the constant threat of the Cylinder, a gargantuan rolling structure of ancient origin which crushes everything in its path. This unique ecosystem is a massive, procedurally generated land with unique animal AI, real-time world destruction, and organic exploration and puzzle design to create emergent gameplay that ensures no two playthroughs are ever the same.\r\n\r\nYour Trebhums begin at the bottom of the natural food chain but can mutate and evolve with new physical attributes and abilities by eating a variety of flora and fauna. Discover and adapt dozens of mutations, including new traversal skills like flying and swimming to reach new areas, and new senses to help overcome puzzles, challenges and dangers. Your many Trebhums can each have different mutations, and new mutations don’t replace ones you already have, letting you stack ability sets in dynamic ways. Each mutation will also change the physical look of a Trebhum and stacking these will generate near countless surprising new creature designs which players will be able to organically discover as they explore this unique alien ecosystem.","imageUrl":"https://media.rawg.io/media/screenshots/d6b/d6b6398deece575e85fae62e8c10cd10.jpg","releaseYear":2021,"developer":"ACE Team","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":362903,"name":"Papetura","genre":"Adventure","price":0.0,"description":"Papetura is a handrafted puzzle adventure game made entirely from paper\nIt tells a story about Pape and a little creature Tura, that find each other along the way.\nTogether they will face firery monsters, and try to save the paper world from burning.\nEverything is made out of paper, tiny bugs, strange creatures, mysterious places and puzzles.\nAtmospheric and beautiful music of Floex - Tomas Dvorak\nPuzzles that are a part of the world\nStory told by animation and pictures, with no dialogues.\nAfter many years of gluing and cutting, Papetura is coming out in 2019. It is inspired by classic adventure games such as Neverhood and Machinarium, many stopmotion movies and paper sculptures. The team behind it consist of game designer Tomasz Ostafin (Petums), music artist Tomas Dvorak Floex, and sfx artist Juraj Mravec.","imageUrl":"https://media.rawg.io/media/games/749/749c2cd6d35815741f7c6a46069248d2.jpg","releaseYear":2021,"developer":"Petums","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":349473,"name":"Acting Lessons","genre":"Indie","price":0.0,"description":"The game centers around you, a heartbroken man with a background in cryptocurrency trading, telling the story of how you met a girl named Megan during a life changing day. Megan is a young aspiring actress down on her luck and in desperate need for help. Will you be there for her when she needs it the most and help her turn the tide? Will you be able to win her heart?\r\nActing Lessons is a drama filled adult Visual Novel (VN) with many different endings.\r\nThe choices you make in this game, even early on, will permeate throughout the game and affect the people around you and your adventure.\r\nThe game is centered around the relationship between Jonas (or your name of choosing for the main character) and Megan, but there are multiple women in the cast that you can pursuit.\r\nWill you be there for Megan and stay faithful to her or will you fall in love with her childhood friend Melissa?\r\nPerhaps you find someone else more intriguing, for instance, the nurturing nurse Leah or the blue haired actress Rena?\r\nWill you value the friendship with your best friend Liam and be there when he truly needs you?\r\nThese choices, and a lot more, are all yours to make.\r\nExpect a 5 - 8 hour long humor filled and emotion packed Adult Visual Novel that many players only could find the strength to play once.","imageUrl":"https://media.rawg.io/media/games/809/809e51d5f7e42610d571c207ab9f965e.jpg","releaseYear":2018,"developer":"Dr PinkCake","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":295068,"name":"Airborne Kingdom","genre":"Strategy","price":0.0,"description":"Take a fantastical journey — fly the desert and build your domain. Airborne Kingdom uniquely blends city management and exploration, with a world and lore all its own. Build housing, gather food, satisfy needs, and grow your tribe. Maintain lift, discover resources, and explore the desert for lost technologies.\nWith a randomly-generated desert, every playthrough changes, along with your city and its values. Will you create a balloon flotilla connected by ropes and based on faith, or a winged metropolis focused on entertainment, or will steam-powered fans fly your kingdom as you search for answers in the stars?\nThe city, your journey, their lives — all of it is up to you to decide.KEY FEATURESDesign and build your flying domain, from a single bobbing fan, to a sprawling Airborne Kingdom\nAttract migrants from the desert tribes below, each with their own distinct wants and desires\nSet up production chains of extravagant resources, encouraging more people to move to your kingdom\nMeet and barter with other tribes, combining their knowledge to form new technologies\nChange your play-style every game, with a sprawling, randomly-generated map to explore\nAirborne Kingdom is being developed by industry veterans Chee Fong, Fred Gareau, and Ben Wander, with an original soundtrack by Paul Aubry and Simon Desrochers, and the help of a few incredible friends.\nAdd Airborne Kingdom to your wishlist and we'll tell you when it launches!","imageUrl":"https://media.rawg.io/media/screenshots/844/8449176636e5b3fe144e7816aaa85aea.jpg","releaseYear":2020,"developer":"The Wandering Band","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":275708,"name":"PlanetSide Arena","genre":"Action","price":0.0,"description":"BATTLE PASS SEASON 1Battle Pass Season 1 is included with your pre-order purchase of PlanetSide Arena.\nLevel up your Battle Pass throughout the Season and unlock 80 tiers of powerful weapon blueprints and cutting-edge cosmetics.\nUse your blueprints to customize your loadout before you drop in, then purchase upgrades at terminals across Auraxis using in-match currency.\nAbout the GamePlunge into PlanetSide Arena and battle online in this massive multiplayer sci-fi arena shooter. Choose your class, fuel your jetpack, and drop into the fray on the war-torn landscape of Auraxis starting January 29, 2019.\nAll pre-order editions of PlanetSide Arena come with Battle Pass Season 1, which includes additional weapon types, armor sets, and blueprints to customize your playstyle. Season 1 blasts off with two major game modes:\nMassive Clash (250 vs. 250 group battle)\nBattle Royale (Solos and Teams of 3)\nIf you want to come out on top, you'll have to go all in to rule the Arena.\nJoin the fight in a massive clash with 250 vs. 250 player arenas, or survive the mayhem of battle royale by yourself or with your squad. Keep your eyes ahead for new modes each Season, including Search and Destroy, Deathmatch, Global Conquest, and more.\nTraditional arena warfare leaps into the future with multiple classes and styles of play. Assault, Engineer, Combat Medic – each class features unique abilities made for you to rule the Arena.\nA broad selection of futuristic vehicles – tanks, ATVs, jetpacks, and more – goes beyond modern infantry warfare. Propel into the sky and rain death from above, or grind the competition to dust under your treads.\nUp to 500 players wage war across an immense, ravaged warzone, on a scale unrivaled by any other arena game.","imageUrl":"https://media.rawg.io/media/screenshots/3f0/3f01357aa921da7fbeaad39a4187c351.jpg","releaseYear":2019,"developer":"Daybreak Games Company","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":269448,"name":"VR Paradise","genre":"Simulation","price":0.0,"description":"VR Paradise is a virtual Strip Club for Oculus & HTC Vive.\nIt has been developed by an french independant studio specialized in game & software development for over 20 years.\nOur goal was to create the most immersive and arousing stripclub experience. We have captured the motions of the most talented professional stripgirls and applied high poly real time meshes and ulta realistic textures.\nJust like in a real stripclub, enjoy a hot gentlemen's club environment with several simultaneous shows onstage, table dances and explicite nude private dances on demand.\nVR Paradise entrance is free. You can buy table dance for 20 credits (topless) and private dance for 40 credits (full nudity).","imageUrl":"https://media.rawg.io/media/screenshots/61a/61ad2786a8394f0a92fc67563ce4963f.jpg","releaseYear":2018,"developer":"Totem Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":223758,"name":"Eternium","genre":"Action","price":0.0,"description":"Play as a Mage, Warrior or Bounty Hunter, wielding a sword, axe, staff or gun. Level up to learn new abilities and increase your attributes.\nVenture into dark caves and dungeons, explore forests, villages and graveyards, lay siege to demon-controlled castles, brave snowy mountain peaks, and travel to the moon to slay strange creatures among craters and canyons, and beyond, to the deserts, pyramids and jungles of the red planet.\nOpen treasure chests to loot gold, gemstones and battle gear. Equip shiny breastplates, menacing helmets and hoods, spiked shoulder pads, mysterious cloaks or capes. Protect yourself with a shield, or choose to wield two weapons as a warrior.\nEnjoy the visceral satisfaction of responsive, fast-paced combat, with spectacular special effects, pleasing sounds, rewarding damage numbers, all set against immersive backdrops and atmospheric, inspiring music scores.\nEach hero class has access to about 20 abilities (skills or spells), and each of your three companions has four more. The game starts simple but culminates in a flurry of tactical possibilities at high levels.\nEternium is crafted with passion by a small band of old-school RPG fans, who love making the game they always wanted to play.","imageUrl":"https://media.rawg.io/media/screenshots/4d7/4d7404f0322a65eec284b2836401e4ff.jpg","releaseYear":2014,"developer":"Making Fun","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":58534,"name":"Metal Gear 2: Solid Snake","genre":"Action","price":0.0,"description":"The game takes place in 1999, when oil stocks are beginning to run out and the world is facing a global fuel crisis. When a brilliant Czech biologist discovers a microorganism that converts crude oil into wholesome fuel, there is hope of resolving the crisis. Dr Kio Marv is, however, abducted under mysterious circumstances, and the responsibility for the whole case is taken over by the Asian regime called Zanzibar Land, which thanks to the discovery of the Czech scientist and access to nuclear weapons wants to gain power over the world. The last hope of humanity turns out to be Solid Snake - a man who alone solved the problem of a similar rank in the first part of the series Metal Gear.","imageUrl":"https://media.rawg.io/media/games/68d/68dea65a86e55d75c156d625e3631133.jpg","releaseYear":1990,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":50292,"name":"Egypt Old Kingdom","genre":"Strategy","price":0.0,"description":"You are one of multitude incarnations of the great Horus, and side by side with the pharaohs, you are fighting against the mighty Seth, who unleashes numerous disasters upon the lands of Ancient Egypt. Win wars and overcome crises, discover new technologies, worship your gods and conquer neighboring tribes! Are you wise enough to help the ancient kings to unify Lower and Upper Egypt, build a stable economy and to create the Great Pyramids?Based on real historyYou will find yourself in Memphis, 3500-2140 years B.C., the time of the first six dynasties of pharaohs. You will unify the country and create a prosperous kingdom, which later will have to face the havoc of the First Intermediate Period.Construction of the pyramidsYou will lead the construction of pyramids, choose their design and materials. This process requires tremendous investments, but it is the only way to keep peace and order in the country.Ancient society simulatorYou will not only deal with the problems of farmers and craftsmen but also make important political decisions, which will define the future of the kingdom. Numerous challenges and events of different scale await you.Ancient mapsDiscover the world of the Old Kingdom: exploit new lands, send expeditions to different places, and meet different cultures. Use every opportunity to learn about your surroundings and to expand Egypt's borders.Difference from Predynastic EgyptMore diversity in the game, varied tasks in the regions, different tactics for playthroughs and unique bonuses from patron gods.\nThe game is longer now, after the main campaign there is a free-play survival mode.\nNew technologies: 3D engine and skeletal animation.","imageUrl":"https://media.rawg.io/media/screenshots/1df/1df3678c37a99fb71ffda94b5b5156bd.jpg","releaseYear":-1,"developer":"Clarus Victoria","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":49244,"name":"King's Table - The Legend of Ragnarok","genre":"Strategy","price":0.0,"description":"A version of an old Norse board game called King's Table. The game has black and white teams, like chess, but each team has different pieces and a different raison d'etre.\nThe white team has a total of 13 pieces, the most important one being Odin the King, who starts in the centre of the 10x10 board and moves in the same way as a chess King, whereas black has 20 pawns and four other pieces. White wins if Odin can reach one of the corner squares; black wins if it surrounds Odin on all 4 sides. The pawns actually move the same way as chess queens, but pieces are captured by surrounding them on 2 sides (although some special pieces must be surrounded on 3 sides). The specials are chosen from the selection at the start of the game, and have a variety of abilities, some 'borrowed' from chess.\nThe presentation of this interpretation is similar to Battle Chess, with bold 3D graphics and lots of animation.","imageUrl":"https://media.rawg.io/media/screenshots/cbb/cbb8c4dc92ec61075e6aafbe83c99392.jpg","releaseYear":1993,"developer":"Imagitec Design","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":47319,"name":"Relik","genre":"Strategy","price":0.0,"description":"All six sides of the Relik cube are comprised of challenging puzzles.Solve and craft puzzles to sharpen your mind and best your opponents.\nSolve classic puzzles\nBuild your Relik\nChallenge your mind\nCompete with other players\nEarn rewards","imageUrl":"https://media.rawg.io/media/screenshots/c17/c17f322f5e3acdc8f1dee63b4abe2856.jpg","releaseYear":-1,"developer":"Iron 27","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":46094,"name":"BAJA: Edge of Control HD","genre":"Sports","price":0.0,"description":"Baja: Edge of Control HD is the carefully remastered version of the original off-road racer from 2008 for Xbox 360 and PlayStation 3. This truly unique game contains more than 1,000 miles of the toughest terrain Mother Nature has to offer, including the steepest mountains, thickest mud and deepest canyons known to man.\nOnly the HD version features much crisper and more detailed visuals running at super smooth framerates in up to 4K screen resolution.\nWith more than 160 sponsored vehicles in eight classes , including Trophy Trucks, 4x4s and buggies, Baja: Edge of Control HD features a full array of upgradeable options with hundreds of  authentic parts that affect each vehicle's performance.\nPlayers will put their off-road machines to the test in near-vertical Hill Climb challenges, head-to-head Open Class races, circuit races and the ultimate off-road endurance challenge: the Baja! Baja: Edge of Control HD contains more than 100 tracks across all landscapes in races that can last up to four hours.\nThe game's revolutionary  vehicle physics deliver unprecedented life-like handling, and a support management system that allows gamers to monitor and repair realistic vehicle damage as fenders fly, tires are blown, suspension is stressed and engines overheat.\n4 player split screen and 16 player online multiplayer\nMore than 160  vehicles to choose from\nMonitor and repair vehicle damage via truck and helicopter teams\nRevolutionary vehicle physics respond to every bump and rut  you drive over\n200  authentic vehicle parts to help fine-tune the performance of your off-road machine\nMore than 100 tracks, nine open worlds and 1000 miles of drive-to-horizon landscape\nLots of different events, including Hill Climb, Baja Endurance Races, Circuit  Track Races and more\nFree roaming gameplay: drive as far as you want and find hidden tracks, jumps and more off-road madnessHD Features:Greater immersion via various graphical improvements including better textures, higher framerate and increased details\nMore authentic racing by improved rendering techniques for shadows, lighting and dust effects\nMore accessible gameplay due to improved controls, user interface and an easier career start","imageUrl":"https://media.rawg.io/media/screenshots/742/74251b1b168d5cb6845f10fafd7bc176.jpg","releaseYear":2008,"developer":"THQ Nordic","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":43889,"name":"Just One Line","genre":"Adventure","price":0.0,"description":"Just One Line is a fantasy RPG gamebook-like indie game heavily focused on choices and their consequences, in which you may compete with other players in an interactive online leaderboard.\nCreate different adventurers by choosing their races and backgrounds and embark on a variety of epic quests: each adventurer will progress by increasing his/her renown and relations with the factions of the Kingdom thus unlocking new races and backgrounds for your next playthroughs.\nEven though the core game experience is a text-adventure 2.0, anyone, of any age, who likes fantasy RPGs or books should give it a try. In fact, Just One Line has many great features appealing to a broader audience:\n\nCHOICES MATTER\nA lot of games say so, but a few truly mean it. Most of the quests in Just One Line are linked together and have different story paths according to your race, background, attributes and, more importantly, choices made in previous quests.\nENDLESS GAME EXPERIENCE\nThe video game itself is a framework upon which countless quests may be created and played. By exploiting user generated content and partnering with writers, Just One Line could potentially provide ever-growing contents!\nYOUR ADVENTURER, YOUR STORY\nCreate your adventurers as you see fit. Start by choosing a race and a background, follow up with some aesthetic customization and finally shape him/her into a valorous hero or a ruthless villain. Their morality and honor changes according to your in-game choices.\nWILL YOU BE THE BEST?\nWhen you resign your adventurer you can compete with other players in the online leaderboard to be the most renowned/good/evil/rich(/whatever!) adventurer of the Kingdom!\nHIGH REPLAY VALUE\nEach quest has choices, or even entire story paths, only available after certain conditions are met and/or depending on previous quests’ choices! Every time you play with different adventurers, the story changes.\nALL ABOUT IMMERSION\nWe feature a unique set of locations with a fancy toon graphics and a mesmerizing OST to aid your imagination when embarking on epic quests. You will be amazed!\nSHORT STORIES, DEEP STORIES\nWe believe that wall of texts are not needed for engaging desktop players. Quest telling is rich and thrilling yet not too darn long.\nINNOVATIVE YET CONSERVATIVE\nThe concept of our game is a breath of fresh air! However, you can expect everything a role-playing gamer has come to know and love: races, classes, skills, magic, powerful weapons and armors… Oh! And dragons, zombies and pirates too!Early Access Features\n3 Races out of 4.\n6 Backgrounds out of 10.\n10 Quests and counting.\nOnline leaderboard.\n23 Armors.\n29 Weapons.\n29 Potions and Trinkets.\nTwo languages: English and Italian.\nMore to be added laterThe main focus of this Early Access is to increase the game longevity (please also read the Early Access section above): the quest pack will be expanded as the game development goes by. User created quests will be added via Steam Workshop to a separate set of quests.\nAbout the plot: Even though the game will feature a main story, it will only emerge as more quests are added to the game. The main story is already referenced by other quests in the game at the moment. Eventually, one or more playable quests about the main story will be added to the game; until then, the players must think of the quests as tasks -or help requests- from the people of the Kingdom, each somehow linked to many others (by cause-effect relationship) sharing the same game lore and background but not the same main story, as a traditional gamebook would. The adventurer is not (yet) a \"chosen one\", but rather a lad/lassie seeking his or her fortune!Performance NotesJust One Line is in development and undergoing optimizations. As the development continues and the community gives us feedback, performance will get better. The game suffers a slow one-time initial loading on mechanical hard drives.Please NoteWe are not planning to and will do our best to avoid game saves to become incompatible over time or to wipe the online leaderboard. Should it be the case, we will give the users prior notice and try to work out the best solution possible to avoid any unexpected data loss.\nQuests already shipped may be updated in the future and the prerequisites/choices/consequences in newly added quests may depend on those updates. This could result in some \"plot inconsistencies\" or minor issues if playing with adventurers created before given updates.","imageUrl":"https://media.rawg.io/media/screenshots/884/88454d12baa5c64f3f0dbc5845d22006.jpg","releaseYear":2017,"developer":"JOL Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":42330,"name":"Football Manager 2014","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/894/89478bc89d167127c9aaa7859458bb16.jpg","releaseYear":2013,"developer":"Hardlight","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40892,"name":"Starhawk","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/69a/69a4c56923706c0e3d03998dd435fa6b.jpg","releaseYear":2012,"developer":"LightBox Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":34119,"name":"Postal 2: Apocalypse Weekend","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/75f/75fdacaa38a62fc0173ede43df30a578.jpg","releaseYear":2004,"developer":"Running With Scissors","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28959,"name":"EarthDefenseForce 2017","genre":"Action","price":0.0,"description":"(Online Interactions Not Rated by the ESRB) Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   2013 AD: A radio transmission is intercepted from an unknown extraterrestrial source 2014 AD: Attempts are made to establish contact with the source, but to no avail. 2015 AD: A technologically advanced international army, the EDF, is established. 2017 AD: A large fleet of alien spaceships, dubbed the Ravagers, arrives on Earth and begins indiscriminately attacking humans...   \"Earth Defense Force\" is a shooting action game and follow-up to \"THE Earth Defense Force\" and \"THE Earth Defense Force 2\", released in Japan. In this game, the player becomes a soldier of an international army, the EDF, trying to defeat an alien army that suddenly arrives on Earth.  The PS2 predecessors have sold over 350,000 copies in Japan, and now the popular series has made its way to the XBOX 360. To take advantage of the console's high definition capability, the graphics and gameplay have been improved, while the design and game world have been completely revamped.","imageUrl":"https://media.rawg.io/media/screenshots/0e7/0e7b6f66e8a8312406b10e28d9db30da.jpg","releaseYear":2006,"developer":"SANDLOT","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28296,"name":"Fable II Pub Games","genre":"Board Games","price":0.0,"description":"HD (High Definition). Unlock the full version of the Fable® II Pub Games and you’ll get all three great pub games that will also be in Fable® II!  Each game has multiple variants, plus the ability to earn and transfer gold and unique items to your character in Fable® II (assuming, of course, that you also have Fable® II). Either way, you’ll also get access to minigames, leaderboards, achievements, and all the fun of these backroom games of chance! This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/55d/55df3307f4afb3a11499b0b7e03b5577.jpg","releaseYear":2009,"developer":"Xbox LIVE Productions","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":21761,"name":"Bullet Candy","genre":"Casual","price":0.0,"description":"Bullet Candy is a fast paced, action packed arena shooter. There are a variety of combo systems and many secret techniques that you can employ to get the best score and weapon upgrades possible. Viewed from a top-down perspective, Bullet Candy allows for a true 360° shoot-em-up experience. With all of your enemies in view at all times it's easy to see and, more importantly, shoot them into tiny little pieces.\nFeatures:\nBullet Candy features over 50 levels in arcade mode (150 in extend mode) and three challenging difficulty settings.\nCompete with the thousands of other players around the globe for the top spot with the in-game online high score tables!\nTons of unlockables including Survival mode and Asteroid mode (both with their own online score boards).\nThe Suicide Action allows you to kill yourself while keeping your score multipliers and bonus weapons intact.\nCollect all 20 Steam Achievements","imageUrl":"https://media.rawg.io/media/screenshots/534/53470e93c4ca28cd0a0b5da0c550067f.jpg","releaseYear":2006,"developer":"R C Knight","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17663,"name":"Sledgehammer / Gear Grinder","genre":"Action","price":0.0,"description":"Darkestville Castle Coming Soon\nAbout the Game\nSledgehammer is a pure action game on wheels, and a festival of demolition and speed, all in one. Drive the most powerful truck and destroy every opponent that you’ll find on the road or go to the multiplayer mode and decide who is the king of the highway, among your friends.\nHours of gameplay in the main campaign and 6 minigames in the single player mode.\nMultiplayer for up to 8 players simultaneously in cooperative and deathmatch mode. Destroy huge trucks joining forces with your friends or become the best truck driver in a fight to death.\nUpgrade your truck using the money you get from successful deals. Melee, light and heavy weapon, armor, nitro…make you truck an unstoppable machine of destruction","imageUrl":"https://media.rawg.io/media/screenshots/e61/e6155505e306b13293db28338b8ce66b.jpg","releaseYear":2014,"developer":"Targem Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]