[{"id":58825,"name":"DAEMON X MACHINA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24d/24d87465e0abad1a0e0e95d09bcc2a2f.jpg","description":"Daemon X Machina is a mecha simulator game in which the player controls a gigantic battle robot. \r\n\r\n###Plot\r\nThe game is set in the future after an apocalyptic collision of Earth and Moon. As a result of the cataclysm, all AI on Earth was disrupted, and machines rose against humanity. The player assumes the role of a mercenary pilot (an “Outer”) in control of a battle robot (called “Arsenal”), tasked with protecting the humanity. The Outers are not merely human beings but are people with superhuman powers that make them outcasts of the society.\r\n\r\n###Gameplay\r\nThe robots are highly customizable. The game allows the player to change details even during combat. As the player defeats the enemy robots, he or she can scavenge their parts to use for his or her own machine. The Outers are also customizable. The player can choose his or her avatar's gender and looks, as well as the character's abilities. The main hub in the game is Hangar, where the player can accept missions and purchase upgrades.\r\n\r\n###Visual style\r\nBeing strongly inspired by anime series like Evangelion and Gundam, the game tries to imitate them visually. Daemon X Machina features a cell-shaded pseudo-2D animation style with high contrast and limited use of colors. It features heavy metal music.\r\n\r\n###Multiplayer\r\nThe game has a cooperative multiplayer mode that allows up to four players to participate. In the solo game, the non-player companions are AI-controlled.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Marvelous","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":44522,"name":"The Monster Inside","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/838/8389d5bbfa6d4bc374d9102c026824a3.jpg","description":"A private investigator works his way through a world of lurking beasts, powerful magic, and a string of unusual crime scenes while trying to keep a handle on his strange illness. Uncover the truth in this short but biting tale of lust, instinct, and deception. A haunting film noir soundtrack accompanies four unique diorama-like environments in this simple text adventure.FeaturesSeven story chapters with achievements\nSix permit violation notices\nFive immersive noir music tracks\nFour treatment pills every morning\nThree mysterious deaths\nTwo-packs-a-day smoking habit\nOne high-functioning alcoholic\nClick your way through this audio-visual novella and let your mind wander through dangerous streets.\nAlso available to play directly in your browser.\nListen to the soundtrack on SoundCloud","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Random Seed Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Web"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22458,"name":"Battle Group 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0f/c0f7b672628038039c4662f4c91cd359.jpg","description":"**IGF China Finalist**\nA deadly new terrorist group has emerged. The Talon seeks vengeance for an unknown crime, commanding seemingly unlimited resources and striking against innocents with precision, efficiency, and savage force. They take no prisoners.\nBut neither do we.\nBattle Group 2 puts you in control of an advanced naval fleet assembled as a last resort against this deadly new enemy. Command powerful battleships and fire newly developed satellite strikes in a final strike against this deadly new terrorist superpower.\nKey Features\nEight unlockable ships - Earn new warships like the devastating Arsenal Prototype.\nAmazing detail - All player and enemy craft are lovingly modeled after real-world blueprints.\nBrand-new satellite strikes - Bring your arsenal to the next level with nullifying EMP blasts and change the tides of war with experimental new Hyper-Time technology.\nFully developed campaign with over 30 new levels and challenging boss battles. Bring the war back to the Talon's doorstep - or die trying.\nProcedurally generated level content and enemy formations keep even the most experienced gunner alert.\nWage war in three different theatres of combat: across jungle shores, in industrial ports, and even deep in arctic seas. Enable night vision mode during intense midnight battles.\nNext-gen UHD graphics - See the world rendered in incredible detail, coupled with a totally new menu system with satellite interface.\nIncredible music and sound - Plunge fully into the game world with professionally acted voice-over and epic soundtrack.\nDeveloper Notes:\nThank you for playing! Please reach out with issues or with suggestions for what you want to see next!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bane Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20322,"name":"Pester","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47a/47a44fcc57fec53c52350feaf707aedb.jpg","description":"Pester was released on Xbox live indies back in early 2013 and was Flump Studios first game developed for public release.\nA remake of one of my early C64 games, Pester is a very fast paced and busy vertical shooter.\nGraphically remastered with new sprite work from Dylan Barry and a thumping soundtrack from Matt Macfarland.\nIntense old school actionTate supportCustomisable play options, over 100 combinations of playRemastered sprite work from Dylan BarryThumping soundtrack from Matt Macfarland","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Flump Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18115,"name":"8infinity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bcd/bcdc195d0069fa821670c986542e019d.jpg","description":"If you change the units of speed and distance for “8”- what will happen? 8infinity (8 infinity).\n8infinity (8 infinity) is a dynamic and rhythm game where the player reaches eights “8” - levels of infinity. In the game there are no barriers. If there are any, it’s only the imagination! This game is for everyone who wants to improve their quick thinking and the related skills.\nPassing through eight is signaled by color, which player must click the correct button: violet or color blue, double color or gray - the most surprising move, where a player can’t touch the screen!\nThe level of difficulty increases every time you reach the \"8\" – the pace of the game becomes faster. Surprise causes unpredictable rotation of eights - it is like rollercoaster!\nThe hero of the game is a heavy metal ball, that enlightens \"8\" like an orange fireball. The whole game is complemented by the purposefully created sound.\nThe game graphic design has been carefully tailored combining terms of classic elements with modern visual design.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ENTERi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15069,"name":"Nuclear Contingency","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/907/907455999de5f87d0adea472d622b926.jpg","description":"It is the year 1959, the world is drastically changing in the aftermath of the Korean War and the death of the Soviet Dictator Joseph Stalin. The power balance of the world is forever altered by the discovery of the destructive A-bomb. From former British colonies in the South East Asia, US spies came back with the disturbing news of communist insurgents creating nuclear weapons. Nobody knows how they got their hands on uranium to fuel such a weapon and the required knowledge to make it. Faced with the dangers that communist terrorists could pose to the US and it's allies, the CIA Directors have decided to send their top man, Jack MacArthur to investigate the rumors and if they are proven true, to sabotage the nuclear capabilities of the terrorists. Still haunted by the horrors of the Korean War, Jack sets forth to eliminate the threat not only to the US, but to the whole world.\nNuclear Contingency is a stealth game inspired by the old school top down spy titles (such as the Metal Gear series). A deep and compelling story line spread across a period of 4 years will constantly keep you on your toes while you travel across exotic locations of Vietnam, Kongo, Cuba, Afganistan and more. Be prepared for an intriguing political thriller filled with unforeseeable twists and turns. Playing as a top field operative, players will be tasked with completing various missions by using stealth or confronting  enemy soldiers head on. However, if alerted, the guards will prove to be a great challenge as a single bullet is enough to send Jack to an early grave. Only with a stealthy, smart approach, cool head and steady aim will the player be able to complete the mission and put an end to a nuclear threat, bringing back peace to the world.\nWhats next'\nWe still wish to work on the game and improve certain ai mechanics. For now we still have not figured out why the AI sometimes breaks. Please let us know about everything you would like to see improved so we can put it in the upcoming patch!\nFinal note- During beta testing we have come across one weird but fun bug. The map is for some unknown reason filled with blood like someone before played the level... We found this interesting and we have no idea what causes the bug so if someone sees this please let us know so we can maybe figure out what causes the Massacre bug.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":10408,"name":"Impact Winter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ec/7ec767c4964cb3ac5f54e1d608050c7f.jpg","description":"A game controller is recommended to play Impact Winter.\n\"In 30 days, help is coming…\"\nA mysterious radio transmission claims that help is inbound. You are Jacob Solomon: leader of a makeshift team trying to survive the aftermath of a devastating asteroid collision. The world you once knew is no more – buried deep beneath the constant snowfall. Your goal: keep your companions alive until rescue.\nRescue-minus 30 days:\nRediscover the survival genre: strategize in a bid to lower the Rescue Timer.\nLead your team to survival:\nProvide for your team and unite your skills in a freezing struggle for life.\nAn immersive and unpredictably hostile world:\nOutlast a hazardous winter brought to life by a unique artistic direction.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9772,"name":"AltspaceVR—The Social VR App","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8b/f8b7f6cc4f96109f43dd699580e20bbe.jpg","description":"Welcome to AltspaceVR, the easiest way to meet people from around the world, play interactive games, and attend free live events in VR. Choose from over 30 activities or attend live events with comedians, DJs, authors, celebrities, and more. Day or night, there’s always someone to hang out with.\nGet the AltspaceVR Android app so you can:\n•  Explore AltspaceVR on your phone screen in 2D mode using Mobile View\n•  See which of your friends are online and join them wherever they are\n•  View and star upcoming events, then get notified when they are about to start\nDon’t just take our word for it, read some of our recent reviews:\n“A glimpse into the potential of the future. It is good to be alive.”\n“I was planning on just checking it out, ended up staying awake all night.”\n“The social aspect of VR is amazing. AltspaceVR does one hell of a good job connecting people together. Loads of fun.”\n“90% of my time spent in VR is in this.”\n--\nIf you have any technical issues, please contact support at http://help.altvr.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"AltspaceVR","platforms":[{"id":0,"name":"PC"}]},{"id":4296,"name":"WAY OF THE SAMURAI 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/160/1601c86a8cadf27346ff6f5655ec77a2.jpg","description":"The Way of the Samurai series is widely renowned for allowing players to make far-reaching decisions that can radically alter the course of the story and this, the fourth entry in this thrilling series and previously exclusive to the PS3, is no exception!  Now all the sword wielding action, adventure and drama of the Way of the Samurai series comes to PC for the very first time, continuing the series’ blend of customization, exploration, action gameplay and quirky humour.\nWay of the Samurai 4 takes place in the humble port town of Amihama during the mid 19th Century, several years after the arrival of the “black ships” from the West ended Japan’s long history of cultural isolation.  Amihama’s downtown area has slowly been converted to a “Little Britain,” complete with European-styled buildings, occupied by an influx of adventurous foreign settlers.  Not everyone welcomes these new residents though, and three distinct factions with opposing ideals begin to take shape.\nYou must take on the role of a master-less samurai looking to establish yourself in this conflicted land of opportunity and uncertainty.  It is up to you to decide which faction to support in an almighty conflict amongst the region’s three powers, and so direct the course of Japan’s history.\nWill you aid the shogunate pro-government in their attempts to keep the peace and establish cordial relations with the foreign contingent?\nWill you help the nationalistic isolationists in their attempts to exile this potential threat to the Japanese way of life?\nOr will you ally with the foreigners directed by the British Navy in their attempts to establish silk trade and foster cultural exchange?\nWho will you support? Who will you betray?  Become the ultimate bastion of virtue or the ultimate disgrace to humanity, and do it however you'd like.  The choice is entirely your own...\nCome join the denizens of this conflicted harbour and enjoy all the series staples you've come to expect from Way of the Samurai:\n•\tBranching storylines with multiple endings\n•\tDynamic combat system\n•\tVast array of melee and gunpowder weaponry\n•\tExtensive character customization\n•\tKey event decision making\n•\tSword collecting\n•\tOriginal Japanese voiceover with English subtitles\nThis PC conversion also features a number of improvements over the original, ensuring that PC gamers receive the best gaming experience possible:\n•\tImproved user interface with both gamepad and keyboard support\n•\t8 stunning Steam Trading Cards to collect!\n•\tSteam Achievements\n•\tCloud Saves\nWhat the reviewers had to say about the PS3 version\n“Ridiculously over-the-top Japanese historical setting combined with samurai badassery and an open-world, Choose Your Own Adventure–style interface.” - EGM\n“I can recommend this game to anyone who is a diehard fan of samurais and enjoys a good combat system wrapped around a unique way of telling a story.” - Darkstation\n“...a unique, rewarding experience that to date, can't be found anywhere else.” – Destructoid","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"XSEED Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":3806,"name":"Tiny Brains","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3d/e3df3c9956e7668994478aeafa510c06.jpg","description":"\"Tiny Brains\"  is a cooperative action puzzler that follows four super-powered lab animals in their attempt to escape a mad scientist's experiments.  In this joyously chaotic multiplayer game, the four \"Tiny Brains\" must combine their unique physics-based powers to navigate through a trick-ridden maze. All of the puzzles in \"Tiny Brains\" can be solved multiple ways depending on how groups combine their powers. The game has competitive and challenging fast paced communicative play along with simple controls so players of any level can jump right in.\n\n###Key Gameplay Features\n\n* Cooperative Gaming: Tiny Brains requires players to collaborate and put their heads together to overcome physics-based obstacles. With each player controlling a different superpower – Create, Force, Vortex and Teleport – the Tiny Brains must work as a team to move forward and escape the scientist’s deadly labyrinth of mazes.\n* Play It Your Way: All of the puzzles in Tiny Brains can be solved multiple ways depending on how groups combine their powers. The co-op level design creates dynamic, emergent gameplay, whether advancing through the campaign mode, beating time-based challenges, or competing in endless levels.\n* Whimsical World: To escape the mad scientist’s lair, players explore a colorful world of Popsicle stick-like ice pops, duct tape, tiny cages and Rube Goldberg machines. The zany art style gives rise to a slew of slightly mutated, yet oddly cute, playable characters.\n* Hardcore to Casual: Tiny Brains eggs on hardcore gamers with competitive leaderboards and fast-paced communicative play, challenging them to combine their powers as efficiently as possible. At the same time, the game has simple controls and physics-based mechanics that make it easy for casual and less-experienced gamers to jump right in.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":2382,"name":"MotoGP 15","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/143/143ba624ba51f092305492d97c37a21e.jpg","description":"Are you ready for the new challenges of MotoGP™15? Compete against MotoGP™, Moto2™, and Moto3™ riders on the 18 circuits of the 2015 championship in a bid to win the world champion title!\nMotoGP™15 is back with a range of new features to guarantee an even more comprehensive and compelling experience. The career mode has been expanded with the introduction of Personal Teams, the AI and physics have been overhauled and optimized with improved interaction between bike and rider, and a new game mode sees you trying to beat the times set by the best riders in each category.\nMotoGP™15 allows players to experience first-hand the adrenalin-charged world of the most exciting championship in motorcycling!WHAT’S NEWPersonal Teams\nFor the first time ever, in Career mode, you can create your own personal team: purchase the bike you prefer, choose the team name and logo that best represents your own personal style, and customize your team livery and colors! At the end of each race, in any mode, you will receive GP Credits on the basis of the results you get on the track and the objectives achieved. As your reputation grows, you'll attract the attention of ever more distinguished sponsors, who'll ask you to achieve ever more difficult objectives.\nPhysics and A.I.\nThe new riding model means bike behavior is even closer to actual race prototypes, resulting in a more immersive and authentic experience. Improved tire simulation, combined with the new bike physics, guarantees you an even more precise and exciting riding experience. Rider and bike now enjoy an improved symbiosis: every dip in the track, every time the rider brakes hard, every time the bike starts to drift, the rider reacts with dedicated animations.\nImproved artificial intelligence guarantees a greater and more realistic challenge: your rivals are now more decisive and effective when overtaking, they make more mistakes pushing the limits, and their times are closer to those of their real-life counterparts.\nBeat the Time\nWith the new Beat The Time mode you can put your skills to the test by riding round a circuit and trying to beat the record set by the champions of each class, riding the same bike they were riding, with the same set-up. Have you got what it takes to beat the best on equal terms?GAME FEATURESOffline Game Modes\nPut yourself to the test riding in a variety of different game modes: hit the track straight away with an Instant Race, customize the event and your bike to race in Grand Prix mode, or participate in all 18 Grand Prix by racing in the Championship. Set track records playing Time Attack, and relive the most spectacular moments of the MotoGP™ 2014 championship with Real Events, or take on challenges from the past in the 2-Stroke Events mode.\nOnline Game Modes\nWith online play for up to 12 players, you can challenge your friends in Grand Prix and Championship modes. Try the Split Time mode, where only the most consistent rider will have a chance of winning: beat your rivals' sector split times over as many laps as possible!\nYou can also climb the international leaderboards to become champion of the MotoGP™ Sprint Season, a series of races where the challenge level increases with each new race.\nRoster\nThe complete official roster of the 2015 Motorcycle World Championship awaits you! The game features all the riders and teams of the MotoGP™, Moto2™, and Moto3™ categories from 2015 and 2014. They are joined by legends from the past, from Wayne Gardner on his NSR 500 to Noriyuki Haga on his YZR500: can you tame these bikes with their two-stroke engines and no electronics?\nTrack list\nIn MotoGP™15 you can race on all 18 official tracks from the 2015 championship.\nLosail International Circuit\nCircuit of the Americas\nTermas de Río Hondo\nCircuito de Jerez\nLe Mans\nAutodromo del Mugello\nBarcelona-Catalunya\nTT Assen\nSachsenring\nIndianapolis Motor Speedway\nAutomotodrom Brno\nSilverstone Circuit\nMisano World Circuit Marco Simoncelli\nMotorLand Aragón\nTwin Ring Motegi\nPhillip Island\nSepang International Circuit\nComunitat Valenciana - Ricardo Tormo","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":891532,"name":"Death Stranding 2: On The Beach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b85/b85bc300d42588af66fb516b7563f74f.jpg","description":"Embark on an inspiring mission of human connection beyond the UCA. Sam—with companions by his side—sets out on a new journey to save humanity from extinction. Join them as they traverse a world beset by otherworldly enemies, obstacles and a haunting question: should we have connected? Step by step, legendary game creator Hideo Kojima changes the world once again.","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PlayStation 5"}]},{"id":881441,"name":"The Past Within","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5c/b5c7d7fa2eb9f136cedb51701384564a.jpg","description":"Note: The Past Within is a co-op only game. Both players need to own a copy of the game on their own device (mobile, tablet or computer), as well as a way to communicate with each other. Play together with a friend or find a partner on our official Discord server!\nThe past and future cannot be explored alone! Team up with a friend and piece together the mysteries surrounding Albert Vanderboom. Communicate what you see around you to help one another solve various puzzles and explore the worlds from different perspectives!\nThe Past Within is the first co-op only point-and-click adventure set in the mysterious world of Rusty Lake.\nFeatures:\n▪ A co-op experience\nPlay together with a friend, one in The Past, the other in The Future. Work together to solve the puzzles and help Rose set her father’s plan in motion!\n▪ Two worlds - Two perspectives\nBoth players will experience their environments in two different dimensions: 2D as well as in 3D - a first-time experience in the Rusty Lake universe!\n▪ Cross-platform\nAs long as you can communicate with each other, you and your partner of choice can each play The Past Within on your preferred platform: PC, Mac, iOS, Android and (very soon) Nintendo Switch!\n▪ Playtime & Replayability\nThe game contains 2 chapters and has an average play-time of 2 hours. For the full experience, we recommend replaying the game from the other perspective. Plus you can use our replayability feature for a fresh start with new solutions to all puzzles.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Rusty Lake","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":270722,"name":"The Wild at Heart","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8bb/8bb4e8cc054157c9897f5ef31796165b.jpg","description":"A mysterious hidden realm. Two precocious kids fleeing hardship. Magical creatures and an oddball order of guardians who have lost their way. A stygian evil imprisoned. Welcome to the Deep Woods.\n\nAmass your Horde\n\nCollect and deploy a swarm of quirky Spritelings; small magical creatures for you to command. Break stuff, collect loot, fight enemies, build new paths, and more!\n\nExplore\n\nA unique and sequestered world rich with centuries full of lore. Woods, caves, coastline, ancient shrines... The Deep Woods is full of puzzles to be solved and secrets waiting to be uncovered.\n\nCollect & Craft\n\nGather rare resources like magical crystals, scrap, electrical components and more to build new structures, items, and upgrades!\n\nBattle\n\nTake on precarious wildlife and supernatural foes with the unique abilities of your Spriteling swarm and your trusty vacuum, the Gustbuster!\n\nNightfall\n\n\"The dark is bad!\" - A common saying among the denizens of the Deep Woods, and for good reason. Malevolent beings lurk in the shadows here and you may just find yourself wanting to stay near a campfire light until sunrise.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Moonlight Kids","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"}]},{"id":60631,"name":"RUSSIA BATTLEGROUNDS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/388/3889a99c4baa6dfc221c68ccfb00c950.jpg","description":"RUSSIA BATTLEGROUNDS  is a multiplayer battle royale shooter and your trip to hell. Here start's battle of unarmed prisoners, in which the strongest wins. Also, you are waiting for unusual meetings with unknown anomalies and mysteries. Only your aggression and cruelty will help you to save your skin by killing all the players to last one. Welcome to Mother Russia.\nFeatures:\nRetro-style\nMany unusual locations and secrets\nDynamic gameplay\nHighest level of optimization\nTranslation into 24 languages (Ugandan too)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Agafonoff","platforms":[{"id":0,"name":"PC"}]},{"id":58866,"name":"Coil","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f77/f77770b77ea63c993a07747e503d9b26.jpg","description":"Coil is an experimental \"autobiographical\" game that plays out more like a song or painting then an actual \"game\". I was basically trying to create an experience that put the player into an open minded space and let them question not only what the game was about, but what a game can actually be.\nCoil uses mouse movements only, no keys or clicking is involved at all.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":21696,"name":"Luxor: 5th Passage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d4/3d497cc5a130505813ee6464c14b2db5.jpg","description":"Get ready to wield your winged-scarab shooter in an all-new LUXOR, the #1 action-puzzle game of all time!\nNavigate your shooter to ensure matches of three or more—fire colored balls into the advancing chain of colored spheres to eliminate them before they destroy the pyramids.  Unlock all 20 achievements as you collect Ankh coins for extra lives and catch falling treasures for big bonus points.\nSave ancient Egypt in the 100-level Adventure mode, or test your accuracy in all-new Blast mode—the 2-minute timed mode that challenges you to rack up the points.  Or play through People’s Choice mode, where we give you 15 of players’ favorites levels from LUXOR 2, LUXOR 3 and Quest for the Afterlife!\nMaster four new power-ups: the powerful Double Shooter, the devastating Black Hole, the ruinous Spiker Ball, and the deathly Lead Barrage.  Outfitted with 25 all-new backgrounds and pathways, LUXOR Fifth Passage also introduces the Eye of Horus—click the button when you’re in a real jam to eliminate all remaining spheres.  And, for the true LUXOR Pharaoh, an Insane difficulty level to test your marble-shooting skills!  Celebrate 5 years of LUXOR’s reign in the 5th Passage!\nKey Features:\n100 all-new Adventure Mode levels\nClassic LUXOR game play style with 25 all-new backgrounds & pathways\n4 difficulty levels: Easy, Medium, Hard & INSANE\n20 Achievements to earn\nAll-new Blast Mode lets you test your skills in two minutes!\nPlayers’ Choice Mode includes 15 fan-favorite levels from LUXOR 2, LUXOR 3 & Quest for the Afterlife\nEye of Horus lets you summon the Pharaoh to destroy the remaining spheres!\n4 all-new power-ups: Double Shooter, Black Hole, Spiker, & Lead Barrage\nNew bonus stage\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"MumboJumbo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21293,"name":"Luxor 3","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8d/d8de560d73531b31a6d657c5adeb2302.jpg","description":"A brave young Pharaoh, killed prematurely by a fierce sandstorm and embodied by the gods as a skillful scarab, must battle the powerful god of Chaos, Set, to free the essences of other Egyptian gods contained within colorful magical spheres.\nStop the procession of approaching spheres as they journey through the maze by matching three or more. Call upon the gods, denoted by color, to release specific power-ups and purchase upgrades with Ankh coins collected during gameplay. Free all the gods from captivity before they reach the pyramid at the end of their path, or all is forever lost.\nOriginal music, enhanced animation and even more spectacular effects\nSeven unique game modes, including five never before seen\nOver 140 nail-biting levels of gameplay\nChallenging and dynamic play with branching and merging pathways\nUtilize reflectors to make matches that were otherwise impossible\nUpgradable power-ups plus exciting ball sets and shooters to unlock\nNew bonus level gameplay introduced","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"MumboJumbo","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":19791,"name":"Shan Gui (山桂)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2b/c2b6f8b5b4d94112a6fda0e7aaaa7ca5.jpg","description":"It is the end of summer. Han Hui, a university student, meets a mysterious young girl named He Jia in the mountains. After this chance meeting, the two embark on a delightful journey.\nShan Gui is a short, linear, kinetic visual-novel set in Nanjing's gorgeous Purple Mountain. It follows the adventure of two young girls as they tour the park, attempting to recount faded childhood memories. Han Hui is moody and depressed until she eventually becomes enraptured by He Jia's overwhelming warmth and happiness. In He Jia, Han Hui finds respite from her sadness and a brand new friend... a friend who may be more than she suggests.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Magenta Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19704,"name":"Praetorians","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff5/ff5cf626489180be6eaf191dfe28bec7.jpg","description":"Praetorians is set amidst the political machinations of an emerging Roman Empire. You will be transported back to the dusty battlefields of Egypt, the combat theaters of Gaul and finally to the heart of the Empire itself, Italy in the crusade to become Emperor. Your quest will not be easy, as the Empire is heavily defended by thousands of different troop types and war machines, all with special skills and individual strengths. The road to becoming Emperor depends on strategy! You must learn to combine your units and exploit the weakness of the enemy, but as you get closer to the Emperor things become even more difficult as you must face his personal guard, the most powerful and deadly fighting force in the Empire - The Praetorian Guard!Key FeaturesThree different armies: Gauls, Egyptians and the Roman Legions\nUnique sets of abilities and formations for different unit types and characters\nFast-paced action were things can easily go from hectic to wrong","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Pyro Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17669,"name":"Mystic Towers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e9/9e967a64dee9280221030107359479f3.jpg","description":"Mystic Towers is an action-oriented and puzzle-filled adventure about exploration and magic. With over 30 different monsters able to crawl, slither, fly, roll, hop - and anything else you can imagine - there’s no shortage of game to play and enemies to slay.\nBaron Baldric can jump, push, pull, flip switches, open doors, climb ladders and succumb to poison. He also has a map and various weapon spells, including fireballs and venom.Features\nNever Too Old: Navigate 540 rooms packed with monsters and puzzles using a mouse, keyboard or joystick.\nSave Your Game: Save your game whenever and wherever you want!\nMaster Magic: Use spells like: Healing, Reveal (which finds secret areas), Levitate, and Teleport.\nNew Tricks: Look under objects, push buttons, flip switches and move almost any item.\nTraverse the Tower: Climb ladders to new levels, teleport to new locations and cross invisible bridges and platforms.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Animation F/X","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16324,"name":"Pepe Porcupine","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e79/e79ede625a8344ee6778536cd1321b4c.jpg","description":"Pepe Porcupine works the nightshift in a warehouse and needs your help! Each night his job is to move crates into position in a confined area with the least amount of work. Inspired by the Japanese game of Sokoban, which is a transport puzzle, in which boxes or crates are pushed about in a warehouse, your task is to correctly position crates with the least amount of pushes and moves. Played from a top-down perspective on a board of squares, crates can be shifted horizontally or vertically into empty squares, but never through walls or obstacles. Crates cannot be pulled, adding to the fun, and unless you help Pepe complete all 254 puzzles, he’ll be stuck at the warehouse forever!Key Features:254 mind-bending puzzle challenges\nUndo-feature when you make mistakes\n“Head Scratcher” mode and “Head Banger” mode!\nGreat graphics and fun animations","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":14825,"name":"War of the Human Tanks","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d02/d0212f6775f196b60285bb20a249503f.jpg","description":"War of the Human Tanks is a story driven strategy game with a gameplay reminiscent of Battleship and Chess, featuring a story of war, loyalty, sacrifice and human shaped tanks.\nThis story takes place in a land vaguely reminiscent of modern-day Japan. In the twenty years since the first Human Tank was developed, the war raging between the Empire of Japon and the Kingdom of Japon has turned into a proxy war fought between Human Tanks on both sides.\nThe Empire of Japon once ruled the entire land of Japon. Now diminished and cornered, the Empire prepares to make its last stand as the tanks of the Kingdom of Japon draw close to its capital. Shoutaro Daihon'ei, Lieutenant of the Imperial Army moves out to the battlefield, followed closely by the loyal Human Tanks in his company.Key FeaturesFast-paced strategic battles in over 30 maps\nUse resources earned from battles to develop new tanks\nCustomize your tanks with various modules to deadly effect\nMultiple endings based on your performance\nReplay the story keeping your previously earned units and resources\nFree battle mode to practice and gather extra supplies\nEnglish localization features two all-new bonus maps, hand-drawn battle backgrounds and an improved user interface\nEpisodic TV drama style story with openings and endings changing by battle's progress","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Yakiniku Banzai","platforms":[{"id":0,"name":"PC"}]},{"id":4447,"name":"Dynasty Warriors Next","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f3e/f3e4794ddc201e80c42d6fe66455edd3.jpg","description":"Experience a new type of DYNASTY WARRIORS® action created from a blend of the characteristic WARRIORS style simple controls with new intuitive controls made possible through the functions of the PS Vita system.\nEnjoy greater immersion in battle. Enjoy direct tactile interaction using the touch pad, more physical involvement in the WARRIORS world with motion sensors, and an intriguing drama that brings it all together.\nDYNASTY WARRIORS NEXT, the TECMO KOEI logo and the KOEI logo are registered trademarks of TECMO KOEI GAMES CO., LTD. ©2011 TECMO KOEI GAMES CO., LTD. All rights reserved. Portions of this software utilize SpeedTree® technology (©2010 Interactive Data Visualization, Inc.) SpeedTree® is a registered trademark of Interactive Data Visualization, Inc. All rights reserved.  The ESRB ratings icon is a registered trademark of the Entertainment Software Association. All other trademarks are properties of their respective owners.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nOne-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"KOEI TECMO America","platforms":[{"id":0,"name":"PS Vita"}]},{"id":4140,"name":"Ecolibrium","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42e/42ec27b069bdd18cfa1b909f59cf732e.jpg","description":"Ecolibrium™ is an imaginative real-time eco-system simulator where the aim is to maintain harmony within your own environment. Create a balanced eco-system by choosing different combinations of species, plants, and artifacts. Show your skills by acquiring fantastical creatures to populate your world, and sell them to friends online in player-to-player auctions. Also, drop and receive gifts using near.\nCompete with other users in the online challenges and climb up the global leaderboards to prove you have the dominant eco-system.\nDISCLOSURE REGARDING USE OF LOCATION:  This game interacts with other applications that use location data (such as “near”).  To turn off location data, go to [Settings] > [Location Data]. This item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\nThis item may be used with up to 2 activated PlayStation® devices associated with this Sony Entertainment Network Account.  Please see software description for device compatibility.\n©2012 Sony Computer Entertainment Europe. Ecolibrium is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":720949,"name":"Turbo Overkill","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfb/cfbcd421991cb6ced0b6b9448f0b9d3f.jpg","description":"Half-metal, half-human, half-crazyHeavily inspired by some of the all-time greats like Doom, Duke Nukem and Quake, with stunning cyberpunk visuals, Turbo Overkill is the most savage FPS ever released by Apogee. You play as half-metal, half-human, half-crazy Johnny Turbo, augmented with hidden arm rockets and a chainsaw that extends from your lower leg allowing you to kick-slice enemies wide open.\nIn this Blade Runner-meets-DOOM hellscape, Johnny returns to his hometown of Paradise and finds its entire population possessed by Syn, a rogue AI, and its army of augmented minions. Desperate for enough money to outrun his past mistakes, Johnny takes on the impossible job of destroying the greatest AI ever created. Rival bounty hunters want to claim the prize first. Nothing is easy in paradise.\nHero Time, wall-running, dashing and grappling hooks, oh myTurbo Overkill takes over-the-top to never-before-reached heights. Activate Hero Time(™), a new form of slow motion with a twist. Build incredible speed by wall-running and dashing. Slide on your chainsaw leg, eviscerating foes and opening up bosses for critical damage, and go car-surfing on the hoods of flying cars. Blast away with the Twin Magnums, which lock-on and instagib several foes, the Boomer Shotgun and its attached grenade launcher, or the Telefragger sniper rifle, which teleports Johnny inside an enemy before they explode from within. The FPS genre is about to get wild and fun again.\nRace through two dozen stages packed with secrets, bonus arena stages, and white-knuckle combat puzzles. Find game-changing collectibles to unlock punishing modifiers like triple-monster-speed and insta-kill. Combine all of Johnny’s weapons and powers to outsmart, outgun and outrun the corrupted legions.\nTL;DR:o Kill a boss, get its augment (special power)\no Play Spider-Man with your grappling hook\no One-up Duke Nukem with your chainsaw kick\no Kills = cash. Use cash to install augments, upgrade your weapons, and add new abilities in your talent tree\no Be a ghost runner while wall running\no Attack from above riding the hood of your flying car like a kung-furious badass\no Mini-rockets built into your robotic arm? ✔\no This. List. Will. Grow. Wishlist the game to see it happen\nDon't quote us on nuthin'“Turbo Overkill is fast, frenetic and ferocious—excess personified,” said Sam Prebble, one half of Trigger Happy Interactive. “This is the game we’ve always wanted to play; making it is a dream project. Relentless enemies, extremely deadly and fun weapons, speed and precision above all else—if you love Quake III Arena, modern and classic DOOM, or Apogee’s legendary first-person shooters, you’ll feel right at home in Paradise.”\n“As the guy who helped launch the shooter genre with Wolfenstein 3D, Rise of the Triad, Duke Nukem 3D, Max Payne, and Prey, I haven’t been this excited about an FPS since the golden era of Apogee/3D Realms,” wrote Scott Miller, founder. “Turbo Overkill is a sandbox of fun and original gameplay ideas that come together like a night of melty hot pizza and your favorite cold, frothy brew. Playing this game made me a Turbo Lover all over again.”","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Trigger Happy Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":275672,"name":"GuJian 3 古剑奇谭三","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a54/a5419f7e35ce6d767e79233580d95233.jpg","description":"Gujian 3 is a mass 3D single-person RPG developed by Aurogon Info & Tech (Shanghai), a subsidiary of Wangyuan Shengtang. As the latest hit of the Gujian series, it boasts more free and smooth combat experience with its full real-time combat system. This generation expands the world of Gujian based on previous works. The vivid and beautiful graphic style brings the scenery, people and stories from an ancient time to life and truly makes the game world alive!\n\nThe story background of Gujian 3 is a fantasy world built upon the elements of ancient China, therefore, players will experience rich cultural context all over the game, adding daring and limitless imagination to this oriental fantasia.\n\n> Classic Single-player Game, Brand New All-real-time Combat\n\n[Free of Travel] Start fighting directly after entering combat without switching into combat scene. Enemies will take cover using the terrain and environment objects and try to ambush the player.\n\n[Special Combo Attack] Free combo between light and heavy attacks will generate Energy and Morale points while dealing damage, releasing powerful Special Attack/Morale Attack when reaching certain Energy/Morale value.\n\n[Use Strategy to Win] During combat, characters can switch to defense stance or dodge attacks at any time. However, these would cost Stamina points, so players will need to choose their strategies wisely according to the situation to keep their fights under control.\n\n> Constellation System and Powerful Pact Creatures\n\n[Constellation System] A simplified Constellation System that shows each character’s Constellation builds. Players can check and adjust Constellation with just a few clicks.\n\n[Pact Creatures] Make pacts with various creatures by fulfilling their conditions, then summon Pact Creatures to assist you in combat or at Lotuscape. Each race has different skills that could greatly increase combat efficiency when used properly.\n\n> Enjoy Your Life in a Fully-updated Lotuscape System\n\n[Research & Crafting] New feature of the Lotuscape System allows players to invite artisans to Lotuscape for researching and crafting. Control Percy to help artisans solve unexpected troubles they encounter during their research. When the research is complete, artisans will be able to make them in batch.\n\n[Pact Creatures] Besides combat participation, pact creatures can also assist players in Lotuscape duties including farming, mining and exploring. When they’ve gained enough experience points, the creatures will level up and be of much greater assistance.\n\n[Decorate Own Space] More options when decorating Lotuscape. Find or craft houses, fences, floors, plants, rockery hills, tables, chairs and other items and decorate the Lotuscape courtyard of your own style.\n\n> Enjoy Leisure: Lost Tales & Questboard\n\n[Lost Tales] A special in-game card game, Lost Tales. Easy to catch up with the help of tutorials, even for players new to the series.\n\n[Questboard] As a classic element of the series, Questboard can still be found standing by the streets, providing plenty of quests for the players while telling the stories about the Gujian world and characters.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wangyuan Shengtang Entertainment Technology CO.","platforms":[{"id":0,"name":"PC"}]},{"id":59704,"name":"Game Dev Studio","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/747/747a756b301d52885cab89617caa5759.jpg","description":"Welcome to your own Game Dev Studio!How will you run your own offices and ascend to greatness in the gaming industry?\nNon-linear progression. Fill the empty spaces in your office with any objects you wish, and when you run out of space, buy a new building to continue expanding!\nFind the best employees for your studio. Employees have their skills, attributes, traits, interests, and knowledge on topics.\nCreate multiple teams, work on multiple game projects at once, or reach for the stars by focusing all your workpower on one game.\nJust don't forget that you won't get to keep your employees forever.\nRev up those engines. Make game engines, update them with new tech, and revamp them when the code gets too messy!\nMake awesome games. Employees? Check. Game engine? Check. Now it's time to make great games!\nHype it up! Advertise your games through a multitude of ways: invite reviewers for an interview, start a mass advertisement campaign, contact online personalities to create early playthrough videos of your game, hire agencies to shill your game online, and even bribe reviewers!\nShow your rivals who's boss of this industry. Your rivals are on the lookout for talented developers just like you are, so get ready to fight off their attempts to lure your employees away with higher salaries. Give them a taste of their own medicine and buy them out when they go under!\nSway the odds of platform manufacturers. Games you release influence the fate of platform manufacturers for which they're made.\nGood games will make a platform more attractive to gamers and change its market share for the better.\nNever a dull moment. Story mode, four extra campaigns, a freeplay mode, and the ability to randomize various aspects of the game at the beginning of a playthrough make for greater replayability.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Roman Glebenkov","platforms":[{"id":0,"name":"PC"}]},{"id":43454,"name":"Dead Star","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b8/9b8a06bef9e80f085a1933bcf3bb05d9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Armature","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":27967,"name":"New Super Mario Bros. U","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f7/5f74872bea96cb395a0514bbe54e7b5a.jpg","description":"New Super Mario Bros. U is a new, side-scrolling adventure featuring\nMario, Luigi, Toad … and your Mii character. Now’s your chance to step\ninside the Mushroom Kingdom and explore new worlds, new power-ups and\nnew ways to play. Up to five players* can jump into the fun, with up to\nfour people using Wii Remote controllers and one on the Wii U GamePad.\nThe experience is different, depending on which controller is used.\n\nThe Wii U GamePad controller offers a new way to experience\nmultiplayer Mario fun. Create Boost Blocks out of thin air to help\nplayers navigate tricky stages or access hidden orhard-to-reach items,\nand distract onscreen enemies, all with the tap of their finger or\nstylus.\n\nSwoop through levels and cling to walls when Mario transforms into\nFlying Squirrel Mario, or gently float through the air while hanging\nonto Balloon Baby Yoshi.\n\nBoost Mode also makes cooperative speed runs possible for the first\ntime. Use the GamePad to interact with and manipulate enemies and\nobjects in real time, and discover new ways to find the fastest route\nthrough each stage.\n\nIn addition to the main Story Mode, in which players must rescue\nPrincess Peach, New Super Mario Bros. U features three more exciting\ngame modes, including: ◦ Boost Rush: Using Boost Mode, two to five\nplayers work together to clear many different courses in the fastest\ntime possible. The scene auto scrolls, forcing you to move ahead\nthrough the course. As you collect more coins, the scene scrolls\nfaster. Once you’ve completed your run, you can watch a replay of\nother players’ Boost Rush to help strategize for your next attempt. ◦\nChallenge Mode: Numerous single-player and multiplayer challenges\nincorporate a series of familiar Super Mario gameplay concepts in a\nfun, competitive way. These challenges offer high replay value as\nplayers try to achieve the best score and unlock new challenges. Boost\nMode Challenges help players practice the teamwork necessary for\neffective Boost Mode gameplay. After finishing, players can watch a\nreplay of their Challenge to strategize for next time.\n\nPlay on the big screen or the small screen. Switch single-player\ngameplay from the TV to the GamePad at any time to continue playing\neven when others are using the TV.\n\nFamilies and friends can experience Mario together like never before\nwith Miiverse. See other players’ comments and accomplishments while\nyou play, and leave your own feedback for others to see when connected\nto the Nintendo Network (broadband Internet access required).\n\nIn-game content available for purchase using stored account funds.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"}]},{"id":21560,"name":"Midnight Mysteries","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff7/ff7b7662957ea1191c733a425fcf9747.jpg","description":"The master of macabre, Edgar Allan Poe, leads you on a shadowy journey to finally solve the mystery of his death. As a famed mystery writer, you’re looking for your next cold case to crack when an unexpected visitor hands you the perfect case to get your career moving again.\nWhen Edgar leads you through some of his most famous works, The Raven, The Gold Bug, The Mystery of Marie Roget and The Purloined Letter, you’ll collect clues, interview witnesses and piece together the conspiracy behind the death of one of America’s greatest writers.\nWho killed Edgar? And, why were such measures taken so that no one would ever know the truth? You have 24 hours and ghosts of the past to guide you through Midnight Mysteries: The Edgar Allan Poe Conspiracy!\nCelebrate 200 years of Poe in this seek and find murder mystery\nHidden object adventure lets you crack a 160-year-old case\nGuided by Poe himself, you'll collect items and clues through his most famous works\nSolve intriguing puzzles to figure out exactly whodunit!\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":20613,"name":"Real Horror Stories Ultimate Edition","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29a/29a1a4b95c4532e2eac265090bc5d55e.jpg","description":"Urban myths  are stories that may or may not have been believed to be true. Unlike most, some are actually based on real events. One of them, takes place in a haunted forest, near a cemetery, on the borders of a city, near you. Many consider this place dangerous late at night, because there are things happening that nobody knows of or wants to know.\nReal Horror Stories is a point and click horror adventure. The goal of the game is to clear each level. At first it may seem easy but the choices are not always what they seem. You will need to find the right combination of objects to click in order to proceed. Along the way you will encounter puzzles that you need to solve in order to advance to the next level. However, once you understand the gameplay , ghosts , demons and monsters jump out of nowhere to take or scare you! The game is very creepy, especially if you try to play it at night. You will definitely get into the mood immediately. Turn the lights off, put on your headphones and try it...\nFeatures:\n• The Ultimate edition of the popular internet game\n• All levels altered for the most terrifying experience\n• Even more jumpscares!\n• Graphics updated to HD\n• 17 levels / 6 NEW horror puzzles\n• New alternative ending\n• Additional help guide (red spot)\n• Tips/Support document included","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"GameORE","platforms":[{"id":0,"name":"PC"}]},{"id":19687,"name":"Ghost Pirates of Vooju Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80a/80ac9937dcafacc03f7187f967eae131.jpg","description":"Mysterious Things are Happening on Vooju Island...\nLegendary video game writer and developer Bill Tiller (The Curse of Monkey Island, A Vampyre Story) tells a gripping tale of pirates, ghosts, and mysterious Vooju magic. Vooju priest Papa Doc, bumbling cook Blue Belly, and impetuous pirate Jane Starling have fallen victim to the nefarious plans of the Papa Doc’s wife, the devious Queen Zimbi. The nefarious Zimbi has used her mysterious Vooju magic to curse and transform our three intrepid characters into ghosts. Can you help them rejoin their bodies before they join the ranks of the undead forever?\nSet amidst a mythical Caribbean world of Vooju magic and unmistakable pirate humor, Ghost Pirates of Vooju Island challenges you to help the heroic ghostly trio regain their human forms and thwart the dark machinations of the Vooju priestess and her pirate allies. The fate of the entire world lies in the hands of these three unusual heroes!Key FeaturesTickle your funny bone in this lovingly hand-painted game world, with a story penned by legendary video game creator Bill Tiller\nCombine the abilities of the three playable main characters to outsmart the pirates\nPlay as a ghost and human, and use Vooju magic to solve mysterious puzzles\nMeet a huge cast of creepy and hilarious characters","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Autumn Moon","platforms":[{"id":0,"name":"PC"}]},{"id":19488,"name":"UFO: Extraterrestrials Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a70/a70cde25c38c4cbc3c0690ec668463cf.jpg","description":"UFO: Extraterrestrials GOLD is a new GOLD edition which includes a number of changes and improvements giving a player a new look on the classic game: new maps, possibility to hire soldiers, globe UFO swarms and configurability. UFO: Extraterrestrials GOLD represents fiction in which the human race faces a threat from space, aimed to be a spiritual sequel developed by Chaos Concept. The game picks up where the original left off, incorporating a twist of the aliens defeating Earth. The game is set on a newly colonized planet named Esperanza, where the alien threat has just arrived.\nNew items to research and produce:\nProximity Grenades,\nPersonal Energetic Shields,\nJetpacks\nAutoguided Rocket Launcher with ballistic ammo\nCyborg Battlearmor.\nHydraulic Suite and many others\nOther New Features\nRadar map in missons and a combat log\nPossibility to hire soldiers\nCooperating UFO swarms on globe\nPerformance optimizations\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Chaos Concept","platforms":[{"id":0,"name":"PC"}]},{"id":16772,"name":"Day One: Garry's Incident","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3cf/3cf9592d91cc45231362a460f6ef8bb5.jpg","description":"New Free DLC\nSURVIVAL - CRAFTING - ADVENTURE\nExplore a vast hostile environment while crafting new tools to help you survive. Discover intriguing puzzles and the mystery behind the strange remains of artifacts left in the Amazon Jungle.\nKey Features :\nStart with nothing and craft, hunt, fish and fight to survive.\nHunt panthers for their meat\nCatch fish and find fruits\nBuild fire and cook your food\nSearch for water sources\nSneak behind enemies to perform stealth kills\nWorld Exploration & Survival gameplay\nCraft tools and weapons to survive in the jungle\nPatch yourself up with makeshift bandages\nAdjustable FOV\nStory :\nGarry Friedman, a veteran bush pilot in his early 40’s , still broken down emotionally after a tragic accident involving his wife and his little girl, drowns himself in alcohol every night to escape his torment. Now numb to the constant dangers he faces, Garry keeps signing up for impossible jobs; he gets the cash, doesn’t ask questions, business as usual. Some doubt his motives but Garry needs this danger now, he needs the adrenaline, it’s the closest he gets to feeling alive again.\nOn Friday, June 13, 2014, a transport job has him going to a research facility in Yellowstone and bringing the some cargo to Nevada; the drop coordinates would then be updated during the mission. But Garry would never reach his destination…\n0700 hours, slight ground vibrations, not strong enough for anyone to notice.\n0735 hours, Garry has loaded the cargo and is flying off\n0740 hours, The Yellowstone super volcano starts erupting\nThe sudden gushes of poisonous fumes send Garry and his plane spiraling through the skies. While he tries to regain control, the artifacts inside his cargo start to activate. A sudden burst of energy explodes and suddenly Garry`s plane, and everything with it, crashes into the Amazonian jungle; the drop slowed down by the enormous flora.\n0750 hours, Garry blacks out. The carcass of his plane lies amongst the trees.\nWild Games Studio presents:\nAn extraordinary adventure awaits, where you will need to survive through hostile environments, explore ancient civilizations, and discover a truth that will change your understanding of the world, forever!\nThis cargo might have saved your life once, but what happens next?\nIt’s all up to you …Day One","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Wild Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16460,"name":"Radical Spectrum: Volume 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/857/857d6350665de7eb1c575ddd2240bd3c.jpg","description":"A band of aliens led by the careless Prince FaceBox have invaded the future city of Nucleusport, bombarding it with radioactive waste from their own polluted planet. Only one man has the tech and the cojones to fight back. Take on the role of Doc DuBrane and wield his super-powerful Prisma Cannon in this endless arcade-style shooter. Absorb the radiation dropped by the alien ships and fire it right back in their stupid faces.\nRadical Spectrum is a classically-inspired arcade game with infinitely increasing speed and difficulty, featuring a unique color-collecting mechanic that adds a light puzzle element. Players must collect three of the same color in order to fire, and must balance risk and reward in choosing what to shoot. If black radiation touches the ground, or Doc, it’s game over, so the player must decide what is more important: destroying the UFO, or attempting to destroy the black block winding its way through the grid. Miss either way and it could be lights out.\nOn the surface the game appears simple, but requires constant attention to all parts of the screen and there’s more strategy to it than meets the eye. Choose to collect a certain color without looking at what’s coming up next and you could screw yourself over, or shoot at the wrong time and leave yourself open to black radiation hitting the ground. Go for the high score by destroying more of the grid and you give yourself fewer options for collection. Every action counts in Radical Spectrum.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Autonomic Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10153,"name":"The Franz Kafka Videogame","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/25b/25bc1eb59cd2b998818f929c4f92ed76.jpg","description":"The Franz Kafka Videogame is an original puzzle/adventure game inspired by the writings of Franz Kafka.\nThe protagonist named K. gets a sudden offer of employment. And this event changes his life, forcing him to make a distant voyage. To his surprise, the world beyond his homeland appears to be not as normal as he would think.\nTogether with K. you will experience an atmosphere of absurdity, surrealism, and total uncertainty.Key Features: \tFrom the Creator of an Award-Winning Hamlet\nOriginal Logic Puzzles\nHigh-Definition Graphics\nNo inventory. No Boss battles. No RPG features\nOnly Absurdity and Surrealism","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Denis Galanin","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":608685,"name":"Trombone Champ","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/633/633e9d367d8b3abaf47bb4c83afe9a2d.jpg","description":"Trombone Champ is the world's first trombone-based rhythm music game. Unlike most music games, you can freely play any note at any time. You're not just following along with the music, you're actually playing the music!\nToot your way through over 20 tracks. The better you play, the more toots you earn!\nCollect all 50 Tromboner Cards!\nBaboons on nearly every screen!\nImprovise and play whatever you want in Freeplay Mode!\nUncover the secrets of the Trombiverse and become the True Trombone Champ!\nAbsolutely zero microtransactions!\nPlayable with mouse and keyboard (recommended) or USB controllers!\nAppropriate for all ages!Music\nTrombone Champ features over 20 tracks, which include anthems, marches, classical pieces, electronica, folk classics, and more. The game also includes tracks from exciting guest artists. Each track has a unique animated background that moves with the music!Tromboner Cards\nUse the \"Toots\" you earn from playing songs to purchase sacks of Tromboner Cards. These cards can be used to unlock new tromboners, new trombone colors, and other mysteries!Controls\nThe game can be played with a controller, but a mouse is recommended. Move your arm forward and back, like a trombone, and the pitch of the note will slide up and down to match! Click or use the keyboard to blow! The sounds your trombone makes are completely controlled by you. The closer you are to the music track, the more points you will earn, but you have the freedom to play anything you want at any time!Baboons\nNearly every screen in the game, beginning with the main menu, features one or more baboons. You won't believe how many baboons there are in this game! As you discover the secrets of the Trombiverse, their purpose may become clear... but only a true Trombone Champ will uncover their full meaning.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Holy Wow","platforms":[{"id":0,"name":"PC"}]},{"id":58772,"name":"ISLANDS OF NYNE: BATTLE ROYALE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08d/08d701cefc3182f15330353e234c5d30.jpg","description":"A community driven First-Person-Only Battle Royale game with a core focus on fast-paced, skill-driven gameplay set in a sci-fi inspired universe where anything is possible. Drop in, find a weapon, and stay alive… for only 1 can emerge victorious. The rest must die!\nDrop into massive, alien-built arenas and begin the frantic search for weapons and gear – all while trying to stay one step ahead of the advancing plasma field… or the sights of other contenders. Use your newly found gear to hunt down other players or inevitably face them during the final stages of the match – for The Nyne will only accept one victor. Do you have what it takes?\nDesigned by competitive gamers for competitive gamers, Islands of Nyne offers a balanced and exploit-free battle royale experience with its core focus on skill-driven progression and first-person-only gameplay.\nPlay Solo, team up with a friend in Duos, or queue up as a 4-player Squad – the choice is yours. Need to warmup? Spend your queue time mowing down other players in Gun-Game, or practice your recoil control offline in your very own shooting range.\nBuilt by a technologically superior alien race, each arena is engineered to provide a unique and obstacle-ridden battlefield for players, designed to reward strategic thinking and tactical decision making.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Define Human Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":52949,"name":"Final Fantasy Tactics","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/30c/30c067f9a6736000c8faf2efe4952a9b.jpg","description":"Final Fantasy Tactics (ファイナルファンタジータクティクス, Fainaru Fantajī Takutikusu) is a tactical role-playing game developed and published by Squaresoft (later changed to Square and now Square Enix) for the Sony PlayStation video game console. It is the first game of the Final Fantasy Tactics series and was released in Japan in June 1997 and in the United States in January 1998. The game combines thematic elements of the Final Fantasy video game series with a game engine and battle system unlike those previously seen in the franchise. In contrast to other 32-bit era Final Fantasy titles, Final Fantasy Tactics uses a 3D, isometric, rotatable playing field, with bitmap sprite characters.\nFinal Fantasy Tactics is set in a fictional medieval-inspired kingdom called Ivalice, created by Yasumi Matsuno. The game's story follows Ramza Beoulve, a highborn cadet who finds himself thrust into the middle of an intricate military conflict known as The Lion War, where two opposing noble factions are coveting the throne of the kingdom. As the story progresses, Ramza and his allies discover a sinister plot behind the war.\nA spin-off title, Final Fantasy Tactics Advance, was released for the Nintendo Game Boy Advance in 2003 and a sequel to that title, Final Fantasy Tactics A2: Grimoire of the Rift, was released in 2007 for the Nintendo DS. Various other games have also utilized the Ivalice setting, including Vagrant Story for the PlayStation and Final Fantasy XII for the PlayStation 2. An enhanced port of Final Fantasy Tactics, Final Fantasy Tactics: The War of the Lions, was released in 2007 as part of Square Enix's Ivalice Alliance project. Overall, the game received positive reviews from gaming magazines and websites and has become a cult classic since its release.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]}]