[{"id":5591,"name":"Inversion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/120/120fb9bd3078ba475e525f592960592f.jpg","description":"Features:\nTest your skills.\nControl the character in reverse.\nChange the gravity.\nGet achievements for completing a level.\nThe character understands you, but moves in an original way.\nThe control arrows are set in reverse!  The main feature of the game is the control, on the contrary.\nThe main character is Mr. \"i_230\", two hundred and thirty is his serial number. The number coincides with the years of the main character's life. The main feature of the main character is his ability to move in the opposite direction!\nThe game challenges the player control is carried out, on the contrary, it is not a mistake-it is a challenge and a test!The genre of the game is a puzzle, platformer for accuracy.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":616690,"name":"Blacktail","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d00/d0045250cc21dfd18987a8986004262a.jpg","description":"You are Yaga, a 16-year-old girl accused of witchcraft and expelled from an early medieval Slavic settlement. When living memories of her past return as foul spirits walking the earth, Yaga’s best choice is to do what she does best: hunt them down.\r\n\r\nCreate the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling. Choose your path to become the guardian of the woods or the terror nightmares are based on.\r\n\r\nUse your trusty bow and gauntlet to defeat enemies throughout your journey\r\nCraft arrows and potions, hunt wild game, and harvest herbs to survive in the uncanny woods\r\nFind hidden treasures and pieces of Slavic legends\r\n\r\nFollow a mysterious voice leading Yaga down the dark path to power and discover your own past along the way\r\nTrack down elusive spirits and engage in thrilling boss fights to recollect Yaga's missing memories\r\nRelive memories to gather clues and solve the mystery of Yaga’s lost friends\r\nDive beyond the surreal. Every memory is an artfully crafted 2.5D narrative episode — each a trippy vision shedding light on Yaga’s heart and soul, as well as her mysterious origin\r\n\r\nDefine your alliances and beliefs through story-driven side quests. Decide the fate of the land and its inhabitants: be vengeful and manipulative, or honest and compassionate\r\nBLACKTAIL's Morality System will significantly impact your gameplay experience. Watch your skillset change as you make story defining choices that shift your morality\r\nCollect lost recipes from the ancient Grimoire, brew elixirs in the Cauldron to unlock skill upgrades and grow into a great power\r\n\r\nChoose your final fate and write your own fairy tale. Will you uphold the light, or will you slide into darkness?","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"THE PARASIGHT","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":419293,"name":"Gungrave: G.O.R.E.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/03d/03d4da2956ec3743cfc0c2666c40f8bd.jpg","description":"In Gungrave G.O.R.E, play the gun-wielding badass anti-hero of your dreams as you mow down tons of enemies in a gory ballet of bullets and experience a story of vengeance, love and loyalty, all in a beautiful third-person action shooter, combining the best that Eastern and Western game design have to offer.\nG.O.R.E\nAs the titular Gunslinger of Resurrection, you become the badass anti-hero of your dreams, an ultimate killing machine, brutalising your foes without mercy. Taking cover and retreating is not an option for Grave, he only ever goes full steam ahead, preferably right through his enemies.\nStyle on your foes with gun-tastic stylish combat\nStylish third-person shooting meets close-range martial arts, creating seamlessly flowing action as you crush your enemies in a gory ballet of bullets. Utilise your unlimited ammo Cerberus pistols and your transformable EVO-coffin to unleash devastating combos in pursuit of maximum damage and style.\nLet there be Vengeance\nStrap in for a wild ride, an epic & emotional story of vengeance, love and loyalty, with more than 12 hours of gameplay in the story mode, for Gungrave fans and newcomers alike.\nEnjoy the Scenery\nGo on an epic adventure across South-East Asia, based on real-life locations with a dark, futuristic twist.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"IGGYMOB","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":257385,"name":"DOKA 2 KISHKI EDITION","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df2/df2a0f9be40afdf6ca1233320bb36f12.jpg","description":"DOKA 2 KISHKI EDITION is a game where you kill zombies, or you yourself are zombies, this is a game where you kill in the most sophisticated ways of people, that is, there you can come up with a certain area. Thank you for my rock childhood.\nFeatures: [/ b] [/ h2]\n- Ability to pull guts\n- You can kill zombies\n- You can be a zombie\n- You can kill people in the most sophisticated way.\n- You can invent your specific area\n- You can trade\n- Special weapon for pulling out guts within 10 minutes [/ list]","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Agafonoff","platforms":[{"id":0,"name":"PC"}]},{"id":51622,"name":"Aimtastic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/389/389074de4565bbbec00b139296013717.jpg","description":"Aimtastic is a training game for FPS games. Helps you become a better aimer. Includes a lot of different practice scenarios, which is great for warmup or taking your aim to the next level.FeaturesA lot of different target practice rooms and new ones added in often.\nA lot of options to make the game feel as good as possible for YOU.\nOptions to simulate the most fps games out there.\nPlayer movement\nBuilt-in sensitivity converters for all the big games.\nAdvanced crosshair options.\nTracks your stats and other information, to show your improvement and what you can do better.\nDeveloped by and with feedback from pro players from different games.\nWeekly updates.\nModableCurrent Target Practice RoomsBigger then Smaller (Trains your aiming speed and accuracy)\nSimple Circle (Trains your speed and muscle memory)\nReflex (Trains your reflexes and accuracy)\nTracking (Trains your short distance tracking)\n360 Tracking (Trains your long distance tracking)\nLeft to Right (Train your long reflex shots)\nPopup Targets (Trains your speed and accuracy)\nReactions (Train your reaction speed)\nKeep Ball in Air (It's just for fun)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Victor Möller","platforms":[{"id":0,"name":"PC"}]},{"id":49941,"name":"MONMUSU","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/613/61320ca7eee0c46a85de4349bb8fe40b.jpg","description":"Free to Play Idle Simulation Game for PC!\nYou are an up and coming summoner\nand a lover of monster girls.\nEarn money to gather up summoning\nmaterialsand summon monster girls!\nCharacter Designer:Sayori/TAMA/Tsukimi Kirara\nGraphic Work:Sayori/TAMA/Tsukimi Kirara/33paradox\nScenario:Morry","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Tentacle Games","platforms":[{"id":0,"name":"PC"}]},{"id":42257,"name":"Superfrog HD","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6af/6af4099142352a10842806254ad8989d.jpg","description":"Superfrog HD is a remastered edition of the original arcade. It is a sidescrolling platformer game. \n\n###Plot \nIt is a story of an unnamed prince, who was transformed into a frog by a witch. Then this witch kidnapped his girlfriend. While sulking in the river, the frog prince found a bottle of Lucozade. This drink gave him extraordinary powers. After that, the frog decided to fight the witch and save his beloved. \n\n###Gameplay \nIn addition to the main aim of the game, which is to rescue a princess, there are some other objectives (to find a golden key, for instance). The player has to complete 24 levels.\nThese levels are divided into six environments. On every level, you are tasked to get enough coins to have a possibility to exit. You can restore a timer countdown and your health by getting a bottle of Lucozade. The credits award the player at the end of each level. The number of credits depends on the number of coins and fruit, you collected, and on time, you spend on finishing every level. There are two ways to use these credits. You can keep them or gamble in a mini-game to receive bonuses. You have a chance to get a level code, allowing you to start over the game from the next level’s beginning later. In the end, the player should win in a boss fight with the witch. This fight takes place in the castle.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":20772,"name":"Super Puzzle Platformer Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c04/c042f968f23b4bb98e50f20363093e23.jpg","description":"Steam Big Picture\nAbout the GameThe title says it all. Take one part falling block puzzle game, combine one part old-school platformer, add a couple thousand pixels, blend and serve. Why match colored blocks when you can just shoot the hell out of them? Your goal is to survive as long as you can. From celebrated indie developer Andrew Morrish and Adult Swim Games.Key FeaturesNov. 2013 Update: new outfit, new level, new challenges and MORE!\n9 playable characters, each with unique abilities\n7 different worlds to explore\nDozens of obstacles, hazards and enemies\n20+ challenges to overcome\nPlay single player or local head-to-head multi-player\nAmazing soundtrack\nLeaderboards support\n30+ Steam achievements","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Andrew Morrish","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16447,"name":"Voyage: Journey to the Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ad/9ad160522bbd16049ba6687169639f82.jpg","description":"Play the eccentric Michel Ardan and go conquer the hidden face of the moon. Alone on the mysterious satellite, you'll explore the ruins of an abandoned temple and take part in surprising events... But are you really alone? Make fantastic discoveries and dare to go into the deepest depths of the moon to solve puzzles that will allow you to go back to Earth.\nDiscover magnificent dream-like environments on the hidden side of the moon. Experience a voyage that will give you a complete change of scenery, and a non-linear script that will go beyond what you could have ever imagined.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Microids","platforms":[{"id":0,"name":"PC"}]},{"id":14577,"name":"The Falling Sun","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e3/4e3e78f425ea902ee0e4d9bca0159e1a.jpg","description":"Overview\nFrom a UK based indie studio comes The Falling Sun, a first person, horror game set in post-WW2 Burma. The Japanese have withdrawn after the Allied victory and British forces regain control of the region, however when a small armoured column goes silent, a young lieutenant is sent on one last mission to find out what happened. Upon his arrival he is faced with horrors beyond that of the World War, will you be able to overcome them?\nThe Falling Sun provides a gripping story in a refreshing environment all the while keeping you on edge around every corner. The atmosphere will keep you on your toes, keep a keen ear and don’t always rely on your weapon to get you out of harm’s way.\nWith a series of acts you can immerse yourself in the game’s story through campaign mode; or even face the onslaught of horror in survival. Whatever you choose to do, keep your wits sharp. The game currently ships with two acts and a survival mode but further installments will be added without additional cost from the standard game price.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"LonePlanetStudios","platforms":[{"id":0,"name":"PC"}]},{"id":14090,"name":"Guardian's Oath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/01b/01bdfa253bdea9e8df322c8a7ef93539.jpg","description":"It is an Action RPG.\nIf you like this kind of RPG, you may enjoy this game.\nMain concept of this game is gaining experience and leveling up in order to destroy the final boss.\nCritical point is that you should do your best during the game because this will facilitate the final fight!\nFeatures:\n1) Stats (Agility, Strength, Vitality...)\n2) Bosses\n3) Quest & Main Quests\n4) Economics\n5) Detailed Fight Mechanics\n6) 200+ Upgradable Items\n7) 3 Different Class (Warrior, Archer, Magician)\n8) Musics unique for the game\n9) Styles\n10) Maps like dungeons\n11) 2 Main, 10 Normal Skills\nTeam\nComposer (Theme Music): Arda Özmen\nCreated by Onur Gölgedar\nTester: Batuhan Baran Karaağaçlı\nGraphics Designer: Onur Gölgedar\nGraphics Designer: Taylan Gökkaya\nGraphics Designer: Hakan Göksu","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nodamex","platforms":[{"id":0,"name":"PC"}]},{"id":3275,"name":"Crimson Dragon","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e7/5e7812195289308b2d2acb52911aa65f.jpg","description":"Several generations have passed since the human colonists of Planet Draco lost contact with Earth. Now they face the return of an old threat, a colossal destroyer known as the White Phantom. In ''Crimson Dragon,'' control your dragon and fight off the violent enemy life forms. Teach your dragon new skills, and train it to face combat in harder missions.\nThe downloadable version of this game supports English","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Grounding","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":782343,"name":"Cursed to Golf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66d/66d2f52c850b3d6e8ea2f622a3416012.jpg","description":"Play as The Cursed Golfer, trapped in Golf Purgatory after a freak accident takes you out as you’re about to take the winning shot of an international tournament! Legend says that playing through the devious courses across Golf Purgatory will get you back to the land of the living and, more importantly, to the trophy you were about to win. Each course is governed by a ghostly Legendary Caddie, who will tutor you in the mystical ways of golf to aid you on your quest for redemption and revival.\nCursed to Golf offers a fresh take on the golfing and roguelike subgenres. Make your way through a hole within the PAR Count or your curse will take you back to the beginning of the course! To add to the challenge, these courses don’t just have bunkers and rough spots but are also chock full of mad obstacles like high powered fans, spikes, TNT boxes, teleporters and a whole load more. It’s all par for the course in this twisted take on the classic game!\nBeing cursed to play golf forever in the eternity of Golf Purgatory has its benefits, too! Use Birdie-Eye to catch a view of the whole course and see what trials lie ahead. Par count running low? Luckily,  gold and silver Shot Idols are peppered throughout the holes, smashing through them with a cinematic flourish will replenish your shots. Ace Cards will turn the odds back in your favour, channeling your otherworldly powers to manipulate the game in incredible ways. Scattershot, U-Turn, Rocketball, Mulligans are just some of 20+ cards you have up your sleeve to turn the tide back in your favour!\nEvery shot counts!\nExplore the golf-themed world and characters of Golf PurgatoryPrecise “Golf-Like” gameplay across a randomly-ordered course in 4 biomesNavigate tough dungeon-like holes filled with wacky hazards Golf in style using over 20 unique Ace Card power-ups Challenge the world in online leaderboards80+ holes and the Daily Challenge Mode will keep you swinging for eternity","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Chuhai Labs","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":537745,"name":"HROT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d1/3d1a7326f4c73b76008fa51c3976e7ea.jpg","description":"HROT is a single-player retro FPS set in a small socialist country neighboring Soviet Union (Czechoslovakia) after an unspecified disaster in 1986. Those times were dark and terrifying and so is the game.\n\nYou start in a civil defense shelter deep under a Prague Metro station. As a proud holder of the military readiness badge you know what your duty is: put on a non-functioning gas mask, load the vz. 52 pistol and protect the peace and your socialist homeland from the strange intruders*.\n\nThe classic gameplay and vibe of romeric shooters from 1990s including a fitting brown retro aesthetic.\n\nYou'll find a shotgun, a vz. 13 SMG, a rocket launcher and even some secret experimental Soviet battery-powered weapons (e.g. a ball lightning launcher). If you run out of ammo, you might find the hammer and sickle coming in handy.\n\nHandcrafted levels inspired by real locations with an emphasis on historical details. Every level contains socialist paraphernalia which nowadays can only be found in museums or your grandma's attic**.\n\nFlushable toilets and destructible light bulbs.\n\nA custom engine written in Pascal imitating 1990s software-style rendering with unfiltered textures and polygon jitter.\n\n* Madmen in raincoats, killers in protective suits, autonomously attacking dogs, horses and goats\n** Eastern Bloc only","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Spytihněv","platforms":[{"id":0,"name":"PC"}]},{"id":536941,"name":"RUSSIAPHOBIA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ee/0eed6677877e828674d17a5a09657c88.jpg","description":"RUSSIAPHOBIA is a Unique opportunity to Immerse Yourself in Russian Realities as a Foreign Agent and Help Presidents Make Russia Great Again!\r\nUnique Features\r\nWorld Government - the Most Influential People of the World are Waiting for You, Listen to the Briefing and Proceed to the Mission\r\nCooperative Multiplayer - Go Exploring Russia as Secret Agents with your Friends\r\nRussian Clean Up - Dispose of all the Feces\r\nDon't get Caught by the Russians - They Don't like Strangers\r\nHelp your Country - Return the Money Bags and New Year Gifts stolen from the Budget\r\nGet the secret Data Carriers - Find all the Flash Drives and Send them to the Court\r\nRussia is Waiting for You and Your Friends!\r\nAll characters and events appearing in this work are fictitious. Any resemblance to real persons, living or dead, or events is purely coincidental. The game does not have the goal of insulting or humiliating anyone.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"European Flameworms","platforms":[{"id":0,"name":"PC"}]},{"id":274763,"name":"Atlas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aaf/aafc510a6db14e385fa28306751025a1.jpg","description":"From the creators of ARK: Survival Evolved comes ATLAS - a massively multiplayer first-and-third-person fantasy pirate adventure. ATLAS will host up to 40,000 players exploring the same Globe simultaneously, with an unprecedented scale of cooperation and conflict! Stake your claim in this endless open world as you conquer territory, construct ships, search for buried treasure, assemble forts, plunder settlements and hire crew to join your powerful growing armada. Start small then expand your spheres of influence from a small island, up to an unstoppable pirate empire that spans across the oceans. Wage battle against enemy fleets as you singlehandedly command large ships of war using the captaining system (or divide up to the responsibilities among your trusted lieutenants), or take control of any weapon directly with your own character. Dive deep into the briny water to explore permanent sunken wrecks and recover salvage, unearth the loot from procedurally-generated Treasure Maps and challenge zones, or complete challenging main questlines. Team up with other aspiring adventurers and sail into the vast ocean to discover new lands rich with region-specific elements, tame exotic natural and mythical creatures, raid forgotten tombs, confront powerful ancient gods and even build and administer your own colonies, cities, and civilizations to dominate the ATLAS in this ultimate quest for fortune and glory!\nMMO On the Grandest Scale\nPhysically sail in real-time across the vast oceans with the proprietary server network technology. Explorers will voyage to over 700 unique landmasses across 45,000 square kilometers, with thousands of Discovery Zones, and ten distinct world regions each having their own unique resources, creatures, secrets, and environment hazards! There is a separately PVE ATLAS for players who don't wish to play any PVP.\nConstruct the Ship of Your Dreams, Plank by Plank!\nBuild drydocks and start with a dinghy rowboat, basic raft, tiny sloop or nimble schooner, moving on up to your own versatile brigantine or titanic galleon capable of transporting hundreds of crew and extensive cargo. Name your ship in big bold letters, paint and copy your own pirate flag and custom-place all the pieces of your ship -- which sails and where, planks and gunports, every single structure piece has a physical Weight and Material -- to function exactly how you want.\nCaptain your Crew!\nRecruit real players and AI crew from freeports or rescue seasoned crew from destroyed “Army of the Damned” shipwrecks to man distinct stations on your boat! Set sail and explore the ATLAS with them to gain experience and level up their stats or gear, as well as levelling your Ship. Your crew are versatile! Whether on land, or ship, or even riding behind your animal companions on emplacements, they can man weapons of all kinds-- cannons, swivel guns, siege engines, turrets, and even gigantic mortars, many with dynamically swappable ammo types including grapeshot, chainshot, spikeshot, liquid fire, and more! Instruct them to board enemy ships and help you conquer the seas! Keep their stomachs full and their pockets full of gold lest you want a mutiny in your hands! Take on the Captain’s Wheel or divide up the command responsibilities via Lieutenant Podiums to direct the Ship’s assignable weapon systems, sails, and stations, including standing-orders or manual grouped fire. Or, walk up to any station and take control of it yourself!\nPirate PVP to the Limit\nEverything is up for grabs including player’s ships, their crew, their pets, their forts, their land, and their booty. If you can get your hands on it, you can take it. A ship’s permanent logbook tells the tale of their legendary travel, exploits and ownership.\nBe the Hero or Villain you were meant to be\nMMO-scale character progression systems include, at launch, over 15 Disciplines with over 300 Skills, in a vast unlockable tree. New \"Feat\" system allows for active and passive bindable character abilities, while new stat-buff system allows innumerable abstract statistics to be modified by Skills, Items, and Armor. And now, everything has scalable stats, including structures, and can be progressively Upgraded!\nThis is Who You Are\nExtensive character visual customization enables an endless range of realistic (and not-so-realistic) characters, with a vast array of sliders, morphs, muscle tones, and tweakable values. You can even per-pixel design your own permanent tattoos (and then draw warpaint on top of that too!). If someone exists in the real world, they should be creatable in ATLAS! Best-in-class dynamic hair growth and real-time aging systems allow you to get old and... pass on your legacy? (Or find a fountain of youth!).\nEndless Adventure\nFull Quest and Waypoint systems, with sub-quests and rewards, for major goals -- while procedural treasure maps and challenge zones also ensure there's always something new to find out over the horizon.\nIntense Action\nTactical melee combat systems with blocks, parries, dodges, character motion, optional shields, stunning and strength-varying strikes, directional attacks, and more for use in either first or third person perspectives. Fists, swords, maces, blackjacks, daggers, and much more give you tremendous options to pick the right weapon for the job. Meanwhile, period-appropriate-weaponry with skill-based active reload systems include flintlock pistols, muskets, blunderbuss, and more -- just be sure to keep your powder dry!\nClaim What's Yours\nForm a company, claim territory and apply taxation and behavior rules to that which you own: be a benevolent governor, a feudal lord, or a ruthless dictator. Territory ownership is visualized on your dynamic zoomable World Map, with Fog of War obscuring uncharted regions and Shroud of War hiding enemy territories out of sight range. Contest other government's ownership of land, structures, or ships to expand your empire! The top large-scale Spheres of Influence on the Official ATLAS' are visualized in real-time on the PlayATLAS homepage. Design your own custom flag per-pixel to apply to your claims, to be famous (or infamous)!\nCreatures Great and Small\nMore than 50 creatures at launch varying from breedable utilitarian farm animals & shoulder mounted parrots and monkeys that offer unique buffs, all the way to magical mermaids and gigantic sea monsters of legend. Creatures can be found in their logical regions, but take skill and tactics to tame using new mechanics, while also gaining the most benefit and fertility from their natural biomes. Ferry these temperamental creatures across the vast oceans in a virtual Noah's Ark to trade in exotic locales.\nFreeports to Meet & Greet\nLevel-capped starter zones allow you to learn the ropes and meet new players in a safe space before you venture out into the great unknown. Where the wind and destiny takes you beyond that, is up to the gods!\nBuild Your Empire\nOverhauled building systems include automatic foundational elevation adjustment, dynamic tile type swapping, improved snap detection & previewing, integrated plumbing systems, per-pixel-paintable everything, beast-of-burden harness attachments for field-gun and carriages, and much more! Survival systems newly include, among other aspects, Vitamins benefits and deficiencies, with recipe & cooking skills and varying ingredient qualities.\nPowerful Mod and Server Functionalities\nWant to build a World War II Spitfire? Or a Flying Fortress bomber with fully walkable interior and gun stations, carrying troops loaded with machine guns and rocket launchers? How about a Tank? An Aircraft Carrier to play out the Battle of Midway on an expansive scale? How about an Arcadian Steampunk Airship floating through a cloud-world? These examples and much more are provided with the ATLAS Dev Kit, where you can make effectively create whatever large-scale MMO action game you want to see happen, all supported by the database-driven network technology that powers ATLAS. Unofficial ATLAS' can be of any size and configuration, while a visual map tool lets server hosts layout their own complete custom world of islands, continents, terrain features, spawns, resources, hazards, underwater zones, dynamic weather, biome configurations, ecology, and an infinite number of other configurable features -- all dynamically streamed to the client during gameplay. The possibilities are endless!\nFar, Far More\nStay tuned for more details on the extensive features and content of ATLAS. This brief sampling is just the tip of the iceberg (though be sure to watch out for those in the polar regions, as they're extremely dangerous to ship hulls!!).\nA Brief History of ATLAS\nLong-ago, far above the watery world of ATLAS there once existed a magic-powered “Golden Age”-- where great Empires of the Sky lived at peace alongside magical creatures, flourishing upon floating continents above the clouds, all powered by a magical source of energy known as the Heart of the Goddess, granted by the powerful beings who dwell in the stars beyond. However, a powerful warlord known as Xevos sought to unite the human civilizations over the magickind, and launched a war that broke the Heart into pieces, unleashing a wave of destruction that shattered the floating landmasses and plunged them into the waters below.\nMany generations later, as living memory of the “Sundering” has faded into legend and the once-plentiful magical energy has long since dissipated, descendants of the protectors of the Heart of the Goddess -- known as “Pathfinders” -- emerge from their provincial oceanic lives to explore the new continents and islands, and seek out the power they may yet contain. Across the vast new world they’ll encounter hostile creatures, technological remnants of the Golden Age past, and ultimately the undying spirit of Xevos himself and his soulless “Army of the Damned”, still intent on recovering the pieces of the Heart of the Goddess to raise the continents once again under his vision.\nIf the latest generation of Pathfinders can outwit and outgun Xevos and his legions, and recover the Heart pieces for themselves, they will be faced with the very same choice: whether to attempt to restore the old world, or build a new better one…","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Instinct Games","platforms":[{"id":0,"name":"PC"}]},{"id":20780,"name":"Alex Hunter - Lord of the Mind Platinum Edition","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b4/7b48f951e4f93c2fb07199bbd99e139a.jpg","description":"Track down a missing scientist as you explore the place where reality meets illusion.\nOver many years, Private investigator Alex Hunter had worked on dozens of cases involving murder, theft, bribery and fraud; and nothing fazed him. Until, a young lady came to his house asking him to help find her father, the renowned scientist, Professor Patterson. The professor had vanished from his house, without a trace, over a month ago. The police were called in but they were unable to find any clues. Coincidentally, neighbors reported having bizarre visions and suddenly finding themselves in strange places. Hunter took the case, thinking it would be a piece of cake…\nTake on the role of Alex Hunter and investigate this mysterious disappearance. When you discover that the Professor’s experiments delved into the secret workings of the brain and mind control, the case takes a whole new twist. It’s up to you to follow the trail of clues and find out who has taken Professor Patterson, and intends to use his knowledge for evil purposes. Find the place where reality meets illusion!  You will need to go head to head against a demented mind; a mind armed with the power to control yours!\nFeatures:\nOutwit and defeat a criminal brain!\nExplore lush environments on your quest for the truth\nA thrilling story that will lead you through sewers, a mental hospital, and into a bizarre alternative world.\nDevious puzzles, clever mini games and highly detailed hidden object scenes\nBonus Chapter – Destroy the crime syndicate that masterminded the plan","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18282,"name":"Razor2: Hidden Skies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdd/bdda04837a8a4cd180e76ee8495eeee8.jpg","description":"Razor2: Hidden Skies Razor2: Hidden Skies is a top view shooter. The game has the style of successful classic arcade games, while using the latest technology to create great visuals and effects.  An old-school game with all new technology. Razor2 has easy gameplay, while challenging your skills with hundreds of enemies and bullets threatening you all the time. The soundtrack is another great feature, Razor2 uses classic orchestrated music, composed especially for the game.\nRazor2 includes ten achievements and world records. Do your best, and place your name on the best players ranking.  Play hard to win titles such as the Destructor, shooting down 4000 enemies, or the \"almost impossible\" Ace Pilot, completing the game without using any continues.\nKey features:\nShoot them up (shmup)\nEight levels\nFifty different enemy waves\nIncredible Boss fights\nWeapons and equipment upgrades\nThree difficulty levels\nWorld and local Records\nTen medals and achievements\nGreat graphics, art and shaders\nEasy and amazing gameplay\nAwesome orchestrated music\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Invent4 Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16910,"name":"Shufflepuck Cantina Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71f/71f16d07d8536f6578d121efd84f1b5a.jpg","description":"Shufflepuck Cantina Deluxe is also very enjoyable without a VR headset!\nNote: In case the game fails to launch, switch to the winopengl version in BETAS tab.\nAfter \"accidentally\" jumping your spaceship through a wormhole, you’ve crash landed onto this forsaken desert planet a billion kilometers from home. The only thing between you and the horizon is the seemingly endless dunes of sand, save for one strange, huge building. Inside, it appears to be an interstellar Casino where everyone plays air hockey for a living.\nYou’ll have to fight hard to grind down all your opponents until they are utterly defeated to earn the critical parts needed to repair your ship. Once you’ve obtained all the spaceship pieces you’ll have to defeat the owner of this insane Casino so you can go home.FeaturesExtremely responsive game controls.\n5 Floors populated with 13 vicious opponents.\nQuests and missions system to unlock loads of game content.\nTrack your progress and gain experience through an advanced levelling system.NotesUse [Tab] to choose the best display setting depending on your graphics card performances.\nUse [Esc] to access the settings menu.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Agharta Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14769,"name":"King Arthur: Fallen Champions","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/105/105f91a112fa9d97f7f18e073b0f259e.jpg","description":"The great King Arthur has crushed his adversaries in the South but the realm of the Once and Future King still has its limit. The lands beyond the Forest of Bedegraine are wild, ruled by no one, haunted by the old gods  who fought and bled here in times long past. Fallen Champions bridges the gap between King Arthur I and II with a tale of three brave souls. Sir Lionel, a brave knight from Britannia on a quest to rescue a damsel in distress. Lady Corrigan of the Sidhe, a creature of the twilight seeking the secret pathways that could lead her back to her lost home of Tir na nÓg. The third is Drest the Chosen, a shaman of the North, driven by visions of greatness and voices in the night.  A knight, an enchantress, and a prophet - these three will become champions of a forgotten battle that began long, long ago.\nCore Gameplay\t\t\t\t\t\tThe gameplay relies on a story-based, mission-to-mission plot. Players will choose missions and upgrade heroes. The Fallen Champions Campaign Map covers one specific region of Britannia, where players command three very different heroes. Each hero has his own storyline and each of these story lines incorporates three battles, adding up to a total of nine skirmishes plus the confrontation with the major foe in the 10th battle.\nThe battle maps are very diverse both in visuals and in construction: some tactical-RPG situations (with a limited number of elite units and heroes), tactical battles (with huge armies on the field) and massive battles against a general AI under very unusual circumstances.\nKey features:\t\t\t\t\t\tFollow three unique heroes, each with their own storyline featuring adventure quests and epic fights. The fates of these three heroes are intertwined, and their quests lead up to one massive battle under extraordinary circumstances\nA variety of battle types fought on unique, beautifully crafted battlemaps, ranging from smaller tactical skirmishes to grand engagements against superior numbers\nA dark and gripping fantasy tale that bridges the gap between King Arthur and King Arthur II, set in an ancient region of Britannia, beyond the well-known territories of King Arthur – The Role-playing Wargame","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":12394,"name":"A Date in the Park","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6c/e6c532ce0f12b6b242a4731b465d6ae5.jpg","description":"A Date in the Park is a short and weird free point and click adventure game, inspired by things like David Lynch and the feeling of oddness in a banal situation.\n\nStory:\nYou are Lou. You've recently moved to Lisbon, in Portugal, to take up a new job and start a new life. Within days of arriving, you meet an enchanting woman, Catarina, at a bar on a night out. After a few hours of connecting, you agree to meet her the next day in her favourite park. \n\nYou arrive at the stunning park on a beautiful sunny day, with high hopes. Lou soon realises the atmosphere is a little off... it's not going to be an average date. \n\nFeatures:\n- A cast of several characters\n- Language confusion - Lou does not speak Portuguese.\n- 20+ screens to explore\n- A short, narrative experience, with puzzles as well. I think it will take between 30 minutes and an hour to complete. Maybe a bit more, maybe a bit less, depending on the player\n- Twists and turns - shocking moments! (there's a horror element to the game)\n- 90s style digitised graphics and animated sprites (sprites are animated more traditionally than in Mudlarks)\n- 640 x 400 resolution\n- Real world location to explore- Tapada das Necessidades in Lisbon, Portugal\n- 2 click interface, with inventory etc","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cloak and Dagger Games","platforms":[{"id":0,"name":"PC"}]},{"id":4391,"name":"Disney Universe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/822/8225abca4de80d0ed032df67e5c5444d.jpg","description":"Disney Universe is an off-the-wall non-stop action-adventure video game where Disney worlds and characters mix up for the first time. Players will be able to suit up in iconic character costumes and face challenges in legendary Disney worlds. Battle through each world and experience a different style of gameplay, with various movie-inspired storylines being explored throughout the game. Players can defeat enemies, collect coins and power-ups, unlock new costumes and explore with friends in a mix-up of worlds inspired by numerous Disney and Disney•Pixar films.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":678592,"name":"A Memoir Blue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec2/ec2eabf6162f34565d2fc02befe371be.jpg","description":"From Cloisters Interactive, A Memoir Blue is an interactive poem about a superstar athlete and the all-encompassing love between mother and daughter.\nA unique aesthetic combining hand-drawn and 3D art brings Miriam's magical-realist journey to life, as she swims into the depths of her memories. A series of gameplay vignettes blends sacrifice and heartbreak with victory and pride as she reconnects with her inner child and deepens the love she shares with her mother.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Cloisters Interactive","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":270757,"name":"Zombotron","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a8/3a865038cd8b1e04b388e8220890dd7d.jpg","description":"Fight to survive on a mysterious alien planet and do whatever it takes to find a way home.\nBlaze Rush is a mercenary desperate for a job. In search of an easy payday he follows a distress beacon to the surface of a dangerous planet and the remains of an ancient crash site. There he finds a mystery that will test his strength, his resolve, and every gun in his arsenal. Zombotron features an arsenal of weapons and armor, enemies that hate each other as much as they hate you, and really nice explosions for an experience that’s out of this world.\nWhy go for headshots when you can drop a zombie down an elevator shaft? Or crush them beneath a pile of rubble. Or set of an elaborate daisy-chain of dynamite around them. Or run them over in an ATV. Or... you get the idea.\nFeatures\nCrush foes with elevators, send them flying with explosives, run them down in vehicles, and much, much more.\nLock and load with a variety of weapons to become a consummate badass.\nDiscover the secrets of the planet Zombotron in an engaging, camp-tastic storyline.\nCustomize Blaze's armor to be the space-faring badass you've always wanted to be.\nAnt.Karlov has been a game developer for 14 years. You might be familiar with some of his web-games on sites like Armor Games, Newgrounds, and Kongregate, including games like Fire Catcher, Alien Transporter, Mining Truck, Knighttron and Mushroomer.  Zombotron is Ant.Karlov's first premium title and builds upon over a decade of gameplay and design experience.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ant.Karlov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":58920,"name":"999: Nine Hours, Nine Persons, Nine Doors","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f0/7f0c6808fa3fb0fd6a55f46037a1a327.jpg","description":"In this game, you must help Junpei reclaim his memories and play a game of life or death known as the Nonary Game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Chunsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PS Vita"}]},{"id":58701,"name":"NBA LIVE 19","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/37b/37b8787a4e9b02fda3c51421ebd18f8f.jpg","description":"NBA LIVE 19 redefines the way you play a basketball game. 1v1 Everywhere featuring Real Player Motion gives you control in every possession, providing you the ability to change momentum in any game and dominate your opponent. Pursue basketball glory with the freedom to create your path in the return of THE ONE. Build your squad of superstars, legends, and cultural icons to join your quest for greatness on courts across the globe in the League, The Street World Tour and your ONE COURT where you customize your rules and your line up reign. Defend your court and challenge the Community to be the ONE.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts Tiburon","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":46979,"name":"The Talos Principle VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1c/b1c8a272f67a9151e1129e9a25d230e0.jpg","description":"The Talos Principle VR is a virtual reality version of Croteam's critically acclaimed first-person puzzle game in the tradition of philosophical science fiction.\nAs if awakening from a deep sleep, you find yourself in a strange, contradictory world of ancient ruins and advanced technology. Tasked by your creator with solving a series of increasingly complex puzzles, you must decide whether to have faith, or to ask the difficult questions: Who are you? What is your purpose And what are you going to do about it?Features:Road to Gehenna included - explore a brand new narrative through four episodes that will challenge you with some of the most advanced puzzles in The Talos Principle.\nTrue locomotion support - teleport, instant teleport, blink teleport, classic full locomotion (with or without comfort mode). Explore the game's non-linear world, solving puzzles your way. Go with the safe built-in teleportation system or tweak and adjust the way you jump through the VR space to best suit your playing style.\nUse your hands to divert drones, manipulate laser beams and even replicate time to prove your worth - or to find a way out.\nRoomscale support - Explore the game world as if you were actually there! (But mind your real furniture)\nOvercome numerous puzzles in an immersive and stunning VR world.\nExplore a story about humanity, technology and civilization. Uncover clues, devise theories, and make up your own mind.\nChoose your own path through the game's non-linear world, solving puzzles your way.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":36390,"name":"The Punisher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41a/41a91347a39a6d36f19e8bc419578c67.jpg","description":"Driven by a hatred of crime bordering on insanity, Frank Castle became The Punisher, a one-man army whose mission goes far beyond revenge. Taking on the city's high-powered crime lords, he wreaks havoc on the corrupt with methods reserved for those on the wrong side of the law. \"The Punisher\" video game represents the best of over 30 years of \"Punisher\" comic books and depicts some of the grittiest storylines in the Marvel Universe. [THQ]","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Volition","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":28546,"name":"MX vs. ATV Alive","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/153/153cbdd321d0109c2c62550a1ec0b3b1.jpg","description":"The Games on Demand version supports  English, French, Italian, German, Spanish. Own the competition as you wrestle for position with tightly contested racing in the fifth iteration of the MX vs ATV franchise. Feel the realism of the revolutionary real-world physics engine which has defined the racing genre. Live the sport as Alive captures the spectacle of motocross and the essence of competitive racing while providing the best riders and gear from the latest manufacturers.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":28292,"name":"Eternal Sonata","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84d/84de3d41c53a2a79bbc769f243adf1a3.jpg","description":"On his deathbed, the famous composer, Chopin, drifts between this life and the next. In his final hours, he experiences a fantastical dream where he encounters a young girl facing a terrible destiny and the boy who will fight to save her.  On the border between dreams and reality, Chopin discovers the light that shines in all of us in this enduring tale of good and evil, love and betrayal.    Developed for the Xbox 360™ video game and entertainment system by Tri-Crescendo and featuring the music of Chopin, Eternal Sonata delivers amazingly detailed 3D graphics, a captivating storyline with over 30 hours of gameplay and an innovative action battle system.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"tri-Crescendo","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":22792,"name":"The Temple of Elemental Evil","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32e/32ebeb7f227ac6bcb143119b603f2733.jpg","description":"Thus begins your adventure within the Realm of Greyhawk. It is an adventure that will lead to the source of a deep and abiding mystery, to the very core of evil itself.\nAn evil demoness founded a cult dedicated to exploring evil in its most elemental forms. This cult was based in a temple just outside the village of Hommlet in a vile shire known as Nulb. Soon, this cult rose to rule the region with tyranny and grim times of chaos and violence ensued. Hard-fought battles were waged and the war was eventually won by the good armies of nearby lands. The temple was razed, the villains were imprisoned, and order was restored. The temple itself faded into distant memory. Until now...A classic RPG based upon the famous Greyhawk adventure and using the D&D 3.5 ruleset\nParties of up to 5 adventurers and up to three NPCs with 9 starting points, depending on your alignment\nTons of different monsters, feats, spells and magical items","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Troika Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22427,"name":"Drakensang: The River of Time","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a67/a679ef788692d747eb20092e06954901.jpg","description":"The prequel to Radon Labs' award-winning RPG, Drakensang: The River of Time introduces a brand new story within the Drakensang universe. The new story brings many innovations and new game elements for experienced as well for first time players, who will jump right into the fascinating medieval fantasy RPG scenario of Drakensang: The River Of Time.\nStarting in Aventuria’s Middenrealm in the city of Ferdok, the story of the games takes players down the Great River to the city of Nadoret. Many mythical legends entwine around this river and will also flow into the main plot. The story will contain more twists than in Drakensang: With every place the player visits, his view on things will change. Depending on the choice of character, and behavior, new opportunities and series of quests will come up.\nLiving on a ship, players will experience a broad variety of RPG quests. There will be two new character archetypes to play, tons of new foes and monsters as well as equipment items.\nTwo new classes of heroes: the Geodes (rare Aventurian druids of the dwarfs) and the Gjalskerland inhabitants (tenacious and hard barbarians).\nAdvanced expert mode and adjustable levels of difficulty.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"dtp","platforms":[{"id":0,"name":"PC"}]},{"id":20663,"name":"Aveyond 3-1: Lord of Twilight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42e/42ea7e56f21f9687e6971138ba6fef36.jpg","description":"Chapter 1 in a four-part series! Journey across a massive world on a quest to thwart a power-crazed lunatic who wants to enslave humanity! Two hundred years ago, a sorcerer attempted to fulfill a dark prophecy that would see him rule the world. He died before his goal was realized, but the prophecy lingered on. Today, another maniac stands determined to succeed where the sorcerer failed and he needs YOU to fulfill his plan. Are you brave/crazy enough to stop this guy?Games that have been released in the series:Aveyond: Lord of Twilight (DOWNLOAD HERE)\nAveyond: Gates of Night (DOWNLOAD HERE)\nAveyond: The Lost Orb (DOWNLOAD HERE)\nAveyond: The Darkthrop Prophecy (DOWNLOAD HERE)Features:HUMOR. Lots of it. Humor is the core of Aveyond. You will laugh... or else!\nMassive world filled with loads of monsters, loot, and civilizations.\nTravel with a large party of friends. Pick your leader and your fighters for turn-based battles.\nSeek out special academies to learn skills like climbing so that you can explore new areas.\nHelp Edward, one of your party members, find a wife or face the wrath of his mother.\nGive or steal from temples.\nObtain a magical sword that can have its properties changed by the gem you put in its hilt.\nRun a farm in your spare time and collect creatures.\nAwesome music brought to you by an award-winning musician who has the entire Final Fantasy music library memorized.\nFor the lazy: find the secret treasure caves and equip your heroes with mega weapons, gold, and level ups.\n20+ achievements to unlock!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Amaranth Games","platforms":[{"id":0,"name":"PC"}]},{"id":20198,"name":"Run and Fire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f7/8f71e26d9cb5cccdf6324c3037def4f0.jpg","description":"Run And Fire is a 2D platformer with shooter elements in which you have to fight enemies.\nThis is a linear and very interesting platformer in which you will have to go on various journeys, fight with various types of enemies.\nWith each new level you will meet more and more powerful enemies. Think over your every step, avoid the trap and do everything that will help you successfully complete your task!\nKEY FEATURES:\n- Hardcore gameplay\n- Variety of game content\n- Relaxing soundtrack\n- Unforgettable impressions","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Galaxy Gate","platforms":[{"id":0,"name":"PC"}]},{"id":19529,"name":"Paper Sorcerer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ba/1bad88998619c2f82379a09a27293285.jpg","description":"Paper Sorcerer is a stylish single player turn based RPG focused on strategy, party-building, and environmental puzzles. Fight with the skills and spells you've learned in a battle system that emphasizes strategy over grinding. Assemble a party of monsters and dark creatures to fight alongside you. Explore and solve environmental puzzles to unlock secret paths and find extra loot! A double-sided adventure, an RPG with adventure game elements.Initial Steam release is for PC, Mac and Linux are in the works.\nIf you'd like to play it on Mac or Linux right away, you can pick it up on the website http://ultrarunaway.com, and we'll send you a Steam key later.\nSave files from the demo transfer to the full version!\nA powerful sorcerer is on the cusp of dominating the land. A group of heroes bands together and seals him away inside a magical tome. Now as the sorcerer you must escape from this ancient prison and find a way to regain your magical powers using your wits and an array of summonable creatures to aid you. There may be more powerful forces at work as you navigate the dungeons and fight the heroes sent to subdue you...\nKey Features\nPlay as a renegade sorcerer as he struggles to escape the book prison and regain his powers.\nEscape a magical prison filled with heroes hunting you down at every turn.\nLeave behind mana and to-hit rolls for an exciting new battle system that emphasizes strategy and tactics over grinding.\nStrategically manage an energy pool to unleash devastating special attacks in battle.\nAssemble a party of fiendish creatures to join you as allies in battle.\nNumerous different creatures and fiends to unlock, further customizing your party; including a healer Witch, a trickster Imp, assassin Troll, and a berserker Minotaur.\nDiscover fiendish puzzles and solve them with a combinations of spells, items, and your wits.\nHand-drawn high-resolution sprites\nAll-inclusive game, promise to never make you pay for DLC content.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ultra Runaway Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19260,"name":"Defend The Highlands","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/730/7305354137437960bb284e9bc0f0475f.jpg","description":"Defend the Highlands combines the genres of Tower Defence, Real Time Strategy, and Scotland. The player will have to build defences, recruit Scotsmen and manage their porridge stockpile as they fight off the English invasion of Scotland.\nThe player will control a band of Scotsmen, led by the short, hairy and nationalistic pub owner Alfredo. Making use of traditional Scottish weaponry, such as golf clubs and haggis catapults, the band of Scotsmen must defend locations around Scotland, Wales and England, as they defend their homeland, and then take the fight to the enemy.\nFight wacky enemies: Welshmen who ride sheep into battle, English teapot hurlers, Irish potato farmers, and many more.\nBuild crazy defensive structures including porridge cannons, turnip turrets and cheese wheel stations.\nBuilding defenses is only half the equation. Unlike ordinary tower defense games, you will also have to man your towers with Scotsmen.\nRecruit Scotsmen to your cause by playing bagpipes - but be sure to keep your bagpipe players defended.\nCapture and hold oat farms to keep your porridge stockpile full.\nCommand powerful hero characters, from the humble pub owner Alfredo, to the great William Wallace himself.\nEarn points and upgrade your Scotsmen and defensive structures.\nFight the enemy through a 20 level story mode, or play custom matches in skirmish mode.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kilted Camel","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19242,"name":"A Game of Dwarves","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3bc/3bc53069556c7ade74f9390e22c5bec3.jpg","description":"A Dwarven Prince on a quest to reclaim his people’s stolen land will take you on a great journey. Explore a continent filled with buried treasures and unearth mysteries that have laid hidden since the Great War. Take charge of your Dwarven settlement while mining, exploring and utilizing your resources with a combination of strategy and management.\nOrder the inhabitants of a Dwarven settlement to dig, build and conduct research in order to strengthen the clan. Be careful though because you must defend your Dwarves from the terrible beasts that lie in the depths. A unique world is generated each time a new level starts, so you will need to dynamically adapt your strategies and tactics during each session.\nAs you advance, the Dwarves will level up and gain new skills; progressing from weak dwarvlings to near immortal warriors or master craftsmen. There are also rare resources to be found deeper in the earth that grant access to better buildings and equipment. However, the deeper you dig the more dangerous foes you might unleash…\nKey Features:\nExplore – The randomly generated maps offer replayability while also providing a sense of exploration\nBuild – customize your settlement with not only practical constructions, but beautiful ones too! Build objects you think look great, while still gaining progress. Home is where the art is.\nCommand – With an intuitive order system the player can easily control oodles of dwarves simultaneously without the need for extensive micro management\nA 13 level, story driven campaign\nCustom game mode: Create a world without enemies so you can build uninterrupted or spawn lots of them to increase the challenge","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Zeal Game Studio","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":17786,"name":"Cosmo's Cosmic Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f5/5f5090d9072a4d970aa52f55b445528a.jpg","description":"Cosmo's Cosmic Adventure is an exciting journey across a forbidden planet full of dangers and surprises. Can he save his parents before they're lightly seasoned and devoured?\nCosmo is a lovable extra-terrestrial with a special ability: He has hands that work like suction cups! He can cling to walls, ledges, and all sorts of things. Using his suction hands, Cosmo is able to avoid dangers, scale cliffs and get to places other aliens can't reach.Features\nCreature Closet: Over 20 unique and surprising creatures.\nSuperstar: Cosmo has many tricks, such as scaling walls with his suction hands.\nSize and Simplicity: Massive but easy-to-explore levels.\nSave Your Game: Game saves, built-in hints, and much, much more.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17709,"name":"Razenroth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ed/9ed6c54330de449ac9acc3b70baf558d.jpg","description":"Razenroth is an action game with a dark atmosphere, enriched with the elements of roguelike and RPG. All the levels, weather conditions, distribution and quantity of key elements are generated randomly. Thanks to this fact, a single game is different each time. A player must fight dozens of different creatures and several extremely dangerous bosses. He has a range of different objects at his disposal, as magic spells, skills, potions, book of spells and other.\nThe main character of the game – Charles Carter – is a young journalist who tries to solve mysterious disappearance of his grandfather, Joseph Carter. One and only way to do that, is to enter the world of nightmares, inhabited by horrifying creatures.Main features of the game:\nOver 200 objects to find - magic potions, spells, books, elements of clothing, talismans, rings, amulets and other. Some of them are extremely powerful, thus, more difficult to obtain.\nLevels are generated randomly. Each of those is characterised by different construction, random weather conditions and unique colouring. As the game progresses, the main scenery is also changing (e.g. dark forest, rainy marshland, graveyard, caves, etc.)\nSeveral dozen creatures to fight with. There are regular creatures and these which can be encountered rather rarely. The more rare the creature, the better chance to obtain valuable objects after it is beaten.\nUnique bosses - each level has random bosses to kill.\nSpecial random events - sometimes a player may find an object or meet a creature which will begin some new task. When it is fulfilled, a player gets valuable objects.\nSeveral dozen interactive elements. Among those there are different shrines, chests, and some rare graves, altars, etc.\nThe main character's house with a possibility of developing it - inside, a player can buy keys and magic potions, heal himself and do other things.\nUnlockable characters. By playing more you'll get a chance to unlock additional playable characters with different statistics and skills.\nCharacter leveling system. By killing monsters you get experience points which allow your character to level up. You can improve some of the basic stats like hp, mana, critical damage, etc. Additionally there are also over a dozen of powerful skills to improve, that let you customize your character as you want.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Enitvare","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15795,"name":"Farming World","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf1/bf11a11e6e49a12b0aad4291f4863e90.jpg","description":"Whether you specialise in grain, fruits or even maintaining your own dairy farm, in Farming World you have the ultimate choice on how you shape your business. With dozens of seed types to choose from and an extensive stock market listing, you’ll have to adapt to become profitable. With plenty of seeds growing at different seasons you’ll need to stock up so you can sell when produce is at a high demand.\nBut as you continue to increase your profits that small patch of land you started with is not going to cut it. In this farming simulator PC game, you’ll need to expand your farms reaches across the map. Land can be purchased if you’re wealthy enough but for those with a limited budget you might be better off renting the land until you can afford to own your entire farm. As you obtain more fields to work in, you’ll have to construct roads which allow your vehicles to navigate to the correct patch of land so they can harvest and maintain the fields.\nIn order to maintain your farm you’ll need to construct a selection of buildings, of which you will have over 40 to construct including; greenhouses, bakeries, butchers and more. You’ll also be able to purchase animals from the traditional chickens and cows to the more unconventional domestic turkeys and ostriches.Features:Develop road networks for your vehicles to use\nPurchase and rent land\nOver 30 different types of seeds to plant\nOver 40 building types\n12 Different animals to purchase\nTake on contracts to earn more money\nDetailed weather reportsOther titles from Excalibur Games","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Excalibur","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]