[{"id":20092,"name":"Viktor","genre":"Action","price":0.0,"description":"Viktor’s story begins in Eos, a world divided by two realms: the Overworld and the Netherworld. The fragile balance between these two realms is suddenly shattered when Mephistopheles, the power-hungry leader of the Netherworld, lays siege to Overworld. After suffering betrayal within the legion, Zane, the leader of the Overworld, must turn to Viktor as his last hope.\nViktor is an action-packed, side-scrolling, twin-stick adventure with gameplay inspired by classics such as Castlevania and Megaman. Playing as Viktor, you will fight your way through a diverse spectrum of hostile environments filled with a wide variety of relentless enemies, lurking traps, and fearsome bosses who will try to keep you from your mission: finding Zane, defeating the merciless Mephistopheles, and restoring peace to Eos.Features\nStory Mode with 8 Action-packed stagesIntense Boss Fights to test your skill and coordination3 Standard Difficulty Levels and an unlockable Hardcore Mode6 Different Weapons complete with over 30 Upgrade OptionsNew Game+: Play through the game again and keep all of your weapons and upgradesHidden equipment and artifacts to unlock additional features and abilitiesFull Xbox 360 controller support (Emulators work too!)34 Steam AchievementsSteam Trading CardsOriginal soundtrack available as DLC (included in Viktor: Enforcer Edition)","imageUrl":"https://media.rawg.io/media/screenshots/dfb/dfb9e83887066bde7f191c7d59cc7442.jpg","releaseYear":2014,"developer":"Shorebound Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19725,"name":"NO THING","genre":"Action","price":0.0,"description":"The year is 1994 and it is the future.\nNO THING is a minimalistic surreal action game set in a totalitarian regime of future.\nTells the story of an office clerk who is sent with an important message to the Queen of Ice.NO THING Features: radical gameplay\nmigraine inducing\nweird storyline\nretro surrealistic full 3D graphic\nfull voiceover and speech synthesis\nchiptune sounds\noriginal cold wave music\nsimple controls\neasy to play, very hard to master\nplatforms: Windows, Mac, Linux\nthe year is 1994 and it is the future","imageUrl":"https://media.rawg.io/media/screenshots/3bb/3bbcb37dede4697331232767fbcc4e15.jpg","releaseYear":2016,"developer":"Evil Indie Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":19276,"name":"Joint Task Force","genre":"Action","price":0.0,"description":"Joint Task Force is the real-time strategy (RTS) game where you command the frontline forces in tomorrow's most hazardous conflicts. Lead twenty dramatic missions in explosive war-zones including the Middle East, Central Asia, and the Balkans.\nExperience the evolution of warfare firsthand as you bring superior tactics and military technology to bear against dangerous and unconventional forces. No game has been so gritty or immediate.\nUse the principle of combined arms to your maximum advantage. All battlefield units - including infantry, tanks, artillery, reconnaissance and helicopters - are strongest when used together. Your men's lives depend on your level-headed strategy.\nElaborate story line, 5 campaigns and 1 tutorial\nManipulate media and civilians\nInvest in your heroes; take them to the next mission\nNews channel which provides background information and live coverage of battle\nSatellite recon at your disposal\nSeveral terrain types: Desert, Winter Valley, Rocky Mountain, Jungle and Cave\nRealistic physics for units and buildings\nDynamic weather with effect on game flow\nDestructable terrain objects\nMultiplayer modes include: Domination, Deathmatch and Cooperative mode\nCampaign playable in multiplayer\nMultiplayer modes will be able to handle 8 players over LAN and internet. With a brand new multiplayer mode.","imageUrl":"https://media.rawg.io/media/screenshots/e42/e42b0a932687edd6567a06beedc5f9c3.jpg","releaseYear":2006,"developer":"Most Wanted Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19226,"name":"18 Wheels of Steel: Extreme Trucker","genre":"Simulation","price":0.0,"description":"You ‘da Boss! Move it better and faster while staying alive.  Build your reputation and your empire in the far corners of the world as you haul across the most extreme conditions and loads. Grab the wheel and hop in – is your heart pounding yet?\nHaul extreme cargo - from diamonds to oil pipes - across 3 death-defying terrains.\nThrow your weight around - jump behind the wheel of over 25+ unique rigs and 30+ types of loads.\nExtreme Caution - Feel the power and adrenaline of driving terrains that no sane trucker would take on.\nExtreme Locations!  Travel across 3 hair-raising terrains including ice, dry desert and gnarly jungle.\nYour life is on the line!  Drive terrains that don’t forgive your mistakes - do the job well or you might die trying.\nExtreme Loads! Transport loads that would even scare your grandma - maximum/minimum loads, oversized loads, high risk cargo and more!\nThese beasts don’t drive themselves!  Back up to loading docks, manage your fuel, and maintain your trucks in peak condition.\nExtreme Deadlines! Achieve the unachievable by delivering your loads under deadline.","imageUrl":"https://media.rawg.io/media/games/f28/f28defae3efaaea94ab1fb77fd7dcdaa.jpg","releaseYear":2009,"developer":"Cosmi Valusoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16673,"name":"Tachyon: The Fringe","genre":"Simulation","price":0.0,"description":"Caught in the middle of a violent conflict on the fringe of the galaxy — your ability to survive will depend on your piloting skills and combat savvy as a mercenary space fighter. But, as you explore the vastly detailed world of Tachyon: The Fringe, you will often find that the most powerful weapon on your ship is in your head.\nFeatures\nSingle Player Features — Decide where you want to go and what missions you will fly as you explore the vast and richly inhabited universe.\nFight in furious space combat battles around the most massive ships and stations ever created in a space game.\nExplore a multi-sided in-game story line and make crucial decisions that will change your future.\nFeaturing intense team tactics and BASE WARS. Talk to other star pilots and coordinate attacks with Voice-Over-Net.\nCHOOSE SIDES — Battle across multiple sectors as you fight to destroy opponent's base.\nFeaturing Bruce Cambell as the voice of Jake Logan\n","imageUrl":"https://media.rawg.io/media/screenshots/42e/42e688be1aa315836702cd9f40b55a2e.jpg","releaseYear":2000,"developer":"NovaLogic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16661,"name":"The Campaign Series: Fall Weiss","genre":"Strategy","price":0.0,"description":"Fall Weiss is all about:Strategy\nTurns\nHexes\nCounters\nPanzers\nCommies, Nazis, Poles\nFor the first time player has a possibility to recreate the events of the first campaign of World War 2. What is more important - the course of history can be changed, and the Germans and Soviets can be defeated. It's all up to you.\nThree sides of conflict:\nThird Reich - a regime looking for more and more Lebensraum, willing to roll over everything with Panzers and to bomb all that is left with Stukas.\nSoviet Union - a regime, killing people for the Great Socialism. In 1920 the Polish Army stopped them, but this time Soviets are better prepared.\nPoland - a regime, trying to survive between two of the greatest powers of Europe. They say the most handsome and brave cavalryman are in the Polish Army.\nFacts:\nScale adapted for the size of the conflict\nDetailed historical units\nHuge modding possibilities\nReplayability factor with a lot \"what if\" options\nDifficulty level customizable for each country\nHistory within a hand's reach\nOnly computer adaptation of the campaign\nRuns well on every hardware\n\n\nMain FeaturesRealistic presentation of the campaign's events,\nSupply Depots which are crucial to execute successful offensives,\nHQ units and Chain of Command boosting the efficiency of units,\nHistorical types of units, like Ulhans, Panzers, Stukas, etc.,\nMajor rivers which can really slow down the offensive,\nOver 700 of historical units, with a unique photos,\n20000 hexes map of Poland and surroundings.\nWhen there are no guns, no tanks, no hope, honor is the only thing that's left","imageUrl":"https://media.rawg.io/media/screenshots/041/0415a3b2ae5cc95ceddc012f6ce3698e.jpg","releaseYear":2014,"developer":"Wastelands Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15678,"name":"Shadows: Heretic Kingdoms","genre":"Action","price":0.0,"description":"Shadows: Heretic Kingdoms is the next chapter in the Heretic Kingdoms saga and takes place 20 years after the events of Kult: Heretic Kingdoms. It’s an epic adventure with challenging gameplay, a gripping storyline and enchanting graphics. In this isometric action RPG, the player takes on the role of the Devourer, a demon that swallows the souls of the dead and then brings them back into the mortal realm as his puppets. It's up to him to either thwart a major threat and save the world, or to plunge it into complete disaster…Story\nAfter four of the five members of a secret order known as Penta Nera were murdered, their souls were swallowed by a pack of Devourers. Since then, they move around the mortal realm as the puppets of the Devourers, as a demonic Penta Nera, and ravage the land in search of the essence of souls.\nThe fifth member of the order, bent on revenge, makes use of the only way to stop them and summons another Devourer: this one is different from his siblings. He can absorb multiple souls, but sometimes becomes more human or schizophrenic, the more souls he absorbs. He can stop the demonic Penta Nera and save the world, or he can plunge it into complete disaster...Key Features Of Shadows: Heretic KingdomsExtensive freedom of choice, affecting the course of the game\nGripping storyline in a world full of myths, destinies and legendary creatures\nTwo game worlds in one: Wander between the worlds and risk a glimpse into the dark shadow world, where you will also face enemies and solve mystic puzzles.\nOne dark hero, 15 different characters: Devour the souls of your enemies and use a lot of different characters and combat styles.\nComplete a variety of diverse quests and face creatures in battle that you could only imagine in your worst nightmares!\nHuge number of fantastical creatures with unique fighting styles and challenges\nUnique party systemPress quotes:\n90/100 - \"A well-designed adventure into dark RPG-worlds that has nothing to hide.\" - http://www.spielemagazin.de/spiele/shadows-heretic-kingdoms-pc/\n4/5 - \"Shadows: heretic kingdoms enters a very crowded hall of action RPGs.\" - http://calmdowntom.com/review/shadows-heretic-kingdoms-review-pc/\n8/10 - \"It’s a rich experience with an abundance of soul and a unique vision; there’s no need to wait ten years for that glitzy triple-A game to ape its conventions and follow its narrative ambition.\" - http://www.hookedgamers.com/pc/shadows_heretic_kingdoms/review/article-1374-2.html","imageUrl":"https://media.rawg.io/media/screenshots/b63/b63f4f67aa366f9152fae90d839fb5b5.jpg","releaseYear":2014,"developer":"Games Farm","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14693,"name":"Train of Afterlife","genre":"Adventure","price":0.0,"description":"You are riding on a train without a name, memory, or your own body. Along with you are five other passengers who will share their thoughts and various tales of their past life before reaching their destination. One of them is clearly different from the rest, as he or she is closely tied to your past - a past that will greatly change your destination. As you embark on the final stage of your life, what will you discover? What is waiting for you at the end of your journey?\n\nTrain of Afterlife is a mystery, psychological, horror Visual Novel.\n \nFEATURES\n\n- Mystery, Psychological & Horror\n- 9 Endings & Unlockable Gallery\n- Rated Teen 13+","imageUrl":"https://media.rawg.io/media/screenshots/fdf/fdf16aff9ed9d3fe97629ad27c2f5011.jpg","releaseYear":2015,"developer":"zeiva","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13995,"name":"Taken Souls: Blood Ritual Collector's Edition","genre":"Adventure","price":0.0,"description":"Collector's EditionThis Collector's Edition version includes 9 new locations, 3 additional Hidden Object games, 3 bonus mini-games, downloadable musical tracks, 6 screensavers and 18 wallpapers.\nAbout the GameMysterious city of London, the beginning of the 20th century. A series of terrible ritual murders shakes London and young detective James Voodoo takes over the case. He faces the inexplicable events while investigating the case, and realizes that these murders are only the tip of the iceberg. An ominous plan, which is embodied by a group of conspirators, stands behind this all.\nJames collects evidence related to the murder, and sees that they are directly connected with the abnormal events in the city. Unusual and never previously seen objects and creatures appear at every turn. Some supernatural forces begin to break into this world and destroy it. James finds out that a billionaire and philanthropist Coins is the main person, who is involved in these ritual murders.\nBeing obsessed with immortality, the crazy billionaire is willing to do anything, even to destroy our world. Using the brilliant scientist and coldblooded killer as his own tools, he seeks to conduct an ancient ritual, which combines two formerly separated worlds. He is ready to destroy everything just for the sake of his own survival. And only you, as a brave detective James Voodoo, can stop Coins and his associates.\n*Interactive Map (quest and navigation)*Interactive game-scenes*Global Hint System*Over 50 Locations*16 HO scenes*22 MG’s scenes*One time playable HO scenes*3 levels of difficulty*Over 16 musical tracks*Special Chamber Orchestra Live Records*Laboratory*Evidence deck*Thousands of items*2D animations*CGI animations*Dynamic  locations*Brilliant Art Collections*Integrated Strategy Guide*Integrated  Task list*Integrated Diary*Additional Game content (Music, Wallpapers, Screensavers, etc.)*8+ Hours of gameplay","imageUrl":"https://media.rawg.io/media/screenshots/d90/d9085b2b3f899175311c13ccc607c758.jpg","releaseYear":2017,"developer":"Space Monkey International","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13987,"name":"UBOOT","genre":"Strategy","price":0.0,"description":"UBOOT is a simulator of a submarine from WWII era, yet different than all you have seen so far. It is a survival sandbox with game mechanics similar to that of Fallout Shelter while it's primary theme is life of German soldiers like in Wolfgang Petersen's film Das Boot. The boat is their home, but it can become their grave at any time.\nIn UBOOT you control the crew to control the boat. You look after their physical and mental health, because if the sailors are hungry, tired and their spirit is low, there’s no chance of winning even a skirmish. It is important to balance the overall discipline and trauma of your crew. If you are a harsh captain, the level of both goes up. When trauma is high a secret feature of each sailor can be disclosed. It can reveal his alcoholism, make him go berserk, he can also turn out to be a coward or a spy.\nKriegsmarine Headquarters will give you key missions to move forward with the historical stages of WWII and you will be able to fight in new regions, and install better equipment in a dock. Unfortunately, the opponents will also grow stronger and, for example, will equip their ships with radars or break the Enigma code.\nIn UBOOT each sailor will have his own face, his story, personality, skills and weaknesses. The sailors will come either to report something to you or just to talk some problems over. They will eat, talk, enjoy simple pastimes, queue to the only toilet on board, fight to decide whose girlfriend is prettier. You will see the lives of grey wolves in all its glory.","imageUrl":"https://media.rawg.io/media/screenshots/17f/17f0003af12faf01bb3c360ceac5ef93.jpg","releaseYear":-1,"developer":"Deep Water Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13567,"name":"Alien Hostage","genre":"Strategy","price":0.0,"description":"Ready to give up?\nReady to rage?\nIn 'Alien Hostage' you must complete all challenges given to you by the human scientists who have trapped you on Earth. The only way to escape and travel back to your home is by completing every single one of their challenges, every dangerous rage inducing stage.\nEach consecutive stage will become more difficult. We can guarantee that you will rage unless you can become a master at controlling your UFO.\nCollect all the props to proceed to the next stage. Buy upgrades in the human's upgrade store.\nDestroy your ship and watch it shatter into small fragments.\nSome levels have more to them than just collecting props to proceed, for example, some stages might have small puzzles you must complete.\nIf you think what I've told you so far sounds hard then your going to love this next part...\nThe human scientists also have specially designed super weapons to prevent you from reaching your home.\nCan you do it?\nCan you make it back Home?","imageUrl":"https://media.rawg.io/media/screenshots/186/186320f36b5ba55efe68b18b7efd3f82.jpg","releaseYear":2016,"developer":"Four Winged Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9491,"name":"Rogue Operatives","genre":"Action","price":0.0,"description":"Rogue Operatives Hide N' Seek\nA team of rogue Novak Operatives have taken on the forms of inanimate objects to hide themselves from their old comrades. The loyal Operatives - still albeit just in control of the planet - must find and disinfect the rogues in order to bring them back safely to the side of Novak Intelligence and back to their human form. Play tactically or all out crazed mayhem with up to 16 players with stealthy movements and humorous chases being the name of the game.\nJoin us on our Discord channel: https://discord.gg/NJUsWfE\n16 Player Hide N' Seek multiplayer mode with 7 highly detailed mapsCurrent planned content\nEver increasing bank of maps","imageUrl":"https://media.rawg.io/media/screenshots/2c4/2c4b263ce25fc566e7c85793076a4b49.jpg","releaseYear":2016,"developer":"SIM720","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9487,"name":"Out Of The Box","genre":"Adventure","price":0.0,"description":"THANKS TO THE COMMUNITY\nWe feel really grateful towards Greenlight community for having supported this game by showing so much will and devotion. Soon, you will be able to enjoy the Out of the Box full experience. Thank you very much for making this project possible.\nAbout the Game\nOut of the Box allows you to experience the feeling of being the bouncer in the most exclusive and also dangerous club in town.\nIn this demo, we offer the chance to get to know a little bit about this story which takes action mostly at night. Here you can meet some of the most important characters, and also become familiar with the game's mechanics.\nThroughout 4 different days,you can get in Warren's shoes, and find out what it feels like when you ask some disoriented bum for his ID, when you just take the bribe and let someone you shouldn't in, or when you try to reason with helpless drunk people.\nDo you need more reasons to sign your contract with \"The Box\"?","imageUrl":"https://media.rawg.io/media/screenshots/d5a/d5a167a413e9277308ea386fa5b30163.jpg","releaseYear":2018,"developer":"Nuclear Tales","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":2203,"name":"Assault Suit Leynos","genre":"Action","price":0.0,"description":"A classic reawakens – Assault Suit Leynos is back and in high definition! Get ready for all-out robotic war as the fan-favourite Mega Drive classic is reworked with all new HD visuals for the ultimate alien-blasting experience!\nAs Earth reels from the impact of the fourth world war and dwindling resources, an uneasy truce between nations sees mankind reach for the stars. Colonies are settled, resources are mined and the future starts looking a little brighter. But just as peace finally seems possible, an unknown enemy emerges from the deepest region of space to threaten the very existence of humanity. Only one thing can stop them: deploy the Assault Suit Squadron!\nFresh HD visuals and sound combine with old-school game design to bring the much-loved Mega Drive classic bang up to date.\nJump into an Assault Suit and experience eight stages of side-scrolling alien-blasting action to drive the alien menace back into space!\nEquip your AS with a huge range of devastating weapons, then complete sub-missions within each stage and unlock even more to use in the next battle.\nUnlock a huge number of game modifiers to mix up the Arcade Mode gameplay, or try Classic Mode and see if you’ve got what it takes to be an elite AS pilot!","imageUrl":"https://media.rawg.io/media/screenshots/0ca/0ca80fd27f80dcf0efbedb5fbf7016f7.jpg","releaseYear":2015,"developer":"Rising Star Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1739,"name":"Heart&Slash","genre":"Action","price":0.0,"description":"Heart&Slash is a 3D brawler that is set in a world where machines are all that remains from the Human civilization.\nYou play as Heart, an innocent robot fighting to escape the grip of the evil and all seeing machine QuAsSy (Quality Assurance Systems).\nBut make no mistake Heart&Slash is a hard game. Every death is permanent and means a new randomly generated level for you to start over with a different set of weapons and items you can use, new enemies to fight and secrets to explore.\nHeart&Slash is an indie game developed by a small but passionate team. We have a tiny budget but big hearts, and we are giving it all to make this game (our first) the best we can.\nFeatures (on final release):\n-3 worlds to explore and fight in. Each world includes its unique enemies an bosses.\n-Dozens of different weapons and equipment pieces (more than 100 in total) to customize Heart and your play style.\n-Perma-death, but a persistent progression system that gives you more options as you play the game.\nWe hope you enjoy Heart&Slash as much as we enjoy making it!\nWelcome!","imageUrl":"https://media.rawg.io/media/screenshots/c44/c444dc28836029766fcb29fd1322eecc.jpg","releaseYear":2016,"developer":"Badland Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":520,"name":"Battle Ages","genre":"Strategy","price":0.0,"description":"Storm through history and conquer your enemies in this awesome combat strategy game! Progress from the dawn of mankind, build your civilisation, and lead it through thousands of years of advancement from the discovery of fire to the invention of the telegraph in exciting PvP combat of epic proportions. Use your workers to build cutting edge industry, build and upgrade your defenses and employ great scientific minds of the era to research fantastic weapons of each distinct age. Train your military and send armies out to lay waste to nearby settlements and steal their stashed riches. Join the race through time and fight to be the most powerful leader in history! Key features of Battle Ages; - Lead a civilisation from the dawn of time to the modern age. - Journey through 6 distinct, authentic, and exciting ages in time from launch, with more ages following very soon! - Compete against thousands of other players for domination on a global scale. - Research new and powerful weapons to aid your fight. - Join forces with friends to take on other groups in epic battles that span generations! - Battle players across the ages - see Neolithic Barbarians fight Medieval Knights, and Roman Legionnaires stand off against Union soldiers! - 22 different units, 15 different spells, 11 different traps and more than 50 unique buildings to construct!","imageUrl":"https://media.rawg.io/media/screenshots/661/661527c8917ddfb981bf37e2adaadee7.jpg","releaseYear":2016,"developer":"505 Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":982603,"name":"Still Wakes the Deep","genre":"Action","price":0.0,"description":"STILL WAKES THE DEEP is a return to the first-person narrative horror genre for The Chinese Room, creator of critically acclaimed games such as Amnesia: A Machine for Pigs, Everybody’s Gone to the Rapture, and Dear Esther.\nYou are an offshore oil rig worker, fighting for your life through a vicious storm, perilous surroundings, and the dark, freezing North Sea waters. All lines of communication have been severed. All exits are gone. All that remains is to face the unknowable horror that’s come aboard.\nGAME FEATURESExplore a stunningly realised offshore oil rig in 1970’s Scotland that evolves throughout the story\nWorld-class visuals, audio, writing from award-winning studio The Chinese Room\nStar-studded cast of voice-actors: Alec Newman, Neve McIntosh, and more\nWorld-class, haunting soundtrack by Jason Graves\nSix hours of terrifying gameplay\nBrace yourself for a symphony of action, trepidation and awe\nLIVE THE HORRORAn immersive disaster story aboard an authentic North Sea oil rig\nFace a terrifying, unrelenting foe\nPray that, one day, you get to see your family again\nExperience the beauty and ferocity of the sea, as it rips apart one of humanity’s strongest structures and its steadfast crew\nESCAPE THE RIGAvoid, distract, and sneak around in best attempts to survive\nNo weapons. No powers. Just your wits and determination\nRun, climb, and swim through the flooding corridors and storm-lashed outer decks\nStruggle for survival, as one wrong step could be your last","imageUrl":"https://media.rawg.io/media/games/27d/27d2f9f7ee2c49d21c9c21e74cf98749.jpg","releaseYear":2024,"developer":"The Chinese Room","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":972271,"name":"Death Must Die","genre":"Action","price":0.0,"description":"\"Many heroes throughout history had taken on the journey to The High Mount to enter into Death's realm and end his reign. None to return.\nYet this time, an unsung higher power had chosen to back our heroes in their quest. Toss a coin in my hat here traveler, if you wish to hear The Saga of Death's Demise.\"\n~The Bard\nDeath Must Die is a roguelite RPG bullet heaven in which you play as the heroes trying to defeat Death.\nA pantheon of gods guides the heroes in their quest, each granting different powerful blessings.\nLearn why the gods have decided to stand against one of their own and uncover the personal stories behind each of the heroes as you explore the Underworld.\nFeatures: Destroy the thousands of minions of Death\nFace off and defeat the Guardians protecting each circle\nDiscover ancient shrines, mythical creatures and the other inhabitants of the Underworld\nChoose from hundreds of god blessings to create synergetic and varied builds\nCollect randomized and unique items to make highly varied builds and ease your next attempts\nIncrease your odds of finding lost relics, at the cost of empowering Death's legions\nAttempt runs with a varied cast of heroes, each endowed with game altering traits\nUnlock unique and hard to access achievements\n(We are a small team of 4 core developers that have chosen to release this game into Early Access to support its further development and expansion, and have worked tirelessly on it day and night and we hope to be able to continue to do so to provide you with the best we can offer!)","imageUrl":"https://media.rawg.io/media/screenshots/943/943685b7e65bf5694e192fc0215e02d9.jpg","releaseYear":2023,"developer":"Realm Archive","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":831876,"name":"Boneraiser Minions","genre":"Action","price":0.0,"description":"~ In a time long ago, those with forbidden power over the dead were branded as wretched Boneraisers. Such heathen were hunted, hanged, burnt, and staked, and their remains sealed within sanctified mausoleums. But what those fearfully foolish folk did not realise, is that those whom are already dead, cannot be killed. You are one such filthy Boneraiser! ~\nGameplayAs a reviled Boneraiser you must amass an army of skellies and deamons to fight the endless waves of heroes intent to end your necromantic ways. In this gothic-horror auto-battler roguelite, use the bones and souls of slain heroes to raise and upgrade undead minions, and collect powerful relics and spells to turn the tide of war. Unlock meta upgrades to improve your boneraising abilities, but crucially you must also bolster the Godly heroes' forces too in order to gather enough resources to defeat your nemesis King Gigald's crusade!Features Boneraising auto-battler action: Dash around avoiding enemies and collecting their bones to raise and upgrade minions who fight for you! Each minion type has their own fighting styles, from melee pulverisers, to bomb lobbers and magical missilers. Multiple game modes: There's several game modes to keep play fresh. From the Mausoleum Awakening where you must protect your crypt against King Gigald and his forces, making best use of traps and contraptions you place before the show. There's the Endless Skirmishes where the aim is to simply see how long you can last against an ever growing horde of meanies. And then there's Clashful Cards, a collectable adversarial card game, a bit of respite from the endless boneraising!  Relics and Spells: There's not just bones to suck on during the fight. You will find curious Relics with strange boosts and abilities, or Spell Scrolls with powerful attacks or buffs to be used at the perfect time! Boneraise Lore meta: Between games use collected coins to increase your abilities and boneraising powers, such as learning to raise Enboned Giants and Possessed Deamons. Meta can also be upgraded and refunded, encouraging you to play around and find your perfect meta loadout! Heroic Force meta: You must also bolster the forces against you too if you wish to survive King Gigald. Why not provoke a Beggar's Revolt, Goblin Looters, or Mercenary Cyclops, and use their bones to raise an ever greater army of dead!  Class Heritage meta: By stealing heroes souls you can also learn new abilities and perks for a particular class. Each class offering their own playstyles!  Steam Leaderboard: Battle your foes, and your friends, to reach first place on the online Steam leaderboard! Even after defeating King Gigald the crusade wars are endless, and only the greatest legion of undead ever assembled will reach the top spot!\n~ Can you resist King Gigald's poundings? ~","imageUrl":"https://media.rawg.io/media/screenshots/550/55083e9857e266ed0a51bb6ddc8cad8a.jpg","releaseYear":2022,"developer":"Anthony Case","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":831853,"name":"Breeze","genre":"RPG","price":0.0,"description":"Follow UsDon't want to miss the latest news of Breeze? Follow us here:\nYoutube: https://www.youtube.com/channel/UCrQ9AULE36iJiU27SqfkBPA\nInstagram: https://www.instagram.com/fofgamestudio/\nTwitter: https://twitter.com/FOF_Game\nWeibo: https://weibo.com/u/6613301585\nbilibili: https://space.bilibili.com/1517500910\nLooking forward to your feedbackAfter you have played our game, we look forward to getting your feedback in the comment section or in the Google Form below.\nhttps://forms.gle/Rur1tdHJPjsqfNKD9\nAbout the Game\nFar away, at the foot of the snowy mountains, there is a village called Ereb. There is a rumor about this village, it says, \"devouring everything, there is no return\".\nA sugar glider detective ignores the advice and goes to the Ereb Village alone. In addition, to finding the truth, she is looking forward to getting someone's clues.\nAsk the villagers, get clues and get closer to the truth. But before that, why are all the villagers falling asleep?\nLet's find a way to wake up the villagers first. The detective launches a search in Ereb Village.\nShort branch, looks like it'll work. Little windmill, why are the blades loose？ Does the round sun blink its eyes just now?\nAs the villagers wake up, the truth about Ereb Village comes to light. At the same time, the detective's own memory is gradually awakened...\nAbout MouseDuring the game, when you see the mouse cursor change from an \"arrow\" to a \"paw\", the area that is currently pointing at is interactive! You can click on this area to pick up items, talk to characters, or get information about the environment.\nAbout InventoryThe inventory has a fantastic \"combination\" function. Enjoy combining item with environment, item with item, item with character.\nAbout Magic Magnifying GlassInside the inventory, the magic magnifying glass is placed in the lower right corner of each item. Click on the magnifying glass to get more details about this item.\nAbout Detail PageWhen the mouse is hovering over the item, more information about this item will be displayed. Some items contain interesting puzzles, so make sure you interact with them on the detail page.","imageUrl":"https://media.rawg.io/media/screenshots/2f4/2f4e6e8d8502d0f6f58f685550f10127.jpg","releaseYear":2022,"developer":"FOF Game","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":816303,"name":"Ravenswatch","genre":"Action","price":0.0,"description":"Ravenswatch is a top-down roguelike action game that combines intense real-time combat with deep gameplay and high replay value. After the success of Curse of the Dead Gods©, Passtech returns with a new formula and game experience that can be played solo or with up to four players in co-op.\nBANISH THE NIGHTMARE FROM YOUR REALM\nThe Nightmares are spreading within Reverie, corrupting everything in their path. You must hone your skills and find the strength to defeat the creatures of the Nightmare using unique hero abilities inspired by characters from folk tales and legends.\nDYNAMIC GAMEPLAY\nTo defeat the Nightmare and reach the final chapter, you will need a strong build, focus and excellent teamwork. Increase your fighting power in battles then face the level boss when you feel ready… or when you no longer have a choice.\nDARK TALES\nThe world of Reverie is built on old folk tales and legends. From the three little pigs to Norse mythology to One Thousand and One Nights, the best-known tales are revisited in a dark-fantasy style and add their timeless appeal to the atmosphere of Ravenswatch.\nHIGH REPLAY VALUE\nRun after run, play as different heroes, make the most of the upgrades and items you find, and explore a randomly generated map with new activities and new enemies.","imageUrl":"https://media.rawg.io/media/screenshots/ff9/ff9c7b0cab02818ba0f06e3ea1c2dcd1.jpg","releaseYear":2023,"developer":"Passtech Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":771271,"name":"Shelter 69","genre":"RPG","price":0.0,"description":"They said that the apocalypse would mean raging fire, nukes blasting across oceans. That when you exit the bunker, the very sun would dim in the midst of nuclear winter. Instead, you were greeted to a world devastated by what no one conceived in their wildest dreams – that all men just died out.\nEXPANSIVE SHELTER MANAGEMENT\nRome wasn’t built in a day, and neither will your base of operations. From an old, derelict safehouse to a full-blown, high-tech fortress, scour the wastelands for resources, carefully plan the layout and reach the heights you deserve.\nA WORLD FULL OF WOMEN\nAs the (possibly) last surviving male on the continent, you have more than just new lands to conquer. More than 40 girls across the wastes may yet join your cause and provide bounties unheard of – listen to them, forge relationships that could outlast nuclear fire and reap the sweet rewards.\nA FRESH, UNIQUE SETTING\nTechnocrats enslave the few surviving male specimens in underground laboratories, trappers roam the green, untouched wilds and mystery cults still await the return of a promised messiah – an unshackled, unsullied Man. It is up to you to navigate the maze of a new world and uncover mysteries of the old one across more than fifty story-driven campaign missions.","imageUrl":"https://media.rawg.io/media/screenshots/190/1902d2cbedf8643a00a2b13a690fde25.jpg","releaseYear":-1,"developer":"JNT Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":664964,"name":"花妖物语/Flower girl","genre":"Strategy","price":0.0,"description":"the game has free DLC. Press the key combination \"Win + R\" to enter: steam://install/1715900 , press enter to install free DLC  (the win key is the second key in the lower left corner, the one with four squares) live2d + voice + plot = you have everything you want  player welfare Penguin Group: 454358917 (The lust ghost knows)  [introduction to the game] Flower girl is a magic theme elimination game. You will play the role of a spiritual master with a mission. In order to save your beloved, you will set foot on the way to the legendary flower demon country. On the way, you will encounter all kinds of flower demons. Whether to destroy or capture is between your thoughts. [game features] ◆ more than 80 exquisite CG pictures are waiting for you to collect!!\n◆ emotional interpretation of many Japanese voice excellent little sisters!!\n◆ full screen experience with UWB fish screen resolution!!\n◆ new launch elimination play, feel the charm of jet warrior!!\n◆ live2d animation is upgraded again! Rag system! Let's fight happily!!\n◆ the game adopts the liking gentleman system to improve liking through multi line plot:)\nPlease enjoy the gentleman's life in the flower girl world!!! role introduction\nClover: Ling\nCV:  赤身伊織\nCup: D\nHeight: 152cm\nCircumference: 88-70-85\nRepresentative color: Green\nFlower language: happiness, waiting for love\nActual age: 109 (100 flower demons become demons. The older they are, the stronger their ability. At the same time, they will also be divided into flower species. The maximum age of four leaf grass flower demon is 280)\nSpecial ability: the flower liquid secreted makes people hallucinate / adjust, which is reflected in increased pleasure\nCharacter description: naive and lively, curious, so it is often observed by humans, and imagine the image of an elf according to her appearance. Although he was ordered to prevent humans from entering the flower field, he was sent to the periphery of the flower field because he was too naive and reckless to perform his task well\nSakura: Ying\nCV: 嵩袮茅英\nCup: E\nHeight: 161cm\nCircumference: 95-75-95\nRepresentative color: Pink\nFlower language: love and hope, simple and pure love\nActual age: 117 (100 flower demons become demons. The older they are, the stronger their ability. At the same time, they will also be divided into flower seeds. The maximum age of Cherry Blossom demons is 300)\nSpecial ability: no fighting ability / training. The body is as smooth and pink as cherry blossoms. The body will heat, turn pink and get red. The interior of the body is very soft. Touching it is like falling into a cotton ball but will be fully squeezed, such as the feeling of gentle little hand caressing\nCharacter description: Ling's good friend, although a non combatant, will work hard for a good friend. Some people are weak and have a poor will to resist. They are easy to cry in case of difficulties. Being too gentle and obedient leads to being easily persuaded. They are soft and cute\nWu: Yao\nCV: 美羽るみ\nCup: F\nHeight: 167CM\nSankei: 108-86-92\nRepresentative color\nHanakai: love thoughts / love love\nYear of commentaries: 129\nSpecial ability: the establishment of an occult acupuncture\nA description of a person: a flower of the same flower. It is very strong, and it is a life, and it is good, and it is an old man, and it is not possible to do it, and it is a victim, and it is a victim, and an arrogant tongue\nTulip: sleeve (Xiu)\nCV: 匿名希望\nCup: I\nHeight: 170cm\nCircumference: 133-100-120\nRepresentative color: Golden\nFlower language: mysterious, noble, unique leader, crown of power and honor\nActual age: 156 (100 flower demons become demons. The older they are, the stronger their ability. At the same time, they will also be divided into flower seeds. The maximum age of tulip flower demons is 460)\nSpecial ability: the fragrance emitted by the body can make people unconsciously control their mind, unconsciously recognize her, and finally become her prisoner / training. They can share pleasure and control each other's sensitive points through fragrance\nCharacter description: it is a noble branch of the flower demon group. It is noble, elegant and intellectual, but it has a strong desire for control in the heart. Under the polite appearance, it has a sadistic heart. Envy the invaders' strong strength and try to control the intruders in sleeping clothes, but they are conquered\nViolet: Violet (Zi)\nCV: 嵩袮茅英\nCup: G\nHeight: 158CM\nCircumference: 113-88-95\nRepresentative color: Purple\nFlower language: eternal beauty and love / falling in love with you in a dream\nActual age: 190 (100 flower demons become demons. The older they are, the stronger their ability. At the same time, they will also be divided into flower seeds. The maximum age of violet flower demons is 500)\nSpecial abilities: pull people into a dream, defeat the enemy in the dream / adjust to use the ability to change all kinds of impossible situations, role play, and do impossible things. There is no refractory period in the dream, and you can launch and play hard indefinitely\nCharacter description: the unscrupulous, immoral crazy beauty, surrounded by Datura, resolutely implements the instructions of Datura, and does not hesitate to sacrifice her body to rob people from tulips. It's difficult to communicate. She only acts according to her own wishes, just like a crazy girl living in a dream\nMandala: Yu (Yu)\nCV: 霧島エマ\nCup: H\nHeight: 178 cm\nSankei: 123-95 - 110\nRepresentative color\nHanakka: the death of the dead\nThe year of the commentaries is: 999 (100 years ago), it is the ability to overcome the ability, and the ability of the flowers is the same as that of the flowers of the Dharma, and the flowers of the Dharma, the flowers of the Dharma, and so on, 9, and so on, so that we may be able to live in the weak period\nSpecial ability: distrust, defiance of the person's defiance, and suffocation, the pain of the person is painful. The ability of the deceased person to be able to have the ability to be able to be able to say, the ability of the flower, the flower liquid, and the touch are the best. On the other hand, the ability of the people to be able to enter the room is not limited, and there is no difference between them.\nPerson pictorial: integral twins, free cuts. The white character God violates violations, the palm commandment, the spirit, and the sense of expression. It is a character of the king of the flower, the goddess of the flower, the character of the flower, the prison character, and the prison area in the hand hand. The ratio of the person to whom the person is expelled is made to be self-made, and it is possible to be able to challenge it, and the person who is able to challenge it, the main angle of the subject is very strong, and the passing is","imageUrl":"https://media.rawg.io/media/screenshots/45c/45ca251ea78258a8cae5e82563e3aeba.jpg","releaseYear":2021,"developer":"ohiyosoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":481924,"name":"Nickelodeon Kart Racers 2: Grand Prix","genre":"Action","price":0.0,"description":"Nickelodeon Kart Racers is back and we’re kicking it into overdrive!  In Nickelodeon Kart Racers 2: Grand Prix, you can select from 30 playable racers and 70 team members to assemble your ultimate pit crew. Choose your favorites from Nickelodeon’s hall of fame, including JoJo Siwa, SpongeBob SquarePants, the Teenage Mutant Ninja Turtles, the babies from Rugrats, the cool kids from Hey Arnold!, Ren and Stimpy, Lincoln Loud and his sisters, and more!\nMore Characters + More Karts + More Tracks = MORE FUN!  First, speed your way across a variety of Slime-filled tracks in a fun series of races where you can win highly-coveted cups and over 80 upgrades for your Kart!  Then, shift into the next gear and challenge your friends in online multiplayer or in local arena multiplayer to see who can cross the finish line first or handle the wild arena challenges!  There’s no slowing down - on your marks, get set, Slime!\n-\tLargest collection of Nickelodeon characters ever in a Kart game!\n-\t100 beloved Nick characters to choose from\n-\t30 playable racers and 70 crew members that each have unique powers designed to help you win\n-\tStrategize your ultimate pit crew to increase your level of attack, defense, or fun!\n-\tTens of thousands different all-star character combinations\n-\tLocal multiplayer up to 4, and online multiplayer up to 8\n-\tNew and improved racing engine for best in class racing fun!","imageUrl":"https://media.rawg.io/media/games/437/437d576f3137d1e72f86a17c77e81533.jpg","releaseYear":2020,"developer":"Bamtang Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":479697,"name":"The Alto Collection","genre":"Action","price":0.0,"description":"Join Alto and friends as they set out on the adventure of a lifetime.\n\nRace down alpine slopes, over windswept dunes, through ancient woodlands and the long forgotten ruins of both critically acclaimed titles: Alto’s Adventure and Alto’s Odyssey.\n\nAlong the way you’ll pull off daring backflips, grind over rooftops and leap over vast chasms as you journey to discover what mysteries lie beyond the horizon.\n\nWhat's New\n• Full access to both Alto's Adventure and Alto's Odyssey, including over 120 levels, 360 goals, 7 unique characters, and a workshop full of upgrades.\n• Custom designed soundtracks for Standard and Zen modes for both titles.\n• Full controller support\n• Online leaderboards\n\nProduct Features\n360 handcrafted challenge, online leaderboards, fully dynamic lighting and weather effects, Photo Mode and Zen Mode","imageUrl":"https://media.rawg.io/media/screenshots/89c/89c62661e06fe5e2b203b2a3307ce50c.jpg","releaseYear":2020,"developer":"Serenity Forge","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":444382,"name":"The Last Faith","genre":"Action","price":0.0,"description":"The Last Faith is an exploration-based Metroidvania, action side-scrolling platformer with dark and gothic horror themes at its core. An ancient religion is ruling for centuries the world left to its fate. The once majestic capital and full of a glorious past, is now decadent and haunted by a fatal disease. Eric will have to subvert the words of the hidden prophecy and discover the truth behind the now corrupted and ravaged world.\n\nWield one of the variety weapons, use elemental buffs to power them up, cast tons of magic spells discovered in the giant cathedrals, face the beast, slay the horrendous abominations feeding on blood and travel around the stunning high-detailed gothic lands.\n\n\nFeatures\n- Satisfying reactive action combat system\n- A high number of different weapons\n- Use of the special buffs to power up you weapons\n- A variety of magic spells to support your combats\n- A giant world with terrific gothic environments\n- Learn a range of new abilities\n- Interact with environment elements\n- Exploration, mysteries and puzzles to solve\n- Unique and creepy enemies\n- A highly detailed pixel art style","imageUrl":"https://media.rawg.io/media/screenshots/5c5/5c54a7b428f422f682a0e58543743a2e.jpg","releaseYear":2023,"developer":"Kumi Souls Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":244802,"name":"RIDE 3","genre":"Simulation","price":0.0,"description":"Feel the adrenaline and experience the most complete racing ever with RIDE 3!\r\nImmerse yourself in a modern 3D environment where you will compete side by side with your bike, modifying it mechanically and aesthetically thanks to the new Livery Editor, which will let your dreams run wild. Before starting, don't forget to customise your rider with the right outfit.THE BIKESMore than 230 bike models available from the very first day, with more than 70 new models never seen before in a RIDE game.\r\n30 different brands, both historic and contemporary, of which 9 are completely new. 7 different categories to satisfy every taste and riding style.THE TRACKSRIDE 3 will be a journey around the globe thanks to its 30 different tracks created from zero and faithfully reproduced via photogrammetry and drone scanning.\r\nHurtle down breathtaking roads all around the world, including GP tracks, Road and Supermoto tracks, enjoy the panoramas of street and country tracks and compete in street acceleration races.LIVERY EDITORChoose your favourite bike and make it unique, just like your style. Create your livery from scratch, choose a background colour and an endless amount of 2D shapes, designs and effects. Work on various levels to create infinite compositions and find the aesthetic which works for you.\r\nRiding a bike is great. Riding a bike which you've created yourself is fantastic. Seeing other riders and players from all over the world racing in your livery is simply the best!CAREERThe new career will be a Single Player experience which has never been seen before. Forget the old linear progression: the new Volumes-based system will allow you to collect, read and participate in races and competitions through more than 50 magazines. Each one will catapult you into a unique game experience, made up of competitions and anecdotes about the motorcycling world, which will increase your experience in RIDE 3.MULTIPLAYERNot your usual multiplayer mode. A new Weekly Challenges system will put your skills to the test. Try your hand at Time Attacks every week, where you will be able to compare your results with those of players all around the world on specific tracks and bikes. Will you manage to become the week's fastest rider? Climb the global leaderboards and those of your friends to show everyone what you're worth. Compete against your friends or other players in classic challenges: single races or Grand Prix.\r\nWhat are you waiting for? Start your adventure with RIDE 3.","imageUrl":"https://media.rawg.io/media/games/1fd/1fdb8693fcca15742d36ef06dbf9e567.jpg","releaseYear":2018,"developer":"Milestone","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":65376,"name":"Detective Di: The Silk Rose Murders","genre":"Adventure","price":0.0,"description":"THE STORY\nAmid lingering political turmoil, the first and only female empress of China, Wu Zetian rises to power. Within months of her ascension to the throne, murmurs of discontentment and revolution swell as detractors and enemies begin plotting against her. It is against this backdrop that our protagonist, newly appointed investigating magistrate Di Renjie, must solve a gruesome series of murders--which will lead him on a collision course with the Imperial court and the empress herself.\nWill our young detective overcome his own inner demons and his allegiance to the previous emperor? What is the connection between the murder victims and the capital's many political secrets? YOU must uncover the truth...GAMEPLAY\nPlaying as the legendary detective, players will explore this unique setting and unravel its narrative twists and turns using familiar adventure gameplay mechanics such as exploration, dialogue choices, interaction with objects and clues, and puzzle-solving. Additionally, we are introducing an original mechanic where you will be able to deduct and reenact the scene of a crime and put your theories to the test.\nThe pixel art style of the game is also an homage to old school graphics, but we've added our own visual signature and design sensibilities. The game contains over 45 locations (many spanning multiple screen widths), each one pixel-painted with care and attention to detail.FEATURES\nDistinct 2D pixel art style\nImmersive story-driven experience dripping with historical atmosphere\nChallenging and fun puzzles to solve\nUnique Chinese cultural and historical references\nFantastic soundtrack with 13 original tracks\nMultiple language support: English, Chinese, and French\nWindows and Mac support","imageUrl":"https://media.rawg.io/media/screenshots/8a4/8a4b8303d13a0b74ef9c210a7a878de9.jpg","releaseYear":2019,"developer":"Nupixo Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53941,"name":"Mega Man 4 (1991)","genre":"Action","price":0.0,"description":"Mega Man 4, known in Japan as Rockman 4: Aratanaru Yabō!! (ロックマン4 新たなる野望!!, Rokkuman Fō Aratanaru Yabō!!, lit. \"Rockman 4: A New Ambition!!\"), is an action-platform game developed by Capcom for the Nintendo Entertainment System. It is the fourth game in the original Mega Man series and was originally released in Japan in 1991. The game was localized in North America the following January, and in Europe in 1993.\nThe game's story takes place after the third defeat and supposed death of Dr. Wily, and features the Earth coming under threat from a mysterious scientist named Dr. Cossack and his eight \"Robot Masters\". Fearing the worst, Dr. Light sends Mega Man to save the world once again. Mega Man 4 carries on the same action and platforming gameplay as the first three games, in which the player completes a series of stages in any order and adds the weapon of each stage's boss to Mega Man's arsenal. One notable added feature is the \"New Mega Buster\" (often shortened to \"Mega Buster\"), an upgraded arm cannon that lets the player charge a regular shot into a much more powerful blast. The development team was mindful that this innovation would change the overall feel of the game.\nDespite Mega Man 4 receiving positive critical reviews during its early 1990s release, the game is widely regarded today to represent a downward shift from the quality of the first three games in the series. The Mega Buster itself has been considered an overused mechanic by several sources. Mega Man 4 was re-released on the Japanese PlayStation, PlayStation Network, and mobile phones; the North American Mega Man Anniversary Collection; and worldwide on the Virtual Console for 3 Nintendo systems (Wii, Nintendo 3DS and Wii U).","imageUrl":"https://media.rawg.io/media/screenshots/e19/e1958de27771d79d9f2b3897c8389f42.jpg","releaseYear":1991,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"NES"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Android"}]},{"id":50260,"name":"80'S OVERDRIVE","genre":"Racing","price":0.0,"description":"80'S OVERDRIVE is a 2D pixel art racing game, designed to take you back\nin time to when 8 and 16 bit consoles and arcade games ruled the world.\nCompete against opponents in career mode to unlock new races, buy new\ncars, and upgrade them with state-of-the-art technologies! Try your\nskill in time attack mode and see how far you can get in this race\nagainst the clock! Create your own tracks with built-in track generator\nand easily share them with your friends!\n\nFeatures:\n\n2 game modes and racing track editor;\n\n6 retro supercars;\n\n8 unique visual themes;\n\n13 synth/retrowave music scores;\n\ntons of retro, handcrafted, pixel-perfect joy!","imageUrl":"https://media.rawg.io/media/screenshots/447/447206ab62c227770ae15a68de9311ad.jpg","releaseYear":2017,"developer":"Insane Code","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"}]},{"id":48983,"name":"Misao: Definitive Edition","genre":"Adventure","price":0.0,"description":"MISAO is a horror-adventure game in which you search for a young girl who has disappeared in a cursed school.PlotJust three months ago, a young girl went missing.\nHer name is Misao. She was a classmate of the player's character.\nQuiet and reclusive, this plain girl was often the target of bullies.\nSince the day she disappeared, rumors spread throughout the school of unnatural phenomena.\nThe children called it \"Misao's curse\"...Characters\nProtagonist\nIn this game you can choose a female or male protagonist.\nThis will not have a major impact on the story itself, but some of the dialogue and scenes differ slightly for the different genders and personalities.\nMisao\nA young girl who went missing. In the classroom she is considered is a plain, reclusive girl. Her grudge is at the root of this story.\nTohma\nA boy with a handsome face, popular with the girls. But he is no knight in shining armor.\nSaotome\nAn attractive girl, popular with the boys. Nicknamed \"Otome\".\nAyaka\nA girl with her head in the clouds. She has a thing for her teacher Sohta.\nYoshino\nShe is the ringleader of the bullies who harassed Misao.\nKudoh\nA boy with a mature, collected personality. A childhood friend of Misao.\nKurata\nA handsome, kind teacher who has earned the respect of his students.\nOnigawara\nPresident of the student council. A mysterious figure who seems to know a lot about recent events.\nLibrary\nA mysterious young woman who got her name from spending copious amounts of time in the library. She can offer the player hints.\nControls　[↑][↓][→][←] Move the player character, navigate the menus.\n[Z][Enter][Space] Progress text, examine objects, confirm selection.\n[X][Backspace] Cancel, display menu, progress text.\n[c][Shift] Quick save\n[F6] Reset game\n[F4] Change screen size\nAbout Save / Quick Save\n(Save)\nBy talking to Onigawara on the 3rd floor you can save your game. (Choose the \"Save\" option.)\nWhile on the move, you can quick save by pressing [c] or [Shift].\n\n(Quick Save)\nAfter using the Quick Save feature, if you get Game Over and choose \"keep going\" you will instantly return to the point of saving.\nHowever, if you close the game entirely your Quick Save data will be lost.\nIf you start the game and get Game Over without using Quick Save, selecting \"keep going\" will return you to the title screen.\n*There are certain places in which you will not be able to use Quick Save.Developer's VoiceThis is a remake of the original version of Misao. This version includes:\n・Improved graphics\n・Improved puzzles\n・Extra event scenesI hope you enjoy this newly reborn \"Misao\".","imageUrl":"https://media.rawg.io/media/screenshots/81f/81fdba3ff6717676332e393c5d1fce1f.jpg","releaseYear":2017,"developer":"sen","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":47225,"name":"FoxyLand","genre":"Adventure","price":0.0,"description":"Ah... love, Love...\nHow beautifully in one word. My mind is racing, my stomach flutter butterflies, heart racing. Are you willing to do anything to give a million cherries, collect all the jewels and even save your favorite?\nHere's our Foxy Fox is ready to rescue his love! He sent her on a dangerous journey and without Your help Foxy to save her!\nEmbark on an adventure filled with dangers and difficulties that You have to overcome! Complete many challenging levels, collect the gems and cherries and get to the end of the level to get three stars.\nLook in the shop and spend the collected cherry on new items. Open the full collection of outfits for the Fox Foxy!\nAnd if You can pass all levels in FoxyLand? We now check!\nFeatures:\n-Many different levels\n-Puzzles and Hardcore\n-Love story\n-Gamepad Support\n-Retro style game\n-Beautiful pixel art and chiptune music","imageUrl":"https://media.rawg.io/media/screenshots/ec7/ec70764a2e5a4389962f3a4e3d6de25c.jpg","releaseYear":2017,"developer":"BUG-Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":44572,"name":"Disco Destruction","genre":"Simulation","price":0.0,"description":"About the game:\nDisco Destruction is the story of a derelict Miami disco, built by an old, grumpy man from Mykonos. You just found yourself in the wrong place and time and… boom, now you are a DJ.\nBut there are no mp3s or laptops with glowing fruits. Only the old man’s dusty vinyl collection, and some broken record players. Keeping the people happy won’t be easy. You’ll have to keep your eyes on their mood, and strategically build it up, until they reach “ecstasy”.\nCan you DJ? Well, the old man doesn’t care. You f****d it up, and now you have to pay up. Just play some music, man, and keep the customers happy, to keep them paying. And, for god’s sake, never let the music stop!Things you can do:Play music using your virtual vinyls (and scratch!)\nManage the mood of the customers\nBreak things\nEnjoy getting \"things\" thrown at you\nMake money - and compete for a high-score","imageUrl":"https://media.rawg.io/media/screenshots/e7b/e7b6a036de6043edb3f9b5d49fde5fb5.jpg","releaseYear":2017,"developer":"Subjective","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":42957,"name":"Final Fantasy XIV: Heavensward","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/b72/b72a7c7ce43b2ac0cd503124d8b02f37.jpg","releaseYear":2015,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":36321,"name":"Fallen Earth","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/662/662336c798f276f30d86c169912060be.jpg","releaseYear":2009,"developer":"Icarus Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":34851,"name":"Guild Wars","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/073/07391020953f7494efdab98471f9818f.jpg","releaseYear":2005,"developer":"ArenaNet","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":27947,"name":"Flipping Death","genre":"Adventure","price":0.0,"description":"When Penny dies under mysterious circumstances, she wakes up and finds herself filling in for DEATH HIMSELF! This temp job comes with a new power - the ability to flip between the worlds of the living and the dead! In this puzzling platformer, she’ll need that - and her wits - if she ever hopes to unravel the mystery of her demise.\nLeap between platforms, solve puzzles and help the dead rest in peace by possessing the living and making them dance around at your merest whim in this comedy adventure game by Zoink Games, with writing by the Eisner-award winning Ryan North.\n- Flip between worlds: Move swiftly between the living and the dead.\n- Possess the living: Control their limbs and read their minds to solve puzzles.\n- Play as Death: You're just a temp, but the ultimate power of life and death is in your hands.\n- Dive into a rich, colorful world: Explore vivid environments in a pop-up book style and make your way through a completely original storyline!","imageUrl":"https://media.rawg.io/media/screenshots/5b6/5b65d8df68e2cdc6d19950e192b6a5f8.jpg","releaseYear":2018,"developer":"Zoink!","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":25161,"name":"Lode Runner","genre":"Arcade","price":0.0,"description":"The Bungeling Empire has stolen a huge cache of gold from its rightful owners, and your mission is to infiltrate its treasury and recapture it. This entails progressing through 150 screens of platforms, ladders and ropes.\n\nThe Empire has sent robotic guards down to protect the gold, and contact with any of these will cost you a life. Your method of escaping them is to press fire to dig a hole in their line of movement, thus causing them to fall in briefly, allowing you to move across the gap safely. Once all the gold has been collected, a ladder allowing you to move onto the next screen is added. Completing these screens often requires forward planning and precision.\n\nThis was one of the earliest games to include a level editor, allowing the creation of new level designs with no programming skill.","imageUrl":"https://media.rawg.io/media/screenshots/127/127a986dd3867ca6c529377b07f57882.jpg","releaseYear":1987,"developer":"Broderbund Software","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"Apple II"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"NES"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Atari 8-bit"}]},{"id":21689,"name":"Words for Evil","genre":"Action","price":0.0,"description":"Words for Evil is a fast paced word game combined with a fantasy RPG.\nIt is available on both PC and Mac.\nFull keyboard support - The game moves as fast as you can type\nFour separate word games - Battle monsters, unlock chests, defuse traps and cheat death\n16 Heroes to unlock, each with their own skill sets\nNearly 100 monsters to defeat\n6 beautiful stages to discover and explore\nDeep combat system - Buffs, critical hits, armor, character attributes, disables, attack modifiers...\nWords for Evil features everything you expect from an RPG, all built on top of classic word game mechanics.\nDefeat powerful monsters\nLevel up your heroes, and unlock powerful abilities\nDiscover new heroes, and add them to your party\nPurchase equipment and potions to become even stronger\nTrack your progress with the bestiary and stat pages","imageUrl":"https://media.rawg.io/media/screenshots/47e/47eea7a3ffb032c4c6acf89606546e00.jpg","releaseYear":2014,"developer":"Dylan Loney","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20976,"name":"Brink of Consciousness: Dorian Gray Syndrome Collector's Edition","genre":"Adventure","price":0.0,"description":"Venture into the realm of a madman to free your beloved from captivity in Brink of Consciousness: Dorian Gray Syndrome Collector’s Edition, an incredible Hidden Object Puzzle Adventure game! As reporter Sam Wilde, you must work quickly to unravel a bizarre series of disappearances involving young and beautiful people.\nYour investigation suddenly becomes personal as the next victim of this psychotic serial killer is Anna, your love! Sam’s every move is being tracked so he has to be extra careful. Putting his journalistic talents to the test, Sam must find the maniac who has kidnapped Anna, and stop him before it’s too late. Travel to Goldvale Manor and scour every nook and cranny of the grand mansion for clues that might lead you to her rescue. Use your instincts and intellect to solve devious puzzles, avoid traps and defy the lunatic's treacherous scheme.\nWill you ever escape his clutches?The Collector’s Edition includes:\nGorgeous locations and highly detailed hidden object scenes\nBonus gameplay\nInterview with the developers\nConcept art","imageUrl":"https://media.rawg.io/media/screenshots/708/708f9225d0c3db69afb447bf6e805168.jpg","releaseYear":2014,"developer":"MagicIndie","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]