[{"id":57679,"name":"Shin Megami Tensei Persona 2: Innocent Sin","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d74/d74ec29edff81490be38e218a7669901.jpg","description":"Persona 2: Innocent Sin is a Japanese role-playing video game developed and released by Atlus for the PlayStation in 1999. It is the second entry in the Persona series, itself a subseries of the Megami Tensei franchise, and acts as a sequel to the original Persona. The game was re-released in 2011 for the PlayStation Portable. The original version was not localized for western territories, however the PSP version was released in North America and Europe under the title Shin Megami Tensei: Persona 2: Innocent Sin.\nInnocent Sin takes place in the fictional Sumaru City, focusing on a group of high school students from Seven Sisters High School. The protagonist, Tatsuya Suou, and a group of friends must confront a villainous figure called the Joker, who is causing the spread of reality-warping rumors through the city. The group are aided in their quest by their Personas, personified aspects of their personalities. The gameplay features turn-based battle gameplay, where characters use their Personas in battle against demons, and a separate Rumor system, where rumors spread around the city can influence events in the characters' favor.\nDevelopment on Innocent Sin began after the release of the original Persona, and retained most of the original's staff. The game carried over the story themes and basic gameplay mechanics of Persona, while changing and improving on some of the mechanics. The characters were designed by Kazuma Kaneko and Shigenori Soejima. The original release was not localized due to staff shortages and concerns over its content. Reception to the game was generally positive for its original release, but reviews were more mixed for its remake due to its age. A direct sequel to Innocent Sin, Persona 2: Eternal Punishment, was released in 2000 in Japan and North America.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation"}]},{"id":49080,"name":"Distant Space 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/096/09646764a9de1e1c03c583af99603a4d.jpg","description":"Distant Space 2 - is an indirect continuation of the first part, in which you will find more dynamic gameplay. Your task is to destroy enemy ships on each level to go to the next of 26 available. In addition to conventional ships, you will have to wait for the boss ships, the battle with which will not be easy. To help you available additional weapons, which can be picked up from the enemies you killed.\n• 26 levels.\n• 3 unique bosses.\n• Dynamic gameplay.\n• Pleasant musical accompaniment and style of the game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PixelMouse","platforms":[{"id":0,"name":"PC"}]},{"id":21494,"name":"Ironclads: High Seas","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/774/774fd983e7486694e850b9b97d62ff69.jpg","description":"For over a year the forces of the United States of America (Northern States) and the Confederates States of America (Southern States) have fought a bitter war. In 1862 the governments of Great Britain, France and Spain recognize the Southern States to secure raw materials. The Souths economy becomes dependent on trade with Europe. The Northern Government imposes a complete blockade of shipping to the South. The Confederate Government buys warships from the European powers, to protect its trade. This sets the stage for a naval conflict for control of the Confederates trade routes. Choose a side, build a fleet and destroy the enemy.\nKey features:\nManage financial and strategic aspects while planning your squadron's structure\nScramble your fleet to gain sea supremacy\nSet up battle squadron groups, their formations and management\nRealistic ship models and characteristics\nAdvanced ballistics and weapon models","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Totem Games","platforms":[{"id":0,"name":"PC"}]},{"id":20341,"name":"Fairy Tale About Father Frost, Ivan and Nastya","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c98/c9820fc30abe43d14099afd50f9b9655.jpg","description":"Inspired by reading more than one thousand Russian fairy tales, this is a story about love, spite, greed, modesty, humility and seeking. It is divided into four acts - according to the four seasons. That means you'll visit some of the game locations several times, but every time at a different season and in a different time of day.\nTogether with the characters of a humble girl Nastienka and gallant hero Ivan you are to overcome many baits and puzzles and in the end you'll try some of the wedding's pirozhki.\nYou are awaited by mysterious beings and magic objects, wild beasts and domestic animals and pets, guileful highway robbers, evil hag Baba Yaga, Old Man Mushrooom, prudent Father Frosty and many other traditional and non-traditional fairy-tale characters.\nAny child able to switch a computer on can play this with parental assistance, however, this is ideal for children aged 6 years as their first game as the PC control system is for the beginner.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":19972,"name":"The Secret Order 2: Masked Intent","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a0a/a0aa45895c15ff2b396942c0fa22d0d2.jpg","description":"The Secret Order 2: Masked Intent is a suspenseful adventure with historical elements based on the theme of the conflict between good and evil.\nThe daughter of the Master of the Order of the Griffins receives an alarming call. She is the only person who can stop the new member of the high council – the Secret Five – from destroying the Order. The organisation has guarded the world for centuries, but recent events have brought it to the verge of ruin. Embark on an epic journey full of magical items, forbidden mysteries, and time travel. Restore the order of the world and make amends for the sins of the past. Learn the secrets of forgotten artefacts, travel to the 17th century, earn the trust of the spectres imprisoned on a mysterious island, and discover the seat of the Clan of the Dragon, whose only mission is to thwart the efforts of the Order and to spread chaos.\nWill the two powerful artefacts be returned to their rightful places and will the world be saved from destruction? Will the Master's daughter live up to the task?\nFeaturesFind over 260 items in 15 hidden object scenes!\nExplore 90 stunning locations!\nComplete over 30 various minigames!\nEarn 24 challenging achievements!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":18498,"name":"Samantha Swift and the Golden Touch","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51b/51b69bf5a79063979eb8a49c70f3459a.jpg","description":"When Samantha's new benefactor asks her to track down Alexander the Great's Scroll of Wealth, the opportunity seems too be good to be truesearching for the scroll while collecting amazing finds for the Museum of Secrets Lost!  Little does she know that a secret brotherhood is watching her every move and that she'll have to do a lot more digging to find the true treasure.\nTravel to exotic locations as you help archaeologist and adventurer Samantha Swift uncover the ancient secrets and mystery shrouding the famed Golden Touch!\nEngrossing mystery story sets the stage for this Casual Adventure game\nSolve puzzles, collect artifacts and piece together clues to uncover the secrets of the Golden Touch\nAll-new levels, backgrounds and puzzles to explore\nCollect artifacts and golden treasure for The Museum of Secrets Lost\nLocate tools in each scene to help you along your way\nUncover completely hidden special items, and use the right tool to recover each one\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":18172,"name":"Hiiro","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5a/e5a5a05d17c8652fa7768fda1a9c8618.jpg","description":"Hiiro is a 2D platform game focused on ambient exploration and puzzle solving. Discover a grand world filled with mysterious artifacts and forgotten ruins. Become immersed in relaxing gameplay and meditative music. Remain observant as you unravel an explanation for your solitude. In-game death not included.\nFeatures:\n• Exploration - One vast world to travel through with eight distinct environments. Think Seiklus, Knytt, or An Untitled Story.\n• Discovery - Hidden secrets and puzzles scattered throughout the world. Various levels of hidden and various levels of difficulty.\n• Dynamic Soundtrack - Meditative music that seamlessly transitions as you move through the world.\n• No Death - Explore a world without fear.\n• No Language - A story told without words, spoken or written.\n• Wide Range of Gameplay - Easy mechanics for the non-gamer, hidden secrets for the casual gamer, challenging puzzles for the hardcore gamer, awesome rewards for the completionist. Something for everyone.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jon Tiburzi","platforms":[{"id":0,"name":"PC"}]},{"id":17813,"name":"UFHO2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f8/9f8d257c9980220486fe14aea9dfa1f7.jpg","description":"Play an alien navigating a maze of hexagons in this competitive mix between strategy and board game. Plan your next turn, think fast, act faster, and outmanoeuvre your opponents by predicting their moves. If you are into strategy and tactics, UFHO2 will put your brain to the test!\nIn this sequel, things get bigger and better in every way: new stages, more board layouts, all new characters, new game modes, and more powerups; plus Steam Leaderboards, Achievements, and Collectable Cards.JELLY FEATURES:Story Mode — 10 unique planets along 2 different story lines, for a total of 25+ matches\nLocal Multiplayer mode — outwitting your friends is more fun when you can see the disappointment in their eyes\nSituations mode — once you’ve become really good, show your worth in these super-hard matches!\n10 different alien races to unlock, each one with its own in-game power\n6 guests from other indie games (World of Goo, Super Crate Box, Bit.Trip, Blocks That Matter, Gish, Cortex Command)\n24 Achievements and 2 Leaderboards - be the best in the world!\nUp to 4 players on one computer!\nA wonderful original soundtrack, by composer Francesco D'Andrea — listen to it on BandcampAND MORE TO COME SOON:A cross-platform Online Multiplayer mode\nEven more characters\nHats for everyone :)\nUFHO2 is strategy at its finest.\nFollow the game on Twitter, and the developer on Twitter and Facebook","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tiny Colossus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16608,"name":"Idol Magical Girl Chiru Chiru Michiru Part 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/118/1188f92b8d945c8d06e4bba615ed37d9.jpg","description":"Michiru's quest to save the world by sealing the Chaos that threatens it is progressing flawlessly... except for the fact that her fellow Magical Girl and rival, Kazuki, is beating her at every turn! She wants to prove her worth as a Magical Girl, and win the Magic wish that can make her dreams come true, but so far, all she's proven is that she's a failure.\nThen, just as it seems that Michiru may have actually done something right for once, and earned Kazuki's respect in the process, a flash of light and an ominous rumbling noise interrupt her rejoicing. Michiru is dumbfounded, while Kazuki merely remarks: \"I never thought it would come so soon...\" Just what could be heading their way?\nThis visual novel, a spinoff of the popular \"Fruit of Grisaia\" series, follows Michiru's adventures in an anime-like format of 13 episodes. It is split into two Parts: Part 2 continues where Part 1 leaves off, and contains the last 6 episodes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frontwing","platforms":[{"id":0,"name":"PC"}]},{"id":15473,"name":"Perfect Universe - Play with Gravity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/684/6846598c9d7f32ec61b998789d093e98.jpg","description":"Follow the stories of 3 lonely characters as they strive to fulfil their potential in an absurd world. Compete against friends in 6 sporting events set in gravity defying arenas. The unique art style, surreal levels and eclectic music blend harmoniously to create an experience unlike any other. Played solo, Perfect Universe is a chilled-out and relaxing experience. Played with up to 4 people, it will have you at the edge of your seat, as your skill is tested to the limit.\n- Perfect Moon: Classic platforming in a non-classical universe.\n- Moon Life: Control the feet of an alien creature directly in this QWOP-like.\n- Star Light: Fly your rocket ship through the galaxy in this Thrust-like.\n- Moon Golf: An interplanetary game of golf.\n- Gravity Dodge: A 4-player game of alternative gravity dodgeball.\n- Balloon Pop: Scramble to pop more balloons than your opponents.\n- Rocket Ball: Play football, with rockets!\n- Moon Volley: A game of volleyball around a little planet.\n- Space Race: Race rockets against friends.\nPlay with gravity.Other titles from Excalibur Games","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Will Sykes Games","platforms":[{"id":0,"name":"PC"}]},{"id":2612,"name":"Nights of Azure","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e85/e85d35b22df177a435e39c071b744b4a.jpg","description":"Special OfferThe DLCs below are included in the base game.\n- GUST-chan, the Servan\n- an additional map, \"Tokoyami no Kairou\"\n- an additional episode, \"Tsuioku no Kioku\"\nAbout the GameSave the world or the life of one girl... I decide my destiny!\nThe world was once ruled by the Nightｌord.  In that world lived a Saint, destined to become a sacrifice to the Nightｌord, and a Holy Knight, with the power to use Servans.\nThe meeting of the girls changed the fate of the world.\nTake your Servans and fight accross \"The Land Without Night\" for the one you love!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":962109,"name":"Cyberpunk 2077 & Phantom Liberty Goodies Collection","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bfd/bfd1527ccfd77101b1358ca7793014f6.jpg","description":"Hey there, chooms!\nBefore you take on an impossible mission of espionage and survival in Phantom Liberty, the spy-thriller expansion for Cyberpunk 2077 set in an all-new district of Night City, you can grab the free Cyberpunk 2077 & Phantom Liberty Goodies Collection on GOG now, before it fades away!\nThis unique content pack compiles — for the first time ever —the best of previously released CD PROJEKT RED content from Cyberpunk 2077 and the upcoming Phantom Liberty. Among the content featured in the Cyberpunk 2077 & Phantom Liberty Goodies Collection, you'll find digital wallpapers, screenshots, key visuals, printable posters, gang graffiti, and more – everything that will give your PC that needed cyberpunk touch before venturing into Night City and Dogtown.\nGrab the Cyberpunk 2077 & Phantom Liberty Goodies Collection while you can! It will be available on GOG until the 14th of June 2023, 6 PM UTC.\nTo download the goodies, proceed to your Library on GOG.com.\nNotice: Please note that the Cyberpunk 2077 & Phantom Liberty Goodies Collection will expand with new content in the future, so be on the lookout for more updates!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PC"}]},{"id":830052,"name":"Operation: Harsh Doorstop","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93f/93fd20b863ee363ce610d7f47f5472da.jpg","description":"Operation: Harsh Doorstop is a Patreon funded tactical shooter that will be free upon release. Support us on Patreon and immediately get a Steam key to our multiplayer alpha. Support us at patreon.com/drakelinglabs","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Drakeling Labs","platforms":[{"id":0,"name":"PC"}]},{"id":702395,"name":"WorldBox - God Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e70/e7013ac8595498ac5b15f3ce4919d9b7.jpg","description":"WorldBox is the ULTIMATE god simulator and sandbox game!Create your own world or destroy it using different powers:God Simulator. There are a lot of powers in your toolbox that can be used without mana or resources.Living world. Creatures have traits and needs. Animals will look for food. Greedy kings will try to get more lands.\nUse different tools and brushes to design and populate your world:Fantasy Races. There are 4 civilized races in WorldBox. Humans, orcs, elves and dwarves. Each with its own design and specific race traits.Civilizations. Races will form kingdoms, colonize new lands and will sail to far continents that you'll create.Diplomacy system. Kingdoms will fight with each other. Towns will rebel. Empires will fall. It's your choice to help or watch them fight.\nMany fun and crazy abilities that you can use:Destruction powers. Lightning, tornadoes, acid rain, nukes, meteorites, plague, dragons and even UFOs.Different creatures. Demons, skeletons, zombies, tumors, cold ones, dragons, UFOs and even a giant Crabzilla that you can control yourself!\nInteract with your world and create various scenarios:Interact. Interact with your world with the divine magnet. Use your powers to start wars or create huge tornadoes! You can affect the world in unique ways.Share your maps. Show your creations to other players of the WorldBox community!Procedural Generation. Generate worlds of different sizes and find kingdoms with unique flags and names.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Maxim Karpenko","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":625837,"name":"Demon Slayer -Kimetsu no Yaiba- The Hinokami Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e69/e69fae35b4e3afe8f6357c01fa6a0e6c.jpg","description":"Become the blade that destroys demons!\nIn solo play mode, walk the path of Tanjiro Kamado whose family is slaughtered and sister transformed into a demon. Experience the story depicted in the anime \"\"Demon Slayer: Kimetsu no Yaiba\"\" as Tanjiro fights to restore Nezuko's humanity and battle the demon threat!\nPlay Versus mode, which allows up to 2 players to battle in offline or online 2v2 battles with any combination of characters, including Tanjiro Kamado and Nezuko Kamado! With simple controls and exhilarating gameplay, rise up to become the strongest of the Demon Slayers!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":496757,"name":"RollerCoaster Tycoon 3: Complete Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8cd/8cdd73b430ee4954a4773b12198deb1c.jpg","description":"Your Park. Your WayWhatever you want to create, RollerCoaster Tycoon 3 gives you the tools and freedom to build the amusement park of your dreams.Manage like a tycoon and make your way to the top Control park finances, shops, services and staff to succeed in dozens of scenarios. Become a true tycoon and embark on your promising new career, or create your ideal park without money woes in sandbox mode. Satisfy your guests’ needs and keep your park running smoothly to succeed.Get ready to get ‘Soaked!’ and venture into the ‘Wild!’ This complete edition includes all content from both Soaked! and Wild! expansion packs. Relish the added challenge of creating and managing exhilarating waterparks and spectacular animal habitats.Enhanced for PCPlay RollerCoaster Tycoon 3 in widescreen for the first time with full 1080p resolution and increased compatibility for new PC hardware.Ride the RidesRide your creations with RollerCoaster Tycoon 3’s signature coaster cam.Packed full of content You’re free to fill your bustling park with more than 300 coasters and rides, 500 scenery pieces, 60 shops and services, and 20 animals to rear and raise.Peep DesignerCreate your own guests and experience your creations through their eyesMixMasterWow your visitors with custom laser light and firework displays to delight and dazzle.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":438620,"name":"The Lord of the Rings: Gollum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/470/470fb8435cdea25bda1126e0b8e0a3b0.jpg","description":"The Lord of the Rings™: Gollum™ is a story-driven action adventure. Take on a perilous journey as Gollum, chasing the only thing that is precious to him. Gollum is skillful and cunning, but also torn by his split personality. One mind, two egos – you decide!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":398403,"name":"Bravely Default II","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/387/38752d648614599896ea113ce4a95753.jpg","description":"An original RPG experience is coming to Nintendo Switch in 2020 from the team that brought you the Bravely series and Octopath Traveler, and featuring music from Revo, acclaimed composer of the original Bravely Default soundtrack.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Square Enix","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":383584,"name":"Game of Thrones Winter is Coming","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4df/4df7ee549f5cd81963d558b86c2929e9.jpg","description":"Join the battle in Game of Thrones Winter is Coming, Yoozoo's new real-time MMO strategy browser game.\nPlay the role of an ambitious Westeros lord, determined to save a people plagued by war and put a stop to the endless disputes between the Seven Kingdoms.\nThis new strategy game has been built using the Unity engine and has beautifully rendered characters and scenery designed by renowned artists.\nGame of Thrones Winter is Coming has been designed to give players a balanced combination of strategy and roleplaying for a unique gameplay experience. Build your base, expand your territory, recruit characters from the show, train your army, and make history.\n1. Dive into the World of Westeros\n- Westeros Like You've Never Seen It Before: The world of Game of Thrones Winter is Coming has been crafted and designed to recreate a geographically accurate version of Westeros with all the major castles from the show.\n- Sit on the Iron Throne: Party up with your friends and raise an army to compete with other lords over the castles across Westeros. Eventually, your quest is to sit on the Iron Throne and become the ruler of Westeros.\n- It's Down to You: Will you cut down those who seek to betray you? Or conquer cities and rule over vast lands? Make your own choices and create your own legend in the struggle for power.\n- Relive the story of Westeros: Interact with events from the show and play through your favorite moments as a Westeros lord.\n2. Meet All Your Favorite Characters\n- See Game of Thrones and its characters from a different perspective. Forge your own path and progress together with your favorite characters from the TV show as you recruit them in your army.\n- Use Commanders you have recruited from the show in battle. Check their attributes, ranks, guards, and armies, and use their unique skills in battle.\n3. Expand Your Territory and Build Your Base\n- Customize your castle and add an array of different areas with their own distinct features and upgrades to help you build your kingdom.\n- Then explore a vast and varied recreation of Westeros with over 30 different terrain and weather types in an ever-changing world.\n4. Destiny Calls Your Troops, 10,000 Faces Arise\n- Battle among 10,000 other players that can all fights across the world simultaneously, conquering kingdoms across Westeros.\n- Select your commanders, set your battle formation, and use their abilities to complete missions in both PvE and PvP for great rewards.\n- See the story of Game of Thrones unfold again and unlock exclusive hidden storylines through a wide variety of PvE missions.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"YOUZU (SINGAPORE) PTE","platforms":[{"id":0,"name":"PC"}]},{"id":262346,"name":"MediEvil (2019)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/270/2706ca125d9a7f9c9fbccb2a1707db58.jpg","description":"Completely remade from the grave up!\n\nMediEvil follows the story of Sir Dan, an unlikely champion who met an unfortunate end on the field of battle. He receives a chance at redemption when his nemesis, the evil sorcerer Lord Zarok, accidentally resurrects him 100 years after that fateful day. Lord Zarok seeks to conquer the Kingdom of Gallowmere, and only the skeletal Sir Dan stands between Zarok’s army of the undead and the kingdom he swore to protect.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Other Ocean Interactive","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":44728,"name":"Next Day: Survival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fc/0fc17fc7b4c07f7497d34673fee4fc73.jpg","description":"----------------------------------------\nHello everyone! We'd like to inform you that we've opened early access testing. We'll be glad if you support us not only by searching for errors, but also financially. If you want to play only the final version of the game, please don't buy it right now, just add it to the wish list.\n----------------------------------------\nNext Day: Survival is a multi-player SURVIVAL game with elements of RPG. Its action takes place in an imaginary country in Eastern Europe, a large part of whose territory is contaminated with toxic fog. The player's main task is to survive, to develop his game character's skills, and to interact with the surrounding world, other players, and non-player characters (NPCs). In the course of the game, the character earns a reputation, which gives him the chance to join various factions of survivors, each with their own features and limitations.\nMain Features:\n*Several additional game modes: Single, PvE\n*Big, open world\n*Interaction and shootouts with NPCs\n*System of factions and character reputation\n*Skill system\n*Variety of transport\n*Story and quests related to the factions\n*Large selection of blade weapons and firearms\n*Crafting, interaction with the environment, and obtaining needed resources\n*Extensive system for managing a character's health","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SOFF Games","platforms":[{"id":0,"name":"PC"}]},{"id":23740,"name":"ARMS","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89b/89baea5dcaec4424853e8fb888328dd9.jpg","description":"ARMS is a revolutionary new sport where elite athletes use awesome extendable arms to fight like never before.\r\n\r\nUse simple motion or button controls to dish out highly strategic beatdowns. Armed with a Joy-Con™ controller in each hand, you’ll feel the heat of battle as you punch your way to victory.\r\n\r\nPick from a variety of different fighters, each with their own special skills and weapons for each arm. Mix and match ARMS to create the ultimate champion.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":22477,"name":"Ironclads: Chincha Islands War 1866","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/88a/88a2766e17c0f040259a52059bdb0aea.jpg","description":"Spain tried to restore by force its influence on its former colonies, Chile and Peru. This strong Spanish squadron occupied the Chincha Islands, very important to the economy of Peru. Peru received support from neighboring Chile, Ecuador and Bolivia. After several battles, the heavily damaged Spanish squadron was forced to withdraw to the Philippines for repairs. In 1866, Peru strengthened its fleet and sent ships to the Philippines in order to inflict retaliation on Spain. The Spaniards decided to use a weakening of the allies to send a new fleet to South America. The opposing forces gathered strength for the decisive battle of the Chincha Islands.\nKey features:\nManage financial and strategic aspects while planning your squadron's structure\nSet up battle squadron groups\nRealistic ship models and characteristics\nAdvanced ballistic and weapon models","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Totem Games","platforms":[{"id":0,"name":"PC"}]},{"id":21666,"name":"Ironclads: Schleswig War 1864","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/009/00958f83615d4d874a68173cd46442da.jpg","description":"The Danish government wanted to annex the duchy of Schleswig to the Danish kingdom while the Prussian government, for internal political and strategic reasons, wanted Schleswig to finally became a part of Germany.\nA key element of Denmark's war strategy was the blockade of Germany's Baltic sea ports, thereby disrupting German overseas trade and hindering Prussian naval operations in support the Prussian army. The supreme commander of the Prussian army insisted that the navy attempt to breach the blockade.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Totem Games","platforms":[{"id":0,"name":"PC"}]},{"id":20949,"name":"Sea Legends: Phantasmal Light Collector's Edition","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6f/e6f8e2e3d80580721e29b7ef92d606e5.jpg","description":"Jane regains consciousness on the shore of a strange island. On the rock, which stands in the middle of the sea near the island, shines the Lighthouse. Mike, her husband, is not near, though she vaguely remembers that the wreck of the sea they were washed up together from this ship. Searching for Mike, Jane gradually understands that this island is a huge graveyard of ships. Gradually getting to know the island's history and the tragic story of a lighthouse keeper, Jane realizes what danger threatens her and Mike, if she couldn't save him. Play colorful Hidden Object, solve puzzles, unravel the dark secrets of the island and secrets of the deathless lighthouse keeper. Can you outwit the ancient heritage and escape with Mike from the island?Key features: Explore 40 playable locations\nOriginal game world\nSolve tricky puzzles\nExplore an island\n12 hidden object scenes\n15 mini-games","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Shaman Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":20621,"name":"Burstfire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7dd/7ddf138d6a19ce14c1fc1fec55a5cc62.jpg","description":"Just UpdatedDear players,\nAll of us at Nacho games and Free Reign Entertainment are proud about the Burstfire game. We feel that we’ve been able to achieve a lot in a short time.  Burstfire was fun for us during both our internal tests and Open Alpha Summer 2015.\nUnfortunately the game in it's current state did not get popular enough for us to provide quality updates for it. To put it simply – the game just doesn’t have enough players to be fun – you may notice when playing that it’s difficult to find players to join a full game session.\nWe think that by continuing to sell game right now we’re providing a disservice to our players that buy the game and expect an active player base.  To make sure that players are not getting a bad experience, we’ve decided to halt the sale of the game.  We are going back to the drawing board and redesigning the game to better fit player expectations.\nFor the next 7 days we will provide an unconditional refund to anyone who bought the game regardless how many hours you've played or how long ago you purchased it on Steam or other platform.  We will refund your purchase 100%, no questions asked :)\nWe’ll keep the game servers up and running as long as there are active players trying to play the game.\nThank you for giving us your vote of confidence and trying out Burstfire. We’ll be back with a new and improved Burstfire in 2016, stay tuned for more news!\nBurstfire Team\nAbout the GameBurstfire is a tactical, competitive, first-person shooter that is a fusion of old-school tactical combat with modern design sensibilities that allow for a slower combat pace while maintaining a high level of excitement and fun!\nPlay as the attacking \"SWAT\" team to breach through enemy \"MERC\" defenses using tools such as the \"Breaching Charge\" or the \"Hacking Device\" to carefully, and precisely capture your objective, the enemy \"INTEL COM\".\nor\nPlay as the defending \"MERC\" team, setting up defensible positions around the \"INTEL COM\", your primary defense objective, using tools such as the Wooden Barricades and Wall Reinforcements.\nTwelve unique weapons to take into combat, each with their own unique feel and playstyle and balanced so that not one weapon has too much strength over the other.\nEquip tools for your operations to perform feats such as destroying weak walls and structures, hacking and disabling enemy devices, slowing enemy advances and more!\nPlay your way!  No loadouts, no classes.   Play the game exactly how you want to, equipping any item, tool, or weapon you want to use... no more being stuck with classes you don't like.\nGamemode:  Burstfire was created with the casual-hardcore player in mind.   Step into a single-life, single round world, where if you die, you lose the game.\nTwo maps are available : \"The Compound\" and \"Convention\" .","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nacho Games","platforms":[{"id":0,"name":"PC"}]},{"id":19865,"name":"Stranded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa7/aa746cfc3b721c68609c4681abc1ac7e.jpg","description":"Stranded is a 2D game with procedurally (randomly) generated levels. Heavily inspired by exploration, creation and character development games, such as Forager, Don't Starve Together and Stardew Valley.\nAn action roguelike with a lot of collecting and creation, start with absolutely nothing and using the resources available, build bases, improve your equipment and skills by facing hordes and villages of enemies, go as far as you can, but remember: Once dead, you will have to start everything from ZERO!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Peter Moorhead","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19368,"name":"Fenix Rage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bb/2bbf30c1912335795a5d3b5cbba2f03a.jpg","description":"Fenix’s village was decimated by a huge explosion, leaving only our hero and the mysterious Oktarus. As Fenix, track down this shadowy villain through nine worlds, defeating brutal bosses and hundreds of minions bent on your destruction.\nFenix Rage mechanics are unique yet simple – infinite jump and dash paired with instant restarts.   Race through hundreds of increasingly difficult levels, with new mechanics like fire, ice and jump portals. Each level has a split-second of opportunity for passage through the hordes of unrelenting enemies; either approach the obstacles through trial and error or pause to mentally traverse the level and plan for an optimal route. Try to top the leaderboards while listening to slick retro-inspired music and dashing through fantastic environments.\n\nKey Features\nOver 200 Levels: Each with varying enemies and obstacles to overcome, as well as cookies to collect! (Milk not included)\nNine Worlds: Varied and vastly unique worlds to traverse and conquer, each with their own unique challenges including hard-as-nails boss fights.\nInstantaneous Pace of Play: You will die… a lot. Luckily we have insta-spawns so players never have to wait long to try and try again.\nRapid-Fire Gameplay: Deviously designed levels featuring one-touch death enemies will force you to play quick and think quicker.\nLeaderboards: Can you beat your friends?  If it ain’t posted you didn’t beat it.\nArcade Mini-Games: Need a break from the beating?  The unlockable mini-games are just as addictingly and only slightly less frustrating than the actual game.\nChallenge Mode: Limited jumps.  Limited Dashes.  This should actually be called “HOW IS THIS EVEN POSSIBLE!?!?!” Mode.\nGod Mode: ???\nCookies: Collect enough cookies to unlock Fenix Rage level-themed cookie recipes. Bake them. Eat them. Rage on.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Green Lava Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19055,"name":"Day D: Tower Rush","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7c/e7cfe18a71453f642dabfa1f659fbaa9.jpg","description":"Create the future!\nYou tripped into history, or to be precise – you fell straight into the past. It's all in your hands now in this uncompromising battle for survival of the species! Find out who's stronger – the technology of the future, or brute force.\nLearn the power of science!\nMeet the heroes of a new Tower Defense strategy game – the professor and his robotic assistant. They got a little lost in their time machine, but even entire hordes of dinosaurs won't stop them getting back to their time!\nA unique world of 40 levels. Original opponents, fearsome bosses and rare fossils. Excellent game balance. You will leave your mark on history!\nThe technologies of the future against fossilized species!\nFight against thousands of enemies!\nFearsome weapons and unique opponents!\nExcellent game balance!\nShow your dominance!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"8Floor","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":18944,"name":"Regeria Hope Episode 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d2/0d2376d47d781d430394d32bbb28821c.jpg","description":"Regeria Hope is a whimsical courtroom visual novel in the style of an Attorney game with original characters and cases. You play as Regeria, a female lawyer who can use her powers of logic and reason to prove her clients innocent.\nIt’s not all that straightforward though. Sometimes, you may find compelling reasons for throwing a case, forsaking the very defendant you are sworn to protect. These decisions will affect the outcome of the case and will have a ripple effect on later episodes of the series.\nThe first trial has you defending a husband whose wife has been poisoned during the wedding reception. Currently you have the ability to prepare your witness, and interrupt other characters while they are speaking, but be careful, as you have a time limit to solve the case!\nKEY FEATURES:\n5 episodes - Choices made in early episodes affect future cases. Don't like a character? You can throw them under the bus. Just be sure you're ready to watch them hang.\nNew 'Witness Prep' Gameplay - Prep your witness to say whatever you want. Have them plead for mercy, or make them look like buffoons in front of the court to throw the case faster.\nNew 'Fact Overload' Gameplay - Connect the facts together to bombard witnesses and force them to confess! You only get one shot though, so make it count!\nNew 'Investigation' Gameplay - Short investigation sections which will affect the courtroom scenes. Play a board game and move Regeria to where she needs to be in time!\nNew 'Convince the Jury' Gameplay - Be mindful of all your actions in court! Needlessly interrupting or repeating the same action over and over will change what the jury thinks of you, and you will need to state your case to the jury at the end of each daily court session.\nFeaturing Music by Zack Parrish!\nFeaturing Sprite Art by Maesketch\nFeaturing Background Art by Sendo\nVoice Acting by:\nRachael Messer (Regeria)\nMarissa Lenti (Artemis)\nDane Doyle (Judge)\nRocky Marks (Pharrell)\nDigglyCerides (Hawk)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Golden Game Barn","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18590,"name":"Spell Fighter VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d42/d42e492063c28270a995add8c35690d0.jpg","description":"REQUIRES HTC VIVE.\nA FPP fantasy VR demo for movement controllers (currently only Vive), in which you can sword fight skeletons and cast spells by really speaking to the microphone (optional - read manual on Steam to activate).\nYou can also shoot medieval guns, bows, throw stuff at your enemies, summon and commad your wooden golem minions. It’s core is a small sandbox, where you can train your skills, but it also has a quest to complete!\nYou can rush through the game's quest in about 25 minutes, normal paced playthrough can take up to an hour.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kubold","platforms":[{"id":0,"name":"PC"}]},{"id":15435,"name":"Killing Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0b/f0b66fce52b23f537a6edf26c025e62e.jpg","description":"A sophisticated shooter laced with gallows humor. Killing Time is no shallow grave. Its depth is well-conceived. Puzzle solving and strategic thinking are placed at a premium. The visceral violence is complimented by paranormal graphics and a super(natural) storyline. Killing Time is a fright-fest for the true aficionado of first-person corridor mayhem.\nOST in MP3 format is included! (Check inside the folder called \"Bonus\")Features:Listen to the remembrances of the 7 video-real apparitions and ghostly guests. They offer clues as to what past heinous acts actually transpired in the cursed mansion.\nLook up and down - turn around with a complete 360 view. The three-dimensional mansion offers outdoor areas, staircases and intricately detailed ceilings and floors.\nThe original music makes this old haunt strongly inviting, eh? But beware. Every room, every passage in the estate holds dreadful dangers.\nEnjoy continuous gameplay with no load time between areas.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"The 3DO Company","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"3DO"}]},{"id":11190,"name":"Driver Booster 4 for Steam","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb6/bb6c66a1df0278b7346c70ba07f2f780.jpg","description":"Driver Booster 4 for STEAM, as a powerful and easy-to-use driver updater, provides 1-click solution to rapidly & securely update drivers including the outdated, missing and faulty ones. It aims to fix computer problems, such as system crash, BSOD, device connection error, audio crackling, no sound issues, slow network, etc. With online database, this tool updates drivers in real time to make sure your devices always have the best drivers matched. Your hardware will get optimized and your computer will run at its best with the up-to-date drivers. What’s more, in order to enhance gaming experience, Driver Booster also supports game-related graphic & audio drivers with performance improved specially for hot games. And game components are also covered to offer necessary game support and get rid of various lock-in issues of game run times. In short, Driver Booster is a driver updater to increase system compatibility, stability and performance. Game Boost\nWhat a bummer if can’t play online games smoothly! Driver Booster 4 for STEAM is a great partner for almost all kinds of online games. Users can easily keep game-related drivers up-to-date with just ONE click. What’s more, widely-used game components adopted by games range from small web games to Massive Multiplayer Online Game (MMOG) are supported. Users are able to play more 3D games with DirectX or experience vivid graphics with PhysX, other components like OpenAL, VC Runtime, Adobe Flash, UnityWeb, etc are also available.\n200% Larger Database  With a 200% larger online database, Driver Booster 4 for STEAM is the best driver updater software that can automatically scan & fix over 400,000 devices and PC drivers provided by more than 5,000 companies. Users will be free from problems such as slow internet, computer freezes & crashes, as well as conflict with peripherals caused by outdated, missing or incorrect drivers.\nSecure Driver Updating Driver Booster allows you to update your drivers more safely and securely than any other driver updater. To ensure the safety of users’ computer, only qualified WHQL drivers are provided by Driver Booster 4 for STEAM. It automatically backs up a previous copy and creates a system restore point before updating, in case anything unexpected happens. Automatically checking and fixing the display resolution issues after installation is also a newly-added feature to Driver Booster 4.\nIntelligent & Time-Saving Download Driver Booster 4 for STEAM has made some improvement in the download process. With an advanced driver compression algorithm, a driver package in Driver Booster 4 would be at least 30% smaller than its original size resulting in greatly reduced download time. Driver Booster 4 also offers at least 50% faster download speed and allows downloading and installation during system idle time with Auto Download feature, letting users focus on job at hand without any disturbance.\nSmart Installation When detect you are occupied in work or playing games at present in full screen, Driver Booster 4 for STEAM can pause installation process intelligently. It’s your call to decide to go on updating or not, after you finish your current work.\nAbout LicenseThe license codes of Driver Booster 4 for STEAM are Lifetime/3PC. You pay for the program only the first time and enjoy all updates & supports within version 4.X for FREE and for lifetime on any 3 PCs.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"IObit","platforms":[{"id":0,"name":"PC"}]},{"id":10566,"name":"Galactic Junk League","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79a/79a3bb05433a752949d9896820807385.jpg","description":"Galactic Junk League is a tactic sci-fi free-to-play shooter arena - a combat game mixed with almost infinite ship building possibilities.\nBuild anything. Fight anyone. In space.\nWhat used to be a prosperous universe is now a post-apocalyptic rusty dump full of galactic junk. Savage arenas became the only amusement we have. To fight and destroy, we use all necessary means from super advanced beam weapons to makeshift torpedoes made from a rusty fridge. The most valuable thing here? Your team.\nBuild your junk ships to literally any shapes and sizes and fight against the creations of other players in 7v7 PvP capture arenas across 3 new maps. The more you fight the better ships you can build. Pick one of the classes (Frigate, Cruiser, Battleship and Destroyer) and research all the blocks to build your ultimate junk ship. Every classs has its own role in the team.\n4 unlockable classes with unique fighting styles and build options\n3 unique multi-level weapon systems (Rockets, Lasers, Gauss)\nclass-specific abilities\n3 different maps, each with unique play style\ninfinite number of possible ship designs thanks to vast building options and mirror mode\nhigh level of replayability\nplayer profiles and top ladders\nskill-based matchmaking with players from all around the world!\nNew with the full release (compared to Early Access): brand new game mode: Galactic Conquest\nreworked game mechanics and abilities\nclass system overhaul\nTactical Communication Interface\nrevamped game start\nAI opponents\nsales and new DLCs","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Pixel Federation","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9439,"name":"Spaceship Looter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fef/fef851811fc357f853be4636073521ca.jpg","description":"What happens to the ship when the crew dies? It just dangles around the Universe together with other space debris and becomes home for aliens.\nAlmost always such ships are full of valuable cargo any mercenary can take. The terms are as simple as that: you bring the ship to the new owner and all the cargo is yours.\nThe point is not to join the dead members of the crew...\nSpaceship Looter is an action roguelike game, where mercenaries of all stripes rob drifting schooner, lost transtport ships and abandoned military cruisers - all what is filled with tons of valuable loot and hidden in the deep space.\nEach ship is randomly generated and filled with heavily armed enemies prowling in search of prey. Buy new guns, upgrade abilities of the heroes, buy antiques, fight, and be sure - the booty will be yours!\n- High difficulty\n- 7 spaceships\n- Interaction with the mechanisms\n- Randomly generated levels\n- Interesting quests\n- Juicy decoration\n- Full support of controllersPreviewsHardcore Gamer:\n\"Loot ships, get better toys, loot more ships, repeat.  Nicely explode-y with a whole lot of bullets going on\"Help translating the gameIf you know Chinese, French, German, Italian, Japanese, Korean, Polish, Romanian and Spanish then you can help!\nSpaceship Looter Translation Sheet","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Luxorix Games","platforms":[{"id":0,"name":"PC"}]},{"id":5084,"name":"Populous: The Beginning","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b6/6b6e78d2c701dd1e0c8199383b467ac3.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\nUse your power and magic as a shaman to build armies, unleash awesome spells, and conquer all of the worlds in the solar system in this real-time strategy game sequel to the popular \"god game\" series.\nDownload this PS one® Classic game today and conquer the solar system to become a god!\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 250 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\n© 2009 Electronic Arts Inc. Trademarks belong to their respective owners. All rights reserved.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":3658,"name":"TRANSFORMERS: Rise of the Dark Spark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9eb/9ebedc2aad6217a7200219ff9f513668.jpg","description":"New DLC AvailableDark Spark Battle Pack\nAnnihilate your enemies with this all-in-one weapon/character pack.\nSkywarp: He has never been interested in power or conquest, only the pursuit of knowledge. He joined the Decepticons to produce powerful weapons and experimental systems for use in combat.\nThundercracker: A Decepticon Seeker: a master of flight and aerial combat. He defected to the Decepticons with Starscream and Skywarp and now serves Megatron.\nStinger: A silent and mysterious bot. His motivations are unclear, but his prowess in battle is nothing to be trifled with. There may be more to Stinger than meets the eye…\nGlass Gas Cannon: This weapon creates a distortion field in mid-air, suspending opponents in mid-air and rendering them helpless before sending them smashing into the ground at high velocity.\nElectro Bolter: This weapon launches deadly harpoon-style projectiles. The kinetic energy of these projectiles knocks enemies back on impact and can even pin them to walls.\nAbout the GameExplore two unique worlds as your favorite TRANSFORMERS characters from TRANSFORMERS: Age of Extinction and Cybertron universes!\nIncludes Over 40 playable characters from two different universes!\nChange Form Anytime: Effortlessly switch between robot and vehicle form!\nBeyond the Movie: Weave your way through Earth and Cybertron universes in an unforgettable battle to secure the Dark Spark.\nEpic Multiplayer Battles: Expanded four-player co-op online escalation mode with new upgradeable defenses and challenging Power Foes!\nNew Unlock System: Leveling system spans campaign and escalation, allowing players to unlock rewards that will aid progression in both modes!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Activision","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"}]},{"id":1537,"name":"Adam's Venture: Origins","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4fb/4fb79be2a7df903504c20d9fe6f545d7.jpg","description":"Adam's Venture: Origins Special Edition DLCAdam’s Travel Journal, a special journal containing diary entries of Adam during his adventures. Featuring exclusive concept art for the game and a lot of new insights into the thoughts and feelings of Adam during his adventures.\n7 Postcards with Adam’s Venture: Origins Artwork\n1 Map showing a mysterious location near the four rivers mentioned in the book of Genesis\n1 Full colour poster\nAbout the GameEmbark on a bold adventure in Adam’s Venture: Origins. Set in the roaring 20’s, in Adam’s Venture: Origins you will explore ancient ruins, and recover mysterious artifacts. Together with your trusted accomplice Evelyn, you will have to outsmart the evil Clairvaux company.\nAdam’s Venture Origins is a reimagining of the Adam’s Venture franchise. Streamlined and replotted to forge an engaging narrative, Adam’s Venture: Origins reimagines the events of the first exploits of Adam Venture.\nAdam’s Venture: Origins features new, next-gen visuals, new gameplay and new animation work which makes it into a true next-gen experience.\nAdam’s Venture: Origins is the fulfillment of the original vision of Vertigo Games, as facilitated by SOEDESCO. Challenging puzzles, stunning visuals, engaging narrative and tight gameplay will make Adam’s Venture: Origins into an adventure game that is not to be missed.\nFeatures\nBrains over Brawn, Adam’s Venture: Origins focusses on clever puzzles.\nDelve into ancient mysteries and recover mysterious artifacts.\nTraverse long forgotten tombs and crumbling cities using the new grappling hook.\nRich and involving storyline that weaves a surprising adventure with historical overtones.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SOEDESCO Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":522978,"name":"Gods Will Fall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8d/d8db5c7fcdc4ec2e846d20673c10a08f.jpg","description":"The time draws near to end the Gods’ torturous rule over humanity that has lasted for millennia. A dark fantasy action game Gods Will Fall is coming soon.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Clever Beans","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":510148,"name":"Karaoke","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/409/4093b04d3d3dd32de9bb27d0d73befbe.jpg","description":"Bring the party to your house and sing to over 8,000 songs from the latest hits to the oldies but goodies!  Your avatar will go on stage and sing to your voice with a full complement of stage props and back band.  Songs don't require any download and will playback immediately via streaming for a robust karaoke experience.  Requires an Xbox 360 Headset, Xbox Wireless Microphone or Xbox 360 compatible USB microphone.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox 360"}]}]