[{"id":486727,"name":"Aragami 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d4/0d483b51813737f40163c501ed123cb5.jpg","description":"You are one of the last elite warriors of your kin, the Aragami. Victims of a supernatural affliction which corrodes the body and devours the mind, the Aragami control Shadow Essence - a mystical power which grants the ability to control the shadows. With this power the Aragami carry out their tasks and quests - assignments made all along the valley to ensure the subsistence of the village and to free the Aragami enslaved by the invader armies.\r\nPLAY IN SINGLE MODE OR IN CO-OP WITH YOUR FRIENDS\r\n\r\nDiscover a full campaign and join the assassin squad up to 3 players in co-op.\r\nENGAGE IN FAST-PACED STEALTH ACTIONS\r\n\r\nManage covers and powers with agility. Take down your enemies with stealth kills and non-lethal takedowns.\r\nENTER INTO COMBAT AS A TACTICAL DECISION\r\n\r\nBecome the master of a skill based combat with high risk and high reward.\r\nBUILD YOUR SHADOW ASSASSIN\r\n\r\nCraft your weapons and armors and upgrade your elite warrior with three skill trees of 42 abilities and shadow powers.\r\nPROTECT THE RASHOMON VALLEY\r\n\r\nSave your people and defeat the curse before it ends with you and discover how the Aragami became a legend.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Lince Works","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":53239,"name":"Disney's Aladdin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/983/9833303155b5f348a459500666f6edfc.jpg","description":"Disney's Aladdin is a side-scrolling platform game in which the player controls Aladdin throughout settings and a storyline based on the namesake film.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Disney Interactive","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Game Gear"},{"id":0,"name":"NES"},{"id":0,"name":"Game Boy"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42908,"name":"Aperture Tag: The Paint Gun Testing Initiative","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/178/178521cbadf375ad3f4ee0e32b6e809c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aperture Tag Team","platforms":[{"id":0,"name":"PC"}]},{"id":20332,"name":"Atonement: Scourge of Time","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1de/1deb3c6892f7aad40359073b8257d47c.jpg","description":"The last king was killed over 400 years ago and the global rule of the land ceased to exist. Slowly over the years the law and order started to subside, people began to divide amongst themselves, big cities were gradually gone and replaced with smaller settlements, and the whole land started to slowly degrade. Many believe it’s because the Angelkind have abandoned it.\nNow the bandits roam the roads and wild animals roam the fields. The only safety can be found in smaller villages, where groups of people have banded to work together in order to survive. The relations between the different sentient races are very marginal and fragile. Some have been at long conflicts with one another, at times erupting into full blown wars. A holy Order of Atonement has been trying to keep the people together, but even their influence is limited to a handful of villages. And to top it all off, many believe a “Vindicator” will walk the land one day as a punisher of all the sins and bring forth a swift end upon it.That Day Has Come. Features\nA large, decadent, dark fantasy world with a new take on concepts of angels and demons.\nTwo different protagonist teams, each one with its own point of view on the same story. Their paths repeatedly converge and diverge as they attempt to accomplish their own goals, occasionally antagonizing one another.\nUnconventional way of unlocking new skills: each character possesses all of their special abilities from the start. However, many are locked by high energy cost. Increase max Energy by any means necessary to get access to those skills.\nStrategically manage your energy in battles: use lots of low cost skills in a row, or use a high cost skill and wait for the overall energy to recharge.\nTwo difficulty modes: Normal and Challenging. Normal is streamlined so to allow most people to complete the game and witness the story. Challenging is for those seeking blood, sweat, sorrow, and death.\nTurn-based battles and a variety of boss fights which require strategy to be beaten, especially in Challenging mode.\nA variety of weapons, armour, and accessories, allowing customization of the equipment on playable characters to fit to your playstyle.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Astronomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":17952,"name":"Sigils of Elohim","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ac/5ace4a4f2cd475fa68f501b9f013fb32.jpg","description":"About The Talos Principlehttp://store.steampowered.com/app/257510/\nThe Talos Principle is a first-person puzzle game in the tradition of philosophical science fiction. Made by Croteam, the creators of Serious Sam, and written by Tom Jubert (FTL, The Swapper) and Jonas Kyratzes (The Sea Will Claim Everything).\nAs if awakening from a deep sleep, you find yourself in a strange, contradictory world of ancient ruins and advanced technology. Tasked by your creator with solving a series of increasingly complex puzzles, you must decide whether to have faith, or to ask the difficult questions: Who are you? What is your purpose And what are you going to do about it?\nFeatures:\nOvercome more than 120 immersive puzzles in a stunning world.\nDivert drones, disable turrets, and even replicate time to prove your worth - or to find a way out.\nExplore a story about humanity, technology, and civilization. Uncover clues, devise theories, and make up your own mind.\nChoose your own path through the game's non-linear world, solving puzzles your way.\nBut remember: choices have consequences, and somebody's always watching you.\nAbout the GameSigils of Elohim is a free mini-game prelude to Croteam’s upcoming first-person puzzler The Talos Principle that challenges players to solve dozens of formidable sigil puzzles under the watchful eye of Elohim. Subjects are tasked with deciphering a series of puzzle sets by rotating and placing the sigil shapes within the board in an effort to unlock helpful items and relics within The Talos Principle.Features\nUnravel the secrets of Elohim by completing nearly a hundred sigil puzzles as Sigils of Elohim is updated with new puzzle sets leading up to the launch of The Talos Principle.\nAcquire items and relics in Sigils of Elohim on PC, Mac, and Linux that transfer over to The Talos Principle on PlayStation 4, PC, Mac, Linux and Android.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":11502,"name":"Dragons and Titans","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/795/795582a0416b778509c3199f04f42efa.jpg","description":"Dragons and Titans is a fast paced MOBA with classic RPG elements, where your champions are Dragons and a variety of game modes gives you the power on how to play. Show true courage and skill to become the ultimate Dragon Lord as you embark on your quest to free your Titan from captivity.\nSelect from over 30 unique dragons and 30 legendary weapons, each with unique abilities and progression levels. Take your battle to the next level by upgrading your dragons as you gain experience and improving your weapons in the Forge. Free your Titan in fierce 5v5 PvP battles across 3 different map types or delve deeper into the story in ‘Adventure Mode’, traveling across different regions in the Lands Below, earning Dragons as you complete each set of missions. Gain favor with the Titans and climb the PvP leaderboards to prove your true worth as the ultimate Dragon Lord!\nBecome the Ultimate Dragon Lord - Master over 30 Dragons, each with unique abilities.  As you gain experience, level up your Dragons to dominate in combat!\nDiscover a Deeper Story– Explore the vast regions of The Lands Below, embark on quests and be handsomely rewarded with Dragons for your heroism.\nForge Your Weapons – collect elements during combat and upgrade weapons in the Forge to harness their true power!\nTake to the Skies Your Way - battle times of 10-15 minutes means you’ll be able to complete more matches across a variety of maps: traditional MOBA, Capture & Hold and ARAM. Choose your play style with 5v5 PvP, Co-Op or single player Adventure Mode!\nDominate the leaderboards – compete against other opponents each Season to see who the ultimate Dragon Lords are and show off with exclusive winner avatars.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wyrmbyte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9932,"name":"Soulblight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68e/68e3bca4e167bf4740447f914c3aa963.jpg","description":"On the face of this wretched world there is a gaping wound. The Sanctuary, once glorious, now forsaken, hides secrets of forgotten machinery. Magical matter is born there when space­time ripples and loses its meaning... and at the heart of it all is an anomaly. A tree shrouded in a mystical liquid, luring those brave enough with its promises of greatness. Do you dare seek its power? Do you wish to drink from the Soulblight?GameplaySoulblight is a dark, top­down roguelike built around the literal meaning of RPG. Instead of XP grinding, it introduces a unique Taint System. While traveling through the shattered reality of the Sanctuary, you will receive personality traits based on your choices. These will be the main source of your strength. To harness them, you will have to act accordingly. Becoming an alcoholic means that you will be rewarded for getting drunk, but from that point being sober might prove to be unbearable.Features A unique Taint System designed to encourage role playing\nTons of weapons, armor, and utility items\nDynamic and tactical combat build around stamina management and distance control\nOptional stealth approach that complements fighting\nRandomly generated, visually breathtaking levels\nHigh difficulty level emphasized by permadeath mechanics\nGameplay­-driven narrative","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"My Next Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":7229,"name":"In Between","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/807/807647be8affedc6fb504696f7532a2d.jpg","description":"In Between is a first person story adventure game about a lonely man and his near death experience. It has a rich story and rewards investigation and exploration.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":607,"name":"Shantae: Half-Genie Hero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ed/8ed64beba17e3f3580ccc025f7bfde12.jpg","description":"Shantae embarks on her first full HD adventure! When a mysterious crime wave sweeps Sequin Land, it’s up to Half-Genie Hero Shantae to save the day! Use Shantae’s devastating Hair-Whip Attack to send monsters flying, or Belly Dance to transform into a more powerful creature form! Topple the masterminds behind each criminal caper and prepare for the ultimate showdown against Shantae’s arch nemesis - the bodacious buccaneer Risky Boots!\nKey Features:\n• Shantae’s trademark moves return! Dance to transform into all-new and classic creatures, or summon magical attacks! Over a dozen dances to discover in all!\n• New Relic System allows players to unlock new powers and customize moves for Shantae and her many forms!\n• Conquer arcade-style action stages that unfold into a full world to explore. Fast action and quest-style exploration rolled into one!\n• When Shantae’s story ends, you’re just getting started! DLC Modes introduce new characters, levels, and bosses!\n• Huge Bosses, humorous dialogue, and the wonderfully weird Shantae cast return, now in fully animated HD!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"}]},{"id":59184,"name":"Kingdom Hearts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc3/bc3c433821089108642a41a3057f92c5.jpg","description":"Kingdom Hearts is the story of Sora, a 14-year-old boy whose world is shattered when a violent storm hits his island-paradise home, and is separated from his two closest friends, Riku, a 15-year-old boy, and Kairi, a 14-year-old girl. The storm scatters the three to differnt and unknown worlds. At the same time, there's turmoil in Disney Castle. King Mickey is missing, and Court Wizard Donald and Captain Goofy set out to find him. On their travels they meet Sora on his own search for his lost friends. The three are told of ominous creatures known as the Heartless - beings without hearts derived from an unknown dimension and as it turns out, manipulated by Disney villains and the ones responsible for the devastating storm. Upon discovering the link between the Heartless, the storm and the disappearance of King Mickey, Sora, Donald and Goofy join forces and help familiar Disney heroes to save their worlds.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Square","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":17257,"name":"Tonight We Riot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e6/8e6bb00b4da4c0bd78dfdaf04573a5cf.jpg","description":"Jump into the boots of one of many working class heroes as players direct a growing horde as you fight, smash and brawl your way through the Streets of Change using whatever you can as a weapon. Namely bricks, molotov cocktails and whatever else you can get your hands on. Obtain the trust and loyalty of your fellow workers and liberate them from tyranny. Once you gain the power of the many, cooperate to retaliate against the city’s authoritarian regime and regain control over your life and liberty. Tonight We Riot!\nFeatures:\nWorkers of the World Unite! Harness the power of the oppressed as each worker you liberate adds to your chances of overcoming overwhelming odds to take the power back for the working class.\nWe're All Leaders, Here! The revolution will be televised for you and a friend in both local and online co-op campaign plus endless arcade action.\nRevolutionary Soundtrack! An all original Synthwave soundtrack from Sixixix will drive you forward and drive your enemies into the ground.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Pixel Pushers Union 512","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15381,"name":"Pox Nora","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03e/03eb02fde55e833f3220af7d33be589e.jpg","description":"Planar Disturbances Midterm Released\nThe Planar Disturbances Midterm is now available! For more information, please check out the Steam announcement.\nAbout the GamePox Nora is an online, collectible, turn-based strategy game. Players can take their deck of Runes (cards) and go on an adventure in the many single player campaigns, skirmish against the AI, or battle against other players in player vs player matches. Public decks are available to unlock with gold or by playing the faction walkthrough campaigns. If you like Pox Nora, you can expand your deck options by purchasing additional rune packs that will give you access to more Champions, Spells, Relics and Equipment.\nKey FeaturesCompletely free to play with additional content available for purchase\nWage war against opponents through exciting player vs. player gameplay\nAdventure with iconic characters in single player story campaigns\nPlay the game with Public Decks you can unlock with gold and by playing the game\nBuild decks from 8 unique factions through full or split faction play\nBuild your collection of runes over time and customize your decks with the Rune Manager\nTrade runes with the community or build them with the Rune Forge\nJoin in draft tournaments to win prizes\nSave up and spend virtual gold that you earn by playing the game to get additional characters and more in the Marketplace\nTo find out more visit the Pox Nora website http://www.poxnora.com/info/features.do","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desert Owl Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":10107,"name":"Shadowrun Chronicles - Boston Lockdown","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3c/f3c061ccaba130a85df47d59d0ca4e2e.jpg","description":"Deluxe Edition  Includes the INFECTED Add-On campaign!\nAn additional character slot\nA useful extra set of items from grenades to DocWagon cards, consumables and armor and  zero Essence cybeware to get you an edge on the street! (see below for full list)\nThree pets for use in the hub (they are very tame, so they won't follow you into missions) and exclusive clothing items from skull bandanas to stained Soykaf Shirts for the true Runner look!\nListen to the music inspired by Shadowrun Chronicles on the bonus soundtrack!\nDid you always want to try the Shadowrun Tabletop game? The Quick Start Rules give you an introduction to the world and the ruleset of the game. Gather your friends around the table and slip into the Shadows with them!\nThe Boston Adventures bring the Boston Lockdown scenario to your Shadowrun Tabletop group! Get intel on the Boston setting and play a run inspired by the Shadowrun Chronicles: Boston Lockdown Campaign!\nDeluxe RPG Edition A whopping 240+ pages of roleplaying goodness with the Pen and Paper RPG Campaign Book Boston Lockdown as a pdf! Heaps of background intel, stories and adventures. Run your Boston Shadowrun campaign or just find out much more about the background of our game and the tragedy and machinations of the Boston Lockdown.\nThe complete 480 pages strong official Shadowrun 5th edition rulebook as a pdf\nPLUS ALL THE DELUXE GOODNESS:\nThe INFECTED! Add On Missions\nAn additional character slot\nA useful extra set of items from grenades to DocWagon cards, consumables and armor as well as zero Essence cybeware to get you an edge on the street!\nThree pets for use in the hub (they are very tame, so they won't follow you into missions) and exclusive clothing items from skull bandanas to stained Soykaf Shirts for the true Runner look!\nListen to the music inspired by Shadowrun Chronicles on the bonus soundtrack!\nDid you always want to try the Shadowrun Tabletop game? The Quick Start Rules give you an introduction to the world and the ruleset of the game. Gather your friends around the table and slip into the Shadows with them!\nThe Boston Adventures bring the Boston Lockdown scenario to your Shadowrun Tabletop group! Get intel on the Boston setting and play a run inspired by the Shadowrun Chronicles: Boston Lockdown Campaign!\nUpdate NotesNEW BALANCING PATCHWe have released a new balancing patch, making all races and backgrounds more viable (we hope). This has been months in the making and we worked together with a dedicated team of community members who gave us feedback and suggestions. This was also done in our free time and weekends and without any financial gain by a small number of team members as a labor of love, so please excuse any haphazard changes, spelling mistakes or oversights.\nThe main thrust of the patch is offer more alternatives to certain dominant combos of race,background, skill and items ('crit-pistols' spring to mind). Also, you can now see your chosen background during game and change it ONCE for pre-existing characters.\nWe hope you enjoy the changes and thank you for support of the game!\nAbout the GameLead your team of Runners to survive a corrupt megacorporation’s intrigue threatening thousands of lives in this new action-strategy game set in the most popular cyberpunk universe of all times – Shadowrun. Blending X-Com style gameplay with RPG elements in the unique Shadowrun setting and adding an extensive single- and co-op campaign, Shadowrun Chronicles offers the next generation of tactical turn based action games.\nEntrapped in a city plagued by a deadly virus, assaulted by the minions of a megacorporation, attacked by infected and with a dragon on a rampage through the city you have to unearth the secret conspiracy that connects it all.\nAs the leader of your team of Shadowrunners, you will have to use magic, technology and every weapon available to you, to save the lives of thousands in a city at the brink of extinction. Grow you character, plan your missions and control your team in combat or play live co-op with other players to overcome the challenges ahead of you. Meet your fellow runners in the Back Alley or hire henchmen to help you succeed.\nSet in the dystopian near future of our world, where magic has awakened and blends with technology, creatures of myth and legend have returned. Elves, Dwarves, Orks and Trolls walk among the neon-lit streets, while the matrix connects everyone and everything as the corporate towers cast their long shadows across the globe. You are a Shadowrunner - a secret operative on the edge of society, hired for the jobs no one wants to be connected with. A cyberpunk rebel surviving by skill and instinct in the shadows of the corporate towers!\nWelcome to the dark side of the future, chummer. It’s going to be a hell of a ride.\nFeaturingWord of warning: The game is tough - it's designed that way. Running the shadows is never easy and going in guns blazing will certainly get you in trouble!\nRun and Gun! Gripping and deadly tactical turn-based combat in true Shadowrun style: Choose from a wide array of skills groups, magic, technology and weapons to survive!\nTeamwork! Build up your team of runners or join with other players in live co-op to find the best combination of skill, magic and technology for survival.\nYou'll never run alone!  Team up with friends for your next run or swap stories with other runners in the hangout. Take other player's characters with you into a mission as henchmen\nEvery move counts! Dive behind cover, find alternate routes with clever use of your skills, send your drones or spirits into battle and use any weapon at your disposal to make it out alive.\nBe who YOU want to be! Create your individual Shadowrunner in a completely level-free character system from over 60 different combat and non-combat skills, unique backgrounds and five metahuman races. Start a muscle-packed former Troll bouncer and become an expert Rigger, sending your drones into combat or complement your spell slinging mage with the abilities of a skillful sniper. The choice is yours!\nGear up! Employ a variety of armor, augmentations, cyberware, magic and of course tons of weapons! Lob a grenade at your enemies, blast them with a mana ball or pass them unnoticed by hacking their security systems. Over 50 different enemies from vicious gangers to combat drones and corporate wagemages await!\nShape the future! Developed jointly with the tabletop RPG books your actions in the game will shape the future of the whole Shadowrun universe!\nRequires internet connection to play!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cliffhanger Productions","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":46602,"name":"Avernum 3: Ruined World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/865/865dd3a4dcf6fc223900a49a0f0f4c35.jpg","description":"The conclusion to our hit indie fantasy trilogy! Avernum 3: Ruined World is an epic, indie fantasy role-playing adventure with many hours of gameplay. Explore an enormous world that evolves as time passes. Towns are destroyed. Refugees flee. Disasters happen.\nYour people long to escape from their underworld prison, but the surface world is being destroyed. Fight plagues of bizarre monsters and win your freedom. Enjoy an intricate tactical battle system with multitudes of abilities, character traits, and unique magical artifacts.Avernum 3: Ruined World features:\nEpic fantasy adventure with over 60 hours of gameplay. Explore an enormous underworld and a huge surface continent.\nRich game system with over 60 spells and battle disciplines and a multitude of beneficial character traits to choose from.\nWell over 100 towns and dungeons, which change as time passes. Cities crumble as the monster plagues advance.\nFight to save the world. Or don’t! Do odd jobs. Be a bounty hunter or merchant. Buy a house.\nUnique races and settings make Avernum different from any adventure out there.\nOver 100 side quests and hundreds of magical artifacts.\nThe story of Avernum 3 is self-contained, and previous experience with Avernum games isn't required.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":22852,"name":"Runaway 2: The Dream of the Turtle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbe/dbef7fd015474ff726cd62974ec33ef9.jpeg","description":"Travel to the four corners of the world with Brian and Gina in a crazy story packed full of surprises. Pirates, spies, surfers, soldiers, and even aliens get in on the act - all combining to create a wonderfully rewarding experience to savour and remember forever!\nWith loveable characters, rib-cracking humour, brain-tickling puzzles and stunning graphics, Runaway, The Dream of the Turtle is a glorious sight to behold.\nRunaway, The Dream of the Turtle is an adventure game that is a pure pleasure to play.\nA beautifully produced adventure game, with rich scenarios, ever-present humour and captivating puzzles.\nHundreds of places to explore throughout the world.\nOver an hour of superb animated sequences bring to life the intrigue, plot twists and many comic moments.\nHigh quality sound featuring cinema quality dubbing, as well an original and hugely inspirational soundtrack with both vocal and instrumental tracks.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Pendulo Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":9529,"name":"Boundless","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ae/6ae8064d049b26c5d2cdd8c0522a0ffb.jpg","description":"In a vast universe of connected worlds, the choice is yours.\nExplorer? Builder? Hunter? Trader? Fighter? Discover your place in the massive open-universe sandbox of Boundless. Watch the sunrise on one world before hunting down rare creatures on another. Explore dark caverns alone or build an empire with friends. Mine, trade or battle for resources. Can you unearth the elusive Oort technologies?\nWill you build a shop, sell your treasures, craft amazing contraptions? Do you yearn to join the hunt for Titans, claim your land or seek new worlds? Open a Portal and expand your reach across the universe as you shape your citizen, define your role, and become Boundless.\nJoin the Great Transmigration and explore the Known Worlds of Boundless. Each world is full of unique inhabitants and resources, ripe for discovery. With your trusty Totem in hand and the ability to build Warp Conduits, you  can pinpoint locations on other worlds and travel seamlessly between them. No waiting. No loading.\nDiscover and use materials to build your base. Craft Beacons and claim land as your own, protecting all your beloved items within it bounds from other Players and from sacrifice to the land. Use special tools to tweak and transform blocks into ever more interesting and unique structures. Your imagination is Boundless.\nMaster the art of crafting! Create weapons, tools, building materials, and a whole host of other technologies waiting to be discovered in the Known Worlds. Use advanced Crafting Machines to build ever more sophisticated items and further your potential. Forge your legacy.\nHunt down creatures of all shapes and sizes scattered throughout the Known Worlds. Each world has it’s own unique breed of creatures to discover, each requiring different strategies to best. Get ready to take on the challenge.\nEverything bought and sold in Boundless is generated by you the players. Buy and sell items through player owned shops, compete with others to become the most successful trader in the universe.\nBoundless is a sandbox MMORPG that encourages player collaboration. Find friends or players from all over the world. Explore, defeat dangerous creatures, gather rare resources and build a colony together.\nOther Features\nLearn the basics! Carefully crafted tutorials help you to understand the core elements of the game.\nComplete Objectives, Feats and events to earn Coin and Experience Points to level up your character\nSpend your hard earned skill points in the Skill Tree and tailor your character to how you want to play the game\nCraft thousands of items including, building blocks, tools, weapons, food and many more\nColonise planets by yourself or join a settlement with others and grow your beacon into the capital of the world with the Prestige system\nBuild and maintain a Portal between two worlds for you and others to use\nTrade items with others or set up a shop to sell and buy items while you’re off adventuring\nEach world automatically regenerates areas that are not protected by a Beacon and returns it to its original layout, creating new and much needed resources for you to collect\nSeamlessly travel to new worlds and discover different creatures, resources, block colours and user generated creations in an ever-changing universe\nNo Subscription Required\nPurchase the game and enjoy your Boundless journey with NO MONTHLY FEE!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wonderstruck","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":24072,"name":"The Legend of Zelda","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f87/f87de0e93f02007fd044e4bf04d453d8.jpg","description":"Ganon, the King of Evil, has broken free of the Dark World and has captured Hyrule's beloved Princess Zelda. But, before she was caught, Zelda managed to shatter the Triforce of Wisdom and scatter its eight pieces throughout Hyrule. You begin your adventure by finding a small wooden sword in a dark cave. Then, as you grow in stature, experience, and strength, so do your weapons. Help Link collect the captured pieces of the Triforce, rescue the princess, and thwart Ganon’s evil plans!\r\n\r\nThe epic series The Legend of Zelda began here, with the heroic Link on a hazardous journey through the fantastic world of Hyrule. Using your sword, your shield and your wits, retrieve the eight fragments of the Triforce and save Princess Zelda.\r\n\r\nThis groundbreaking game introduced innovative ideas that are still present in Zelda games more than 25 years later. Not only is Link's original adventure action-packed, it also features puzzling dungeons to explore and a myriad of secrets to discover.","review":"","timePlayed":0.0,"releaseYear":1986,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"NES"}]},{"id":22014,"name":"Outcast - Second Contact","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3b/a3b5df81e32aa6c5e4117eb7a7d4ca24.jpg","description":"Take the role Cutter Slade, a tried and tested elite soldier, and explore the planet Adelpha with complete freedom. As you journey in this magnificent world, where magic and science mix, discover exotic cities, face fierce enemies and attempt to learn the secrets of an advanced civilization. Make the correct choices in this systemic, living world, because the destiny of these two universes depends on your success.\nThrough hundreds of quests, the vast open world of Outcast – Second Contact offers epic-scale adventure.\nStart your adventure in complete freedom in this vast open world.\nProgress at your own pace through different quests available at any time.\nFace the Talans head-on in daring combat or play the infiltration card.\nMaster an arsenal of evolving weapons and high-tech gadgets, adapt your strategy to fit your situation.\nChange the balance of the forces on Adelpha. Outcast – Second Contact takes place on a living world where your actions have direct and visible consequences on the ecosystem.\nTake off on a fantastic voyage to Adelpha, a bewitching world populated by extraordinary creatures and the home planet of the Talans, an advanced alien civilization.\nExplore 6 different continents on foot or on the shoulders of a Twôn-Ha, and penetrate into wild lands unknown to humans.\nAs you initiate yourself into the culture of an alien civilization, you are brought into the heart of Talan society: negotiate with the merchants of Riss, parley with rebel forces or follow the mystic path of the grand Shamaz.\nEach encounter, each event is an invitation to adventure in this thrilling world.\nIn the near future, humanity has discovered that it is not alone in the universe – or rather universes. Alas, the first contact with intelligent beings turns disastrous when a probe sent by the US government is destroyed by the natives of a world called Adelpha. The incident creates an energy cataclysm which threatens to destroy the Earth. You are Cutter Slade, a Navy SEAL sent on a mission to Adelpha to find and repair the probe, in order to prevent this catastrophe. Welcomed by natives as the “Ulukai” – a messiah of an ancient prophecy – you will discover that the futures of Adelpha and the Earth are now linked.\nMore than 50 hours of adventure within a dynamic and fast-paced story.\nConfront bloodthirsty tyrants and deliver freedom to a people under the yoke of oppression.\nTake the role of Cutter Slade, a charismatic and bluntly spoken hero.\nOutcast – Second Contact is the complete remake of the cult title Outcast. As the first 3D open world in the history of video games and pioneer in the modern action-adventure genre, the 1999 release won over 100 awards including adventure game of the year.\nThe Outcast universe completely redone with modern graphics.\nCombat even more dynamic with new moves: dodges, rolls, sprint and cover system.\nNew hidden areas divulging some of the most hotly debated mysteries of Adelpha by the fans of the original game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Appeal","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19708,"name":"Catch a Falling Star","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b3/2b3c175f0fae27ea3ef269d871f3f444.jpg","description":"Catch a Falling Star is a casual and relaxing game where the aim is to catch falling stars and score points. A fun and relaxing game with beautiful graphics and soothing music - perfect for when you want to play something, but don't want to think too much.\nFeatures\n3 Beautifull themes each with their own music\n22 Extra baskets to unlock and catch stars in style\nCatch falling stars to score points\nYour basket fills up as you catch stars, but only once you deposit on either side of the screen, you score the points\nAvoid falling ice, which slows you down and take up valuable space in your basket\nWind blows from either side, pushing objects in that direction\nVarious power-ups, like a speed boost, extra life, no wind, etc.\nAvoid hazards like lose a life, slow basket, fast stars, more ice, etc.\nCatch star coins, with which you can unlock more basket space, additional baskets (more than 20 designs), more themes, or one-use power-ups for while you play\nSubmit your score to our online leader boards\nController support\nSo, if you are looking to sit back and relax, why not catch some stars!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Back To Basics Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":18740,"name":"AquaNox 2: Revelation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07a/07a46c18f9f38e6786d993d9f91ca01c.jpg","description":"AQUANOX 2: REVELATION is a new story of the underwater world Aqua. In 2666 a young freighter pilot called William Drake sets out to search for the heritage of a mythical ancestor. He is looking for adventure - and finds greed, ruthlessness, merciless hatred … and also unexpected help. But very soon he has to realize that he is not the only one hunting for his ancestor's legendary treasure.\nAQUANOX 2: REVELATION chases the player through high-energy action and sinister underwater cities. A gripping story, striking characters and the overwhelming architecture of the underwater world are framed by an ingenious user interface. Bonus objectives as well as hidden bonus weaponry guarantee each missions' replayability. Tactics and patience complement the fast-paced dogfights. The player becomes a member of a group of eight mercenaries crossing the oceans. The crew is crammed together in the claustrophobic atmosphere of a freighter: Always on the lookout for loot and the legendary treasure… and always afraid they themselves might become the victims of their unknown enemies.Key features:Mission based action underwater roadmovie with stunning and violent individual and teambased combat\nSuperbly crafts 3D graphics in a real-time, richly rendered underwater world using the \"krass\" - engine\nAtmospheric 3D soundtrack and music","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":4859,"name":"Ys: The Oath in Felghana","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17d/17d956d6b091df7981be0eebf1743000.jpg","description":"When redheaded thrill-seeker Adol Christin and his eternal blue-haired companion Dogi make an unannounced visit to Dogi's homeland of Felghana after an eight-year absence, it quickly becomes apparent that things have changed dramatically. Hordes of violent monsters roam the outskirts of town, a long-dormant volcano has suddenly sprung back to life and the new lord of the land has begun mercilessly and inexplicably extorting money from its long-suffering citizens. While Dogi seeks out his former combat master for answers, Adol tends to the townsfolk -- and finds himself embroiled in a world of political conspiracies, ancient legacies and unthinkable taboos.\nA complete 3D reimagining of the 16-bit console classic \"Ys III: Wanderers From Ys,\" Ys: The Oath in Felghana is a fast-paced action role-playing game with tight controls, Metroidvania-style exploration elements, intense combat with epic screen-filling boss battles, and a thrashing, percussive arranged soundtrack that's been heralded by many as one of the best of all time. Based on the original 2005 PC release, this classic is finally officially available in English with added Steamworks features such as achievements and cloud saving.\nCome see why Falcom fans the world over regard this game as \"Ys, Perfected\"!Key Features:Six difficulty levels ranging from \"Very Easy\" for casual players to \"Inferno\" for true old-school gaming masters.\nUnlockable \"Time Attack\" and \"Boss Rush\" modes for anyone looking to show off his/her boss-taming abilities.\nOver 30 unique Steam Achievements as well as Steam Cloud support.\nAdjustable high-resolution PC graphics with original blood effects intact.\nGamepad support in addition to standard keyboard and mouse controls.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"XSEED Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":51573,"name":"SWORD ART ONLINE: Fatal Bullet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d40/d40bfc75426facb0176e8d610fc831a4.jpg","description":"Digital Deluxe Edition\nSWORD ART ONLINE: FATAL BULLET Deluxe Edition contains the full version of SWORD ART ONLINE: FATAL BULLET and the season pass\nExperience an original story where you are the protagonist in the world of Gun Gale Online. Create your own avatar and explore devasted lands while experiencing exciting third person shooting in this action RPG.\nJourney through a world of guns where after a chance encounter you’ll gain the help of a very rare AI, ArFA-Sys.\nAlong the way, you will have to make choices.\nBut every choice comes with a price…\nThis is your adventure… This is your story…\nAbout the GameYour fate has just begun…\nExperience an original story where you are the protagonist in the world of Gun Gale Online. Create your own avatar and explore devastated lands while experiencing exciting third person shooting in this action RPG. Encounter enemies and run into new and familiar faces from the Sword Art Online series.\nJourney through a world of guns where after a chance encounter you’ll gain the help of a very rare AI, ArFA-Sys.\nAlong the way, you will have to make choices.\nBut every choice comes with a price…\nWill you bring hope or despair?\nThis is your adventure… This is your story…","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":19521,"name":"AirBuccaneers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b3/5b38bdaabdf91d3cd926fb73d39ef1cd.jpg","description":"Welcome to the ancient North, once the cradle of culture and peace, but is now corrupted by magic and inhabited by nasty bandits sowing destruction in airships.\nChoose to be a vicious Buccaneer or an infamous Viking and take a glider to the skies. Your goal is to drop enemy vessels and secure dominance of the ancient North. Fire cannons, help others, board enemy ships or be the captain – whatever it takes to get your enemies out of the way. The success, as well as the bitter defeat, is solely dependent on how well you co-operate with your crew mates.\nFinding the right kind of battle strategy is not self-evident in the merciless winds and twisted magic of the North...Key Features\tMultiplayer FPS for fans of co-op action\nIntense air battles: airship armadas fighting in berserk frenzy\nHeavy emphasis on teamwork. Solo players, time to team up!\nBoard enemy ships and take them over!\nFour different types of ships: Battleship, Flying Fortress, Cog and Kamikaze\nSelection of weapons: cannons, rockets, gunpowder grenades, blockers, swords\nPersistent character development. Begin as a lousy low-life and rise in the ranks to immortal glory\nFour specialization classes: Captain, Defender, Guerrilla and Cannoneer\nUse Perks & Flaws system to build a character that always fits your playstyle\nFind out what really happened in the darkness of the past!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"LudoCraft","platforms":[{"id":0,"name":"PC"}]},{"id":16850,"name":"Krater","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d3/5d34ddacd89cffcf9c3c092df1f85e9c.jpg","description":"Krater is real-time squad based dungeon crawling adventure. The game combines fast paced combat, tactical squad management, crafting, and questing all seen from a classic RTS perspective.\nWhile the game’s campaign can be played offline, there are also hours of specifically designed co-op missions to tackle with friends online.\nSince release, there have been tweaks/improvements to just about everything else, from game balance to improved loot/item generation to a reworked HUD and smoother graphical performance.\nThe game universe brings you far into the future of a post-apocalyptic Sweden. Once home to IKEA, Vikings, and Minecraft, today its primitive inhabitants scavenge the broken overgrown world for technological artifacts.\nAt the rim of an impact site known as the Krater, three factions vie for control over the wound opening up into the world below. Consisting of an endless series of caves and tunnels filled with old world treasures and perils, the Underside stretches into the depths of the fallen Swedish civilization. You arrive at the Krater with your team of freelancers to take part in the gold rush where people come back rich or don’t come back at all.Key Features:Co-Op Adventure - Loot together through hours of specially designed co-op missions. Conquer tough co-op bosses together and bring your spoils back to the main campaign.\nUnlimited Exploration - No matter how deep you crawl, there is always more to explore in Krater’s open world.  Packed full of randomized dungeons and events, more than 60 handcrafted original locations, and 200+ quests.  Locations range from small settlements to large urban areas like Solside City, a sprawling regional hub where you’ll find all sorts of NPCs and services.\nAchievements - Earn over 40 achievements online or offline.\nUniquely Persistent Characters - Watch your team of odd personalities evolve as they level up and gain new abilities, equipment, better stats, and even incur injuries.\nFace the Consequences - Your characters must cope with the dangers of Krater - if not they will face the threat of gameplay affecting permanent injuries or even death!\nCraft Everything - From items and weapons, to gear and abilities, you can craft it all with an extensive crafting system.\nUnique Graphical Style - Krater makes great use of the new Bitsquid engine, which sports pleasing DX11 graphical features and lighting effects to create a one of a kind universe full of sun soaked towns & amazing environments, colourful effects, and complicated characters.\nNo mandatory connection to an online service - For those who would rather stay clear of online gaming services and login screens, Krater provides the entire Single-Player campaign in ‘offline’ mode.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":79210,"name":"Mindustry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57b/57bf269a152051e20b7e988b5480e73d_HVza9eA.jpg","description":"Gameplay\nCreate drills and conveyors to move resources into your Core.\nUse production blocks to create advanced materials.\nBuild drones for automatically mining resources, assisting in building and protecting your base.\nDistribute liquids and fight outbreaks of fire.\nBoost production by supplying optional coolant and lubricant to your defense and production blocks.Campaign\nAdvance through 12 replayable built-in zones with randomized spawn points\nCollect and launch resources\nResearch new blocks to fuel progress\nConfigure launch loadouts to bring resources to each zone\nVariety of mission objectives and goals\nInvite your friends to complete missions together\n120+ technology blocks to master\n19 different types of drones, mechs and shipsGamemodes\nSurvival: Build turrets to defend from enemies in tower-defense based gameplay. Survive as long as possible, optionally launching your core to use your collected resources for research. Prepare your base for intermittent attacks from airborne bosses.\nAttack: Build factories for units to destroy the enemy cores, while simultaneously defending your base from waves of enemy units. Create a variety of different types of support and offensive unit to assist you in your goals.\nPvP: Compete with other players on up to 4 different teams to destroy each other's cores. Create units, or attack other bases directly with your mechs.\nSandbox: Play around with infinite resources and no enemy threat. Use sandbox-specific item and liquid source blocks to test out designs, and spawn in enemies on request.Custom Games & Cross-Platform Multiplayer\n12 built in maps for custom games, in addition to campaign\nPlay Co-op, PvP or sandbox\nJoin a public dedicated server, or invite friends to your own private session\nCustomizable game rules: Change block costs, enemy stats, starting items, wave timing and more\nMix&match gamemodes: Combine PvP and PvE gamemodes togetherCustom Map Editor\nPaint terrain with an editor UI\nEdit and preview structures in-game\nConfigurable tool modes-- change how each tool functions\nPowerful map generation system, with many different types of filters for procedural manipulation of terrain\nApply noise, distortion, smoothing, erosion, symmetry, ore generation and random terrain to your maps\nRandomize and configure ore generation, as well as placement of river and resource tiles\nConfigure enemy wave layouts\nShare exported maps on the Steam Workshop\nCustomize base map rules\nUse 75+ different environmental blocks","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Anton Kramskoi","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":20333,"name":"City of Chains","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51c/51c01e04f4ada07e70e64cc9ed27238a.jpg","description":"Holt Allaway is a skilled engineer, specialising in the construction and programming of robots. When the government approached him to sign up for a military programme to create battle machines, Holt declined, not wishing to create weapons of war. He expected this wouldn’t go down well, and he was right. Shortly after, the officials fabricated a story that he was conspiring with underground movements against the government and convicted him of a crime he did not commit.\nUpon being arrested, Holt is taken to a temporary holding facility where all arrested criminals are brought for an interrogation, as well as a verdict that decides their fate. Some are executed, and their organs are harvested and sold. The others are taken to high-security prisons and used as labourers or test subjects.\nShortly after an interrogation, the holding facility is attacked by corrupted machines, and chaos ensues. A scout bot that’s remotely controlled by a mysterious individual calling himself Cai sets Holt free and instructs him to escape. Holt joins forces with a smart scientist Chloe and an assassin Lorelei, both of whom were also imprisoned. Following Cai’s lead, they flee the facility.\nHowever, their ordeal has only started. With no allies, few resources, and government police on their heels, they must find any means to survive and escape this condemned city - a City of Chains.\nGENERAL FEATURES:A dark sci-fi set in a large, dystopian city.\n4 leading protagonists, each with their own skillset.\nNo levelling up or experience points. Acquire skill points by making progress and use these to learn new skills and passive bonuses for each character.\nEnemies can be approached with direct combat, taken out with a grenade, or bypassed altogether.\nNon-linear and semi-linear locations. Use hacking, lockpicking, charisma, and wall smashing to find alternate routes to your goals.\nChoice and consequence – your decisions will have impact on the world around you.\nGrenade crafting and Medicine making. Use ingredients to create various grenades and medicinal pills.\nWatch morale of your teammates! Morale makes your allies more efficient in battle and out of battle.\n3 difficulty modes – Casual, Hardy, and Dystopia.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Astronomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":19732,"name":"Carpe Diem","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc9/fc9cbea19471be52b9e8e817f4daa7de.jpg","description":"SynopsisWhat makes someone perfect?\nExperience this short bittersweet story in the shoes of the main character, Jung, where you will spend your time hanging out with a girl named Ai. Ai is everything Jung wishes for in a woman... except for one very important thing. A thing he prefers to disregard in order for them to have the best time of their lives.\nYou have a day to enjoy your date and see the world from Jung's point-of-view.BackgroundThis is a free short visual (kinetic) novel made to show the importance of setting the right priorities in life. This is intended to be a single playthrough kind of novel. The choices all lead to the same ending, just taking different routes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Eyzi","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9441,"name":"Space Hulk: Deathwing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1d/d1df0b32dbb4135279f40715c0a46055.jpg","description":"Space Hulk: Deathwing is a First-Person Shooter experience based on Games Workshop's classic Space Hulk boardgame set in the universe of Warhammer 40,000. Space Hulk: Deathwing was developed on Unreal Engine 4, and offers you and up to three of your friends the chance to experience a desperate battle against Genestealers in the claustrophobic tunnels of a Space Hulk. You also gain skills, new abilities, and new equipment as  you earn experience during missions.\nSpace Hulks drift along the currents of the Warp, the immaterial dimension of Chaos. Made up of gigantic, mangled asteroids, ship wrecks, and other stellar debris, they can grow to the size of a moon, and often contain treasured and ancient lost technologies. They are often also infested with broods of the lethal Genestealer.\nIn the game you take on the role of a Space Marine from one of the most secret and most feared Space Marine forces: the Deathwing of the Dark Angels Chapter.\nAs a Librarian, you can also master the destructive powers of the Psykers. Your skills and performance in battle grant you Fervor Points to spend on 3 skill trees, allowing you to improve your abilities and unlock new powers.\nDon your Terminator armour and arm yourself   with the iconic weaponry of the Space Marines and face the threats that await you in the Space Hulk.Key FeaturesTake on the role of a Space Marine Terminator from the most secret and feared Deathwing.\nPlunge into the claustrophobic tunnels of a Space Hulk. and experience a desperate battle against the Genestealers.\nUnlock new abilities through 3 skill trees.\nGrow in power and weild devastating weapons.\nCoop mode: play with your friends as a Terminator squad in an epic coop mode","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Streum On Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":5644,"name":"Rock Band","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/42f/42f453581ca2c932505888a67e1280b4.jpg","description":"Rock Band™ is a unique platform that allows you to interact with your favorite music like never before! Create your own band in order to seek fame, fortune and rock stardom on a world-wide tour while learning to master guitar, bass, drums and vocals. Rock Band™ includes original master recordings spanning multiple rock genres from the greatest songs and artists of all time.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":319138,"name":"Castlevania Anniversary Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d56/d56412cd670313ef306da64669c381d8.jpg","description":"Konami's Castlevania Anniversary Collection traces the origins of the historic vampire franchise.  Included is a unique eBook with details provided by developers, artists and others inspired by the Castlevania legacy  which sheds a fresh light into the world of Castlevania.\nReleased as part of the Konami 50th Anniversary celebration,  relive these timeless classics that helped define the platformer genre.  From the Belmont clan to their extended bloodlines and allies, the Castlevania Anniversary Collection is the best first step for anyone to take into the world of Castlevania and the fight against Dracula!\nCastlevania\nCastlevania II Simon's Quest\nCastlevania III Dracula's Curse\nSuper Castlevania IV\nCastlevania The Adventure\nCastlevania II Belmont's Revenge\nCastlevania Bloodlines\nKid Dracula (never released in English before)\nHistory of Castlevania - Book of the Crescent Moon","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":61773,"name":"SC: Survivors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/080/080f96fddbaf9760c348796232dd70f3.jpg","description":"DESCRIPTIONSolstice Chronicles: Survivors is a multiplayer top-down shooter with a tactical edge. Set in the year 117 AE (After Earth), you find yourself behind enemy lines in the midst of an infected colony on Mars.STORYSolstice Chronicles: Survivors storyline is set during the Tharsis outbreak of STROL virus. You are one of the Howell-Barrex corporation marines tasked with containing the STROL threat in cooperation with Elysium Corp. military.FEATURESOnline CO-OP for up to 6 players - Work with other players to experience unique CO-OP gameplay. Be a hero, be a leader.\nSurvive and Control - Manage your resources, explore an open map and secure areas in order to survive.\nReplayability - Randomly generated special locations, missions, monsters and events.\nUpgrade Your Character - Unlock, equip and level up your favorite marine class.\nBe a Leader - Use special leadership commands to guide your teammates to victory.\nDropship - You can use dropship to quickly evacuate to Safezone or transport your teammates to help you in a fight.\nInventory system - Find and gather items that will help you survive and defeat the biomass.\n8 unique classes - Define your playstyle by playing one out of 8 unique classes.\nHot Join - Call for reinforcements from your friends list mid-game.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Ironward","platforms":[{"id":0,"name":"PC"}]},{"id":16308,"name":"Agony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf9/cf9063729ff883ddf8c09ed45d3a72c6.jpg","description":"You will begin your journey as a tormented soul within the depths of hell, without any memories about your past.\nThe special ability to control people on your path, and even possess simple minded demons, gives you the necessary measures to survive in the extreme conditions you are in.\nBy exploring the hostile environment and interacting with other weary souls of the hellscape, the hero will soon understand that there is only one way to escape from Hell, and it will require meeting the mystical Red Goddess.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":15491,"name":"RPG MO","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/267/26767e8020eba21f0f82d17227362dbb.jpg","description":"In case of loading issues(white or black screen) please use up to date browser and url https://data.mo.ee/index2.html?inapp=steam to play 自备楼梯\nRPG MO is an online multiplayer role-playing game that gives players the opportunity to explore many paths. Players can build up combat and magic skills and acquire spells, weapons and armor to become formidable fighters, and they also may build up crafting skills and create items for themselves or for sale to others.\nThe game is an open-world sandbox experience where players may choose their own road, and a key component of gameplay is a vibrant player market where any object may be sold to other players. It is a true free-to-play game; even the most desirable items can be acquired from other players with in-game currency that is built up through gameplay.\nRPG MO is created with adult gamers in mind, and progress into higher levels will not come quickly. Younger players also may enjoy gameplay, particularly if they are willing to be patient and develop skills.\nRPG MO Includes:\nExplore 34 hand crafted beautiful pixeled large worlds\nExplore randomly generated dungeons with up to a 4 player party\nFight monsters\nFight other players in many different modes - guild wars, RSC-wilderness like map, last man standing arena\nLevel up 17 different skills with no level caps\nBuild your own house and invite your friends over for a party\nChoose or breed yourself a pet from our 285+ pets\nBecome a collector and try to get all our 3200+ itemsFollow Us On Twitter https://twitter.com/rpgmo","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Marxnet","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":12146,"name":"World to the West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/712/7124ba0575688acd9ab67fff771d60ee.jpg","description":"World to the West is an action adventure game developed by Rain Games. It builds upon the universe of indie hit Teslagrad, which has been played by over 1.6 million people so far.\nWorld to the West is a pulpy, cartoony top down action adventure inspired by European adventure comics. Take control of four unique characters —Lumina the Teslamancer, Knaus the orphan, Miss Teri the mind bender and the gloriously mustachioed strongman, Lord Clonington—, each with their their own motivations, skills and interweaving storylines, as they seek to escape the dark shadow of an ancient prophecy. Travel trough corrupt colonies, lush jungles and frozen tundras, as you snoop through the secrets of a forgotten civilization.\nBe careful though. Nothing is ever what it seems. Will you join us in this journey to the West?Features\nPlay as four heroes, each hailing from individual nations and possessing unique identities and abilities.\nExplore a vibrant world filled with characters who have their own helpful and not-so-helpful agendas.\nExperience seamless transitions between combat and puzzle solving that keep you on your toes.\nFace your enemies head-on with brute force, convince them to see things your way or avoid them altogether. It’s your call!\nUncover secrets, more secrets and secrets inside secrets! Exploration is key to unveiling World to the West’s mysteries.\nSet in the Teslagrad universe: a standalone followup where you'll encounter both new and familiar faces.\nWorld to the West is available for Windows, Mac OSX and Linux.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Rain Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":718135,"name":"Palworld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e9/4e9c951414c732923fa72d5b1da49402.jpg","description":"Q. What is this game about?\nA. Palworld is a game about living a slow life with mysterious creatures \"Pal\" or throwing yourself into life-and-death battles with poachers.\nYou can make Pals fight, breed, help with farming, or work in factories.\nYou can also sell them off or even slaughter them to eat! That however, is forbidden by law.\n■ Survival\n- This world is full of dangers such as food shortages, harsh weather, and illegal poachers. You must be prepared to do anything if you want to survive. You may even need to consume Pals sometimes...\n■ Riding and exploration\n- Fly, swim, dig holes... you can explore all kinds of places on lands, the sea, and in the sky by riding Pals.\n■ Building\n- Do you want to build a pyramid? You can have a large number of Pals work on the construction. Don't worry; labor laws won't be applied to Pals.\n■ Life\n- Make your life more comfortable by collecting a variety of valuable Pals to light fires, generate power, and mine minerals.\n■ Farming\n- Different Pals are good at different things such as sowing, watering, harvesting, or else. Create attractive farms and orchards with your Pals. There are also Pals that can duplicate themselves when they're planted.\n■ Factory and Automation\n- It is essential for automation to let Pals do the manual work. Build a factory and place Pals in it. They will work forever as long as they're fed until the end of their lifetime.\n■ Dungeon Exploration\n- With Pals, you'll be safe in dangerous areas. If you are in danger, you use Pals to cover your escape! They'll give their lives to protect you.\n■ Breeding and Heredity\n- When you breed Pals, they inherit the parents' characteristics. Mix rare species Pals to raise the strongest Pals!\n■ Poaching and Crime\n- Endangered species Pals live in the hunting prohibited area. If you sneak in and catch them, you'll get tons of money! It's only illegal if you get caught.\n■ Multiplayer\n- This game supports multiplayer. Invite your friends to go on an adventure together. Of course, you can battle and trade with other players!","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Pocketpair","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":308092,"name":"Layers of Fear 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ab/6ab50f9a3d3848b6e82d184686e0db1f.jpg","description":"The cameras are all focused on you; the center of the scene. Not just in character, you are the character. The part to play is singularly yours. Written just for you.You are met with silence. No barking orders from the director. No call to action that you need to become this version of yourself. The demand to act fills your mind, but the script pages hold no words.\nYour past has helped to mold you into what you are, forced upon you the skills required to hone your craft. That same past has scraped deep furrowing scars into you, not on the outside where the world can see, but in a place buried so deep within that it has become shapeless. You push those memories down but let the experiences drive you into who, or what, you must play.\nDarkness surrounds as you stand silently in the spotlight, the only sounds to be heard over your heartbeat are the distant breaking of waves against the hull and the sound of cameras pointed in your direction preserving this moment for eternity.\nA deep and commanding voice rises from the distance. Act.\nWhat part will you play?\nGame Features:\nStory-driven exploration - You must explore the world around you. Discover your past, and expose the reason for your having been cast for this film.\nPsychological horror - Is this part of the film, or are your memories playing tricks on you? Your world may change with the slightest of provocations, you must decide what is real.\nOcean Liner setting - Your explorations into the depths of the ship that play the scenes for the film become ever more incredible, and ever more terrifying.\nClassical, ominous soundtrack - An original score composed by Arkadiusz Reikowski, conducted by George Strezov, and performed by the Sofia Session Orchestra","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bloober Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":18418,"name":"Princess Remedy in a World of Hurt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/138/13861ed0215d8bb7fda40c1c4b324f3d.jpg","description":"Remedy, a recent graduate from the Saturnian healing school, must descend to Hurtland and use her powers to heal everyone from stray ducks to dark lords, and finally cure the ailing Prince Hingst. It's a short, whimsical adventure with plenty of heart(s).\nThis game was one of Ludosity's entries in the Games Against Ebola charity game jam in 2014. This version was made after the jam to include options, multiple savefiles, more difficulty levels, and gamepad support.\nCheck out the sequel! http://store.steampowered.com/app/522040","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ludosity","platforms":[{"id":0,"name":"PC"}]},{"id":16849,"name":"Syder Arcade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/851/8519acd961c20718d46ba556f739c6cd.jpg","description":"Killing zombies never gets old, but sometimes you just need a break.\nGet back to some serious old-school gaming with Syder Arcade! Syder Arcade is a love letter to Amiga games of the ‘90s, no coins, no upgrade grinding, just your tenacity and a motherload of alien invaders.\nSyder Arcade is a free scrolling, multi directional shoot 'em up, an uncompromised old-school experience, furious, challenging, and straightforward. This game will bring you back in time, when bulky starships were cool and games were about player skill and swearing madly at your computer.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Studio Evil","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":104,"name":"We Are The Dwarves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2c/d2c7c465091722d1c13f8a5ae8f54bcf.jpg","description":"The Dwarven stars are slowly dying-- putting the race at the edge of extinction. Deliverance is poised upon three Dwarven astronauts who are sent on an expedition to find a new star in the depths of the Endless Stone. Take control of Forcer, Smashfist, and Shadow as they explore the unknown territories of the stone universe while meeting new civilizations and ancient monsters from the deep layers of space.\nWe Are The Dwarves is an action-based tactical adventure with active pause (extreme slowdown of time) placing you in control of three Dwarven astronauts. Forcer is capable of ranged destruction, and timely set-up exectution. Smashfist, a brute at heart, gets up close and personal with rage worth avoiding. Shadow stays just where you'd expect him to, launching deadly successive assassinations and precision archery from afar. As a trio, combine each dwarfs attack styles into orchestrated destruction against your foe.\nFeatures of We Are The Dwarves -\nThree distinct characters, each with an array of abilities and talents.\nIndividual skill trees for each dwarf; customization varies from stealth to slasher​.\nPause and queue gameplay - slow time and set up a series of commands to be executed.\nEnemies vary in sense interaction, picking up movement, ambient noise and scent.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Whale Rock Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":22019,"name":"Passpartout: The Starving Artist","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc2/dc25fef5ab5762fa808f0d839a2e46fc.jpg","description":"Experience the life of a starving artist! Passpartout puts you into the shoes of a French artist trying to navigate the beautifully confusing art scene. Paint and sell your own art to survive your expensive wine and baguette addiction.FeaturesPaint your own masterpieces! Even you can become the next Van Gogh!\nBattle with subjectivity and try to charm a variety of self-proclaimed art connoisseurs without losing your \"artistic integrity\"!\nSurvive your wine and baguette bills. Will your addiction to baguettes be your downfall?\nUnlock fancier galleries and customers!\nExperience the French art world through a living puppet theater!\nIncludes an amazing soundtrack by our favourite groovin' dinosaurs Synkronosaurus","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Flamebait Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]}]