[{"id":398409,"name":"Weird West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ca/3ca6130eabf2e05275859166eaf5c66b.jpg","description":"Survive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey.\r\n\r\nDiscover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures. Journey through the origin stories of a group of atypical heroes, written into legend by the decisions you make in an unforgiving land. Each journey is unique and tailored to the actions taken - a series of high stakes stories where everything counts and the world reacts to the choices you make. Form a posse or venture forth alone into an otherworldly confines of the Weird West and make each legend your own.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"WolfEye Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"}]},{"id":47392,"name":"Blackout Z: Slaughterhouse Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39d/39d4570858c1e5450c1a44e15bf19311.jpg","description":"Blackout Z: Slaughterhouse edition is an addictive fast paced top down shooter game. Slaughter tons of zombies and try to avoid sharp saws while the battery of your flashlight is slowly draining.\nPerfect to play when you want some fast action and have not much time or while you are on a queue for another game , this is a small re-playable arcade game, the objectives included are: Score Chase (with online leaderboards), unlock weapons and hats, achievements.\nBlackout Z is based on a free game that I made for Ludum Dare 39 the \"Slaughterhouse edition\" includes more weapons, better graphics, improved gameplay, more tracks and more...\nYou should defend yourself from zombies by shooting at them and running when you're out of bullets, but be carefull with the saws, they are preety sharp!\nThe battery of your flashlight are aways draining, so don't forget to pick up batteries before it's too dark.\nRemember: Kill zombies, avoid saws and pick battery.\nGet a higher score by killing zombies before the combobar ends. The multiplier increases every 10 kills.\nFast paced arcade experience.\nAddictive gameplay.\nUnlock new weapons and hats.\nAwesome 7 tracks original soundtrack.\nSteam leaderboards achievements and trading cards (coming soon).\nSteam cloud support.\nNukGames is a solo indie game developer (and a zombie killer on the free hours) from Brazil, focused in bringing great small arcade games with retro visuals, modern twists and the smoothest gameplay.\nThanks for reading. I hope you enjoy my game, now let the slaughter begins!\nPaulo Brunassi - NukGames","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NukGames","platforms":[{"id":0,"name":"PC"}]},{"id":45433,"name":"Polygoneer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fe/7fef2f6822b11b7590fe838fb90432f8.jpg","description":"Polygoneer is an arcade reflex based game. You should defend yourself from polygonal enemies that come from all sides, hitting them with the right color shot, one miss and its the end.Features\nPolygons\nFast paced arcade gameplay\n5 different stages\nLeaderboards for each stage\nOriginal electro hardcore soundtrack\nSteam achievements\nTrading cards (when aproved by valve)\nMore Polygons","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NukGames","platforms":[{"id":0,"name":"PC"}]},{"id":21787,"name":"English Country Tune","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee7/ee7e82d95fabb8573800c0a439d7120e.jpg","description":"###What to expect\nThis is a 3D puzzle game that starts with simple levels. In them, the player needs to push the objects so that the ball fits right into place. This type of game is called Sokoban - by the name of the first game that used these mechanics. Since the Japanese Sokoban translates as the keeper of the warehouse. The first game, released in the early 1980s, required the player to proper place all items on the grid-based level.\n\n###Game mechanics\nHowever, in English Country Tune mechanics are a little more complicated: it feels right after completing several levels. The mix adds a few unusual mechanics and goals, which completely transform the gameplay. The developers made focused on the physics of objects: here it is fine-tuned almost to perfection. Although the game looks simple, it is ready to challenge even to seasoned veterans of the puzzle genre.\n\n###Key Features\nThe game has more than 100 levels, located in 17 worlds. Each world is distinguished by a visual style, and the composition is getting enhanced by more than 60 minutes specially composed soundtrack. The idea of ​​the game appeared to the developers within a single hackathon. They used the Unity game engine features. This allowed porting the game to other platforms quickly. The original release took place on November 25, 2011, later the game appeared on mobile devices, earning bonus recognition from the critics.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"increpare games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":367179,"name":"Red Wings: Aces of the Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e9/0e95f917ad24e936322977586466ed84.jpg","description":"Experience the fascinating history of the Great War and become the king of the skies! Red Wings: Aces of the Sky is a dynamic action game that will show you amazing battles from the pages of history in a brand new arcade gameplay style. Use your unique skills to take your opponents down, develop your deadly pilot aim and become the true ace of the sky.\nWitness the birth, rise, and fall of the talented Red Baron, Manfred von Richthofen—the ultimate hero of the war, credited with 80 victories. Now you can become a part of his squadron, but are you up to the task?\nChoose one of over 10 historical warplanes of Entente Powers and the Triple Alliance. Invite a friend to fly together on a local co-op. Sky-high thrills are waiting for you!\nExperience a unique mix of historic events and over-the-top, comic book-stylized adventures. Game events are combined with quotes from real letters from WW1 pilots.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"All in! Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":47118,"name":"The Jackbox Party Pack 4","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f80/f80f08fb07e1283afd4e84ddc7082389.jpg","description":"The biggest and fourthiest addition to this storied party game franchise features not five but FIVE AND A HALF crowd-slaying games!Fibbage 3 (2-8 players)The blanking fun sequel. Play all-new question types and the game mode Fibbage: Enough About You (3-8 players). Guess the weird facts about your friends.Survive the Internet (3-8 players)The web-based frame game. Twist your friends’ “online” comments in hilarious ways.Monster Seeking Monster (3-7 players)The spooky date-a-thon game. Message and date fellow monsters with special powers.Bracketeering (3-16 players)The deranged debate match game. Place smart bets on stupid arguments.Civic Doodle (3-8 players)The one-up art game. Compete to improve the town murals.\nPlay using your phones, tablets or computers. No extra controllers needed!\nPlus EVEN MORE features just for streamers!\nNOTE: The Jackbox Party Pack 4 is in English only.\nNOTE: The game is local multiplayer but can be enjoyed over streams with remote players.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":6937,"name":"Samorost 3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a8/1a8c6a9df256e5c59682baaa02e7e18e.jpeg","description":"Samorost 3 is an exploration adventure and puzzle game from the award-winning creators of Machinarium and Botanicula. It is Amanita Design’s most ambitious experience to date and a loose continuation of the hit indie games Samorost and Samorost 2.\nSamorost 3 follows a curious space gnome who uses the powers of a magic flute to travel across the cosmos in search of its mysterious origins. Visit nine unique and alien worlds teeming with colorful challenges, creatures and surprises to discover, brought to life with beautiful artwork, sound and music.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amanita Design","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":131,"name":"Everything","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b47/b472cda3827b3e01944d2ab60e98ff97.jpg","description":"Everything is an interactive experience where everything you see is a thing you can be, from animals to planets to galaxies and beyond. Travel between outer and inner space, and explore a vast, interconnected universe of things without enforced goals, scores, or tasks to complete. Everything is a procedural, AI-driven simulation of the systems of nature, seen from the points of view of everything in the Universe.\nLearn to transform yourself to create worlds within worlds within worlds, or let go any time to allow Everything to take over and produce a never ending documentary about the world you live in.\nNarrated by the inspiring philosophy of Alan Watts, and featuring a rich score from composer Ben Lukas Boysen, Everything will give you a new perspective on life.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"David O'Reilly","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":379556,"name":"Yes, Your Grace","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f2/8f2cf5f18de195a2347116cdedceec9b.jpg","description":"Yes, Your Grace tells a tale of Davern, a medieval kingdom ruled by King Eryk. Villagers will ask for your help with various problems, from monsters attacking the village to a lack of places to relax and enjoy themselves. Some will bring humour to your throne room and some will present you with difficult choices. Your family is important too, and throughout your time as King, you will have to support them in their struggles.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Brave At Night","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":14895,"name":"Autobahn Police Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/717/717613cf8d3f192da2ee623dafb0aa69.jpg","description":"Autobahn Police Simulator is the first simulation to realistically reflect the working life of a police officer on the German Autobahn. In numerous and diverse operations the player is responsible for enforcing law and order on Europe’s fastest roads.\nIn addition to the 40 missions revolving around the daily duties of the Autobahn Police, one can enjoy the extensive “Free Play” mode. This mode generates random radio calls for operations which the player is free to accept. All in all, this mode includes 100 additional operations at various locations and times of day. Accidents can be more or less severe and can also include trucks. The fully equipped patrol car houses all material needed to secure and inspect the accident site. Emergency vehicles, fire trucks and rescue services complete the scene at the accident.\nAnother option available to the player is to use the “Bitte folgen” (Follow Me) sign of the patrol car to flag down suspicious cars. Drivers trying to escape have to be chased down and stopped.\nIn the course of an inspection, the driver has to be examined for alcohol abuse, possession of drugs and for the roadworthiness of his car.\nThe simulation covers a total Autobahn stretch of 40 kilometres (approx. 25 miles). Some sections have a speed limit where the player can perform speed checks out of an unmarked police car.\nRealistic radio communications create a real life and exciting atmosphere, further enhanced by the day and night mode with its emergency light operations.\nThe game offers a view from within the car as well as from an exterior camera view with a free movement. Using a steering wheel will make the simulation even more enjoyable.Features\nApproximately 40 km (25 mi.) of Autobahn\nTwo police vehicles – patrol car and unmarked car\nMale and female game characters\nFlagging down suspicious vehicles\nChasing down fleeing suspects\nChecking for alcohol or drugs\nVerifying TÜV (MOT) inspection stickers\nInspecting truck loads and checking truck driver rest periods\nUsing the unmarked car for speed patrols, then following-up with stops and issuing tickets\nSmall and serious accidents including trucks\nSecuring accident sites\nResponding to accidents\nOn-site fire and rescue vehicles\nDay and night shifts\nRealistic radio communications\nSupport for gamepad and steering wheel","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Z-Software","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":272427,"name":"Lightmatter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a1/4a1ee7cf3792722dcd11638e542405c3.jpg","description":"Lightmatter is an atmospheric first-person puzzle game where shadows kill you.\nThe floor is (lava) shadows – use lateral thinking with lights and shadows\nUnique art style that looks like you are in a sci-fi lab inspired by comic book supervillains\nFor people interested in mind-bending puzzles and enjoy a good sci-fi story\"If LIMBO and Portal had a weird baby ...\"\nInspired by great puzzle games such as The Talos Principle, Portal, Antichamber, The Turing Test and Closure\nDeveloped by indie studio Tunnel Vision Games from Aalborg, Denmark\nComing to PC & Consoles in 2019.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tunnel Vision Games","platforms":[{"id":0,"name":"PC"}]},{"id":10337,"name":"Holy Potatoes! We’re in Space?!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/912/9128e0dce6280f012841a79b88cb12e9.jpg","description":"More Holy Potatoes! on Steam:http://store.steampowered.com/app/363600/\nAbout the Game\nHoly Potatoes! We’re in Space?! is a whacky space exploration game where you manage your very own spaceship, craft hundreds of weapons, and explore the vastness of a veggie-filled universe.\nPlay as sisters Cassie and Fay as they scour dozens of planets in a dynamic universe for their beloved grandfather, Jiji! Follow them on their quest and experience an engaging and ever-changing storyline with a diverse cast of lovable, anthropomorphic vegetables, which include some familiar faces!\nHoly Potatoes! We’re in Space?! features tactical, turn-based combat and a variety of weird and wacky weapons, each with special effects that can be used to turn the tide in battle! Ever wanted to maul your enemies with a horde of kittens? Don’t worry, we’ve got you covered. If you hated vegetables as a kid, this game is for you!\nManage your crew, time and resources to craft a spudload of weapons and create the ultimate juggernaut of mass destruction!\nA charming, vegetabulous soundtrack of over 150 tracks by the talented Jeff “Pumodi” Brice will keep you entertained while blasting your foes to bits!Key Features:“Carrot” get enough of punny humor? Say no more!\nA compelling story that differs across playthroughs!\nHire engineers from an array of strangely familiar edibles to man your ship and weapons\nStrategic gameplay - micromanage your crew, craft a wide array of weapons and plan your attack against enemy ships!\nExplore dozens of planets and galaxies, or why not the whole universe!\nVarious localization options!\nCasual Mode for stress-free “pew pew”-ing!\nOwn a large, fluffy Space Cat. ‘nuff said.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":33,"name":"Final Fantasy XII: The Zodiac Age","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f35/f351f8f406f2ea12088b5e1b034f73b9.jpeg","description":"Day-1 Edition\r\nPurchase at launch to receive three audio tracks and exclusive wallpaper created by original game artist Isamu Kamikokuryo plus a 20% launch discount (Offer ends 8th Feb 2018)\r\nAbout the GameFINAL FANTASY XII THE ZODIAC AGE - This revered classic returns, now fully remastered for the first time for PC, featuring all new and enhanced gameplay.\r\nRETURN TO THE WORLD OF IVALICE\r\nEnter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country.\r\nVaan, a young man who lost his family in the war, dreams of flying freely in the skies. In a fight for freedom and fallen royalty, join these unlikely allies and their companions as they embark on a heroic adventure to free their homeland.\r\nPlayers both returning and new to the game will be immersed in a grand adventure that spans the world of Ivalice in an entirely fresh and improved experience.\r\nKEY FEATURES:\r\nNew Zodiac Job system with improved battle mechanics.\r\nNewly implemented trophies.\r\nTrue 7.1 Surround sound including HD voicing and fully remastered music.\r\nChoose between original in-game BGM, new re-orchestrated BGM and original soundtrack.\r\nEndless adventure including hunts, battles and mini-games.\r\n60 FPS - Ivalice will look even more spectacular running at 60FPS\r\nCompatible with 21:9 ultra wide monitors\r\nNew Game Plus and New Game Minus\r\nMaximized License Points and Gil\r\nFull controller support, Steam Trading Cards and more!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":14085,"name":"Seasons After Fall","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/580/5808defe2981794788369e6368b4052d.jpg","description":"Seasons After Fall is a 2D platform-puzzler game that will let you dive into a captivating universe and explore a land governed by magic and nature. As a wild fox you are sent on a perilous journey aided only by your ability to change the seasons at will, manipulating a gorgeous 2D world backed by an enchanting live string quartet.\n\nThe power of nature is in your paws as you make your journey across this mysterious world full of strange flora and fauna. Each of the seasons have a drastic change on the environment: it is up to you to change the world and open new paths. Winter can freeze waterfalls, and the rain from Spring can raise water levels, while Summer can cause some plants to grow and extend. The world of Seasons After Fall is overflowing with secrets, can you uncover the truth?\n\nSomething feels weird in this forest. In order to complete your quest, you must use your mystical abilities to meet the Guardians and gain their powers. The four Guardians of the Seasons are gigantic totemic spirits and protectors of a mysterious sacred ritual: the Bear for Winter, the Crane for Autumn, the Eel for Spring, and the Cicada for Summer. But are they allies? Or enemies?\n\nDiscover a world brought to life by stunning hand-painted graphics and original music performed by a string quartet. Visit enchanted vistas and sceneries while the music, the mood, and the atmosphere change seamlessly with the seasons.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":428966,"name":"Paradise Killer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ed/9ed9f5e3c1ac7f70c778f0880a906c46.jpg","description":"An island outside of reality. A rogue human civilization hoping to resurrect dead alien gods. A murder behind locked doors.\nParadise is an island that regenerates every few millennia. The psychic power that the alien worshipers within release into the universe is meant to feed and eventually resurrect their fallen deities. But this force also attracts undesired interest from demons, who eventually corrupt each island — until a new alternate reality is birthed by the Council.\nThe system isn’t perfect, but it will be one day — on Perfect 25, the next island-to-be. But on the eve of rebirth, the Council is murdered and Paradise is killed.\nIn the aftermath, the “investigation freak” Lady Love Dies is summoned from exile to find the culprit. This is the crime to end all crimes.\nWhat are the facts? What are the truths? Are they the same?\nYou are tasked with finding the killer and building an airtight case against them. Take your case to trial and argue your interpretation of the evidence. Only when someone is successfully convicted can the crime be considered solved and Paradise be saved.\nThe “truth” is that there are many possible killers, and many ways to build a case. Even if you make a convincing case for prosecution and get someone convicted, is the mystery really solved?\nParadise is an island set in an alternate future history filled with cryptic lore and even more mysteries. Examine bizarre relics to learn more about this world’s surreal history.\nYou choose who to accuse, and build a case to support conviction. Everyone on Paradise has a secret to hide and something to gain. Old friends become new suspects, forcing you to choose between the evidence, the greater good and your own beliefs. There are many possible murderers, but who you pick will define your own personal truth.\nLet your personal computer and electronic assistant Starlight be your guide through another dance of an investigation. Collect evidence, record testimony and interpret the facts to form your own truth.\nSolve hieroglyph puzzles on ancient nightmare computers to discover new areas of the island, find concealed evidence and reveal terrifying secrets.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Kaizen Game Works","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":51595,"name":"Yume Nikki","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8a/a8ad3d2de1e1933f37e9087649242059.jpg","description":"An RPG Maker tour de force, and a divisively controversial work for fans.\nYou are free to explore the various dream worlds at your own pace.\nIf you check certain characters or items in the game you will collect an “Effect.” These “Effects” can be used to change the main character’s appearance.\nSome of these “Effects” have special actions or animations which you can activate by pressing 1 or 3 on the number pad.\nYume Nikki is a very unique title that has become one of the most well-known indie games to come out of Japan.\nIt is unlike any other RPG especially in the fact that there really is no action or dialogue to speak of. This gives the game a very dark and foreboding atmosphere. Can you make it to the secret ending?\nThere are no particular goals nor story of which to speak. You simply walk around.\nChecking certain characters inside the dream will increase the number of \"effects\".\nUsing \"effects\" will cause the main character's appearance to change.\n(During this time, you can use the 1 or 3 keys to implement special movements and effects.)\nUsing the same \"effect\" a second time will cause the character to revert to their original form.\n\"Effects\" can only be discarded inside rooms with many doors.FAQQ. There is a glitch or aspect ratio issue in the game.\nA. Please switch to Window mode by pressing F4 or Alt + Enter.\nQ. Why does the Japanese version crash?\nA. The Japanese-language coding in this game runs only on Japanese system locales. If you want to play the game in Japanese and it crashes, please change your system locale to Japanese.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"kikiyama","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":62627,"name":"Iron Danger","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/043/043e69bc15cc6dfbf2222f9f5878bfb3.jpg","description":"Iron Danger is a story-driven, turn-based, tactical RPG with simultaneous turns and time manipulation mechanics. A never before seen combination, which brings new level of depth into tactical combat.\nIt is a streamlined, action-packed single-player game in which repetitive grinding is kept to a minimum and every moment advances the story.\nIn this fresh fantasy world of warrior shamans and machine fumes, you take on the role of Kipuna, a simple village girl, who becomes imbued with a cosmic power that grants dominion over time and death. The player controls Kipuna and one of two individual companion characters in tactically challenging battles against a variety of different threats. At center stage in combat is the unique time shifting mechanic that represents Kipuna’s magical influence over the flow of time. It gives the player the ability to rewind at any point with fraction-of-a-second precision, pinpointing strikes to enemies’ unguarded moments, deflecting and dodging attacks exactly when they happen, synchronizing magical and physical attacks to overwhelm difficult enemies, and overcoming impossible odds through trial and error.\nIron Danger challenges you to think of combat and puzzles from a different perspective: you may be an experienced gamer, who knows all the tricks, but you’ve never played a game like this.FEATURESUse unique time-rewind mechanics and experience totally new take on tactical combat and puzzles\nEnter into deep tactical combat with simultaneous turns and take advantage of highly interactive environment to succeed\nAdventure in a world of steampunk fantasy and meet it’s unique inhabitants inspired by Finnish folklore\nFight epic boss monsters on the path to fulfill your destiny\nNo grinding.  Character development is tied to actions that player characters will take.WORLD OF IRON DANGERIron Danger is set in a world of lofty fells, primeval forest, and placid lakes... as well as living gods, monsters of steel and smoke, and supernatural doom dwelling beneath the earth. The city of Kalevala, home of the humans who rebelled against the gods and forsook their protection, shines in the middle of this world, surrounded by towns, sea lanes and and woodlands under its protection. But from the frozen north, a witch queen is leading her army on a quest for vengeance against the lords of Kalevala. Ancient ruins from the days when gods dwelled on the earth are opening to unleash forgotten powers, tempting humans and striving to overtake the wo\nrld.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Action Squad Studios","platforms":[{"id":0,"name":"PC"}]},{"id":15022,"name":"Stronghold Kingdoms","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1b/a1b9403d8d3cf05b383a7fb079b2f5e9.jpg","description":"Just UpdatedNow Available - Stronghold Kingdoms: Heretic\nDesigned for PvE and PvP players battling together in a single game world, Stronghold Kingdoms: Heretic offers you two choices... Either crusade with fellow lords against nefarious Stronghold characters like The Wolf or join them go heretic! Build up kill streaks as you capture and destroy AI villages or betray your fellow players and unleash total anarchy.\nStronghold Kingdoms: Heretic is a world where allies can betray you in the blink of an eye. Any player ranked Bondsman or above can turn, so watch your back! For the noble crusader there is the prospect of Honour bonuses, an increased Faith Point cap and a place on the in-game leaderboard. For the heretic? Chaos is its own reward.\nJoin the Crusade!\nAbout the Game\nLive the life of a medieval lord in Stronghold Kingdoms, the world’s first persistent castle MMO. A unique PC Strategy game, Stronghold Kingdoms brings together online interactivity and community, with a richly-depicted medieval world and thousands of real world players.\nBesiege the castle that’s never been taken, overthrow ruthless tyrants, bankroll your faction’s war effort, pillage your neighbour’s resources, peacefully raise cattle or do it all! A range of stats, rankings and achievements gives every player something to aim for, from ‘Banquet King’ and ‘Peacebringer’ to 'Besieger of the Month' and ‘Lionheart'! Factions, elections, liege lords and their vassals all provide a real sense of structured community, with many different ways to chat with other players, discuss strategies and build allegiances.\nWhile an impregnable castle should be at the heart of any lord or lady's domain, you can also specialise with a vast research tree. Starting as a humble peasant, each promotion brings with it valuable research points to spend on trading, diplomacy, warfare, farming, religion and more. Be aware though, as your power grows so does your responsibility. Your vassals and parishioners will look to you for guidance and leadership. You may find yourself fighting for the crown itself!\nKey FeaturesBuild Your Online Stronghold - Crush the invading hordes with impenetrable castle defences. Then launch a counterattack!\nPlot the Perfect Village - Plan your village layout, arrange buildings for maximum productivity and watch it come to life.\nExplore a Vast Research Tree - Are you a farmer, trader, diplomat or warlord? Research new technology to specialise and gain the edge.\nFight For Your Faction - Join a faction, attack its enemies and return triumphant with their captured banners!\nPlay for Free! - Stronghold Kingdoms is free to play with no subscription or upfront payment required.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":11845,"name":"Infestation: The New Z","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/132/132fce51a93d6c0ef8ee71ff3ee3ceb3.jpg","description":"Infestation: The New Z is an official, massive re-work of Infestation: Survivor Stories (previously released as The War Z). Experience a massive open world shooter featuring a dynamic player vs player experience in different game-modes and worlds. Enjoy frequent updates, community involvement, a wide selection of skins, highly optimized anti-cheat and much more. Infestation: The New Z started out as a small project based on the original title Infestation: Survivor Stories.. A group of original players came together with the goal to re-work the entire game - creating the best infestation experience yet.\nGAME FEATURES\nDynamic GameplayPlay with friends, scavenge for loot and fight other players. Experience the open worlds and travel around on foot or with cars to loot, kill zombies and meet other players. Enjoy different game-modes, trade your loot in the lounge, join the warm-up servers before entering the pvp-servers or fight to the last man standing in our new exciting “Battle Royale”-mode.\nMLG ANTICHEATEnjoy a fair game experience thanks to our unique “MLG Anticheat” - highly optimized and originally developed for the Infestation engine.\nOPEN WORLDEnjoy one of the best open-world experiences ever created. Loot and fill up your global inventory with a large variety of items, such as guns and armor. Choose between a wide selection of maps and join. The open world offers the following server types:\nOfficial servers feature the big explorable maps, containing many cities and small towns., including a separate lounge server where players can trade their items.\nPVP-servers offer a selection of small maps where players compete in close combat action to kill and loot other players.\nJoin a warmup-server and practice your competitive skills without the risk of  losing any items.\nUpgrade your account to Premium and enjoy the exclusive Premium servers.\nOur beginner servers offers our new players to learn the game, facing players with less than 1 hour playtime.\nWanna play in private or with friends? Rent your own password protected private server and play the game your own way!  BATTLE ROYALEExperience our unique Battle Royale-mode, where the target is to be the last man standing. Survive by finding guns & items, conquer random airdrops, kill zombies & other players, and make sure to stay out of the expanding radiation zone. Be the last player alive to win.\nOTHER KEY FEATURES\nCombination of First Person and Third Person Perspectives.\nPersonalize your inventory with our skin system. Skin boxes and skins can be bought or be looted in game servers.\nEasy to start! Loot is common and it takes a small amount of time to get into this game.\nPlayers can access their Global Inventory in various safe zones spread around the worlds or by entering the main menu.\nDrive around in cars to get to another location faster, cars can be picked up and stored for later use.\nYou can easily find your friends using our friend system. Create your own clan and fight with your clan-members against other clans.\nDiscover a huge variation of items, weapons, skins, melees, armors & more.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fredaikis","platforms":[{"id":0,"name":"PC"}]},{"id":14390,"name":"NEOTOKYO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cac/cac23df188d5c3f03d142ef69f7d2402.jpg","description":"NeoTokyo is an MMO game in a cyberpunk setting of near-future Tokyo. It was created as a Half-Life 2 mod.\n\n###Plot\nIn the 2040s, a group of Japanese nationalists in Japan's military tried to overthrow the legitimate government. Although the coup failed, the government doesn't trust its military anymore. The authorities created a new special service named Group Six that acts as a combination of secret police and counter-intelligence and hunts for the possible future conspirators. There's a rumor that a spec ops unit called Jinrai conspires to repeat the coup and the two services feud for power. This is all set to the backdrop of a dystopian megalopolis, where people slowly become fused with technology and a larger political crisis in Asia.\n\n###Gameplay\nThe players assume the roles of fighters in two competing teams. They engage in two multiplayer modes, one is a classic deathmatch, and the other, Capture The Ghost, is a variation of capture the flag mode. The game is played in rounds, and if a character is killed, he or she will respawn only after a round ends. \n\nNeoTokyo has three classes for characters. The Recon class is fast, wears light armor and can run without exhausting. The Support is the toughest class that uses explosives and heavy armor. The Assault class is in the middle ground between the two others. All three classes have to be used in a thoroughly planned combination. NeoTokyo rewards tactical thought and prudent gameplay.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"STUDIO RADI-8","platforms":[{"id":0,"name":"PC"}]},{"id":10580,"name":"Railway Empire","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98c/98c25faca7a3e594188e0ae5fa112eed.jpg","description":"Feature ListExploit the economic opportunities of the United States in an extensive campaign, working your way step by step from coast to coast across this great continent.\nLead your Railway Empire to success by establishing a comprehensive rail network and optimizing transportation of passengers and goods.\nMaster challenges and objectives through a range of scenarios, or create your perfect railway network in construction mode without any financial pressure.\nOver 40 historically accurate locomotives and more than 30 different wagons can be acquired over the course of the game, and must be put to use in the best way in order to take advantage of their strengths and weaknesses.\nInvest in over 300 new technologies across five different eras to progress and maximize the potential of your rail network.\nCompete with up to three rival companies, and even sabotage their efforts with the use of bandits and spies.\nAbout the GameUnited States, 1830: ‘The New World’ is in its ascendancy. Industry is booming, and the race is on to establish the most dominant and powerful rail empire in all of North America. It’s time to outthink and outmaneuver your competitors as you lead your company into the 20th century!\nIn Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition. You’ll also need to hire and manage your workforce if you want to ensure an efficient train service, whilst also develop over 300 technologies ranging from mechanical improvements to the trains themselves to workplace infrastructures and advanced amenities as you progress through five eras of technological innovations.\nHowever, you can’t just build and research your way to the top – the competition never sleeps, and to keep your business on track you’ll have to survive against up to three rival tycoons. To get to the top you may have to resort to more cutthroat tactics as you attack and sabotage your opponents through raids and industrial espionage.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kalypso Media","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":371825,"name":"Plants vs. Zombies: Battle for Neighborville","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/621/6217d52e35fe5137b3746367827e80e0.jpg","description":"Ready the Juice Cannons and prepare for battle in six online multiplayer modes, including intense 4v4 Battle Arena in the Funderdome. Plus, you can join forces with your favorite people and experience split-screen couch co-op* in every mode.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"PopCap Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":58540,"name":"Serious Sam 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6de/6de6fc22dcf802a549be5a41fabc84a9.jpg","description":"Serious Sam 4: Planet Badass is the fourth major installment in Serious Sam franchise of first-person shooters. Like its predecessors, Planet Badass puts an emphasis on over-the-top action, black humor and grotesque monster design.\r\n\r\n###Plot and setting\r\nThe events of Planet Badass are set before that of Serious Sam 3: BFE, making this game a prequel's prequel. As usual, Planet Badass follows the series' titular protagonist, the larger-than-life monster slayer named Sam, as he fights the hordes of alien monsters that invaded Earth. The game features locations set mostly in European countries, such as France an Italy. The story of Serious Sam 4: Planet Badass is written by Jonas Kyratzes of The Talos Principle fame. It is said to be somewhat more serious and mature than the stories in the previous Serious Sam installments.\r\n\r\n###Gameplay\r\nThe player controls Sam from the first person view and leads him through the levels while slaughtering monsters. The game does not feature an open world and instead consists of distinct levels, although they are much larger than in the previous installments of Serious Sam. Planet Badass introduces several features that are new to the series. Most notably, the game allows the player to drive various vehicles, such as bikes, cars, and harvesters, and to use them in combat. The game also introduces several new monsters and weapon types, although most of the classic monsters and weapons from the previous games also return.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Croteam","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":5604,"name":"Legendary","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b5/8b5517322bb1ab56b127c52d77b44cec.jpg","description":"The ancient myth of Pandora's box serves as the starting point of this game. Archaeologists find an artifact, a mysterious box, in ruins on the ocean floor, in the early 21st century. They can not determine what it is and put a find in one of the museums in New York, where it is well guarded.\n\nHowever, there is a person in the world who knows exactly what it is. This is the millionaire Ormond LeFey. LeFey hires an experienced thief Charles Deckard. Deckard must enter the museum, open this artifact and take its contents.\n\n###Pawn in someone else's game\nDeckard easily bypasses the security system of the museum and opens the box. When he does this, Signet appears on his left hand, and a powerful cloud of energy rips out of the box into the sky.\n\nDeckard leaves the museum and sees that there are creatures running around the streets, which were known only from myths. The sky is also full of these creatures, and all of them, both in heaven and on earth, attack people, tear them apart, turn over cars and destroy buildings.\n\n###From Pawn to Queen\nDeckard is the only person capable of removing monsters from our world. Deckard has to fight monsters with conventional weapons, but Signet on his arm absorbs the energy of dead monsters, this energy is able to heal Deckard and give him the power to \"kinetic strike\". Some useful things also do not work unless you apply this energy to them.\nDeckard has a notebook containing information about his tasks, monsters and weapons.\nDuring the game, Deckard has to go to London, then again return to New York, to penetrate the headquarters of LaFay, to cope with many other missions.\n\n###Allies and multiplayer\nDeckard is assisted by members of the paramilitary organization \"Council of 98\", this organization also knows about the artifact. The millionaire LeFay, who hired Deckard to open the artifact, is also not the loner, but the head of another organization, the Black Order, which seeks to master the forces of the artifact to conquer the world.\nWhen playing in multiplayer mode, up to eight people can participate in the game, and the Council of 98 and the Black Order are very relevant there.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Spark Unlimited","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":1374,"name":"Sky Force Anniversary","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eec/eec2814d3b70f84c35714d9e2faa3656.jpg","description":"Sky Force Anniversary is a vertical shoot-em-up game developed by Infinite Drems Inc. It is heavily inspired by the old Japanese arcade machines, like the ones made by Capcom.\n\n###Gameplay\nThe players have a plane that they use to attack their enemies head-on, evading return fire. Multiple planes are present in the game, with each one of them having their own stats and gameplay. Every player will be able to find their favorite pick. \n\nThe primary objective of each level is to get to its end without getting blown up by enemy planes, as most enemy shots are fatal. The levels consist of a mix of challenging and easy moments with the difficulty rising with each encounter. There are several boss fights present in the game. There are also several side objectives. Usually, there are four of them: destroying 70% of the enemies, 100% of the enemies, saving all the people present on the level, completing the level without getting any damage.\n\nSky Force Anniversary features a very balanced economic system. The players are awarded stars upon destroying an enemy plane. These stars serve as an in-game currency. It is used for upgrading your plane or purchasing new ones. The amount of stars awarded to the player depends on the chosen level difficulty.\n\nUnlike the previous title, Sky Force 2014, Sky Force Anniversary is not a free-to-play title. Thus it does not rely on microtransactions in its gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Crunching Koalas","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"}]},{"id":64526,"name":"Rustler","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fce/fcee8d0b8c747e64c0e19103f8b6bb96.jpg","description":"Grand Theft… Horse\nIn Rustler, you’re not a hero. This time, you weren’t born to be a mighty knight and you won’t become the king after killing a dragon.\nYou’re just a medieval thug, a simple criminal who’s trying to get rich and not killed in the meantime. Easy to say, harder to do - especially when you’re on the rock-bottom of feudal social ladder. But who said you need to obey the law? Throw a knight off his horse, lose the chase and roam around the castle town like a boss.Every choice has its consequences… but not here!\nEnjoy your freedom in an open-world, medieval-inspired setting. You won’t find here either historical, or political correctness. Prepare yourself for wild, over-the-top action and parody of RPG cliches. Take a job from one of various fractions: spoiled priests, exploitative merchants, corrupted city guards or boorish villagers. Or... just give up the plot like you always do and make some mess in the city using melee and ranged weapons.Different times, same sh… style\nExperience old school, skill-based combat in fast-paced gameplay. Fight on foot or hop on one of the mounts (like horses or wagons). Slash your enemies with a sword, impale them upon your spear... or just use a simple pitchfork if you don’t have any fancy weapons. Take them down from distance with a bow or crossbow.Friends? I don’t know those peasants…\nPlay the online multiplayer mode, classic way: grab a few friends, choose the map, game mode (deathmatch, CTF, jousting tournament or race) and play! No XPs, loot boxes, and skins - just pure rampage!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Jutsu Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":13969,"name":"Evolvation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf8/cf83a9cb3c6c66588d928784c2c0e39a.jpg","description":"EvolvationEvolvation is a class based and fast paced multiplayer arena space flying shooter with multiple game modes which can be played solo as well as team-based gameplay.DevelopersThis indie game is created by a two man team stationed in the Netherlands, Amsterdam!Reclaim the galaxy and evolve or die fightingEvolvation is a project that HyperReuts started over a year ago with the ambition to create a fast paced multiplayer spaceshooter with a lot of action. By making use of Unreal Engine 4 we want to provide our users with an AAA quality game that can still be played on low-end devices.Amazingly fun to play, instant multiplayer action!Most spacegames do not support multiplayer. We do support multiplayer! Multiplayer is awesome! If multiplayer is supported in a game, we miss actual player to player interaction. It feels like a major world where you play a single player game with the occasional greeting of an other player.Do you dare to enter the arena?Evolvation in an arena based multiplayer game like Unreal Tournament, Call of Duty (multiplayer), Quake, etc.. This means that a continuous player to player interaction is inevitable. Other players are the central game elements! In some games it is just traveling from one location to another location (We have read that some journeys wherein nothing happens take more than 20 minutes!). Since it is an arena based multiplayer game, the players are restricted with level bounds. All maps are designed for optimal interaction, it is nearly impossible to not have an interaction within 30 seconds!A new breed of class based multiplayer actionEvolvation is a class based multiplayer game! With classes such as: Highspeed, Fighter, Stealth, Support and Tank. Each class has its own special abilities which provides a dynamic and balanced gameplay.\"Finally a game that I can play, no pay to win!\"Some games give players advantages if they invest more real-life money. We think it ruins the gameplay for a lot of people. It is simply not fair! So no, we are not going to do this. We think it is not fair for other players when some players invest more money than others. We may gain more revenue with these options. But our main goal is to develop a fun multiplayer game. We refuse to ruin the gameplay for our own winnings. Our motto: We win if you think the game is fun to play!\"Great dynamics! Perfect for casual and intense gaming.\"It is common in other games that you can not play with your friends that invest a lot more time than you because they have significantly better stats. In Evolvation, you can! We understand that you might have a job and cannot play for 40 hours per week. Of course, with our extensive upgrading system you can get advantages over other players. But we aim to let these gaps in advantages to be “just right” so that people who can not or do not want to play for 40 hours a week, it will still be fun to play the game.Key Features\nFast paced multiplayer game\nAAA visuals\nClass based multiplayer game with classes such as: Highspeed, Fighter, Stealth, Support and Tank. Each class has its own special abilities which provides a dynamic and balanced gameplay.\nMultiple camera modes including 1st and 3rd person modes\nSeveral input types such as console controllers\nIn-depth upgrade and leveling system\nMovement system with six degrees of freedom\nCustomizable spaceships\nPC-platformCurrency is changedIn the late future, the currency that we now take as granted, is no more. The evolving need of data in the future has become so important that is has become a currency. Gain data in Evolvation and buy, repair and upgrade your spaceship with your collected data!Millions of possibilitiesYou have the option to buy new spaceships, weapons, engines, computers and much more! You are able to configure your very own spaceship to your liking. Thousands of configurations are possible, so you can make your spaceship unique. But be aware, in order to buy an upgrade, you are required to have sufficient in-game currency. This currency can be acquired with several in game methods.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"HyperReuts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9430,"name":"Chaos Domain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd6/fd682fb98a6f324d2cd415c5a24309bf.jpeg","description":"Chaos Domain is a 2.5-dimensional side-scrolling shoot-em-up game developed by Holy Warp. Black Wing Foundation.\n\n###Plot\nSet in a distant future, where humankind mastered the interplanetary travel, a Chaos cult is created. These cultists raid other spaceships, brainwash the passengers and go on. The main character sets out to kill all the cultists. \n\nThe developers say that there is not much plot present in the game and want the player to think they are saving a princess. Although, that is what you are doing.\n\n###Gameplay\nChaos Domain is heavily influenced by the old side-scrolling games of the Sega Mega Drive era like Contra. The main objective of the game's levels is either to get to its end or beat a boss. There are 30 levels present in the game. The players have to complete their objective in a limited amount of time getting the most points possible.\n\nThe game features a weapon upgrade and ability systems. The players can purchase abilities and weapons in an in-game store using the points they got awarded after playing a level. \n\nThe game also features a single-screen multiplayer. At any point of the game, a second player can join in. There is no online multiplayer present in the game.\n\n###Style\nThe game's art style is a mix between the Ancient Egypt mythology and cyberpunk. The music is also influenced by this mix.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Black Wing Foundation","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":51321,"name":"Concrete Genie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8e/f8ef94f5d2b554e745d3924802ce4cf4.jpg","description":"Concrete Genie is a game about a bullied teenager named Ash, who escapes his troubles by painting spectacular living landscapes and mischievous creatures throughout his abandoned hometown of Denska. As he masters this magical paint, he discovers it can purify Denska’s polluted walls. Can Ash overcome the bullies and paint his hometown back to life?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pixelopus","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":939,"name":"Dragon Ball Xenoverse 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e58/e58c97f607ceafe069b80a769d021ae2.jpg","description":"Digital Deluxe Edition\nExtend your experience with DRAGON BALL XENOVERSE 2 Season Pass and get access to 4 content packs.\nThe Season Pass includes:\n- New playable characters\n- Episodes and quests\n- Masters and master quests\n- New stages\n- Skills, costumes and accessories\nAbout the GameDRAGON BALL XENOVERSE 2 builds upon the highly popular DRAGON BALL XENOVERSE with enhanced graphics that will further immerse players into the largest and most detailed Dragon Ball world ever developed.\nDRAGON BALL XENOVERSE 2 will deliver a new hub city and the most character customization choices to date among a multitude of new features and special upgrades.\nRelive the Dragon Ball story by time traveling and protecting historic moments in the Dragon Ball universe\nBrand new hub city more than 7X the size of the original game with 300 players online at the same time\nNext-gen visuals bring the Dragon Ball anime experience to life\nNew characters and boss fights\nMore in depth character creation system and battle adjustments\nPost launch support for one year","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":10661,"name":"Hob","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/967/9678f6f9d1aa8850025a2e7b1358ce49.jpg","description":"From the team that brought you Torchlight and Torchlight II comes Hob: a vibrant, suspenseful action-adventure game set on a stunning and brutal world in disarray. As players delve into the mysteries around them, they discover a planet in peril. Can it be mended, or will the world fall further into chaos?Features\nWORDLESS NARRATIVE: Presented without text or dialogue, Hob’s story is revealed as you explore the planet and interact with the strange lifeforms that inhabit it.\nTRANSFORM THE WORLD by solving puzzles and repairing the planet. The landscape will change before your eyes, opening new areas to uncover and explore.\nGRAPPLE, PUNCH, and WARP through the world! Use your mechanical glove-arm abilities for traversal as well as combat.\nADVENTURE in an open world, explore ruins, befriend sprites, and battle the rogue creatures that threaten their extinction.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Runic Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":8622,"name":"Realm Grinder","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c5/8c549bf8351d44fe0fc9d5e522b4a08b.jpeg","description":"Grow your kingdom, build alliances, and explore one of the deepest idle RPG's ever!\nUse your money and influence to grow your kingdom from a single farm to a huge realm that earns wealth even while you're not online! In Realm Grinder, the player is given an incredible array of choices in how they build forge their new kingdom.\nKEY FEATURES:\nChoose to align yourself with a dozen different factions, each of which has their own distinct play style. Will you align with the elves, who reward tapping for treasure, or the demons, who give massive bonuses to the most powerful structures?\nFurther fine tune your strategy by choosing unique upgrades, buildings, and spells to invest in.\nContinue to unlock new and exciting systems like new factions, research, reincarnations, excavations, and way more. Months and months of unique content!\nAchievement hunters will be delighted with the broad range and depth of the achievement system. And it's not just eye candy! Many strategies rely on collecting trophies in order to boost certain upgrades.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kongregate","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":5363,"name":"Spyro 2: Ripto's Rage!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8da/8da6960974c2348585e6e99603c52126.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nThings are heating up! Spyro, the feisty, fire-breathing dragon is back and he's ready to take on a whole new adventure in this sequel to the original Spyro! You must save the worlds of Avalar by defeating the dinosaur-riding Ripto and his evil minions.\nDownload this PS one® Classic today!\n\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 351 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\nSpyro 2: Ripto's Rage! TM & © 1999 Universal Interactive Studios, Inc. Developed by Insomniac Games, Inc.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":25096,"name":"The Legend of Zelda: A Link to the Past","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/087/08727beb32c364d30e8b2a1aa8595f8e.jpg","description":"Return to an age of magic and heroes! When an evil magician named \n      Agahnim begins kidnapping young maidens in Hyrule in a quest to break \n      the imprisoning seal on Ganon, a young boy named Link is called upon to \n      stop him. Link must venture into twisting mazes, dungeons, palaces and \n      shadowy forests as he searches for the maidens and Princess Zelda. \n      Traversing both Light and Dark Worlds, he must navigate eight dark \n      dungeons, fighting evil enemies and huge bosses. Help our hero prevent \n      Ganon and Agahnim from shattering Hyrule forever. Whether you are a \n      young knight, a heroine-in-training or a seasoned warrior, The Legend of \n      Zelda: A Link to the Past will delight!\n    This game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"SNES"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"}]},{"id":20259,"name":"Hacker Evolution","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4dc/4dcb89d9db035d0d40fafd46e8db5225.jpg","description":"Hacker Evolution is a hacking simulator developed by exoSyphen Studios.\n\n###Plot\nYou step into the shoes of a former intelligence agent and a cybersecurity specialist. As a result of a strange chain of events, a critical service becomes unavailable. As you begin to work your way through the case, an unexpected link between a bank, a stock market, and a transoceanic communication system are revealed. A conspiracy is going on. Figure it out.\n\n###Gameplay\nAll the gameplay takes place in an operating system environment. The players have access to a console, a world map with all known serves placed on it, and your e-mail. The players are free to complete optional freelance jobs to get more money for upgrades and more gameplay variety.\n\nGet information from other computers by scanning a remote machine, deciphering it, accessing the ports using one of several exploits. An unencrypted machine stores several files and a bit of money if the player is lucky enough. \n\nBut be careful as hacking is in fact illegal. Your every action can be traced back to your computer. To ensure the players own safety, they can purchase new upgrades for their network and PC or use previously hacked servers to re-route traffic and avoid detection.\n\nThe game comes bundled with advanced level and mod editors. The players are free to create anything from just a new level to an entirely new game mode with its own plot.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"exosyphen studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16867,"name":"Hatred","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4e/c4e1d76bfa3d468c9fde9e6bf444b953.jpg","description":"Hatred fills your whole body. You’re sick and tired of humanity’s worthless existence. The only thing that matters is your gun and the pure Armageddon that you want to unleash.\nYou will go out for a hunt, and you will clear the New York outskirts of all humans with cold blood. You will shoot, you will hurt, you will kill, and you will die. There are no rules, there is no compassion, no mercy, no point in going back. You are the lord of life and death now - and you have full control over the lives of worthless human scum.\nYou will also run, you will need to think, you will need to hide and fight back when armed forces come to take you down. You will have no mercy for them, because they dare to stand in your way.\nOnly brutality and destruction can cleanse this land. Only a killing spree will make you die spectacularly and go to hell.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Destructive Creations","platforms":[{"id":0,"name":"PC"}]},{"id":7153,"name":"The Journey Down: Chapter One","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/731/731305cd5dc5dd089fac2cbe33cb392b.jpeg","description":"###Fandango roots\nThe game resembles the cult masterpiece of Tim Shafer Grim Fandango: faces of the characters are covered with masks of African tribes. The Journey Down is an episodic adventure for Linux, OS X, Windows, and iOS. Originally the game existed as a mobile application with poor quality graphics and audio, but the developers re-released the project with the prefix Chapter One and new high-resolution textures, full voice acting and additional content. This is the first part of the trilogy.\n\n###The story\nThe game's game takes place in the coastal city of Saint Armando. The player follows the adventures of Bwana and Kito, who own a gas station and barely make ends meet. However, future events drag them into a whirlpool of adventures, which makes forget about worldly problems. In the first part of the trilogy, the heroes go in search of a lost log. It can point the way to the mysterious land of the Underland. Together Bwana and Kito help the girl Lina to find the hidden land.\n\n###Unusual mix\nThe Journey Down is a classic point-and-click quest with an unusual visual setting. Developers have fashioned their characters in a mix of Afro and Caribbean styles. Special pride is the original jazz soundtrack, which was recorded just in time for the restart of the game in HD.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BlitWorks","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"}]},{"id":1150,"name":"The Playroom VR","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89c/89cd5120d2b52ba68e774f5f5a5a6188.jpg","description":"The Playroom VR is a minigame collection developed for Sony’s PlayStation VR virtual reality system. The game was released as a free launch title for the system. \n\n###Gameplay  \nThe game has heavy local multiplayer focus. The Playroom VR consists of 5 minigames: Cat and Mouse, Ghost House, Monster Escape, Wanted and Robots Rescue.  \nIn Cat and Mouse, the player with VR is a cat, and TV players are mice. The mice’s goal is to collect pieces of cheese scattered across the kitchen floor without being noticed, while cat must catch the mice. The cat can only notice mice when they are moving. \nGhost House is a cooperative minigame where players clear a haunted house from ghosts. The VR Player has a vacuum cleaner that sucks ghosts in and can scan parts of the room to find them. However, only TV players can see the ghost so they must explain the ghost hunter their placement.  \nIn Monster Escape the VR player takes a role of a giant sea monster that must hit other players running from them. The monster has to smash buildings and helicopters to do so. The game’s noticeable feature is that everything monster player says goes through speakers in a high-pitched voice.  \nIn Wanted the VR player is a sheriff that must shoot. But the only player now how bandits look like so they must describe them to the sheriff as fast as possible. \nRobots Rescue is a 3D platformer in which VR must save robots completing platforming sequences while TV players create winds that help reach certain places and solve puzzles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":270721,"name":"Carto","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/815/815087cd6bdf4792075031e469b8f1d0.jpg","description":"Carto is a stunning puzzle game where you play a lost child, wandering around an even-changing island you create as you play.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sunhead Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":28074,"name":"Car Mechanic Simulator 2018","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c10/c1011b2c67eacad7c6e42276bb34fc43.jpg","description":"The Bestselling Car Mechanic Simulator series goes to a new level!\nCar Mechanic Simulator 2018 challenges players to repair, paint, tune and drive cars.\nFind classic, unique cars in the new Barn Find module and Junkyard module. You can even add your self-made car in the Car Editor.\nBuild and expand your repair service empire in this incredibly detailed and highly realistic simulation game, where attention to car detail is astonishing.\nAll this with new, photorealistic graphics. Featuring more cars (40+), more tools (10+), more options and more parts (1000+) than ever before. It’s time to roll up your sleeves and get to work!\nCar Mechanic Simulator 2018 also includes car auctions where old cars are available for resale or purchased for your collection. With the inclusion of photo-mode, you can take stunning before and after photos, and the game’s infinite number of randomly generated missions will keep you more than busy (and dirty).\nEach mission offers its own unique challenge of varying difficulty and time constraints to meet. If additional and extra tools are needed, they available for purchase. You can eventually upgrade your garage to include specific equipment such as lacquer sprayer or a parts warehouse.\nFeatures of Car Mechanic Simulator 2018:\nphotorealistic graphics\n40+ cars to get your hands dirty with\n10+ tools to help you check out cars\n1000+ parts waiting for you\nstart from a small workshop and upgrade it to a full sized 3-lifter gem\nmix of randomly generated jobs to fulfill\nendless gameplay\nmultilevel car parking in which you can store you cars\nAdvanced Upgrades System (level up and spend your points to upgrades)\nPath Test to test car suspension\nTest Track to test car condition (or just fool around)\nRace Track to test car performance\nCar Auctions where you can compete with other bidders and try to outbid them\nCar Paint Shop with different paint types and car liveries (or you can just paint one part to save money)\nBarn Finds, where you search for abandoned cars in barns - make sure to look there for parts\nJunkyard (scavenge for parts and rusty cars)\nCar Editor for modders (add your cars to the game!)\nNew Features since CMS 2015:\nseats, steering wheels and benches are exchangeable\ncar windows are now parts too\nnew repair system (smarter way to repair parts)\nparts warehouse (you can store your parts in a warehouse now)\nsheds (Barn Find module)\nseparated tires and rims (you can place any tire and rim you want)\nnew working shock absorber tool\nnew working battery charger\nnew working wheel balancer and changer\nrace track (next to test track, there is a race track with a timer)\nnew physics system (much more complex)\ncar liveries (you can apply liveries to your car)\nredone paint system (you can paint each part separately, choose the paint type: matt, metallic, pearl)\nmodding support from day 1 (place your own cars in the game)\ncustomizable license plates (with modding support)\ncustomizable game music (with user music)\nengine crane (tired of lifting your car up and down to disassemble engine)\ncreating new engines on the crane (starting from scratch)\nleveling system (XP with upgrades)\nnew car salon (you can buy brand new cars)\nliquids in car\nstory orders (pregenerated like in CMS 2014) next to generated orders (like in CMS 2015)\nall new UI and easier controls (with rebind)\npad support\n... and much, much more\nOfficial licensed brands coming up in DLC's:\nMercedes\nMaserati\nDeLorean\nPagani\nBentley\nDodge\nPlymouth\nChrysler\nJeep\nRam\nLotus\nMazda\n... and more","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Red Dot Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox Series S/X"}]}]