[{"id":4048,"name":"ANARCHY REIGNS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccd/ccd8eac9a5e29698faeccf5c5a08fed2.jpg","description":"Set in the post-apocalyptic future, this is an over-the-top close combat fighting game, set in a massively open and fantastical world. Pick from an imaginative mix of human and cyborg characters and set out on a multiplayer challenge where anarchy reigns.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Platinum Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3999,"name":"Quell Memento","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a16/a16a09e5e99d568237b7c9a3957ef637.jpg","description":"Quell Memento is an enchanting puzzle game of logic and relaxation.\nThe third and most ambitious instalment of the haunting Quell games, Memento takes the concept to an even deeper level with an engrossing array of new game-play elements.\nFeaturing a breath-taking score by acclaimed composer Steven Cravis, a voice-over narration and beautiful visuals, Quell Memento leads you on an enchanting journey of discovery and nostalgia.\nThe beating heart of the game - the puzzles themselves - are once again perfectly balanced to keep the player enthralled, but never frustrated.\nLike it's two predecessors, Quell Memento is a haunting experience that will stay with you long after you've finished it.\nFall in love with Quell Memento...","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Fallen Tree Games","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":3448,"name":"Motorcycle Club","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c2/8c2ca28620910bfaefe5ffc1b455d071.jpg","description":"THE RIDE OF YOUR LIFE\nRide 22 motorcycles with the official BMW, Honda, Kawasaki, KTM, Suzuki and Yamaha licences.\nFrom 125 to 2000cc, find all of the biggest makes, faithfully reproduced with 3 unique ways to play: Superbike, Roadster and Custom.\nHit the road in Tournament mode and take on over 40 challenges of skill on 20 different circuits.\nCustomize your riders and challenge rival clubs in solo mode or in wild online games with up to 4 players.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":3263,"name":"Deception IV: The Nightmare Princess","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e2/7e2579ac776c280ee1773ffad4516466.jpg","description":"Unleash your inner evil! The Nightmare Princess, Velguirie, uses her kicks and spins in her own quest to revive the Devil by trapping humans. Set over 180 traps in a variety of locales, including all new modern stages!\n- New stages: gym, hospital, and park!\n- New Quest Mode: Discover the story of Velguirie, the Nightmare Princess\n- Enemy Edit to create your own sacrifices\n- All of the content of Deception IV: Blood Ties\n...and more!\n*Traps, abilities, and costumes acquired in Deception IV: Blood Ties can be carried over to Deception IV: The Nightmare Princess.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1 player\n24MB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nDeception IV: The Nightmare Princess ©2015 KOEI TECMO GAMES CO., LTD.  Deception, The Nightmare Princess and the TECMO logo are trademarks or registered trademarks of KOEI TECMO GAMES CO., LTD. The KT logo is a registered trademark of KOEI TECMO HOLDINGS CO., LTD. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":3156,"name":"Persona 4: Dancing All Night","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74f/74f9ef6926be847d7de2b71413691a92.jpg","description":"Welcome to the Midnight Stage!  The music is starting up, so get ready to boogie with the Persona 4 crew in their newest adventure!\nPeople are disappearing after watching a strange video that showed up on the internet. Members of Kanamin Kitchen, Rise’s junior idol group, are among the missing and it’s up to the Investigation Team to set out on a rescue mission! Things are not what they appear, as they discover that the Shadows from the Midnight Channel are involved.  Their Persona abilities are useless, however, as the Shadows in Persona 4: Dancing All Night can only be defeated by dance.  Jive, tango, and pop out powerful dance moves to save the day!\nWill you waltz your way through the levels, or will you miss a beat and end up in defeat? Persona 4: Dancing All Night features mixes of fan-favorite themes and brand new music tracks that you’ll be able to tap to.  Music, rhythm, and motion combine to test your skills in a disco-fueled dance battle!  So tune in, turn on, and GET DOWN!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"P Studio","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":485188,"name":"Surviv.io - Battle Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a4a/a4a7ce16b1090037bddbd3dad1c875ae.jpg","description":"OFFICIAL SURVIV.IO ON STEAM - The same, full surviv.io experience you know from your desktop browser. Every feature and every update completely in-sync between PC, desktop, and mobile.\n2D BATTLE ROYALE - It's Battle Royale packed into an intense 3-5 minute experience. No lobbies, no lengthy drop sequences. In surviv.io, you're always in the fight!\nRANDOM MAP GENERATION - Tired of looting the same set of static locations every game? surviv.io features something no other Battle Royale offers: a completely new map in each game. Every rock, tree, building, bunker, and river spawns in a randomly chosen place using our intelligent map generation tech.\nSOLO/DUO/SQUAD - Choose the mode that fits your mood. Go it alone in solo mode, battle with a partner in duos, or field a four-person team in squads.\nLOOT FOR DAYS - Loot, loot everywhere. Famous firearms, melee weapons, throwables, medical items, armor, scopes, and backpacks to hold it all. Raid an air drop to get the rarest loot!\nCONSTANTLY EVOLVING - The surviv.io dev team is dedicated to keeping the game fresh and exciting. We believe in frequent updates and open communication with the community. Join us on Discord and say hello!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Kongregate","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":379456,"name":"Model Builder","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72d/72d140ab7ee76560d37b6936d9fbdb43.jpg","description":"The huge experience, that both sides have, enabled Kuba Wójcik - the originator - to team up with Moonlit - the developer and publisher - to create Model Builder, am exceptional, one of a kind simulator.\nModel Builder brings the joy of, well… model building, to the virtual world. It allows you to build model machines just like you would in reality, by cutting out, assembling, and then painting and customizing your creations. Fill your shelves with cars, planes, helicopters and tanks from various countries and eras, display them in dioramas to add a bit of shine and tell your own story. Sell your creations for-profit and expand your toolkit or simply let the works you're proud to be displayed on your Shelf of Glory.\nThe game offers a wide variety of tools and models to choose from, as well as tons of paint colours and decals, that will make the assembled models truly your own. You are bound to have weeks upon weeks of creative fun - and meanwhile, your relatives won’t be able to complain that you fill every bit of free space with plastic toys that smell of glue and paint. Building models in virtual space has never been so fun!\nNot everyone gets to be an engineer… but everyone can build impressive machines! Get the model you always wanted to build, cut it out, glue the pieces (be careful not to use too much glue though!) and polish the model to perfection.\nIs assembly done? Does your model look solid? Time to make it look amazing. Up until this point, you followed a plan. Now it's time to unleash your creativity and make your creation look the way you wish it to. Add paint jobs and small details that will make the model your own. There's a ton of customization options for you to use and discover - making them work is up to you. Your creativity is the limit.\nYou might be already proud of your work, but there is still something to be done: create a story. Arrange your model (or models!) in a diorama, to make it look threatening, powerful, or simply impressive - it's your call.\nYou have a variety of tools at your disposal - everything you need to assemble your models and make them shine. If you need more specialized tools, there is some stuff to unlock too - as your workshop fills with mighty machines, you will also get new toys to help with precision work and finishes. You will feel like a pro in no time.\nThere's plenty to choose from in terms of what you can assemble… and once you are done, there's a ton more to unlock. Expect dozens of hours of fun and much more in post-release updates.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Moonlit","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":327237,"name":"Contra Rogue Corps","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e82/e8232ded11168f0a5f2c4982a1d09be5.jpg","description":"This will be a brand new release of CONTRA, a well-known and long-running IP series since the 1980s. \n\n\n\nThere are 5 main protagonists in this game, who are all members of the mercenary called Rogue Corps. \n\nThey were all once a hero during the humanity-alien war, but were falsely accused of president assassination when the war ended. \n\nAfter escaping from the military prison, they were living at underground society as a mercenary, while also fighting to find evidence of their innocence and regain honor.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":279621,"name":"Taptiles","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28e/28eef583bcd2852add527d021416f6e0.jpg","description":"Find pairs of tiles to complete puzzles in this exciting matching game with a unique twist! When you can’t find a match, just rotate the 3D puzzle to view the other side! Taptiles® includes three game modes, countless puzzles, and Daily Challenges.\nDash Mode\nClear tiles quickly in Dash mode to earn extra time. How many puzzles can you clear before the time runs out? Match quickly to earn special bonus tiles with game-changing effects, like the Wild Tile, Gem Tile, and Time Tile. Dash mode's short, simple puzzles are perfect for a quick round of exciting gameplay.\nOrigins Mode\nPlay Origins mode for a new kind of puzzle game. Origins mode includes larger, more challenging puzzles and a more relaxed time limit. Think through each brain-teaser and complete the level before time runs out to advance.\nRelaxation Mode\nThis untimed mode is perfect for players who want a calming puzzle experience without the pressure of a ticking clock. Take a break and unwind with a puzzle in Relaxation mode!\nDaily Challenges\nPlayers receive new Challenges every day. Daily Challenges include a wide variety of twists on the basic game. Try Challenges like Color Charge or Tap Tower and see what we mean!\nBeautiful Graphics and Sound\nPlay Taptiles and transport yourself to a mysterious world filled with cube-shaped tiles and puzzles only you can solve. Relax in peaceful gardens and vibrant landscapes that come to life with gorgeous graphics and effects.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Arkadium","platforms":[{"id":0,"name":"PC"}]},{"id":236716,"name":"Deadside","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9b/d9bc7e4243bdda9fce00bcdea7c340f5.jpg","description":"ABOUT THIS GAME\nDeadside is a hardcore multiplayer shooter with large open world and wide gameplay possibilities. Deadside gets you into realistic game environment full of hopelessness and despair. It tries to keep balance between the dynamics of the shooter game and the hardcoreness of “survival” gameplay. The world of the game does not imply the existence of fantastic elements like zombies or anomalies, concentrating the player's attention on realistic aspects of life on the ruins of the dead civilization.\nDEADSIDE WORLD\nThe world of Deadside is vast open spaces full of bushy forests and abandoned settlements. Players will have an area of ​​about 225 sq.km., entangled by a network of roads and rivers. To explore such a vast space, both land and water transport are useful - and Deadside offers you to drive them. It also will need to be fueled and repaired. In addition to players, the game world is inhabited by various hostile and friendly NPCs. Going through the forest, you can face a gang of cannibals just about to eat lunch. Or a group of wanderers trying to survive in a hostile environment. The results of these meetings are completely dependent on your decisions and ability to get those decisions to live. Or death.\nTRADE and “GREEN ZONES”\nAmong endless vast wastelands a wanderer will find places where they can buy bullets, food and chit-chat to the damned victims about life, the universe and everything. Maybe swap a story or two about hunting cannibals. Also, there are private lockers for players in Green Zones where they can keep a limited number of things they use for surviving. Green Zones will be places of trade and communication between players and friendly NPC traders.\nBATTLE SYSTEM\nTo protect their interests or piss off the other players, about 15 types of firearms and additional equipment (sights, flashlights, etc.) will be available (at the time of early access).\nDeadside introduces you the realistic ballistics system for small arms, including penetration of various material. When bullet penetrates, for example, the wall of a wooden shed, it will deviate from the original trajectory and will loss its speed as well. The length of the path of the bullet through the material also matter - the bullet entered obstacle with acute angle will lose much more of its energy and may even be stuck within the obstacle. When damaging human or animal, the actual amount of damage will depend on the body part hit and the keenetic energy of the bullet at the moment of hit. Also, shotgun fans will appreciate that every pellet shot out of the barrel will move along an individual trajectory, providing more realistic shotgun shooting.\nMISSIONS\nIt's a big world and in order to avoid getting lost and to keep them busy, players can use the map to see where in the world armed bandits are raiding, areas being cleared by security forces remains loyal to the ex-government or cannibals settling in abandoned villages. Anyone can take part in mass combat. It will not be an event with a limited number of players, anyone who wishes can go to the mission sector and affect the outcome of the battle. Battles with participation of NPC and players can continue for hours but the reward will go to the one who can seize the prize loot after the hostile NPC are killed and the opponents represented by real life players are neutralized.\nBUILDING and STASHES\nIn the course of our game development we are planning to create a system of shelters which players will be able to build on their own using a well developed craft system. It is, however, a subject for later discussion.\nWe also want to offer players the chance to make small stashes in almost any place of the world to keep a few handy things at the ready. The number of such stashes for one player will be limited.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Bad Pixel","platforms":[{"id":0,"name":"PC"}]},{"id":63507,"name":"Robin","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7b/d7bb5f33aa8e226dab67e346964851d0.jpg","description":"WHAT IS ROBIN?\nRobin is a free  short slice of life vignette that was made to give some visibility to an invisible illness - Chronic Fatigue Syndrome (or myalgic encephalopathy). Live out three days in the life of Robin, a CFS sufferer, and try to manage your time as best you can. What you decide to do in these days is up to you, but know that there is never such a thing as a perfect ending.\nBuilt around the concept of spoon theory, Robin is a quick, relatable insight into the struggles of living with CFS/ME.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Isabelle Dela Torre","platforms":[{"id":0,"name":"PC"}]},{"id":58780,"name":"Prey - Mooncrash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b10/b1044612dd24a7b2a8682bc8b92984c4.jpg","description":"Fight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for Prey will offer a fun, infinitely replayable challenge to test even the most skilled players.\nStory:\nIn Prey: Mooncrash, TranStar’s secret moon base stopped transmitting shortly after the events of Prey. Now Peter, a hacker stationed aboard a spy satellite tasked with intercepting TranStar communications, must find out why. Trapped and under a ruthless contract with KASMA Corp, Peter’s only hope of ever seeing his family again is uncovering the moon base’s lost secrets.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Arkane Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":51418,"name":"The Mercury Man","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24a/24a7f0ef87dccdb8b9b95c9268a114dc.jpg","description":"The Mercury Man is a sci-fi game in the TRPG genre with adventure elements.\nIn this game you will be in the mercury hunter's shoes. \"Mercuries\" are people who have subjected themselves to an illegal medical procedure for the sake of curing all diseases.\nThe Mercury Man organically combines a staid point-and-click adventure and tactical fights, a thoughtful gameplay and a fascinating atmospheric plot.\nAs the events unfold, you will be able to gather a complete picture of gloomy world of the future.\n- A unique world from the Mehsoft team\n- Classic turn-based combat system\n- Stylish hand-drawn graphics\n- Original music\n- Breathtaking plot\n- Black humor, which skillfully fits into the dark and depressive mood of the game","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mehsoft","platforms":[{"id":0,"name":"PC"}]},{"id":51275,"name":"Six Days of Snow","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f7/6f769de4b82cdb5417ca6f9e5780a768.jpg","description":"In the dim and distant past, Tanabe Eiji was a promising young writer, well-known for his poem Fireworks, which detailed the beginnings of his youthful and idealistic romance with his wife, Sachiko.\nTwenty years later, however, Eiji's life has lost much of its shine. His poems, save for Fireworks, have fallen into obscurity, while his first (and last) novel was critically panned for being too depressing. Worse still, his relationship with his wife has started to stagnate.\nIn a desperate attempt to rekindle his lost creativity, Eiji embarks on a journey to the snowy mountains of Hakuba.\nDuring his six day stay at the Azami Inn, an old and lonely building in the middle of nowhere, Eiji meets the inn's proprietress, the stern and indomitable Miss Kakiuchi, and her unwordly daughter, Reiko.\nEiji isn't sure why, exactly, but something about Reiko catches his attention. Though he tries to resist, he finds himself drawn to her charms all the same.\nCould Reiko be his muse, who will inspire him to pen another masterpiece? Or will his obsession with her ruin the both of them?\n- Around 35,000 words\n- A kinetic storyline with no choices\n- Realistic and softly rendered character artwork\n- Beautiful backgrounds\n- An entirely custom soundtrack\n- An ornate and overwrought writing style","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"ebi-hime","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":50311,"name":"Descent 2 (1996)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/049/049ed144a3a0ddb483cf3554121db5b3.jpg","description":"Plunge through 30 more levels of Descent 2 as you battle highly intelligent robot enemies, including the evil thief bot, leaving their flaming hulks in your exhaust.\nDon't keep this feeling of nausea to yourself, go Head-to-Head with 2-player modem support or 8-player network and Tournament Mode. Brace yourself for the world of Descent... if you can handle it. Get them before they get you...Dynamic gameplay that is hard to match even by today’s standards\nA great musical score composed by artists such as Type O Negative and Skinny Puppy\nChallenging multiplayer modes","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Interplay Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"}]},{"id":49326,"name":"Animal Crossing: Pocket Camp","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ecb/ecb7dadba577411153ae1d59d0d5302d.jpg","description":"Get back to nature in Animal Crossing™: Pocket Camp, the new Animal\nCrossing mobile game where you take on the role of campsite manager!\n\nYou're in charge, so you can decorate your own campsite however you\nlike! Make it fun, make it cute, make it sporty—it’s up to you to craft\nthe kind of furniture and amenities that will make your camp a must-see\nfor animals visiting the area.\n\nBuilding Your Dream Campsite\n\nHelp Animals As You Explore!\n\nWhile visiting different recreational spots, you'll meet new animals who\ncould use a little help. They'll be looking for fish, fruit, bugs, and\nother things to get their camping adventures started—and when you help\nthem out, you'll earn Bells and craft materials in return!\n\nCraft Furniture and Amenities\n\nThe craft materials you earn by fulfilling animals’ requests can be used\nto craft all sorts of furniture and amenities for your campsite.\n\nJust open up the Craft menu and place an order with Cyrus, the\nhardworking handyman from Re-Tail on the Road. Then sit back and wait!\nOr, if you're in a hurry, you can move your order to the very front of\nthe line by using Leaf Tickets. You can purchase Leaf Tickets with real\nmoney, or earn them through regular gameplay.\n\nYour Campsite. Your Way.\n\nThe joy of Animal Crossing: Pocket Camp is creating a space that suits\nyou and your style.\n\nYour campsite can be anything you like—from a traditional space that\ncelebrates nature to a flashy fun house with concerts and rides. It's\nall up to you!\n\nYou can also customize your camper, visit your friends' campsites to get\nideas for your own, and meet new animal friends as you explore\nrecreational areas!\n\nHost Animals at Your Campsite\n\nAs you grow your friendships with different animals, they'll want to\nvisit your campsite. Craft and decorate with their favorite items, and\nyou’ll be able to host them whenever you like—even if you change up your\ndecorations completely!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nintendo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":46271,"name":"HIVE: Altenum Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7b/c7b186a242607c2101907d5c4118495a.jpg","description":"HIVE is a multiplayer hero shooter in 2.5D side scroll with futuristic style and frenetic gameplay. Up to 10 players will have to fight in Hexadiums, hexagon-shaped combat areas located inside the planet HIVE. Hexadiums are scenarios that are divided into 6 zones, each with its own gravity, and which have platforms and open spaces that turn it into a frenetic battlefield.\nIn HIVE, we assume the role of the best fighters of the different races that exist in the game: human military (UFG), human modified by alteno (NHC), robots (EVO), and evolved aliens (Aeons). Each Heroes has several skills and weapons that can be equipped before entering battle, to suit the style of play of each player and that make each game unique with the hundreds of combinations that you can have with the weapons and characters available.\nThe battles are governed by a series of rules according to their game mode:\nTEAM DEATHMATCH: A team fight in an industrial battlefield, aiming to obtain the highest number of enemy kills.\nKING OF THE HILL: Teams must conquer and defend one of three different strategic points scattered across the map.\nSURVIVAL: Offline or cooperative mode, in which the hero faces waves of enemies.\nMain features:\nHexagonal battlefield (dynamic gravity)\nFrenetic style mechanics (Dash, open spaces, low gravity)\nCustomisable abilities and weapons\nHero shooter, different unique classes\nlocal and online multiplayer\ne-Sports oriented, competitive feel\nSingle player mode: Survival","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Catness Game Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":38331,"name":"Space Rangers 2: Reboot","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/044/04442be91e1f50510b01afeffcb43fa8.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Katauri Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":32869,"name":"Daemonsgate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d4/0d4c9fc00c5a9ae3b37a06a8d5f0340d.jpg","description":"Daemonsgate is a fantasy role-playing game in which you play the role of a young hero who is the only hope left of saving the besieged city Tormis. It is surrounded by demonic hordes so it’s no easy task! The goal is to search the land of Hestor for a wise wizard possessing knowledge necessary to stop the invading demon army.\nYou start off all by yourself at the \"Pigge and Ballbearing\" inn located within the city. ou can converse with many non player characters, the innkeepers tend to be more knowledgeable - so they can be a valuable source of information.\nThere are a few minor subplots and distractions from the main task as your journey progresses. But the game is event driven so there is no passing task X before completing task Y first. The game uses three-quarters overhead perspective and boasts a conversation system with over 70,000 words.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Imagitec Design","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":23041,"name":"Anno 1602 A.D.","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70e/70ec9b7fe03d39ed3434f1133309db91.jpg","description":"A Whole New World!\nIt is the year 1602 and you find yourself in command of a sailing vessel, navigating the waters of the uncharted island world of Anker. You have aboard your ship no more than an handful of trusty followers and a limited supply of food and building materials. You are here to begin a new life. As you select which island to settle, your future is already sealed, for each one has its own special characteristics.\nYour goal is to create a whole new world. Explore, construct, settle, trade and defend - that is the challenge that lies before you!\nANNO 1602 A.D. takes you into the world of construction strategy games. Build a realistic, living world for yourself according to your own ideas; your chosen strategy will decide the development and destiny of your towns and villages. Prove your diplomatic skills in your dealings with natives, your comrades and pirates too. Start by building up farms, plantations and small workshops to produce, then use your business acumen and begin to generate trade with your fellow players.\nBut beware, for with riches and prosperity also comes envy and anger! Train soldiers and build defensive structures to protect your property and wealth, or perhaps it may be wise to put your negotiation skills to use outside of business?\nSo as you can see, there's plenty to do in the world of ANNO 1602 A.D. - exactly what is for you to decide.\nANNO 1602 A.D. includes Anno 1602: Creation of a New World and its expansion Anno 1602: New Islands, New Adventures.\nA unique blend of two exciting genres: part empire builder, part real time strategy\nDemanding scenarios each with differing difficulty levels\nMore than 30 different occupation types\nMore than 90 building types\nMore than 700 islands with unqiue, differing landscapes","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Max Design GesMBH","platforms":[{"id":0,"name":"PC"}]},{"id":21956,"name":"WWE SmackDown vs RAW 2011","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/852/8528442edabecbbb2030371ccc7d9bc7.jpg","description":"You've seen the Superstars' greatest moments on WWE programming. You've shared them and lived through them on television, on the web, and at the arenas. Now, it's time for you to define your ultimate WWE moment, with WWE Smackdown vs Raw 2011. The most interactive experience in WWE. This is your moment.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"THQ","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"}]},{"id":21597,"name":"The Fool","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14a/14a2e318a2142cc54212418d85f3bc86.jpg","description":"Who said that only brave knights on white stallions can become Heroes? Witness the incredible adventures of  a rustic Fool; travel with him to a fascinating world and help him save the beautiful princess Catherine from the jaws of a terrible dragon. A Hero lives in every one of us!  Journey to set your Hero free!\n–\tHelp the Fool defeat the beastly dragon.\n–\tVisit the land of zombies.\n–\tTravel to Steam City – the steampunk industrial center in decline.\n–\tUnveil a kingdom floating in the clouds and solve the mystery behind the UFO.\n–\tLocate dragon's lair and save princess Catherine.\n–\tBecome a Hero!\n–\tMany ingenious puzzles and subtle humor!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MagicIndie","platforms":[{"id":0,"name":"PC"}]},{"id":19831,"name":"Bitardia Cards: Memes of 2ch","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/039/039e27dd19c434cba640c78bbc9e65d8.jpg","description":"Bitardia Cards unites the games which are already fallen in love to you: card and original Bitardia which can be got in Steam: http://store.steampowered.com/app/405010\n2D cards represent heroes of the most popular Russian-speaking imageboard which is familiar to much.\nIn game there is a multiplayer giving you the chance to battle against other players.\nFurther game will be improved.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"varlamov5264","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18830,"name":"Wake Up","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/643/643ffe0c31aded73690a619753c1ac72.jpg","description":"Experience a shattered and surreal dream filled with fascinating riddles, where your only guide is an elusive butterfly.\nCan you make the journey and wake up?\nKey Features:\nDiverse riddles challenging the brain, eyes and ears.\nA unique atmosphere\nA handcrafted sound experience\nDesigned for VR and Motion Controllers explicitly\nWake up is a smaller game which will take between 20 and 40 minutes to complete, depending on the speed you are able to solve the riddles.\nABOUT BLACK CELL\nBlack Cell is a small independent team from Austria, venturing in the new and exciting world of Virtual Reality.\nWith Wake Up we have created our first game, exploring the limitations and possibilities of this new medium.\nThe goal is to create new experiences with a focus on a great mood, through the use of carefully created audio and visual design.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Black Cell OG","platforms":[{"id":0,"name":"PC"}]},{"id":17458,"name":"Koala Kids","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f38/f38cd046b9ce25700d00a45a99d63c3a.jpg","description":"Koala Kids is a puzzle-platformer game, in the style of retro games like Lode Runner.\nYou play as a Koala and need to save your captured friends from the evil hunters.\nPlay the Single Player campaign, or play with a friend in local hot-seat Coop!\nThere is also a level editor, for those brave enough to make their own levels!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Doomster Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16742,"name":"Delta Force: Xtreme","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30e/30e734795b0cbd2e4e034309fec96947.jpg","description":"Powered by today's gaming technology, Delta Force®: Xtreme™ brings the classic Delta Force game back to life to face the enemy once more. As a member of the elite Delta Force, prepare yourself to take on over 60 levels of frantic single and multiplayer FPS action, including graphically enhanced missions from the original game, new maps, improved game features, STATS and much more!\nFeatures\nOver 60 levels of combat to test your CQB and long range engagement skills as a Delta Force Operator.\nAs a member of the elite Delta Force re-deploy in over 20 graphically enhanced single player missions — the best of the best from the original game.\nAdditional new single player missions created especially for Delta Force®: Xtreme™ add a new challenge for hardened Delta Operators.\nTake your friends into battle in over 20 co-operative missions.\nOver 20 multiplayer levels include: Deathmatch, King of the Hill, Team King of the Hill, Team Deathmatch and Capture the Flag game modes.\nSTAT tracking — you can now see how good you are compared to every other Delta Force Operator out there and watch your rankings climb as your skills improve!\n","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"NovaLogic","platforms":[{"id":0,"name":"PC"}]},{"id":16590,"name":"My Bones","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b7/3b7f6cb6723fed150ccba1ef5f472076.jpg","description":"It is a short but very interesting horror,about a man who woke up in his own grave,next to his family.\nIn the past,he was a very bad man,he is confused and cannot make a choice between good and evil.\nOur goal is to help the protagonist to make a choise between good and evil.\nOnly you will be able to choose good or evil,and only you can decide his fate.\nThe game have multiple endings,or rather two,good and bad.The ending in the game will depend on your actions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GDNomad","platforms":[{"id":0,"name":"PC"}]},{"id":16018,"name":"Umineko When They Cry (Question Arc)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/722/722becac2f28505caab34063ad8f6739.jpg","description":"Welcome to the world of \"Umineko When They Cry\" (When Seagulls Cry)\nWelcome to the Rokkenjima of October 4, 1986.\nYou have been given a chance to catch a glimpse of the family conference held annually by the Ushiromiya family.\nThe remaining life in the old family head\nwho has built up a vast fortune is very slim.\nTo his children, the greatest point of contention at this family conference\nis the distribution of his inheritance.\nEveryone desires all that money, no one relents, and no one believes.\nWho will gain the old head's vast inheritance?\nWhere is the 10 tons of gold that the old head is said to have hidden?\nCan the unnerving riddle of the epitaph which is said to point to\nthe location of that gold be solved?\nIn the midst of this, a suspicious letter is sent from one claiming to be a witch.\nThe presence of a 19th person on this island,\nwhich should only have 18, begins to hang in the air.\nBrutal murders repeat, and unsolvable riddles are left at the scene.\nHow many will die? How many will live? Or will everyone die?\nIs the culprit one of the 18, or not?\nIs the culprit a \"human\", or a \"witch\"?\nPlease, enjoy this isolated island, western mansion,\nmystery-suspense gadget of the good old days to the fullest.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"07th Expansion","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15583,"name":"Paranormal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f74/f7447493f72541b3c1b1f1d645cb72c2.jpg","description":"Steam Greenlight\nAbout the GameExperience the horrors of a haunting that's never the same twice.\nParanormal is a 3D fully dynamic haunting experience. The player takes the role of Mattel Clarke, an artist who has a haunted house. Mattel decides to film the hauntings with his camera, which is the viewpoint of the game.The player controls the camera as the hauntings slowly but surely escalate into something far worse and more horrific.\nWith multiple endings, a different experience every time, top-notch graphics and sound, Paranormal is a constantly evolving indie horror game.FeaturesDynamic Haunting: I've designed the dynamic haunting system that will allow a randomized experience, adding multiple outcomes, dynamic triggers, countless variables, and an action-reaction system. This will make your experience with the game much more unique and memorable, without missing out on anything important.\nFree Content Updates: Paranormal will receive free content updates that add new locations, stories, scenarios, scares, gameplay mechanics, and more! You will NEVER have to pay for DLC in Paranormal. The game's content is planned to double or even triple with each major content update.\nSleep System: Sleeping in your bed recharges your camera's batteries and also has a chance of triggering other events.\nFlashlight (camera light): Creates a bright, short ranged light that casts dynamic shadows.\nInsane Sound Design: Paranormal was designed for surround sound and headphones to create the ultimate audio horror experience.\nFirst-Person Camera (Found-footage style): Much like in the movies 'Paranormal Activity' or 'The Blair Witch Project' (Not associated with those films, just inspired by them), the viewpoint will be that of a camera being held by a person (the player). Effects like camera shake, pixelation, video distortion, audio distortion, and motion blur will all be present thanks to the camera screen-space shader I built for everything.\nHorrific Story: Uncover the house's troubled and gruesome past through hauntings, journal entries from the previous owner, and more.\nSteam Trading Cards: Because one can never have enough of those things!\nMac Version: A Mac version is available and will receive updates alongside the PC version.Planned Future Features Achievements: Steam Achievements are planned for the game and there will be plenty to chase after!\nFull Controller Support: Work has already started on making the game fully gamepad-compatible.\nVR Support: Paranormal will receive Virtual Reality support, free to owners of the game.\nSteam Cloud Saves: For those who hop between machines.\nTranslations: The game's text is planned to be translated into German, Swedish, and Spanish. If your language isn't on that list, please request it in the forums.\nPersistence: Some sort of persistent scoring system is planned, adding more replay value.\nUnreal Engine 4 Remake: The entire game is in the process of being remade using Unreal Engine 4. This remake will be available as a free update to owners of the game.Posting Videos All users have full permission to post videos of Paranormal to websites, monetize them, edit them, etc. In fact, I encourage this. The only thing I ask (but don't require) is that you send me a link so I can watch it and share it! A healthy game community encourages shared experiences. If your video gets flagged by YouTube for copyrighted content, Tweet me and I'll do everything in my power to help clear it up--even if I have to call YouTube.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14776,"name":"Vindictive Drive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/161/1613115ee1468b8302b50609dbc260eb.jpg","description":"Vindictive Drive is a Thriller/Action game with cyberpunk elements and Real Time Action/Stealth mechanics following Arris Fern, a young woman in her cold blooded revenge against her father, the president of the most powerful nation, for the assassination of her mother 12 years ago.\nCompletely consumed by hatred and resentment, Arris will use the most cruel methods at her disposal to achieve her goal.Features:Vindictive Drive's \"battle system\" rely on outsmarting security systems, avoiding cameras, and fooling your enemies using your computer and jamming devices, leaving the pistol as last resort.\nStealth is an important part of the game, you will be able to disable alarms and create distractions.\nStory rich scenarios and suspense.\nTalkative and friendly NPCs.\nA lot of illustrations and animations made frame per frame.\nArris' very sour behavior.\nMultiple endings.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Balthasar02","platforms":[{"id":0,"name":"PC"}]},{"id":14715,"name":"Unalive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/281/2814dde882f8b7af64dcd0fc4460948d.jpg","description":"Science can be used for good or harm. A dark laboratory is hidden somewhere in a secret place. What kind of experiments were made there? Only god knows. You have become a victim of one of those terrible experiment. You shouldn't be alive, are you?\nUnalive is an action adventure roguelike game. Randomly generated laboratory rooms. Collect unique items to improve your abilities. Kill bosses and stay alive. You have only one chance!\nFeatures\nPermadeath\nRandom skill items\nRandom rooms\nRandom boss encounters\nDeadly traps","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"RandomSpin","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":14683,"name":"Super Comboman: Don't Mash Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21e/21eea91c89265b72e018ec74e5cdb46a.jpg","description":"Modern platforming action gets an extra helping of classic 2D fighting! Bust mad combos across 16 action-packed levels as Struggles, the comic book nerd with a sick arsenal of flashy moves. Action fans, fighting fans, and air combo fans...this one’s for you.Key Features:\tPhysics-based combat system inspired by fighting games\n15 unlockable Special Moves and Perks\nColorful sticker-based art style\n16+ stages to master\nEnvironmental combo-based puzzles\nDozens of stickers to collect and add to your virtual sticker book\nTraining mode to get those combos JUST right\nMullet-domed hero with a talking fanny pack","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Interabang Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12554,"name":"Wormhole City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/128/128b908731f6bfbc5fba3e9846153d37.jpg","description":"Through faster-than-light technology, nations strive to colonize the universe while diverging factions struggle for control and freedom throughout space. Control Space Force mercenary Acero Astra as you escort a spaceship convoy to safety in Wormhole City, a single-player sci-fi adventure game with combat and interaction elements developed in Unreal Engine 4 for PC. You must interact with characters, machines, and the environment to achieve your objectives and progress throughout the game.Game Features\nExplore a sci-fi setting with a cyberpunk twist.\nBattle numerous enemies in kinetic fashion with land and space vehicles.\nJourney to different locations as you fulfill Space Force missions.\nAuto-save system will help record your progress.\nYour actions may affect NPC interactions.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zenrok Studios","platforms":[{"id":0,"name":"PC"}]},{"id":12345,"name":"Lamp Head","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/216f32da89f4be88f4b5a43568e1a67a.jpg","description":"The protagonist of this game is a strange man with a lamp instead his head who needs to breach out of the darkened and dangerous odd place at whatever cost. Are you ready to prove that your reaction is outstanding, shunting between sharp barriers, collecting bonuses, remembering that in the end of every dark path the light of victory awaits?\nThe game was present on Poket Game Conference in Helsinki\non event Very Big INDIE Pitch! Top 1 in more than 20 countries on Windows Platform. Support this game and enjoy our indie game!\n* Get battery to light your way\n* Collect coins to save him!\n* Adorable sound effects\n* Challenge and help your friends!\n* Added more New Location,\n* Added more cute cartoon characters","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Oriplay","platforms":[{"id":0,"name":"PC"}]},{"id":12037,"name":"Freedom Locomotion VR","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d8/2d8b0c755dfedf80d97c6384290efa1b.jpg","description":"Walk, jog, run, climb and crawl across a range of locations and terrains in the Freedom Locomotion VR demo. This game showcases the revolutionary Freedom Locomotion System that provides you with a wide range of options, which will allow you to find the most immersive fit regardless of how motion sickness sensitive you might be.\nThe Freedom Locomotion System puts CAOTS (Controller Assisted On The Spot) at the front and center of the system. This is a form of walking in place locomotion solution where to move, you simply walk, jog or run on the spot, allowing you to walk, jog or run in VR. This also has the benefit of allowing you to traverse large open world VR spaces in an immersive manner while been less likely to get motion sick than traditional sliding VR locomotion solutions.\nFor those that prefer a less active solution, or are still susceptible to motion sickness even while walking on the spot, the system provides Dash and Blink steps that are derived from teleportation schemes that have been proven effective in not causing motion sickness.\nAny way you choose, you'll find that you can get around the various large scale environments in an immersive manner that helps you feel as though you were really there.\nThe primary goal of Freedom Locomotion VR is to provide a proof of concept demo to show that VR is very capable of taking advantage of immersive large scale environments along with many of the game play norms that we've become accustomed to in traditional games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Huge Robot","platforms":[{"id":0,"name":"PC"}]},{"id":10567,"name":"Quell","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c28/c286185afe8c18cf53f18516515af445.jpg","description":"Quell is an enchanting puzzle game of logic and relaxation.\nThe game-play is simple: slide a little water droplet around a window-pane, avoid the spikes and collect the pearls. Easy, right?\nAbsolutely, but the beauty of Quell is in the perfectly pitched difficulty curve - it's just taxing enough to test your powers of logic, but never so much so that it stops being fun. The gentle music (by acclaimed composer Steven Cravis) and ambience create the perfect setting to allow your brain to engage fully with these ingenious puzzles.\nIf you're willing to dig deeper still, there's a side narrative which tells a touching story of love, loss and nostalgia. Either way, Quell is a haunting experience that will stay with you long after you've finished it.\nFall in love with Quell...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fallen Tree Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":10063,"name":"The Infectious Madness of Doctor Dekker","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5d/c5d51f8d1f00d8c6c9ab7a4bc056e51c.jpg","description":"YOU are a psychiatrist, trying to solve a murder whilst treating the unusual patients of the recently deceased Doctor Dekker - but nothing is as it seems.\nType any question - and your patients will reply in full screen video.\nThey'll have questions for you too but be careful what you say. Your words will determine their eventual fates, and your own!MAIN FEATURESFMV! - 1600+ full screen HD video responses\nFREE TEXT INPUT - Ask whatever you want, type questions, phrases or just keywords.\nMULTIPLE ENDINGS - Find out whodunit, and what happens to you and your patients...\nMULTIPLE STORIES - 6 main suspects and 5 side-quests inc. John Guilor (Contradiction)\nRANDOM MURDERER - Chosen at the start of the game to combat spoilers\nSIMPLE UI - View evidence, make notes, watch replays, see your question history\nACHIEVEMENTS - Steam achievements and a dynamic descriptive rating system\nWARNING - This game contains mature themes and psychological horror (including sexual themes, violence and suicide) and by its very nature is open to wide interpretation - so although not originally intended, some topics such as rape and parricide can also be inferred. Recommended for adults only.FULL DETAILSThe Infectious Madness of Doctor Dekker is a Lovecraftian FMV murder mystery, which gives players full freedom to question suspects by typing their own questions instead of picking them from a predetermined list. There are no point and click puzzles to solve, just questions to ask and evidence to inspect.\nFinding out who killed Dr Dekker is only one part of the puzzle; working out how to fix the chaos he left behind will be so much trickier… As well as providing clues to the murder, each patient has their own bizarre problem they need your help with – from time manipulation and re-animated loved ones to horrors under the sea.\nComplete with an atmospheric soundtrack, The Infectious Madness of Doctor Dekker invites you to explore the shadow reality that your patients inhabit – a world full of paranormal strangeness and horrors that go bump in your head, where all you have to rely on is your own mind.\nJust try not to lose it...CREDITSYou.............................The Doctor\nAislinn De’Ath..................Marianna\nBianca Beckles-Rose........Jaya\nDom Lister......................Nathan\nHelen Jenkinson..............Elin\nHelga Ragnars................Claire\nMillin Thomas..................Bryce\nMark Kitto.......................Professor Alderby\nand guest starring John Guilor as Professor Warwick.\nAdditional patients played by ...\nCarolyn English, Catherine Stacey, John Shields and Rosie Hefferon.\nDirected by Tim Cowles.FAQHow do you progress through the game?You play through a series of five therapy sessions. Each session you'll talk to several patients, and traffic lights tell you which patients you've unlocked so you can move on. Yellow is unlocked, but you can keep talking to reach green and find all their possible responses. On the final accusation screen you choose whodunit and if you've picked correctly the game finishes and plays your ending videos. Automatic saves mean there's no way to rollback something you've said to a patient, so be careful with that. That's it in a nutshell, but we can't tell you everything, or there'd be no surprises...What happens if I ask a question they don't have an answer for?As long-time fans of FMV games and point-and-click adventures, we're all-too familiar with the 'That's not gonna work' or 'I think I'll have to try that again' phrases repeated over and over. That's why we've given the patients lots of different ways of saying \"I don't know\" - most have over 40 in fact, including some that contain clues that lead you to new storylines.Is this game an AI simulator?No. A lot of the time you might get \"don't know\" answers to your questions, because there are only 1600+ actual filmed responses in the game. Listen to what patients say and follow their lines of conversation to stay on track. Responses are keyword based, so literally typing words patients have already used will do half the job for you.How many acts are there?There are five acts in total. Each act is a self-contained episode, so it's possible to ask questions (and get responses) in any order to reveal the story. Some decisions you make will affect future acts, so once you hit the continue button there's no going back!What if I get stuck?We've tried to design the game so you don't get stuck, but if you do, just type 'Hint'. Think of it as asking for advice, and you'll need a lot of it if you're trying to find every response (aka going green). Make sure you've properly watched the help video too.If the murderer is chosen at random, does that mean it's replayable?The game can be replayed, but it wasn't designed with that in mind. We wanted everyone to be able to experience as much of the game as possible without needing multiple plays, so branching generally removes just a few responses at a time. That said, you will have to replay the game if you want to find *all* the videos and unlock all the achievements and endings.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Wales Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9703,"name":"Descent: Underground","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03d/03d1000c3f23b28acd43fbeb4872ae9f.jpg","description":"A true first person shooter deserves all six degrees of freedom. Fight through twisting tunnels & vast caverns where the concepts of up and down mean nothing and danger lurks around every corner. This is Descent: Underground!\nWe’re blasting the full-freedom shooter Descent into the 21st Century with next-generation gaming technology built on Unreal Engine 4!\nDescent: Underground is a both a prequel to the Descent series and a modernization of the original game play. We’re staying true to the original flight mechanics, arcade style combat, and tightly twisting map design while taking it to the next level!\nOur vision for Descent: Underground includes:\nMultiplayer shooter action in a full six degrees of freedom\nA variety of customizable ships and roles suit every play style\nIndividual and team game modes for multiplayer\nCommunity-driven development w/ weekly video streams\nMine for resources, power-ups, and to locate hidden tunnels\nProve your prowess with rankings, achievements, and leaderboards\nSingleplayer storyline missions","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Descendent Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":5477,"name":"Twisted Metal 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d62/d62e9a590eef5ce07d4358be3854ae00.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\nIt's a whole new world to blow away with new cars, new battlegrounds, and new killer combat! This time the competition has gone global, to the roofs of New York, the open fields of Holland, and deep inside the winding subways of Hong Kong. Nothing can stop you from destroying your opponents and fulfilling your dreams!\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 323 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers: Log into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation® Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\nTwisted Metal is a registered trademark and its characters are trademarks of Sony Computer Entertainment America Inc. © 1996 Sony Interactive Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":4118,"name":"Persona 2: Eternal Punishment","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be9/be91ffd68268a5514b119a62170686be.jpg","description":"What is reality...?\nReality is just a series of events and players acting out what you believe is real.\nWhen we accept that fact, then our world becomes “reality.”\nEnter Maya Amano, an up-and-coming editor for a popular teen magazine.  This has been her dream for as long as she can remember.  Everything was going great until a young man named Tatsuya Suou stepped into her life...  Maya knows that she has never met him, but in her heart she knows him from somewhere, a déjà vu of sorts.\nOne day she is assigned to collect information on the rumor of the Joker Curse and its connection to the recent spree of serial murders that have rocked the city.  Her investigations eventually lead her to Seven Sisters High School, and what’s waiting for her is an ambush by the rumored devilish murderer, Joker, a reunion with the “Déjà Vu Boy” who saves her, and the arising of different personalities called Persona…","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation"}]}]