[{"id":9422,"name":"Five Nights at Freddy's 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e2/7e24e18e7584154d44c11db44b5c6b0a.jpeg","description":"Thirty years after Freddy Fazbear's Pizza closed it's doors, the events that took place there have become nothing more than a rumor and a childhood memory, but the owners of \"Fazbear's Fright: The Horror Attraction\" are determined to revive the legend and make the experience as authentic as possible for patrons, going to great lengths to find anything that might have survived decades of neglect and ruin.\nAt first there were only empty shells, a hand, a hook, an old paper-plate doll, but then a remarkable discovery was made...\nThe attraction now has one animatronic.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":1816,"name":"The King of Fighters XIV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/568/568814fe41848c8885d2d9a423765c2e.jpg","description":"The world-famous “KOF” VS Fighting Game series marks its return in a new chapter on PlayStation®4 with 'THE KING OF FIGHTERS XIV'. A total of 50 characters are ready to duke it out in KOF's traditional 3-on-3 team versus battle system. 'THE KING OF FIGHTERS XIV' offers a large variety of user friendly game modes, refined online features, as well as an epic storyline for the best 'KOF' experience ever on PlayStation®4!\n1-2 players\nNetwork Players 2-12\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© ATLUS. © SEGA. All rights reserved.\n© SNK PLAYMORE CORPORATION ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":58816,"name":"Trover Saves the Universe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4f0/4f0a6bc83b7c9f938fb5692b897a8064.jpg","description":"Introducing Squanch Games’ first full-length sci-fi action comedy adventure, coming to PS4 and PSVR: Trover Saves the Universe.\r\nWonderful. Your dogs have been dognapped by a beaked lunatic who stuffed them into his eye holes and is using their life essence to destroy the universe. Does that make any sense? You’ve partnered with Trover, a little purple eye hole monster to save them. Find power babies and plug them into his eye holes so that he can absorb their power, track down Glorkon, and save your dogs (and the Universe).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Squanch Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":20123,"name":"Calcu-Late","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbf/cbf1c58341582f0f33d54dcc7ad74b57.jpg","description":"The game is made up of stages, with a puzzle on each stage and story cut-scenes in between. The game has auto-save feature in each stage so if you failed in a certain puzzle, you can try again by clicking continue.\nOn every stage there will be a trial phase and a battle phase. In the trial phase, the player will be given a puzzle that can be solved alone by thinking or calculating. In the next phase, which is the battle phase, the player will have a match against the AI. Battles require concentration and patience.\nCalcu-Late was developed by Blazing Fanfish and is being published by Back To Basics Gaming.\nwww.BackToBasicsGaming.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blazing Fanfish","platforms":[{"id":0,"name":"PC"}]},{"id":11134,"name":"Dungeon Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14c/14c3dc4bdcda923b1e76af4c3f916f99_BcfvT2S.jpg","description":"Dungeon Souls is an action-adventure roguelike dungeon crawler.\nEach level is completely procedurally generated so every playthrough is guaranteed to have unique environments and encounters. Search for and activate all the marks placed in each level to unlock the dungeon portal and escape from the Redeemer. Scavenge various items and upgrades to counter the dungeon's dark forces and challenging bosses. You must survive. Hurry.\nDungeon Souls was inspired by Nuclear Throne, Risk of Rain, Overture, BitVenture and Shoot First.\nHarness the powerful abilities of 10 unique characters\nExplore a plethora of different environments including dark dungeons, sewers and cathedrals\nImmerse yourself with deep character progression and permanent skill upgrades\nExperiment with 50+ unique passive items - Speed boosts, damage buffs, lifesteal bonuses...\nBattle hordes of dynamic enemies and challenging bosses hell-bent on destroying you","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lamina Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":292817,"name":"Oddworld: Soulstorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/399/3992a9f92ea0387a839e70a22a26ec34.jpg","description":"\"Witness Abe's horrifying conflict with a terrifying new machination in this fresh narrative adventure.\n \nOddworld Soulstorm represents a big visual and cinematic leap aiming that breaks new ground for Oddworld. With intelligent new mechanics and twisted new devices which enable highly explosive deviousness. This is a dark parable that tells an epic tale of a volatile society pushed to its limits.\"","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Oddworld Inhabitants","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":61332,"name":"World of Horror","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b75/b75b3ef16edf5bbce3160ca337efeef2.jpg","description":"The Old Gods are reawakening, clawing their way back into a world that’s spiraling into a mysterious madness. In a small, seaside town of Japan, the population’s sanity is dwindling and otherworldly, grotesque creatures terrorize those who call the place home. In WORLD OF HORROR, it’s the end of the world and the only solution is to confront the terror reigning over the apocalypse.\nNavigate this hellish, roguelite reality through turn-based combat and unforgiving choices in this cosmic horror RPG. Experiment with the events of a playthrough by building a deck of event cards to discover different outcomes for your battles against the darkness. Different decks may even unlock new mysteries or clues.\nWORLD OF HORROR features branching stories with five playable characters to brave the chaos, each with their own story and a different perspective on the events that unfold. Unravel puzzles and mysteries through spells that sacrifice sanity. Uncover disturbing and shocking clues. Diligently search every nook and cranny, scouring for helpful items that may come in handy in another twisted encounter.\nExperience the quiet horror of this love letter to the works of Junji Ito and H.P. Lovecraft. WORLD OF HORROR is free of typical jump scares, relying solely on its unnerving environments and amorphous terrors to create a gnawing sense of dread. Complimented by haunting chiptunes and a 1-bit art style with a variety of available palettes, WORLD OF HORROR presents a series of frightening and unsettling accounts that linger well after stepping away.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"panstasz","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":41457,"name":"Endless Space","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ba/2ba66566cc1d907976237bb98c4d0379.jpg","description":"Endless Space is like Civilization set in space: a turn-based 4X global strategy in the vein of Master of Orion. The player assumes control over a powerful galactic empire, either by choosing one of the existing factions with its predefined attributes or by customizing all attributes from scratch. There are eight playable sci-fi civilizations that vary from different types of humans to sentient birds and amoebas. \nThe gameplay lets you explore the randomly generated galaxy, colonize planets, discover technologies, build starfleets and fight the other civilizations for control over star systems. You can conquer the galaxy by force, however, as in Civilization, there are other types of victory that can be achieved, including Economic and Diplomatic. The combat system is unusual and uses a card based mechanic: both sides play their virtual “cards”, and the animated ships re-enact the result. There are also heroes, the special units that can serve as military commanders or civilian leaders and improve a certain sphere under their influence. The maps allow up to eight players, who can be AI-controlled opponents, actual players in the multiplayer mode, or both.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Amplitude Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20032,"name":"Teddy Floppy Ear - Mountain Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/069/069e253bbd7a21121cc2c69f3e4e8d1a.jpg","description":"Send your kid onto an unforgettable journey with the world’s most charming bear!\nBased on a famous Polish cartoon, Teddy Floppy Ear stands out as a great entertainment for our younglings. Prepared by an experienced team, Teddy Floppy Ear – Mountain Adventure mixes entertaining adventure game with a healthy dose of learning. In this episode our main character goes onto an extended visit to his uncle, a painter, who's living deep in the mountains. There he goes on a field trip on which he learns basics of art, color mixing, shape recognition and many more. During these travels he solves numerous mini-games to keep him entertained. Beautiful hand-painted graphics, soothing music, entertaining and violence free story will keep your child occupied for hours.\nFeatures:\n- A dozen of colorful locations\n- Educational value\n- Great for even the youngest kids\n- Absolutely no violence\n- Numerous mini-games for variety\n- Soothing music\n- Famous Teddy Floppy Ear\nBecause the game is intended for young children, parental help may be advised.\nWe prepared a game walkthrough.\nhttp://teddyfloppyear.forever-entertainment.com/games/mountain-adventure/mtadv-walkthrough/","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":19929,"name":"Fish Fillets 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f2/1f253fe675ffe416304d367dad693041.jpg","description":"In this underwater puzzle game you control fish secret agents Max Flounder and Tina Guppy.\nSeemingly a common case turns into a tough fight with a mysterious enemy and the strings appear to lead pretty high. Fortunately, you are not alone. Cool crab brothers, a retired agentess, lost baby seahorse and peculiar pair of snails - all of them will join you to help you to discover the evil one. You will need all your wits if you want to win!Key features:\t\t\t\t\t\tUnlimited gameplay\n100+ mind-boggling levels based on simple, yet interesting mechanics.\nFunny story told by animated sequences.\n3,000+ professionally dubbed comments and dialogs.\nLots of bonus stuff to be found and unlocked by the player.\nThree unique playable characters: agents Tina and Max + crab Virgil.\nDozens hours of gameplay for whole family!\nBest solution challenge at www.fish-fillets.com.\nSend your score to internet chart and compare to other players.\nIncludes Level Editor - allows fans to create new mission and campaigns that can be used in the game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Altar Games","platforms":[{"id":0,"name":"PC"}]},{"id":13639,"name":"Neon Drive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/110/1104ee9c109842f0d02faf74ba2a9927.jpg","description":"Neon Drive is a slick retro-futuristic arcade game that will make your brain melt. You've been warned.\nFrom beautiful cityscapes and ocean roads to exploding enemy spaceships, Neon Drive has it all. It's inspired by the arcade games of the 80's, but set against a futuristic backdrop of glowing cyber-grid, all in silky-smooth graphics. Neon Drive brings you 7 amazing levels, adding up to hours of enjoyment. Each level features multiple twists and perspective changes, keeping you on your toes (err, wheels) throughout the gameplay.\nNeon Drive will put your mad dodging skills to a real test, mercilessly pushing the limits of your reaction time and short-term memory to avoid obstacles and dead-ends. Seriously, this game is wicked; just when you think you've got the hang of it, it turns the table on you.\nEach level of the game comes with a custom-made retro music track, perfectly tuned and in sync with the roadblocks and your enemies. This allows you to just follow the beat, unplug, and zen out. Watch the landscape seamlessly morph from one scene to the next, in a ballet of colors and shapes, and let your inner driver take the wheel. You've got this.\n7 levels, hundreds of obstacles, and infinite challenge\nBreathtakingly beautiful and silky-smooth graphics\nCustom-made retro synth music, perfectly in sync with the obstacles\nSuper addictive\nIncludes exploding enemy spaceships, seriously!\nIf you can win all the achievements, we hereby certify you have superhuman abilities!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fraoula","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":10367,"name":"Skara - The Blade Remains","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c98/c988bb637b38eac52b3ea878781e73d0.jpg","description":"Skara is a Free-to-Play competitive team-based melee combat game for up to 6 players set in a fantasy world. Skara is now available for PC on the Steam Store. Easy to learn, hard to master, only the best can be legendary, remembered forever in Skara lore. Will you be among the next Skara heroes?\nFast-paced combat with timing and accuracy focus\nEach survivor has his own 3rd person combat style with a personalized set of close combat movements and skills to fight in frenetic skirmishes.\nTeam fighting synergies between characters\nIn order to master the game you will need to learn the specificities of each culture’s combat style to take advantage of your survivor’s and play as a cohesive group of warriors, powering each other’s strengths.\nQuick multiplayer matches\nYou can choose different game modes ranging approximately from 3 to 10 minutes. You cannot hide in the arenas, so you must kill your enemies before they kill you.\nGame modes\nRight now we have 2 game modes: a 1v1 “Duel” and a 3v3 “Last Team Standing”. And 3 arenas: “Jaarvi” is the icy scenario for the Duels and “Khilma - Lava Coliseum” with “Gâo-di - Temple of the Zem” are the two scenarios where the Last Team Standing matches take place.\nA 5v5 “Domination” is planned to come in the future. We will soon start working on 5v5 “Siege Battles”. Nearly all of them contain interactive elements. Danger is everywhere.\nLore-Rich\nWe have been working for the last four years to create a cohesive and rich Skara World with a strong culture background. We will introduce it to you through: in-game specific entries, some lore-related events, quotes from each Skara’s Culture in our medias and a ready to be published novel.\nCosmetic based monetization system\nYou will be able to personalise your survivors with aesthetic elements such as skins,  emotes, victory poses and dyes.\nPlaying Skara automatically means you have a say in its continued development.\nFrom achievements to game modes, there are a whole host of details that we leave open to you, the players, to decide. We are really a small team that takes the community seriously. Just check the forums to see that in action!\n\"And then it happened. I know not how to describe it with intelligible language - surely the Authorities must have words to describe these cosmic occurrences…\" -Saltés Borian, Governor of Valemteim\nCelem is no longer the only Light that governs the world of Skara. Lôm, the lesser Light, engaged Celem in a celestial combat, wreaking havoc upon all that depended upon Him for life.\nNow the Lands of the Long North freeze while the Long South burns. Empires have fallen.\nMany have perished. And many more will continue fighting as what is left of Skara is reclaimed by those with the will to dominate.\nWill you?\nFear comes from the belly. So Khärn cut the belly to let it out.\nBorn from the bowels of Skara, these mysterious and violent raiders of the land are by far the strongest of all. However, their brute strength makes them slow, offering brave opponents a brief opportunity for victory.\n...Soon all will know, and fear, the Sons of Fire.\nThe tireless Celea escaped their burning homes to settle in a new land. Little did they know how soft and unprepared that land would be. Unstoppable in groups, the Celea are masters of Atash.\n“Anger that sits burns its bearer, Anger that moves burns others” -Shinse proverb\nThe Shinse lost their ancestral lands on Skara’s coast to the invading Celea. Now they seek revenge. Swift and agile, the Shinse have only two types of opponents: The quick and the dead.\n“Gaal spake, the sound summoning Tamvaasa to spring from the sea\nGaal was so glad in His glory, He gave great gifts to Tamvaasa\nFood for feeding, fields to frolick in, and forests for wondering…” -Tamvaasa creation hymn\nThe Tamvaasa descend from the Long North, a hardened race with a proud history and an age old rivalry with their southern neighbours, the Durno. Their piercing attacks, combined with powerful song-lore taken from the wild, makes them a force to reckon with.\nPart of the vision of Skara is to allow players to literally become the protagonists of an unfolding drama. For now, we will hold a series of events for you to have a chance to be immortalized in Skara Lore. The first of them being the one called “Cataclysm”.\nAfter the full version release, new in-game features will keep embracing this vision.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"8-Bit Studio","platforms":[{"id":0,"name":"PC"}]},{"id":6954,"name":"Riven: The Sequel to Myst","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/369/36925f823ec3e9e28a91729c88bf31ec.jpg","description":"“I know what he’s doing… He’s watching you.”\nTravel to Riven, a beautiful and mysterious world on the verge of collapse. Explore this mysterious place, solve its puzzles, reveal its mysteries, make a daring rescue, and escape.VISIT A MYSTERIOUS WORLD\n“I am Gehn. I assume you’ve heard of me.”\nRiven takes you on a journey through dense jungles, awe-inspiring caverns, and monolithic structures. Explore a world bent to the whims of a man who sees himself as a god and where every corner will immerse you in an otherworldly adventure.IMMERSE YOURSELF IN A SURREAL LANDSCAPE\n“There’s a great deal of history that you should know…”\nRiven rewards careful observation. Challenge Riven’s cunning puzzles, deftly woven throughout its narrative. The environment of Riven will reveal the story of this world as you make meaning from seemingly disparate bits of information and learn everything you need to know about this world.UNRAVEL RIVEN’S SECRETS\n“...it may be time to give this inexplicable mystery a second look.”\nWho are the mysterious island dwellers you encounter during your exploration? What purpose does the giant golden dome serve? Why is this world on the verge of collapse? Play Riven  and discover the answers to these mysteries- and more.ABOUT THIS REMAKE\nCreated by the legendary indie developer Cyan Worlds and based on the smash-hit original released in 1997, Riven  has been lovingly revisited by its key original visionaries to expand the epic narrative of the Myst  universe.\nExperience Riven like never before - with free movement through a real-time 3D environment. This brand-new, re-imagined, and expanded version of Riven offers a deeper story, new captivating visuals, and a journey that stays true to the original release while also expanding on Riven’s breathtaking world.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Android"}]},{"id":650598,"name":"Crysis 3 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08e/08e30af061660c229d7480325fdf5f07.jpg","description":"New York City has been transformed into a sprawling urban rainforest sheltered by a giant nanodome. Prophet must fight through seven distinct districts against human and alien forces, using the Nanosuit's superior technology to deploy brute force or opting for stealth to achieve his goals. Equipped with a deadly Predator Bow, there's no wrong way to save the world.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Crytek","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":19289,"name":"SiN Episodes: Emergence","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b6a/b6a71d2828f0d661ea863df273e6796b.jpg","description":"You are John Blade, commander of HardCorps, an elite security force dedicated to protecting the people of Freeport City. Four years have passed since your first battle with Elexis Sinclaire, a beautiful, brilliant, and ruthless scientist who is out to remake humanity according to her own twisted vision. The law has failed to bring Elexis and her multi-billion dollar empire, SiNTEK, to justice, so Blade is determined to take matters into his own hands. Joining Blade on his mission are JC - a hacker with a secret to keep - and Jessica Cannon, a fiery rookie who can find her way into any secure facility.\nEnter the living, breathing world of Freeport City, a futuristic collision of New York, San Francisco and Tokyo. As Freeport continues to suffer from mutant attacks, you must now bring down Sinclaire before she can set her deadly plan in motion and alter the shape of humanity forever.\nSiN Episodes™: Emergence launches the new era of episodic gaming. A first person shooter powered by Valve's award-winning Source™ technology, SiN Episodes offers unprecedented interactivity, an engrossing story, and a revolutionary dynamic difficulty system that provides a custom experience based on your skill level and play style.\nIntense Combat: Face off against ruthless enemies, like jetpack soldiers and mutants that evolve as you fight them. Witness enemies that adapt to your actions and truly work as a team, as they cover each other and help fallen comrades to get back on their feet.\nOutsmart your opponents by using your surroundings to your advantage as you set up traps using lethal elements of the environment. Location-based damage rewards accuracy while melee combat moves enable you to get up-close and personal.\nUnprecedented Interactivity: Blast your way through highly interactive environments powered by an enhanced version of the Source engine. Characters dynamically react to what you're looking at and the environment. Target and shoot off specific vehicle parts and literally blow cars to pieces. Experience the next level of vehicle combat with a flexible positioning system enabling you to move around the interior with an unprecedented degree of freedom, allowing you to pick the ideal position to attack that enemy position up ahead.\nPersonal Challenge System™: Driven by one of the most elaborate statistics systems ever created, SiN Episodes will constantly adapt to your playing style and offers a challenge that is custom-tailored to your skill level.\nEpisodic Delivery: Buy as little or as much of the game as you want, with each installment offering 3 - 6 hours of action-packed gameplay. But tread lightly, as the choices you make may influence future episodes in unforeseen ways.\nSource Powered: Utilizing the same engine that powered Half-life® 2, Emergence gives you stunningly gorgeous graphics and intense physics-based gameplay.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ritual Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":17602,"name":"The Magic Circle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/162/162ca2439336d0c07e2de2d7c397e9f5.jpg","description":"You are the protagonist of an unfinished 1st person fantasy game, trapped in development hell. The designers (played by James Urbaniak, Ashly Burch, and Karen Dyer) are god-like, but so indecisive that they've given you no powers whatsoever. With the help of a mysterious disembodied voice (Stephen Russell) you must seize the tools of game development from these unworthy 'gods', uncovering more of the darkly comic story as you go. Rather than traditional puzzles with a single solution, the incomplete state of each environment is a question that you answer in your own way. Trap the designers' creations, steal their behaviors, and re-mix them to explore and master this world-in-progress. Can you out-think the game gods? Can you ship The Magic Circle from inside it?\nWarning: Some strong language and references to adult subject matter.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Question","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14468,"name":"Millennium - A New Hope","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ac/4ac46c4d61e89dea5bf9ee0d56869861.jpg","description":"Backstory\nMarine is young - too young to endeavor great things.\nBut Marine is a fighter and she refuses to accept fate.\nBecause her fate is to be a peasant and probably die young - a disease, or a predator, whatever, you always die of something in the murky lands of Myst.\nSo when her father is critically injured, Marine decides to fight back and take over the crusade he can no longer pursue.\nWhich crusade? To challenge the feared Lords of Mystrock, the rich megalopolis of Myst, and defeat them in a traditional showdown that decides the rulers of the world.\nEverybody keeps telling Marine it's impossible and she'll end up swatted like a fly.\nBut what do YOU think?\nDetails\nMillennium is the first episode of Aldorlea's flagship series (the makers behind The Book of Legends, Moonchild, Dreamscape, 3 Stars of Destiny, Asguaard, Undefeated etc.).\nFeaturing an immersive story, this game is a fantastic introduction to a series greenlighted by the Steam community that spans over 5 episodes and features more than 20 characters in total. Key Features\n50+ achievements to unlock - can you get them all?\n4 levels of difficulty - choose your difficulty and enjoy replaying the game at its most challenging\nChoose visible or invisible monsters - cater to the encounter style you prefer\nOptional guiding arrows - enjoy the game without the worry of having to look up a walkthrough or guide\nDozens of secret rooms - for those who like to explore and discover every secret\n40 quests - easy request from a villager or very tricky riddle to solve, help people as you progress in your adventure\nBattle superb monsters including 8 Animal Kings - they are the most dangerous and feared creatures out there, so beware\nGet help from Jeanne - your magically-gifted fairy friend that you can summon when you really need that little something extra\nGorgeous retro graphics and musics - Millennium features high production values in its genre, all for your enjoyment\nRPG Fan's Indie RPG of the Year 2009 Best-Selling Games by Aldorlea\nhttp://store.steampowered.com/app/277470\nhttp://store.steampowered.com/app/332380\nhttp://store.steampowered.com/app/332390 Aldorlea Useful Links\nOfficial Website (contains 100+ games including all 15+ Aldorlea Games released to date)\nAldorlea Community (join it to receive help and info about the games)\nAldorlea Facebook Page (become a member to get up-to-date news about us)\nMillennium Help Forum (tons of info to be found there for the aspiring adventurer)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aldorlea Games","platforms":[{"id":0,"name":"PC"}]},{"id":5621,"name":"NIER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81c/81c498e43b5d4565732b946cc768288a.jpg","description":"Nothing is as it seems in Square Enix’s latest action adventure game, set in a crumbling world plagued by disease and dark, unrecognizable creatures. Players assume the role of the unyielding protagonist, NIER™, resolute in his quest to discover a cure for his daughter, who is infected with the Black Scrawl virus. With powerful allies and a mysterious book, NIER™ encounters things that will confound even the mightiest of warriors.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":43358,"name":"Pro Evolution Soccer 2016","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8dd/8dd95766d6f1dfcfe47128a82ed22699.jpg","description":"The Games on Demand version supports English and French. PES 2016 comes with a whole host of new and improved features that is set to raise the bar once again in a bid to retain its title of ‘Best Sports Game’. Featuring 400+ teams, 10,000+ real players and 2000+ photo realistic player faces, celebrate its 20th anniversary with the most advanced football game ever. Love the Past, Play the Future! The latest online update will introduce the newly added UEFA EURO 2016 mode. The latest online update will introduce the newly added UEFA EURO 2016 mode.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PES Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":20969,"name":"Desert Thunder","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/800/800df5b1e2f128803297f84444c62923.jpg","description":"Desert Thunder is an arcade-style action tank game for the PC. Ripped from today’s headlines, the storyline immerses players into the heat of a desert-based military conflict. Players will tear through desert, urban and industrial settings in their experimental battle engine, the Abrams M1A6 Advanced tank that’s loaded with awe-inspiring devastating weapons and armored to near indestructibility. You are the commander of a top secret M1A6 experimental tank division in the Armor Task Force. Your mission was to lead the northern front of Operation Desert Thunder, a secret military operation to overthrow a terrorist faction that has taken control of a peaceful Middle Eastern country. Your mission has been compromised, your small battalion devastated. Left with no alternative, you must complete your mission to reach the capital city and rendezvous with allied forces.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Hip Games","platforms":[{"id":0,"name":"PC"}]},{"id":20805,"name":"Vangers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/555/5551b9f5fc96240bff431d87b4043956.jpg","description":"Special EditionVangers was originally released in 1998 and now we present you with the special reworked edition of the game with improved performance on modern operating systems. Game still runs in 800x600 resolution though, as it was intended to do.\nFeature List- Vast Sandbox world - do whatever you like, just don’t get caught without Rubbox.\n- Non-linear story with multiple endings - choose who would you like to save - world, yourself or somebody else?\n- 30 mechoses (armored vehicles) - drive, assemble and steal whichever you like.\n- 70+ items to equip your mechos - big guns, big fun.\n- 10 unique worlds to explore - and die for!\n- Oldschool game from 1998 with epic hardcore gameplay and no help whatsoever.\nAbout the Game************************************************\nVangers. Mysterious creatures from the future of mankind:\nMercenary murderers, victims of the cruel experiments,\nmasters of the roads, scum of the Creature Soup?\nName your native bios, and we'll tell you, for how long you'll live\nEleepods?.. Beeboorats?.. Zeexen?..\nThe Lost Chain of Worlds cursed forever,\nthe Larvae have already started to bore the eternity,\nand mechos have commanded their own slaves.\nThe new universe is built and is waiting for the explorers...\n************************************************\nVangers is a mixture of various, yet consistent gameplay components. The player enters the strange world of the future, emerged as a result of the clash between humankind and another intelligent race of creatures, and now living according to its own rules. The world challenges for the quest.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"K-D Lab","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13020,"name":"Dungeon of Zolthan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03d/03d04c06b2c037d346c576efd109206a.jpg","description":"Dungeon of Zolthan is a casual, arcade-style metroidvania platformer where your goal is to defeat Zolthan; a powerful mage that lives inside the dungeon.\nUsing an array of powerups and your own wit and guile, guide your character through Zolthan's Dungeon! Dodge obstacles and projectiles, solve puzzles, and lay waste to your foes on your way to the final confrontation!\nFeatures:\nGood old-fashioned retro CHALLENGE!\nClassic, time-tested platformer mechanics!\nMetroidvania explorative elements\nPuzzles\n6 Powerups\n40 Dungeon 'rooms'\n4 Bosses","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Robert Alvarez","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":388943,"name":"MudRunner","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3e/e3e30c02d9ee69e618e667fd52e06b8d.jpeg","description":"MudRunner is the ultimate off-road experience, putting the players in the driver seat and daring them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only a map and compass as guides!<br/><br/>Drive 19 powerful all-terrain vehicles, each with its own characteristics and attachable equipment. Complete your objectives and deliveries by enduring perilous conditions across wild, untamed landscapes in extreme conditions with dynamic day-night cycles. Explore an immersive sandbox environment, enhanced by improved graphics. Overcome muddy terrain, raging rivers and other obstacles that all realistically react to the weight and movement of your vehicle powered by the game's advanced physics engine.<br/><br/>With your map, compass, winch, and your driving skills as allies, go solo or join up to three others in the coop multiplayer. Download mods created by the passionate community for truck-loads of content and an ever-evolving MudRunner experience.<br/><br/><ul><li>The ultimate off-road experience<br/></li><li>A wider selection of 19 incredible all-terrain vehicles<br/></li><li>Explore immense, untamed Siberian sandbox environments<br/></li><li>Overhauled graphics and advanced physics engine for extreme realism<br/></li><li>Complete perilous objectives and deliveries in extreme conditions<br/></li><li>Play solo or in multiplayer coop up to 4!<br/></li><li>Download mods for an ever-evolving experience</li></ul>","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Saber Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":43832,"name":"Tangledeep","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fb/0fbc557f78de00eac6b6ae7de6c1dcb5.jpg","description":"Tangledeep combines the 16-bit graphics and polish of classic SNES-era RPGs with elements from roguelikes and dungeon crawlers to create a magical experience for players of all skill levels. Trapped in underground villages with no memory of the world at the surface, you must survive an ever-changing labyrinth to discover what lies above. Experience rich, tactical, turn-based gameplay as you explore a sprawling dungeon that’s different each time you play. Tangledeep features a customizable job system and hundreds of collectible items that allow you to approach each playthrough in a totally new way!The Setting\nFor hundreds of years, people have lived in the safety of underground settlements and villages – where the only route to the surface is “Tangledeep,” a mysterious and ever-changing labyrinth. With memories of the surface world long forgotten, you set out for the labyrinth to discover what lies above. With each floor – full of magical beasts, ancient automatons, bizarre environments and hybrid biomes – the mystery grows ever deeper…Key FeaturesExperience finely-tuned, procedurally-generated and handcrafted gameplay as you fight challenging monsters, complete quests, and collect rare items.\nMaster deep, tactical turn-based combat across 9 unique jobs. (More to come!)\nChoose between two game modes – including Adventure Mode, which removes the pain of permadeath.\nShare some of your progress between characters by using the banking system, or planting magic trees and raising monsters in town.\nTake in the scenery – comprised of beautiful 16-bit graphics and carefully handcrafted maps!\nRelax to a beautiful soundtrack composed by award-winning composer Andrew Aversa – joined by Hiroki Kikuta (Secret of Mana) and Grant Kirkhope (GoldenEye 007, Civilization: Beyond Earth).Multiple Platforms and Control MethodsRuns on both PC and Mac, with Linux support in continuing development (already works great on several distros)\nPlay with virtually any controller, and remap any control, binding, or shortcut\nOld-school keyboard-only support (numpad movement) as well as WASD preset bindings available\nFull mouse support - can even be played with ONLY the mouse!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Impact Gameworks","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20874,"name":"Sweet Lily Dreams","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/956/956d8b36d4693bcb8a10ce5d687652ae.jpg","description":"Prequel: Whisper of a Rose\nThe peaceful Realm of Dreams is about to be consumed by a dark and terrible nightmare. You must venture into the darkness and battle fearsome literary foes such as Hyde, the Headless Horseman and Dracula. Are you brave enough to face the most maleficent recesses of the human imagination? Join Lily on a sugar-coated adventure about inner strength and trust with a dark interior.\nSweet Lily Dreams is an epic RPG with a cute surface and dark, adult themes on the inside. Lily, along with her comrades Faith (a dog) and Curly Trick (a cat), journey into the Realm of Dreams and end up at the center of the battle between good and evil. All is not as it seems and sweet Lily is about to learn that books are safer than reality, that trust is not to be given lightly, and that good does not always triumph.\n\"What comes immediately to mind as a summation of the story's concept is the characters from preschool sing-along videos being thrown into Middle Earth and asked to defeat Lord Sauron by way of the horror shelf of your local DVD rental store.\"\n- Indie Game Magazine\nExplore a massive world of classic tales, folklore and dreams.\nNumerous enemies to fight in fast-paced, turn-based battles.\nDozens of exciting Steam Achievements!\nCraft magic, furniture and items of power.\nSolve puzzles and play optional mini-games.\nBuild and furnish your own house!\nTravel with a party of loveable and unforgettable characters.\nDiscover hidden caves of treasure.\nCustomizable mouse and keyboard controls.\nTry to collect all coins and accessories in the game!\nGet carried away by a beautiful soundtrack and atmosphere unique to each dream world.Other Games by RosePortal Games on Steam:Whisper of a Rose\nThe Princess' Heart\nUnraveled","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"RosePortal Games","platforms":[{"id":0,"name":"PC"}]},{"id":19466,"name":"Command & Conquer 4: Tiberian Twilight","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ea/2ea117c364906de9f569876a5dff5eae.jpg","description":"Behold disciples of Nod, for the end is soon upon us. Electronic Arts’ award-winning and best-selling Tiberium saga is coming to a powerful conclusion with Command & Conquer 4, which will introduce a multitude of innovations to the classic fast and fluid Command & Conquer gameplay, while retaining the core compulsions that fans have come to love over the series’ history.\nIt is the year 2062 and humanity is at the brink of extinction. Tiberium, the mysterious, alien crystalline structure that has infested Earth for decades and served as the primary reason for years of relentless conflict between the Global Defense Initiative (GDI) and the Brotherhood of Nod, is close to rendering the planet uninhabitable. Mankind is on the verge of extinction when Kane, Nod’s prophetic leader, emerges from seclusion to deliver GDI the message that he has developed a system that could control Tiberium and harness its power. But he cannot build this \"Tiberium Control Network\" without GDI’s cooperation. Thus, the two opposing factions – GDI and Nod – inevitably find themselves in desperation for the same cause: to stop Tiberium from extinguishing mankind.\nAfter 15 years, the network is nearly complete, Tiberium is under strict control and our revitalized, newly terraformed planet is on the cusp of a new age of prosperity and progress. It is then that the world’s citizens begin to seriously ponder why Kane chose to help, and what will he want in return. These questions and more lead to the dramatic final act of the Tiberium saga.\nWith a multitude of innovative new features to the fast and fluid C&C gameplay, Command & Conquer 4 offers players an entirely new way to play C&C. An all-in-one mobile base, persistent player progression across all game modes that is constantly updated in a real-time online profile, a 3-class system for each of the two factions, co-operative play, and a 5v5 objective-based multiplayer mode that promotes teamwork and social interaction, make Command & Conquer 4 unlike any other C&C experience.\nThe Epic Conclusion of the Saga - Kane returns in the thrilling conclusion to one of gaming’s longest running storylines, told through gritty live-action cinematics. Choose to take on the campaign solo or team up with a friend and play cooperatively!\nChoose Your Class - Choose from three unique classes from both GDI and Nod, each with its own specialized units and powers, for more strategic and combative options that match your play style of choice! Offense, Defense, or Support classes—which will you pick?\nAlways on the Move - For the first time ever in the C&C series: a massive, mobile, all-in-one base, The Crawler, lets you pack up and move your base with your army for a new layer of strategic depth. Build units as you move across the field, and deploy whenever and wherever you choose!\nPersistent Player Progression - The more enemy units you destroy, the more experience points you earn to progress your player profile! Level up to unlock new units, powers, and upgrades to make your army more powerful!\nTeam Up and Take the Battle Online -  Join your fellow commanders online and tackle your opponents in the biggest C&C multiplayer to date, featuring 5 vs 5 objective-based battles! Choose your favorite class and take online strategy action to the next level as you conquer objectives while pummeling your enemies. The all-new party system lets you move with your party of friends from one online battle to the next.\nOnline Disclaimer\t\t\t\t\t\tPERSISTENT INTERNET CONNECTION, EA ACCOUNT, REGISTRATION WITH ENCLOSED SERIAL CODE AND ACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY.  SOFTWARE REGISTRATION IS LIMITED TO ONE EA ACCOUNT PER SERIAL CODE AND IS NON-TRANSFERABLE.  YOU MUST BE 13+ TO REGISTER FOR AN EA ACCOUNT.  EULA, EA ONLINE TERMS AND CONDITIONS AND FEATURE UPDATES CAN BE FOUND AT WWW.EA.COM.  EA MAY PROVIDE CERTAIN INCREMENTAL CONTENT AND/OR UPDATES FOR NO ADDITIONAL CHARGE, IF AND WHEN AVAILABLE.  EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON WWW.EA.COM.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"}]},{"id":16130,"name":"The SKIES","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c16/c16b6c9a5dd923a4ae73681a3be2ab99.jpg","description":"Early Alpha has launchedSome time ago we've seen huge support from our Steam community, have passed Greenlight just for few days, received lots of positive feedback, lots of kind, encouraging words and your thumbs up. Now we're here... This is an extremely important milestone in our life. We launch our Early Alpha and hope you'll now get involved, take part in our open testing and help us with your feedback! We promise to show progress regularly and we're sure that our collaboration with you will be exciting. Let's create really awesome game together. Looking forward to seeing you in our early alpha soon...\nAbout the GameThe Skies is a post-apocalyptic MMORPG with a non-linear storyline, in which you follow your own path or join other players to conquer the wasteland.\nIn this innovative sandbox you create your own adventure in a player driven economy your actions will result in the development of both the world and your character.\nThe game story takes place in the early 21st century, when solar activity increased dramatically. Within two weeks civilization collapsed, wiping out power sources, government and infrastructure. Humanity descended into darkness.\nIn 2150-2170, dust began to settle on the surface of the planet and the sunrays reappeared after 150 years of darkness.\nIs mankind strong enough to restore what they've destroyed over the last century? What is life  going to be like now?\nGame Features\n•\tHuge open game world – 12km2  packed with interesting places to explore. Immerse yourself in an atmospheric post-apocalyptic world carefully crafted by our artist. Regular updates will add new locations and increase the map size up to 200km2 .\n•\tUnique and innovative character progressions/role playing system – We will give you the freedom to develop your character according to your playstyle. Different dialogue options will be available based on your decisions. Become a bandit, clan leader or trader and see how your reputation will influence the world around you.\n•\tPlayer driven economy – Our innovative take on in-game economy will let you decide what you want to do. Will you work  in a factory, become a trader or manage your own business and start hiring people and handing out wages?\n•\tImpactful decision making - See the world changing alongside your story, become more than a survivor, thrive with a group and dominate the wasteland.\n•\tThrilling PVP action – Hunt down other players as a lone wolf or join a clan and capture and govern entire wasteland cities.\n•\tDeep crafting system – Develop your character to withstand the harsh world by crafting advanced equipment, trade, build and prosper.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Eforb","platforms":[{"id":0,"name":"PC"}]},{"id":472,"name":"Kingdom Hearts HD 2.8 Final Chapter Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/531/5310bfdd3240f2c037eebaa75c04c44e.jpg","description":"The KINGDOM HEARTS HD 2.8 FINAL CHAPTER PROLOGUE digital edition features 3 magical experiences:\nKINGDOM HEARTS Dream Drop Distance HD: A full-HD remaster. Sora and Riku take on the Mark of Mastery exam in preparation for their coming showdown with Master Xehanort.\nKINGDOM HEARTS χ Back Cover (movie): A new HD movie that tells the mysterious story of the Foretellers from the series’ origins\nKINGDOM HEARTS 0.2 Birth by Sleep – A fragmentary passage – : A brand new episode that links to KINGDOM HEARTS III.\n1 player\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© Disney.\nDeveloped by SQUARE ENIX.\nSQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd. Unreal, Unreal Engine, the circle-U logo and the Powered by Unreal Engine logo are trademarks or registered trademarks of Epic Games, Inc. in the United States and elsewhere. Uses Scaleform GFx © 2008 Scaleform Corporation. All rights reserved. Uses Simplygon®, Copyright©-2016 Donya ® Labs AB. Uses IKinema® RunTime. IKinema® is a trademark or registered trademark of IKinema Limited in the European Union, the United States of America and elsewhere. IKinema® RunTime, Copyright 2016, IKinema Limited. All rights reserved. The ratings icon is a registered trademark of the Entertainment Software Association. All other trademarks are properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":23292,"name":"Terroir","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7d/b7dbc77e35e2c3592a3ef6715da1a09e.jpg","description":"Terroir is a 3D tile-based tycoon game where you manage your very own vineyard. In Terroir, you grow a variety of different grape varietals, craft your wine, and expand and manage your Chateau. You'll also have to deal with factors such as weather and random events, which can either make or break your business.Features\nSome of the game's features and mechanics include:\nChoose from a selection of different grape varieties, each with their own demands.\nDynamic weather system patterned after the Bordeaux wine region's climate.\nEach complete playthrough lasts 70 in-game years, but Players can continue playing without contributing to their final score.\nCraft wine through the game's 4 winemaking processes: Crushing, Fermentation, Pressing and Ageing. Each type of grape needs to be crafted a certain way to achieve the best results, so you'll have to learn and master each one.\nStart out with a single planting tile, then expand your Chateau to up to 33 tiles, using 6 different tile types. Some tiles affect the ones around it, so placement is key.\nCHANCE & CIRCUMSTANCE: Terroir's random event and mission system. Players can open the Mystery Box and choose between CHANCE (a random event that could either have a positive or undesirable outcome) or CIRCUMSTANCE (a mission that a Player completes for rewards, or gets penalized for failing).\nClean, minimalist design and gorgeous low-poly 3D models.\nOriginal soundtrack composed and performed by Singapore's CLARQuinet ensemble.\nPut on your field gloves, grab a pair of pruning shears and build your Chateau literally from the ground up. Good luck, and cheers!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"General Interactive Co.","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":23060,"name":"Strong Bad's Cool Game for Attractive People","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b47/b475525f12315e5a2b9a50f252bfbad2.jpg","description":"You may already know Strong Bad from his regular appearances answering emails and doling out not-so-useful advice on Homestarrunner.com. Now he's the star of a five episode comedy series, Strong Bad's Cool Game for Attractive People. With all new storylines co-written by the guys from Homestarrunner.com, you'll feel like you're inside Strong Bad's world. (You may even start to talk like him!) Each episode has a different theme and you get to hang out with with Homestar, The Cheat, Bubs - the whole crew. It's like a Strong Bad cartoon on steroids. As Strong Bad would say, what the crap are you waiting for?\nIncludes all 5 episodes:\nHomestar Ruiner: When a practical joke goes awry, Strong Bad has to get the loafing Homestar Runner out of his house.\nStrong Badia the Free: Join the Homestarmy and help Strong Bad bring down the corrupt King of Town.\nBaddest of the Bands: Hurting for cash, Strong Bad turns to the gods of rock and roll for some divine inspiration.\nDangeresque 3: Strong Bad lands the role of a lifetime in this blockbuster movie event.\n8-Bit Is Enough: Trogdor's on the loose! Send the dragon packing and restore balance.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20971,"name":"CT Special Forces: Fire for Effect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/05f/05f539034aef56c19c3f24cab1ca3c8e.jpg","description":"CT Special Forces: Fire For Effect will feature unique missions in the fight against worldwide terrorist networks. The game also benefits from a cutting-edge engine as well as a specific physics system.\nFor the first time in this genre, physics will have a major impact on how you play the game.\nIn spite of being a totally new gameplay experience, CT Special Forces: Fire For Effect stays true to the franchise values through non-stop action, varied gameplay sequences and of course several characters to choose from offering distinctive abilities, vehicles and equipment.\nTwo characters that employ different skills\nVast selection of weapons and equipment\nTerrifying aerial combat\nRequisition vehicles and change tactics\nUse jeeps, boats, hovercrafts and more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Asobo Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":17120,"name":"Analogue: A Hate Story","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57a/57a297891490eba2410f71f7272a988e.jpg","description":"Just UpdatedNow includes the Science and Tradition DLC\nIncludes two new costumes for the cosplaying AI *Hyun-ae: a scientist's lab coat, and the traditional hanbok that the Pale Bride wore.\nAbout the GameBack in the 25th century, Earth launched a generation ship into deep space, with the goal of establishing the first interstellar colony. It dropped out of contact and disappeared, never reaching its destination. Thousands of years later, it has finally been found.\nUncover the mystery of what happened to the final generation aboard the generation ship Mugunghwa by reading through its dead crew's logs, with the help of a spunky AI sidekick! Two pursuable characters. Five endings. A dark visual novel that further extends the non-linear style of Digital: A Love Story in a mystery featuring transhumanism, traditional marriage, loneliness, and cosplay.\nWelcome to the future.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Love Conquers All Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":16692,"name":"Sins of a Solar Empire: Trinity","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cc/4ccbf99ffa5837ee1d7828b706bee109.jpg","description":"In Sins of a Solar Empire: Trinity, you are the leader of a civilization embroiled in a galactic war, fighting for the survival of your entire race against relentless foes. Your success will depend entirely on your ability to manage your empire and command your vast fleets of starships to victory.\nSins of a Solar Empire: Trinity is a “RT4X” game, blending the epic strategy and empire management of the 4X genre (Explore, Expand, Exploit, Exterminate) with the fast-paced and tactical elements of real-times strategy.\nKey features:\t\t\t\t\t\tExplore the epic scale of a dynamic 3D galaxy featuring planets, asteroids, plasma storms, stars and more.\nTake on multiple roles as you seamlessly transition between the role of emperor and fleet commander using Sins’ unique strategic zoom.\nExtensive diplomatic and economic strategies are yours to wield to your advantage. Forge alliances, establish powerful pacts with allies to open up new bonuses, setup trade between empires and use pirates to take out over-powered tyrants.\nFight epic battles with hundreds of ships on-screen at once, with up to 10,000 particles firing off in full-out combat.\nSeamless zoom in and out, from looking at a one-man fighter to viewing your entire empire spanning billions of kilometers of space.\nDefend your worlds by constructing massive starbases, deploying deadly minefields, and researching advanced defensive technologies.\nCreate strong alliances and gain powerful pact bonuses using the all new diplomacy system.\nBribe or hire pirates to wipe out your opponents, but beware, the pirates gain strength over time and can also be used against you!\nPlay online with up to 10 friends via Ironclad Online.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":3540,"name":"The Legend of Korra","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/26e/26e5c1b918cee8a26a27cab35d0fb92b.jpg","description":"An ancient evil force has emerged from the portals and threatens the balance of both worlds!  Only the Avatar stands a chance in defeating this new threat!\nOriginal Avatar storyline penned by the TV show’s creators.\nWield the power of all 4 elements—water, earth, fire, and air as only the Avatar can!\nChange bending styles at any time to unleash devastating combos.\nBeat overwhelming odds by activating the all-powerful Avatar state.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Platinum Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":350787,"name":"Shing!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3cd/3cdd929c419165c75388070f221433b0.jpg","description":"Experience the most exciting and immersive beat-em-up combat system ever – become a kickass ninja and slice some demons in style! Join a band of wisecracking warriors in a bloody adventure through the land of mythical monsters and mysterious machines.FEATURESPlay solo or with friends: 4 player local and online co-op\nExperience immersive and intuitive controls: right analog stick controls your weapon giving you instant access to extensive moveset\nEnjoy gameplay that never gets old: master the multilayered combat, overcome clever enemies and face epic bosses\nExperiment with freestyle combat system: mix and match combos, switch characters on the fly and turn enemy abilities against them\nWitness the glory of  beat-em-up 2.0!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mass Creation","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":29324,"name":"Dream Daddy: A Dad Dating Simulator","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b89/b89a1f0a8725d6cbfd68cf0196735066.jpg","description":"Dream Daddy: A Dad Dating Simulator is a game where you play as a Dad and your goal is to meet and romance other hot Dads. You and your daughter have just moved into the sleepy seaside town of Maple Bay only to discover that everyone in your neighborhood is a single, dateable Dad! Will you go out with Teacher Dad? Goth Dad? Bad Dad? Or any of the other cool Dads in this game? With minigames, sidequests, and a variety of paths and endings, Dream Daddy: A Dad Dating Simulator is this year's most anticipated Dad-based game.Features7 dateable Dads\nDad character creator - Create your Dadsona!\nMultiple endings per-Dad\nVoiced by the Game Grumps and friends\nWritten by Vernon Shaw and Leighton Gray\nArtwork and pinups by Shanen Pae, J.N. Wiedle, Anna Pan, Tyson Hesse, Ellen Alsop, Evan Palmer, Ego Rodriguez, and many more!\nOriginal score by Jesse Cale\nDad-themed mini and micro games throughout each date path\nSo many Dad puns. Like, to the point where it made us all uncomfortable\nSecretssssssss.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Game Grumps","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19481,"name":"Larva Mortus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccc/ccc8ae73b79262f59a9d7a6e62f036d9.jpg","description":"At the end of 19th Century, dark forces shade the world once again. A brave agent, experienced in exorcism and combat, comes to face the oncoming evil, and fight loathsome supernatural monsters and horrific spawns of black magic. In the role of the agent, it's your quest to combat evil forces and to face a dark warlock of the ancient times and stop his plan to capture powerful artifacts of black magic.\nLarva Mortus is a fast-paced action horror game that has you hunting monsters of the supernatural in a dark and ominous atmosphere full of undead, terrifying and demonic nightmares. A horrific atmosphere goes hand in hand with furious action packed splatter fest. Everything accompanied by creepy, first class soundtrack!\n30 frightening supernatural monsters to destroy. Vampires, werewolves, the undead, and more!\nA dark and horrifying atmosphere with mysterious storyline quests!\nA solid arsenal  varying from classic six shooters and shotguns to the fancy Dynamo Gun\nRandomly generated missions for high replay value\nMain character development through a set of RPG-like features\nMany environments  from spooky manors and catacombs to dark forests and lonely deserts\nAn awesome dark orchestral music score\nThe gore can be turned off if you like\nUnlock 25 morbid Steam Achievements to gain bonuses and upgrade your character","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Meridian4","platforms":[{"id":0,"name":"PC"}]},{"id":13734,"name":"Spaceport Hope","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a10/a1007ffbf780343f1afb8935b4b2328a.jpg","description":"Spaceport Hope is a 2D action platform shooter featuring a retro-style pixel world.\nPacked with 13 unique bosses and tons of enemies, Spaceport Hope is ready to challenge every aspect of your gaming abilities!\nCollect items, unlock achievements, and fight till the end through a well crafted world.\nThe game is about planetary government trading with an advanced alien race, which goes bad.\nYou play as a badass courier who takes a government job, but is soon sucked in the events of an upcoming assault by the Cilarian alien race. He does what he can to save his own skin as well as the world he's living in.\nTravel to all 10 planets and explore a wide variety of levels, each one with its own unique enemies and gameplay features.\nMeet aliens, pirates, hackers and more in your epic journey!\nThey'll just keep coming at you! With more than 60 enemies, each one with its own special abilities, you will be challenged till the very end. Make your way through all the bosses and reach the epic final fight, where your victory will determine the fate of the world!\nFighting all those enemies and bosses without cool guns would be so boring.\nThat's why we have those 12 awesome guns for you. Make sure not to leave any enemies behind!\nWhile playing the game you will be accompanied by both an amazing soundtrack, with songs for every different area, and the best sound effects possible!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"team BitClub","platforms":[{"id":0,"name":"PC"}]},{"id":45957,"name":"Prince of Persia (1989)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/057/0573c1c9e1f2414c1f4acabe86ee9fd9.jpg","description":"From Wikipedia: Prince of Persia is a 1989 fantasy cinematic platformer originally developed and published by Brøderbund and designed by Jordan Mechner for the Apple II. In the game, players control an unnamed protagonist who must venture through a series of dungeons to defeat the Grand Vizier Jaffar and save an imprisoned princess.\r\n\r\nMuch like Karateka, Mechner's first game, Prince of Persia used rotoscoping for its fluid and realistic animation. For this process, Mechner used as reference for the characters' movements videos of his brother doing acrobatic stunts in white clothes and swashbuckler films such as The Adventures of Robin Hood.\r\n\r\nThe game was critically acclaimed and, while not an immediate commercial success, sold many copies as it was ported to a wide range of platforms after the original Apple II release. It is believed to have been the first cinematic platformer and inspired many following games in this subgenre, such as Another World.[4] Its success led to the release of two sequels, Prince of Persia 2: The Shadow and the Flame and Prince of Persia 3D, and two reboots of the series, first in 2003 with Prince of Persia: The Sands of Time, which led to three sequels of its own, and then again in 2008 with the identically-titled Prince of Persia.","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Broderbund Software","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"NES"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Apple II"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Game Boy Color"}]},{"id":44328,"name":"Mob Rule Classic","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/915/9159836d0e9a74f0f08b51c4955b962c.jpg","description":"Welcome to 1930′s America. Thanks in a large part to Prohibition, organized crime is on the rise and a number of criminal families are fighting for national control of the illicit markets – booze, prostitution, numbers, you name it – it’s all sprouting up like weeds through Johnny Law’s clenched fist!\nThis is a dog-eat dog world of corruption, murder and sex – and as the new kid on the block you’re looking a little like ‘milk on the bone’!\nMob Rule is a Real-Time Strategy game that simulates an underworld grab for power, wealth and real estate. You’ll start off as a small time thug and you’ll have just enough assets to build a soup kitchen. Choose a tenant and start working the ‘hood’.\nSlowly but surely you’ll build up an empire and drive away your competition. You’ll conscript a loyal workforce, fix things with the cops, make the right pay-offs and succeed in your quest for total control.\nAlternatively, you might just screw up completely and end up sleeping with the fishes!\nGame Features\nOver 40 unique and upgradable buildings!\nThree kinds of troops: Thugs, Repairmen and Gangsters!\nTen quirky tenants!\nMultiple resources to manage and use to construct your empire!","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"System 3","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]