[{"id":17103,"name":"Gridberd","genre":"Action","price":0.0,"description":"Each house holds many terrible secrets. They are not easy to solve, and the answers sometimes only lead to more questions. But what can you do when your life depends on these answers?\nThe game GRIDBERD is an action horror game in the first person, in which you have to solve the terrible mystery of the ancestral Johnson Mansion. Who are you? How did you get here? What really happened? And who is this mysterious ghost that longs to kill you, and is already hard at work sharpening his axе?\nTake a walk through the old ancestral mansion, take a look at the most secluded and most mysterious corners of it, and discover the secrets that it holds. Uncover crumbs of information from the past, and the history of this place. Open secret passages, solve puzzles, and skillfully bypass the traps that have been prepared for you in the old castle. Run away and hide from its ruthless creatures, which cannot wait to get at you. And remember – behind every corner horror and terror await you, and that which you will find, could change your life forever. So just running away will not work! The story is just beginning, so see it through to the end!\nFeatures:\n- Stunning graphics, created on one of the most advanced graphics engines – the CryEngine 3\n- Riddles and puzzles, as well as hidden paths that can reward you in the most diverse ways\n- A fascinating story with unexpected plot twists\n- The ability to achieve the goal in several ways\n- High-quality and well-thought-out sound accompaniment\n- Detailed and atmospheric environments\nConctact Us: wareberd@gmail.com","imageUrl":"https://media.rawg.io/media/screenshots/bda/bda849e42de91f0bf76fe6141e3ff3fd.jpg","releaseYear":2015,"developer":"Wareberd","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16547,"name":"Shutter","genre":"Adventure","price":0.0,"description":"Shutter is a short third-person puzzle game. You play as Keith, a new employee that has arrived at the mysterious research center L.I.E. (Learn, Investigate & Exploit). Explore and make your way through to the last floor of the research center, jumping, climbing and using a mysterious camera that modifies objects using perspective.\nFind different suits, collect documents and cassettes and find out what happened in this place. All in a space-age inspired setting.\nAbout the teamShutter is a graduation project made at ArtFx School of Digital Arts, with the collaboration of Audio Workshop and MAAAV Université Lumière Lyon 2.\nFinalist for Best Student Game on the Bafta Student Awards, Independent Games Festival and The Rookies.","imageUrl":"https://media.rawg.io/media/screenshots/4f6/4f69a78db2841cb45a4193058034a632.jpg","releaseYear":2015,"developer":"Cosmic Logic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14653,"name":"Inverted","genre":"Action","price":0.0,"description":"Inverted in an exciting new game that calls for amazement and joy for people who like to stretch their brains. The main character in this puzzle game mysteriously finds himself in a castle full of solitude, fear, and oblivion. With his charismatic appearance and charm, the main character has an ability to alter gravity, by doing so he can avoid different traps and many dangerous obstacles along the way.\nInverted is a game that is aimed at all ages and for fans of genres. You can enjoy excellent music along with wonderful graphics whilst getting lost in the skillfully presented atmosphere of Inverted and having a great time.\nFeatures of game:\nProfessionally designed levels\nPerfect music\nExpert graphics\nHidden \"easter eggs\"\nHardcore gameplay\nAvailability\nIntuitive menu & user interface\nVariety of uniquely designed levels","imageUrl":"https://media.rawg.io/media/screenshots/ba5/ba54923e7167c0581674655e250521ad.jpg","releaseYear":2016,"developer":"Versus System","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13836,"name":"C. Kane","genre":"RPG","price":0.0,"description":"C. Kane is a satirical short form (2-3 hours) turn-based RPG that streamlines the genre to its basics; fighting monsters, talking to people, playing dress up. Dungeons are minimalist, graphics are monochrome. Random battles are no more, bosses are numerous. A Shark guides the way. An original hip hop soundtrack provides the beats.\nFor years, video games have been moving further and further away from \"toys\" and more towards their one true goal: To Be Art. With C. Kane, the dream of a thousand indie game designers has finally been fulfilled. Critics have asked when games would get their own Citizen Kane; we have answered their question. The answer is right now,\nin this game whose description you are reading.\nOriginally released September 2013, Kane is now all up in your Steam. This is an updated version of the original PC/Android release, containing new and revised content.\nSECRET HINTS: To configure joysticks, press CTRL + J.\nWarning: Contains rude language, mild monochrome blood, and ugly monsters.","imageUrl":"https://media.rawg.io/media/screenshots/9d5/9d5eb83f934399dd8f42303720d3ee7a.jpg","releaseYear":2016,"developer":"Paul Harrington","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12841,"name":"Runeyana","genre":"Action","price":0.0,"description":"Runeyana is an RPG that combines Hack and Slash action. It evokes a story of bravery, strength, courage, trust and the desire to overcome destiny. Set in a deep, responsive, huge world, you will explore a beautiful sprawling land gaining the trust of various species scattered throughout the world. As in real life, you will cope with internal racial tensions by obtaining their trust through reputation. Use unique weapons and craft your character in both physical and psychological customisation.Features\nRole Playing Game mixing Hack and Slash action\nOnline trade and looting support\nLeveling up\nLearn your enemies’ abilities.\nStoryline based on the ancient gods of Runeyana\nGame goes through the bone age to the stone age\nQuesting and NPC system\nPet system too!\nCreate your own army\nBuy your own buildings and hire guardians to protect yourself from players online. Become the King of Alteos by owning as many buildings as possible.","imageUrl":"https://media.rawg.io/media/screenshots/56e/56e33e22a23e03862698f0730bda6dd6.jpg","releaseYear":2017,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12242,"name":"Home Behind","genre":"Action","price":0.0,"description":"In Home Behind, you take on the role of a refugee cast out from your homeland by a band of rebels. Your home and the peace you enjoyed has been destroyed, and your family has disappeared. Can you survive the struggle, famine, and sickness to make it to the safety of Europe?\nThe thoughts of civil war had been brewing in your homeland for years, and the violence has finally erupted. In the chaos, your village was burned to the ground, and your daughter disappeared. When faced with death, you chose to survive and to overcome the difficulties of disease, war, and famine. Can you make it long enough to be reunited with your daughter?\nAll events and experiences you come across are randomly generated, so no play through is exactly the same!\nKeep track of your mood, nutrition, and water levels while avoiding terrible diseases!\nTake on the ultimate struggle of survival as your travel 1500 kilometers to safety.\nUnlock all 15 jobs, each with their own special starting skills, items and rewards.\nExperience tons of random events both in the outside world and indoors, and be the master of your destiny.\nSurvive both day and night, as well as random weather events.\nCollect hundreds of items and craft your own weapons and armor.\nExplore the limits of crafting and upgrading to forge the strongest gear.\nTry loads of food to stay alive and cook your own meals Lizards Insects Braised beef.\nExplore a world inspired by real events and real stories.\nFight a wide range of enemies, including wild beasts and rebel soldiers. Can you survive attacks from all your enemies and extremely difficult bosses?","imageUrl":"https://media.rawg.io/media/screenshots/cc5/cc542cb4ceaa5bfe133f0c50769ab9ea.jpg","releaseYear":2016,"developer":"Coconut Island Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":11656,"name":"Arcane Worlds","genre":"Action","price":0.0,"description":"A game inspired by classic Magic Carpet, with modern graphics and features. You play as a sorcerer, exploring mysterious worlds, changing them, discovering ancient secrets, creating new spells, fighting creatures and other mages, building and destroying as you please.","imageUrl":"https://media.rawg.io/media/screenshots/b67/b679827f4e5cb46325146d34ba076de3.jpg","releaseYear":2014,"developer":"Ranmantaru Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9646,"name":"TheWave","genre":"Simulation","price":0.0,"description":"Wave is the interstellar music festival of the future you can access at any time from anywhere. Attend next level live concerts, discover mind-bending audio-visual experiences, and rave out with your friends at private dance parties. Make new friends from across the planet as you explore the Wave universe.\n\"As all of my VR experiences so far, exhilarating, great, thought and idea provoking and left me wanting for more!\"\n- Darude\n\"Wave is the first VR experience that captures the excitement of a live performance in a totally original way. While many people are chasing an emulation of a nightclub, Wave is pioneering an entirely new compelling platform that is playful, social, and fun to use.”\n- Morgan Page","imageUrl":"https://media.rawg.io/media/screenshots/f25/f254db7346290b3e678b153dab79962c.jpg","releaseYear":-1,"developer":"The Wave VR","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5617,"name":"NeverDead","genre":"Action","price":0.0,"description":"Over 500 years have passed since a mortal named Bryce Boltzmann endured a life-altering tragedy at the hands of Astaroth, the Demon King. His wife murdered, left defeated and rendered immortal, he now moves through life without aspirations other than finding his next drink. Alongside the clandestine group, National Anti-Demon Agency, he pursues redemption through the extermination of demonic forces along with his agency partner, Arcadia.","imageUrl":"https://media.rawg.io/media/games/9fa/9fae4dcb6dcdb15bba0ccdeef81b43b3.jpg","releaseYear":2012,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":783847,"name":"Prince of Suburbia - Part 1","genre":"Indie","price":0.0,"description":"Prince of Suburbia is a kinetic adult visual novel that will never leave you with blue balls. Simple sandbox navigation leads through a silly story full of hot women just waiting to seduce you, and be seduced by you.\n*Relationships marked with an asterisk are fully customizable.\nMedical research gone awry\nYour step-mom* Catherine is a medical researcher who is drowning in bills. She needs to prove her new fertility medication is safe for human consumption, and fast. How will the side effects of this experimental drug affect her, and those around her?\n\nNaughty neighbors\nYour M.I.L.F. neighbor, Naomi, and her daughter, Heather, have devious plans for you and the women you live with. Will you fall victim to their seductions, or turn the tables on them?\n\nA crowded home\nYour step-sister* Sarah is struggling with her own issues and seems to push away everyone who cares about her. Will she ever open up to you and accept your… help?\nTo add to the chaos, step-aunt* Sonia and step-cousin* Fiona also need a place to stay. Will they be polite houseguests welcomed with open arms, or will they make themselves a little too comfortable?\n","imageUrl":"https://media.rawg.io/media/screenshots/907/90738715f735af95811e292ede73ed44.jpg","releaseYear":2022,"developer":"ViM Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":736198,"name":"Mago: The Villain's Burger","genre":"Action","price":0.0,"description":"⭐A nostalgic experience worth your time⭐\n\n\nA classic magical adventure with beautiful pixel art and intuitive controls. Travel a vast world with many levels, mini-games, and secret locations!\n\n⭐Unique areas to explore each with its own mechanics and challanges⭐\n\n\nHand-crafter levels, each with its own mechanics: from colorful teapot prairie, a humongous tree guarded by a fierce centipede, to ancient ruins of a mysterious civilization that rests on the back of a huge bird - this journey has it all!\n\n⭐You get a wand. You also get a mecha!⭐\n\n\nUse your magic wand to purify evil from the world, solve riddles by affecting your surroundings. Some levels allow you to use a powerful mecha robot. It's time to show the villain's enemies what you are made of (metal, mostly)!\n\n⭐A great variety of bosses and enemies as well as collectibles to unlock⭐\n\n\nEach level presents a different challenge, each boss - a new threat to overcome.\nBy collecting secret orbs in each level you unlock new items and improvements. Can you find them all?\n\n⭐Chill in a beautiful town of Musicalia⭐\n\n\nLooking to take a break? In the town of Musicalia you can buy new upgrades and meet interesting characters, some you might even recognize!\n\n⭐An amazing soundtrack⭐\n\n\n•Listen to a beautiful soundtrack brimming with nostalgia that will instantly bring back the nostalgia of the golden age of video games.","imageUrl":"https://media.rawg.io/media/screenshots/d27/d27e40c278164b4b1874b1354402396f.jpg","releaseYear":2022,"developer":"Dream Potion Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":558979,"name":"Legend of Mana Remastered","genre":"Action","price":0.0,"description":"Set off on a journey to find the mystical Mana Tree seen in a dream, before discovering... the world map is empty! During your travels, you’ll acquire special artifacts; place these wherever you’d like on the map to bring towns and dungeons to life and advance the story.\n\nMeet a colorful cast of characters, square off against fearsome monsters, and complete quests in the vast world of Fa’Diel. Not only has the music been rearranged for this remaster,  you can also alternate between the new and original soundtrack. Other features have also been added, including the ability to turn off enemy encounters, and the never-before released mini-game \"Ring Ring Land\".","imageUrl":"https://media.rawg.io/media/games/127/127c615360180c775c5d30cb46b0320f.jpg","releaseYear":2021,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"}]},{"id":510131,"name":"Scene It? LCA","genre":"Desconocido","price":0.0,"description":"From the makers of the DVD-based board game comes Scene It? Lights, Camera, Action.","imageUrl":"https://media.rawg.io/media/screenshots/e6b/e6b1a07ea5752a56a93ba47227b5db37.jpg","releaseYear":-1,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":490428,"name":"Chronos: Before the Ashes","genre":"Action","price":0.0,"description":"Chronos is an atmospheric RPG that chronicles one young hero’s lifelong quest to save their homeland from a great evil.  Central to this quest is an ancient labyrinth, which holds the secrets necessary to restore life and peace to their home.  However, the architects of this labyrinth designed it to open only once a year.  The labyrinth is a test, and each time the hero fails they are cast out and must wait one year to return. \r\n\r\n* Adventure RPG - Refreshing combination of Adventure Game elements and RPG mechanics.\r\n* VR - Explore an atmospheric fantasy world in full Virtual Reality.  The level of immersion, scale and detail is incredible!\r\n* Unique leveling mechanic - Each journey into the labyrinth cost the Hero a measure of his life. Player’s must adapt to their advancing age as they progress their character; start the game young , nimble and quick, and end wise and more attuned to magic.\r\n* Unlock the Secrets of the Labyrinth - There are many mysteries behind the origins of the labyrinth.  Who built it?  Why did they build it?  What does it do?","imageUrl":"https://media.rawg.io/media/games/e0f/e0f05365c4034eea5a2f085142319d89.jpg","releaseYear":2020,"developer":"THQ Nordic","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":460925,"name":"Dread X Collection","genre":"Action","price":0.0,"description":"Horror, at its core, is primal. You don't need a multi-million dollar design budget or advanced realtime bullet physics to make something scary. You just have to have an idea that is raw, and the honesty to execute it.\nP.T. perfectly illustrates this point. It takes place entirely in one hallway. It didn't have complicated AI. There weren't a dozen characters to design and model. Hell, there weren't even that many scares. And it was absolutely terrifying. It distilled the concepts of the ill-fated Silent Hills into a dense moment of terror. It was its own compact experience, and a glimpse into something much more.\nMany games have tried to imitate P.T. in content. A million spooky hallways with a trillion collectible notes. Some of these are fantastic. But what about that concept? To distill your dream project into something condensed, raw, and real?\nThat was the question posed to 10 brilliant creators. Make a P.T. for the horror project of your dreams. Both a game on its own, and a window into a much larger world. Make it raw. Make it real. Make it a reflection of your own fears. Make it in just 7 days.\nAnd they did. This is the Dread X Collection.The Creators/Creations\nAirdorf - SUMMER NIGHT: From the creator of FAITH. Run around in your backyard picking toadstools and chasing monkeys in this LCD handheld game where nothing scary happens!\nOddbreeze Games - The Pay is Nice: From the creator of Crew 167: The Grand Block Odyssey. Discover what happens in an ultra secure facility, as you get ready for work and wander the dark halls of your office. Using old school fixed-camera perspective, they're watching your every moves.\nScythe Dev Team - Carthanc: From the people that brought you Northbury Grove: Entity, Walls Closing In, Happy's Humble Burger Barn, and the rest of the Scythe Saga Universe. Explore the ruins of an ancient society on a dead planet.\nStrange Scaffold - Mr. Bucket Told Me To: From the creator of An Airport for Aliens Currently Run By Dogs and the writer of Hypnospace Outlaw. The abandoned tools of your existence come back to haunt you in a surreal and terrifying tropical survival adventure.\nTorple Dook - Hand of Doom: From the co-creator of Earl's Day Off. Trapped in an arcane realm by the dark sorcery of the ubiquitous Master, can you learn the correct rituals and incantations needed to escape?\nDavid Szymanski - The Pony Factory: From the creator of DUSK, Fingerbones, and The Moon Sliver. Winston thought he could use hell energy to create magical ponies.  Winston was wrong.\nMahelyk - Outsiders: From the creator of SCP: Blackout. Enter a world of uncertainly as you discover the truth behind the house, and behind the Outsiders.\nLovely Hellplace - Shatter: From the creator of Dread Delusion. In the ruins of future Britain, new gods rule the wastes.\nSnowrunner Productions - Rotgut: From the creator of Soda Drinker Pro. Crystal Tigers Presents: The Circle World Party!\nSecret Cow Level - Don't Go Out: From the creator of Doomtrooper and one of the minds behind Fallout: New Vegas. Run. Hide. Sacrifice your friends. Survive the night.Partial Proceeds Go To Charity","imageUrl":"https://media.rawg.io/media/screenshots/1de/1deb120b677bb06be58030e56cb791c1.jpg","releaseYear":2020,"developer":"David Szymanski","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":383610,"name":"Unsouled","genre":"Action","price":0.0,"description":"Face your fate  – Set in a beautiful but haunting world, Unsouled is an atmospheric Action-RPG about a mysterious power used with deadly purpose. Featuring highly-stylized combat that’s fast-paced and rewarding, there’s less focus on puzzling so no time is wasted on finding the way forward on your journey. Follow the path of fate, and face the challenges that lie ahead in this new game from independent developer Jinsub Jung.\nUnravel the tale – Follow the story of a boy and girl with fate intertwined, brought together through a shared ability to absorb the souls of the dead. Discover how they use this power with different intent through environmental storytelling, where more is revealed by interacting with the world around you.\nCombine deadly attacks – Counter your opponent and strike, using sword slashes, dashes, and soul powers in a graceful combat system that rewards player dedication. With a variety of unlockable abilities and an additional Training mode, you can learn to quickly dispatch enemies with a lethal arsenal of powerful chain combo attacks.\nStrengthen your resolve – Absorb the souls of the fallen and use them to grow your power. Enhance strength, learn new skills, and improve combat abilities.\nExplore detailed environments – Played from a top-down perspective but developed in 3D, Unsouled has a richly detailed world brought to life by a distinctive pixel art-style and ambient audio design.\nPlay Unlimited Mode – After finishing the story, challenge yourself in Unlimited Mode and face off against a relentless wave of never-ending enemies to see how long you can survive.","imageUrl":"https://media.rawg.io/media/screenshots/444/44418b570704f14b567cddeddeaa0607.jpg","releaseYear":2022,"developer":"MeGusta Game","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":353490,"name":"Hello Neighbor Alpha 3","genre":"Adventure","price":0.0,"description":"Good old memories, huh? This is a ALPHA#3 VERSION of the famous Hello Neighbor.\nHello Neighbor is a stealth horror game about sneaking into your neighbor's house to figure out what horrible secrets he's hiding in the basement. You play against an advanced AI that learns from your every move. Really enjoying climbing through that backyard window? Expect a bear trap there. Sneaking through the front door? There'll be cameras there soon. Trying to escape? The Neighbor will find a shortcut and catch you.\nSuspenseful horror gameplay that focuses on sneaking around your neighbor's house\nConstantly evolving experience where the Neighbor's AI counters your moves, and learns from what you do\nSandbox-style gameplay with plenty of environmental interaction and physics","imageUrl":"https://media.rawg.io/media/screenshots/b5b/b5b152961c2f6c8adbdf527804584484.jpg","releaseYear":2019,"developer":"Dynamic Pixels","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":349700,"name":"Hundred Days - Winemaking Simulator","genre":"Strategy","price":0.0,"description":"In Hundred Days you will have complete control of a new winery, you will have to choose which vines to grow and how to grow them and when to harvest, you will have to follow the entire winemaking process and make the choices that best suit the type of wine you want to produce or that market requires. You will also have to sell the wine produced to allow your company to expand.\nAs in reality, every choice made, from the vineyard to the sales, will be able to influence the wine produced both quantitatively and qualitatively. A quality wine will increase the reputation of your company worldwide, it may have come at a higher price and will allow you to grow better and faster.\nSimulative and realistic approach suitable for both beginners and more experienced players\nThe ability to cultivate different types of vine\nAnalyze the soil and choose the grape variety that best suits those characteristics\nOrganize work in the vineyard such as pruning or chipping\nProtect your vines through specific treatments depending on the type of disease\nCheck the state of ripeness of the grapes and decide when to harvest\nFollow the winemaking processes and enhance the characteristics of your wine\nSelect the yeasts and bacteria used during fermentation\nDecide how and which of your wines age with aging\nCustomize your bottles by choosing their shape, color and other aesthetic characteristics\nCreate your sales network and adapt the characteristics of your product to the type of customer\nManage marketing and social activities to increase the reputation of your company","imageUrl":"https://media.rawg.io/media/screenshots/8b2/8b2f4cffdd3df178e1004ef75010a9c7_ubQVvHB.jpg","releaseYear":2021,"developer":"Nuverse","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":278011,"name":"I hate this game","genre":"Indie","price":0.0,"description":"Each level is a new mechanic. It will be funny!\nMore than a hundred levels. 100 ordinary, 10 extra complex and 15 secret!\nUse the environment. Everything you see on the screen can help you get through, even an interface or a mouse!\nRetro atmosphere. Stylish pixel art graphics in two colors that can be customized!\nFresh Chiptune / 8bit Soundtrack by HateBit!\nThe main character like the last idiot got on a clickbait and downloaded \"the best game ever\". Mysteriously, he got inside the computer and to get out, he has to solve all the puzzles and just survive.\nGame developed Pixel Error\nMusic by HateBit\nIntro comics - Oblom studio","imageUrl":"https://media.rawg.io/media/games/2d7/2d70601263923e4d6217f51c809e9ad7.jpg","releaseYear":2019,"developer":"Pixel Error","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":258401,"name":"Legends of Aria","genre":"RPG","price":0.0,"description":"Living, Breathing MMORPGExplore a true open world without limitation. Build, explore and adventure with thousands of players in a living breathing world defined by you.Skill Based WorldLegends of Aria returns to a true skill based system. Build your character your way, be you a crafter, adventurer, merchant or humble fisherman. Hone your skills through use and play your way with a choice of over 32 unique skills.Return to a True SandboxLegends of Aria is inspired by the original sandbox MMORPGs. Experience a world that does not hold your hand. A world driven by you and shaped by our community. A world of dangers, where friendships, enemies made and your actions written into legend.Community Servers and ModdingThe first MMORPG to fully support player run servers. Legends of Aria is designed to be modded from top to bottom including custom gameplay rules, custom content and even entirely custom created worlds.","imageUrl":"https://media.rawg.io/media/screenshots/535/535b324ac04e60a5da9062bab749381e.jpg","releaseYear":2018,"developer":"Citadel Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":65329,"name":"One Night","genre":"Adventure","price":0.0,"description":"Can you survive the horrors of the Complex?\nFirst released in 2009, One Night is a survival horror game that combines the gameplay of Playstation-era classics such as Resident Evil and Parasite Eve with a 16-bit aesthetic inspired by modern indie games. At long last, this RPG Maker classic comes to Steam as One Night: Ultimate Edition, updated with a brand new engine, overhauled gameplay mechanics and a completely rewritten storyline.\nSet in an alternate version of the year 2012, One Night challenges you to escape from a top-secret research facility known only as \"The Complex\", a place fallen to forces that defy explanation. Everybody you knew is dead, and something has gone terribly wrong. Now relentless monsters and fiendish puzzles await you around every corner as you attempt to make your escape from a literal Hell on Earth.\nTraditional survival horror gameplay in the style of 90s classics.\nTerrifying story that blends science fiction with H.P Lovecraft.\nMultiple endings and NPCs that live or die based on your actions.\nUpdated for modern configurations and operating systems.\nCompletely free to play!","imageUrl":"https://media.rawg.io/media/screenshots/e33/e33193dcf84faa32fd940d2be3612221.jpg","releaseYear":2013,"developer":"Dark Gaia Studios","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":57816,"name":"Suikoden II","genre":"RPG","price":0.0,"description":"Suikoden II (幻想水滸伝II, Hepburn: Gensō Suikoden Tsū) is a role-playing video game developed and published by Konami for the PlayStation video game console and the second installment of the Suikoden video game series. It was released in late 1998 in Japan, 1999 in North America, and in 2000 in Europe. The game features a vast array of characters, with over 100 recruitable characters, of which over 40 are usable in combat, and many more who move the plot forward.\nSuikoden II takes place years after the events of the original Suikoden, and centers on an invasion of the City States of Jowston by the Kingdom of Highland. The player controls a silent protagonist whose name is chosen by the player (named Riou in the Japanese novelization and Drama CD adaptation and Tao in the manga adaptation); he is the adopted son of Genkaku, a hero who saved the City-State of Jowston in a war against Highland years ago. The protagonist and his best friend, Jowy Atreides, each gain one half of the Rune of the Beginning, one of the 27 True Runes of the Suikoden setting, and become caught up in the intrigues of the invasion and the dark fate of those who bear the halves of that Rune.","imageUrl":"https://media.rawg.io/media/games/bf3/bf312ce4aec593cd4d58f8aebee8eb35.jpg","releaseYear":1998,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":55278,"name":"Kirby's Dream Land (1992)","genre":"Action","price":0.0,"description":"Kirby's Dream Land is a video game developed by HAL Laboratory and published by Nintendo for the Game Boy. Released in 1992, it is both the first video game in the Kirby series and the debut of Kirby himself. As the inaugural Kirby title it created many conventions that would appear in later games in the series. However, Kirby's trademark \"copy\" ability would not appear until Kirby's Adventure, released less than one year later.\nKirby's Dream Land was designed by Masahiro Sakurai, who intended it to be a simple game that could be easy to pick up and play even by those unfamiliar with action games. For more advanced players, he offered additional optional challenges such as an unlockable hard mode and the ability to edit Kirby's maximum HP and starting number of lives. Kirby's Dream Land was re-released on the Nintendo 3DS via the Virtual Console in 2011 and is also one of the games included in the compilation game Kirby's Dream Collection for the Wii, released to celebrate Kirby's 20th anniversary.","imageUrl":"https://media.rawg.io/media/screenshots/fac/fac07d83728a3733cf6edc11b478f75a.jpg","releaseYear":1992,"developer":"HAL Laboratory","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"}]},{"id":54255,"name":"Ecco the Dolphin (1992)","genre":"Desconocido","price":0.0,"description":"Ecco the Dolphin is an action-adventure game originally developed by Ed Annunziata and Novotrade International for the Sega Genesis and published by Sega in 1992. Ecco the Dolphin was republished digitally via Nintendo's Virtual Console in 2006, Microsoft's Xbox Live Arcade, Steam, iOS, and Nintendo 3DS.\nIt is the first installment in the Ecco the Dolphin video game franchise. The player character is a bottlenose dolphin who travels through time to combat hostile extraterrestrials in Earth's oceans and on an alien spacecraft.","imageUrl":"https://media.rawg.io/media/screenshots/64a/64af1ca2f537454750e658de96422e2f.jpg","releaseYear":1992,"developer":"Appaloosa Interactive","libraryGames":null,"platforms":[{"id":0,"name":"SEGA Master System"},{"id":0,"name":"iOS"},{"id":0,"name":"Game Gear"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Genesis"},{"id":0,"name":"Wii"}]},{"id":46952,"name":"You Must be 18 or Older to Enter","genre":"Action","price":0.0,"description":"You're alone at home in the 1990s, and you heard about grown-up websites at school. How deep can you dive into the Internet without being caught? Do you even like this stuff?\nEver miss the anxious feeling of being a kid exploring adult websites for the first time? We have good news for you! Through interactive fiction elements combined with ASCII styled art,You Must be 18 or Older to Enterblurs several genres together to bring you that exact terrifying experience.You Must be 18 or Older to Enter is a short alternative text-based horror game.\nThere are no monsters.\nThere is no death.\nOnly you,\n1990s Internet,\nand the fear of being caught.\nIt is also free.","imageUrl":"https://media.rawg.io/media/screenshots/026/02624fe3d2efc749135ae0fa790a491a.jpg","releaseYear":2015,"developer":"Seemingly Pointless","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45660,"name":"Super Bunny Man","genre":"Action","price":0.0,"description":"The best game ever made about a guy in a rabbit costume jumping through wormholes, traversing time and space on a challenging journey in search of something non-specific that will leave you with intense feelings of [INSERT FAVORITE EMOTION HERE]!\nSuper Bunny Man is a physics-based couch-coop platformer where you use rolling, jumping, and grabbing to overcome challenges. Beat levels, time attacks, find hidden carrots, all while evading spikes, boulders, pitfalls, and other challenges!Features:Campaign mode: 30 levels of stimulating challenges, spread across 3 amazing worlds (more coming soon)! Play them in singleplayer, or team up with a friend for 2-player cooperative (or uncooperative) mode! Every level has extra challenges in addition to completion: Time attack challenges: Prove your skills on every level with a race against the clock! Carrot challenge: A carrot placed somewhere on every level. Find it and take it with you to the wormhole! High in Vitamin-C!\nDeathmatch mode: Get together with up to 4 players in local multiplayer deathmatch mode! Kick them off cliffs, drag them onto spikes, break their necks! (Disclaimer: not recommended for fragile or strained friendships).\nPhysics-based character and world: Master control of the rabbit costume to get faster and stronger!\nAnd more!\nController support for up to 4 players!\nMind-blowing 2.5D computer-generated graphical images.\nEvocative musical soundtrack, with grooves so addictive they've been banned in dance clubs across the world.\nUnbelievable dance moves.\nCurrently in Early Access, with many more features and levels planned!","imageUrl":"https://media.rawg.io/media/screenshots/caf/cafa21ae8b37c0a4ceb8af27fb1ce3fe.jpg","releaseYear":2017,"developer":"Catobyte","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45163,"name":"Connected Hearts - Visual novel","genre":"Simulation","price":0.0,"description":"Type: Visual Novel\nLanguage: English\nGenre: Thriller, Mystery, fantasy\nDuration: Approximately 6 hours\nPublic: +15\nPlatforms: Windows, Linux, MacSynopsis:\nShortly after moving out Gary has a strange dream where he meets a woman who responds to the name of Alice, who tells him he left a promise unfulfilled. That would be the beginning of a series of inexplicable events that will take him to visit different dreamlike places and to meet people he can’t remember ever seeing before.","imageUrl":"https://media.rawg.io/media/screenshots/116/116f42d39f7320ecf3b25a40453c97a2.jpg","releaseYear":2017,"developer":"Eternal Night Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":44745,"name":"Solar Gun","genre":"Casual","price":0.0,"description":"Will you be able to escape alive from the factory? Manage the light wisely, unlock new levels and try to find a way out.<h3>Key Features</h3><br/><ul><li>More than 16 different puzzles for players of any skill level<br/></li><li>Avoid the mortal floor, handle the laser lights and manage your orbs to go throught the installations.<br/></li><li>But be careful! Death affects the way how puzzles can be solved.<br/></li><li>Find the hidden minigames<br/></li><li>Speedrun mode</li></ul>","imageUrl":"https://media.rawg.io/media/screenshots/8a6/8a660e0b640d9f9ac749de0a28b46303.jpg","releaseYear":2017,"developer":"Mechanical Boss","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":44375,"name":"The Slimeking's Tower","genre":"Action","price":0.0,"description":"The Slimeking's Tower\nThe Slimeking's Tower is a roguelike game where you'll have to reach the upper floor of a tower where the grumpy king of the slimes is waiting for you to kick his sticky face and retrieve your people's moustaches back!\nThousands of people have already played The Slimking's Tower on their Android devices, now is your turn to do so on your PC.\nFeatures\nExplore a procedural generated tower that changes every time you play.\nCollect over 300 items as you explore the tower that will change the way you play.\nUnlock different characters with unique abilities and equipment.\nFive different gamemodes to master.\nProve yourself by beating 20 deadly challenges.\nSlay over 100 different enemies and bosses.","imageUrl":"https://media.rawg.io/media/screenshots/9ea/9ea33d58b064987f903f2b698d4a90af.jpg","releaseYear":2017,"developer":"CodeManu","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":43844,"name":"Still Not Dead","genre":"Action","price":0.0,"description":"Still Not Dead is DOOM + NUCLEAR THRONE\nShoot everything that moves with super slick and satisfying gunplay in order to unlock the exits before death arrives to chase you out of the stage. Collect money to buy more than 30+ randomly spawning items and weapons. Pick a blessing or curse before moving onto the next procedurally generated stage, which drastically changes how each run plays out. Each stages becomes more bloody and brutal as you progress so make good use of your time before death comes for you. The game combines satisfying gunplay with open environments and tactical semi-random gameplay with a lot of choice as you manage your weapons, items, money, health, stamina, stage time, monsters, blessings, curses..etc\nFEATURES: 30+ unique weapons and items\n40+ blessings and curses that change how you approach each run\nFully destructible environments, dynamic fire and weather system\nMassive hordes of monsters in an open sandbox world\n'Pick up n play' gameplay, gets you right into the game\nHand drawn pixel-art and original soundtrack\nA DEV THAT CARES: Check the discussion boards, I read them and respond\nI have over 10 years experience making games such as: Use Boxmen, SkullFace, Tony Eagle..etc (which you can play online, some of which have won awards)\nI respond to every review and video I can find\nI frequently update the game during early access","imageUrl":"https://media.rawg.io/media/screenshots/1ee/1ee57d14763ad9bcf217f509bf8d8f36.jpg","releaseYear":2017,"developer":"Greg Sergeant","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":43456,"name":"Nebula Online","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/038/03848e268034a47f91a9f0ab29ac25dc.jpg","releaseYear":2016,"developer":"Komar Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":39209,"name":"Rag Doll Kung Fu: Fists of Plastic","genre":"Arcade","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/e56/e56fc9ee27deb9a3e81da8073e4f0900.jpg","releaseYear":2009,"developer":"Tarsier Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":39108,"name":"Fallout 3: Operation Anchorage","genre":"Action","price":0.0,"description":"The Brotherhood Outcasts are trying to acquire advanced military technology, and the only way to open the vault containing these relics is by completing a tactical simulation only you can enter. In Operation: Anchorage you will re-live the epic Battle of Anchorage from Fallout® lore. Find your way into the simulation, stripped of resources, and survive within the rules set up by the simulation’s creators.","imageUrl":"https://media.rawg.io/media/games/eca/ecafb7c1bbaaea68ea32a07fa0dfda15.jpg","releaseYear":2009,"developer":"Bethesda Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":37615,"name":"Sonic Riders","genre":"Racing","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/981/981aa1ec5f3a170701a5ebb5ee266e97.jpg","releaseYear":2006,"developer":"Sonic Team","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":29886,"name":"Pushover","genre":"Adventure","price":0.0,"description":"Help G.I. Ant to gain access to the crazy world of Captain Rat's Treasure Caves.\nThe game consists of 100 levels of increasing complexity over nine different themed worlds. Each level features several interconnected platforms holding a number of \"dominoes\". The aim is to rearrange the dominoes, such that with a single push, all of the dominoes are toppled, thus opening the exit to the next level. There are 11 different types of domino, identified by red and yellow patterns, each with different actions. The player controls G.I. Ant, who can move certain dominoes by carrying them one at a time.\nVarious factors can result in failure to complete a level. As well as toppling all of the dominoes, the player must be able to access the exit door once the dominoes have fallen. For instance, the player will be unable to reach the exit if a ledge leading to the exit has been destroyed, or if a gap leading to the exit has not been bridged, or if a line of dominoes lie across the exit. G.I. Ant may die by falling from a large height, by falling off the bottom of the screen, or by being crushed under a falling domino. The player is then greeted with the message \"You Failed, You Died\" and has to restart the level. Also, the level will be failed if any dominoes are destroyed by landing one domino on top of another.\nEach level has a time limit during which it must be completed. However, if the time runs out the player is still able to continue with the puzzle if they wish. By pausing the game once the time has run out, a small hint will be displayed, giving advice on how to complete the level. As a side note, the hint for level 98 informs the player that the game's designer cannot remember how to complete the level without trickery (\"Use a drop! There is a way to make it work with a push, but I can't find it!\").","imageUrl":"https://media.rawg.io/media/screenshots/8dd/8dd23d8d30d988035a06a8f8c462f135.jpg","releaseYear":1991,"developer":"Ocean Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Atari ST"},{"id":0,"name":"SNES"},{"id":0,"name":"Linux"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"macOS"}]},{"id":29092,"name":"Fracture","genre":"Action","price":0.0,"description":"Buy this wonderful game now!","imageUrl":"https://media.rawg.io/media/games/54d/54d551cdcf270bc0d4054612e820e4c2.jpg","releaseYear":2008,"developer":"Day 1 Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":20244,"name":"Disillusions Manga Horror","genre":"Adventure","price":0.0,"description":"Summary : First person horror story, manga character art, 3D visuals and multiplayer.\n- Made by one guy in an Attic and his girlfriend, in their spare time.\n- This game was made for iPod touch many years ago, and brough to PC/Steam by popular demand, expect the game to be of mobile quality.\nThank you for taking interest, please remember to rate and review, and record yourselves if you can! ^_^\n• Explore in first person to proceed in the horror story.\n• Featuring 2D anime manga style character art and 3D environments.\n• Control two characters, DiS and Sui, see how their story connects.\n• Dark, gritty surroundings and eerie audio effects for atmospheric gameplay.\n• Retro indie horror, with a story to kill for.\n• Sandbox multiplayer, place traps, chat and scare other players! **\n• Exploring, trap and chat in all 4 chapters with the multiplayer! **\n- DiS and Vigil are two friends who visit the haunted residence the newspapers have been covering recently. Unbeknownst to them, however, the place is not as abandoned as the press makes out...\n- Be drawn into exploring the mysterious past of the psychotic murderer who once called the place home?\nVisit the original crime scene with Police girl Sui, solve and see how she is involved with the story! Has she been hiding something, are DiS, Sui and Vigil connected somehow?\n* DK2 Oculus rift tested and working for mac/windows.   With    pre-0.6.0  SDK   (Consumer version does not work).\n** Currently Chapter 4 is not playable with Oculus VR, occasionally some multiplayer chapters may be unavailable.\n- - - Change Log - - -\n12 Feb 2015 :\nVarious Map and GUI adjustments\nPlayer max now 64 (lobby)\nTop 50 scores show instead of 100, to load faster\nThinner player collider on multiplayer\nEvents do not delete themselves after set time if triggered\nAdded backup quitting incase no network to disconnect from\nFixed buttons and added Low quality setting to multiplayer maps\nFloor falling fixes in multiplayer\n2 Feb 2015 :\nGerman and Japanese translations improved (thanks Shervrar and Shinji-coo-K)\nAdded Multiplayer / Chapter 4  (V1.0)\nSlightly longer sprint and faster recovery time\nLayout aspect ratio size improvements throughout\nFinal form Sui only shows after completing chapter 3\nBack button appears sooner\nChapters scoring adjusted\nCredits updated\nGrammar fixes\nSkip button added to intros (chapter 1 and 4)\nTouch screen pause button hides on PC version\nMinor map adjustments\nFootsteps and Traps stay spawned for longer\nChapter 4 map slightly smaller so you can find players easier\nChapters 1 2 and 3 converted to multiplayer and playable","imageUrl":"https://media.rawg.io/media/screenshots/e01/e01901f1b2201e5199f0e367b004ef21.jpg","releaseYear":2015,"developer":"StephenAllen","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19018,"name":"Pajama Sam's Lost & Found","genre":"Casual","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameClimb aboard and join Pajama Sam as he jumps and glides through wild worlds, collecting toys, and dodging dangers along the way!\nJunior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.\nFeatures:\nChallenging, arcade-style games for kids ages 3 to 8 (and children of all ages)\nBrand new action with all the quality you'd expect from Humongous Entertainment\nSpecial pass codes allow you to track the progress of an unlimited number of players\nOver 100 levels of toy-toting fun\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/cee/ceece350c74a6c8fb493b6e348d5535b.jpg","releaseYear":2014,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19017,"name":"Pajama Sam's Sock Works","genre":"Casual","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameClimb in and help Pajama Sam control the Sock-O-Matic Mark III, the sock-sorting dream machine the makes chores fun!\nConcentration is the key as Sam tries to control that crazy contraption. Chutes, pushers, slides, and swing arms are just a few of the gadgets you'll need to guide Sam's socks into the baskets. The Sock-O-Matic even has a Custom Level Builder that allows kids to create their own puzzling levels!\nChallenging, arcade-style games for children of all ages.\nBrand new action with all the quality you'd expect from Humongous Entertainment.\nSave your game after each level and track the progress of up to 75 players.\nJunior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/495/495d8d99006540826295aea53aaf0f82.jpg","releaseYear":2014,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18085,"name":"Beyond Space Remastered Edition","genre":"Action","price":0.0,"description":"A BREATHTAKING SPACE ADVENTURE\nBeyond Space is a cutting-edge 3D space shooter game that immerses players in the darkest plots in a similar vein to the best Space Operas.\nScores of planetary systems, nebulas and asteroid fields to explore. Fully detailed 3D Graphics, mesmerizing, beautifully painted spacescapes, spectacular special effects, and rendered glows, lights, sun flares and reflections.\nAll of which intensified with an ambient yet dynamic soundtrack and great sound effects.\nYou are Max Walker, a spacefaring adventurer and pilot-for-hire, who gets drawn into a galaxy-spanning conflict.\nAN EPIC SPACE ODYSSEY WORTHY OF THE GREATEST HOLLYWOOD BLOCKBUSTERS\nOur journey begins when Max Walker starts a contract with the Alliance of Planets and immediately gets drawn into a galaxy-spanning conflict.\nHis mission will take him beyond the reaches of space, while fighting many different opponents and meeting pirate overlords, scheming politicians, deceitful allies and ambitious leaders – all entangled in a space epic that will change the face of the galaxy.\nDive into this original story with its rich and captivating storyline localized in English with English actor-voiced dialogues and cutscenes.\nTAKE CONTROL OF POWERFUL SPACEFIGHTERS\nAboard your ship, show off your pilot skills with barrel rolls and boost jumps, while keeping a close eye on your \"Incoming\" warning system and shaking off tailing enemies and guided missiles...\nUnlock a great variety of ships in the Hangar and select your weapons, shields and afterburners among the dozens of items to create thousands of possible combinations… to face any situation.\nSMART ENEMIES\nEnemies in Beyond Space are smart and characterized by their AI. Different units perform their own battlefield tactics. Fleet Squadrons will gather to strike, whereas pirates will act in a more disorganized manner… making them more unpredictable.\nAdvanced AI with an adjustable difficulty level to keep all players on their toes.","imageUrl":"https://media.rawg.io/media/screenshots/469/469135bc75a481386f2c63f7cd8732d3.jpg","releaseYear":2014,"developer":"Silesia Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]