[{"id":61741,"name":"Supraland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b62/b62581b3e5d0c65268fb33c62865e5df.jpg","description":"Supraland is a mix of Metroid, Portal, Mario and Zelda.\nSolve puzzles and fight cute monsters. Explore the world to find secrets, get upgrades, new abilities and to progress in the world.\nFind the way on your own without the game holding your hand.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Supra Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":487910,"name":"Immortals: Fenyx Rising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d51/d51ada3b94bfd617bf91d4344ab81ce9.jpg","description":"Immortals Fenyx Rising brings grand mythological adventure to life.\nPlay as Fenyx, a new, winged demigod, on a quest to save the Greek gods. The fate of the world is at stake – you are the gods’ last hope.\n\n### Features\n- Wield the powers of the gods like Achilles' sword and Daidalos' wings to battle powerful enemies and solve ancient puzzles.\n- Fight iconic mythological beasts like Cyclops and Medusa in dynamic combat in the air and on the ground.\n- Use your skills and diverse weapons, including selfguided arrows, telekinesis, and more, for devastating damage.\n- Discover a stylized open world across seven unique regions, each inspired by the gods.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":57896,"name":"Mark of the Ninja: Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/55f/55fa333bffb3ad768ea85d590205c9c2.jpeg","description":"You must be silent, agile and clever to outwit your opponents in a world of gorgeous scenery and flowing animation. Marked with cursed tattoos giving you heightened senses, every situation presents you with options. Will you be an unknown, invisible ghost, or a brutal, silent assassin?\n    \nFeatures:\n    \nRemastered HD visuals, audio, cutscenes and effects\n      \nIncludes \"Mark of the Ninja\" Special Edition Expansion (Additional story level, new character, additional items, and developer commentary!)\n      \nTrue Stealth Experience - Player-centric gameplay rewards choice, be  it finishing the game without killing anyone or assassinating all who stand in your way\n      \nStunning Visuals - Unique 2D visual style featuring award-winning  animation and hand-painted environments\n      \nDeep Experience - Each level has three score challenges, optional objectives and hidden collectibles. A diversity of unlockable abilities, items and playstyles allow exploring many avenues of play\n      \nNew Game Plus - Finish the game and unlock this mode, offering new challenges and rewards","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":660,"name":"Killer Instinct","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48f/48fccb824104ff02029e855bbfdcbe45.jpg","description":"A famous series of fighting games, that for a long time, remained an exclusive for consoles. In 2013, the game got a reboot on the Xbox One, and in 2017 the game moved to the PC.\r\n\r\nKiller Instinct of 2017 is all the same one on one melee fights. The developers got inspiration from other legendary games in the genre: attack set was borrowed from Street Fighter series and finishing moves from Mortal Kombat. In the reboot, the Combo Breaker mechanic has been changed a little - now it is necessary to coincide in strength and timing with a counter blow to make a successful break. The plot of the game almost wholly repeats the plot of the first part: each fighter passes the way in a tournament organized by a mega-corporation and fights with the final Fulgore boss. The details of the story are different for each character.\r\n\r\nYou can fight for 20 stages with a dynamically changing environment and destructibility. Besides, the game has all the fighters from the previous parts. The plot campaign with cinematic cut scenes will have to be done alone. With other players, you can compete in online multiplayer, with the online ranking system. To play on a PC, the developers advise using a controller.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Iron Galaxy","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":30119,"name":"Wasteland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ad/5adb88d1c6b9fc4fde1f372c9b6e451b.jpg","description":"Wasteland is a post-apocalyptic RPG developed by Interplay Entertainment.\n\nThe game is set in 2087, decades after the nuclear war between the U.S. and the USSR. Some time ago, a group of U.S. soldiers invade a prison, make it into a stronghold and create an organization called the Desert Rangers in an effort to keep the surrounding area in order. You are the commander of one of the Ranger's squads sent to investigate a series of incidents on the West Coast.\n\nWasteland's mechanics are inspired by tabletop role-playing games, such as Dungeons & Dragons. Every character in Wasteland has a set of stats which allow for using different skills or weapons. Experience is gained after battles or skill usage. The game offers the players many was of succeeding in their objective. For example, if a player encounters a gate, they can either pick its lock using the picklock skill, climb over, force the gate or blow it up.\n\nInitially, the player controls a squad of four which can be expanded up to seven characters. Citizens or wasteland creatures can be recruited. Each member of your squad can disobey your commands. It is noted that the level of difficulty in Wasteland is unforgiving.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Interplay Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Apple II"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":7441,"name":"Rusty Lake Hotel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/156/1560280d5bc572efd0dd88b088112e90.jpg","description":"Welcome our guests to the Rusty Lake Hotel and make sure they will have a pleasant stay. There will be 5 dinners this week. Make sure every dinner is worth dying for!\nRusty Lake Hotel a unique puzzle-escape game with a surreal, strange setting inspired by David Lynch’s TV series Twin Peaks.\nKey features:\nPick-up-and-play: easy to start, but it will be hard to stop\nTons of puzzles: a total of 6 rooms full of unique and various brain teasers\nThrilling and engaging story: there will be 5 dinners with intriguing guests and staff\nFull of suspense and atmosphere: Rusty Lake Hotel is a surreal place, where anything can happen…\nImpressive soundtrack: every room has its own designed theme song\nAchievements: an all-time gallery you never seen before","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rusty Lake","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":3154,"name":"NBA 2K16","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8c7/8c77cb878b8cafe0b5ee5b21d488393b.jpg","description":"Michael Jordan Special EditionThe NBA 2K16 Michael Jordan Special Edition includes the following bonus content:\nDigital Jordan shoes for your MyPLAYER\nJordan T-shirt for your MyPLAYER\nJordan Jersey for your MyPLAYER\n30,000 Virtual Currency\nMyTEAM VIP+: 3 Emerald packs each with a guaranteed Emerald player AND a new Special Edition Exclusive Moments Card\nAbout the GameThe NBA 2K franchise is back with the most true-to-life NBA experience to date with NBA 2K16. Featuring an all-new MyCAREER experience written, directed and produced by acclaimed filmmaker Spike Lee.  Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or hone your skills online competing against gamers from around the world. With animations that provide smoother movement and more realistic articulation, and a unique cover design featuring NBA stars Stephen Curry, Anthony Davis and James Harden, it’s certain to be the most authentic NBA gaming experience yet.\nMyCAREER - A SPIKE LEE JOINTOur most intense first-person narrative to date, written and directed by Spike Lee.  For the first time, manage your off days and earn bonus content through connections, endorsements and a live practice environment.\n2K Pro-AmA groundbreaking new mode featuring fully customizable teams and 5v5 tournaments livestreamed on NBA 2KTV.  Join forces with friends to create the perfect squad all the way down to custom logos, uniforms & arenas, or walk on and join any open game.\nENHANCED GAMEPLAYA new motion engine generates smarter, hyper-realistic movement plus new ball & rim physics and player collisions, leading to a more intense and authentic on-court experience.\nPLAY NOW ONLINEThis year, online head-to-head games matter.  For the first time, your online head-to-head record will determine whether or not you advance to higher levels.  As you level up, you’ll unlock some of the greatest teams from NBA history to use in your games.\nFEATURED DJsDJ Khaled, DJ Mustard and DJ Premier produce our biggest soundtrack to date, featuring 50 dynamic tracks across 5 playlists and exclusive cuts from each DJ.\nPLAY WITH MODERN LEGENDSStep onto the court with 12 new legendary teams, including some of the most epic squads from the past 15 years.\nMyPARKBreak ankles, drop dimes and create a street legacy at one of three newly enhanced parks.  Show off your game to the world in new live-streamed competitive events.\nMyTEAMCollect past and present NBA players and customize your perfect team to go head-to-head in one of five unique game modes.  Enjoy an all-new 3-on-3 online street mode called The Gauntlet, take your team online in Road to the Playoffs, face off against exclusive lineups in Challenges, or dominate current and historic NBA teams in Domination.  Cards and game modes update dynamically throughout the season, ensuring a new experience every time you play.\nMyLEAGUECustom build the league you want.  For the first time, MyLEAGUE Online allows you to create an online league with friends and gamers from around the world.  Play a single season, or up to an 80-year franchise.  Virtually every detail of your league is in your hands.\nMyGMA completely re-imagined franchise experience, the immersion and depth of MyGM has been elevated to new heights.  New features for NBA 2K16 include team relocation, Advanced Team Building, Summer Leagues, 3-team trades, and much more.\nNBA 2KTV2K’s groundbreaking weekly TV show INSIDE a videogame returns for a second season.  Featuring special appearances from NBA stars, coaches and celebrities, game tips with NBA 2K16 producers, user generated content & livestreamed competitions, and exclusive locker code giveaways.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2K","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9989,"name":"I Have No Mouth, and I Must Scream","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a3/0a3a4838159eaf02f7b3d9a805d516d3.jpg","description":"Assume the roles of five different characters, each in a unique environment\nChallenging dilemmas dealing with powerfully charged emotional issues\nProvocative psychological and adult-oriented themes\nBased on Harlan Ellison's short story \"I Have No Mouth, and I Must Scream\", one of the ten most reprinted stories in the English language\nFull digitized speech with over 40 different characters and state of the art animation\nHarlan Ellison as the voice of the insane master computer, AM.\nFIVE DAMNED SOULS: Buried deep within the center of the earth, trapped in the bowels of an insane computer for the past hundred and nine years. Gorrister the suicidal loner, Benny the mutilated brute, Ellen the hysterical phobic, Nimdok the secretive sadist, Ted the cynical paranoid.\nONE CHALLENGE: The adventure plunges you into the tortured and hidden past of the five humans. Delve into their darkest fears. Outwit the Master Computer AM in a game of psychological warfare. Disturbing, compelling. An adventure you won't easily forget !!\nBONUS CONTENT INCLUDED: The Making of I Have No Mouth, and I Must Scream and a full 54 track Soundtrack composed by Legendary composer John Ottman (Check your Steamapps/common/IHNMAIMS/ folder after downloading the game)\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"DotEmu","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13404,"name":"VA-11 Hall-A: Cyberpunk Bartender Action","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c57/c57c9f8ea28b148cf991ac49c1e920f4.jpg","description":"VA-11 HALL-A: Cyberpunk Bartender Action is a booze em' up about waifus, technology, and post-dystopia life.\nIn this world, corporations reign supreme, all human life is infected with nanomachines designed to oppress them, and the terrifying White Knights ensure that everyone obeys the laws.\nBut, this is not about those people.\nYou are a bartender at VA-11 HALL-A, affectionately nicknamed \"Valhalla.\" Although it is just a small bar downtown, it attracts the most fascinating people this side of dystopia. Keep your clients lubricated and you will be made privy to the most interesting stories.\n---\n\"Although there aren't dialogue options, VA-11 HALL-A creates a storytelling experience that's grippingly personal. If, like many game theorists argue, story should always act as a supporter to mechanics, then VA-11 HALL-A is the exception that makes the rule.\" - Kill Screen\n\"Never falls into the trap of simply alternating “gameplay” and “story” as so many narrative-based games do; rather, everything you do feels relevant to what is unfolding in front of you.\" - Moe Gamer\n\"It's through these brief, unguarded conversations that the cyberpunk bartending sim slowly unfolds its story; not of a dystopian world, but of the people living in it.\" - PC Gamer\n---\nLearn about daily life in the cyberpunk dystopia of Glitch City.\nA branching storyline where your decisions do not depend on traditional choices, but through the drinks you prepare.\nVisuals inspired by old Japanese adventure games for the PC-98, with a modern touch for an otherworldly experience.\nGet to know your clients, their tastes, and prepare the drink that will change their lives.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sukeban Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":12092,"name":"Age of Empires III: Complete Collection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/baf/baf902c3d2e800a57c087763d56fc914.jpg","description":"Age of Empires 3 Complete Collection is a real-time strategy, a sequel to Age of Empires II: The Age of Kings. It includes the original game and two expansions: The Warchiefs and The Asian Dynasties, that add new playable civilizations.\n\nLike in previous titles in the series, in Age of Empires 3 you choose and develop a civilization through ages. To progress you gather and manage resources, explore the world, upgrade the technology and units. The series’ new feature is the Home City, a separate powerhouse that provides additional options for your development, including unique upgrades you can use during the match. The goal of the game is to overcome AI or online opponents.\n\nAge of Empires 3 features a political system. With each new age you choose politicians you want to support. They give you a certain bonus, for example, extra supplies or military units.\n\nBesides a free mode, the game has a campaign divided into three acts. Instead of step-by-step development you take control of a civilization at the set time period and complete tasks.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ensemble Studios","platforms":[{"id":0,"name":"PC"}]},{"id":332,"name":"The Elder Scrolls: Legends","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/431/4317e294e88e4c9d77327693b15f499a.jpg","description":"The Elder Scrolls: Legends is a card-based game set in The Elder Scrolls universe developed by Dire Wolf Digital.\r\n\r\n###Story\r\nThe game's story serves as a tutorial for the player. The game takes place during the Great War between the Mid Empire and the Third Aldmer Dominion. The main antagonist of the game is one of the admirals of the Dominion - an altmer named Naarifin who is a Daedric cult adept. He invades the Empire trying to open the gates of Oblivion. The player has to prevent such an event from happening and make difficult choices as these decisions affect the cards the player gets upon completing the story mode.\r\n\r\n###Gameplay\r\nThe game centers around turn-based card matches between two opponents. Several game modes are available: Duel and Arena. In Duel, the players start with their own hand of cards, while in Arena each player picks the hand out of a limited number of cards.\r\n\r\nThe cards are divided into four categories: Creatures, Supports, Actions, and Items. The players decide which Tamriel race they want to play as. This choice affects the additional cards that will be dropped as a reward after leveling up.\r\n\r\nAt the beginning of the match, each player starts out with one magic point and three cards. On each turn, one magic point is granted to the players. The first player to get his enemies health to less than 1 wins.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":22798,"name":"Tyrian 2000","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/126/12649ad4e0ab26d3b395e2923647b4cf.jpg","description":"And you thought being a Terraforming Engineer would be a quiet life compared to being a Space Marine?\nBlasting rocks to make way for new settlements on Tyrian seemed like a quiet life, but your long-time Huzundra friend is now dead - bless his lizard hide. Murdered! And obviously Microsol, the Terraforming company wants you dead too!\nIt's that huge new rock formation you and Buce uncovered - it's Gravitium, and it's priceless. Tyrian is the only planet where it exists in commercial quantities, and Microsol are determined to control it. You can expect them to throw all their resources against you - and they won't pull any punches.\nClassic, oldschool and just awesome vertical schooter gameplay at its best.\nGameplay mechanics that are easy to learn but hard to master.\nShip Editor - create your own ship and rule the skies.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Eclipse Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15365,"name":"Survarium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ed/3ed77f22a7bf8139b096a90bb732e208.jpg","description":"Survarium is a free-to-play MMO shooter with RPG elements, set in a post-apocalyptic future. The most of the Earth’s population was destroyed by ecological catastrophes, and the survivors need to protect themselves from infections and fight mutants to stay alive. It’s an ideological successor of the S.T.A.L.K.E.R. series and is created by former employees of GSC Game World.\n\nYou can customize and develop your character by upgrading different skills, such as musketry, physical strength, medical and technical knowledge and so on. The game features several multiplayer modes, in which teams fight over relicts, collect certain items and play team deathmatches. There is also a PvE team mission. It focuses on exploration and confrontation between players and their AI opponents and tells the story of the in-game world. During this mission you need to complete different tasks on a huge map and reach the control point.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vostok Games","platforms":[{"id":0,"name":"PC"}]},{"id":3416,"name":"Zombie Army Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ea/2ea9a19c60a97c3b164020aa1328f429.jpg","description":"NOW INCLUDES ALL 8 CHARACTERS FROM THE LEFT 4 DEAD GAMES!\n“Co-operative multiplayer done right.” - Eurogamer\n“Proven shooter mechanics and a real sense of fun.” - Wired\n\"A generous wodge of the most enjoyable kind of schlock horror shooting on PC.\" - PC Games N\nThe cult horror shooter series comes to an apocalyptic conclusion with an epic new third chapter, a heart-pumping new horde mode, and remastered editions of the best-selling Nazi Zombie Army 1 & 2.\nIn the dying flames of World War II, Hitler has unleashed one final, unholy gamble – a legion of undead super soldiers that threatens to overwhelm the whole of Europe. Fight alone or team up to save humanity from the zombie menace in this apocalyptic third-person shooter!\nBattle through THREE epic campaigns across 15 demon-infested missions. Play solo or fight back to back in online co-op for 2-4 players. Dare you take on one of the most intense and challenging third-person shooters in gaming?\nFace gruesome enemies with iconic weaponry and powerful explosives. Dismember the undead to give yourself a fighting chance, and experience every putrid lung burst, every rotten bone shatter with the infamous X-ray Kill Camera.\nThe ultimate horror package – alone or with teammates\nExperience THREE nerve-shredding campaigns across FIFTEEN missions of intense third-person action.\nTake the fight to the undead alone, or team up in 2-4 player online co-op.\nFace your fears in the brutal new Horde Mode for 1-4 players, across 5 blood-curdling maps.\nGut-wrenching gunplay\nDefeat harrowing legions of zombies, armoured skeletons, fire demons, chainsaw-wielding elites - and worse - before facing the demonic Führer himself!\nShred the undead with genre-best rifle ballistics, powerful firearms and deadly explosive traps.\nWince as your bullets shred the insides of the undead in gruesome detail with the return of the series’ acclaimed X-ray Kill Camera.\nCustomise your carnage\nChoose from 16 playable characters, including all 8 survivors from Left 4 Dead 1 & 2!\nPerfect your play style with CUSTOMISABLE loadouts - pick your favourite weapons and explosives.\nCustomise your DIFFICULTY and add enemy multipliers. Surely you would never brave “X4” on Sniper Elite difficulty ... or would you?\nRecut. Remastered. Unleashed.\nIncludes the first two Nazi Zombie Army games like you’ve never seen them before.\nPick apart zombies with the new DISMEMBERMENT mechanic and bathe in a bloody glow of NEW graphical effects, NEW audio, NEW enemy animations ... and more.\nPlay your favourite missions from ANY campaign in ANY order in ONE unified online community.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rebellion","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":2548,"name":"Shantae and the Pirate's Curse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5a/a5a8e5820043aa1285643f3d243e5664.jpg","description":"Shantae and the Pirate's Curse is an action platform game, the third installment in WayForward’s Shantae series.  \n\n###Plot \nThe game follows the half-genie Shantae and takes place after an event of the Shantae: Risky’s Revenge. The main heroine abandons her genie powers and stars adjusting to the life of a regular human being. One day she comes across the previous game’s antagonist, a pirate named Risky Boots that tells her about evil and fearsome tyrant Pirate Master sealed long ago by genies wants to revive himself using Dark Magic. Now Shantae must form an unexpected alliance with her past rival to stop Pirate Master. \n\n###Gameplay \nRegarding gameplay, Shantae and the Pirate’s Curse shares many similarities with previous games in the series. It is a 2D side-scroller that is not divided into several levels but rather takes place in one interconnected world. The game mostly consists of fighting enemies, solving puzzles, platforming sections, interacting with different NPC that can give you quests or sell useful items. Since Shantae abandoned her genie powers, in this game you do not use magic abilities, instead of throughout the game you collect different pirate items such as a pistol, a pirate hat, pirate boots, scimitar, and cannon. Each of them gives player new abilities that help in combat, puzzle solving or open previously closed areas of the game world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1575,"name":"World of Tanks Blitz","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/587/58785538b2d3a7226fa2c07d36e02b2b.jpeg","description":"World of Tanks Blitz is a cross-platform action game, aiming at fierce tank combat. \n\n###Gameplay<h3/>\nThe game allows 7v7 battles. The teams are forming randomly, so there can be tanks from different classes (light, medium, heavy and destroyers) and countries (German, UK, USA, and others).\nThe player has to either destroy enemies’ units or capture the neutral base. The base is regarded as taken if your tank stays in a marked zone for a while without getting damaged. The capture proceeds faster as you place more tanks there. Also, there is a superiority mode, which requires the players to win, if they eliminate all foes’ vehicles and gain 1000 win points. Capturing points can earn these points and destroying enemy equipment. There is a possibility to form platoons for two people and to join clans. Many mechanics are taken from the PC-version, for instance, the physics of damage. While moving along the hilly terrain, you can also notice such mechanisms: you can do drift, driving a portable tank on a high-speed. Each map consists of two starting points of the teams. The battlefield itself has many objects and shelters: buildings, bridges, walls, trees.\n\n###Premium features\nThere are two currency systems in the game: credits and gold. You can earn credits from the battles. Both group and individual victories are rewarded. Gold can be purchased for real money, and also received in the course of various actions. Some features of the game become available only if paid in gold.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wargaming Group","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":3834,"name":"Contrast","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f2/5f25cf08217b40b9d8f02f95db1fdc1d.jpg","description":"CONTRAST is a puzzle/platform game where you can move between a fantastic 3D world and a mysterious shadowy universe in 2D in the blink of an eye. Delve into a dreamlike and surreal 1920s world, inspired by the performance art world of vaudeville and film noir, and cradled by a smooth and sultry jazz ambiance.\nIn this universe, where the boundaries between showmanship, magic, intrigue and deception are blurred, you play Dawn, the imaginary friend of a young girl named Didi. You have the power to slip from the 3D dreamscape into the parallel 2D shadow world bound to it. Cast light on a shadowy story by manipulating light sources in the 3D world to distort, enlarge or stretch the 2D shadow world. Manipulating and shifting between light and shadow will be the key elements that you will need to use to solve our world of shadow-based puzzles and help progress Didi's story!\nKey Features\nShift between the physical 3D world and the 2D shadow world, at any lit wall surface\nCreate unique shadow landscapes by manipulating light sources and real world objects, and use this ability to solve mind-bending puzzles\nExperience a new story and world, exploring adult themes through a child’s eyes\nImmerse yourself in a lush vaudevillian world of cabaret singers, circus performers, and magic","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"NVIDIA Lightspeed Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"}]},{"id":28627,"name":"Halo 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/efd/efdc57a6d16ddf185e275c3cf065ac50.jpg","description":"This is the first game from \"Reclaimer Trilogy\" - a new trilogy in the Halo series. The game begins four years after the events of Halo 3. The main character of the series, Master Chief, returns to the game.\nHalo 4 is the story of a cybernetic advanced human organism, Super Master Chief. Master Chief works in close connection with the virtual partner - artificial intelligence construct Cortana. Master Chief and Cortana meet with a menacing unknown during the exploration of an ancient civilization on another planet. The player acts as Master Chief, fighting with two main opponents. The first enemy is the remnants of the Covenant, the former military alliance of extraterrestrial races. Another opponent - Prometheans, mechanical warriors of the Forerunner empire.\nThis new version of the game Halo offers a significant number of weapons, enemy creatures and game modes, missing in previous versions.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"343 Industries","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":19535,"name":"Devil May Cry 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/566/566f53f43aa1bd28c63cf3a4d21440ee.jpg","description":"Devil May Cry 4 is a hack-and-slash adventure by Capcom, and a part of DmC game list being the fourth numeric title in the series out of 6 titles (5 numeric and 1 spin-off) overall. The series and the game, in particular, is considered one of the most canon hack-and-slash adventures, setting the mark for many other titles.\nThe fourth game utilizes the universal gameplay principles for such games: the whole gaming process is divided into levels and getting through one grant the player with the grade from \"D\" to \"SSS.\" The grade ultimately depends on time spent within the mission, avoiding damage and style. The style is a game forming principle of DmC — unbreakable combos, interleaving punches, kicks and shooting: all of the above defines the style. There are two playable characters in DmC — Dante and Nero. Their playstyle differs with unique powers and abilities \nWhile being eccentric on a gameplay style, the game also follows a praised plot: the whole story pivots around Dante and Nero's conflict and includes a tremendous amount of family quarrels, giant swords, and demonic interventions.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":15764,"name":"Gorky 17","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ed/8ed70759ef0c70c42b40c7de79e798fa.jpg","description":"Gorky 17 is a role-playing game set in a fictional polish town of Gorky 17. The town was attacked by mutants and destroyed. Several years after these events a NATO group disappeared near Gorky 17. You take control of the second team sent to find missing allies. Another goal of the game is to reveal the reason why monsters appear.\n\nYou manage a group of three people: Cole Sullivan, the operation leader, and his two subordinates. The characters can be upgraded; the line-up changes during the game. Gorky 17 features several huge locations you can freely explore while some areas require special items to be opened.\n\nThe game features turn-based battles with a heavy tactical accent. You are strictly limited in supplies so wise ammo management is a must. Sometimes you need to fulfill a certain task during fights, such as protecting someone; some fights are time limited. A character’s death leads to restarting the battle.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Hyperion Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16948,"name":"Lethal League","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65b/65b9b6c96f093df897d14844e7b60819_bcrhbi4.jpg","description":"Lethal League - the opportunity to express the most criminal desires. For example, to pierce the face of your opponent. But not directly - in the process of playing baseball.\n\nYou can play six characters on seven rings.\n\nAnti-gravity ball with each stroke accelerates from the speed of the turtle to supersonic speed. Every fifth hit allows you to use a special trick. Each character in the reserve has a pair of very peculiar ways to drive the ball right into the opponent's face. For example, such techniques as acceleration or deceleration of the ball. As a result of using these techniques, the game can obviously become much shorter or stretch in time.\n\nThere are three game modes. Online, estra and versus.\n\nNetwork mode tracks players with a legal copy of LL. This mode allows you to find an opponent with geolocation. Knowing the location of the proposed enemy, you can choose for the fight those whom you know.\n\nThe second option \"extra\" allows you to compete with the computer, improve your playing skills and the speed of reaction to the ball flying towards the face. Also this option allows you to pump your team, opening new skill levels and increasing the palette of skins.\n\nThe third option makes it possible to form teams for the game \"two vs two\", which gives dynamics to a murderous match.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team Reptile","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":42592,"name":"Albion Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c41/c41d38ea6b8428adb64824df2a1a0a26.jpg","description":"Albion Online is a sandbox MMORPG set in an open medieval fantasy world. The game features a player-driven economy where nearly every item is player-crafted. Combine armor pieces and weapons suited to your playstyle in a unique, classless \"you are what you wear\" system. Explore the world, take on other adventurers in thrilling battles, conquer territories, and build a home.\nCraft. Trade. Conquer.\nDive in now and become part of a living fantasy world where everybody matters.Key Features\nFrom basic tools and clothes to mighty armors and powerful weapons – nearly every item in the game is crafted by players, in player-constructed buildings, from resources gathered by players. Buy, sell, and trade with other players at local marketplaces all across the world of Albion. Craft rare and powerful items, then sell them to the highest bidder and grow your fortune.\nWith Albion Online's classless combat system, switching playstyles is as easy as switching gear. Test out new equipment anytime and swap out weapons, armor, and mounts to suit any situation. Hone your character’s skills by crafting new items, or by simply using your favorite equipment.\nFrom solo to small-group to large-scale battles, you'll need strategy, tactics and skill to prevail. Test your skills against other adventurers in high-risk, high-reward full-loot fights, and use every tactic at your disposal to emerge victorious.\nJoin a guild and carve out your own piece of Albion in tactical guild-versus-guild battles. Take over territories for access to incredible resources. Build guild halls and crafting stations, and conquer entire cities to levy taxes and grow your wealth. Track your guild's progress on a constantly-updated leaderboard, and take on leadership roles to bring your guild to new heights of glory.\nClaim a city plot or private island and make it your own. Plant crops to sell or craft into food, raise your own livestock and mounts, and place crafting stations for other players to use for a fee. Stock your house with custom furniture and trophies, build chests to store your growing collection of loot, and hire laborers to keep everything at your homestead running smoothly.\nFrom small scouting bands to massive bosses, from dungeons to full-blown faction bases, the inhabitants of Albion’s open world await your challenge. Explore five beautiful biomes, each with its own challenges. Take on six different factions, each with unique enemies that require their own strategy. Partake in solo or group expeditions – or seek out the ultimate thrill by facing demons and other players alike in Hellgates.\nAlbion Online is a true cross-platform MMO experience. Whether you prefer Windows, Mac, Linux, or even Android or iOS (mobile currently in beta), one account lets you play on all platforms, with all players on a single shared server. Forge alliances with other players worldwide and take part in massive battles to determine the fate of Albion.\nPurchase includes:\nUnlimited access to Albion Online\n30 Days of Premium Status\n2,000 Gold\nTo play Albion Online on Steam, it is necessary to purchase the game through Steam and create a new Albion Online account. Pre-existing Albion Online accounts that were created anywhere other than Steam will not be able to play through the Steam client.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sandbox Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":16817,"name":"Mount & Blade: With Fire & Sword","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf0/bf099b9650d72de1f4940b7bb41ef948.jpg","description":"The most recent part of the role-playing saga Mount & Blade. With Fire & Sword is an independent expansion pack for the original video game. Game’s setting is based on the historical fiction-novella by Henrik Sinkevich. It tells about the of Bogdan Khmelnitsky rebellion against the government of the Polish Commonwealth, and unlike the previous installment in the series, the game takes place in the actual region of the world. Because of the era shift, many elements of the game have been modernized and upgraded - for example, firearms have been added.\n\nThe gameplay is not very different from the previous part: it's all also oriented to the solo action-RPG playthrough with immersive visuals and thick atmosphere. The player is offered to complete quests and tasks to earn fame and find followers. You can choose from five available factions: The Kingdom of Sweden, Cossack Hetmanate, Polish Commonwealth, Muscovite Tsardom, Crimean Khanate.  There is also an opportunity to establish your kingdom.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"TaleWorlds Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":650605,"name":"Cult of the Lamb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ab8/ab8217a1fe2ced388a388722734e6d16.jpg","description":"Start your own cult in a land of false prophets, venturing out into diverse and mysterious regions to build a loyal community of woodland worshippers and spread your Word to become the one true cult.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Massive Monster","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":5158,"name":"Legacy of Kain: Soul Reaver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84d/84da5a0c948592becea7a022e151a8b0.jpg","description":"Legacy of Kain: Soul Reaver is a third-person action-adventure title developed by Crystal Dynamics. It is the direct continuation of Blood Omen: Legacy of Kain and is the second title in the series.\n\n###Plot\nThe game takes place 1500 years after the events of Blood Omen. It tells the story of Raziel, a lieutenant vampire in the Kain's army. Kain almost kills Raziel and throws him down the Lake of the Dead. However, an elder god saves Raziel from death and turns him into a Soul Stealer to help him take revenge on Kain. \n\n###Gameplay\nThe game is completely different from its predecessor. The game is played from the third person with the player being able to move it by themselves.\n\nThe gameplay is based on the ability to travel between the material and spirit worlds. This allows the player to continue on the game's plot. The item interaction in the spirit world is limited, yet it also benefits Raziel as he can pass the gates that he is unable to go through in the material world. Many of the game's puzzles are based on the differences between these two worlds. The puzzle environment of the material world can be completely different in the spirit one.\n\nThe game's combat system is based on the hack and slash principle and consists out of multiple attacks and finishing moves. The enemies of Raziel are divided into three groups: humans, spirit beings, and vampires. The main feature of the combat system is the usage of the in-world items as your own weapons.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":1077,"name":"Teslagrad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/351/351ee0915fcd5a64e976791794039d5c.jpg","description":"A journey begins... A treacherous tower... Unravel its mysteries!\nDiscover the secrets kept in the long abandoned Tesla Tower!\nMagnetism and other electromagnetic powers will help you explore a non-linear world of beautiful hand-drawn environments, in a steampunk-inspired vision of old Europe. A young boy suddenly finds himself embroiled in a long-forgotten conspiracy, involving a despotic king who rules the nation with an iron fist. Jump into an outstanding adventure told through voiceless storytelling, writing your own part. Armed with ancient Teslamancer technology and your own ingenuity and creativity, your path lies through the decrepit Tesla Tower and beyond.FeaturesComplex puzzles! Put your sense of logic to the test and cleverly manipulate the world around you using electricity and magnetism, the lifeblood of the game. Puzzles will range from “pff, that wasn't so bad” to keyboard-smashing, controller-chewing frustration.\nExplore! Make your way through rich 2D hand-drawn surroundings as you journey into — and beyond— Tesla Tower, picking up use amazing new items as you go.\nVisual storytelling! Tired of all those words in your video games? Have no fear, Teslagrad features not a single snippet of text or squeak of dialogue. Everything is purely visual, and the entire story is told through what you see (and sometimes what you don't see).\nSteampunk powered! Discover a dystopic and mind-blowing rainy-and-brainy setting, presenting a steampunk vision of an old Europe-inspired new world.\nOld-school boss fights! Use your skills and wits to overcome the 5 incredible final bosses eager to demagnetize you.\nNo disruptions! That means no loading screens, no GUI, no cutscenes. Just the game and you.\nMesmerizing soundtrack! Awesome mix of classical orchestra, with a touch of Russian inspiration and a myriad of metal bits and electrical stuff.\nTeslagrad is available for Windows, Mac OSX and Linux.\n\"It's beautiful minimalist storytelling, and it fits really well with the gameplay proper, which is delightful in more ways than one.\" Jared Rosen, Indiestatik.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Playdigious","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":54122,"name":"Ultima IV: Quest of the Avatar","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/773/7730495e8fc0fe7e1e747cb9449399ac.jpeg","description":"Ultima IV: Quest of the Avatar, first released in 1985 for the Apple II, is the fourth in the series of Ultima role-playing video games. It is the first in the \"Age of Enlightenment\" trilogy, shifting the series from the hack and slash, dungeon crawl gameplay of its \"Age of Darkness\" predecessors towards an ethically-nuanced, story-driven approach. Ultima IV has a much larger game world than its predecessors, with an over world map sixteen times the size of Ultima III and puzzle-filled dungeon rooms to explore. Ultima IV further improves the franchise with dialog improvements, new means of travel and exploration, and world interactivity.\nIn 1996 Computer Gaming World named Ultima IV as #2 on its Best Games of All Time list on the PC. Designer Richard Garriott considers this game to be among his favorites from the Ultima series.","review":"","timePlayed":0.0,"releaseYear":1985,"developer":"Origin Systems","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Atari ST"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Apple II"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"NES"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":30445,"name":"Warcraft 3: Reign of Chaos","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/667/667b4447a90c4896bfd48400ae76af28.jpg","description":"It has been nearly fifteen years since the war between the orcs and humans ended. An uneasy peace settled over the land while, for years, the drums of war were silent. Yet the kingdoms of men grew complacent in their victory - and slowly, the defeated orcish clans regrouped under the banner of a new visionary leader. Now a darker shadow has fallen over the world, threatening to extinguish all life - all hope. The drums of war play upon the winds once again - rising urgently towards the inevitable hour when the skies will rain fire - and the world will tremble before the coming of the Burning Legion. The Day of Judgment has come...","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17085,"name":"Finding Paradise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d6e/d6efe8b1fa59792044e91ec51abbb383.jpg","description":"Dr. Rosalene and Dr. Watts have peculiar jobs: They give people another chance to live, all the way from the very beginning... but only in their patients' heads.\nDue to the severity of the operation, the new life becomes the last thing the patients remember before drawing their last breath. Thus, the operation is only done to people on their deathbeds, to fulfill what they wish they had done with their lives, but didn’t.\nFinding Paradise is the 2nd full episode of To the Moon's series. It follows the life of the doctors' new patient, Colin, as they attempt to unravel a life that is split down the middle, and fulfill a wish that appears to be self-contradictory by nature.\n-------------------------------------------------------------------------------------------\n*Like To the Moon, this is a standalone full game that does not require having played any previous games in the series.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Freebird Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3164,"name":"EA SPORTS FIFA 16","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ea/3ea3f535b2a779ca5cd2e466a2f8abba.jpg","description":"FIFA 16 innovates across the entire pitch to deliver a balanced, authentic, and exciting football experience that lets you play your way, and compete at a higher level. And with all new ways to play!\nWith innovative gameplay features, FIFA 16 brings Confidence in Defending, Control in Midfield, and gives you the tools to create more Moments of Magic than ever before. Fans new to the franchise, or skilled players looking to improve their game will have a chance to Compete at a Higher Level using the all new FIFA Trainer. Innovation Across the Entire Pitch. New Ways to Play. Compete at a Higher Level.\nPlay Beautiful in FIFA 16.\n*Users who have enabled Chat or UGM Restriction on their Sony Entertainment Network account will be unable to access the ''Pro Clubs'' game mode.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-22\n19MB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Electronic Arts Inc.  EA, EA SPORTS, the EA SPORTS logo and Ultimate Team are trademarks of Electronic Arts Inc.  Official FIFA licensed product. © The FIFA name and OLP Logo are copyright or trademark protected by FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc. All other trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":326253,"name":"Age of Empires II: Definitive Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/945/9455733af10406794b0c1b8d117bca76.jpg","description":"Age of Empires II: Definitive Edition celebrates the 20th anniversary of one of the most popular strategy games ever with stunning 4K Ultra HD graphics, a new and fully remastered soundtrack, and brand-new content, “The Last Khans” with 3 new campaigns and 4 new civilizations.\n\nExplore all the original campaigns like never before as well as the best-selling expansions, spanning over 200 hours of gameplay and 1,000 years of human history. Head online to challenge other players with 35 different civilizations in your quest for world domination throughout the ages.\n\nChoose your path to greatness with this definitive remaster to one of the most beloved strategy games of all time.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Forgotten Empires","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":18301,"name":"Swords and Soldiers HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f10/f10e7cafed6665861c58187b2ae3b310.jpg","description":"Swords and Soldiers HD is a remaster of a 2009 two-dimensional sidescrolling game with the elements of a real-time strategy developed by Ronimo Games.\n\nThree factions from different time periods are fighting each other in order to get the power of the gods. There are 10 missions for each faction. The goals are different for each mission. For example, the player may have to destroy the opposing force's base or survive an assault from the enemy. Sometimes the number of units the player can have is limited. The players collect gold to purchase new units and mana to cast magic spells. After the player purchases and builds a unit, they automatically march towards the enemies base and attack every enemy they encounter. The spells can be cast in order to strengthen your own units or attack the enemies. \n\nThe game also features a competitive split-screen multiplayer and other modes that can be unlocked by playing the game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ronimo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":10547,"name":"Yoku's Island Express","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2af/2af88b770803eb5c6a2e16894012ac77.jpg","description":"Yoku has arrived on Mokumana and he’s ready for the easy life, soaking up the sun and delivering parcels on a tropical paradise!\nHowever, an ancient Island deity is trapped in a restless sleep - and it’s all down to Yoku to traverse the island using a unique blend of pinball mechanics, platforming and open world exploration, in an amazing adventure to help those in need!\nFlip and bump our pint-sized protagonist around the stunning hand-painted island on your quest to rebuild the post-office, discover the mystery of the Fruit Altar, and wake an old god from its deep slumber.\n\nKey Features:\n**OPEN-WORLD PINBALL ADVENTURE**: Coupled with its unique pinball platforming play style, Yoku’s Island Express offers non-linear gameplay that gives you the freedom to choose your own path across multiple questlines.\n**WELCOME TO MOKUMANA ISLAND**: Seamlessly Explore multiple regions of the island, including tropical beaches, lush jungles, snowy mountains, mysterious caves, and steamy hot springs!\n**UNLOCK THE MYSTERIES OF THE FRUIT ALTAR**: Collect tasty tropical fruits to purchase amazing new abilities! Vacuum explosive slugs and wake up sleepy villagers with the Noisemaker!\n**CAPTIVATING STORY**: Meet a cast of unforgettable characters across multiple storylines - whilst uncovering the islands deepest secrets. And maybe rebuild the post office too!\n**BEAUTIFUL ARTWORK**: Feast your eyes on the breathtaking, hand-painted artwork created by games industry veteran artists.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":21966,"name":"Ken Follett's The Pillars of the Earth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5d4/5d4cce5d889c3f7a3c2219d5e39f2fdf.jpg","description":"Based on Ken Follett's world-bestseller, ‘The Pillars of the Earth’ retells the story of the village of Kingsbridge in a whole new interactive way. Play as Jack, Aliena, and Philip and change the events of the book through exploration, decision-making, and dialogues. \n\n12th century, England: In a time of great poverty and war, a small town begins the construction of a cathedral to claim wealth and security for its people. In their struggle to survive, lives and destinies intertwine. Philip the monk becomes prior to the small abbey of Kingsbridge. At the same time, a boy called Jack is raised in the woods by his outlawed mother. His apprenticeship as a stonemason paves his way to become a gifted master builder. Together with the disgraced noblewoman Aliena, Jack and Philip begin the construction of one of the greatest cathedrals England will ever see.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"}]},{"id":9840,"name":"We Happy Few","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/537/537974990a025a3edcbe91e408e85fbc.jpg","description":"We Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial in the city of Wellington Wells. In this alternative 1960s England, conformity is key. You’ll have to fight or blend in with the drug-addled inhabitants, most of whom don’t take kindly to people who won’t abide by their not-so-normal rules.\nDiscover the retrofuturistic city’s dark history as you play through the intertwined narratives of three quietly rebellious citizens of Wellington Wells, each with their own strengths and weaknesses, as they face their pasts, prepare for the future, and engage in activities that aren’t exactly status quo in the artificially enthused society.\nSave 15% when you pre-purchase We Happy Few, and get instant access to the game's alpha. This allows you to experience the introduction to Arthur's narrative, explore a portion of the procedurally generated world, collect and craft items, and choose how you’ll interact with members of the Joy-obsessed society through stealth, combat, or conformity across a handful of the game’s unique events.\nPlus, get the exclusive in-game Jolly Brolly weapon at launch. There’s a definite chance of pain when using this weaponized umbrella, complete with advanced blocking capabilities and trippy psychedelic interior.\nRetrofuturistic 1960s England\nSet in retrofuturistic 1960s England, you will find a city ravaged by war and rebuilt by delusionally happy people. Everything appears joyful in Wellington Wells, including its roads, its people, and its omnipresent television personality: Uncle Jack! But, it’s actually a world on the brink of collapse. Come unveil its dark history, and discover how and why its residents came to be so beguilingly happy.\nThree Interwoven Narratives\nPlay as three flawed characters who explore their own connections to the events surrounding the rebuilding of Wellington Wells. They each have a unique storyline in which they interpret and react to the events around them in different ways. As you hide, conform, or fight back as each of them, you will encounter dark humour, a spot of hope, and even some redemption along the way.\nA Dystopia of Your Very Own\nIn We Happy Few, no two playthroughs are alike. While the citizens of Wellington Wells will always want to ensure that you’ve taken your Joy, the procedurally generated world will ensure that your experience with We Happy Few is different and unique.  Wellington Wells is never quite like you remember it.\nTake Your Joy…or Don’t. The Choice is Yours\nCustomize your We Happy Few experience:\n•\tChoose from a range of difficulties for new and experienced players alike,\n•\tPlay through the story, or make your own story by customizing the sandbox,\n•\tMasochistic? Try permadeath!,\n•\tCollect recipes, scavenge items, and craft dozens of weapons, tools, and devices,\n•\tCreep, crush, or conform your way through puzzles and encounters, and\n•\tFight with the crazy weapons you can craft, or fight with your bare hands and don’t kill anyone!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Compulsion Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":5783,"name":"FIFA 14","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ca/9ca31615beee447f3ae1dc9b3b736dce.jpg","description":"FIFA 14 is a football simulation video game which was released on multiple platforms in 2013. Also, it was one of the first game to be released on PlayStation 4 and Xbox One. These versions of FIFA 14 feature a new game engine Ignite. This engine features both graphical and gameplay enchantments. The game also features an improved AI mechanic which created a much more realistic game of football with every player in the stadium being as much realistic as possible. But not only, the players became more realistic as the weather effects became more believable too as well as the crowd which responds in anything that happens on the stadium. \r\n\r\nFIFA 14 offers 33 fully licensed leagues, over 600 different football clubs with over 16,000 players, also 47 fully licensed international teams and legend teams.  \r\nThe famous mod of FIFA 10 called FIFA Ultimate team also returns. It allows players to build their own team from real players and staff with which players can compete both in online and offline tournaments.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":3413,"name":"OlliOlli2: Welcome to Olliwood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5bc/5bceda42f03454a8b9c0d294390eb6d9.jpg","description":"OlliOlli2: Welcome to Olliwood is a game about skateboarding and is a sequel to critically acclaimed OliiOlli. The game takes place in a fictional city of Olliwood where the player has to control an iconic skater from the first game who now has a new look. OlliOlli2: Welcome to Olliwood offers lots of different and colorful locations with more than one track to skate on. There are tons of different ramps in the Olliwood, multi-route levels and also an addition of new combo system which allows players to use manuals, reverts, revert manuals and grind switching which gives much more control over the skater. There are lots of new tricks like Anti-Casper Flips and Darkslides. Also, the game delivers five new worlds, 50 Amateur and Pro Levels as well as 250 new Challenges with a return of famous Daily Grind, Spots and RAD mode. There is also a local multiplayer mode – combo rush, a split-screen four-player mode. There is also an amazing soundtrack composed by Cid Rim, Lone, Faulty DL, Submerse and Mike Slott.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Roll7","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":12606,"name":"Resident Evil 7 / Biohazard 7 Teaser: Beginning Hour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/119/1190d9632988dbe1c6d3001ee51c4c74.jpg","description":"Resident Evil 7 / Biohazard 7 Teaser: Beginning Hour is a free demo version of Resident Evil 7. It’s a first-person survival horror game, a part of the Resident Evil franchise. The Beginning Hour follows a standalone story indirectly connected to the main game.\n\nYou take on the role of an unnamed man that wakes up in an abandoned house. During the exploration you find a tape and see a film crew that was attacked here by someone. You need to follow their way around the house to reveal the truth about its owners. The plot has four endings depending on your actions during the second part of the game.\n\nBoth the main game and its demo version are focused on atmosphere rather than on fights. You have almost no weapons and have to act stealthily. As the Beginning Hour is strictly time-limited it doesn’t feature many monsters or action scenes; the gameplay is based on exploration. The most frightening aspect of the game is its suspenseful atmosphere and the lack of knowledge about the house and its hosts.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":364942,"name":"Unpacking","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c11/c1118fbcfd846c631ecb7646f8efc780.jpg","description":"Unpacking is a zen puzzle game about the familiar experience of pulling possessions out of boxes and fitting them into a new home. Part “item Tetris”, part home decoration, you are invited to create a satisfying living space while learning clues about the life you’re unpacking. Over the course of eight house moves, you are given a chance to experience a sense of intimacy with a character you never see and a story you’re never told.\nFeatures\nUnpack a home -- from a single bedroom to an entire house\nMeditative gameplay with no timers, meters or score\nExplore domestic environments with all their nooks and crannies while you stack plates, hang towels, and arrange bookshelves\nDiscover a character's story through the items that come with her to each new home (and the items that get left behind)\nSoundtrack by BAFTA award-winning composer and audio director Jeff van Dyck","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Witch Beam","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":19646,"name":"Tom Clancy's Splinter Cell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/104/104e82a52297cc7ddd3b05b7e68be04f.jpg","description":"Tom Clancy's Splinter Cell is a stealth-action game developed by Ubisoft Montreal. It is the first installment of the Splinter Cell franchise.\n\n###Plot\nIn 2003, the United States government formed a new covert agency to gather intelligence. It is a top-secret organization named Third Echelon. The agency has access to cutting-edge surveillance and military technologies. Third Echelon's agents are free to violate any law as long as it is required to complete the mission successfully.\n\nIn 2004, contact is lost with a CIA agent. Homeland security sends a second agent to check on the CIA's asset, yet contact is lost again. Third Echelon sends Sam Fischer to investigate the situation.\n\n###Gameplay\nThe game's main focus is to hide from the enemy instead of going loud and gun-blazing. The players have to leave no trace of themselves. It is essential to stick to the shadows, use the environment for cover and carefully pick your equipment to avoid detection.\n\nShadows are the best friend of the player. A special indicator is present on an in-game HUD that shows if the players are visible to their enemies. The game does not welcome the usage of weapons as the sound of gunfire is very loud and can be heard from the distance. The players have to rely on headshots, as they don't have much ammo on them. Sam has multiple advanced gadgets to aid him in his mission as well as a lot of hand-to-hand combat experience.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]}]