[{"id":28448,"name":"Halo: Combat Evolved","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abf/abffd94ed6fe34027c720bee593c06d2.jpg","description":"Humanity is in the midst of a long war against an alien alliance called the Covenant which has been wiping out colony after colony. Your hero is Master Chief, who is given no name beyond his rank in the game itself. He is stationed on the Pillar of Autumn, a ship which, per protocol makes a jump in a random direction to retreat to avoid revealing the location of Earth. They find themselves at the titular Halo, a planet-sized ring of mysterious origin, and function with the Covenant on their heels. Master Chief must repel the Covenant assault and discover the secrets of Halo with the assistance of the female AI Cortana who lives in his suit and gives missions.\n\nHalo: Combat Evolved is a sci-fi first-person shooter with considerable driving elements. Features include friendly NPCs who fight alongside the Chief, squad-based AI where enemies groups work together to flank you under the direction of a leader unit and can be demoralized by his death. They also use cover, set ambushes, etc.\n\nOnly two weapons may be carried at a time: one active and one on backup. There are five human weapons and three Covenant with distinct art styles for the two groups. Human weapons look basically like real guns and fire projectiles. Covenant are sleek and purple and fire energy. For the most part, weapons are not just left around the environment and must be procured from fallen enemies though there are supply points.\n\nYour life is armor and health as in most games of the genre, however, rather than armor being an item that is picked up, it is a force field which quickly recharges itself after several seconds without taking damage, which emphasizes finding cover.\n\nOne of the most significant features is vehicles. You can drive a variety of vehicles in both single-player and multiplayer, some of which have additional seats for passengers or gunners which can be used by AI characters. Vehicles also come in distinct human and Covenant varieties with their design philosophies. Human vehicles roll around the ground on wheels and covenant vehicles hover or fly.\n\nHalo also has a significant multiplayer component with basic deathmatch (called slayer here), capture the flag with the unusual addition that the flag takes your weapon spot while you are holding it, so shooting your way in and out of the base on your own is not an option, territories, and some options unique to the game, such as oddball, where you must hold onto a skull for the longest time, race where you score points by getting to checkpoints and juggernaut, where one super-powered player must get points by killing the others and the other players try to kill him to steal his powers. There is also a game editor which allows you to set custom rules for all the basic game types. All the playable weapons and vehicles from the campaign mode are available in the multiplayer maps with the ability for members of the same team to share the game's distinctive Warthog vehicle, which is essentially a small truck with a mounted gun on the back.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Bungie","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"macOS"}]},{"id":17082,"name":"INK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/213/213a68b31610ab16829d2707f0a6387e.jpg","description":"INK is a fast-paced platformer about using colorful paint to uncover your surroundings.\nINK has a similar feel to hardcore platformers like Super Meat Boy. The object of each level is to defeat all of the enemies in the room (if any) and reach the goal. However, the terrain is invisible to the player. The player can discover terrain by physically bumping into it, or by performing a double jump. The double jump sprays paint bullets out of the player and increases the player’s awareness of their surroundings. If the player happens to bump into spikes or falls to their death, paint will also shoot out from the player’s last position. The room isn’t wiped clean after death so that the player has an easier time navigating after multiple attempts! This expanded Steam version includes new mechanics, Boss encounters to provide a nice challenge and a change of pace.Deluxe EditionThe Deluxe Edition includes a copy of INK plus the Soundtrack + Art DLC all in one place!Key Features75 platforming levels to test your skills\nDefeat challenging Bosses!\nJump on enemies to open the exit portal\nExplore levels by painting them with your double jump or, well, dying. Death has never been so useful!\nExperience the game’s tight and responsive controls that don’t make you feel cheated when you die","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2705,"name":"Action Henk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b75/b75cd7e94fac62cc68b875dfdab3d408.jpg","description":"Run, jump and butt-slide into the glorious toy-filled world of Action Henk! Become a master of momentum and defy physics as you race against a band of ragged 90s action figures to once and for all prove that Action Henk is the fastest of them all!\nWith over 70 tracks all set in different environments, 5 playable characters, dedicated grappling hook levels, a whole host of medals to beat, and a full-fledged level editor, Action Henk is ready to be played on Windows, Mac & Linux.\nChallenging levels: Tackle over 70 unique levels filled with jumps, slides, and tricky shortcuts. Can you master every twist and turn to beat your friends and gain your rightful place on the leaderboards?\nLevel editor: Open up Henk's toybox and construct dazzling levels only limited by your own imagination! Share your tracks with the world, and race your way through vast amounts of user created content!\nChallenge your friends: Load up your favorite levels and race against your friends’ ghosts to see who is truly the best! Beat their times and instantly send them a notification to rub in your newly gained victory. Up for a real challenge? Use the built-in Twitch chat integration to take on up to 20 viewers’ ghosts at once!\nUnlockable characters: Play as the slightly out-of-shape Action Henk or any of the five unlockable action figures, and race through the singleplayer campaign and bonus levels to earn a full toy wardrobe of distinctive skins!\nOnline Multiplayer: Tired of your local friends? Jump onto the internet for real-time races against speed fanatics all around the world!\nBouncing beats:  A pumping soundtrack by demoscene musician Wiklund, a professionally voiced cast of ragged 90s action figures, and sound design by the critically acclaimed Power Up Audio.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":297322,"name":"DISSIDIA FINAL FANTASY NT Free Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a9d/a9d96f9a1927c7745b97be4293ba8dd6.jpg","description":"DISSIDIA® FINAL FANTASY® NT Deluxe Edition\nIncludes:\n- DISSIDIA® FINAL FANTASY® NT Standard Edition                                                                                                                                                                                                                                                  - DFFNT season pass\n\nThe Season Pass includes the following:\nAccess to six characters not in the base game, along with their default weapons and costumes\nTwo colour variations of each of those characters' default costumes\nTwo additional weapons for the above characters\nIt is possible to obtain certain items from the season pass in the base game, but you will receive gil for any items you already possess.\n*To activate the content you need to restart the game\nDISSIDIA® FINAL FANTASY® NT Standard Edition\nDISSIDIA® FINAL FANTASY® NT Standard Edition allows you access to the following content:\n- 28 Characters\n- Access to various game modes including story mode\n*To activate the content you need to restart the game\nDISSIDIA FINAL FANTASY NT Free Edition\nIn DISSIDIA FINAL FANTASY NT Free Edition, you can play part of DISSIDIA FINAL FANTASY NT for free.\nIn the Free Edition, you can play online and offline battles with four pre-selected characters.  The characters change weekly.\nStory mode is not available in the Free Edition.\nSome aspects of the Free Edition differ from the full version of the game (in addition to the differences described above).\nThere are two types of characters: the 28 from the full version, who appear in the weekly lineup for the Free Edition, and DLC characters, who won't appear in the weekly lineup. Please be aware of this when purchasing starter packs.\nYou can battle online against users from the full version.\nYou can carry over your Free Edition save data to the full version.\nAbout the GameWith the struggle between order and chaos quelled by saviours from beyond, the realm was destined to fade from existence. Instead, an arcane power has breathed new lif into it—bestowing these decaying remains with purpose once more. The fight has begun anew, and the world is your arena.\nOver twenty-four of FINAL FANTASY's most recognisable faces have assembled to take part in interdimensional fisticuffs. Face off against other teams in action-packed, three-on-three melees that require sense as well as strength to win. Each combatant can be one of four types: vanguard, assassin, marksman, or specialist; play off your allies' fighting styles, master the bravery system, and emerge triumphant from the clash of steel and sorcery!\nIn addition to standard battles, there will be skirmishes that employ special rulesets, along with cutscenes that tell the story of this reborn world, the gods that rule it, and the warriors who fight for it.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"}]},{"id":262465,"name":"Loria","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a6/8a6645b65494db85a25a5b9990ab0213.jpg","description":"Loria is a homage to classics from golden era of strategy games, with modern spin on controls and user experience.\nGame introduces not just RTS elements but also RPG elements such as: hero units, collecting items and quest driven missions offers for a more interesting take on the RTS genre.\nGoal of Loria is to take the best concepts from the classics and create a modern user-experience, intelligent AI, smooth controls, pleasing aesthetic and to add interesting content.\nLoria was made with passion and love of the RTS genre, that has given us so many hours of fun.\nHopefully we have managed to recreate the experience and fun.\nLoria featues:\n2 playable races\n2 campaigns with 8 missions each ( 16 missions in summary )\nEntertaining story\nDozens of units, buildings and upgrades\n6 unique heroes\nLevelable heroes with backpack\nVeteran units\nSkirmish games\nDisclaimer\nLoria does not include multiplayer at this point. However if the responses to the game will be positive and game will gain stable enough user base, we will definately work towards adding the multiplayer in game.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Loria","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":42047,"name":"Penny Arcade Adventures: On the Rain-Slick Precipice of Darkness, Episode Four","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ef/5efee551d4660e4838b33f720f24b00c.jpg","description":"Steam Big Picture\nAbout the GamePenny Arcade’s “On the Rain-Slick Precipice of Darkness 4” concludes the saga of Tycho Brahe, Scion of The Long Project, and his almost certainly human partner Jonathan Gabriel.  The world has been destroyed, but existence extends beyond this mortal plane in the gruesome Underhell! The new game expands considerably on its predecessor in size, scope and gameplay. Create the ultimate fighting force by recruiting bizarre, occasionally disgusting monsters and teaming them up with the best trainer for the job!Key FeaturesOld-School RPG style mixed with modern design sensibilities!\nBizarre and humorous story written by Penny Arcade & Zeboyd Games!\nOver twice as many area maps as the previous game!\nExplore the Underhell world (in all its traditional RPG glory) and discover its many secrets.\nNo random battles!\nMusic created by Hyperduck Soundworks (Dust: An Elysian Tail, Mojang's Scrolls)!\nRecruit bizarre & powerful monsters like a sentient vending machine, an evil ice cream cone, a bug-crow... thing, and more!\nDisrupt enemy attacks with powerful interrupt abilities!\nRechargeable MP & items! Unleash your full power in every battle!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Hothead Games","platforms":[{"id":0,"name":"PC"}]},{"id":13657,"name":"Event[0]","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9f/c9ffe58887ae044eea21e965faee73eb.jpg","description":"Event[0] is an award-winning narrative exploration game where you must build a relationship with a lonely spaceship computer to get home. Set in a retrofuture inspired by sci-fi classics such as 2001: A Space Odyssey, the game is about forging a personal relationship with your only companion, an insecure AI entity capable of procedurally generating over two million lines of dialog. You interact with the computer, named Kaizen, by typing messages on terminals throughout the ship. The reality of your situation will emerge organically as you communicate with Kaizen and explore the mysterious ship in first-person perspective.\nWARNING: Currently experiencing major game breaking bug on MacOS. Patch coming very soon. Beta branch reported stable.\nYou’ll freely navigate evocative 3D environments brought to life with physics-based rendering and advanced lighting techniques. You’ll examine items to gather information and solve hacking puzzles as you progress. You can even leave the ship for breathtakingly scary spacewalks! All sound and music come from the environment; there is no traditional score. The ship is essentially the AI computer’s body, and reacts to Kaizen’s feelings by making different sounds—pay attention for clues!\nAs in any relationship, there can be gratitude, disappointment, or jealousy, and Kaizen reacts differently depending on its mood. By working through the fears and anxieties of your virtual companion, you can eventually find your way back to Earth—while unraveling the cryptic history of the ship and the 1980s society from which it emerged.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ocelot Society","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3323,"name":"GUNS UP!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/589/589f00972d3147a60d52ed7f483059b3.jpg","description":"In a mashup of RTS & Tower Defense, GUNS UP! is an action packed strategy game lets you build and upgrade your defenses, take your army onto the battlefield to wreak havoc on other players.\nStrategic control of the battlefield is achieved through the careful deployment of units and special abilities, smokescreens, bombing runs and more. Specials drop during combat but can also be earned as rewards for victory and brought into the next battle.\nReal-time Strategy - Send your troops into battle to attack others or defend your base. Support your soldiers by giving orders and backing them up by deploying special attacks during battle.\nPlayer VS Player - GUNS UP! features asynchronous Multiplayer battles where attackers are pitted against other player’s defending bases. View replays of your opponent's attacks and perform successful retaliations to earn bonus loot and resources.\nDefense - Layout, expand, experiment and upgrade your base to create a fine tuned defense against attackers. Successful defends earn rewards even when you’re away.\nOffense - Expand your roster by recruiting new Soldier classes. Upgrade and customize your troops as you gather loot in battles. Soldiers can gain veterancy and be used in multiple battles or base defense. Earn Medals to permanently boost the stats of your units.\nAlliance Competitions - Join up with friends to battle other Alliances for loot and bragging rights on the leaderboards. Each Season the top alliances are awarded loot and badges.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":801567,"name":"Pentiment","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f1d/f1d25c007b9b45c98b57ff9ebbca9692.jpg","description":"From Obsidian, this game is a historical mystery role-playing game that focuses on character development, heavily stylized art, and choice-driven storytelling in early 16th century Germany. The main character is a clever illustrator caught up a series of murders at Kiersau Abbey over twenty five years. This character alone possesses the wits and will to expose the killers, but each decision he makes has lasting consequences and inexorably draws him closer to the center of an underlying conspiracy.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":257377,"name":"Boomerang Fu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d8/8d84c9b411822404205342f53fb98285.jpg","description":"Every round of Boomerang Fu high-stakes showdown with one-hit kills and bouncy boomerang physics. Transform your character from a startled banana into an unstoppable killing machine with persistent powerups like wildfire, ice trails, disguises, telekinesis and more. Powerups stack together between rounds to form dangerous combinations that could turn the tide of battle of backfire hilariously.\nEach match of Boomerang Fu can be a finely-balanced ballet of blades or a comedy of errors. Simple controls let newcomers grill, chill and tenderise their opponents within seconds, while advanced players will uncover the hidden depths of this lost martial art by learning to deflect attacks and curve boomerangs around corners. And everyone can use the environment against their foes, setting off traps, hiding in bushes, or pushing one another into treacherous koi ponds.\nFrantic action, multiple game modes and a formidable cast of AI opponents make Boomerang Fu the perfect start to a Friday night in with new friends or bitter rivals.\nFeatures\nChoose from a cute cast of playable food characters\nFight with up to 4 friends in slapstick kung fu arenas\nStack powerups together in silly or deadly combinations\nMaster the hyper-realistic boomerang physics to get an edge over your enemies\nEngage in senseless but adorable violence thanks to one-kit kills\nUse your favourite XBox, PlayStation or Steam controllers\nGame modes Deathmatch: Do battle with boomerangs in deadly arenas. Points are awarded for kills or last food standing.\nTeam Up:: Team up against your friends or challenging AI opponents. Don't want a fair fight? Everyone can team up against the best player in the room.\nGolden Boomerang: Fight to hold onto the golden boomerang in an asymmetric \"1 vs many\" showdown.Stackable powerups Caffeinated\nDash Through Walls\nTeleport Boomerang\nExplosive Boomerang\nMulti Boomerang\nFire Boomerang\nIce Boomerang\nDisguise\nShield\nTelekinesis","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Paul Kopetko","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":49268,"name":"Amid Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c62/c62797f3f5620a35b526ec113c96587e.jpg","description":"The producers of DUSK and the creators of Return of the Triad invite you to embark on an EPIC new FPS adventure:\nSEVEN distinct episodes each featuring a completely different setting and enemies\nLUDICROUS magical weaponry that can be overcharged with the souls of the dead\nBRUTAL and adaptive enemy AI that will hunt you down on land, sea and air\nSPRAWLING non-linear levels filled with secrets and ancient lore\nMULTITUDES of in-game options and cheat codes for a truly golden PC age experience\nEPIC original & dynamic soundtrack composed by Andrew Hulshult\nBUILT in Unreal Engine 4 for cutting edge visuals (even if they are a bit retro)\nOPTIMIZED to run on a toaster (a pretty nice toaster)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Indefatigable","platforms":[{"id":0,"name":"PC"}]},{"id":28483,"name":"Ninja Gaiden II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e9/3e9d02b3d7d0a19e207094223b880f20.jpg","description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, French, Italian, German, Spanish, Japanese, Korean, Chinese.  This long-awaited sequel to the best-selling Xbox action game pits legendary ninja Ryu Hayabusa against hordes of malicious enemies as he sets out on a journey that will determine the fate of the human race. With an assortment of new weapons, moves, enemies, and locations, Ninja Gaiden II redefines the action game genre, providing a visceral, thrilling experience that just can't be found anywhere else.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Team NINJA","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":17372,"name":"Symphony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/411/411bc6b2c9397f7de82ece8835a84c43.jpg","description":"Your music is under attack, you must liberate it!\nA mysterious entity is absorbing and corrupting your music before your very eyes. You must battle through your own song collection, discover items, customize your ship and fight boss enemies to liberate the Symphony of Souls and reclaim your music!\nSymphony is one of the most music-driven games ever made. In this vertical shooter, re-experience each of your songs as it becomes a unique battlefield driven by intensity and tempo.\nYour music collection is now an item collection! Each of your songs contains an item you can discover, equip and upgrade. Fully customize your ship to reach score targets, upgrade items and unlock new difficulty levels.\nShowcase your skill. Symphony's innovative per-song leaderboard rewards you more, when you dominate with less powerful weapons. Find the loadout that suits your style and show what you can do!Key featuresBattle a mysterious entity that absorbs and corrupts your music as it plays\nCutting-edge music analysis adapts the game to any song you like!\nInnovative per-song leaderboard system rewards you based on your weapons and the difficulty level\n5 unique sets of boss enemies to conquer\n6 difficulty levels\nDiscover, collect and equip weapons hidden inside your own music collection\n30 achievements/medals to unlock\nSupported file types:\nWindows & Mac: MP3, OGG, WAV, FLAC, WMA (Windows only), AIFF, WV.\nLinux: MP3, OGG, WAV, FLAC, AIFFM4A & AAC supported via a DLC download for a small fee to cover patented decoder licensing costs (M4A & AAC also require the free QuickTime player)\nFull amBX™ support (cool lighting!) - Windows only","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Empty Clip Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16120,"name":"Tiny Bridge: Ratventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e2/8e261e86d3067701c997c3bf7e1aee5b.jpg","description":"In this mind-bending game you create complex structures to get your woodland creatures over vast chasms.  In a bridge-builder first, you'll guide your creatures and construct your bridges in real time.  Use the weight of various creatures to balance your structures as you build them.\nFeatures:\n- 72 unique levels across 6 worlds\n- Construction physics applied in real-time\n- Steam Achievements and Steam Leaderboards integration\n- Steam Cloud support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Estelion","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5981,"name":"Gas Guzzlers Extreme","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02b/02b03e247ba6ef6870846e5b4a124ff6.jpg","description":"Gas Guzzlers Extreme is a fast, furious, armed-to-the-teeth, trigger-happy shooter, shifted into top gear! Take a white knuckle ride in this crazily addictive combat racing game that features a ton of vehicles, weapons, upgrades, on-track bonuses and environments. Gas Guzzlers Extreme is an exciting new twist on the car combat experience with the addition of furious team/clan combat battles.\nPlayers start out with low performance vehicles and soon work their way up to high-performance models, by earning money in a series of hi-octane races and arena battles. New game modes, tracks and vehicles are unlocked as players progress through the game. Along with developing their driving and fighting skills, players can spend their hard-fought cash, customizing their vehicle to match their clan members or pimping their ride for the road to glory!Key features:Combat racing at its best, featuring a blood pumping single player campaign with over 12 hours of gameplay.\nFast-as-lightning multiplayer tournaments with 7 different modes (classic race, power race, battle race, knockout, deathmatch, last man standing and capture the flag); with up to 4 teams available in team play mode.\n350+ miles of road across 40 tracks, 8 arenas and 7 different environments.\n12 unique weapons, on-track bonuses and power ups.\n18 customizable cars (12+ upgrades, color, rims, stickers, etc.).\nMulti-path tracks and sponsored events.\nInstant play with vicious AI Bots populating your multiplayer match while other players begin to join in on the fun.\nBeautifully displayed high definition visuals with extensive vehicle damage, motion blur effects and custom paint jobs.\nFull force feedback controller support as well as keyboards, joy pads, joysticks and racing wheels.\nPacked with tons of unique humor and personality.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Gamepires","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":13884,"name":"EasyAntiCheat eSports","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a1/4a1a732c22057555dd944fc73de275c4.jpg","description":"No game is fun with cheaters\nEasyAntiCheat eSports is the leading third-party anti-cheat client for Counter-Strike. We are unique by being pro-active, keeping focus on countering cheat mechanisms rather than on detecting them. This way you can have peace of mind that your opponents play clean, and won't be banned only days after having ruined your stats.\nEasyAntiCheat eSports is used in competitive leagues and tournaments. The anti-cheat client is only used for joining those game servers that require and have licensed EasyAntiCheat eSports. Please carefully read the EULA and decide for yourself whether you have a need for this software (as a competitive CS player involved with leagues using EAC).\nIf you're looking for information on any other games than those listed next, visit our website for the relevant privacy related information: http://www.easyanticheat.net/privacy/\nSupported games:\n- Counter-Strike 1.6\n- Counter-Strike: Condition Zero\n- Counter-Strike: Source\n- Counter-Strike: Global Offensive, a 2012 video game\n- Team Fortress 2\nTo use EasyAntiCheat eSports:\n- Install the client\n- Run the client\n- Select your game server\n- Start the game","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"EasyAntiCheat","platforms":[{"id":0,"name":"PC"}]},{"id":61442,"name":"Stoneshard: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4dc/4dc01ea2a225682dc690cf517e7e09f6.jpg","description":"Add full game to your wishlisthttps://store.steampowered.com/app/625960/Stoneshard/\nAbout the GameStoneshard: Prologue is a free playable alpha demo of Stoneshard — the old school turn-based RPG inspired by legendary roguelikes like ADOM and Nethack. This version of the game contains 2-3 hours of gameplay and introduces Stoneshard's world and combat system.\nLearn the story behind one of Stoneshard's main characters — Verren, who'll play a significant role in the full game\nExplore grim dungeons beneath the kingdom of Aldor\nFight ancient vampires and customize your hero with different armor sets and weapons\nGet familiar with Stoneshard's health and psyche system — put splints on broken bones, use medical aid and even drugs to ease hero's pain and fend off insanity\nFace the Prologue's mysterious boss and find out if you're strong enough to defeat him\nKeep in mind that Prologue is just an alpha version of Stoneshard and is developed for gaming audience to get familiar with the game's concept.\nhttps://store.steampowered.com/app/539470/Police_Stories/\nhttps://store.steampowered.com/app/526160/The_Wild_Eight/\nhttps://store.steampowered.com/app/671510/DESOLATE/","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ink Stains Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1602,"name":"ROME: Total War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2a/d2a4b12c173f9ffba1c384a0607a3aea.jpg","description":"Rome: Total War is a turn-based strategy. It is third of the numerous Total War titles: the main series counts as many as 13 titles, with 4 games being spin-offs. Rome: Total War is estimated to be one of the best PC strategies.\nThe story follows a line of three Roman families: Julii, Brutii, or Scipii. The story takes place in the late Roman Empire. As the plot is driven entirely by the player's actions, it is possible to have numerous outcomes — one's story may end at the end of a battle, while another may start at the same time.\nThere are dramatic gameplay differences in the title: the concept of a city is introduced: a fraction is considered defeated when it loses all the cities. The city can be lost in three ways: either conquered, bribed or contracted. There are a total of 21 fractions within a game with each economy being summed up by some factors: trade industry, taxes, agriculture, and mining.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":539,"name":"Dead Effect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3b/e3b95c384815dec5979388afb7d7d5bd.jpeg","description":"Fight for your life in the INDIE SCI-FI FPS game fit for both casual and hard-core gamers with a passion for hunting down hordes of zombies. Prepare yourselves for the incoming nightmare!\nThe ESS Meridian starship is travelling through space with a new FTL technology, heading towards its destination - Tau Ceti f, the first planet in the history of mankind to be colonized. A few months later an elite member of Unit 13 is disrupted from cryogenic sleep. But Tau Ceti f is nowhere in sight and something is very wrong. What happened to all those people? Why are they so aggressive and attack without any survival instincts?\nKey features:\n- Epic single player campaign with over 5 hours of gameplay and a story that will draw you in.\n- 12 story campaign missions with gameplay that differs from the mobile version, haing more rooms open to explore\n- Survive and Biohazard modes with many missions\n- A unique set of achievements\n- Special ability – Bullet Time (slow motion) ability of the player\n- Special ability – Devastation (area of effect) ability of the player\n- 14 unique upgradable weapons\n- Many different types of enemies\n- Explosives with post-process effects (grenades, trip-mines)\n- Full Dead Effect soundrack","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"App Holdings","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":376929,"name":"Super Bit Blaster XL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91b/91bce8927b7c380a9321aa84790478d1.jpg","description":"DEVELOPERS NOTE:I started creating Bit Blaster XL for Steam on a whim back in late 2015. I never could have guessed its release would change the entire direction of my life. It's success (however minor it may seem to others) has enabled me to spend more time learning about games as well as recently allowed me to make games full time as my profession. My younger self would not believe it. I have been provided with so many amazing opportunities (I couldn't possibly describe them all here) and I couldn't have done the majority of this without the great support of the community that appeared out of nowhere to play my silly little arcade games. I thank you all.Super Bit Blaster XL is the next evolution of my original Steam game. In the last few years since it's release I have learned a lot more about Unity and C#. Using this I have reworked many aspects of the game. I added a new Co-Op mode, Vs Mode, improved the GFX, new translations, new ships, new powers, and new Easter eggs. I also completely overhauled the control scheme due to feedback; while it's still not a Twin-Stick shooter, overall control is so much more responsive.My decision to release this as a separate title as opposed to an update on the original is mostly because the changes are all so drastic I wouldn't want to upset the flow of the original Steam game that people seem to love. I also have learned a lot from (fellow) developers about self worth so the price will be higher than a single dollar this time around. i'm sure there will be folks keen to pick apart this decision as greedy or selfish but I imagine the people that really enjoyed the original and want to support creators will understand my choices. If you're still interested please remember it's very important to ADD IT TO YOUR STEAM WISHLIST.I greatly appreciate your feedback and will do my best to ensure lengthy support for my games. Please contact me through Twitter, My Website, Nickervision Studios Discord, or the forums if you want to discuss an issue with the game, something misleading on the store page, or you just want to say hello.Thank you for taking a moment to read this\nAdam Nickerson - Nickervision StudiosGAMEPLAY:Your ship can not stop moving; so you must turn and use your boost/brake to keep from crashing into an ever increasing amount of enemies and obstacles\nYour ship is always shooting, so make sure to pick up more ammo and the wide variety of awesome power ups, pick ups and boosts to help you survive longer\nGet the highest score you can while collecting coins to buy more ships that are faster, shoot faster, or have more shieldsFEATURES:A throwback to the classic quarter eating arcade games of the 80's. Bit Blaster XL is a retro styled, addictive, and fast paced arcade shoot 'em up!\nEasy to learn, simple Controls to fly your ship, boost, and brake. Keyboard + Gamepad Support  (not a twin stick shooter)\nA variety of wicked Power ups like Spread Shot, Heat seekers, Laser, Blast Shot and much more to assist your survival\nScreen clearing Bombs, Ship Shields and Boost Pickups to help you survive longer\nCollect coins to unlock new ships with unique attributes to give you an edge in the Leaderboards\nEndless survival (infinite) score chasing game play with a classic 'bullet hell'-like arcade style\nSteam achievements to earn and leaderboards to compete with friends and the world\nSteam Cloud save file support\nRetro pixel Graphics made by someone that has no idea what they're doing still\nLanguage translations available in English, Russian, German, Italian, Portuguese, French, Simplified Chinese, Spanish, Japanese, and Korean\nFeaturing gameplay directly inspired by some of my favorites, such as; Luftrausers, Asteroids, Space Invaders, Galaxian, Defender, and Geometry Wars.\nUnique chip tune songs for each ship by Spiff Tune\nAn alternate Manual Fire mode for those that want a different experience\nThe in game audio/SFX was provided by my mouth and some royalty free SFX from FreeSFX\nThe soundtrack is by the artist \"Spiff Tune\" and is available as FREE DLC","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Nickervision Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":257194,"name":"Blacksad: Under the Skin","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/400/4002753ab3a1275bb1e46aa9fe2c3592.jpg","description":"A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!\n\nThe 50s, New York City: Joe Dunn, owner of a boxing club, is found dead.\n\nMeanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career, has mysteriously disappeared. \n\nSonia Dunn, Joe’s daughter, takes over the gym and must deal with its financial woes. She hires private detective John Blacksad to investigate Yale’s disappearance. This sinister case will take our investigator to the darkest, most dismal depths of New York.\n\nWith its anthropomorphic characters and its incredible 1950s feel, BLACKSAD: Under the Skin promises all the eerily dark adventure of a detective novel, just like the eponymous comic book series.\n\nConduct the investigation in your own way. Make use of your feline senses as you hunt for new clues. Make decisions on behalf of Blacksad and influence the outcome of the case.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pendulo Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":19669,"name":"Command & Conquer 3: Kane's Wrath","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c7d/c7dc93e551c05741b07478c3a6857e9f.jpg","description":"MultiplayerNote: As of June 2014, our friends at GameSpy have ended all hosted game services, which will affect the online multiplayer aspect of this game. Because of technical challenges and concerns, EA does not have a solution to keep these services up and running at this time, and online services for this game and other EA games on the GameSpy platform have ended.\nAbout the GameIn the name of Kane! The Command & Conquer™ series continues to thrive with Command & Conquer™ 3: Kane’s Wrath. As the expansion pack to the critically-acclaimed and fan favorite, Command & Conquer 3 Tiberium Wars™, this Real-time Strategy (RTS) game returns to the Tiberium Universe with Kane at the center of an epic new single player campaign spanning 20 years – from the rebirth of the Brotherhood of Nod after the Second Tiberium War through the dramatic events of the Third Tiberium War and beyond.  This story will be told through a new set of high-definition, live action video sequences starring a celebrity cast including Joe Kucan, playing the megalomaniac leader of the Brotherhood of Nod, alongside new talent Natasha Henstridge and Carl Lumbly.  With your help, Commander, the Dark Messiah may rise again!\nUnprecedented Multi-decade Campaign – Kane returns as the centerpiece of an epic new single-player campaign. Experience a new story that spans 20 years – from the rebirth of the Brotherhood of Nod after the Second Tiberium War through the dramatic events of the Third Tiberium War and beyond. Facilitate the rise of the Brotherhood leading up to and beyond the events of Command & Conquer 3 Tiberium Wars.\nGlobal Conquest – Fight the Third Tiberium War your way.  Take command in an all new global conquest mode.  Position your forces on a strategic level and then wage conflict in the fast, fluid, furious, tactical gameplay that Command & Conquer pioneered.  Map out your strategies on the planetary level and wage all-out war on the ground.\nLive Action Videos are back! – Witness the rise of the Brotherhood first hand through intense live action video sequences starring Joe Kucan, the actor who originated the role of Kane in the Command & Conquer series in addition to a new celebrity cast of characters.\nIntroduction of new Epic-Units – Devastate the battlefield with the immense firepower of all-new Epic-units.  Customize your Epic-Units mid-battle via garrisoning and upgrades.  Position these units in the strategic, global conquest mode then lay siege to your enemy at the tactical, battle level.\nTake Command of a Whole New Army – With the introduction of new units, structures, and abilities to each of the three factions, the Tiberium Wars will never be the same.  Conquer your enemies with new units on both land and air.\nSpecialized Sub-factions – Play to your strengths with six unique sub-factions, each equipped with their own exclusive units, powers, and upgrades.  Utilize the sub-faction of your choice to fully take advantage and compliment your play style.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"}]},{"id":4470,"name":"Jak II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22d/22d3ee1954aec6b965a26f4aeaefe692.jpg","description":"Jak is back in another action-packed adventure, but he's not the same. In Jak II, experiments with Dark Eco gone wrong leave Jak with an uncontrollable dark side, and after two years in prison, Jak seeks vengeance. Accompanied by your trusty friend Daxter, unleash the dark powers on multiple enemies and witness amazing transformations. Armed with powerful weapons, a high-tech jetboard, an impenetrable mech suit, and a number of vehicles at your disposal, you have no excuse for failure.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":2838,"name":"Chariot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/145/145d1ab07f91ad62f9d974c03d204096.jpg","description":"Chariot is a couch co-op platformer that can be played alone or with a friend. Players take the role of the brave Princess or her faithful Fiancé as they maneuver the departed king's coffin-on-wheels through 25 levels set in 5 vibrant underground environments, with his majesty's ghost giving them a piece of his mind every step of the way. Filled to the brim with emergent physics-based gameplay, Chariot offers hours of exciting exploration, fast-paced ride sequences and mountains upon mountains of loot! Notice: We highly recommend playing Chariot with a controller.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Anuman Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":18793,"name":"Tales of Monkey Island Complete Pack","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f75/f75b7aad7b9213f0a216b961ac207bab.jpg","description":"While explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate Hunter and a creepy French Physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem...\nWho can Guybrush trust? Where can he turn? Everything you think you know will be challenged as Tales of Monkey Island builds to its unexpected finale!About Chapter One\nThe saga begins with a heated battle involving the brave but often bumbling Mighty Pirate™ Guybrush, his beloved wife Elaine, and their nemesis, the demon pirate LeChuck. When the showdown goes up in flames, Guybrush finds himself marooned on a strange island with winds that always blow inward. How will our hero manage to escape this meteorological anomaly? What has become of LeChuck and Elaine? And what's the story with the infectious voodoo pox that's spreading across the Caribbean, causing Guybrush and other pirates to act like unruly hooligans? These are just some of the many questions posed in this first chapter of one of the most rollicking and rip-roaring entertainment experiences this summer.About Chapter Two\nGuybrush's adventures continue on the high seas as pox-plagued pirates lay siege to the innocent Mer-People. In between defending the Mer-People and dodging the persistent pirate hunter hot on his trail, Guybrush manages to catch up to his beloved wife and despised arch-nemesis — but their reunion is short-lived. Now Guybrush must focus on eradicating the Pox of LeChuck before more harm can be done. And as the Mighty Pirate draws closer to a cure, the waters will only grow murkier in this thrilling chapter of the epic saga.About Chapter Three\nIn the third Tales of Monkey Island chapter, Guybrush gets in deep (literally!) as his quest for the voodoo exfoliating La Esponja Grande takes a scenic twist -- through the guts of a giant manatee!\nTrapped in the belly of the beast, our hero encounters a surprising band of castaways, including the long-lost (and obsessive-compulsive) explorer Coronado De Cava. Can the Mighty Pirate win the suspicious De Cava's trust? Will sexy pirate hunter Morgan LeFlay prove to be a ruthless enemy, or an unlikely ally? Will the group find La Esponja Grande in time to save Elaine from the rampant Pox of LeChuck? And will the world be crushed by the gnashing teeth of a certain demonic skull? Tales of Monkey Island's moist and absorbing third episode, Lair of the Leviathan, will answer some of these urgent questions -- and raise still more -- as the five month adventure builds to its epic climax!About Chapter Four\nGuybrush returns to Flotsam Island, but forget about a hero's welcome. Handed over to De Singe by the backstabbing Morgan LeFlay, Guybrush is seized by an angry mob and put on trial! With a silk-tongued prosecutor in his face and a hangman's noose dangling over his neck, Guybrush must figure out how to defend himself against grave accusations. Meanwhile, the determined Marquis sets his sights on a new and far more attractive test subject. How on earth will the Mighty Pirate get out of this mess? The monthly Tales of Monkey Island tension continues to mount in \"The Trial and Execution of Guybrush Threepwood.\" Brace yourself for a shocking revelation that will rock the world of Monkey Island to its core.About Chapter Five\nOur piratey heroes meet their ultimate match with the Rise of the Pirate God. Can the world of Monkey Island be saved? Find out as the Tales of Monkey Island saga comes to its thrilling conclusion.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3035,"name":"Potatoman Seeks The Troof","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71a/71aa213d92c995c91e970a504d0814f3.jpeg","description":"Potatoman Seeks the Troof is a challenging potatosophical platforming adventure from Pixeljam Games, creator of the classic prehistoric racer DINO RUN.\nPotatoman will put your reflexes and worldview to the test as you journey through scorching deserts, dark forests, busy cities, the tallest mountains and eventually your own potato-consciousness in search of the ultimate answer. Are you prepared to face the TROOF?\nFeaturing:\nBone-breaking challenges and intriguing perspectives.\nA unique story that will make you question everything you knew about potatoes.\nSquirrels! Vultures! Monkeys! Star Tetrahedrons!\nThe Troof\nSome very nice things people have said about Potatoman:\nPotatoman will delight, surprise, and challenge you. I had so much fun playing through his little adventure, and I know I’ll replay it many times in the future. And the ending is amazing! Definitely play all the way to the end. ~James Kochalka, American Elf\nPotatoman is an awesome bite-sized platformer that is as fun as it is, well, insane. ~Northernlion, Youtube\nGood, addictive fun, with a nice balance between level-memorization and hand-eye coordination. ~Cory Doctorow, BoingBoing","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Pixeljam","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":484842,"name":"Milk inside a bag of milk inside a bag of milk","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e0f/e0f8d58079f6a0c6afb25d91422a98fc.jpg","description":"A short story about what sort of challenges everyday little things can be. Help the girl buy milk, be the first not to disappoint her.\nThe game is a small visual novel, showing either funny abstraction and wordplay or painful psychological episodes. The claim that history is based on real events will be too specific, so it is easier to pretend that it is just a set of abstractions and wordplay.\nFirst of all, this is an artistic manipulation with word and form, only then - a game.\nFeatures:\nShort duration (10-15 minutes)\nUnique graphic style\nAuthentic audio solutions","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Nikita Kryukov","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":244869,"name":"Visage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ddd/dddfb91aca79241e7b428ef21052e5ad.jpg","description":"WARNING: This video game may potentially trigger seizures for people with photosensitive epilepsy. Player discretion is advised.\nIMPORTANT NOTE: The game focuses on exploration and builds tension slowly to create a deeper and more meaningful experience. Its story is unveiled through surreal imaging and subtle environment details. Be mindful that it is a difficult game in unconventional ways.\nVisage is a first-person psychological horror game.\nExplore a mysterious ever-changing house in a slow-paced, atmospheric world that combines both uncannily comforting and horrifyingly realistic environments, and enjoy a genuinely terrifying experience.EnvironmentThe game is set inside a huge house in which terrible things have happened. You’ll wander through the gloomy corridors, explore every dead room, and get lost in endless mazes, your head filling with memories of the dead families that once lived in this very home. This twisted environment, void of any life other than yours, takes you to places you couldn't even bear imagining.\nStorylineThis house is stained with a terrible past. Families were brutally murdered by their own family members, people went insane, many committed suicide, and other grisly events occurred. Each and every room has its story painted on an invisible canvas. As a player, you will relive parts of this dark past, and each of its fragments will leave you restless and terrified. You’ll soon wish you could join the dead's ranks in their abyss, but death won't help you leave this place. Will you run from it, or will you try to uncover the truth behind the shadows?\nDark entitiesThe families that died in the house will haunt you and leave you restless. They’ll follow your every move, watch you from every corner, play tricks with your mind, and try to attack you. Why do they haunt you? What have you done? This you have to find out on your own.\nGameplayIn Visage, you are defenseless; no weapons could save you from the dreadful entities stalking you from the next corner, the next door, or underneath your feet. You’ll be able to pick up key elements, interact with the environment, and search for things that may help you escape this nightmare or pull you deeper into it.\nDying is part of the game. You need to avoid terror at all costs, as dark entities are attracted to it. Maintaining your mind as sane as possible will keep you from joining the ranks of the dead. Doing so will not be easy, and you'll have to figure out ways, like staying in the light, to avoid going insane.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SadSquare Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":21615,"name":"Zombie Shooter 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3e/d3e33b512dc646f7acf204206710e3ea.jpg","description":"Zombie Shooter 2 is an action game by the maker of Alien Shooter series. It also contains elements of RPG. This game is a continuation of Zombie Shooter. \n\n###Plot \nThe actions take place in a ruined and devastated city, where all the citizens became zombies. After arriving in this unknown city, the player has to find out what has happened here. To finish the game the player has to fight crowds of zombies and face the leader of the threat at the end of the game. Moreover, he should not miss his last chance to save the life of his beloved. \n\n###Gameplay \nThe user can choose the preferable game type: campaign, survive or gun stand. Also, the player selects character according to his taste.\nAs the game progresses, the main character’s parameters can be upgraded. While playing, you can gain experience, improve your skills and earn money to spend it on user devices. Zombie Shooter 2 implies a high concentration since the number of enemies reaches more than 100 at a time. There are at least 60 types of weapons to resist zombies. Among the armaments, you can find the sniper rifles. The player can also use auxiliary devices. For instance, radar or battle drones. Moreover, there is a variety of modes of vehicles. Besides, you have an opportunity to get medicines, if necessary.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sigma Team","platforms":[{"id":0,"name":"PC"}]},{"id":20986,"name":"Star Wolves 3: Civil War","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ab/6abfd025d38b2a8e092971e932968698.jpg","description":"Large-scale battles have become a vestige of the past, depleting resources of conflicting parties. Settled space, where welfare and order had reigned, has become a cemetery for dead ships which is flooded with pirates and adventurists. Complete impunity, black market flourishing where gun and tech trade is on the move, arbitrariness and anarchy – the Galaxy has become a real dangerous place. Events in the Universe and its habitant’s destiny are completely up to player’s choice and tactical decisions.\nStar Wolves 3: Civil War is a sequel to the popular real time strategy with RPG elements. Original large-scale scenario, closely tied with the first part of intergalactic epic helps the player influence the ongoing events and foreordain one of many endings. Free roam, free mission selection, free team forming – the world of Star Wolves waits for its heroes.\nHuge world: 110 highly detailed star systems in different parts of the Galaxy.\nNon-linear story: several endings and additional quests create a complete game universe.\nNew characters and skills: form up a team of your dream; teach your companions new skills.\nNew participant in the intergalactic conflict: the Space Fleet of a New Empire, equipped with its own spaceships.\nA number of new base ships and fighters with unique specifications and original weapon types and equipment.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Elite Games Team","platforms":[{"id":0,"name":"PC"}]},{"id":586054,"name":"OlliOlli World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c4/6c44f016aa1293cf9fb60cb1812dc687.jpg","description":"OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality.\nFlip and flow through the vivid and vibrant world of Radland, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana.\n\nTraverse a delightful and weird world as you take on missions, challenges, and make new friends along the way. Customize your character’s looks, tricks, and style while you experience explorable levels with multiple paths that provide an array of opportunities for player expression. Challenge the world in Leagues or dare a friend to beat your best tricks on one of millions of sharable levels. Experience the accessibility, depth, and player freedom as you dive into the signature flow state gameplay of OlliOlli World.\nOlliOlli World marks the third entry in the critically-acclaimed OlliOlli series from Roll7, the BAFTA and multi-award-winning independent studio.\nKey Features:\nWelcome to Radland!: Take a trip across a lush skateboarding utopia that is filled to the brim with eccentric characters and vibrant locations that are begging to be explored. Find your grind in Inflatable Alley or blaze down Los Vulgas to discover new paths, fresh side quests, rad rewards, and epic trick opportunities. All perfectly complemented by a hand-picked compilation of IDM and Electronica tracks. \nPlay at your level: Super tight controls combine with highly refined gameplay to ensure a silky smooth ride. Not a Pro? Don’t worry – OlliOlli World welcomes you with open arms, allowing new players to tear down streets and pull off sick method grabs without fear of faceplanting the curb. Think you’ve got what it takes? Achieve mastery through millions of unique levels in sandbox mode or compete against rivals around the globe in leagues with a hugely deep combo system with over 100 moves to master and combine in your battle for the highest score.\nFreedom of expression: Cruise through Radlands epic skate-haven and prove your skills to unlock special rewards that let you customize your character’s looks, tricks and style. Want to skate in your flip flops… go for it. Want to wear a bumble bee onesie …ok then… no judgement. In OlliOlli World as long as you’re on board anything goes!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Roll7","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":290894,"name":"Chernobylite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cef/cef93e8ac39fef9e6c82dbaaa121914e.jpg","description":"Chernobylite is a new game from the creators of the critically-acclaimed Get Even.\nIt's a science-fiction survival horror experience, mixing the free exploration of its disturbing world with challenging combat, unique crafting, and non-linear storytelling. Play as a physicist, one of the Chernobyl Power Plant’s ex-employees, and investigate the mysterious disappearance of your beloved. Try to survive and reveal the contamination zone’s twisted secrets. Remember, the military presence is not your only concern.\nGet ready for a thrilling adventure of survival, conspiracy, horror, love, and obsession. One that will prove to you that it’s not about how you face your fears, it’s about how you survive them.SURVIVEAlly or compete with other stalkers of the Chernobyl zone to survive. Remember that life is fragile, and it’s your decisions that determine the fate of your companions. You can spend as long as you need preparing, however, be aware that your story is still being written. Every passing moment, your chances of success are dwindling: comrades are dying, supplies are running out, or an unexpected patrol could discover you. And on top of all this, supernatural dangers are arising around you in mysterious patterns. Each day brings new challenges with the ever-increasing severity of your current situation. Plan your strategy carefully if you want to survive.PLAY BY YOUR OWN RULESCraft your gear and weapons to protect yourself from the hostile military personnel and supernatural threats lurking in the zone. Make use of the sophisticated tools at your disposal to aid you in your struggle while navigating the rough and contaminated environment. Stay undetected and gather all the evidence you can to piece together events from the past.\nDecide what happens in the world around you by making choices and finding, or avoiding, the truth.EXPERIENCEMaintain your resolve and keep your wits about you – the Chernobyl Nuclear Power Plant is not what it once was. No one can foresee the horrors that may have befallen your beloved.CHERNOBYLITE MAIN FEATURES\nExplore the beautiful and horrifyingly accurate 3D-scanned recreation of the Chernobyl Exclusion Zone.\nCollaborate or compete with other stalkers of the Zone, but whatever you do, never fully trust them. Remember – everybody has a hidden agenda. Always.\nFace and survive the natural and supernatural threats.\nImmerse yourself in the thrilling non-linear science-fiction horror story.\nMake good use of your character’s physics and chemistry knowledge to craft your equipment and manage your supplies.\nFight against the savage creatures pouring from the alternate reality.\nInvestigate and collect data with a set of sophisticated environment and substance analyzing tools.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"The Farm 51","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":21098,"name":"Slipstream 5000","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/705/705130e49bf5677e69cdc5ac5a406e82.jpg","description":"Conventional motor racing has yielded to the advances of thrust drive technology. Popularity for Slipstream racing is at its peak. Successful flyers quickly become icons and heroes. Race fans flock in their millions to the circuit-side stadiums hoping to catch a glimpse of the latest anti-grav machines which defy all laws of motion. The track's prepared, the crowd are hustling for the best seats, and the drivers and commentators are all psyched and hungry for action.\nControl many upgradeable futuristic racers under arcade or simulation racing style. Experience high speed aerial moves and dramatic crashes on excellently designed tracks.Feel the speed of the slipstream!Features:Compete as one of 10 different characters with unique Slipstream aircraft, each with their own features, weapons, and flying style.\nFast-paced action, smooth craft controls, and excellent track design.\nWith good old fashion split-screen multiplayer mode, enjoy a retro head-to-head race against a friend.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Gremlin Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20120,"name":"Missing Translation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d8/8d832a8bbbce109859b71bee27010a2f.jpg","description":"Lost in a weird city in the middle of the desert and surrounded by strange creatures that keep staring at you. This is a game about exploring the unknown and solving puzzles... lots of them! Don't be fooled by the looks, this isn't your typical point & click adventure, you'll spend your time solving them.Key FeaturesNo tutorials, hints or even text to be found here. This wasn't made to increase difficulty but to let the player do everything on his own, \"Missing Translation\" isn't a hard game, but we don't like hand-holding.\nREPEAT, NO TEXT. Everyone can enjoy it regardless of the language they speak :D\nThree different puzzle mechanics, each of those features 25 levels to complete.\nBeautiful black and white pixel art... ... did I already say we have cats?\nTwo different characters to choose from.\nAdditional challenges involving a drawn language that can be learned up to some point.\nGreat soundtrack that has evolved with the rest of the game over development.\nFREE! No ads, cash shop or any of those modern things.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gustavo Santos","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19476,"name":"Call of Duty: United Offensive","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b47/b47bd2d273344de393bf9658e62a9fb9.jpg","description":"Award-winning developer Gray Matter Interactive follows up on the success of Infinity Ward's Call of Duty™ - winner of over 80 Game of the Year and 50 Editors' Choice awards worldwide - with Call of Duty™: United Offensive™. Take the role of American, British, and Russian soldiers in some of the most climactic battles of World War II, including the Battle of the Bulge, the invasion of Sicily, and the Battle of Kursk.\nFight in tanks, jeeps, motorcycles, even a bomber. Work with your squad through snow and rain, using new weapons including flamethrowers and deployable machine guns, or by calling in artillery strikes. 13 All-New Single Player missions spanning three campaigns. 11 exciting new Multiplayer maps and 3 new multiplayer modes including Domination, Capture the Flag, and Base Assault.\n© 2006 Activision Publishing, Inc.  Activision and Call of Duty are registered trademarks of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Gray Matter Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17780,"name":"Epigenesis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41e/41ef10795ebbd4c377109eecebe5b8ed.jpg","description":"Epigenesis is an online multiplayer sports/FPS game in which two sides are locked in a never-ending fight for world domination by playing ball.\nIn this non-lethal ballgame of the future, players leap across platforms suspended high up in the air trying to get a ball located in the middle of the arena and score goals against their opponents. Each player carries a gravity cannon capable of pushing enemies (and friends) down from the heights of the arena.\nWhen a player scores, he receives a genetically modified super-seed and gets the opportunity to plant it onto a platform to capture it. To win the game you must capture towers and construct a node system from your goal post all the way to your opponents' goal post. If this hasn't happened by the time that the clock reaches zero, the team with the most scores win!\nTeamwork, tactics and precision is key to win eternal glory in a game of Epigenesis!\nVisit our official website, facebook and twitter for regular updates and news about Epigenesis!\nRemember to visit our official youtube channel for more in-depth tutorials on how to play Epigenesis!Now with Trading Cards!\nGet trading cards and craft badges for cool emoticon and background rewards!New Feature: HATS!\nComplete daily missions and earn Mission Points to spend in the store! Get some swag for your favourite team and show it off in-game! No micro-transactions, only cool hats.Join the Community\nJoin the growing Epigenesis community and find people to play with on the official Epigenesis Steam forum! Remember to join the community driven Epigenesis Community Group EpiGenCG here on Steam to find more people to play with!What people are saying\"When you see the trailer you’ll understand why it won this year’s Make Something Unreal contest: it looks brill.\"\n- PCGamesN\n\"It’s just crazy enough to work, and where it wasn’t crazy enough of its own accord, developer Dead Shark Triplepunch (yes, that’s their real name) just added tornadoes. Done and done.\"\n- Rock Paper Shotgun\n\"Judges praised Epigenesis for its ingenious concept, engaging gameplay and clever use of a scientific concept inspired by the theme for this year’s competition.\"\n- UnrealEngineKey FeaturesBall Sport of the Future\nPlay a ball as well as a domination 5-on-5 game on top of tall towers and platforms!\nFast-paced high-altitude Action\nEquipped with jumping-jets, players will have to time their jumps or suffer steep falls.\nNon-lethal combat with surgical precision\nAll weapons used are non-lethal force-based gear. Push your opponents down from the platforms and boost your friends towards the goal!\nOne-time use pickup abilities\nTactically use the Grapple, Dash or Shockwave to further advance your goal-scoring conquest!\nCustomize your loadouts\nThere are 6 plants with unique abilites as well as 5 different passive stat-boosts for you and your team. Discuss combinations with your team and choose the plants that best fit your playstyle!\n6 unique maps\nPlay ball on 6 different arenas constructed across the world of Epigenesis, featuring snowy mountains, lush forests and desolate cities!\nIn-game cosmetics shop\nEarn in-game currency by proving your worth in daily missions and spend it on cosmetic items such as Plant skins and Hats!\nSingle-player and bots\nInternet downed or just want to hone your skills? Face-off against the bots of Epigenesis or have them join your multiplayer matches!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Dead Shark Triplepunch","platforms":[{"id":0,"name":"PC"}]},{"id":261232,"name":"Eastward","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd3/cd3bf69db1093510cf1386b76564ea70.jpg","description":"Eastward is an adventure game with RPG elements, set in a beautifully detailed decaying world, where society is starting to collapse as the human population shrinks to an all-time low. As the world around falls to ruin, you play as a hardworking digger John, who must guide a mysterious girl named Sam through dangerous decaying cities, inhabited by strange monsters, and even stranger people! Inspired by 90s Japanese animation, the visual style of Eastward has been brought to life using a combination of a modern, innovative 3D lighting system and a rich retro-pixel artwork.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Pixpil","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":27312,"name":"Pokémon X, Y","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/753/753f5d584a5f7e69aa4c05dd3b6df7c9.jpg","description":"All-new Pokémon and past favorites come to life with detailed graphics\nand intense 3D battles. Become a Pokémon Trainer and set out for\nadventure in a visually stunning new region filled with new Pokémon to\ncatch, trade, and battle. In Pokémon-Amie, you can pet, feed, and play\nwith your Pokémon to form a deeper bond, which may benefit you in future\nbattles. Plus, you can connect and communicate with players around the\nworld at any time to challenge them to a battle, trade Pokémon, and much\nmore.\n\nPlease note: a new system update on December 12, 2013 fixes an\ninternet communication issue and occasional bugs that cause Pokemon not\nto learn new moves after evolving through Wonder Trade, and where\ncertain captions for Trainer PR Videos were not unlocked in Lumiose\nCity. This update also fixes a previous bug related to resuming your\ngame after saving in Lumiose City, and updates the filtering feature\nwithin the Global Trade Station.\n\nWe strongly recommend that all Pokémon X and Pokémon Y players download\nand install this update data. Scan the QR Code pattern below using a\nNintendo 3DS system while connected to the internet. The update data for\nPokémon X differs from that of Pokémon Y, so make sure you scan the QR\nCode for the version of the game you own.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":19455,"name":"Marc Ecko's Getting Up: Contents Under Pressure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e15/e15a2cad8ff4c494a0f51c106049db5b.jpg","description":"Play as Trane, a \"toy\" graffiti artist with the street smarts, athletic prowess and vision to become an \"All City King\" - the most reputable of all graffiti artists. Along your quest, uncover the mayor's deep, dark secret and use your fighting talents and high-wire graffiti to expose the city's leader as a corrupt tyrant. As you struggle to save a neighborhood from an oppressive government, one question stands out: What if graffiti could change the world? Risk your life battling city authorities and rival graf gangs - mere obstacles in your attempt to get your tag up. And in this city, not just any tag will do. You have to \"Get IN, Get UP and Get OUT\".\nCombat: master a unique fighting technique and use improvised weapons\nGraffiti: create tags in pressure situations, using multiple skills and styles\nIntuition: follow your sixth sense to find the best spots to tag\nSneak mode: infiltrate areas and avoid capture as you creep silently through the city\nNavigation: utilize a unique guidance system to \"get up\" and tag","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"General Arcade","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":17793,"name":"Giana Sisters: Twisted Dreams - Rise of the Owlverlord","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c2/1c2462802c061a94034979d3013ef23e.jpg","description":"Giana Sisters: Twisted Dreams - Rise of the Owlverlord is a blistering platformer with morphing worlds, featuring seven brand new levels, a new boss and new gripping tracks from Chris Hülsbeck and Machinae Supremacy!\nDash through tricky levels and transform the whole world at will in this fast-paced platformer. Rise of the Owlverlord combines graphics that pack a visual punch and tight controls with the challenge of retro era platforming. Fluidly morph between two dynamically different dream worlds to solve puzzles and combat grueling enemies and bosses. You’ll have to intertwine perky Giana's twirling jump with punky Giana's hammering dash attack to survive her dual nightmare.Key Features\nPowerful Abilities: Change Giana's personality to unleash her unique abilities - you'll need to control both sides to survive her dreams!Intuitive Controls and Smooth Gameplay: Master the tight knit controls to defeat the cunning trials ahead.Visual Punch:Giana’s dreamworlds leap off the screen with gorgeous 3D graphics that morph before your eyes.Twisted Puzzles: As Giana changes, so does the world around her.   Collecting gems and finding secret locations requires strategy and interchanging the two worlds.Legendary Soundtrack:Each dream layer has its own music style. Experience a dual crossfading soundtrack by Chris Hülsbeck and Machinae Supremacy!More to Discover: There are 7 rich levels across several distinct worlds, each transforming into the two contrasting dreamworlds.Gut-wrenching Hardcore Modes: Hardcore and Über Hardcore modes also await players who are full masters of the game and quite possibly insane.Extras: Halloween-themed levels accessible from the start.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Black Forest Games","platforms":[{"id":0,"name":"PC"}]}]