[{"id":14402,"name":"Space Pilgrim Episode IV: Sol","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00c/00c5d86575d60463ef3381dcff418da7.jpg","description":"Locked away in the most secure prison in the galaxy, with little hope of escape, Gail Pilgrim faces the most difficult ordeals of her life. Her only hope lies in trusting those who she has come to regard as her friends.\nOld enemies return and buried truths resurface in this final installment of the epic Space Pilgrim saga.\nExperience the final chapter of this immersive space saga. Explore several new locations, meet many new characters (as well as some old, familiar ones) and conclude the exciting story.\nFor the first time in this series, you can make key decisions that will influence the lives of Gail Pilgrim and her crew.\nAcross the four episodes in this saga you will travel to space stations, colonies, cities and islands across an immersive and intricate futuristic universe, interact with dozens of unique characters and enjoy 10+ hours of gameplay (Please note: this purchase is for episode four only)\nMouse, keyboard and controller support","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":13520,"name":"Hard Truck: Apocalypse","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/943/943dfb036ff56c2262b185cca2ffcac4.jpg","description":"Hard Truck: Apocalypse is a third person action-driving, set up in post apocalyptic world. You will drive through the regions of the new Earth, where you will uncover secrets of the lost civilization, learn the fate of the mankind, gain powerful friends and fight numerous enemies.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"CDV Software","platforms":[{"id":0,"name":"PC"}]},{"id":10345,"name":"LiEat","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/955/955a689afec5766277a394ec312df59a.jpg","description":"Efina is a very special young girl. She's curious. She's optimistic. She has the power to make lies manifest themselves as physical beings, which then become her own sustenance.\nShe's also a dragon.\nLiEat is the classic story of a vagabond traversing a strange and mysterious world together with a dragon protégé, buying and selling secrets, while also attempting to uncover the truth about themselves. Along the way, they'll discover a web of arcane mysteries, meet a variety of colorful characters (including other dragons), and shed light on events of the past which ultimately served to lead them to where―and who―they are today.\nThe epic tale of LiEat is composed of three fantastical, bite-sized chapters:\nChapter I introduces Efina and her caretaker―the multinominal Leo―as they happen upon a small town with a big secret. As Efina starts to perceive and understand the world around her in a new and different light, the pair finds that the legends of beings which haunt the night are more than just tales told to frighten children...\nChapter II finds Efina and Hal (formerly Leo) investigating rumors of something magical and possibly dangerous inside a resort casino. Posing as a newly-assigned guard, Hal arranges room and board for himself and Efina―however, they quickly come to the jarring realization that a roof over one’s head and a bed to sleep in do not a safe haven make.\nThe final chapter of LiEat brings Efina and the newly rechristened Sid (Leo/Hal) to a lavish mansion to foil the plans of a master thief. However, in the wake of the great robbery, Sid discovers that the heist itself was only the tip of the iceberg, and Efina watches as his past―As well as his lies―finally catch up to them both.\nFor the first time ever, this beloved trilogy that has long been treasured by JRPG enthusiasts can now be enjoyed in its entirety on Steam in one single comprehensive package! In collaboration with the original developer (and featuring translation painstakingly crafted by a longtime fan), PLAYISM is proud to finally bring LiEat to the entire world!\nEngaging and emotionally resounding JRPG storytelling\nEntrancing atmospheric music that seamlessly transports the player into the world of LiEat\n(*Purchase of the game includes the OST! Make sure to check your Local folder.)\nMyriad hidden items and conversations spread throughout the game\nMultiple achievements for each chapter of the game\nAll three chapters in one package; no DLC, just the whole storySpecial Thanks to vgperson and SmokingWolf","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"△○□×","platforms":[{"id":0,"name":"PC"}]},{"id":622,"name":"XCOM: Enemy Within","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/991/991727f5bd183a5ffbacfbb1944cc884.jpg","description":"***NOTE: Compatible with iPad 3, iPad mini 2, iPhone 5 and up. WILL NOT be able to run on earlier generations, despite being able to purchase them on those devices***\nXCOM®: Enemy Within is a standalone expansion to the 2012 strategy game of the year XCOM: Enemy Unknown and it's now available on iOS devices!  Enemy Within features the core gameplay of Enemy Unknown plus more exciting content. Check out the new soldiers, abilities, enemies, maps, missions, and multiplayer mode for the fresh new strategy gaming experience!\n• New Soldier Abilities: Build new base facilities to unlock unearthly new capabilities for XCOM’s soldiers. The Genetics Lab will allow soldiers to receive powerful genetic modifications, and the Cybernetics Lab allows soldiers to use devastating mechanized cybersuits in battle.\n• New Weapons and Equipment: Give your operatives an extra tactical edge with new projects from your engineering team and the Foundry.\n• New Enemy Threats: Adopt new tactics to counter the threats from two new alien types and a deadly new organization known as EXALT.\n• New Strategic Resource: A valuable new alien resource, known as Meld, has been discovered. Secure it on the battlefield, research a new technology to unlock its power, and use it carefully back at base to unlock new upgrades and weaponry.\n• New Story Elements: Investigate a terrifying threat in an abandoned fishing village, and defend the XCOM headquarters from alien attack in a series of new plot-driven missions.\n• New Multiplayer maps, units, and abilities: Create your custom squad from a wider array of options and dominate your opponent in intense, one-on-one, turn-based matches.\nNOTE: XCOM: Enemy Within is a graphically rich game with advanced features. To OPTIMIZE your playing experience, you may want to turn off other apps before playing.\nThe content of this videogame is fictional and is not intended to represent or depict an actual record of the events, persons, locations, or entities in the game’s setting.  The makers and publishers of this videogame do not in any way endorse, condone or encourage engaging in any conduct depicted in this videogame.\nFollow us on Facebook:  www.facebook.com/xcom\nFollow us on Twitter: @xcom\nFor more great games visit: http://www.2kgames.com/mobile/\n18+ \"запрещено для детей\" for Russia\nPrivacy Policy: http://www.take2games.com/privacy/index.html\nTerms of Service: http://www.take2games.com/legal/\nEnd User License Agreement: http://www.take2games.com/eula/index.html","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2K","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":264758,"name":"DARQ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a5/1a569b378018de2b5adc60f242408933.jpg","description":"DARQ tells the story of Lloyd, a boy who becomes aware of the fact that he is dreaming. To Lloyd's misfortune, the dream quickly turns into a nightmare and all attempts to wake up end in failure. While exploring the darkest corners of his subconscious, Lloyd learns how to survive the nightmare by bending the laws of physics and manipulating the fluid fabric of the dream world.\nApart from gravity-defying puzzles, Lloyd will have to use stealth when nearby enemies. He has no chance of winning in an open confrontation, since the creatures he will encounter are much more powerful and faster than him. Instead, he has to rely on careful planning to avoid getting detected.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Unfold Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":23313,"name":"The Vagrant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f29/f29a59ca121b33cbf4be46224790de1d.jpg","description":"Journey into a gorgeous hand-painted fantasy world known as Mythrilia and discover the truth about your bloodline and its darkest secret. Play as Vivian the Vagrant, a traveling sellsword, who follows her lost father's research in an effort to reunite with her family. Hack and slash a path from a quiet coastal village through mysterious forests, haunted castles, and wrecked battlegrounds. When the endless barrage of enemies have been vanquished, what solace will be left for our hero?The VagrantThe Vagrant is a 2D action RPG. As Vivian, you will experience an exciting and challenging adventure focused on combat gameplay that utilizes combo chains, charge attacks, and special skills, all while improving your character's build through new equipment and abilities. Play casually or become a master combatant.Key Features:Hand-painted, traditionally animated characters.\nFlawless, hardcore action combat.\nOver 70 deadly and dangerous monsters and beasts.\n6+ massive level sets, all beautifully hand painted.\nMultiple weapons, armors, and accessories to loot, purchase, and discover.\nA large-scale skill set to enhance character builds for immersive and intense gameplay.\nCraft and enchant your equipment to improve your combat performance.\nUse various offensive skills to destroy your enemy. Evolve the skills with elemental enchantments.\nMultiple endings to make your adventure even more unpredictable.\n10+ challenging Boss monster with intuitive AI and battle mechanics. Challenging even for the most advanced players.\nMonsterpedia that allows you to collect data on the monsters as you defeat them.\nFast travel to previously visited areas to re-challenge or grind.\nExciting and emotionally driven musical score by Gabe Castro.\nRich and intriguing storyline development.\n4 difficulties ranging from casual play to hardcore fighting, each with the full gameplay experiences.\nFully compatible with Xbox One controllers.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ico","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":58501,"name":"H1Z1: Battle Royale","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fe2/fe2777f4da17b86743b95217e1fd5915.jpg","description":"H1Z1: Battle Royale is a pure, fast-paced battle royale shooter re-imagined and built for console. Drop in to a massive map in search of weapons, ammo, vehicles and air drops to get a leg up on the competition and be the last one standing.\r\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\r\nNetwork Players 2-99\r\n11GB minimum save size\r\nDUALSHOCK®4\r\nOnline Play (Required)\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\r\n© 2015-2018 Daybreak Game Company LLC. Daybreak Games, the Daybreak logo, H1Z1, and the H1Z1 logo are registered trademarks of Daybreak Game Company LLC. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Daybreak Games Company","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":29960,"name":"Command & Conquer: Red Alert 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/673/67304bfba37b6a18c50a60ab6ba6cebd.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Westwood Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14724,"name":"Marooners","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d0/2d0549d856629a5dbd2c9271d4dafa07.jpg","description":"Play a wild mix of fun party games agames as the action regularly switches back and forth between games. Can you handle the switcheroo chaos? Join your friends both on the couch and online while sadistically laughing at their misfortune, or come back to haunt them if you die. Run, jump and slap your way to victory!\nParty Game madness: experience switcheroo chaos as the action jumps between multiple intense minigames when you least expect it, or take the challenge of completing a full play through of each minigame once. Face different game types and surprise bonus stages.\nPick your Marooner: a host of quirky characters to unlock and play as, 60+ hilarious weapons to unlock and use, and if you die... come back as a ghost to haunt your friends.\nPlay Party Mode and Arena Mode: 25 different games and arena maps, as you race for treasure in Party Mode or duke it out to see who will be king of the ring in Arena Mode. Whichever mode you pick, expect the unexpected!\nSeamless local and online play: up to 6 players in any combination of local and online as you level up and unlock new weapons, plus full bot support to play solo and in multiplayer mode, spectator mode, streamlined matchmaker and lobby system.\nMarooners throws you into a chaotic mix of minigames. You’ll be switching back and forth between exotic locations, all the while grabbing as much treasure as you can. Just try not to get drowned, burned, squashed, blown up, or worse...\nYou also have the option to experience a complete run where you play every game once to full completion, or just watch some games in spectator mode!\nOnward, treasure and victory await!\nPlaying with friends in your own living room is awesome, and we support that! But maybe you want to party with friends or strangers online? No worries! People from all over the world can easily play together, and you can even combine 2-6 local and / or online players, so your local friends can play with your offline friends. And if you need some extras to make up the numbers or don't feel so sociable, you can bring in the AI pirate bots to join the game.\nAs well as Party Mode, you can challenge your friends in Arena Mode to see who's the king of the ring! Battle it out across 12 different locations, and expect to stumble upon fresh new chaos from time to time in the form of a hidden game mode or two! Expect the unexpected, and die... we mean WIN in extreme ways! What are you waiting for, there's treasure out there!\nUnlock cool and quirky characters as you play, and choose your favorite. Then load up with one of 70+ unique weapons that will make your opponents think twice about messing with you!\nVisit our website: http://www.MaroonersGame.comAbout the developersMarooners is being developed by game studio M2H and friends, brought together by their love of party games. M2H are veterans when it comes to developing games. In 2009, the brothers Hergaarden founded their studio, specializing in 3D Unity multiplayer games. They are known for their hugely successful realistic WW1 FPS \"Verdun\" and the \"Crash Drive\" free-roaming stunting series.\nFor more information visit www.M2H.nl or talk with the developers on Discord.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"M2H","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12381,"name":"Neon Hardcorps","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/481/481f4d1ef8e4c73094b998c992058233.jpg","description":"Features:\n- Run & gun maps\n- Special car chases maps\n- Boss maps\n- Tactical maps\n- 6 main characters each with unique armour,weapon and abilities.\n- Cyberpunk environment.\n- Character upgrades.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sergey Dovganovskiy","platforms":[{"id":0,"name":"PC"}]},{"id":9502,"name":"Tower 57","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e0/3e0bed150fdd09bc7a0471f245628827.jpg","description":"The tower awaits.\nIn a dystopian, dieselpunk world, where Megatowers are the only enclaves of civilization, a group of extraordinary individuals is sent to infiltrate the reclusive Tower 57. Their skills, clips' capacity & the ability to cooperate will decide on their fate.\nTower 57 is a top-down twin stick shooter with 16-bit inspired pixel art, destructible environments and heavy focus on co-op. It is also a modern take on what made AMIGA games so great back in the days.FAST-PACED ARCADE GAMEPLAY\nThere is no school like the old school. Shoot everything that moves and don’t get killed in the process. Tower 57 offers complex situations arising from simple systems interacting with each other - and it does it the hard way. Number of lives is scarce, respawns limited and difficulty skyrockets when you least expect it.TOOLS OF DESTRUCTION\nChoose from a roster of six particular characters with different skillsets, number of upgradable weapons and gadgets. And if you happen to lose an arm or leg during your mission - you can always replace it with a new, better one! Master these combos and you will never get bored on your way to the top of the Tower 57.COOPERATION\nMayhem tastes the best when it is shared. Tower 57's main campaign is designed for both, single player & local/online co-op. Flank your enemies, bait them into an ambush, leverage co-op specific weapons, or combine your regular weapons for increased firepower and new effects!DIESELPUNK WORLD\nFind your way through a maze of floors connected by elevators, a central hub filled with shops and terminals, and a multitude of secret walls and uncharted passageways leading to forgotten parts of the tower. Times of randomly generated levels are gone - everything in Tower 57 is carefully designed and pixel-crafted with the highest attention to detail.DESTRUCTIBLE ENVIRONMENTS\nSmash them, crash them and destroy everything. Reload. Repeat. Because everyone likes when things go BOOM. Everything - from debris and shell casings to bloody footprints - will mark your destructive trail through the Tower.ADVERSARIES\nEach enemy features its own distinct spawning mechanism, movement & attack patterns, as well as some weaknesses. And you'd better learn those vulnerabilities if you don't want to end up dead very quick.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pixwerk","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3579,"name":"Defense Grid 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/278/278a2eb3eb5e83433c616185249414c7.jpg","description":"Defense Grid 2 is the next evolution in tower defense.  In Defense Grid 2 players will discover new additions that will require the player to change their tower strategy.  Defense Grid 2 offers dynamic content where gameplay is constantly changing. There are a million different ways you can beat a level so your solution is truly your solution.  The addition of cooperative and competitive multiplayer brings a whole new experience to Defense Grid.  The mix of strategy and puzzle gameplay promises to be fun and engaging.\n\nIGN\n'SUPER ADDICTIVE!'\n-IGN. 8.0\n\nPush Square - 80\n'It has everything that a fan of the genre could want, loads of modes, challenges, and, at its core, is just plain fun.'\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-2 players\nNetwork Players 2-2\nDUALSHOCK®4\n720p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\nCopyright 2014 Hidden Path Entertainment.  Published under license by 505 Games.  Defense Grid 2 and DG2 are trademarks and Hidden Path Entertainment and Defense Grid are registered trademarks of Hidden Path Entertainment, Inc. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"505 Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":51230,"name":"Will To Live Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12a/12ad3cd00c48942106a195168fe6062d.jpg","description":"Will To Live is the first person MMORPG-shooter with survival elements. Action comes in wastelands of post apocalyptic world. Manifest your right to life – radiation, mutants and the most hazardous enemies – people are against you!\nGo into a combat for one of fractions on wreckages of foregone civilization, explore the world and its history. Wide choice of weapon and detailed role-playing system, swoops and battles with other players.\n- MMORPG game in post apocalyptic world\n- Sophisticated world history – unriddle the world destruction, investigate all the enigmas and come up with new marvelous findings\n- Large and open world, full of mutants and  anomalous radiating zones\n- “Dungeons” – in literal sense – mines and bunkers of all kinds and underground metro stations.\n- Raid monsters\n- Fierce confrontation of fractions and clans\n- Role-playing model: play for class, close to you in gameplay. Each class has its own outfit and equipment\n- Realistic ballistic weapon models. Weapons upgrades, improving crafts for armor and equipment\n- Four different character classes, each with unique abilities and equipment\n- Character customization - create your own unique male/female character\n- Character upgrade system with various weapon skills and character abilities\n- Realistic weapon behavior model that takes ballistics and specs into account\n- Wide selection of original and unique weapons\n- Modify your weapons and add attachments to them (sights, suppressors, muzzle brakes, etc.)\n- Change the look of your weapons and armor with the use of special painting tools\n- Complex crafting and equipment upgrade system\n- Regular updates","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"AlphaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":42236,"name":"Below","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/434/4349efe6e0519ca3c7c3c418cff064a7.jpg","description":"Test your adventurer mettle against The Isle’s procedural subterranean labyrinths. Explore a large, interconnected underworld crawling with cunning wildlife, deadly traps and stalked by a shadowy presence. Survive the perils of The Depths and unearth what lies below... or die trying..\nBELOW is a procedural terrarium filled with life, mystery and death.EXPLORE\nExplore the vast subterranean underworld of The Isle: a dangerous, unfathomable deep. Choose your path through the randomly generated labyrinth crawling with deadly monstrosities, traps and hazardous environments. Perma-death awaits at every false step, and there are no hints to guide you…SURVIVE\nSpelunking through The Depths of BELOW is a treacherous endeavour, with death around every corner. The world is alive with flora & fauna, and there are many ways to scavenge materials and harvest ingredients to create life-saving remedies or useful survival tools…DISCOVER\nWhat lies below? Only the bravest wanderers will find out. The Depths are filled with secrets and danger. BELOW embraces the idea that players enjoy discovering secret areas, finding hidden passageways and unravelling the deepest mysteries hidden in the in the darkness…","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Capybara Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":16766,"name":"Nether: Resurrected","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/451/451a9994b5cd506ba88a0b81495211d2.jpg","description":"NETHER...IS...BACK!  We have rolled back the game to Summer of 2014, when it first left Early Access and was still being developed by us, Phosphor Games Studio.\nRIGHT NOW:\n- Single Player enabled: It was not possible before, but now it's working, and it's hard!  Have fun surviving the monster-filled urban apocalypse alone\n- No more micro-transactions: all items can be bought with in game cash\n- Multiplayer via player hosted servers! The old back end ripped out - no need for any login besides Steam.  You control your community, and nobody can take your game from you again\nWHAT IS IN DEVELOPMENT:\n- Custom server settings: you decided how many players, how many Nether, how much gun spawns, etc.\n- Modding tools![/b]\n- Bug fixes (including playing as a Nether, which was always pretty buggy\nGAME SUMMARY:\nNether is a fast-paced survival game that forces you to make quick life-saving decisions in an unforgiving environment. In this post-apocalyptic urban world, death is waiting around every corner, at the top of high-rise buildings, and in the grasp of powerful teleporting creatures known as 'Nethers'. These creatures and the other players are real challenges to overcome, requiring tactical gameplay, awareness, stealth, and cooperation. To navigate this high-tension environment, you must use skill and cunning in order to scavenge, trade, craft or loot for food, weapons, supplies, and other resources necessary to stay alive in a desolate and dangerous city. Team up with other survivors and take advantage of group play, as a tribe, to complete treacherous world objectives, or play as a lone wolf in an attempt to endure the hostile environment. In the end you must decide whether to Prey or Pray.Key Features\nEXPLORE\nThe game's landscape is a beautifully conceived vision of a post apocalyptic Chicago, ravaged by disaster and time. Almost every low and high-rise building can be individually explored in a cityscape that stretches 150 blocks. Beyond the city lies the Wastelands, an unforgiving desolate landscape that is slowly sinking into the earth.\nSURVIVE, CRAFT, TRADE, LOOT AND SHOOT\nStart off, armed only with a kitchen knife and scavenge your way through an environment on a daily battle to stay alive. Beware the Nether, poor mutated souls who roam the city in search of human flesh. Scavenge for food and water to stay nourished, and search for useful items that could be crafted into makeshift weapons to help in your battle for life.  Hunt and kill Nether to trade their body parts to the mysterious Cult located in the few markets that scatter the city. Over time, build up your skills and earn rewards for surviving each precious new day. But always beware of the other survivors who may be only one moment away from death, and see killing you and looting your possessions as their only salvation.\nTRIBES AND TERRITORY WARS\nFind safety in numbers by joining a tribe. Only tribes can capture and own territory, and the urban landscape is the perfect setting for turf domination. Compete with rival tribes in territory wars for control of the city by capturing strategic landmarks to reap resources and experience; prove your dominance over all other tribes. Spy on rival tribes or infiltrate and kill them by playing as a Nether. Ambush them from above by swooping in for the kill using the wing suit. Tribes change the survival experience by establishing a true social construct, with all the consequences of behavior that you would expect in the real world. Your actions have real repercussions enforced organically through reputation and standing.\nPLAYER AND GROUP MISSIONS\nPlayers can complete an assortment of individual or group missions to earn money, experience and reputation. Perform vital supply runs between the markets, work with your tribe to take down the swarms of Nether lead by the vicious boss Reaper that sporadically surge to attack neighborhoods, or keep the creatures out of the Safezones by working in groups to repair the anti-nether devices when they fail.\nCHARACTER CUSTOMIZATION\nNether offers a wide variety of character customization and allows you to play as a male or female character. There is a huge selection of cosmetic items and player taunts to assert your individuality along with entire outfits to play roles like survivalist, soldier and biker - or even just play in your underwear.\nOTHER\nHost your own private servers and control your settings and player population\nFirst-person perspective creates a true survival experience\nMeld of PvE (player versus environment) and PvP (player versus player) gameplay\nNew weapons and items become available as players explore the game world\nUp to 64 players per game server\nSingle purchase, downloadable client allows full game access without subscription","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phosphor Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":15954,"name":"Collapse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/daa/daaaa0d9df12bf0a96b622a6120fd61f.jpg","description":"In 2013 the Central Europe (Ukraine, Kiev) witnessed a catastrophe. Everybody was mystified by its cause. What happened was beyond peoples comprehension. Somebody called it the collision of worlds or the stratification of two dimensions.\nThe major part of Ukraine turned into the zone of paranormal phenomena. Numbers of people were killed. Those who stayed alive and managed to leave the zone told improbable stories…the zone lived according to its own laws.\n•\tFierce battles  Fight and defeat incredible bosses using spectacular and effective system of fast-action commands. Finish your enemies with style!\n•\tProfessionally choreographed moves  There are various ways to deal with enemies at your disposal: dual-wielding swords, one- and two-handers, cluster weapon and a number of firearms. All moves are based on real-world fighting techniques and were captured using professional talent.\n•\tIntriguing, immersive story  A highly detailed world where every character has his own skeletons to hide and reasons to fight. Experience a number of unexpected plot twists leading to a surprising conclusion.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Creoteam","platforms":[{"id":0,"name":"PC"}]},{"id":15235,"name":"Wizardry 7: Crusaders of the Dark Savant","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aac/aace40e97cc77e6118ca5a28f7bb0e61.jpg","description":"For the First Time\nOutdoor Campaigns\nFull Soundtrack and Effects\nTrue Point & Click Mouse Interface\nAuto-Mapping\nUnprecedented Depth of Story\nBegin your adventure in Crusaders of the Dark Savant. Import your characters from Bane of the Cosmic Forge or create a new party capable of surviving the rigors of a strange alien world.\nBoth friends and foes you'll discover as you search for the forgotton secret of a once madman - the secret of the very universe itself. And you won't be alone in your search. Others as enterprising as you have also entered this dimension. Only your actions - both past and present - will determine just how well you fare. From the depths of a dungeon to the blue and limitless skies, you'll see it all - you'll hear it all - in this latest Wizardry adventure.\nNever\nNever has a game been as true to authentic fantasy role playing. Never has a game had four different beginnings. Never has a game been so vast.\nSometimes\nSometimes you won't find everything as you left it; you're not alone in this world. Sometimes the people you meet will like you... if you've been nice to their friends.\nForever\nForever true to the most acclaimed fantasy role-playing simulation ever, the sequel to Bane of the Cosmic Forge. Forever beautiful graphics and sound - indoors and out. Forever in the tradition of... Wizardry\nWizardry 7 Gold is currently only available in English and on the Windows platform.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Sir-Tech","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9770,"name":"Disney•Pixar Toy Story 3: The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96b/96b7b70de1d4c9641f4702f3e7b0363f.jpg","description":"The creators of the beloved “Toy Story” films re-open the toy box and bring movie goers back to the delightful world of our favorite gang of toy characters in “Toy Story 3”. As Andy prepares to depart for college, Buzz, Woody and the rest of his loyal toys are troubled about their uncertain future. Directed by Lee Unkrich (co-director of “Toy Story 2” and “Finding Nemo”), “Toy Story 3” is a comical new adventure in Disney Digital 3D that lands the toys in a room full of untamed tots who can’t wait to get their sticky little fingers on these “new” toys. It’s pandemonium as they try to stay together, ensuring “no toy gets left behind.” Pixar veteran Darla K. Anderson (\"Cars\" and \"Monsters, Inc.\") produces, while Michael Arndt, Academy Award-winning screenwriter of \"Little Miss Sunshine,\" brings his unique talents and comedic sensibilities. In the Toy Story 3: The Video Game help Buzz, Woody and the rest of the Toys ensure no toy gets left behind. Dive into all new heroic adventures in Story Mode or let your imagination run wild in the exiting new open world of Toy Box Mode! Come and play to infinity…and beyond!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo DS"}]},{"id":9747,"name":"Red Crucible: Firestorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/866/866f58d49b614a39530a8a7b65a9a46d.jpg","description":"Compete with friends or players from around the globe using some of the world's deadliest modern weapons and vehicles. Play with up to 24 players in unique arenas designed for infantry, vehicle, and air combat.\nGame Modes:\n- Search and Destroy\n- Territories\n- Conquer\n- Survivor\n- Team Deathmatch: Resources \"TDR\"\n- Team Deathmatch: Armored \"TDA\"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rocketeer Games Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3911,"name":"Puppeteer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2f/c2f2d714855404a8d2c0faad434a9d76.jpg","description":"One dark moonlit night, a young boy named Kutaro was carried away by the maleficent Moon Bear King to a black castle where the unlucky lad was transformed into a puppet.Kutaro displeased the terrible tyrant, who devoured the boy's wooden head and cast away his body. But the headless hero was not alone, for he had discovered a very special pair of scissors to help him on his harrowing adventure to find his head, and his way home.Puppeteer is a brand new franchise developed exclusively for the PlayStation®3 system by SCE JAPAN Studio. Set in a magical puppeteer’s theatre, this title will introduce you to a strange and fantastic world, where the environment is constantly changing. Players will enjoy a rich, dark fairytale where surprises lurk around every corner.PS3 system software v3.65 or higher, HD 3D display with compatible 3D active glasses and highspeed HDMI cable (sold separately) required for 3D features. Visit www.us.playstation.com/support/3D for details.\n©2013 Sony Computer Entertainment Inc. Puppeteer is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SCE Japan Studio","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":53432,"name":"Ultimate Mortal Kombat 3","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/18f/18f130a198e4c6f1970ad1f36dda7d1f.jpg","description":"Ultimate Mortal Kombat 3 (UMK3) is a fighting video game in the Mortal Kombat series, developed and released by Midway to arcades in 1995. It is an update of 1995's earlier Mortal Kombat 3 with an altered gameplay system, additional characters like the returning favorites Kitana and Scorpion who were missing from Mortal Kombat 3, and some new features.\nSeveral home port versions of the game were soon released after the arcade original, although none were completely identical to the arcade version except for the Sega Saturn port. Some later home versions followed the arcade original with more accuracy. Some versions were released under different titles: Mortal Kombat Advance for the Game Boy Advance in 2001 and Ultimate Mortal Kombat for the Nintendo DS in 2007. The iOS version, recreating the game using a 3D graphics engine, was released by Electronic Arts in 2010.\nUltimate Mortal Kombat 3 was mostly well received and has been considered a high point for the Mortal Kombat series. However, the iOS remake and some other home versions were received poorly in comparison to the arcade game.\nUltimate Mortal Kombat 3 was updated to include more content from previous games in the series as Mortal Kombat Trilogy in 1996. The 2011 compilation Mortal Kombat Arcade Kollection includes an emulation of UMK3 as well as the first Mortal Kombat and Mortal Kombat II.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Electronic Arts","platforms":[{"id":0,"name":"3DO"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"SNES"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Genesis"}]},{"id":15576,"name":"Wizardry 6: Bane of the Cosmic Forge","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8e/f8e09006f0b07217c017762351035d46.jpg","description":"FULL-COLOR ANIMATED graphics\nDIGITIZED sound (NO add-on cards required)\nHARD DISK supported\n11 Races, 14 Professions (with rankings!)\nWeaponry, Physical and Academia Skills\nSix Spellbooks, 462 Combinations\nNon-Player Characters\nAn arsenal of over 400 researched items\nVaried Fighting Modes\nPrimary and Secondary Attack\nContinuous Journey\nUnlimited Backups\nSave Game\nTen years ago, WIZARDRY set the standards in Fantasy Role-Playing (FRP). Now after two million copies have been sold and dozens of awards have been won, Bane of the Cosmic Forge raises and redefines those standards. This new WIZARDRY, the truest simulation ever of Fantasy Role Playing, will push your computer, your mind, and your sense of adventure to their very limits. Only through the power of the latest computer technology could the full dimensions of this new genre in FRP be possible.\nThis is FRP the way you wanted it to be.\nPrepare yourself. Take with you six companions - choose wisely, for having chosen, your fate is in their hands. Enter the ancient castle to retrieve the Cosmic Forge, a magical pen whose writings caused the river of time itself to change course. You will find treasure, armor, and magic items to advance your quest; meet wizened and cryptic dwellers who hold secrets that must be unearthed; and solve the riddles and puzzles that abound.\nBut beware- you and your party will encounter countless dangers, hazards, and creatures of dazzling form to block your way. Only through your magic and skills, ever growing as you progress, can they be vanquished.\nAnd the story, so rich in mythology and legend, weaves a web of intrigue so complex that only you, with patience and travail can unravel.\nLet the computer roll the dice, consult the charts and apply the rules. From the 400 items of armor and weaponry researched for authenticity to the realistic combat structure, incorporating Primary and Secondary attack, this reproduction of true FRP within the computer environment will make all other attempts obsolete.\nThe adventure is as real as the pleasure.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Sir-Tech","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3667,"name":"Enemy Front","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4aa/4aa981216a75c3b27461b3ddc7fc8647.jpg","description":"ENEMY FRONT is the first truly modern WW2 FPS, featuring stunning visuals, open-ended levels and a richly interactive combat experience that breaks out of the standard model of highly linear scripted FPS experiences, giving the player full freedom to own their playing style. Intense Combat, Sniping, Stealth and Sabotage – all are viable approaches for the player, maximizing player engagement and replayability. Against the visceral backdrop of breathtaking European locales, the player takes on the role of American Robert Hawkins, as he fights hand in hand with Resistance Fighters opposing the Nazi juggernaut in France, Germany, Norway, and during the Warsaw Uprising.\nChoose your own fight: gameplay blends fast-paced FPS action with precision sniping thrilling stealth, and deadly sabotage in the first open-ended WW2 game.\nDeal death from afar: use sniper rifles to decimate enemy ranks and pick off officers, enemy snipers and heavy weapons gunners with deadly precision.\nBreathtaking visuals, interactive environments and spectacular action across many iconic Resistance operations of WW2.\nChoose your own weapon: full arsenal of WW2 weaponry across all categories of hand-guns, SMGs, assault rifles, sniper rifles, as well as signature Resistance weapons including the Sten gun, Welrod Silenced Pistol, and Lightning SMG.\nOwn the battlefield: combine reconnaissance, explosives and marksmanship to prepare, misdirect and ambush numerically superior Nazi troops.\nEngaging, destructible environments and advanced tactical AI means combat is always a rewarding and dynamic experience.\nHighly replayable 10 hour Single-Player Campaign and 12-player Online Multiplayer, all powered by CRYENGINE technology.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"City Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3560,"name":"NBA 2K15","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/792/792a63d8f5d9d48b2d07297684c9e3d5.jpg","description":"On the heels of NBA 2K14’s 70 Game of the Year Award Nominations, the NBA 2K franchise is the ultimate basketball simulation experience. Featuring NBA MVP Kevin Durant on the cover, NBA 2K15 hits the court with unprecedented life-like graphics, ultra-realistic NBA gameplay, and more.\nTake your MyPLAYER on an epic journey from undrafted rookie tryout, to MVP, to NBA Hall of Famer. Park Mode lets you ball against the world’s toughest 2K competitors in cutthroat multiplayer pick-up games. Every jersey, juke, and pom pon is brought to life with unrivaled realism. To top it off, NBA 2K15’s music has been curated by famed producer and musician, Pharrell.\nNBA 2K15 has created a truly authentic NBA adventure. It’s up to you to claim your destiny. YourTimeHasCome\nNOTE: All multiplayer servers for NBA 2K15 will be shutdown as of 12/31/2016. After that time, all game functions requiring online servers will no longer function.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2005-2014 Take-Two Interactive Software and its subsidiaries. All rights reserved. 2K, the 2K logo, and Take-Two Interactive Software are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. The NBA and individual NBA member team identifications used on or in this product are trademarks, copyrights designs and other forms of intellectual property of NBA Properties, Inc. and the respective NBA member teams and may not be used, in whole or in part, without the prior written consent of NBA Properties, Inc. © 2014 NBA Properties, Inc. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"2K","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":52390,"name":"Garage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76b/76bb86c99a35e4211983e4523a434b0e.jpg","description":"Garage is a bloody shooter in the style of an 80s B-movie. Playing as a\ndrug dealer named Butch, you stand alone against hordes of the living\ndead.\n\nExplore every dark corner of an underground parking garage and discover\na passageway to a supernatural world that has never seen the light of\nday.\n\nFind new weapons and master them in order to survive. Solve the mystery\nof this cursed place and the creatures that inhabit it.\n","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"tinyBuild","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18777,"name":"Sam & Max: 106 - Bright Side of the Moon","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a0/6a0128db1c6c52050ca3d38c68ace868.jpg","description":"Sam & Max 106: Bright Side of the Moon is an episode of graphic adventure game Sam & Max Save the World (known before 2009 as Sam & Max: Season One). This is the sixth and final episode of the game.\r\n\r\nStory###\r\nThe starts place right after the events of the previous episode. Sam and Max, the protagonists of the series, have identified the mastermind behind the villainies from the previous episodes. The only thing left to do is to catch the suspect. However, to do so, they have to travel to the moon where the culprit hides. Throughout the game, Sam and Max have to travel between Earth and the moon several times, so they meet many characters from previous episodes. \r\n\r\n###Gameplay\r\nLike every other episode of the game, Sam & Max: Bright Side of the Moon is a story-driven point-and-click adventure game. The game heavily relies on its story, characters, and humor.\r\nTo progress through the game, you have to solve puzzles, interact with NPCs and explore the environments. Some of the quests require possessing of certain items which you can store in the heroes’ inventory and use when needed. In some cases, to progress, you have to choose the right lines of dialogue from dialogue tree when speaking with NPCs. The player can travel between various locations on a car and sometimes has to visit previously explored locations to solve previously unsolvable puzzles, access new locations or conversate with other characters after getting new useful information.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":10519,"name":"AdventureQuest 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/635/635a68c75ef270e8b6764170218ead29.jpg","description":"AdventureQuest 3D is an inspired re-imagining of the original 2D flash web browser games. BATTLE ON!\nA true cross-platform massively multiplayer game that allows you to play your character, on the same world as your friends, from your PC, Mac, Android, and Apple iOS devices.\nSet in the most dangerous era of AdventureQuest's timeline, the world has come under attack by a mysterious new threat. Answer the call and travel to the legendary town of Battleon where you will discover unusual characters, incredible adventures, \\horrifying puns, and a world story line so big that you will have to help us write it as we go... did we mention regular updates?FEATURES Cross-Platorm - Play your character, on the same world, from your PC, Mac, Android, Apple iOS phones & tablets.\nReal Time Combat\nMulti-Class System\nWeapon Fusion\nEvolving World - regular updates with new stories, areas, monsters and weapons","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artix Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9501,"name":"Microsoft Flight Simulator X","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ca/4ca74e02f14213eea7b0b10f1bff95d6.jpg","description":"Take to the skies in the World’s favourite flight simulator!\nThe multi award winning Microsoft Flight Simulator X lands on Steam for the first time. Take off from anywhere in the world, flying some of the world’s most iconic aircraft to any one of 24,000 destinations. Microsoft Flight Simulator X Steam Edition has updated multiplayer and Windows 8.1 support.\nTake the controls of aircraft such as the 747 jumbo jet, F/A-18 Hornet, P-51D Mustang, EH-101 helicopter and others - an aircraft for every kind of flying and adventure. Select your starting location, set the time, the season, and the weather. Take off from one of more than 24,000 airports and explore a world of aviation beauty that has entranced millions of plane fans from across the globe.\nFSX Steam Edition offers players a connected world where they can choose who they want to be, from air-traffic controller to pilot or co-pilot. Racing mode allows you to compete against friends with four types of racing, including Red Bull Air Race courses, the unlimited Reno National Championship course, as well as cross country, competition sailplane courses and fictional courses like the Hoop and Jet Canyon. Test your skills with three different levels of difficulty, from simple pylon racing to racing highly challenging courses in a variety of weather conditions.\nWith over 80 missions, test your prowess to earn rewards. Try your hand at Search and Rescue, Test Pilot, Carrier Operations, and more. Keep track of how you have done on each mission and improve your skill levels until you’re ready for the next challenge.\nFSX Steam Edition enables pilots to fly the aircraft of their dreams, from the De Havilland DHC-2 Beaver floatplane and Grumman G-21A Goose to the AirCreation 582SL Ultralight and Maule M7 Orion with wheels and skis. Add to your collection of aircraft and improve the fidelity of your world with FSX Add-ons.\nThe inclusion of AI-controlled jetways, fuel trucks and moving baggage carts, adds extra realism to the experience of flying at busy airports.\nWhether you want to challenge your friends to a heart-pounding race or just take in the scenery, FSX Steam Edition will immerse you in a dynamic, living world that brings a realistic flying experience into your home.\nDownload size: 16.4GB\nPLEASE NOTE\nMicrosoft Flight Simulator X:  Steam Edition (FSX: Steam Edition) is functionally similar to the boxed version of Microsoft Flight Simulator X (MSFSX). We have worked extensively with third party developers to make sure the two products can work alongside each other, however due to the wide range of add-on products available for MSFSX, we cannot guarantee that your existing content will work with Microsoft Flight Simulator X Steam Edition.\nThe Flight Simulator X Software Development Kit (SDK) is not included with FSX: Steam Edition.\nIf you already have MSFSX installed on your PC and are concerned about running the two games alongside each other, you may wish to consider installing FSX: Steam Edition on a separate PC.\nIf you already have MSFSX and add-ons installed they will only be accessible through your existing installation. They will not be duplicated across the original edition and Steam Edition of the simulator.Included AircraftAugusta Westland EH101 (Helicopter)\nAirbus A321\nAirCreation 582L Trike Ultralight\nBeechcraft Baron 58\nBeechcraft King Air 350\nBell 206B JetRanger (Helicopter)\nBoeing 737-800\nBoeing 747-400\nBoeing F/A-18\nBombardier CRJ700\nBombardier LearJet 45\nCessna C172SP Skyhawk\nCessna C208B Grand Caravan\nDe Havilland DHC-2 Beaver\nDG Flugzeugbau DG-808S\nDouglas DC3\nExtra 300S\nGumman G21A Goose\nMaule M7 Orion\nMaule M7 Orion (on skis)\nMooney Bravo\nNorth American P-51D Mustang\nPiper J-3 Cub\nRobinson R22 Beta II (Helicopter)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microsoft Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":517399,"name":"Overcooked! All You Can Eat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a6/2a61b0ed0bf014f9f6fbbc8294d08f39.jpg","description":"Overcooked!, Overcooked! 2 and all additional content are blended together and remastered in this delicious definitive edition!\nEnjoy hundreds of levels of cooperative cooking chaos across increasingly perilous and obscure kitchens.\nOvercooked! Goes Online\nFor the first time ever, online multiplayer has been fully integrated into Overcooked! Revisit your favourite kitchens from the first game in stunning 4K and ONLINE!\nA Visual Feast!\nBoth games have been taken to the next level with stunning, enhanced 4K visuals - this is the best that the Overcooked! series has ever looked.\nTasty New Content!\nNew levels, new chefs and new mayhem - all exclusive to Overcooked! All You Can Eat.\nMultiple Modes!\nPlayers can enjoy campaign, survival and practice modes, and new to All You Can Eat - assist mode! Assist mode offers a number of options to allow for a less frantic game including slower recipe timeout, increased round timers and the option to skip levels.\nAccessible For All!\nOvercooked! All You Can Eat contains a features to allow as many players as possible to join in the food frenzy! Scalable UI, dyslexia friendly text and colour blindness options are all available.\nJourney back to the Onion Kingdom for a feast of epic proportions in Overcooked! All You Can Eat.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":28540,"name":"Fight Night Champion","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/907/9072a603448c13e1223b53dcc8019cca.jpg","description":"More than just a change to the franchise name, Fight Night Champion takes the boxing experience one giant step forward by delivering an experience never before seen in an EA SPORTS video game. History will be made with this revolutionary iteration that builds upon the best-in-class gameplay and physics engine of Fight Night Round 4, while immersing you in a world of brutality, uncertainty, betrayal, and redemption. Survive the brutal road to redemption with Fight Night Champion.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":23973,"name":"Pokémon Alpha Sapphire, Omega Ruby","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47f/47f1aa9b0975820cb5af16b9d263e663.jpg","description":"Pokémon Omega Ruby and Pokémon Alpha Sapphire will take players on a\njourney like no other as they collect, battle and trade Pokémon while\ntrying to stop a shadowy group with plans to alter the Hoenn region\nforever.\n\nFEATURES:\n\nEmbark on a new adventure through the Hoenn region, an area rich in\nnatural beauty, that contains a cave that shows a scene described in\nlegends.\n\nExperience the awe of Primal Reversion, a new, extremely powerful\ntransformation undergone by Legendary Pokémon Groudon and Kyogre.\n\nGet even closer to solving the mysteries of Mega Evolution as more\nPokémon gain this powerful ability.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":491834,"name":"Milky Way Prince – The Vampire Star","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f7/0f7097e6f468bfefa94cf343936a8e08.jpg","description":"A visual novel about an abusive relationship, idealization, and intimacy.\nLive a summer of dysfunctional love through branching storylines, twists, sudden changes, and a special mechanic where you choose which senses to use with your boyfriend. In these moments, you will learn about him, his personality, and his past, making you question everything.\nMilky Way Prince is entirely designed, programmed, illustrated, and scored by a very young author, Lorenzo Redaelli. The story itself is partially autobiographical.\n\"During my experience with a borderline partner, I thought that falling in love with him was like becoming part of a binary star system. It’s the rarest, most precious thing in the universe – but the closer they get the more unstable they become. My idea was to create an immersive experience where the player is asked to try to understand the dynamics of this unusual relationship. The character you interact with adapts their behavior to yours – using academic terminology, they could set up “rage tests”, “love bombing\", or otherwise guilt trip you. The plot's branching storyline is guided by variables such as “submission” and \"interest” that fluctuate at each interaction.\"\nSemi-autobiographical dark romance story\nBranching narrative paths with multiple endings\nIntimate new sensory gameplay system\nCharacter art inspired by Suehiro Maruo and Masaaki Yuasa\n3D environments influenced by the stage design of Robert Wilson\n30+ minutes of baroque electropop original soundtrack","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Eyeguys","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":452647,"name":"NBA 2K21","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e79/e7901bf8d36cf8ebaf4886d8cd28c7e4.jpg","description":"With extensive improvements upon its best-in-class graphics and gameplay, competitive and community online features, and deep, varied game modes, NBA 2K21 offers one-of-a-kind immersion into all facets of NBA basketball and culture - where Everything is Game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Visual Concepts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":16149,"name":"Terrorhedron","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c75/c751db8418efa8b4022a606491459095.jpg","description":"Terrorhedron is the 3D, cooperative tower defense game for the PC. Unmatched challenge and complexity is introduced to the genre through 3 dimensional gameplay, micro-strategy through programmable turrets and 'edge of seat' gameplay is extended to multiplayer with up to 8 players online co-op.\nDefend wave after wave of colorful Terrorhedron spheres within attractive abstract grid landscapes. Unlock new infrastructure, turrets, upgrades and tracks in your quest to achieve all the stars. Terrorhedron offers a fresh look, feel and an entirely new depth of experience to a popular genre.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dan Walters","platforms":[{"id":0,"name":"PC"}]},{"id":20154,"name":"Robotex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae8/ae8acbb93e731df8c8924822a9e027f3.jpg","description":"Life on Earth is unsustainable.\nHumanity must seek a new home but the only planet found is very hostile.\nYou were sent on a expedition to slay the monsters inhabiting the surface of this planet. In this adventure you end up being the villain.\nGame contains two basic controls, many puzzles and lots of guns and enemies.\n(10 guns and more than 20 monsters)\nThe game is hard.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"yfyx games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17614,"name":"Cargo Commander","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/267/2676d3df05e1e0cf4dee9170b147b383.jpg","description":"Alone in space, light years away from your family, armed with only your Fistcannon™, Platform Drill and the meanest cup of coffee in the sector; you are Cargo Corps’ latest recruit, a Cargo Commander.\nYour responsibilities are simple: travel through the vast reaches of wormhole-filled space salvaging priceless cargo from alien infested containers. The work, however, is hard, honest, and hairy:punch and shoot deadly mutants in the face, while traveling between your ship and containers. Jockey for promotions with thousands of other Cargo Commanders in the galaxy, collect over 80 different cargo types, all the while earning your way back home.Key FeaturesRandomly generated levels based around names.  Choose any name to generate a new custom sector and share with your friends to compete for high score!\nFully destructible environments; create your own path with your Platform drill and explosives\nCompete with other players for promotions; each sector has an online leaderboard\n2 different play modes: Career and Journey\nLoot the dead corpses of other players' vain attempts at beating your score\nUpgradeable weapons and tools","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Serious Brew","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13169,"name":"A grande bagunça espacial - The big space mess","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61a/61ab0e6a2e2a3629bb462f0b967308c8.jpg","description":"Twitter: @ArraisRen\nYoutube: https://www.youtube.com/channel/UCy10wtHEtiucw2AzoCUEA1w\nFacebook: https://www.facebook.com/baguncaespacial/\nAt the opening screen, after setting the language, hold the space bar to see a flash.\nThen click NOVO JOGO (NEW GAME). All phases and all the characters are released!\nHello everyone!\nWelcome to the craziest adventure of your lives!\nThe Brain Monster from Space decided to become a big successful villain with intergalactic recognition to make his father - a famous monster - proud! For that, he took some gifts he got from his father (giant worms, evil robots and other stuff from alien armies) and started his evil plans: to capture some defenseless damsels, steal some banks, plunder and destroy some planets, he even considers getting into politics!\nBrain Monster doesn't care to understand the local wildlife when he invades a planet. So he makes some mistakes, like disguising a drone as a fish or a lobster and sending it to fly saying: - Fly, my little turtle!\nOne of his evil deeds was to kidnap Babe, Waldisglédson's girlfriend, the pizza boy. Waldisglédson, in turn, joined a special army to find the Brain Monster and rescue his Babe.\nThe fearless Waldisglédson will face creatures from space and find allies on his journey!\nMechanics:\nThe game is a side-scrolling shooter. It contains 01 tutorial stage, 08 main stages with 02 optional stages each, 01 credits stage and 01 stage with different game mechanics, which is subdivided into 09 interdependent parts that form a complex puzzle. In total, there are 27 stages.\nThe player has at their disposal 04 different weapons for 16 characters (01 starting weapon, 03 unlockables and 12 very well-hidden), each with a unique special ability. There are also collectible items hidden throughout the stages and 100 medals obtained with player skills. The instructions to get the medals are in a screen accessed through the stage select screen.\nThe controls are as simple as can be. The options are chosen with the mouse and the ENTER key. The player uses the arrow keys to move the character and the space key to attack. The ENTER key, when pressed during a stage, aborts the mission and returns to the stage select screen.\nIf the player wants to find every one of the 16 characters, he must pay attention to the description of the 04 main characters. Every main character, when selected, shows a small text saying in what stage his 03 friends are. A main character cannot find the friends of the other main characters. Each one of these friends will ask for two gifts in exchange for their help, and they will tell where the gifts are. When the player has the two gifts, he must return to the stage where the friend was and deliver them. The gifts can only be found if the user has already found the friend who asks for them. After finding both gifts for a friend, the player can use any character to deliver them. Doing this, the player adds a new character to his host.\nThe subtitles are available in Portuguese, Spanish and English, and can be changed at the beginning of the game.\nAfter choosing the subtitles, the player can do a small trick: when the 4 main characters and the start menu show up on the screen, they can hold the space key until a light flashes on the screen. The player can then click on \"new game\". This way, the player starts with full power, lives, ammo and armor, every stage and character unlocked and a huge part of the medals.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RMAL","platforms":[{"id":0,"name":"PC"}]},{"id":353464,"name":"GRIME","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9bf/9bfe832a35831030fc8233f0d8b3c96e.jpg","description":"A strange material collapses unto itself, the world rumbles, and you are born.\nExplore a surreal world obsessed with proportions and anatomy.\nMeet its inhabitants. Piece together their history, relations, and the source of their madness.FEATURES\nStriking, Surreal Visuals: Explore weeping caves, face covered deserts, and different civilizations all rendered in beautiful 3D. Face foes born from the world itself, and devour them whole.\nLiving Weapons: Fight using weapons made out of other living creatures that change their forms during combat, from clawing swords to centipede whips.\nParry-centric Combat: Punish enemy attacks by catching and absorbing them, growing your strength in the process.\nUnique Skill Tree Progression: Consume bosses to gain game-changing abilities. Hunt down and absorb challenging monsters to progress through your skill tree and customize your play style.\nExplore an Interconnected World: Uncover hidden secrets, encounter eccentric NPCs, and find unique items, all in a seamless, interconnected world.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Clover Bite","platforms":[{"id":0,"name":"PC"}]},{"id":39141,"name":"The Dark Eye: Demonicon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55c/55cd5ebdf5d76ba50f6c982c9774bed9.jpg","description":"The Dark Eye - Demonicon is a thrilling action-RPG set in the extraordinarily popular universe of “The Dark Eye”, a richly crafted fantasy world beloved by fantasy gamers across the globe.\nThe Dark Eye - Demonicon tells the tragic story of a brother and sister who become pawns of sinister forces in a world of cruelty and depravity. In this bleak yet magical world, their affection is both a blessing and a curse. Both are constantly threatened by mortal danger and demonic temptation, and must find a way through their tortured lives by facing serious moral decisions. Their common destiny will determine that of the entire continent, and will be decided by the choices they make. Hordes of fiends block their way to freedom and peace, and only through battle and magic they will truly become free of the darkness.\nA third-person action-RPG featuring brutal melee attack combos and dazzling magic spells\nPowerful storytelling with an elaborate narrative rich with twists, as well as believable conflicts and ethical decision-making opportunities\nAction-packed battles, where pin-point timing and clever tactics play important roles\nUnique magic system: a dark talent grants the player devastating mystical powers and changes his physical appearance\nComprehensive crafting system allows for creation of potions, poisoned blades and enchanted armor\nState-of-the-art 3D visuals using the powerful Havok Vision engine\nA richly detailed game world embedded in the extensive fantasy world of The Dark Eye","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Noumena Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":349515,"name":"Scribble It!","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/778/7787104761e606ec75973a1e32e2573d.jpg","description":"Scribble it! is a digital reimaging of classic party drawing games. Featuring game modes such as: “Scribble it!”, “Guess it!” and “Rate it!”. Designed from the ground up to be played and enjoyed in multiplayer, it allows anyone to easily join and enjoy over 2000 words in both English and German. It’s sure to get a laugh out of you and your friends!\nWith the Steam Workshop support, players can create custom word lists for games, allowing for endless possibilities and a lot fun! You can also plug in your drawing tablet and use it instead of your mouse, allowing even more precise scribbles!Scribble It!One alternating Player illustrates a word - all other players have to guess! Time is everything as the quickest minds and the best artists will get the most points!Guess It!Same as Scribble It! but different! Everyone draws their own word at the same time. You only see and make guesses on the finished pictures.Rate It! All players illustrate the same word at once. Afterwards you have to rate the pictures of the other players - The perfect Game Mode to show off your drawing skills!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Detach Entertainment","platforms":[{"id":0,"name":"PC"}]}]