[{"id":17899,"name":"Retaliation","genre":"Action","price":0.0,"description":"Lost and alone in a place that feels strangely familiar. Can you solve the puzzles and find clues to uncover the secrets of Verdant Creek?\nRetaliation is a Student project produced by the 'Electric Bandwidth' team back in 2014 while studying at the 'University of Creative Arts Farnham'.\nActive Development is still taking place. It is my intent to respond to feedback and anything that can be done to improve the game will be considered and hopefully implemented.\nhttps://www.facebook.com/RetaliationTheGame/?fref=ts","imageUrl":"https://media.rawg.io/media/screenshots/301/301bb394062a08184c322b22d40806a0.jpg","releaseYear":2015,"developer":"Cameron Baxter","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17873,"name":"Ben and Ed","genre":"Action","price":0.0,"description":"Ben and Ed is a 3D platformer, which takes place in an uncommon dystopian world. The player controls Ed the Zombie, who is forced to participate in a grotesque game show called \"Rundead\".Will he beat all obstacles Hans Showmaster confronts him with, to save his best friend Ben?\nLose your limbs, but that is ok, you're a zombie!\nSurvive deadly traps, well... you're dead anyway!\nLiberate your best friend Ben, he really needs your help!\nDefeat monstrous machines!\nThrow your head to reach hidden locations and recover your body!\nJump, creep, dodge, crawl... come on! Just reach the goal, no matter in what condition!\n23 deadly, colourful obstacle courses filled with blades, hammers, lasers, acid, dog food and chicken.\nUnlockable challenges.\nChicken, chicken, chicken, CHICKEN and Chicken!\nEd – the Participant\nA few months ago, Ed won the „Candy Fun Marathon“ silver medal. Unfortunately he died a few minutes later from a heart attack.\nFor more than 4 days nobody found his body, rotting in a nearby field. As fate willed and for reasons unknown, Ed became the first undead. For days he aimlessly wandered around, finally being found by a young boy named Ben.\nBen – the Prize\nHe is just a normal boy. Well, he never had any good friends, but is fine with this. Ben always liked to roam the ruins and bleak fields around his neighborhood, where he one day discovered something unbelievable. Ed, an undead, walking around the dreary landscape. Ben chummed up with Ed and started to feed his new friend meat and dead animals he found. This went well, until Hans Showmaster heard of Ed.\nHans Showmaster – the Host\nHe is famous, rich, ruthless and the creator of countless successful Shows that brought joy and distraction to the poor population of a wasted, hopeless world. When he is informed about an undead, he creates a new format and abducts Ben to \"persuade\" Ed into his twisted new game show.","imageUrl":"https://media.rawg.io/media/screenshots/250/250cbbfbd78c21d460082f6af862996b.jpg","releaseYear":2015,"developer":"Sluggerfly","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17817,"name":"Tiny Barbarian DX","genre":"Action","price":0.0,"description":"What's a barbarian to do? Captured by crazed cultists, tied to a tree, and abandoned as buzzard chow, our pixelatd protagonist is ready for revenge! Sword & Sorcery! Might & Muscle! Are you Tiny enough for this Barbarian-sized adventure?\nTiny Barbarian DX is an action-packed sword 'em up inspired by fantasy pulp fiction. Like those short stories, the game is split into four distinct episodes, each with a new setting, new enemies, and new music! Best of all, when you buy the game, you will get all other episodes as they become available! Episode 1 is available now, with more coming soon!  What are you waiting for? It's Time to Get Tiny!\nState of the art low-def graphics shock and amaze!Slice and slam fearsome foes with stunning swordplay!Jump, grab, and climb past precarious platforms push your pixel prowess to perfection!Full Color PDF Manual!","imageUrl":"https://media.rawg.io/media/screenshots/fbe/fbe9167af492695c94701e0198e7c3a4.jpg","releaseYear":2013,"developer":"StarQuail Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17616,"name":"R.O.O.T.S","genre":"Strategy","price":0.0,"description":"R.O.O.T.S is a real-time strategy game that pits the player against colorful yet invasive enemies that must be overtaken before the player themselves is uprooted! Warfare has never been so beautifully unorthodox.\nMinimalistic graphics, pleasant sounds and smooth controls makes R.O.O.T.S a distinct piece of art that is a pure pleasure to play.\n~~~~~ R.O.O.T.S FEATURES ~~~~~\nVibrant warfare that feels nonviolent\nA unique gaming experience for all\nStimulating gameplay\nRelaxing soundtrack that fits\nVariety of changing environments\nHours of replay using different strategies\nIntense skirmishes\nSharp enemy AI\nSimilar to games like Eufloria, Galcon, and Tentacle Wars, R.O.O.T.S is a straightforward, simplified and visually stunning real-time strategy game. Given the right amount of focus, every level and enemy can be skillfully and swiftly conquered.\nEvery decision plays a factor, only the best can plant the seed and grow their army.\nCan you hold your planet and defeat the creeping, plotting enemy?\nPlay today and find out what the word INVASIVE truly stands for!\nBe proud of your R.O.O.T.S","imageUrl":"https://media.rawg.io/media/screenshots/dde/dde702d04a65bd520cac352dc127ceaa.jpg","releaseYear":2015,"developer":"reMaginarium","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17348,"name":"May’s Mysteries: The Secret of Dragonville","genre":"Casual","price":0.0,"description":"Please Note: This is not a 'new release' but a first release on Steam. The original PC version of May's Mysteries was available in 2012 but was never released on Steam, this is the Steam release of that same game.\nMay's Mysteries: The Secret Of Dragonville is an exciting puzzle adventure. Follow May, an intelligent and charismatic girl, in her quest to find her missing brother. Advance through the adventure by solving over 270 logic puzzles, tricky rhythmic games and hand drawn hidden object scenes. Search for clues about May's brother, visit mysterious locations and meet interesting characters along the way, which will help you in your journey.\nFeatures:\nOver 270 mini-games: 230 logic puzzles, 25 hidden object games and 13 rhythmic games\nIntriguing storyline adventure with 80 locations\nTravel through 4 intriguing worlds, visit mysterious locations and discover well kept secrets\nCharming hand-drawn graphics\nMeet curious characters along the way who can help you in your journey\n8 music themes\nExperience the story through unexpected upheavals and enjoy 7 minutes of hand drawn animated cut scenes.\nOver 25 hours of gameplay","imageUrl":"https://media.rawg.io/media/screenshots/da7/da71df9856584abad4ece4e95220b5da.jpg","releaseYear":2014,"developer":"V5 Play","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17233,"name":"Black Forest","genre":"Casual","price":0.0,"description":"Black Forest is a turn-based multiplayer game about cooperation and betrayal. A resource-management strategy game about survival and despair. It is set in the dark and dangerous Black Forest in medieval Germany. It is a casual game, meaning that you will spend anywhere from a few minutes to maybe half an hour per day, with a game possibly running for several weeks.\nIn the game, each player controls one family in a village that is located deep in the forest. Everyone tries to survive the wolves, bears and worse that come at night. Plant and harvest, gather and build, cooperate and betray. Survive as a community, but do not forget about yourself. Try to survive the coming winter to win the game. Or simply be the last survivor to gain a personal victory.\nThe core element of the game is cooperation and its limits. At some point, you have to think of yourself first. If your community is strong, others will help you. But the forest will sooner or later overwhelm you all - when will cooperation break down? Will people betray openly, or trick? Is that proposal a trick maybe, or really the best? What role will common ground play? Does the village provide shelter for those who lost their homes? Do you share resources or keep them private? All of these and many other questions will be asked and answered in every game.","imageUrl":"https://media.rawg.io/media/screenshots/969/9695ee76241e092c01c9d7d38999742c.jpg","releaseYear":2016,"developer":"Lemuria","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15122,"name":"Act of Aggression - Reboot Edition","genre":"Strategy","price":0.0,"description":"Act of Aggression – Reboot Edition brings the techno-thriller RTS game Act of Aggression to a higher level. The Reboot Edition offers a full gameplay overhaul: new resource system, playable builder units, new base buildings, simplified research system, and many major mechanic improvements for smoother and more dynamic gameplay in skirmish mode against the AI and in your multiplayer battles. Either launch the original game or Reboot Edition as you see fit, and experience the new benchmark of real-time strategy games.\nWith three global super-powers, there can be only one victory.\nAcross three distinct factions each armed with the greatest modern and prototype military weaponry, head into some of the world’s most volatile conflict zones, building bases for mass production, establishing resource supply lines, and waging war in Eugen Systems’ explosive RTS.\nBuild and manage the cogs of war in a return to strategic base-building, resource harvesting, and dynamic tech-trees. Capture banks and enemy soldiers to generate cash income. Upgrade units with specialization and unlock new skills. Embark on an epic single player Campaign with a thrilling original story, and fight throughout the world on realistic environments. Compete online in visceral PVP battles and become the best commander!\nAct of Aggression Reboot Edition brings new features to skirmish modes:\nStreamlined Economy: Manage two resources: oil and cash, allowing you to focus on the action. Unit expenditure is up-front, meaning no more micromanaging production lines.\nNew Base Building System: Like a traditional RTS, base building units are selectable. Build directly from the builder (or destroy your opponent’s builder!)\nNew Airstrikes: You no longer control the planes mid-flight. They go directly to their target and strike, much faster than previously.\nHuge balancing update and unit model improvements as well as UI tweaks and changes: for example, all units now accelerate and decelerate faster, with more streamlined, action packed RTS gameplay.","imageUrl":"https://media.rawg.io/media/screenshots/45c/45c5d392f52c85074842ed71fcd16f93.jpg","releaseYear":2015,"developer":"Eugen Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13028,"name":"Death by Game Show","genre":"Action","price":0.0,"description":"Welcome to Death by Game Show. A game of pop culture, decision making chaos and hidden parodies starring U.H.Wutt. A lead-footed tub of goo sentenced to rehabilitation in a time of droid tyranny and human ignorance.\nBecome the smarts behind Wutt’s rehabilitation, or as the fine print calls it “kidnap-come-illegal-trial-leading-to-banishment-and-death-sentence”. Fight back against the tyranny, free the minds of humanity and find freedom-for-all!\nTwitch Strategy - Death by Game Show puts survival and success into your own hands. It’s not about power but how resourceful and reactive you can be.  Can you think your way to victory?\nThe Learning Curve - Anyone can spawn a droid but can you do it while grabbing coins? ...placing buildings? ...spinning for loot? ...dodging attacks? Can you react decisively and win?\nCustomization - You can modify the game’s text, give the droids a paint job and build your own levels. Can you make and share the best via the workshop and win a prize?\nStory delivery - In Death by Game Show the story is told through short social exchanges, battlecries and hidden messages. Can you cut through the BS and find the truth?\nSatire - Death by Game Show is about fictional characters, in a fictional show within a fictional universe based on our satirical view of modern day life. Meanings, metaphors and parodies are everywhere but will you spot them?\nDeath by Game Show is still very much being refined and improved. Reach out to us via the discussions as we take all constructive criticism seriously.","imageUrl":"https://media.rawg.io/media/screenshots/a73/a7310ca782d69315e7b9ccd3aa0fb07d.jpg","releaseYear":2016,"developer":"Oointah","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12889,"name":"Inexistence","genre":"Action","price":0.0,"description":"Hald and his sister are \"Keepers\", chosen by the gods, their existence maintains order and balance in the world. But peace is not something everyone desires... Claos, a man filled with dark purpose, decides to plunge the girl in a deep slumbers, in order to break the balance and made evil. His younger brother, Hald, decides to find Claos and break the spell, regardless of the means used. For this it will have to cover a vast world full of mystery and danger...\nInexistence is an independent game developed by Jonathan Brassaud, currently in development for PC.\nDiscover a vast world full of mysteries and action in this Metroidvania-style game inspired by the classics of the 16-bit era.\nFeatures\nMany varied places, in a pixel art style worthy of the great hits of the SNES era\nRPG Elements enabling customize the stats and equipment of heroes, and get new abilities as you go\nVaried bestiary, with imposing bosses\nMany annex quests and hidden places\nMultiple difficulty levels.Many Steam achievements, trading cards, and badges, for lovers of challenges and collection.","imageUrl":"https://media.rawg.io/media/screenshots/b54/b5465ee5d08b0bdd8e9a7633e6502f03.jpg","releaseYear":2016,"developer":"Jonathan BRASSAUD","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12568,"name":"HALP!","genre":"Casual","price":0.0,"description":"A scavenger pirate captain has crash landed on an alien world. Help him and his crew fix their ship before spaceworms attack!\nHALP! is a single-player VR sandbox puzzle game where you help a stranded robot captain and his crew fix their broken ship... or where you DON'T do that and instead poke around and mess with the ship's various gizmos and contraptions. Put out fires! Fight giant carnivorous worms! Shoot some hoops! Make a general mess of things! There's plenty to do in HALP!'s colorful and light-hearted world.\nHALP! is best played with tracked motion controllers such as HTC Vive, or Oculus Touch OR with an HMD and gamepad, but we recommend using tracked motion controllers for the ideal VR experience!","imageUrl":"https://media.rawg.io/media/screenshots/2a8/2a87d4817eaa6704d1fbf9051bb24f5f.jpg","releaseYear":2016,"developer":"Fun Bits","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12396,"name":"Initia: Elemental Arena","genre":"Action","price":0.0,"description":"Initia: Elemental Arena is a new take on online arena shooters. It blends frantic team-based game play of first person Arena shooters like Unreal Tournament & the FPS Magic mechanics of Skyrim. It combines it all with strategic objectives and tactical team play.The Initia FormulaDedicated servers and competitive MatchMaking\nThe fast paced action of arena shooters\nThe progressive game play inspired from MOBA objectives\nMaps that force players to work together in a team (as well as playing for frags).\nCompetitive & fun combat – a team healer with a flame thrower? Why not!?A layer of Economy, fore-thought: Every objective captured & every kill is rewarded with match crystals.\nYou use crystals to buy higher elements & combine them with arcane abilities.\nBut every time you die items are lost – it will always be risk vs. reward.\nThe game’s different Elements allows players to link up attacks, assist team mates, and toy with enemies. Combine these with:\nA vast inventory of items.\nAt least 15 special Arcane Abilities.\nStrategic positions to capture.\nThe ability to summon god-like Avatars.\nAn ever changing range of maps & game play types.and you have an incredibly fluid battlefield where no two matches are the same.Arcane Abilities!\nArcane abilities play a very interesting role in Initia. You can buy Arcane abilities next to any magic element you choose on spawn. They are designed to offer you utility that will help you or your team in dynamic fights.\nThe versatility of combining utility with any offensive attack results in refreshing combinations that makes the game-play even more exciting. You can end up being a team healer that can also shoot fireballs.","imageUrl":"https://media.rawg.io/media/screenshots/ba5/ba57a26bd0bb23e376f7f61a843d991f.jpg","releaseYear":2016,"developer":"Gentle Ghouls","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11880,"name":"Langoth","genre":"Action","price":0.0,"description":"Langoth (Old English) means a very specific yearning, when a person had a vision of Paradise – and it was gone, but the rest of his life he was looking for it reflections.\nThe world around you is not real - it's only a high-quality multi-level simulation. Due to a virus attack on the basic simulator system, the program was corrupted and all living entities disappeared from the world and have been replaced with virus cells, eating the remains of the matter.\n\nHope fades by the minute, and the higher beings are planning to reset the simulation, beginning the long process of evolution all over again.  If that happens, the world will never be the same.\n\nSimply changing the basic code while it's being run is no longer possible, but fortunately, all is not lost!  You, a being from the outside world, have been sent as a drastic last resort to clear the viruses from inside the simulation.\n\nWill you be able to accomplish your mission and restore life on Earth as it was once before?Features:Three large locations (and one secret location)\nVarious secret places\nA variety of generated enemies\nBombs!\nBeautiful stylized graphics powered by Unreal Engine 4\nArena mode","imageUrl":"https://media.rawg.io/media/screenshots/507/5078b28d6b7bd103df9ac7cacca9cb27.jpg","releaseYear":2017,"developer":"Atum Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10036,"name":"Team Racing League","genre":"Action","price":0.0,"description":"Team Racing League\nIn Team Racing League, racing skill meets team strategy. Two teams of three players battle each other to the finish line. Only one player needs to finish first for a team to win. Other players can choose to support their racer, fight for position, or screw over opponents using a range of unique abilities. Activate anchor mode to obstruct opponents. Roast blocks or hovercrafts using your afterburner. Boost into enemies or connect your hovercraft to a teammate to extend into a roadblock. You decide which role to fulfil. Team up with friends, strategize and beat the opposing team!Features:Compete in online multiplayer 3v3 team racing.\nExperience intuitive, skill-based drifting and racing physics.\nAssume multiple roles: race, support or troll.\nUse disruptive abilities like roasting, anchor mode and movable force fields.\nConnect with a teammate and activate unique dual player mechanics.\nTeam up with friends and climb the leaderboards as a team.\nRace your own ghost in time trial to practice your track knowledge and racing skills.\nPredict the winning team and vote for MVP in Twitch mode.\nTeam Racing League’s development was inspired by top-down retro arcade racing games like Super Off Road and Championship Sprint. Instead of relying on power-ups, the game is all about teamwork and racing skills. It aims to be a pure racer, without artificial equalizing mechanics. During the race, the entire track and all racers are visible in a top-down view, giving both players and spectators an excellent overview. Team up with friends and beat your opponents together in exciting online multiplayer matches!","imageUrl":"https://media.rawg.io/media/screenshots/feb/feb1c10d4af4ff5c11caa2972aa06e52.jpg","releaseYear":2017,"developer":"Gamious","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9972,"name":"Downward: Enhanced Edition","genre":"Action","price":0.0,"description":"Downward is a first-person open-world parkour based platform adventure set in the medieval ruins of a post-apocalyptic planet Earth. Make your way through breath-taking landscapes, face ancient guardians and unravel the deep mystery that lies behind the disappearance of humanity.\n\nDownward will let you set off on humanity's final adventure, to seek out an explanation for the apocalypse that changed the Earth as we know it.","imageUrl":"https://media.rawg.io/media/screenshots/b3a/b3aec73220f89df3000d61e49d57ac34.jpg","releaseYear":2017,"developer":"Caracal Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":9926,"name":"HOUND","genre":"Simulation","price":0.0,"description":"Breathe life into an empty void and watch as it grows, evolving into a world of your choosing. Your only goal is to create a complex ecosystem - it can be a brutal world of predators or a peaceful garden; breed an intelligent species capable of speech or a super-organism that will consume the stars. With HOUND, you make the world that you want.\nHOUND gameplay is simple: you start with an empty world, build your ecosystem, design your first organism and throw it into the void. HOUND’s advanced artificial intelligence analyses your creation, finds it strengths and weaknesses, then gives it competition in your world. Watch as life evolves before your eyes - literally; the creatures exist in three dimensions, develop legs, wings and communication*. Your organism will fight for survival, stimulating successful mutation and increasingly more complex life forms.\nLeave your new world for too long though, and the simulation will go out of control. Overpopulation, plagues or even a supernova explosion will turn  your world into a wasteland… unless you fight back.\nThe AI speeds up natural selection and genetic mutation, so that your world will evolve in a matter of days instead of millennia. Every move you make changes the outcome - you can add new organisms, tweak the environment and more through communication with the AI. The twist? Working with the AI can be a productive partnership or a brutal rivalry.\nYour application will be a part of a network that creates one global genetic database and a global ecosystem. AI is blank at the start, but as the network grows, it will\nimprove, building itself with algorithms, picked to fit your individual simulation, and overtime your game will become more than just an evolution simulator, as the\nbuilt-in neural net learns the laws of mutation and genetic recombination.\nSuccess in HOUND isn’t about earning “achievements” or beating levels. Success is controlling the program so that you create your perfect world by containing and stabilising a bursting stream of life.\nHOUND gives you the tools and the assistance of a powerful AI to create artificial life, design and manage virtual ecosystems and interact with neural networks of high organisation. It is not a game, in the strictest sense; rather, it is a powerful engine you can play that will give you a new world in a small-scale simulation to shape and conquer.\n*Our research team encourages all players to try to breed creatures that can communicate - talking is preferred - as that will help us with the scientific development of the project.","imageUrl":"https://media.rawg.io/media/screenshots/48c/48cca14fd2cc0c6eff1165f6c72cec11.jpg","releaseYear":2017,"developer":"Nick Shesterin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5708,"name":"Virtua Tennis 2009","genre":"Sports","price":0.0,"description":"With 23 of the world’s top players - 8 new to Virtua Tennis and 3 legends, including Federer, Nadal, Williams, Sharapova & Murray. Improved serve, net and stumble gameplay give more control than ever before.\r\n\r\nNew over-the-shoulder cam gets you to the heart of the action.\r\n\r\nSharpen up your skills with 12 Court Games such as Pot Shot and Pirate Wars.","imageUrl":"https://media.rawg.io/media/games/e4c/e4c47452174c58a473c90148df59a7a4.jpg","releaseYear":2009,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":4077,"name":"Darkstalkers Resurrection","genre":"Arcade","price":0.0,"description":"Darkstalkers Resurrection updates to two games for the price of one - Night Warriors: Darkstalkers Revenge and Darkstalkers 3. These feature classic gameplay and unique characters as well as a host of new features, including a variety of HD visual modes, online play with 8-player lobbies, YouTube replay sharing, improved challenge modes, dynamic awards, and unlockable extras. Embrace the dark!\n1-2 players\n3MB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-8\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©CAPCOM CO., LTD. 2012 ALL RIGHTS RESERVED.","imageUrl":"https://media.rawg.io/media/games/b96/b9611e2b4eb6c35e6f885c9f4b0b3b89.jpg","releaseYear":2013,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":1506,"name":"LocoCycle","genre":"Action","price":0.0,"description":"Newly self-aware, I.R.I.S. the martial-arts wielding assassin motorcycle, has begun a cross-continent escape to freedom.  I.R.I.S.’s only ally is her engineer Pablo, who gets conscripted into the quest after his pant leg gets caught in her chassis.  Hunted by the psychopathic motorcycle S.P.I.K.E. and a multinational weapons cartel, I.R.I.S. and Pablo face long odds, but they are riding for ‘Murica and freedom - so how can they lose?","imageUrl":"https://media.rawg.io/media/screenshots/e18/e18272dcd3abc358948a42fdf1bfe3c1.jpg","releaseYear":2013,"developer":"Twisted Pixel Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":783,"name":"Amnesia: Collection","genre":"Action","price":0.0,"description":"Amnesia: The Dark Descent puts you in the shoes of Daniel as he wakes up in a desolate castle, barely remembering anything about his past. Exploring its eerie pathways, you must piece together Daniel's troubled memories and uncover the horror that lies deep below.\r\nIn Amnesia: A Machine For Pigs, wealthy industrialist Oswald Mandus wakes in his bed wracked with fever and haunted by dreams of a dark and hellish engine. All he knows is that his children are in grave peril, and it's up to him to save them.Amnesia: Justine puts you through a series of trials constructed by a demented mind. Will you risk your own life to save others?\r\n1 player\r\n15GB minimum save size\r\nDUALSHOCK®4\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\r\nCopyright © 2016 Frictional Games","imageUrl":"https://media.rawg.io/media/screenshots/fbe/fbe626002a587215032f52e006ce5886.jpg","releaseYear":2016,"developer":"Frictional Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":802434,"name":"Resident Evil Village - Shadows of Rose","genre":"Action","price":0.0,"description":"16 years have passed since that incident...\nEthan's beloved daughter, Rosemary Winters, is living a healthy life.\nBut struggling to come to terms with her innate special powers,\nshe decides to dive into the world of the Megamycete's consciousness,\nor the \"realm of consciousness,\" to seal them.\n\nWhat she discovers is an extraordinary world far from the reality of the past.\nA collection of memories of \"that village\" absorbed by the Megamycete.","imageUrl":"https://media.rawg.io/media/games/406/40621b7debd188aa0759f362418b581d.jpg","releaseYear":2022,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":743677,"name":"Smashball","genre":"Action","price":0.0,"description":"Smashball is a SciFi Sports game with some minor RPG features.\nExplore a vibrant city, talk to people and build relationships with them ... if you are lucky, even more.\nRoam around the city, and optimize yourself in order to pursue the universal dream of getting drafted by one of the eight Smashball teams.\nIf you are good enough you will soon soar through the air, chasing opponents or dodging them in order to score goals and bring glory to your fanbase.\nLet's see if you and your team can make it to the biggest game and bring home the Galaxy Cup. The biggest trophy of them all.\nPlay Smashball and find out which team chooses you to represent their district!","imageUrl":"https://media.rawg.io/media/screenshots/555/5557bde6967173bf31093659c9636c82.jpg","releaseYear":2022,"developer":"Felix Albert","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":627623,"name":"Creepy Tale 2","genre":"Adventure","price":0.0,"description":"The lean years came. Mysterious evil puts the kingdom in the terror by kidnapping children and being cruel with the innocent forest habitants. Misfortune is everywhere and hunter’s house is no exception: a little Ellie falls into the hands of spooky guests. Lars is lucky to escape.\nMagical and very unfriendly world is waiting for you once you leave home. The main character gets involved in the spinning carousel of the events, where he stays til the end of the story.\nFight your fears, solve numerous of amazing puzzles and rescue your family during the eventful adventure.\nCreepy Tale 2 is a new look at the whole fairy world. It is a big compete solo story inspired by the first part of the game.","imageUrl":"https://media.rawg.io/media/screenshots/b2b/b2b4d9b1f2999313b3afd3aed16e762a.jpg","releaseYear":2021,"developer":"Creepy Brothers","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":544059,"name":"EQI","genre":"Adventure","price":0.0,"description":"is a trippy first-person arcade game with spatial puzzles, and a synthwave soul. You find yourself in a digital world that twists and changes around you, challenging your senses, focus, and reflexes. Interface with the great mystery and transcend.\nExplore and solve over 20 stages, increasing in size and difficulty\nControl your own movement and shift the world around you\nSolve puzzles, see through illusions, and master challenging obstacle courses\nImmerse yourself in the electronic pulse of the game's OST\nExperience. Question. Interface.","imageUrl":"https://media.rawg.io/media/screenshots/a66/a667d524f2a1b21b8901c9fff226c3d7.jpg","releaseYear":2021,"developer":"Chopin et al.","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":492175,"name":"DPS IDLE","genre":"Casual","price":0.0,"description":"An idle card game where you kill monsters. From monsters, you get money to open chests.  Each chest has its own deck of cards!\nFeaturesIdle card game: Many different cards and different decks. Cards can be improved in many ways.\nPowerful Guilds: not only cards decide everything - the right choice of Guilds can have a significant impact on the game. With each game, the guilds become stronger.\nHeroes: Hire the hero that best suits your style of play. Choosing the right hero in conjunction with the guild will move you forward.\nVersatile game: in addition to receiving cards and killing monsters, the game has a lot of secondary affairs. For example, magic, alchemy, quests, mining resources and much more.","imageUrl":"https://media.rawg.io/media/screenshots/e1b/e1b1ea55408746979d30f5af43f21d69.jpg","releaseYear":2020,"developer":"YDKR","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":484967,"name":"RIDE 4","genre":"Simulation","price":0.0,"description":"Are you ready to live the best gaming experience that a motorcycle fan can get?\nRIDE 4 will spark your competitive soul with hundreds of bikes, dozens of tracks and a whole new level of realism.NEW AND ENHANCED CONTENTSChoose among hundreds of officially licensed bikes and ride on dozens of tracks all around the world, carefully designed with an extraordinary level of detail! Every asset has been created starting from CAD data, laser and 3D scanning to achieve precision down to the smallest detail and let you enjoy the best two-wheel racing experience ever.CHOOSE YOUR PATHJump into an amazing and dynamic adventure that interacts with your decisions and choose your own path from the regional events up to the professional leagues. Show your riding skills through challenging races, ability tests, track days and a huge set of events. You could even become an official tester for the most celebrated manufacturers!DAY/NIGHT CYCLE, DYNAMIC WEATHER AND ENDURANCE RACESRIDE 4 features a fully dynamic weather conditions system and a complete day/night cycle.\nExperience the race in a new light and prove you are the best rider in any condition. And for the first time, the \"Endurance\" mode will put your tenacity to the test, with animated pit-stops and long lasting races: prepare to face a world where strategy is the ultimate ingredient of your success!NEURAL AILet us introduce you to A.N.N.A. (Artificial Neural Network Agent), our revolutionary neural AI system based on machine learning. Race against faster, smarter, more accurate riders and compete with an AI more human than ever!EXPANDED CUSTOMIZATIONRace with your own style! Choose among plenty of official brands for your rider’s outfit and customize your bikes aesthetically and mechanically. Unleash your creativity and design your helmet, suit and bike livery in total freedom thanks to our new graphics editor.\nOnce you’re done, share your creations online or just discover the best designs of the community!ONLINE COMPETITIONS Enjoy the most complete and lag-free online multiplayer experience ever thanks to our dedicated servers.","imageUrl":"https://media.rawg.io/media/games/798/7985b75a0f4b081e6d87f9982a5b49f6.jpg","releaseYear":2020,"developer":"Milestone","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":64683,"name":"Build Wars","genre":"Adventure","price":0.0,"description":"Are you ready for some serious building action? Build Wars brings popular concept of realtime online PvP building contests to standalone game. You and up to 14 opponents will build randomly selected object and after 8 minutes of struggle the winner will be decided by completely subjective voting among contenders.\nEight minutes of building time\nFace of against 9+ opponents in realtime PvP battle\nOne common topic/object to build chosen randomly from dozens of themes\n15 seconds to rate each of other players creations\nBest builders get reward to unlock new blocks in chests\nSo standard rules, eh? Our build wars is serious 3D building game with live multiplayer that even lets you unlock new block to improve your building capabilities. Improve your skills and your tools too and trample down your opponents - or just enjoy their masterpieces and learn from them as they defeat you. No block is wasted!\nFamiliar building blocks graphic\nOnline PvP building contest inspired by popular mod\nReview and rate creations of your opponents right after building phase\nBecome amazing builder\nCreative mode style building without crafting but with fly mode!\nMany building blocks to choose from - different materials, objects and even animals, mobs and other NPC\nChange day time, use lights and torches\nChange your floor blocks - pyramid looks better on sand but snowman thinks that snow is much more cool\nBrowse TOP10 monthly creations from all over the world","imageUrl":"https://media.rawg.io/media/screenshots/e26/e26f7b21fd8dadc5958d587540ea6705.jpg","releaseYear":2018,"developer":"Alda Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":63900,"name":"ZombieThon","genre":"Action","price":0.0,"description":"ZombieThon is an arcade shoot ‘em up, with the goal of each mission being to survive as long as possible and to use any means to do so. Upgrades could come in the form of bouncing bullets, split shot, or even a few special upgrades that are nothing short of a natural disaster.\n\nSingle-player mode, for those that like a challenge.\n2 to 4 PLAYERS in Scaling Online Multiplayer.\nLots of different upgrades and combos for your weapons.\nSpecial bullet abilities.\nUnlockable characters in each level.\nUnique character abilities.\n3 maps with more on the way.\nInfinitely scaling waves.","imageUrl":"https://media.rawg.io/media/screenshots/765/765266972e10b84511a7a8a42732f26a.jpg","releaseYear":2018,"developer":"GreenThumbStudios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":54102,"name":"Tiny Toon Adventures","genre":"Platformer","price":0.0,"description":"Tiny Toon Adventures is a platform video game for the NES. It was published and developed by Konami and released in 1991. It is the first Tiny Toon Adventures-related video game to be released for any video game console device.","imageUrl":"https://media.rawg.io/media/games/adf/adfa62dabb68ff6881fe6a0c70b3e65a.jpg","releaseYear":1991,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"NES"}]},{"id":52177,"name":"Alto's Odyssey","genre":"Action","price":0.0,"description":"Just beyond the horizon sits a majestic desert, vast and unexplored. \r\n\r\nJoin Alto and his friends and set off on an endless sandboarding journey to discover its secrets.\r\n\r\nSoar above windswept dunes, traverse thrilling canyons, and explore long-hidden temples in a fantastical place far from home.\r\n\r\nAlong the way, you’ll grind across vines, bounce atop hot air balloons, ride towering rock walls, and escape mischievous lemurs – all while uncovering the desert’s many mysteries. \r\n\r\nFeatures:\r\n\r\n• A standalone experience. Alto’s Odyssey is the follow-up to the critically acclaimed Alto’s Adventure, but you don’t need to have played one to enjoy the other.\r\n\r\n• Easy to learn, difficult to master. At the heart of the Alto series is an elegant one-touch trick system. Chain together combos, and complete 180 goals — all with intuitive controls.\r\n\r\n• Explore Biomes. From the dunes, to the canyons, to the temples, explore a rich and diverse landscape, with each area boasting unique visuals and gameplay. \r\n\r\n• Newfound heights. Discover secrets in the sky with hot-air balloons, moving grind rails, and wall riding.\r\n\r\n• Master the elements. In addition to dynamic lighting and weather effects like sandstorms and shooting stars, the desert is home to swirling wind vortexes and rushing water.\r\n\r\n• Meet Alto and friends. Unlock six unique characters, each with their own attributes and abilities.\r\n\r\n• Zen Mode. Complete with its own serene soundtrack, this relaxing mode distills Odyssey down to its purest elements: no scores, no coins, and no power-ups. Just you and the endless desert. \r\n\r\n• Photo Mode. From the pause screen, get behind the lens and take stunning photos of your trip through the desert. Pinch, swipe, pan and zoom to frame the ideal shot, and share them with friends and family.\r\n\r\n• Original music and handcrafted audio. Headphones recommended!\r\n\r\n• Universal app with iCloud support. Play on your iPhone, iPad, and Apple TV, and your progress will always be in sync.","imageUrl":"https://media.rawg.io/media/games/ff6/ff64f7b2a47d8b90987b5ceb530958e0.jpg","releaseYear":2018,"developer":"Noodlecake Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":51586,"name":"Floresia I: Intemporel","genre":"Action","price":0.0,"description":"After losing his wife, Neyn sees appearing in a dream\nthe spirit of Nayah asking him to resurrect her by realizing the mysterious quest of Floresia.\nFeatures :\n- Drama-type story & sad game.\n- An Action/Platform/RPG mix with hit and run action fights.\n- Between 1 hour and 3 hours to finish the game.\n- An original platform system.","imageUrl":"https://media.rawg.io/media/screenshots/467/4678f40199bd7c0fd95af83cbf3a8331.jpg","releaseYear":2018,"developer":"Sofian Boudouft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":49600,"name":"The Free Ones","genre":"Adventure","price":0.0,"description":"The Free Ones is a first person platformer game set on a mystery island.\nYour name is Theo. After being kidnaped as a child, you are forced to work in a mine for the rest of your life. Until one day when you find a secret passage that will change your life.Key featuresFeel the speed of wind with your grapple and dominate your fear of vertigo\nDive in a story rich experience with deep and captivating characters\nDiscover an intriguing world full of beautiful landscapes\nFind the truth behind the secrets you will find","imageUrl":"https://media.rawg.io/media/screenshots/38c/38c37f78586c2f15568d0c45e3a6f628.jpg","releaseYear":2018,"developer":"Farsky Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":46512,"name":"SWARMRIDER OMEGA","genre":"Action","price":0.0,"description":"SWARMRIDER OMEGA is an \"endless runner\"+\"twin stick shooter\" ARCADE mashup.\nBased on SWARMRIDERS(2016), OMEGA is a darker and faster version, featuring the Saint from UBERMOSH Vol.5.\nA low-tunned and remastered version of the classic soundtrack meets new powers, achievements, class mods and a denser Swarm.\nThe gameplay is shaped by over a year of feedback, making a short but intense arcade experience.","imageUrl":"https://media.rawg.io/media/screenshots/505/505b68d637013e9d434fb90b00f18610.jpg","releaseYear":2017,"developer":"Walter Machado","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":43811,"name":"Castle of no Escape","genre":"Action","price":0.0,"description":"THE GAME\nExplore the mysterious castle full of monsters and secrets in a quest to collect all the treasures (that will also protect you from the curses on your way) and crush the main boss. The game won't let you exit the castle, no matter how you try. Technically you can win, but there is no end.\nCONTROLS\nPress Enter to start the game\nPress 1, 2 or 3 to select a hero\nStrength, Intelligence and Dexterity at the hero selection screen are the maximal values which that hero can get. Strength is both for life and attack power, intelligence is both for mana and spell power. Dexterity affects your attack and defence accuracy.\nYou lose the game when either of those parameters gets below zero!\nON THE MAP\nArrow keys to walk around\nZ or Enter to perform action (attack, open chest, read book, buy potions, use the stairs, gaze into an orb, drink from a pool)\nX or Space to cast spells in battle or to light a flare otherwise\n1, 2 or 3 to select a potion to buy or a spell to use\nPress M to turn background music on/off\nARTEFACTS AND CURSES\nOpal VS Blindness - you forget the map and don't see any new rooms, flares become useless\nPearl VS Forgetfulness - you don't remember where have you been before\nRuby VS Lethargy - monsters get the first turn to attack\nDiamond VS Weakness - you lose 1 strength point every 20 turns\nEmerald VS Bad luck - your minimal attack power drop to 1 instead of 50% of strength value\nBlue Fire VS Bookstuck - book sticks to your hands and you can't attack anyone in this state\nSign VS everything except Bookstuck\nSPELLS\nWeb prevents the monster from attacking and lasts 0-3 turns. Costs 1 point of intelligence.\nFireball is obvious enough. Costs 2 points of intelligence.\nIQ instantly kills your opponent if it's intelligence is less than yours. Otherwise, you lose. This spell doesn't spend anything.\nPROGRAMS USED\nGame Maker 8.1 Standard\nsfxr/bfxr\nFamiTracker\nFruityLoops\nNotepad (obviously, for Readme.txt)\nMS Paint\nCREDITS\nXitilon.HD408 - game design/adaptation, programming, sound generation\nEsdeer aka BSOD - graphics, music, sound design, testing\nInspired by Leygref's Castle etc.","imageUrl":"https://media.rawg.io/media/screenshots/449/449cd4815a20467a43247c743a9d0f05.jpg","releaseYear":2017,"developer":"Xitilon","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":41661,"name":"CYPHER","genre":"Indie","price":0.0,"description":"Cypher is a first person puzzle game about cryptography.<br/>\n<br/>\r\nExplore the museum and learn about the history of cryptography, from<br/>\r\nsimple substitution ciphers to the Enigma machine and beyond.<br/>\n<br/>\r\nGrab a pen and paper and test your deciphering skills across 40+ challenging puzzles.","imageUrl":"https://media.rawg.io/media/screenshots/fc4/fc4e1f4af7d35ff88f0cd35d84ab4d73.jpg","releaseYear":2012,"developer":"Matthew Brown","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":25046,"name":"Eragon","genre":"Action","price":0.0,"description":"Embark on an epic adventure with your mighty dragon Saphira to rescue\nAlagaesia from the dark forces of an evil king. Fulfill your destiny as\nyou take up the heroic legacy of the legendary Dragon Riders.\n\nFeatures\n\n• Action/combat RPG\n• Touch screen spell casting and unique\ndual screen attack mode\n• Extensive weapon, spell and combo attack\nupgrade system\n• Sharpen your magic and dragon riding skills in two\nunlockable mini-games","imageUrl":"https://media.rawg.io/media/games/fa3/fa3500414f39d73ad1cf29a0607a49ec.jpg","releaseYear":2006,"developer":"Amaze Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":22847,"name":"Zeus + Poseidon (Acropolis)","genre":"Strategy","price":0.0,"description":"Start with a plot of land by the shores of the wine-dark Aegean and create a thriving city-state of your own design. Build roads and monuments, set taxes, control trade, and command armies on land and sea.Construct massive sanctuaries, a stadium for the Games, even an Atlantean pyramid.Build armies and fleets to battle neighbors on land and sea. Succeed, and make them your vassals. Fail, and you'll be forced to play tribute until you win back your freedom. Rule the legendary world of Atlantis. Mine orichalc, and make use of unique buildings like bibliotheques and observatories.\nAcropolis’ delivers the city-building excitement and strategy of both Zeus’ Master of Olympus’ and Zeus’ Official Expansion Poseidon’. Build great empires, dabble in combat, trade, and politics, and keep monsters like Medusa at bay with the help of great heroes from mythology. Establish new colonies in the ancient Americas, Africa, Europe, and Asia. Create your own adventures with a powerful yet easy to use Adventure Editor.\nYou’ll create bustling cities filled with thousands of citizens in mythological Greece and the lost continent of Atlantis. Exercise your might by threatening neighboring cities with invasion, or cultivate them as allies against even stronger opponents. Build beautiful Greek sanctuaries and Atlantean pyramids piece by piece. Summon heroes to rid your town of plagues and monsters, or appease gods and goddesses to protect you from evil.\nAcropolis’ delivers hundreds of hours of gameplay in one game! One of the best city builder games out there, made by a team of experts in the genre: Impressions Games.\nDiplomacy, war, economy, and logistics - you must master all these arts to ensure your victory.\n65 episodes in which you build and rule seven city-states and two powerful civilizations: Ancient Greece and Atlantis.","imageUrl":"https://media.rawg.io/media/screenshots/e08/e0817988d689bc082c9c749f63a77946.jpg","releaseYear":2000,"developer":"Impressions Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22107,"name":"Griptape Backbone","genre":"Indie","price":0.0,"description":"You play as a skater on the brink of life and death collecting aesthetics to reach enlightenment in skate-purgatory whilst trying to expiate your sins, help lost souls, find meaning in life and closure in death. A vaporwave experience.SKATE EVERYTHINGYou can literally skate whatever surface you want, kind of like that one city scene in INCEPTION. The game's control scheme is simple and accessible for everyone while also offering the depth to those who want to line up and flick dank tricks whilst controlling their board midair.SOUNDTRACKA game where you can just skate without even worrying about the objectives and listen to the amazing lineup of songs with the in-game player driven radio from over 25 artists while taking in the open world skate map full of intentional and unintentional great skate spots to discover.\n(for more info, links, etc. visit the community hub pinned discussion board)\nIncluding music from...\nBlank Banshee\nBrian Haeger\nCanaan Long (Prehistoric Turtlesaurus)\nCarsyn Ainsworth & Dylan Roberts\nConsciousThoughts\nDelone\nDisconscious\nDong Lee\nDonky Pitch\nDutchy!\nHome\nLimes\nMingo Gomez\nPablo Garduño\nQuickly, quickly\nRHO DELTA\nSelectron\nSonder\nSteven Harmon\nSuburban Pets\nToetensen\nTomppabeats\nUser-999\nVektroid\nVincent Remember\nWarren Heart\nYUNG BAE\n骨架的FAQQ: What is VAPORWAVE?\nA: Long Answer - Vaporwave is an electronic music subgenre that originated during the early 2010's on the internet. It is characterized by a nostalgic & surrealist fascination with retro design, consumer capitalism, existentialism, and popular culture. Art that embraces low poly, VHS, cassette tapes, Japanese neo tokyo, cyberpunk tropes. Short answer - Slowed down sampling of lounge music, smooth jazz, 80s music, elevator music, and a certain je ne sais quoi. Shorter answer - A lifestyle.\nQ: How should I play the game?\nA: Just skate, relax, and contemplate your existence.\nQ: Will this game fill the immeasurable empty void that is life?\nA: /music plays","imageUrl":"https://media.rawg.io/media/screenshots/8d2/8d2949c35400873371e3d902583d98c9.jpg","releaseYear":2017,"developer":"StevenHarmonGames","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21593,"name":"Grail to the Thief","genre":"Adventure","price":0.0,"description":"Grail to the Thief is an interactive audio adventure for Windows, Mac and Linux that can be played using only sound, without the need for visuals. The game has been designed with the needs of the blind and visually impaired in mind but can be enjoyed by everyone. Our goal is to deliver an exciting, immersive experience in which the player will always be fully aware of what is happening through the use of voice-overs, sound effects, ambient sound and music.\nThe game stars Hank Krang, a dirty thief from the near future who recently had a self-aware time machine called the Time Excursion Digital Interface, or TEDI, fall into his lap after a poker game. He has decided to use this technology to go throughout time, stealing priceless artifacts. On his first adventure, Grail to the Thief, Hank travels to Arthurian times in search of the Holy Grail.","imageUrl":"https://media.rawg.io/media/screenshots/136/136a344a8e619e773145ec67d86978a0.jpg","releaseYear":2015,"developer":"For All To Play","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20622,"name":"Lightrise","genre":"Action","price":0.0,"description":"Lightrise is a skill-based, player vs. player combat game which at the core is focused on fun, fluent and fast-paced combat. Lightrise gives players a combat experience not quite like anything else available out there.\nLightrise has much more depth than a traditional one-shot, one-kill FPS, but at the same time does not have any of the familiar restraints such as classes, roles and load outs that are typically found in games of the genre today. Right from the start, each player has access to an identical arsenal of spells and skills - the playing field is as even as it could be - no strongest classes, no flavor of the month builds, no over-powered load out configurations.\nEvery player can shoot a bow, cast a fireball or swing an axe seamlessly without any artificial restrictions. Every win and loss will be determined solely by how well you play in that moment.","imageUrl":"https://media.rawg.io/media/screenshots/962/96230381968cbcee863b88e41abe449c.jpg","releaseYear":2015,"developer":"Bulkhead Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19956,"name":"Plastic Playground","genre":"Action","price":0.0,"description":"Plastic PlayGround is a fast paced, team based, LAN multiplayer first-person shooter. In PPG you play as everyones favorite toy only this time you get to run, jump, jetpack, grapple, and fly.  The goal is to capture as many control points as you can while eliminating and evading hostile toys from the enemy team.\nNote from the developer:\nThis project was taken from concept to completion over the course of five months as part of Full Sail’s Game Development program. What started as a final project turned into a passion project and so much more. We hope you enjoy playing it as much as we have making it.  We hope to hear your feedback and will try to answer everyone back.   -Ryan","imageUrl":"https://media.rawg.io/media/screenshots/9ef/9ef9adadecadf288b6766a8f5072de22.jpg","releaseYear":2016,"developer":"Tomorrow Arts","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]