[{"id":19454,"name":"Drakensang","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb6/cb615b74eb7a2b932986509dd5d7141f.jpg","description":"Drakensang is a third-person party-based RPG based on the pen & paper role-play rules of The Dark Eye. Drakensang is the first PC game for over 10 years to be based on Germany's most successful and popular role-play system.\nDrakensang builds on the pen & paper rules as applied in version 4.0. The developers have optimized the rulebook specially for the PC realization in order to make the game more accessible. But the essential qualities and the depth of the original rules have not been compromised.\nIntensive tactical combat and intriguing quests, embedded in a wonderfully detailed 3D graphic presentation  these are the cornerstones of the fantasy epic.\nExperience an exciting story within a huge campaign involving numerous main and side quests\nAdventure groups with up to four adventurers\nExpert character-creation mode for experienced DSA fans\nMore than 40 spells, with over 30 talents and almost 40 special abilities allow a large range of possibilities for character creation\nNumerous and varied enemies and monsters from the DSA universe, such as linnorms, ogres, undead mules, giant amoeba and many more\nStory by original DSA authors\nRule-compliant implementation of the DSA licence in the tradition of the Nordland Trilogy\nTactical combat system with pause function\nVaried and flexible magic system\nTalent-based dialogue system","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Radon Labs","platforms":[{"id":0,"name":"PC"}]},{"id":596,"name":"AirMech Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d8/4d801899548b3ba7dbeb9a428fa58c62.jpg","description":"AirMech® Arena is a highly competitive fast-paced real-time strategy game, where players team up AirMechs to amass unrelenting combat forces and destroy the enemy team’s fortress.  In the future, the last survivors of the Great War continue their fight with the ultimate war machine: the AirMech®. Created using lost technology, Pilots have found, salvaged, or stolen AirMechs that they use to protect the weak, or to pillage. Which side do you fight for?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":58807,"name":"Neo cab","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e4c/e4cd2f4caa2b19de240476a741e2dcf8.jpg","description":"Neo Cab is an emotional survival game about gig labor, tech disruption and the experience of being a driver-for-hire. You play as Lina Romero — a daring, empathetic young woman hustling to survive as one of the last human cab drivers in an autonomous world.\nNavigate the neon-drenched streets of Los Ojos from the Neo Cab map. Choose your passengers— and your words— wisely. You'll need to balance your cash, star rating and emotional health to survive in this town.\nFeatures:\nAn overarching noir mystery to uncover, peppered with random encounters and nuanced characters\nInteractive stories written by Leigh Alexander, Kim Bellair, Bruno Dias, Duncan Fyfe, Paula Rogers & Robin Sloan\nA persistent, nuanced emotion system drives every conversation and shapes the overall story\nA deeply branching storyline where choice is everything.\nOriginal soundtrack by Obfusc (Monument Valley, House of Cards)\nFor our latest updates, we're @neocabgame on Twitter, Instagram and Facebook.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Chance Agency","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":44064,"name":"Loading Screen Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/53402def5a5a07ffad618a8594f79f7e.jpg","description":"You've already been inundated with every type of simulator possible. Well, at least you thought that was the case. Like most everyone else, we think the simulator genre has gone too far (We're looking at you, KFC Dating Sim....).  However, instead of rallying against the deluge of downright weird simulators, we've decided to add to the growing abyss of them. Loading Screen Simulator started out as a joke between family members about the madness of the current simulator genre. Now it's progressed to a functional alpha build with goals to have a full game released by the end of the year. Keep checking back, as it's going to keep getting better? How, you ask? More loading screens, of course! Yes, there will be easter eggs for those of you that get through the first few loading screens. Will there be jump scares? Maybe. You'll have to progress through the loading screens to find out. Will there be some cool trivia hidden somewhere in the midst of all the loading screen madness? Possibly, if we can figure out how to code that. What's our end goal? World domination through a large amount of non-functional loading screens, of course! (We may be joking here, or there may be a Chinese spy balloon in there somewhere...If you're the CIA or any government agency reading this, we're just kidding! There's no spyware here). We just hope that our end product is as absurd as it sounds!\nFeatures:\no Loading Screen images rotate randomly\no Hundreds of loading screen images at launch, with more being added every day\no Interactive loading screens (maze challenges, puzzles, and more!) that can be turned on or off\no Real-life and fantasy scenery!\no Can be used as a safety screen in many situations.\no Music that can be turned on or off throughout the screens","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"CakeEaterGames","platforms":[{"id":0,"name":"PC"}]},{"id":32122,"name":"Tomb Raider 3: Adventures of Lara Croft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90f/90f5d80bdce9df33d0be76f94c538faa.jpg","description":"Tomb Raider 3: Adventures of Lara Croft is a third-person action-adventure title developed by Core Design. It is the third installment in the Tomb Raider series.\n\n###Plot\nDuring a raid on ancient tombs, Lara finds a strange artifact and meets a scientist named Mark Willard. This artifact is a part of a Polynesian cult. Willard finds a sanctuary, but four other artifacts are lost. Lara sets out to find them.\n\n###Gameplay\nThe players travel through five locations. The game is somewhat not linear as after completing the first location (India), the players are free to choose one out of three environments and finish with Antarctica. Each location resembles a semi-open world with several puzzles, enemies, and platforming elements scattered across it.\n\nThe puzzles in the game require moving items, jumping over obstacles, crawling or diving underwater. \n\nThe game features a wide variety of weapons, including the iconic dual pistols which have unlimited ammo and serve as Lara's default weapons. At some time into the game, Lara loses all her weapons and has to find her way through the enemies before finding her pistols again. \n\nHuge improvements were made to the game's graphics and physics in order to improve the puzzles. For example, the doors now can be triangular. The improved physics allows for modifying the environment adding quicksands, swamps or cold water (Lara can't stay in it for too long, or she will get frozen to death).","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":30744,"name":"Escape from Monkey Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e1/7e1a5fb1860ef52fdabd5a303de1b837.jpg","description":"Spitting the sand of Monkey Island from my mouth, I wondered if the life of a mighty pirate was all it was cracked up to be. I'd ignored recent events that should have been warning shots across the bow of my soul, from my wife's brush with death to the anti-pirate ramblings of an Australian gazillionaire. If only I'd chosen a different path, LeChuck might still be dead and the Ultimate Insult might have remained a mystery. If I'd never picked up a sword, the grog-swilling pirates of the Tri-Island Area might be unthreatened by the forces of gentrification and demonic heckfire. If only... suddenly, the hairy finger of a familiar monkey tapped me on the shoulder. It was time. Time for the biggest battle of my swashbuckling life.\n- Excerpted from \"The Memoirs of Guybrush Threepwood: The Monkey Island Years\"\nFourth in the legendary Monkey Island series of graphic adventures!\n• An original, cinematic story full of drama, sociopathic parrots, and a villain with a sinister agenda!\n• Dozens of lusciously rendered backgrounds!\nHundreds of puzzles to challenge both novice and veteran pirates... er, adventurers!\n• New jokes! New puns! New insults! And more monkeys than the three previous Monkey games combined!","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19810,"name":"Cosmic Dust & Rust","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/840/840e6adc716c65db8ae9c448c0404782.jpg","description":"Cosmic Dust & Rust is a tower defence game set in space with 2 stages of game play: The first stage is 'Ship management', where the player must upgrade the internal parts of his or her ship. You can build and upgrade turrets and defence systems. You can also undergo side missions.\nThe second stage is the 'Action sequence', where the player takes manual control of the ship and it's main cannon and super weapon defence systems.\nFeatures:\n- Upgrade your ships defence systems.\n- Complete secondary missions for bonus aluminium and gold.\n- Do battle with a variety of enemy types with destructible parts.\n- Build and fire Super weapons. Take the fight to the enemy!\n- Dark star fapfap button","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"16bit Nights","platforms":[{"id":0,"name":"PC"}]},{"id":16166,"name":"Battle Ranch: Pigs vs Plants","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/610/610664e650da6381d6a95c23c827a348.jpg","description":"Defend your ranch from a horde of evil boars hellbent on stealing your livestock and eating your family.\nAll that stands between you and the horrific vision of ravenous beasts devouring your loved ones is your many acres of loyal mutant plants.  With each boar these bloodthirsty botanical abominations dispatch, you'll earn money to buy more seeds.  Leave your misgivings about GMO crops by the roadside, as you can't afford not to buy the most scientifically twisted weaponized legumes that the Monsanta corporation has to offer.\nOther Features:\n1.\tCombines ranch management and defensive strategy.\n2.\t10 exciting and challenging game modes.\n3.\tAddictive and challenging games.\n4.\tMore than 216 levels.\n6.\tMake use of the shop and trophy Room","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Playboom","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4294,"name":"Retro/Grade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe3/fe315f406182f84841ebc8c5c4119553.jpg","description":"Play a classic Shoot 'Em Up... in reverse! Navigate deadly enemy waves and un-fire attacks in Retro/Grade, a mind-bending rhythm game by 24 Caret Games. Pick up a gamepad or a guitar controller and help Rick Rocket restore the continuity of space-time, before a temporal anomaly rips the universe a new time-hole!Key Features\nPlay with a gamepad, keyboard, or a guitar controller, and control the flow of time with the Retro/Rocket to undo your mistakes.\n10 dazzling worlds with unique enemies, epic boss fights, and amazing effects.\nA campaign with 6 difficulties, 130 different challenges, over 50 minutes of original music, and dozens of unlockable ships and rewards.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"24 Caret Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":600924,"name":"Lost Judgment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/186/1864ee956f171b4c3d5791b82c15df2f.jpg","description":"December 2021, Tokyo district court. Akihiro Ehara stands accused of groping a woman on a crowded train. A bystander’s video footage of his attempt to flee the scene and subsequent apprehension is all over the news, and public outcry demands a maximum sentence.\n\n“Three days ago, a dead body was found in an abandoned building in Yokohama. Have you identified it yet?” he proclaims as confusion cuts through the court room.\n\nHis defense lawyer, Saori Shirosaki, has no doubt that crucial details of the situation have been overlooked, as Ehara was not even tried for the murder. She contacts detective Takayuki Yagami to investigate this further.\n\nHow could Ehara have committed two crimes at once? Was the sexual battery just a cover up? Has Ehara gamed the entire justice system? As victims surface and Yagami digs farther into the truth, he is faced with a question: Defend the law, or enact justice?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":16011,"name":"Masked Shooters 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70b/70b5bcd13c43d926fce75de852796941.jpg","description":"Suit up, boys! The battleground is open and danger has never been more real. Enemies lurk at every turn, their trigger fingers just itching for the opportunity to take you out. Once the mask drops, be ready to pull the trigger.\nMasked Shooters 2 puts you on the front line of a dangerous gunfight that can only end in victory or defeat; there will be no white flags to wave. As a covert ops soldier, you have access to advanced weapons that will blow your enemies away, if you know how to use them. From a pistol and sniper rifle to a grenade launcher and RPG, your arsenal is packed for a maximum kill rate, but it won’t be easy. Enemies have their own weaponry and your ammo is limited, so make every bullet count.\nFrom detailed graphics to life-like sound, this first person shooter game has everything you need if you enjoy adrenaline pumping, fast-paced gameplay. Choose to join a team or show off your sniping skills in free for all mode, where it’s you against the world. You can play offline against pitiless AI soldiers or join a room online to play against others in real time for a true test of your skill. There’s only one answer in Masked Shooters: it’s time to lock and load.\n~~~~~ Features ~~~~~\n• Action packed gameplay\n• Realistic shooting mechanics\n• Multiple weapons: Sniper, pistol, knife, grenade launcher, RPG, machine gun, ak47, grenades\n• Play offline or online\n• Brutal AI enemies for challenging offline play","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FreezeNova","platforms":[{"id":0,"name":"PC"}]},{"id":514892,"name":"Möbius Front '83","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba6/ba6bf9c80671d261133b47a0170a3587.jpg","description":"The year is 1983 and the United States of America must defend itself from an enemy it could have never imagined— an America from an alternate universe that will stop at nothing to seize control of the country’s heartland!\n\nIn Möbius Front ‘83 you will fight tactical, turn-based battles with the cutting-edge military hardware of the early 1980s. Use every tool available -- powerful tanks, fast-moving attack helicopters, long-ranged artillery, tenacious infantry, and more -- to control the complex and rapidly-changing battlefield of the era.\n\nWho are the “Americans” attacking America, and why? Find out in the game’s extensive single-player campaign and its fully voiced cutscenes. When you’re ready for some R&R, play a new kind of solitaire, solve Zachtronics-style puzzles, and even read the U.S. military manuals that inspired the game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Zachtronics","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":30525,"name":"Star Wars: Rebellion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6bf/6bf0a770665068bf497a4c808a473730.jpg","description":"It is a time of great upheaval. The first Death Star has been destroyed, marking a major victory for the Rebellion. But the Empire remains strong. As commander, you must choose to take control of either the Rebel Alliance or the Galactic Empire. Your goal: complete domination of the galaxy.\r\nTake the galaxy by force. Take the galaxy through diplomacy. Take the galaxy via covert operations. Earn the loyalty (or resentment) of up to 200 worlds. Star Wars™ Rebellion gives you a myraid of means to implement strategy and tactics on a grand scale and in a real-time environment. With control of the entire Star Wars galaxy as the prize, will the Force™ be with you? Discover for yourself.\r\nStrategy Gaming on an Epic Scale - Take control of either the Rebel Alliance or the Galactic Empire as you vie for the support of up to 200 worlds. The real-time environment will test your strategic mettle at every turn.\r\nComprehensive Resource Management - Strategic portion lets you manage manufacturing, resources, fleet deployment and mission assignments.\r\nInnovative 3D Battle Simulation - Take complete command of fleets in dramatic battle sequences – almost a separate game in itself.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Lucasfilm","platforms":[{"id":0,"name":"PC"}]},{"id":20128,"name":"Epic Battle Fantasy 4","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e81/e819dd22945e19017af5067245991fb2.jpg","description":"Epic Battle Fantasy 4 is a light-hearted turn-based RPG, heavily inspired by old classics like Final Fantasy and Golden Sun. You will battle through waves of adorable enemies, grow your characters, explore a diverse world, solve puzzles, and of course, save the world.Key features Over 140 different enemies to slaughter, from fluffy animals to gods.\nOver 170 different items of equipment, and 150 different usable skills, allowing for lots of character customization.\nInspired by 16-bit era RPGs, minus the annoying features like random battles or save points.\nContains lots of video game references, immature humor, and anime boobs.\nA mix of orchestral and electronic background music by HalcyonicFalconX. Full Soundtrack included!\n25 hours of gameplay, plus Newgame+, survival and boss rush modes.\nSuitable for both casual and hardcore RPG players.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Matt Roszak","platforms":[{"id":0,"name":"PC"}]},{"id":19639,"name":"Toy Soldiers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fae/faed4a36cdf2169b9381865fbd885ec9.jpg","description":"The Xbox LIVE® Arcade smash hit Toy Soldiers comes to PC!\nToy Soldiers is an action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the trench-filled battlefields of Europe. Deploy an exciting arsenal such as tanks, cavalry, biplanes, and flamethrowers in vintage WWI toy dioramas. Developed by Signal Studios, Toy Soldiers allows you to take control of individual units or control the entire battlefield from a strategic view. Integrating multiple game genres and world-class visuals, Toy Soldiers is a unique and action-packed entertainment experience!\nCommand your Toy Soldiers in epic, action-packed battles. Position your defenses and take direct control of your artillery to bomb the enemy positions, pilot your bi-plane against the enemy trench, or maneuver your tanks across No-Man’s Land and lead your Toy Soldiers to victory!\nAll DLC from the Xbox LIVE® Arcade hit is included!The Kaiser's Battle DLC\nEnjoy all new French inspired content with THE KAISER'S BATTLE! Take on the new experimental boss, The K-Wagen!Invasion DLC\nThe British are bringing brand new secret weapons of tiny toy mayhem in Invasion!, the second add-on to Toy Soldiers from Signal Studios! Put on your Kaiser’s helmet and command the German Army against a mad menagerie of new antagonistic toys, including flying saucers, chivalrous knights, and the “Rolls Royce of the Sky,” the WWII Mustang. Defend Germany in a new Mini-campaign topped by the most calculating, head-strong boss of all (batteries not included)! Raise your saber, soldier, and lead the charge against… is that a spaceman? The Invasion has begun!Content ActivationTo activate Toy Soldiers after your purchase, launch Toy Soldiers and select 'Redeem Code' from the main menu. Then follow the instructions to redeem your content.\nAlternatively, you can redeem Product Codes for the downloadable content at https://live.xbox.com/RedeemToken.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Signal Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":960912,"name":"Mass Effect 2 (2010) Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b0/7b0f21d4a8558674f1d05c4ed750f5ab.jpg","description":"Special Editionhttps://store.steampowered.com/app/1328670\nAbout the GameAre you prepared to lose everything to save the galaxy? You'll need to be, Commander Shepard. It's time to bring together your greatest allies and recruit the galaxy's fighting elite to continue the resistance against the invading Reapers. So steel yourself, because this is an astronomical mission where sacrifices must be made. You'll face tougher choices and new, deadlier enemies. Arm yourself and prepare for an unforgettable intergalactic adventure.\nGame features:\nShift the fight in your favor. Equip yourself with powerful, new weapons almost instantly thanks to a new inventory system. Plus, an improved health regeneration system means you’ll spend less time hunting for restorative items.\nMake every decision matter. Divisive crew members are just the tip of the iceberg, Commander, because you’ll also be tasked with issues of intergalactic diplomacy. And time’s a wastin’, so don’t be afraid to use new prompt-based actions that let you interrupt conversations, even if they could alter the fate of your crew...and the galaxy.\nForge new alliances, carefully. You’ll fight alongside some of your most trustworthy crew members, but you’ll also get the opportunity to recruit new talent. Just choose your new partners with care because the fate of the galaxy rests on your shoulders, Commander.\nMass Effect 2 (2010 Edition) includes all previously released DLC:\nExpansions\nKasumi — Stolen Memory\nOverlord\nLair of the Shadow Broker\nArrivalCerberus Network content\nNormandy Crash Site expansion\nZaeed — The Price of Revenge expansion\nFirewalker Pack\nCerberus Weapon and Armor pack: Contains Cerberus Assault Armor and M-22 Eviscerator shotgun.\nArc Projector heavy weaponPacks and Bundles\nAegis Pack: Contains the M-29 Incisor sniper rifle and the Kestrel armor.\nEqualizer Pack: Contains the Capacitor Helmet, Archon Visor and Inferno Armor.\nFirepower Pack: Contains the M-5 Phalanx heavy pistol, M-96 Mattock heavy rifle and Geth Plasma Shotgun.\nAlternate Appearance Pack 1: Contains new outfits for Garrus, Thane and Jack.\nAlternate Appearance Pack 2: Contains new outfits for Tali, Grunt and Miranda.\nCollectors’ Weapon and Armor pack: Contains Collector Armor and the Collector Assault Rifle.\nTerminus Weapon and Armor pack: Contains Terminus Assault Armor and the M-490 Blackstorm heavy weapon.\nMass Effect 2 promo bundle: Contains Umbra Visor, Sentry Interface and Recon Hood.\nBlood Dragon Armor","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"BioWare","platforms":[{"id":0,"name":"PC"}]},{"id":404481,"name":"Red Dead Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/769/769b7f0f609f44bac86f2c791fee21dd.jpg","description":"Step into the vibrant, ever-evolving world of Red Dead Online and experience life across frontier America.\r\n\r\nForge your own path as you battle lawmen, outlaw gangs and ferocious wild animals to build a life on the American frontier. Build a camp, ride solo or form a posse and explore everything from the snowy mountains in the North to the swamps of the South, from remote outposts to busy farms and bustling towns. Chase down bounties, hunt, fish and trade, search for exotic treasures, run your own underground Moonshine distillery, or become a Naturalist to learn the secrets of the animal kingdom and much more in a world of astounding depth and detail.\r\n\r\nJoin millions of fellow players in the American West, and experience a world now packed with years’ worth of new features, gameplay and additional enhancements.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rockstar Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":41083,"name":"War of the Roses","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78f/78f4aabf13343c7c2eac4ae820fb8925.jpg","description":"War of the Roses is a multiplayer medieval-themed hack and slash game. It follows the events of the Wars of the Roses that took place in England during the 15th century. However, the game doesn’t provide any plot, focusing on battles.\n\nThe key feature of the title’s gameplay is its realism. The game combines realistic melee combat mechanics with the development system. To be efficient in fights you need to perform certain moves: attacks, dodges and counter-attacks. For killing enemies you will get money and experience points to upgrade your character’s skills and weapons. If you’re killed during the battle, you can choose the place is respawn yourself.\n\nWar of the Roses features numerous maps and several game modes including a deathmatch, a pitched battle where you have the only life, and the assault mode to capture the opponent’s checkpoints.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"}]},{"id":3087,"name":"Ultimate General: Gettysburg","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c2/8c2c39227ec96df0768f3220ba2992f9.jpeg","description":"Ultimate General: Gettysburg is a Tactical Battle Simulator that allows you to lead thousands of soldiers in the famous Battle of Gettysburg as commander of either the Union or Confederate army. The game features the most accurately created map, complex morale, innovative control mechanics and smart AI. You have the freedom to use different strategies while the battle progresses. Your decisions and military performance play a crucial role in the result. Lead your army and win the Battle of Gettysburg!\nIt has been voted as Best Strategy Game of 2014 by PCGamesN.\nMain Features\nSmart AI Commanders\nUltimate General: Gettysburg does not use “AI gameplay cheats” because it does not need them. The game’s difficulty is accomplished only by nine distinctive AI personalities, each with their own advantages and special skills. AI Commanders are able to evaluate and gain tactical superiority in real time, reacting according to their different commanding skills, aggressively or defensively, heroically or cunningly and resemble different, competent human players.\nEach one of the AI generals is a formidable, non-scripted opponent who can actively try to flank you, secure strategic locations with artillery, keep reserves and reinforce areas that it attacks or defends. The AI will try to win the battle with tactics that fit to its personality. For example a defensive opponent may not attack ferociously in the first engagement and progressively advance its forces in the next battles.\nWhat players say: “Fantastic AI - don't know what kind of brain you put in this game but it works”\nMulti-Day Dynamic Battle\nOn the morning of July 1st 1863, the two armies meet near Gettysburg. Reinforcements arrive from historically accurate directions as the battle progresses, however, random events, delays and tactical differences are always a possibility that can change the results of each engagement compared to history.\nCan you re-enact Pickett’s Charge? What if Lee attacked the center of the Union Army early in the morning of July 2nd of 1863 instead of attempting to flank the extreme left in the afternoon? What would happen if Meade counter-attacked on July 4th 1863? These questions and more can be answered within the game engine of Ultimate General: Gettysburg.\nThe battle is dynamically fought in time phases and can last up to 4 days. Each day can be separated by up to 3 time phases and the armies’ condition and positioning on the map are saved.\nAccording to battle events, you have the possibility to take decisions that can change the tide of the battle based on your prior tactical prowess. For example, when leading the Confederates, on the morning of July 2nd, you can choose to attack at Cemetery Hill and not make a delayed flanking maneuver at Peach Orchard… if you have managed to take Seminary Ridge the previous day! You can even choose to defend and wait for your AI opponent to take the initiative between days. These choices greatly increase the number of possible battle outcomes and challenges.\nWhat players say:“9 different AI profiles, multiple outcomes, multiple strategies, casualties carry over. This game is a different experience every time. Well worth it, can't wait for the next one.”\nEasy Controls & Unit Self-Awareness\nDrag simple movement arrows to command large forces easily. Units do not need your micromanagement because they are able to act on their own initiative and re-align, switch targets, withdraw and form battle lines without player input. Consequently, you are able to give generic commands to your units and can rely on them to fight efficiently without the need for “babysitting”.\nWhat players say: “Innovative movement system - this is by far an awesome system they developed. It’s not only insanely easy to learn, but also incredibly innovative”\nDetailed Map of Gettysburg\nUtilizing satellite images and historical maps, every major location, house, ridge and hill are depicted as accurately as possible within the game’s unique art style. If you are an American Civil War enthusiast, you will be especially happy to notice the amount of precision and information that the map provides. Not only will you be able to better understand the historical layout of the map, you will also be able to make use of each location and landmark in battle, thanks to the simulation of cover, concealment, terrain and high ground in the game.\nWhat players say: “Incredible Gorgeous Map - I had to capitalize that because this map is by far one of the best maps of Gettysburg I have ever seen either in a game or even in books”\nAdvanced Line of Sight\nElevation and obstructions affect unit visibility realistically. Units may make use of concealment and cover to survive artillery barrages, stage ambushes and more, but beware – the AI will attempt to do the same to you. The units enter or exit the Fog of War gradually with a fade in/out effect that helps you perceive their hiding and course seamlessly.\nWhat players say: “The way Game Labs implemented Line of Sight in this game should be held as an example to other developers to do the same”\nNumerous Tactical Factors\nIn Ultimate General: Gettysburg, you will realize that army units are not “machines” that blindly follow orders, but they need to conserve strength and courage for decisive battle actions. Every basic tactical element that is expected for a strategy game is incorporated into gameplay. Most importantly, morale is affected by many factors including flank or rear attacks, casualties, volley shocks, artillery fire and fatigue.\nWhat players say: “... positioning of units matters. You really bring the struggles of 19th century warfare to life here”\nHistorically Accurate Forces and Leaders\nUltimate General: Gettysburg includes the full order of battle for the Union Army of the Potomac and the Confederate Army of Northern Virginia. Unit sizes range from the small artillery batteries to vast infantry brigades with cavalry and skirmishers in between.\nAll brigades have troop numbers and differing competencies based on historical facts. Additionally, all artillery battery numbers and types are correctly simulated. Lastly, major generals and officers actively participate in the battlefield to organize and support the armies and appear in after action battle reports to help you monitor battle progress.\nWhat players say: “Immersive American Civil War feel: sounds, portraits and general historical authentic really make this one of the most immersive historical games I have played, and I am a total history buff”\nFurthermore, every inch of the map has a strategic role. Sloping, terrain type and obstructions affect unit movement realistically. Elevations, ridges and hills provide excellent firing positions and give increased sight, morale and accuracy to troops stationed there.\nBy placing your units close to each other, they become more resilient to charges and flank attacks but get more vulnerable to projectile fire. Thus, forcing your enemy to keep his lines dense while you shell him with artillery can be a valid tactic. As the condition of your units changes dynamically during the battle, the effectiveness of your whole army is affected. For example, units fire more coordinated volleys when they have high morale and have more discipline and tight formations.\nThese and many more deep gameplay mechanics are packed into a simple and intuitive GUI that aims to ease the game experience for the player without overwhelming with complex statistics.\nEvolving Multiplayer Experience\nThe game currently offers 18 maps for 1vs1 matches and is continuously improved according to user feedback.\nWhat players say: “Well, actually, the AI in this game is about the best ever seen (except for chess), and there is a working multiplayer with about always at least one battle going.”\nUltimate General: Gettysburg is developed by Game Labs and designed by Nick Thomadis, known for his successful and popular “DarthMod” series.How to Play Please read our guide","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Game-Labs","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":351827,"name":"DOOM (25th anniversary)","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/521/521ddba8d10c2008f7ee436975ff01bd.jpg","description":"Celebrate DOOM’s 25th anniversary with the re-release of the original DOOM (1993). First released in 1993, DOOM introduced millions of gamers to the fast-paced, white-knuckle, demon-slaying action the franchise is known for. Relive the birth of the first-person shooter and experience the demon-blasting fun that popularized the genre.\nDOOM (1993) includes:\n- The expansion, Episode IV: Thy Flesh Consumed, with 9 additional action-packed levels\n- Local 4 player deathmatch\n- Local 4 player co-op\n1-4 players\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nDOOM® © 1993-2019 id Software LLC, a ZeniMax Media company. DOOM, id, id Software, id Tech and related logos are registered trademarks or trademarks of id Software LLC in the U.S. and/or other countries. Bethesda, Bethesda Softworks, ZeniMax and related logos are registered trademarks or trademarks of ZeniMax Media Inc. in the U.S. and/or other countries. Nerve is a trademark of Nerve Software LLC. All Rights Reserved.\nBethesda.net account required. See end user license agreement, Terms of Service, Privacy Policy and additional details at bethesda.net.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nerve Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":261887,"name":"Hello Neighbor Hide and Seek","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9bc/9bc61928bbae44a5f85dac72d6d3a102.jpg","description":"Hello Neighbor: Hide and Seek follows the tragic story of the Neighbor’s family in this dramatic prequel to Hello Neighbor. Experience playing a game of hide-and-seek with your brother as you both deal with a loss of a family member. The game explains events that lead up to the original Stealth Horror hit Hello Neighbor.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"}]},{"id":15725,"name":"Uriel's Chasm 2: את","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cab/cab89c6c6630c660608dafb0c7c24fa9.jpg","description":"את is a fantasy \"Mega-PC\" rom hack. In את (\"et\") you play as a young girl who has been sent into another dimension as a sacrificial offering.\nYou have been showered with mercy and adopted as a daughter by a mysterious entity known as The Abstraction. You are charged with cultivating a garden paradise on a barren frame in the middle of space, for a mysterious suitor who is to come.\nLately you have been having strange prophetic dreams in which other dimensions have been sending anti-matter tributes and sacrifices, all in a effort to win your hand and share your paradise.\nAlso, a mysterious glitch in the very fabric of your reality called Mayim has started to show up. Reality bends as everything at the quantum level is digitized and rerouted to an eerie abandoned carpark in Nauseous Pines.\nAll the game styles!!, proto-bullethell boss rush is just the beginning as you are plunged into crazy game style combinations including configurations such as frogger, space invaders, california games surfing and fire fighting\nAllegorical story that dramatically furthers the Nauseous Pines/Uriels chasm universe of Railslave games.\nInnovative mechanics, graze fruit to fill your rainbow anti-matter launcher, travel closer to the action to raise the risk bar and spin the fruit machine.\nPunchy full Yamaha FM OST made on synths close to the actual Mega PC and influenced by a wide variety of styles from Indian Bhangra to Technosoft's Thunderforce series.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rail Slave Games","platforms":[{"id":0,"name":"PC"}]},{"id":302857,"name":"RAD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/674/674ba9f9dc03b89141b10136da3790b3.jpg","description":"RAD is a 3D action rogue-like set in a post-post-apocalyptic world, where humanity has faced armageddon not once, but twice.\nPlaying as a teenage protagonist, you must venture into the Fallow — an ever-changing, radioactive wasteland filled with unknown and unspeakable creatures. It is here that you will find the solution to heal the world, and transform the cracked, barren landscape into a lush source of new life.\nBut humanity’s future comes at great personal cost, as the deeper you journey into unknown lands, the more you will expose yourself to gnarly toxins which will wreak havoc on your fragile human form.\nThe fate of the world depends on you, your trusty bat, and whatever strange new abilities you gain as the world around you ravages your body — twisting and mutating you into something far less than human, but far more powerful.\nBut forget all that — go grab that sweet bat and help save the world…or what’s remaining of it anyway!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":17245,"name":"Blameless","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62e/62ead9154d90dafd62f4e7538bf67ced.jpg","description":"Check out the new titleTime, Space and MatterSupport a physics-based gravity puzzle adventure by your vote and comment\nAbout the GameBlameless is a 3D adventure focused on puzzle solving and story. Set in an unfinished house, the player is trying to escape a mysterious man. While you know how and why you got there, you could not foresee you were invited for a twisted purpose and it’s upto you to investigate what happened and how to get out.\nThis is a short, yet full title with an open ending. Take around 20 to 60 minutes to complete.Blameless is freeBlameless is dedicated to the community!Gameplay FeaturesRealistic puzzle solving\nInvestigative approach\nMysterious atmosphere\nAlternative puzzle solutions\nStory progression via exploration\nCharacter voice over\nElement of tension","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vaclav Hudec","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2869,"name":"Saturday Morning RPG","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e8/7e802767c335a7b2b3bf53bbaeee71f8.jpg","description":"Saturday Morning RPG is an episodic JRPG set in world heavily inspired by 1980s Saturday morning cartoons and pop culture. Players take the role of Martin \"Marty\" Michael Hall, an average high-school student who has just been granted an incredible power - a power that ultimately leads him to attract the ire of the world's most notorious villain, Commander Hood! Saturday Morning RPG features a full soundtrack by legendary composer Vince DiCola (Transformers: The Animated Movie, Rocky IV) and his composing partner, Kenny Meriedeth (contributor for DuckTales, Power Rangers, X-Men, and others).TECH SPECS:\nEpisodic Gameplay: The story and gameplay of Saturday Morning RPG takes place across several episodes, each of which tells a complete self-contained story. Players can play any episode in any order, at any time! All of your stats and items carry between episodes. It’s a unique spin on the tried and true New Game Plus mode. On top of that, small decisions made in some episodes will carry forth into others – adding a layer of replay to each episode. Five episodes are included!\nActive Turn-Based Combat: Saturday Morning RPG draws quite a bit of inspiration from games like Nintendo’s Paper Mario series. Battles in the game are turn-based, but the player is always participating by actively defending against attacks and completing reflex tests to power up their own assaults.\nDefeat Enemies With Regular Stuff: Marty fights all his battles in the game by channeling magic through everyday objects. Use a pack of striped gum to summon rainbow zebras that trample your foes – or call upon a transforming action figure to morph you into a semi-truck!\nNostalgia Fueled Everything: Everything in Saturday Morning RPG centers on nostalgia. Marty receives his magical abilities thanks to a certain kind of garish plastic notebook, he can equip scratch ‘n sniff stickers to get statistical boosts, and he’ll traverse worlds inspired by the entire gamut of Saturday morning cartoons.\nEndless Battle Mode: Take on wave after wave of enemies in an endless survival mode where resource management becomes everything!\nOptional Arena Battles: Take on powerful enemies in optional arena battles. Two fights are currently included, with more coming as free updates.\nController Support: Full support for game controllers.\nSteam Achievements and Trading Cards: Earn over 70 achievements and collect 8 trading cards.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mighty Rabbit Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":46543,"name":"Field of Glory II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0dc/0dc2a71f92c36b602f8e4d87ad322f38.jpg","description":"It is 280 BC. Rome has defeated her main Italian rivals and is looking to expand further. First she must repel the invasion of southern Italy by King Pyrrhos of Epeiros. Then she will go on first to conquer the Carthaginian Empire in Spain and North Africa, then to push eastwards and conquer Greece, Macedon, Egypt and the Near East, as well as Gaul to the north. All this will take 250 years of epic struggle, at the end of which the Roman Republic will descend into civil war. Octavianus will emerge as the eventual victor and reign as Augustus, the first Roman Emperor.\nField of Glory II allows you to fight large or small battles for or against Rome, or between the other nations who are as yet unaware of the Roman threat, or what-if battles between nations that never actual came into conflict historically, but might have done if the course of history had been different.\nField of Glory II is a turn-based tactical game set during the Rise of Rome from 280 BC to 25 BC.\nTake command of a huge variety of armies employing vastly different tactical doctrines. Lead your chosen army and its named generals to victory in set-piece historical battles or \"what-if\" custom battle situations against an AI or human opponent.\nField of Glory II has a brand new campaign system that concentrates on the battles, and allows real strategic decisions without time spent moving armies around a strategic map. Each battle is vital to your progress. Your army will gain experience and elan as it goes from victory to victory against your enemies and their allies. There are four campaigns allowing you to follow the careers of some of the most famous historical leaders of the era: Pyrrhos of Epeiros, Hannibal, Mithridates of Pontus and Julius Caesar. There is also a sandbox campaign that allows you to lead any nation (and their historical allies) against any other nation (and their allies) – giving many thousands of permutations.\nVictory will require determination and tactical mastery!\nFEATURES\nAccurate simulation of Ancient battle in the last three centuries of the pre-Christian era.\n86 historically accurate units, built from fully animated 3D troop models, each with many variants. These allow Field of Glory II to represent the full range of troop-types and tactical doctrines that make this era one of the most interesting to wargamers and military historians. To name just a few, there are Roman legionaries before and after the reforms of Marius, Greek hoplite and Carthaginian African spearmen, Hellenistic pike phalanxes, thureophoroi spearmen and xystophoroi lancers, Gallic warbands, Skythian horse archers, Sarmatian lancers, Roman, Carthaginian, Greek and Gallic spear-armed cavalry, war elephants, Celtic and Indian chariots, scythed chariots, a wealth of light troops and many many more.\n12 Historical scenarios covering key engagements of the period on an epic scale. These include Bagradas 255 BC, Trebia 218 BC, Cannae 216 BC, Ilipa 206 BC, Zama 202 BC, Magnesia 190 BC, Pydna 168 BC, Chaironeia 86 BC, Tigranocerta 69 BC, Bibracte 58 BC, Carrhae 53 BC and Thapsus 46 BC. The player can play as either side.\nCustom Battle system allows unlimited “what-if” scenarios using historically realistic armies from carefully researched army lists, on realistic computer generated terrain maps. Armies covered include Romans, Carthaginians, Hellenistic Kingdoms (Macedon, Seleucids, Ptolemaic Egypt etc.), Gauls, Ancient Britons, Galatians, Spanish, Numidians, Spartacus’s Slave Revolt, Thracians, Skythians, Sarmatians, Parthians, Indians and lots more.\nCampaign mode allows you to rewrite history as you play through the battlefield careers of some of ancient history’s greatest generals, or war with any ancient nation against any other. Each victory increases the experience and elan of your core units. Quick to resolve strategic decisions allow you to go straight from one battle to the next without any delay.\nRandom map generator produces an infinite variety of historically realistic battlefield maps for custom battles and campaigns. Scenarios include open battle, pursuit, awaiting reinforcements, enemy awaiting reinforcements, flank march, rearguard action, advance guard, remove the head, and protect the baggage.\nClassic turn-based, tile based gameplay.\nEasy to use interface, hard to master gameplay.\nCohort-sized units. Battles can range from a few units to as many as 80 units per side.\nNamed generals who can influence combat and morale of units under their command.\nSingle player and multiplayer battle modes.\nEffective AI makes sound tactical decisions.\n6 difficulty levels allow the challenge to increase as you develop your battlefield skills.\nNumerous different unit organisations, combat capabilities and tactical doctrines allow full representation of tactical differences and developments through the period.\nMod friendly game system with built-in map editor.\nMultiplayer mode allows historical scenarios and “what-if” scenarios to be played by two players using Slitherine’s easy to use PBEM server.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Byzantine Games","platforms":[{"id":0,"name":"PC"}]},{"id":19681,"name":"The Misadventures of P.B. Winterbottom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f28/f28b1fb1d63cfcbeb3aaced527604497.jpg","description":"Create your own paradox… for the love of pie\nEnter a macabre and comical silent world filled with mischief, time travel and delicious pie. Record yourself and harness your time bending abilities to cooperate, compete against, and disrupt your past present and future selves. Winterbottom’s debut misadventures present a whimsical spin on the notions of time, space and play.\nJoin Winterbottom on his award winning debut Misadventures as he travels through over 80 unique puzzles.  Winterbottom causes mischief and mayhem in pursuit of the mysterious and elusive Chronoberry Pie on his spectacular journey through space-time.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"The Odd Gentlemen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":11389,"name":"Diaries of a Spaceport Janitor","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b58/b58bdb90231cef1adfcc4f22920fe01d.jpg","description":"Take in the trash...\nDiaries of a Spaceport Janitor is an anti-adventure game about picking up trash in an alien bazaar. Play as the Janitor, an Alaensee girlbeast with a municipally-subsidized trash incineration job and dreams of leaving the planet of Xabran's Rock far behind her.\nExplore the Spaceport! Navigate the maze of alleyways, side streets, plazas, and bridges as you search for discarded items to burn. Investigate one of various entrances to the mysterious subterranean sewerdungeon, or climb the ominously symmetrical Ziggurat to get a better view of the urban landscape! If you pay attention and keep track of landmarks, you won't get lost... probably.\nEmbrace routine! Spend your days cleaning up litter, finding food, and testing your luck at lottoshrines scattered throughout the area. Daily tasks form the backbone of your life as the Janitor, providing structure and monotonous security in an uncertain world! Do not deviate from your routine. Pray, work, eat, sleep. Do not deviate from your routine.\nSuffer the Curse! Stick your scentflaps where you shouldn't, and you may just walk away with an ancient cranial entity haunting your every waking moment! Consult local Necresses, pray to the Nine Goddesses, purchase ritual objects, and rub the giant sword to balance your personal luck favorably! Maybe that will make the whispering stop!\nEmbark on an anti-adventure! Find a middle ground between your life of menial drudgery and a culture of exciting quests and powerful heroes, and you might finally find a way off Xabran's Rock!\nmild content warning for: gender dysphoria, catcalling, poverty, drug use","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10643,"name":"SpellForce 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/88a/88ac3c3174bab1f24a0a45e4c232eea5.jpg","description":"SpellForce 3 - The perfect blend between RTS and RPG!\nSpellForce 3 goes back to the roots of the SpellForce saga. The story takes place before the acclaimed SpellForce: The Order of Dawn and the players becomes a part of a rich high fantasy world named Eo.Features:RTS/RPG Mix: Unique gameplay combining RTS and Top Down RPG genres\nCreate & Customize: Create your own hero and develop his skillset as you prefer!\nBuild to Fight: Build your own army and fight epic mass battles with it.\nEpic Storyline: Unravel a deep and epic story in the SpellForce universe that doesnt require having played any of the former SpellForce games. Fans will still find a lot of interesting connections.\nRich universe & lore: Explore the world Eo and discover intrigues, secrets and a lot of loot for your hero.\nApply some tactics:  Use advance tactics with your RTS army to defeat your enemies\nPlay on your own: Long Single Player Campaign of 30+ hours\nMultiplayer: Strong multiplayer component with various modes - Play cooperatively or compete against each other","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":616686,"name":"Doki Doki Literature Club Plus!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/111/111f88e51c27b02de1e5f79c64ee9894.jpg","description":"Welcome to a terrifying world of poetry and romance! Write poems for your crush and erase any mistakes along the way to ensure your perfect ending. Now’s your chance to discover why DDLC is one of the most beloved psychological horror games of the decade!\n\nYou play as the main character, who reluctantly joins the Literature Club in search of a romantic interest. With every poem you write and every choice you make, you’ll charm your crush and begin to unfold the horrors of school romance. Do you have what it takes to crack the code of dating sims and get the perfect ending?\n\nNow, the original mind-shattering DDLC experience is packed with tons of new features and content exclusive to Doki Doki Literature Club Plus!\nDoki Doki Literature Club Plus Features:\n6 new Side Stories about friendship and literature, totaling hours of new content\n100+ unlockable images including new game art, wallpapers, never-before-seen concept sketches, and more\n26 total music tracks, including 13 all-new unlockable songs by Nikki Kaelar, plus special guests Jason Hayes and Azuria Sky\nA built-in DDLC music player to unwind with your favorite songs in a custom playlist, or loop a single track forever\nA high-fidelity visual upgrade with all artwork now in Full HD (1080p)\nMeet the Literature Club!\nSayori – Sayori, your childhood friend, begins your story by recruiting you to the Literature Club! As a daydreamer full of positive energy, Sayori’s greatest passion is to deliver happiness to others.\nNatsuki – Natsuki tries to act tough, but her cuteness can make it hard to take her too seriously! She might be willing to warm up to good listeners who can respect her love for cute things.\nYuri – Yuri, the quiet bookworm, reserves her passionate side for those who can more deeply understand her enigmatic mind.\nMonika – Monika, the superstar President of the Literature Club, will keep you on track for a perfect ending. Monika is always there to give you a guiding hand, both in literature and in love!\n\nThis game is not suitable for children or those who are easily disturbed.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Team Salvato","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":300737,"name":"The Riftbreaker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/97d/97d257af0b770c67c92b523f8900c783.jpg","description":"You play the role of captain Ashley S. Nowak - you are the Riftbreaker, an elite scientist/commando inside a powerful Mecha-Suit. Enter a one-way portal to Galatea 37, a distant planet at the far reaches of the Milky Way Galaxy, with the purpose of building up a base that will allow travel back to Earth and further colonization. Ashley's Mecha-suit, which she calls \"Mr. Riggs\", can withstand the harshest environmental conditions and has a full range of equipment for base construction, resource extraction, gathering specimens and of course - combat. It is capable of traveling through rifts that connect space across vast distances.BASE BUILDING\nYour task is to construct a two-way rift back to Earth. It is a very complex invention and requires enormous amounts of energy. Simple solar collectors and a few tons of steel will not be enough. You will need to build up a complex chain of mines, refineries, powerplants and research facilities to complete this mission.EXPLORATION\nGalatea 37 is an unknown planet in the Sycorax belt of the Milky Way galaxy. Long distance surveys detected that it is inhabitable and perfect for colonization. The planet is full of rare minerals and substances that can be found in various locations around the globe. Varied biomes can surprise you with unknown fauna and flora as well as harsh weather conditions. Construct local outposts in resource-rich locations that will transport the required resources using rift technology.DEFENSE\nYour presence on this planet will not go unnoticed. As you build up your industry and disrupt the natural order, the world will start seeing you as a threat. Build up your defenses. Construct walls, barriers and defense towers as the attacks get stronger with every passing day. You will face thousands of hostile creatures trying to eliminate your presence.HACK, SLASH, SHOOT\nMr. Riggs can be equipped with powerful weapons and abilities that will allow you to take on the largest of beasts. You will need to be ready to face lots of hostile alien creatures as you scout the planet.GATHER SAMPLES AND STRANGE ARTIFACTSFallen beasts will drop valuable research specimens as well as rare resources. Use everything that you can gather to research and craft new technologies, buildings, weapons, and equipment. You can also scout the terrain using your sensors and dig for treasure buried underground.RESEARCHUse the samples that you've gathered to research new technologies that will help you build up your base, improve your defenses, develop new blueprints for your Mecha-suit or improve existing technologies.CRAFTMr. Riggs is fully customizable and upgradeable. Use the blueprints that you've researched to craft new parts and weapons. Utilizing better materials for the crafting process results in developing gear with improved properties. Each crafted item has unique properties.INTERACTIVE STREAMINGThe Riftbreaker™ has built-in integration with the most popular streaming services out there. The stream's audience can actively participate in the game through multiple options, e.g. by voting to send waves of new enemies, spawn environmental disasters like a tornado or by donating resources.THE SCHMETTERLING ENGINEThis game is built using the latest iteration of EXOR Studio's in-house developed Schmetterling 2.0 engine which was previously used to create X-Morph: Defense and Zombie Driver. We pride ourselves in delivering fluid gameplay and utilizing all of your hardware's capabilities - uncapped frame rate, support for widescreen monitors, customizable controls and more.COMMUNITY DRIVEN DEVELOPMENTIf you've read everything and arrived all the way down here, then you might be interested in helping us shape the game. Please come and talk to us on the forums, our official Discord server or through any other of our social media. We'll be sharing inside info about our development progress, and we'd love to hear your feedback. Please come and help us make Riftbreaker the game You want to play!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Exor Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":13288,"name":"Simply Chess","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18a/18a7a0d522af29198e4be23b7cdc4821.jpg","description":"The classic board game comes to Steam! Everything you need in a chess game.  If you are a chess enthusiast or someone who just likes to play a game now and again, this is what you've been looking for. This is Simply Chess.\nPlay it against friends whether they're on on Windows, Mac, & Linux.\nFeatures:\nPlay locally or online.\nPlay against the computer – World class \"Stockfish\" AI with 100 difficulty levels.\nIncludes \"hot-seat\"/\"pass-n-play\" mode for multiplayer using only one computer.\nAsynchronous play - you can play even when your opponent is offline.\nEasily switch between full 3D with camera-control & a 2D graphics mode\nFull controller and “Steam Big Picture” support\nSwitch seamlessly between playing with mouse/keyboard and gamepad.\nElo Ratings for online games – ranked on a Steam Leaderboard\nSteam Trading Cards, Badges, Backgrounds & Emoticons\nDozens of Steam Stats & Achievements.\nSteam version has no added DRM and can run everything except the online play & Steam-specific bonuses (Steam Achievements, Steam Leaderboards, etc.), without any internet connection and/or without Steam installed.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BlueLine Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1638,"name":"Doodle God","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bf5/bf57458ef8360854c8bb3599a42ef58f.jpg","description":"GameDoodle God is an addicting puzzle & world building game where players use logic and ingenuity to create the entire universe.\nStarting with the basic elements of earth, wind, fire and air players can build a world filled with locomotives, Dragons, skyscrapers, Aliens and more. In Planet mode players will discover a challenging new way to develop the universe of their dreams.\nAs you create elements watch the world come to life as new combinations create new elements, life-forms and objects that propagate the planet's surface.  But beware with great power comes great responsibility. Players need to be aware of unintended consequences like a zombie plague and other catastrophes! Test your divine knowledge and challenge your friends online with the new Tournament mode. Each time players successfully create a new item they’ll be rewarded with wit and wisdom from some of the greatest philosophers and comedians of all time.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"8Floor","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":392306,"name":"Say No! More","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7c8/7c8ecc5d3a86557ad38c94a09a581eae.jpg","description":"In a world where the word “No!” has been virtually banished, you start an internship in a company run by arrogant people. Everyone is convinced that the value of a person is defined only by their professional experience. And of course, you only get these through regular “Yes!” – saying!\nAfter being bullied by colleagues and supervisors and used as a “yes”-puppet, you’ll find an old self-help tape titled Say No! More. In addition to the helpful hints from Coach, the “No!”-expert, driving songs motivate you to finally say “No!”! By finding more cassettes, your “No!” becomes stronger, louder and bigger! You face your bullies, inspire other employees and finally destroy the evil gang of abusive superiors and CEOs.\nBut despite all this confidence and strength: Will you be able to say “No!” to your best friend?\nSingle-Player One-Button-Game on Rails\nChoose how to say No!: Heated No! Cold No! Lazy No! Wacky No!\nCharge your No! for bigger effect!\nIrritate your colleagues! Laugh at them! Clap at them! Hmmm at them! Make them feel you listen to them, but sarcastically!\nSay No! in many different languages!\nCustomize your character!\nFight mean colleagues, supervisors and bosses!\nMake friends in your lunchbreak!\nLaugh out loud because this game is very funny!\nAnd learn to say No! more","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Studio Fizbin","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":22388,"name":"Commander Keen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0a/e0a77715d71a82bbeb2477b7b25a70cd.jpg","description":"Commander Keen: Invasion of the Vorticons:\nEpisode 1: Marooned on Mars (Dec. 14th 1990)\nEpisode 2: The Earth Explodes (1991)\nEpisode 3: Keen Must Die! (1991)\nCommander Keen's very first adventure, and the debut of id's groundbreaking side-scrolling technology. In the game you play the role of Commander Keen: the alter-ego of an eight year-old genius by the name of Billy Blaze. When Billy learns that the Earth is in danger, he dons his brother's football helmet and his homemade interstellar spaceship to become Commander Keen -- Defender of the Earth!\nCommander Keen in Goodbye Galaxy!:\nEpisode 4: Secret of the Oracle (1991)\nEpisode 5: The Armageddon Machine (1991)\nYou are eight-year-old Billy Blaze, boy genius to your neighborhood. Commander Keen to the rest of the universe. It's time to grab your trusty pogo stick and neural stunner, climb into the cockpit of your homemade Megarocket and blast off for the Shadowlands. To prevent the obliteration of life as we know it, you'll have to battle your way past deadly hazards and devious creatures, or end up as space toast.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":21068,"name":"Little Big Adventure 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3fa/3faad2ede1d1d5f210e005a9a3708bc4.jpg","description":"Little Big Adventure 2, also known as Twinsen's Odyssey is the sequel of Little Big Adventure (also known as Relentless: Twinsen's Adventure) in which you've liberated the world from its evil dictator.\nIn this new adventure, he finds out that there are some visitors from outer space who arrived on his planet. Nobody knows why they came but our hero embarks out on a quest for the good once again. He needs to travel across the galaxy, defeat the aliens and their evil god to save the world.\nLike its predecessor, Little Big Adventure 2 is an adventure game with action elements, a well-written story, memorable characters and a lot of humor.\n• 6 languages available: Audio and Text: English, German, French - Text: Spanish, Italian, portuguese\n• A sequel to Relentless: Twinsen's Adventure\n• A memorable adventure\n• A great soundtrack","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16270,"name":"Flora's Fruit Farm","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a1/0a1ffb8434061b049a83f1418688cfb5.jpg","description":"Clementine Valley used to be the place to be! It was world renowned for its fantastic fruit trees lovingly tended to by Old Jim.  Unfortunately Jim has lost the energy to grow enough fruit to keep the locals happy, let alone attract the tourists Clementine Valley used to have.  Luckily for Jim, Flora’s kind gesture showed him that she has the spirit to continue his legacy and he gives her his Magic Gardening gloves...\nIt’s up to Flora to restore life to Clementine Valley by growing fruit with her magic gardening gloves!\nCreate a blossoming fruit farm empire in this tree growing, time and resource management game.\nUse your magic gloves to grow 50 different fruit trees in 8 unique environments.\nExplore tree roots to discover new fruit seeds to grow and flower bulbs to plant.\nSell fruit to 7 different types of special characters, all with their own favorite fruits!\nKeep pesky birds and cheeky gophers at bay in order to maximize profits!\nSummon a squirrel helper if you fancy a break, or take on one of the 10 challenges in Challenge mode if you’re feeling adventurous!\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Honeyslug","platforms":[{"id":0,"name":"PC"}]},{"id":430254,"name":"The Watchers: DEVOUR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/995/9959989bb48350adc3c7eca380a90169.jpg","description":"The Watchers: DEVOUR is a co-op horror survival game for 1-4 players. Players must explore the home of cult leader Anna Puerta and work together to burn ritual objects, escape the wrath of a possessed mother, and banish evil for good. Run. Scream. Hide. Just don't get caught.KEY FEATURESSingle player mode:\nFor hardcore players only. Have you got nerves of steel? In this mode you'll be doing all the work yourself.\n2-4 player online co-op gameplay:\nTake control of 4 cult members in this unique online co-op gaming experience. The Watchers: DEVOUR will test your communication and cooperation skills to the limit. Bring friends, or find other players using the server browser.\nHorror atmosphere:\nIncludes haunting original music from established British composer, Peter Fender.STORYCalifornia, June 2006. Anna Puerta, leader of demonic cult The Watchers of Azazel, has just performed a forbidden ritual, believing she can summon and control the goat demon himself.\nBut something has gone wrong, and Azazel has possessed her. Anna's four most trusted cult members, realising what has happened, must now do everything in their power to stop her.The WatchersPlay as Anna's children Luisa and Frederico as they search for their mother in online co op sequel  The Watchers.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Joe Fender","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":398405,"name":"Sons of the Forest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a0/7a092fa63811a7f6ed90f456a8887e91.jpg","description":"An entirely new experience from the makers of the ‘The Forest’\r\n\r\n\r\n\r\nSent to find a missing billionaire on a remote island, you find yourself in a cannibal-infested hellscape. Craft, build, and struggle to survive, alone or with friends, in this terrifying new open-world survival horror simulator.\r\nA Survival Horror Simulator\r\nExperience complete freedom to tackle the world how you want. You decide what you do, where to go and how best to survive. There are no NPC's barking orders at you or giving you missions you don't want to do. You give the orders, you choose what happens next.\r\nFight Demons\r\nEnter a world where nowhere is safe and fight against a range of mutated creatures, some who are almost human like, and others who are like nothing you have ever seen before. Armed with pistols, axes, stun batons and more, protect yourself and those you care for.\r\nBuild and Craft\r\nFeel every interaction; Break sticks to make fires. Use an axe to cut out windows and floors. Build a small cabin, or a sea-side compound, the choice is yours.\r\nChanging Seasons\r\nPluck fresh salmon directly from streams in spring and summer. Collect and store meat for the cold winter months. You're not alone on this island, so as winter rolls in and food and resources become scarce you won't be the only one looking for a meal.\r\nCo-op Gameplay\r\nSurvive alone, or with friends. Share items and work together to build defenses. Bring back-up to explore above and below ground.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Endnight Games","platforms":[{"id":0,"name":"PC"}]},{"id":28435,"name":"Forza Horizon 2 Presents Fast & Furious","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89e/89e5503a8f4b5c1b5a0783e4bbab588a.jpg","description":"This standalone expansion will be available at no additional cost until April 10, 2015.  The next great automotive adventure begins with the Forza Horizon 2 Presents Fast & Furious standalone expansion for Xbox 360! For the first time ever, the Forza experience of thrilling driving and amazing cars is combining with the unstoppable Fast & Furious movie franchise to create an original adventure filled with adrenaline-fueled automotive action.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sumo Digital","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]}]