[{"id":4514,"name":"L.A. Noire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e2d/e2d3f396b16dded0f841c17c9799a882.jpg","description":"After the end of World War 2 long needed peace has been reached and should be protected, so Cole Phelps, a decorated war veteran, returns to Los Angeles, California to his wife and joining the LAPD. Neo-noir action-adventure, L.A. Noire allows players to solve crime cases through collecting clues, collecting witness statements and interrogation. Highly detailed facial animation allows players to detect the exact emotion witness or suspect is expressing, and it can become a leading hint in a case. Slow and meticulous crime solving is broke up by fast-paced action scenes including car chases, gunfights and hand to hand combat.\r\nAfter every case player’s performance will be graded by 1-5 star rating, depending on how they acted during interrogations and how well they searched for the clues. Aside from the main story cases, detective Cole can be involved into optional side-investigations, known as Street Crimes.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Team Bondi","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":430,"name":"Grand Theft Auto: Vice City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/13a/13a528ac9cf48bbb6be5d35fe029336d.jpg","description":"Grand Theft Auto: Vice City is a third-person shooter with an open world. The game is set in a fictional city during the 1980’s and exhibits a unique design of locations, people, and objects, resembling the real world’s counterparts of Vice City, mainly Miami, FL. GTA: Vice City is a fourth game of the series, following Grand Theft Auto III.\r\n\r\nThe main character is introduced as Tommy Vercetti, an Italian-American mobster who works for a wealthy crime family. Throughout the story, the player will observe as the protagonist rises the ranks, sometimes making decisions of questionable nobility or profit. Our goal as a player is to ensure that Vercetti becomes the boss of all of Vice City’s mafia, and various story characters will help us or prevent us from achieving this goal.\r\n\r\nThe worlds of Grand Theft Auto series have long been worked upon and have been done in much detail, and Vice City is no different. The people on the sidewalks, the stylish cars and neon light clubs, the sky-high buildings and lively piers and beaches, everything will bring nostalgic feelings to those of players, whose eyes have seen the glory of this time. The gameplay, however, bears little difference from its predecessor, continuing the trend of big guns, explosions, and cop chases.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Rockstar North","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":3841,"name":"Assassin’s Creed IV: Black Flag","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/849/849414b978db37d4563ff9e4b0d3a787.jpg","description":"Assasin's Creed IV: Black Flag is a pirate game. Being the fourth “numbered” instalment in the series, the story follows a new protagonist, Edward Kenway, who tries to build his Pirate Republic. Help legendary pirates like \"Blackbeard\", Charles Vane and other well-known pirates establish their empire while fighting the mystery of the Observatory - something very valuable for the Templars. Also, you will have to continue your infiltration in Abstergo and discover some new details about itself.\n\nAlthough being in the Assasin's Creed series, the game provides you with some new mechanics. Giving the player full control of the ship, you will have to cross the open-world sea and fight for your piracy. Ships will be sinking, destroyed and massacred. If you prefer exploring, a whole new underwater world is ready for you with its beauty and danger lurking in the streams of Carribeans. Experience the pirate life at its best. (?) (needs a better ending)","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":58812,"name":"Control","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/253/2534a46f3da7fa7c315f1387515ca393.jpg","description":"Control is a surrealist low-fantasy game about a secret organization that deals with the paranormal activities.\r\n\r\n###Plot\r\nThe game follows Jesse Faden, a woman with superhuman powers. She works with the Federal Bureau of Control, a secret governmental organization that deals with the paranormal phenomena, often by annihilating it as a threat. The Bureau headquarters, known as the Oldest House, is taken over by a supernatural power called the Hiss. The director of Bureau, Zachariah Trench, is killed, and Faden is unexpectedly promoted to his place, while the ghost of her predecessor haunts her. She has to travel the endless corridors of the Oldest House and defeat the Hiss using magical Director's Pistol. \r\n\r\n###Setting\r\nMost of the game takes place in the FBC building, which is a high-rise on Manhattan. The Oldest House is a non-euclidian space, which is larger on the inside. Its corridors and rooms change shape and positions depending on the rituals its inhabitants perform. The Oldest House stores the magical artifacts called Altered Items.\r\n\r\n###Gameplay\r\nThe player controls Faden from the third person view. To defeat her enemies, she uses various superhuman powers, such as telekinesis or levitation. She also wields the shape-shifting Director's Pistol and the magic artifacts she can obtain as a reward for completing quests. Jesse's skills grow throughout the game. \r\n\r\nThere is no multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":11934,"name":"Counter-Strike: Source","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/48e/48e63bbddeddbe9ba81942772b156664.jpg","description":"Counter-Strike: Source is the third entry of the big franchise of competitive shooters. Based on a modification to the original Valve game Half-Life, Counter-Strike: Source has no plot yet fully concentrating on a competitive part of the gameplay.\n\nWith two opposing teams, Counter Terrorist and Terrorist, each side has a unique set of weapons to choose. Having a big variety for a player, you can select a gun for your particular style of gameplay. Pistols, shotguns, rifles or machine guns are available in the game for a certain price you can earn by winning each round. You can win by successful bombing the target or defusing the bomb, eliminate the whole enemy team or by rescuing hostages. A big choice of game modes also aids plenty amount of maps. You can have a standard match, deathmatch, gun game or jumping challenges. In Counter-Strike: Source anyone can find something for himself.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Valve Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":257201,"name":"Star Wars Jedi: Fallen Order","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/559/559bc0768f656ad0c63c54b80a82d680.jpg","description":"Cal Kestis—one of the last surviving members of the Jedi Order after the purge of Order 66—is now a Padawan on the run. \n\nStar Wars Jedi: Fallen Order is an action-adventure game set after Star Wars: Episode III — Revenge of the Sith™. Develop your Force abilities, hone your lightsaber techniques, and explore the ancient mysteries of a long-lost civilization—all while staying one step ahead of the Empire and its deadly Inquisitors. an","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Respawn Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":4570,"name":"Dead Space (2008)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ebd/ebdbb7eb52bd58b0e7fa4538d9757b60.jpg","description":"Dead Space is a third-person shooter with horror elements. Playing as Isaac Clarke, the systems engineer, players will be isolated on the spaceship USG Ishimura after the crew was slaughtered by mindless Necromorphs after the failed investigation of the distress signal. Now Isaac not only has to escape but uncover the dark secrets of Ishimura, while looking for the clues about the whereabouts of his girlfriend Nicole.\nDead Space accents the survival aspect of the game, by keeping minimal UI and keeping HUD on the armor, making sure that the players can see the corners of the screen. Only weapons Isaac has access to are his engineer tools, which can all be upgraded with the limited supplies. Dead Space introduces a new variant of zombies called Necromorphs, that are highly mobile and instead of aiming for the head, players will be asked to attack the limbs, in order to incapacitate and slow them down, eventually killing them.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":2462,"name":"Uncharted 4: A Thief’s End","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/709/709bf81f874ce5d25d625b37b014cb63.jpg","description":"Uncharted 4 is the final installment in the Uncharted series. The story follows Nathan Drake for the last time as he now searches for Captain Henry Avery's treasure. \r\n\r\nIntroducing new characters such as Samuel Drake, with Sam and Sully Nathan agrees to find the treasure of the Gunsway heist in 1695. As antagonists, Nathan must face Rafe Adler and Nadine Ross while they are also trying to find this treasure and Nathan must face details about Sam's past.\r\n\r\nNow changing the game's concept, Naughty Dog made locations much bigger and more explorable. Expanding the story behind Henry Avery's actions in history the story once again feels like Indiana Jones kind of adventure. The grappling hook, climbing on rocks and mountains, or diving from the top, Nathan still engages into hand to hand combat with his enemies as well as using firearms. Nolan North, Emily Rose, and Richard McGonagle return to the final installment in the series to say farewell to the story of Nathan Drake for the last time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":3017,"name":"Just Cause 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5bb/5bb55ccb8205aadbb6a144cf6d8963f1.jpg","description":"Just Cause 3 is an open-world action adventure with the large locus on freedom of exploring. It is the thirds title in the Just Cause series produced by Avalanche Studios, preceded by the first two numerical parts and having the 4th part not yet released as its successor.\r\nRico Rodriguez is the protagonist of the game, who is continually being forced to deal with bandits and dictators somewhere in the Mediterranean. The events of the third game in the series take place 6 years after the second installment. \r\nAny game of this category is strongly associated with complete freedom of roaming, and the third part pushes all the metrics up: you now have 1 000 square kilometers of space to wander around and upgraded hook which has allowed you continuously to overcome any obstacle. The grappling hook works like a universal tool: you may drag your enemies closer Skorpion-style, climb mountains and cling to foe's cars. \r\nNot only tools but physics provide unique exploring experience — the key word for them is an exaggeration for any event in the game looks like it was cut straight out of an action movie.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":4806,"name":"Mass Effect 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3cf/3cff89996570cf29a10eb9cd967dcf73.jpg","description":"Mass Effect II is a sequel to Mass Effect one, following the story of Captain Shepard in his or her journey in saving the Galaxy from Reapers. Just after the fight against Saren, Shepard dies and drifts in open space. Being collected by Cerberus and the lead man, The Illusive Man, Shepard has to investigate attacks on human colonies around the Milky Way, and discover that now the Reapers using some new insectoid called the Collectors. \r\n\r\nYou can choose from different classes to play, for example, a Soldier, Adept or Vanguard. A cover system is the main mechanic in the fight, as you have to think about fighting your enemy strategically. Your talents have a global CDR, so choose wisely. With one little addition, now your weapon has a loaded magazine of bullets, and you can run out of ammo if not using your weapon properly. \r\n\r\nBioWare sticks to the tradition of dialogue and reputation system, as your actions still affect your position in the world. If you act like a hero and help everyone you meet, people will like you and your reputation will be Paragon. Do the exact opposite and a Renegade. Whom will you be?","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"BioWare","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3543,"name":"Borderlands: The Pre-Sequel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/530/5302dd22a190e664531236ca724e8726.jpg","description":"The game belongs to the Borderlands game line, its action takes place between the events of Borderlands and Borderlands 2.\nEverything happens on the moon of Pandora - Elpis. The story tells about the formation of Hyperion Corporation and the fate of its head - Handsome Jack, whom we meet while in the role of a simple programmer who dreams to find some valuable artifact. In the game there are various innovations - in the plot, in the characters, in the scenarios of missions and in the setting. For example, on the Pandora satellite, gravity is much weaker, but there is no oxygen at all. Therefore, the task of obtaining oxygen becomes very important for everyone. Moreover, oxygen is needed not only for breathing, but also for the functioning of personal jetpacks and long high jumps. In the game there is another additional story and downloadable content, including new characters and story campaigns.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":3604,"name":"Metro: Last Light Redux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a4/7a45e4cdc5b07f316d49cf147b083b27.jpg","description":"It is the sequel to the game Metro 2033. Both games are based on the world of Dmitry Glukhovsky's novel Metro 2033 - in post-apocalyptic Moscow, in the tunnels of subway lines groups of very different people survive. And not only people. There are mutated people there, and mutated animals. They are distinguished by unusual abilities, but even more - behaviour strategies. In the struggle for the remnants of resources, all these beings spend their gloomy days.\nAll characters use unusual and unexpected means for life and war. Something is created from the remnants of a past, normal life, something has already appeared in a new, changed world.\nLocations are struck by an unusual synthesis of the ruins of a known world and traces of a catastrophe.\nFrom the previous game Metro: Last Light differs, according to general opinion, by careful work on the remarks and shortcomings of the previous game. The set of weapons is significantly expanded, the technologies of Metro 2033 have become more developed.\nThe game has two fundamentally different endings and five additions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Deep Silver","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":19301,"name":"Counter-Strike","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c4/9c47f320eb73c9a02d462e12f6206b26.jpg","description":"Counter-Strike franchise started in back in 2000. Originated as a mod for Half-Life, the developers were signed by Valve Corporation thus beginning the franchise that exists to this very day. \n\nHaving no particular plot or story at all, Counter-Strike was a competitive game mostly used as PvP. With new physics and a large amount of weaponry, you can choose between two fractions - Counter-Terrorists and Terrorists. Each team had their signature weapon (CTs had M16 while T had AK-47, for example), the main goal of every round was to kill the opposite team or fulfil a task.  In case there is a bomb plant - detonate or prevent, hostages - rescue or prevent from it or assassination. One player from the team is chosen as a VIP person that must be protected, and the goal of the opposite team is to kill this VIP. By winning every round, you received a good payment, by loosing - much lesser one. You can spend cash on buying equipment and weapon. Counter-Strike franchise is still loved to this day, and even such old shooters live to this day.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Valve Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox"}]},{"id":50738,"name":"Death Stranding","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ad/2ad87a4a69b1104f02435c14c5196095.jpg","description":"Sam Bridges must brave a world utterly transformed by the Death Stranding. Carrying the stranded remnants of the future in his hands, Sam embarks on a journey to reunite the shattered world one step at a time. What is the mystery of the Death Stranding? What will Sam discover on the road ahead? A genre defining gameplay experience holds these answers and more.\r\n\r\nExperience a journey like nothing before it, from legendary game creator Hideo Kojima. Take control of working man Sam Bridges, as he braves a deadly and mysterious world where death’s tide lurks everywhere.\r\n\r\nFeaturing an all-star cast, including Norman Reedus, Mads Mikkelsen, Lindsay Wagner, Léa Seydoux and Guillermo del Toro, Death Stranding is a unique and unforgettable game.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":13535,"name":"Left 4 Dead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/476/476178ef18ab0534771d099f51cdc694.jpg","description":"Left 4 Dead is set in a zombie apocalypse situation. You play as one of four different characters - Louis, Zoe, Bill or Francis - and try to go to safety zones at each of the levels or leaving the infected areas. The main story follows four protagonists in their attempts to escape the hordes of zombies and other infected mutants. Every single time though something goes wrong. \n\nAt every single chapter, players must defend themselves from a horde of zombies as well as completing different tasks in order to leave the location - power up the generator, contact military service via radio or some other objects. Every level you start in a safe room with melee and firearms weapon, like UZI, Katana, AK-47, supplies and medicaments like the first-aid kit which will heal you or your partner and painkillers which will give you some amount of health that you will lose over time. Ordinary zombies are not the only enemies you are going to face, as Smokers, Hunters, Tanks and other mutated monsters are about to stop you from getting to the end of the level.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":11142,"name":"BioShock 2 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7c4/7c448374df84b607f67ce9182a3a3ca7.jpg","description":"Bioshock 2 is a shooter with RPG elements, centered around resource-management to a great extent: more like an RPG than a shooter. The game is made by 2K studios and represents the final part of a dystopia dilogy — preceded by the original Bioshock. Its successor is Bioshock Infinite.\nYou play as Big Daddy — a giant mech with a drill replacing one of the hands. The game, while they both are telling the story of a charming Rapture — the city descended from Orwell's and Zamyatin's pages where the society's greatest mind have suffered a severe decline.\nThe central feature of the game is the unique abandoned city's aesthetics — minding the time Bioshock 2 is still a beautiful title, with detailed drawn water and strange surroundings, never mind the variety of foes.\nThe remaster introduces a 4k resolution — it is now more enjoyable to explore Rapture and enjoy its various landscapes and sea-filled quarters. Among the other features: high-res textures and a set of Protector Trials,  which can give the player freakish weaponry and ammunition.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digital Extremes","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":3747,"name":"Metal Gear Solid V: Ground Zeroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ac/7aca7ccf0e70cd0974cb899ab9e5158e.jpg","description":"Metal Gear Solid V: Ground Zeroes is a standalone prologue for the main entry of the series, Phantom Pain. As Snake now is the Big Boss, Ground Zeroes follows Peace Walker entry some little time after it. Considering that Paz Ortega Andrade has died, MSF starts to work in different ways when suddenly there is information that Paz is being detained by Camp Omega on Cuba. The situation becomes even worse when Ricardo \"Chico\" Libre is sent for rescue and being captured as well. Snake is now headed to Cuba to save them or confirm their deaths. \n\nStill being a stealth action game, spotting system has been changed in Ground Zeroes, as now there is now meters, and the player must navigate through his eyes and ears to understand if he's been spotted. Reflex Mode is also added to the game. When the player is spotted, there is a little gap of time in slow-motion to kill the enemy before he alarms everyone around him. As well now the iDroid system in the game can be connected to your phones in order to have a look at an in-game map.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kojima Productions","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":3603,"name":"Metro 2033 Redux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4fb/4fb548e4816c84d1d70f1a228fb167cc.jpg","description":"Metro 2033 Redux is a rebuilt extended version of the original post-apocalyptic first-person action shooter Metro 2033. The game saved its pace and atmosphere of the gone world and except numerous technical issues, added several survival elements to the gameplay. The main plot is based on Dmitry Glukhovsky’s book Metro 2033. According to the storyline, the Earth was devastated by the nuclear war, and only a few people were able to survive hiding in the underground warehouses. Players assume the role of Artem, 20-year-old inhabitant of Moscow underground, whose aim is to learn more about the anomalies called the Dark Ones. With the remastered version of the game developers added some visual effects: new high-quality textures, shaders, dynamic light and weather (on the surface) systems. The gameplay was also extended with various realistic features like bots’ intelligence and collectible resources count. Within the game, players face two new difficulty settings (Survival and Spartan), which are expected to improve the gaming experience.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":108,"name":"Mortal Kombat X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa3/aa36ba4b486a03ddfaef274fb4f5afd4.jpg","description":"Mortal Kombat X is a fighting game involving 1x1 encounters. The game is the part of a massive Mortal Kombat franchise which originates in 1992 being one of the first fighting games. The MK universe includes films, literature, and TV-shows, let alone dozens of games. \r\nThe game features unique abilities throughout all of the series' titles. Fatality — the final death blow was introduced in the first section and have made its way to the Mortal Kombat X. The new piece of a franchise, nevertheless, implements newer mechanics such as X-Ray — a sharp blow delivered when the respective scale is fulfilled and breaking combos, utilizing the same bar but allowing a player to defend themselves. \r\nThe storyline of a game lists is superb, and every new title brings enrichment into it.  Mortal Kombat X tells a story of a self-titled tournament in the NetherRealm — a place somewhere between the land of the living and dead. The victor was supposed to become a NetherRealm's curator up until the next round of a championship. The MK X features 24 fighters with expending the list up to 33 playable characters thanks to two DLCs.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":11147,"name":"ARK: Survival Of The Fittest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/095/0953bf01cd4e4dd204aba85489ac9868.jpg","description":"Welcome to ARK: Survival of the Fittest, the first ever M.O.S.A. - a Multiplayer Online Survival Arena - that Studio Wildcard designed for the burgeoning wild west of eSports. A spin-off from the most popular open-world Early Access game on Steam ARK: Survival Evolved, ARK: Survival of the Fittest (SotF) pits up to 72 combatants in an action-packed struggle for survival where players are ultimately pushed into an epic final showdown where only one “Tribe” will make it out alive.\n\nSurvivors can form one- to six-person Tribes with the options to choose Unofficial and Official (Ranked) servers, and a variety of game-lengths and sizes in which to play. Players will start in the base forest environment introduced in the original ARK: Survival Evolved, with new environments and creatures introduced as the game evolves. Dedicated eSport ranking, matchmaking, reward, and tournament features make ARK: SotF readily accessible to all players.\n\nBalanced for intense competition, contestants begin in a neutral staging area where they can communicate pre-game, strategize, or talk trash. After a count-down, they dramatically descend from the sky onto the ARK in a circular formation via beams of light. There is a cache of valuable items in the center – do survivors dash for the goods and fight it out, do they run into the forest and hide, search for Dinosaurs to rapidly build their army, or do they freeze up from the sheer terror of death? A continually shrinking “ring of death” forces contestants ever closer together over time. The hunt is on!\nKEY FEATURES\nAction-Packed Core Survival Gameplay\n30+ Creatures to Tame and Ride at Early Access Start, Many more planned at full launch\nMultiple game modes (1v1, 2v2, 4v4, and 6v6)\nOne-to-Six Player Tribes\nVariable game configurations ranging from 30-minute “instant action” to three-hour long “epic wars”\nTop-ranked players are listed dynamically on SurviveTheArk.com and are provided monthly prize packages!\nGame-Changing Tameable Super Creatures (Dragon, Giant Ape, Brood Mother)\nRandom “Evolution Events”\nArsenal of Weapons, Traps, Armor, Structures and other Items from Primitive to Modern Tech Tiers\nRobust Ranking, Tournament & Spectator Features\nExclusive SotF Cosmetic Items that can also be used in ARK: Survival Evolved\nCustom-Painted “War Banners” enable Tribes to show off their team spirit on Flags across their army of Dinosaurs, and are also broadcast on the gigantic billboards during game events. Just don’t draw anything offensive!\nA custom soundtrack written by award-winning composer Gareth Coker of Ori and the Blind Forest!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Instinct Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":3636,"name":"The Last Of Us Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/364/3642d850efb217c58feab80b8affaa89.jpg","description":"The Last of Us is a post-apocalypse 3rd person adventure with a distinct focus on naturalness and photorealistic graphics. It is the first title in the IP, followed by the second part, coming out in 2019 by Naughty Dog, mostly known for 'Crash Bandicoot' and 'Uncharted' series.\r\nYou play as Joel, delivering small requests in America, the year 2033, precisely 20 years after Cordyceps fungus catastrophe which have turned human hosts into infected shrooms. Your next quest is to deliver 14 years-old Ellie, immune to the virus to the hospital in the other end of a state. It is a usual story of two characters getting along throughout their journey.\r\nYou need to fight fungus infected and usual soldiers, patrolling the territory — ammo and health are of the essence here, because it is post-apocalypse and everyone is short of resources. You face multiple encounters with bosses, various traps, and numerous puzzles. Let alone the number of collectibles telling a complete story of an epidemic world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":4513,"name":"Just Cause 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3c/a3c529a12c896c0ef02db5b4741de2ba.jpg","description":"Just Cause II follows a story of Rico Rodriguez, who arrives yet on another fictional island. Previously being on the Caribbean, now he is coming to Panau - an island in Southeast Asia. This time, Rico has to overthrow the dictatorial regime with its leader, Pandak \"Baby\" Panay and confront his former mentor, Tom Sheldon. When Rico arrives at the island, he discovers three criminal gangs: The Roaches, The Reapers and the Ular Boys. In order to prevail, Rico has to fight all of the three fractions as well.\r\n\r\nOne of the key features of the game is speed. This game is filled with adrenaline and ways of doing things very fastly. A wide variety of vehicles such as planes, boats, cars and other. A grappling hook is also available for the player as he can make his character fly around like Spider-Man or tie enemies to each other. There is a big choice of weaponry as well - you can have a pistol, two pistols, auto-rifles or even a grenade launcher! Having an open world map provides a player with experience do whatever they please - flying around, making missions or just discovering new things on the island.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":326292,"name":"Fall Guys: Ultimate Knockout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5eb/5eb49eb2fa0738fdb5bacea557b1bc57.jpg","description":"Fall Guys: Ultimate Knockout flings hordes of contestants together online in a mad dash through round after round of escalating chaos until one victor remains! Battle bizarre obstacles, shove through unruly competitors, and overcome the unbending laws of physics to avoid both humiliation and elimination. Leave your dignity at the door and prepare for hilarious failure in your quest for the crown!\nMassive Online Pandemonium: Dive into a series of ridiculous challenges and wild obstacle courses with 100 competitors online, all with the hopes of making the cut and advancing to the next round of mayhem.\nCompetitive & Cooperative: Shift between brutally competitive free-for-alls and cooperative challenges where only the winning team advance to the next round!\nComically Physical: Watch in delight as your fellow competitors bend, bounce, and bash their way to hilarious, physics-based failure!\nDelightfully Customizable: Fail in style with everything from fashionable pineapple couture to the latest in bunny hats available to customize your look in Fall Guys.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mediatonic","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"}]},{"id":10141,"name":"NieR:Automata","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5a4/5a44112251d70a25291cc33757220fce.jpg","description":"NieR: Automata is an action RPG, a sequel to Nier and a spin-off to the Drakenguard series. The story is set in the middle of the war between humans and machines where you take on the role of an android warrior called 2B. The story develops around the theme of androids' ability to feel and make their own decisions.\nThe gameplay of NieR: Automata combines RPG elements, such as character progression,  with action-based combat and some platforming features, including climbing and jumping over obstacles. Except for traditional light and heavy attacks, there are quick time events that if the completed result in a highly damaging counterattack. You can use four weapon types during the battles: short swords, long swords, bracers, and spears. While you play as a robot, you can upgrade your body with special chips that increase your stats. \nThe game is set in an open world and features numerous NPCs and side quests. You can explore it on foot as well as ride a wild animal or pilot a flying mech. There are also shops where you can get useful items including potions to restore health.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Platinum Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":274755,"name":"Hades","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f4/1f47a270b8f241e4676b14d39ec620f7.jpg","description":"Hades is a rogue-like dungeon crawler that combines the best aspects of Supergiant's critically acclaimed titles, including the fast-paced action of Bastion, the rich atmosphere and depth of Transistor, and the character-driven storytelling of Pyre.\n\nBATTLE OUT OF HELL\nAs the immortal Prince of the Underworld, you'll wield the powers and mythic weapons of Olympus to break free from the clutches of the god of the dead himself, while growing stronger and unraveling more of the story with each unique escape attempt.\n\nUNLEASH THE FURY OF OLYMPUS\nThe Olympians have your back! Meet Zeus, Athena, Poseidon, and many more, and choose from their dozens of powerful Boons that enhance your abilities. There are thousands of viable character builds to discover as you go.\n\nBEFRIEND GODS, GHOSTS, AND MONSTERS\nA fully-voiced cast of colorful, larger-than-life characters is waiting to meet you! Grow your relationships with them, and experience hundreds of unique story events as you learn about what's really at stake for this big, dysfunctional family.\n\nBUILT FOR REPLAYABILITY\nNew surprises await each time you delve into the ever-shifting Underworld, whose guardian bosses will remember you. Use the powerful Mirror of Night to grow permanently stronger, and give yourself a leg up the next time you run away from home.\n\nNOTHING IS IMPOSSIBLE\nPermanent upgrades mean you don't have to be a god yourself to experience the exciting combat and gripping story. Though, if you happen to be one, crank up the challenge and get ready for some white-knuckle action that will put your well-practiced skills to the test.\n\nSIGNATURE SUPERGIANT STYLE\nThe rich, atmospheric presentation and unique melding of gameplay and narrative that's been core to Supergiant's games is here in full force: spectacular hand-painted Underworld environments and a blood-pumping original score bring the Underworld to life.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Supergiant Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":4166,"name":"Mass Effect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a6c/a6ccd34125c594abf1a9c9821b9a715d.jpg","description":"Mass Effect was the very start of the trilogy about Commander Shepard in his journey to save the universe from Reapers - an old civilisation that wants to kill every possible rational being in order to prevail any wars. You play as Shepard. With flexible backstory and different classes you travel to Eden Prime with Captain Anderson and Nihlus Kryik, you and your team must discover the mystery behind the attack on the human colony. In the process, it is revealed that another Spectre, Saron, has become rogue and escapes the planet to awoke Reapers and start a full-scale war with the galaxy.\r\n\r\nFor BioWare, third-person shooters with tactical elements is a very common genre. Four different weapons - automatic rifle, shotgun, pistol and sniper rifle can be obtained through the game with better characteristics. Also, you can level up your protagonist and his squad to gain better stats and new skills. Dialogue panel is simple yet efficient - you choose the style of your approach and build a reputation of a hero or a renegade. With this options in hand, you can build your own story as Commander Shepard in saving the Milky Way Galaxy.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"BioWare","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":46889,"name":"Monster Hunter: World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/21c/21cc15d233117c6809ec86870559e105.jpg","description":"Monster Hunter: World is the fifth game in the Japanese franchise Monster Hunter, which is about hunting giant beasts. It is set in a medieval fantasy setting, on a continent known as the New World that is being colonized by the humans from the Old World. The plot revolves around a dragon migration called Elder Crossing. Your protagonist is a hunter, whose name and appearance can be customized. You traveled from the Old World to study and hunt the dragons and other local monsters.  \r\nThe hunter, accompanied by an assistant, starts at the city of Astera, from where they can freely wander the open world. There are six regions in the New World, each with its own base camp. The camps are where you have to thoroughly prepare before every expedition, gathering equipment and provision. Before you can fight monsters, they need to be tracked down using Scout flies and studied to discover their habits, strengths, and weaknesses. There are no character levels, so your hunter’s effectiveness relies on the hunting gear you have equipped. Advanced armor and weapons can be created using a detailed crating system. Many items that you found on missions, including body parts of monsters, can be used for crafting.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":613,"name":"Bastion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f99/f9979698c43fd84c3ab69280576dd3af.jpg","description":"After the Calamity, most of the world was destroyed and seemingly everyone was turned to stone, except the Kid. As the Kid, players will have to flee collapsing city, in order to reach the Bastion, where the game’s narrator Rucks, will instruct players to collect the Cores. Most of the story will be told through the narration and music. \n\nBastion is an action role-playing game with an isometric overview of the map. As players progress across the levels they will find and unlock collectible items and weapons. After completing said levels the Kid will find Cores, that are used to upgrade the Hub are of Bastion and unlock more features, like a blacksmith, arsenal or an item shop. Any level can be replayed if players missed any items or if they’re short on currency, called fragments. The Kid will also encounter challenge levels, where players will have to successfully use collected weapons under a time limit.\n\n**Key Features**:\n• Action-packed combat rewards playing with finesse\n• Hours of reactive narration delivers a deep story\n• Stunning hand-painted artwork in full 1080p resolution\n• Critically-acclaimed original music score\n• Controls custom-tailored to PC plus gamepad support\n• 10+ unique upgradeable weapons to be used\n• 6 powerful Bastion structures to be discovered\n• 'New Game Plus' and 'Score Attack' modes unlocked after finishing the story\n• 'No-Sweat Mode' lets players of any skill level enjoy the story","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":3191,"name":"Mad Max","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d7d/d7d33daa1892e2468cd0263d5dfc957e.jpg","description":"Although Mad Max is not related to the film series, it is based on its universe. Max Rockatansky is trying to reach the \"Plains Of Silence\", place in which he believes he will finally find peace. He is confronted by a group of War Boys led by Scabrous Scrotus. Beating Max up and stealing everything from him, they leave him in the desert to face his death. Recovering from his injuries, he chases Scrotus in a duel but fails to defeat him. Wandering in the desert, he meets a technic named Chumbucket that helps him to build a new machine and revenge Scrotus. \n\nBeing in such esthetics, Max is able to travel in an open world post-apocalyptic universe of Mad Max. Utilizing driving as a primary mechanic, you are able to confront and battle your way out on the car while armed with different weapons. Flamethrowers, turbo-boosts, basically anything that may come handy. You can have your preference for playing stealthy or aggressive. To drive, you need gasoline and to customise your car you need experience which you will get over time. Experience all the consequences of being a survivor by driving through the wasteland.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Avalanche Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10989,"name":"Paladins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2c/d2c74dacd89fd817c2deb625b01adb1a.jpg","description":"Paladins (also known as Paladins: Champions of the Realm) is a free-to-play multiplayer first-person shooter. The game is, according to developers, influenced by Team Fortress 2 and is an example of hero shooter subgenre: a type of multiplayer shooter in which you choose to play as one of the pre-made characters with unique abilities and weapons¬.  \r\nThe primary game mode in Paladins is the siege. Two teams are fighting for the capture point in the center of the map. When a team successfully seizes the capture point, it gets 1 Objective Point, and the Payload spawns for them. Now they must escort the Payload to the enemy’s base to get additional Objective Point. The hostile team can, however, steal the Payload to get Objective Point themselves. Once a team gets 4 Objective Points, it wins the match. \r\nThere are more than 38 heroes (or “champions” as they are called in the game) available in Paladins. Initially, the player has access to 5 of them at any time, and 4 more are in a two-week rotation. To permanently get any other champion, the player has to buy the champion via in-game currency or buy the champions pack for real money.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hi-Rez Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":17576,"name":"Batman: Arkham City - Game of the Year Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c50/c5085506fe4b5e20fc7aa5ace842c20b.jpg","description":"Batman: Arkham City is the second game in the Arkham series. Joker has escaped from Arkham Asylum, and Doctor Hugo Strange is capturing Bruce Wayne. Strange discovers the true identity behind the Batman and tries to kill him, but Wayne escapes from the prison and saves the Catwoman from Two-Face. Trying to acknowledge the mysterious \"Protocol 10\" he finds Joker in devastating state - fatal infection slowly kills. Joker infects Batman and every Gotham hospital.\n\nArkham City involves legendary Kevin Conroy and Mark Hammil coming back as Bruce Wayne and Joker, gifting their voices one more time. Noir Gotham atmosphere is supported by a grim plot and very live surroundings. The gameplay is still concentrating on simple but comforting fighting system making fights feel very fast and intense. In solving puzzles and gaining a tactical advantage, Batman can use different gadgets, as Batarang or a grapnel gun. You can silently dive and kill your enemies and use your detective skills to find clues about villains your facing, becoming as close to Batman, as possible.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9810,"name":"ARK: Survival Evolved","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/58a/58ac7f6569259dcc0b60b921869b19fc.jpg","description":"As a man or woman stranded naked, freezing and starving on the shores of a mysterious island called ARK, you must hunt, harvest resources, craft items, grow crops, research technologies, and build shelters to withstand the elements. Use your cunning and resources to kill or tame & breed the leviathan dinosaurs and other primeval creatures roaming the land, and team up with or prey on hundreds of other players to survive, dominate... and escape!\nDinosaurs, Creatures, & Breeding! -- over 100+ creatures can be tamed using a challenging capture-&-affinity process, involving weakening a feral creature to knock it unconscious, and then nursing it back to health with appropriate food. Once tamed, you can issue commands to your tames, which it may follow depending on how well you’ve tamed and trained it. Tames, which can continue to level-up and consume food, can also carry Inventory and Equipment such as Armor, carry prey back to your settlement depending on their strength, and larger tames can be ridden and directly controlled! Fly a Pterodactyl over the snow-capped mountains, lift allies over enemy walls, race through the jungle with a pack of Raptors, tromp through an enemy base along a gigantic brontosaurus, or chase down prey on the back of a raging T-Rex! Take part in a dynamic ecosystem life-cycle with its own predator & prey hierarchies, where you are just one creature among many species struggling for dominance and survival. Tames can also be mated with the opposite gender, to selectively breed successive generations using a trait system based on recombinant genetic inheritance. This process includes both egg-based incubation and mammalian gestation lifecycles! Or put more simply, raise babies!\nYou must eat and drink to survive, with different kinds of plants & meat having different nutritional properties, including human meat. Ensuring a supply of fresh water to your home and inventory is a pressing concern. All physical actions come at a cost of food and water, long-distance travel is fraught with subsistence peril! Inventory weight makes you move slower, and the day/night cycle along with randomized weather patterns add another layer of challenge by altering the temperature of the environment, causing you to hunger or thirst more quickly. Build a fire or shelter, and craft a large variety of customizable clothing & armors, to help protect yourself against locational damage & extreme temperatures using the dynamic indoor/outdoor insulation calculation system!\nBy chopping down forests full of trees and mining metal and other precious resources, you can craft the parts to build massive multi-leveled structures composed of complex snap-linked parts, including ramps, beams, pillars, windows, doors, gates, remote gates, trapdoors, water pipes, faucets, generators, wires and all manner of electrical devices, and ladders among many other types. Structures have a load system to fall apart if enough support has been destroyed, so reinforcing your buildings is important. All structures and items can be painted to customize the look of your home, as well as placing dynamically per-pixel paintable signs, textual billboards, and other decorative objects. Shelter reduces the extremes of weather and provides security for yourself and your stash! Weapons, clothing & armor gear can also be painted to express your own visual style.\nPick seeds from the wild vegetation around you, plant them in plots that you lay down, water them and nurture them with fertilizer (everything poops after consuming calories, which can then be composted, and some fertilizer is better than others). Tend to your crops and they will grow to produce delicious and rare fruits, which can also be used to cook a plethora of logical recipes and make useful tonics! Explore to find the rarest of plant seeds that have the most powerful properties! Vegetarians & vegans can flourish, and it will be possible to master and conquer the ARK in a non-violent manner!\nBy bringing sufficient rare sacrificial items to special Summon locations, you can capture the attention of the one of the ARK’s god-like mythical creatures, who will arrive for battle. These gargantuan monstrosities provide an end-game goal for the most experienced groups of players and their armies of tames, and will yield extremely valuable progression items if they are defeated.\nCreate a Tribe and add your friends to it, and all your tames can be commanded by and allied to anyone in your Tribe. Your Tribe will also be able to respawn at any of your home spawn points. Promote members to Tribe Admins to reduce the burden of management. Distribute key items and pass-codes to provide access your shared village!\nAll items are crafted from Blueprints that have variable statistics and qualities, and require corresponding resources. More remote and harsh locales across the ARK tend to have better resources, including the tallest mountains, darkest caves, and depths of the ocean! Level-Up your player character by gaining experience through performance actions, Level-Up your tames, and learn new \"Engrams\" to be able to craft Items from memory without the use of blueprints, even if you die! Customize the underlying physical look of your character with hair, eye, and skin tones, along with an array of body proportion modifiers. As you explore the vast ARK, you'll find clues left by other Survivors who have made the ARK their home in ages past, in the form of collectible detailed 3D \"Explorer Notes\". By uncovering all of these, you can begin to piece together the true nature of the ARK, and discover its purpose!\nEverything you craft has durability and will wear-out from extended use if not repaired, and when you leave the game, your character remains sleeping in the persistent world. Your inventory physically exists in boxes or on your character in the world. Everything can be looted & stolen, so to achieve security you must build-up, team-up, or have tames to guard your stash. Death is permanent, and you can even knock out, capture, and force-feed other players to use them for your own purposes, such as extracting their blood to for transfusions, harvesting their fecal matter to use as fertilizer, or using them as food for your carnivorous tames!\nThe mysterious ARK is a formidable and imposing environment, composed of many natural and unnatural structures, above-ground, below-ground, and underwater. By fully exploring its secrets, you’ll find the most exotic procedurally randomized creatures and rare blueprints. Also to be found are Explorer Notes that are dynamically updated into the game, written by previous human denizens of the ARK from across the millennia, creatively detailing the creatures and backstory of the ARK and its creatures. Fully develop your in-game ARK-map through exploration, write custom points of interest onto it, and craft a Compass or GPS coordinates to aid exploring with other players, whom you can communicate with via proximity text & voice chat, or long-distance radio. Construct & draw in-game signs for other players to help them or lead them astray...  And yet.. how do you ultimately challenge the Creators and Conquer the ARK? A definitive end-game is planned.\nOn the 100+ player servers, your character, everything you built, and your tames, stay in-game even when you leave. You can even physically travel your character and items between the network of ARK's by accessing the Obelisks and uploading (or downloading) your data from the Steam Economy! A galaxy of ARKs, each slightly different than the previous, to leave your mark on and conquer, one at a time -- special official ARKs will be unveiled on the World-map for limited times in singular themed events with corresponding limited-run items! Furthermore, you can now design or randomize your own unique 'Procedurally Generated ARKs', for infinite replayability and endless surprises.\nYou can play single-player local games, and bring your character and items between unofficial player-hosted servers, back and forth from singleplayer to multiplayer. Mod the game, with full Steam Workshop support and customized Unreal Engine 4 editor. See how we built our ARK using our maps and assets as an example. Host your own server and configure your ARK precisely to your liking. We want to see what you create!\nThe over-the-top hyper real imagery of the ARK its creatures is brought to expressive life using a highly-customized Unreal Engine 4, with fully dynamic lighting & global illumination, weather systems (rain, fog, snow, etc) & true-to-life volumetric cloud simulation, and the latest in advanced DirectX11 and DirectX12 rendering techniques. Music by award-winning composer of \"Ori and the Blind Forest\", Gareth Coker!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Instinct Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":25,"name":"Middle-earth: Shadow of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/21a/21ad672cedee9b4378abb6c2d2e626ee.jpg","description":"Middle-earth: Shadow of War is a continuation of Middle-earth: Shadow of Mordor\nThe game operates on the world and the characters of the books of JRR Tolkien. However, it will be more accurate to say that the game is closer to the cinematic version of this story, created by director Peter Jackson. This is noticeable both in the visual solutions of some locations, and in the events themselves and their location in time relative to each other.\n\nJudging by the events, the game takes place between the events of the books \"The Hobbit\" and \"The Lord of the Rings\". However, in the game there are also such events as the fall of the city-fortress of Minas Ithil and its transformation into Minas Morgul - in books these events occur several thousand years earlier.\n\nAs in Middle-earth: Shadow of Mordor, in the game Middle-earth: Shadow of War, the Nemesis system operates. This system provides a change in the world of the game and its inhabitants from the actions of the player. Therefore, each passage differs from other passages. For the game Middle-earth: Shadow of War, the Nemesis system has been improved.\n\nIf the player has the game Middle-earth: Shadow of Mordor, he can transfer to Middle-earth: Shadow of War some characters from the previous game - one enemy and one ally.\n\nThe player controls Talion. Taleon is obsessed with the spirit of the elven ruler of Celebrimbor. Taleon tries to use one of the rings of power to build an army of orcs and trolls and fight with Sauron and his generals.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":10065,"name":"Cities: Skylines","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25c/25c4776ab5723d5d735d8bf617ca12d9.jpg","description":"Cities: Skylines is a traditional city-building game, which allows players to experience urban planning in all aspects including zoning, road placement, transportation, taxation, and improvement of welfare. Therefore, within the game players are able to assume roles of city’s principal architect and mayor. The history of the city, in control of the player, begins with the 2-by-2 kilometers plot of land and a sum of money to start with. Players have to zone the city, build roads, explore the surroundings, provide infrastructure and jobs to attract new citizens. Once the newcomers settle down, the immediate reaction is expected to establish public services and to set proper taxes. Progressing within the game and developing the city will unlock new upgrades of the urban environment and lead to the territorial expansion. The gameplay also requires the control of several city’s parameter scales like budget, health, employment, and pollution. The game also features a creative sandbox mode, where the architect’s imagination is not restricted in any way.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Colossal Order","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":480,"name":"Resident Evil 7: Biohazard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cee/cee577e2097a59b77193fe2bce94667d.jpg","description":"Resident Evil 7: Biohazard is the latest installment in the Resident Evil series. For 13 long years, Resident Evil series were rejecting the survival-horror aspect and atmosphere of first original games in the series mainly released in nineties on PlayStation one system. From the famous Resident Evil 4 until Resident Evil 6, the series went full-force into action genre leaving horror elements behind and hard-core fans disappointed. Finally, Capcom realized that Resident Evil needs a change and Resident Evil 7: Biohazard delivers those changes at its fullest. First of all, the camera angle changed from over the shoulder view into first-person mode. Another change is that survival-horror elements are back together with light puzzle solving, inventory management and maze-like mansion in which the main story of the game happens. The player controls Ethan Winters who is searching for his lost wife in a dark mansion filled with horrible creatures and insane family. \r\nResident Evil 7: Biohazard can also be played with virtual reality setup and it’s known as one of the best games which supports VR.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":22509,"name":"Minecraft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4e/b4e4c73d5aa4ec66bbf75375c4847a2b.jpg","description":"One of the most popular games of the 2010s, Minecraft allows you to rebuild the environment around you. The world of the game is open, infinitely wide, and procedurally generated. It is composed of small 3D cubes that represent specific types of materials or terrain. The gameplay is centered on mining and building various structures of your choice. You can also craft items like tools, weapons, and armor. There's an option to shift to the first or the third person view.\nMinecraft includes multiple modes that dramatically change the focus of the game. Survival and Adventure modes require the player to gather resources, hunt for food and fight monsters to survive. In the Hardcore mode, there’s even permanent death. Creative mode, by contrast, offers you to freely explore the world and construct whatever you want with unlimited resources. There’s also a multiplayer mode that allows the players to share their worlds and engage in the traditional MMO activities, such as player-vs-player combat.\nMinecraft’s crude visual style, reminiscent of Lego cubes, became an iconic part of the popular culture. There are many myths and fan fiction surrounding the game, such as the legend of Herobrine, a rumored character that officially doesn’t exist.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"4J Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"}]},{"id":3387,"name":"Bloodborne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/214/214b29aeff13a0ae6a70fc4426e85991.jpg","description":"Bloodborne is an action-RPG and another member of souls-like title series. The game has no predecessors or successors, making it the only entry with one add-on: “The Old Hunters.” The Bloodborne universe, however, also includes a comics and a board game.\n\nGenerally resembling the Dark Souls series, Bloodborne, however, has some different mechanics and the pace of combat is increased thanks to the risk-rewarding battle system. Another difference is multiplayer, which comes in two kinds: you can summon other players into your game and fight bosses side by side or you can fight impostors, who are other players invading your playthrough.\n\nThroughout the game, you are forced to explore an enormous open world of Yharnam, which looks like alternate universe Lovecraft-inspired Victorian-era England, as The Hunter. You meet horrific bosses, explore vast areas, houses and open spaces while continually dodging, attacking and trying not to get killed by a massive number of hostile NPCs.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FromSoftware","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":923,"name":"Titanfall 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/569/56978b5a77f13aa2ec5d09ec81d01cad.jpg","description":"Now Titanfall 2 has a full-scale story campaign. The main plot is the confrontation of the people's Militia against the IMC Corporation, which seeks to destroy the rebels of the Frontier, a region of star systems that will allow them to get control over their resources.\r\n\r\nYou play as Jack Cooper, a soldier who dreams of becoming an elite pilot with advanced technology and a personal Titan - a fighting machine. Captain Tai Lastimosa trained Cooper and prepared for his candidacy. During the task of finding the missing Major Anderson, who had the information about the plans of the IMC. The entire squad of Cooper, including Lastimosa, dies in the attack of IMC mercenaries. The Captain gives his Titan to Cooper.\r\n\r\nAs the first part of the game, it is a first-person shooter in which you can control the pilot and exoskeleton \"Titan\". The pilot has a diverse arsenal of abilities that allow you to jump and run on steep walls with the help of the \"jump pilot module\". These abilities can be used with each other to move through the game locations quickly.\r\n\r\nWith enough points, the player can call the Titan, landing from the sky. They are much slower than pilots but have more powerful weapons.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Respawn Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":3254,"name":"Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/baf/baf9905270314e07e6850cffdb51df41.jpg","description":"Journey is an indie game placed in a setting of the vast desert. The protagonist is a nameless and speechless figure moving towards the distant mountain. The player gets to know the story without words, but rather through cutscenes. The main character wears a magical scarf, which allows flying for some time, and recharges it with gathered cloth or simply by walking. From time to time the protagonist finds collectible items and discover ruins that can give additional information about the world or the storyline. The only way of interaction with in-game objects is a shout. \n\nThe game transfers the atmosphere of an absolute loneliness. However, during the journey the character can meet other players controlling differently dressed, but generally the same figures. Wandering together can be helpful for both players, as they are able to charge one another’s scarves. The thing is that both players cannot communicate each other in any way, except producing noises. Together players can complete levels and continue moving to their final destination.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"thatgamecompany","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":9743,"name":"Unturned","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/93e/93ee6101e1c943732f06080dddb0fe4c.jpg","description":"Unturned is a low-poly survival game providing single or multiplayer experience. The main action takes place on 6 different maps (Prince Edward Island, Yukon, Washington, Germany and Russia) flooded with zombies. The story begins in the random location of the chosen map and lasts till the death. Playing for one of the few people not yet turned into a zombie, you should stay aware of various natural or unnatural dangers, gather required resources, and make your way through the tough survival. Survivors meet thirst, hunger, disease, injures, zombie bites, and other hostile players looking for safety. Since land, air and sea vehicles are available, players can choose the most suitable transport to explore the entire map. The gameplay stands for the wider opportunity of customization of pretty much everything in the in-game world, starting with simple object destruction and following to guns modification and shelters construction. In-app purchases do not actually affect the gameplay, but due to the cosmetic system, plenty of items (clothing and weapon skins) are purchasable or available in crates.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Smartly Dressed Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]}]