[{"id":49335,"name":"Sword Art Online: Hollow Realization Deluxe Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47e/47ee1ef540a6b531053db1a131915b0b.jpg","description":"In addition to the game, get the season pass and its bonuses (3 special costumes including a wedding dress)!\n2026, Sword Art: Origin, a new VRMMORPG has emerged. Kirito meets a mysterious NPC and receives a cryptic message. This game, though familiar to him, is not the same as the one he escaped years ago…\nORIGINAL STORYTELLING supervised by Reki Kawahara, creator of Sword Art Online.\nMASSIVE EXPANSIVE WORLD with a stronger sense of adventure.\nMULTIPLAYER MODE to enjoy the game with 3 other players.\nFEELS LIKE ITS MMORPG ORIGINS thanks to MMORPG-like interface, 16-character teams and fierce raid Boss battles.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"AQURIA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":23608,"name":"Dies irae ~Amantes amentes~","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2b/b2b24f5b01785c65934bfeb9f54fad0f.jpg","description":"The common part scenario can be played as a basic free of charge.\nIn order to play each heroine scenario, purchase of DLC is required separately.\nDies irae is an immensely popular Japanese visual novel.\nEver since its initial release in 2007, the game has sold over 100 thousand copies domestically, with new fans being drawn to it every passing year.\nIn 2015, a Japanese crowdfunder was conducted for an anime version of Dies irae.\nIt successfully raised over 30 million yen less than 24 hours after it began.\nThe anime is currently in-production, and scheduled to begin airing in 2017.\nOf course, there are plans to air the anime in North America as well.\nThe game contains a dark and rich atmosphere, characters with twisted personalities, poetic and sophisticated dialogue, and heart-poundingly thrilling battles.\nEvery single one of these aspects are finely-tuned.\nDies irae also has a splendid cast of voice actors, many of them legends amongst anime fans the world over.\nNaturally, many fans have also been feverishly drawn to the story and its ride of thrills.\nStory\nMay 1, 1945- Germany.On the eve of Berlin's collapse, a group of men and women carried out a certain ritual. To them, suffering defeat in the war meant nothing. If anything, the countless lives lost in the battle served as a catalyst to their sacrificial ceremony. Whether or not their attempt bore fruit ― not a soul knows. Following the war, they faded from sight, mind, and eventually into the realm of myth.\n・・・・・・・・・・・・\n61 years later ― Japan, 2006.\nRen Fujii, a young man attending high school in Suwahara City, finds his friendship with his old buddy Shirou Yusa shatter to pieces following a certain incident, ending in a vicious fight that sees Ren hospitalized for two months.\nThe season shifts from autumn to winter ― to the dawning weeks of December, with Christmas on the horizon. Having lost his best friend, Ren leaves the hospital with the intention to rebuild his new life without Shirou.\nBut even that plan soon falls apart. Irrationality that defies the realm of common sense begins to assault and devour the city. Abnormalities soon seek to destroy everything Ren holds dear before his eyes with overwhelming violence.\nHe must change, even if it means crossing the boundary between the ordinary and the extraordinary. His desires are hardly anything grand. All he wants is to return to those days of old. Back to those days filled with simple, everyday joy.\nThe battle with the Longinus Dreizehn Orden. A continuation of that war full of madness, carnage, and maledictions. What future awaits Ren at the end of his road...?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"light","platforms":[{"id":0,"name":"PC"}]},{"id":21520,"name":"Pilot Brothers 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85d/85d8667afc0a316f5efc34855c162afe.jpg","description":"Solve a particularly hairy case with Brother Chief and Brother Colleague!\nThe Pilot Brothers’ cat Arsenic has been kidnapped by Experimental Chef Sumo! Now the famed duo must track down Arsenic before he’s served with French fries. Per usual, this madcap detective adventure won’t be without its twists and turns, as the brothers must start by constructing a composite of the catnapper’s face with the help of a witness. Before long they’ll be slipping past ticket collectors at the railway station, driving a railroad handcar and chasing a train carrying Sumo and Arsenic. Help the Pilot Brothers cross the river – without a bridge – and solve numerous challenging puzzles to save Arsenic in this heart-pounding quest!\n● 9 Increasingly difficult levels to solve!\n● 2 Different characters: Brother Chief and Brother Colleague!\n● Fast-paced, arcade mini-games and loads of absurdly witty mini-games!\n● Join the famed duo in their search for the serial maniac!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"1C Wireless","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":20710,"name":"Might & Magic Heroes Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e30/e309bf000b00f0d533f684a2739fe0e5.jpg","description":"In the world of Might and Magic no hero is more powerful than their army, no weapon is mightier than a keen strategic mind, and no enemy is too difficult to overcome for heroes who join forces.\nMight & Magic® Heroes Online (MMHO) is a free-to-play MMO strategy RPG game in which you control powerful Heroes and their armies as they do battle throughout the fantasy world of Ashan.\nJoin a faction, chose your hero and select your favorite path: become an impregnable bulwark or a powerful mage with access to very old and destructive spells. But it is a long way to go and you have to deserve your hero reputation first before facing the wreckful evil in the final battle. During your journey through that handcrafted universe, you will solve a huge amount of exciting quests; you will fight dozens of fantastic creatures, you will raise and upgrade your personal army and you will command and run your own towns. Enjoy the deep and fascinating turn-based battle system, alone or with the brand-new cooperative mode – any battle in MMHO is playable with a friend! But there is much more to explore: find and complete powerful artefacts, enter with a group of people special raid provinces or compare your power and skill in duels with other players. One of the biggest, deepest and most colorful games ever made in the Might & Magic universe.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19877,"name":"Porcunipine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d4b/d4b515cd7380fbe9f82ab7bbf3a6f988.jpg","description":"Porcunipine is a couch multiplayer about balding porcupines fighting courageously for survival using their very last pointy quills.\nThe concept of the game is simple: You are a majestic and terribly violent porcunipine. You have one quill which you can shoot at your opponents. Once you shoot, you have to go and pick up that quill before you can shoot again. Your quill rebounds from walls and obstacles, and can kill you just as easily as it can kill your enemies.\nFIGHT to the death with sharp needles of pain\nCOLLECT the skulls of your fallen enemies\nJIGGLE your way around exciting arenas with unique special features\nChallenge your friends in both the frantic Arena mode and the tense Last Man Standing mode\nMake up for your lack of friends with a full multiplayer score-attack mode\nFully customisabe rounds that let you change the length and tactics of a match\nClever optional bots with human-like levels of assholeness\nFull support for the Xbox 360 controller and other popular PC gamepads\n5 different stages each with their own obstacles and graphical style, and a total of 30 arenas to battle in\nPick up and play gameplay - enjoy with even your most inept or drunk of friends","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Big Green Pillow","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19852,"name":"The Bottom of the Well","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/398/39867ec92b9b8dd53ebc3c46c61c5d9a.jpg","description":"The Bottom of the Well\nA visual novel where Alice steps into a different kind of wonderland.\nIn The Bottom of the Well, you play as Alice who has just had an unsettingly life-like dream about the end of the world. She retells her experience to her friend in a huge, branching narrative. Although a single play-through might take as little as 20 minutes, experiencing all the possible paths Alice can take through the ruins of her city will take you many hours.\nThe game is intended to be replayed several times with different permutations of Alice: try playing as a survival-minded lone-wolf, or a social butterfly, or why not attempt the difficult but rewarding romantic route? The stats you select for your Alice in the beginning of the game influences everything from small comments to major choices.\nThis is an updated, reworked and improved version of my entry to the WAG (Write A Game) Challenge arranged by IGDA's Game Writing SIG, where it placed first in the amateur category. The jury had this to say:\n- WINNER: THE BOTTOM OF THE WELL\nThe Bottom of The Well delivers an entertaining, branched story with interesting options. Alice's dream is genuinely terrifying. The conversations feel natural and appropriate. Players can randomize their character stats, but still negotiate the game with deliberate and meaningful choices. The final game stats give The Bottom of the Well immense replay value. One judge played the game several times to find the \"best\" ending!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wolfrug","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19343,"name":"Space Empires IV Deluxe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c81/c81dbbe38ea3bb21d7a061d0d09dc0b5.jpg","description":"The award-winning Space Empires IV Deluxe is the latest edition in the Space Empires series. A grand strategy title in the space 4X (explore, expand, exploit, and exterminate) genre, Space Empires has already found a place in the heart of strategy gamers everywhere.\nResearch technology, design new ships, wage war on a tactical level, put down rebellions, meet and greet new species, and much more. All the level and campaign design tools are included, allowing anyone to become a part of the expansive Space Empires Mod community.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Malfador Machinations","platforms":[{"id":0,"name":"PC"}]},{"id":18063,"name":"White Noise Online","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d7/9d71d09de0daa84eb8b13b2cf3502ed7.jpg","description":"A fully cooperative horror experience like never before!\nOn White Noise Online, a team of up to 4 investigators has to explore an area looking for clues, while avoiding being devoured by a supernatural creature. Will you be able to uncover the truth behind the mysterious events?\nThe game takes the idea of simple, accesible horror behind Slender and evolves it further to adapt it to a cooperative environemnt.\nDesigned from scratch to offer a shared horror experience, White Noise Online lets you live new situations, never seen before on a videogame. You'll need teamwork and trust on your partners to take the right choices and overcome the challenges you'll face.\nWhite Noise Online can be played solo or online, in a cooperative game for up to 4 players. It features over 15 playable characters, each one with their own perks and skills, and 6 different scenarios to explore.\nAnother interesting feature of WNO is the replay screen, where you can check the path you and your friends followed. Once the thrilling game session is over, have a laugh while seeing how you kept walking in circles!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Milkstone Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13662,"name":"DungeonUp","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7e/b7e2051802fab149658943be4210b03f.jpg","description":"DungeonUp is a dungeon crawler in which you have to make choice in every few steps.\nInspired by but different from Tower of the Sorcerer, DungeonUp is based on procedurally generated levels so you will encounter a whole new set of challenges in every re-run. This is a must-have for rogue-like and puzzle game fans.\nFeatures:\n50+ levels in 5 zones with different monsters and theme.\n10+ levels with secrets and plots.\n40+ monsters, and some are with special abilities.\nIn each zone there's a boss battle, requires you to fight with wisdom.\n40+ unique items, and some are designed with puzzles.\nOryx's 16-bit Fantasy Sprite Set.\n3 difficulty levels, designed for both casual and hardcore players.\nMaze Mode for your coffee break.\nExplore more fun from tons of Player Maps.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Clewcat Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11911,"name":"KUBOOM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c1/5c1c16536a50331c24941be34eb83c77.jpg","description":"KUBOOM - hurricane new cross-platform online 3D shooter game available on these platforms: Steam, Android, Vkontakte.\nFeatures:\n- completely cross-platform! Players from around the world and from all platforms play in one place at one time!\n- amazing graphics even on old computers!\n- hurricane battle in 3 game modes!\n- more than 15 locations to battle!\n- over 35 weapons divided into 6 classes!\n- ability to change skin as a character and weapons!\n- advanced animation!\nincredibly dynamic gameplay!\n- regular game updates!\nJoin the community KUBOOM! It will be hot!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"nobodyshot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":10086,"name":"Tactical Craft Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d1/6d1e34ceb70bcfc442c675311bf32adc.jpg","description":"Online Multiplayer Sandbox meets Tactical RPG!\nOne single huge world for all players.\nFull freedom of choice, interaction between players, hostilities and trading.\nEveryone is absolutely equal: you are what you have achieved in the world of the game.\nIn-game items can only be crafted from resources of the game world.\nSingle shared environment where everyone lives, builds, produces and battles.\nEvery action affects the world story, and you can become the part of it!\nMain features of Game:\nFully generated world to explore.\nDifferent biomes such as forest, desert, mountains and mush more.\nTwo game modes. First is real-time mode for mining, crafting, building and other peaceful activities. Second is turn-based combat mode.\nComponent system of crafting.\nAll objects in game world can be destroyed.\nOpportunity to buy up to 5 game units and development of their various skills and parameters.\nGame units can be exposed to the effects such as fracture, poisoning, bleeding etc.\nDifferent kinds of game bots for PVE: animals, zombies, bosses.\nFull interaction between players in one world.\nPrivate area with limited access to equipment and warehouses for other players.\nBuilding development.\nFarming.\nTrading.\nClans and clan areas.\nDungeons – Cellars.\nPlans for development of the project:\nMore dungeons – natural and artificial – mines, systems of caves, arenas.\nComplex chemical mixes for experiments.\nFood and hunger.\nFishing.\nRepair and modification of weapons.\nNew technologies and resources.\nNew weapons are similar to weapons of I-II World Wars.\nTransport.\nStationary weapon.\nRailroad.\nRobotics.\nThe energy system with power stations and transformers.\nNatural phenomena.\nRadioactive zone, diseases.\nGlobal events such as falling meteorites, invasion bots, challenge bosses.\nDevelopment of trade.\nSteam Achievements.\nPost, letters, notes.\nDevelopment of clans. Alliances (clan community).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crematorium of Time","platforms":[{"id":0,"name":"PC"}]},{"id":299550,"name":"Merchant of the Skies","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7dc/7dc61ba085f0919d3c086e867da0a2ea.jpg","description":"In Merchant of the Skies you're the captain of an airship! Sell items, gather resources and build your own trade empire in the clouds! Merchant of the Skies is the trading game with light base-building and tycoon elements. You start off as a captain of a small cloudship and work your way towards establishing your own trade company.Features Become a trader! Find the best trade routes and profit from them\nDiscover the world! Travel between flying isles and face different encounters\nSandbox gameplay: do what you want at your own pace\nGain experience and become more savvy when it comes to trading, then start your own goods production\nMerchant of the Skies is current in Early Access. That means that we want to rely heavily on your feedback, so suggest whatever improvements you want to see and we'll try to accommodate them as best as we can! You can find the development roadmap on Forums. If you want to get full experience - please wait for the final release.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Coldwild Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":60899,"name":"Akane","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1a/b1a5e4aaf38d85d5379e07b85d500af5.jpg","description":"Akane is an Arena Arcade-Slash where you kill your enemies with only 1 hit. The objective of the game is simple, to kill as many enemies as possible.All Features:Five different types of enemies:-Yakuza Guy: Yakuza pawn that appears all the time.\n-Tank: This enemy is the only one who it's not killed by one hit.\n-Shooter: A Yakuza shooter with cybernetic enhancements that never miss his target.\n-Charger: A ninja who abdicated his body to become a killing machine, his dash is deadly and his defense seems almost impenetrable.\n-Boss: Katsuro is Akane's Nemesis which evolves according to the number of times he is killed.\nMissions to unlock equipments.Five kinds of equipments to gear up:-Different guns.\n-Katanas with unique abilities.\n-Cigarettes that change the aesthetics of Akane special abilities.\n-Gadgets that grant small improvements in combat.\n-Boots that change the dash and the way you move on the screen.\nAkane Samurai Skills:-Dragon Slash: Akane dashes forward killing every enemy in her path.\n-Dragon Slayer: Akane kills all enemies on the screen.\nOne single Arena:-Sprites with lights and shadows.\n-Pedestrians and neon advertisements to give life to the scene.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ludic Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":58849,"name":"Starlink: Battle for Atlas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/007/00799dc4e5653924089717db90efaa42.jpg","description":"Starlink: Battle for Atlas is a space opera game set in the distant future that allows the player to explore the Atlas system.\n\n###Plot\nStarlink takes place in the Atlas star system. The protagonist is a crew member on an exploration ship. The main villain of the game is Grax, the leader of an evil organization called The Forgotten Legion. He is searching for technological artifacts left by the lost civilization of The Wardens to use for his conquests. His minions attack the main character's starship and capture its captain. The protagonist has to land on the nearest planet. From there, he or she begins a journey to gather a new team and face The Forgotten Legion. \n\n###Gameplay\nThe player assumes control over a small starship and navigates it across the Atlas system and its planets. The system is an open world free for exploration. The game features a seamless transition between outer space and planets. On each planet, the player encounters various aliens, and either fights them or recruits as allies and crew members. Starlink also includes a split-screen cooperative multiplayer mode.\n\nThe game also features a toys-to-life mechanic that allows players to unlock new ships and other features of the game by purchasing physical Starlink toys.\n\n###Characters\nStarlink: Battle for Atlas features a roster of eight playable pilots. Nintendo Switch version of the game also exclusively features Fox McCloud, the main protagonist of the Star Fox game series.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft Toronto","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":52213,"name":"Rad Rodgers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f20/f20923c07f91ef162eac0ad3827f8581.jpg","description":"The StoryRad is a rambunctious but spirited young boy who maybe plays too many video games. After dozing off at the tail end of a long night of gaming, Rad awakens to find his dusty old console has turned itself back on. Suddenly a vortex emerges and he's sucked into his TV, where he finds himself the star in his very own video game adventure.\nDusty is Rad's good-hearted but foul-mouthed, now-sentient game console. His clock speed isn't what it used to be, but what he lacks for in megahertz he makes up for with experience and attitude!\nRad & Dusty's adventure takes them through many dangerous stages of action-packed, humor-filled, hardcore platforming fun. This decaying jungle world has been infected by a fierce corruption, and it's up to the unlikely buddy-duo Rad and Dusty to save the jungle's inhabitants and restore the Elder Tree as guardian of the land.\nFeaturesWeapons: Dusty arms Rad with a variety of radical bad-ass weaponry. The Bolt Blaster has unlimited ammo, is easy to use, and more than enough firepower to get the job done. The Phoenix Cannon shoots out a fiery bird whose wingspan lights enemies ablaze as it flies by.\nSounds & Music: Composer Andrew Hulshult combined his years of musical experience (both performing and writing) with his passion for retro-style gaming to create an amazing and authentic soundtrack for the game complete with MIDI-inspired music... And synthesizers!\nThe Pixelverse: While Rad and Dusty are a great team, only Dusty can enter the electrified Pixelverse -- a dangerous spacetime-breaking region that exists behind the game world. Dusty enters the Pixelverse when necessary to repair glitches in the running game world, allowing both Rad & Dusty to continue their journey.\nClassic Easter Eggs: The game features hard-to-find collectibles in sometimes even harder-to-find classic secret rooms. Use your precision platforming skills to collect 'em all.…. And these brand new additions!This new and improved version of Rad Rodgers also include these brand new additions:\nLeaderboards: Gain Scores at the end of each level, and battle with friends to reach the top of the leaderboards.\nHats: Unlock more than 20 different hats throughout the game, and customize Rad Rodgers.\nNew Pogo Vertigo Bonus Levels: Grab a Pogo Stick, and see how far you can get in the new Pogo Vertigo vertical levels.\nNew Unlockables: Unlock behind the scenes artwork throughout the game.\nNew Pixelverse Puzzles: Pixelverses have been redesigned, and now include brand new types of Puzzles.\n5 New Levels! Fight through 3 new Pogostick Levels, and 2 massive new levels. The Rainforest Rampage, and Raging Ruins.\nMinibosses! Introducing 2 minibosses throughout the game.\n4 New Enemies! The new Spiky Jellyfish, Powerful Laserheads, and 2 new Minibosses brings new and exciting challenges to the Rad Rodgers enemy roster.\nBrand new weapon! The legendary \"Excalibat\" from Rise of the Triad, makes a return to Rad Rodgers. Become invincible and smack your way through hordes of enemies with the mighty Excalibat.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":45420,"name":"Call of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec1/ec1a24e21801b7c693153032d4f6f27c.jpg","description":"Steam Exclusive OfferEvery new player will receive an exclusive Steam starter pack for a limited time once the game is released! Containing following items:\n20.000 Gold (Premium Currency)\n2 Month High Command (Premium Account)\nFollow Call of War and add it to your Wishlist to get updates about the release!\nAbout the GameThe 2nd World War: Tank clashes, Naval battles, Air combat. In Call of War you rewrite the course of history!\nTake over the control of one of the mighty nations during the times of World War 2. Conquer provinces, forge alliances and build up your economy. Research top secret weapons of World War 2 and become the one true superpower! Intelligent alliances or ruthless expansion, wunderwaffen or mass assault? It is up to you which way you choose!\nFans of the board games like “Risk” or “Axis & Allies” will love playing Call of War. Every player can play multiple rounds at the same time to try out new strategies.\nFEATURES:\n• Up to 100 real opponents per map\n• Award-winning game mechanic\n• Units which move in real-time\n• Many different maps and scenarios\n• Historically accurate troops\n• Huge Tech tree with over 120 different units\n• Different terrain types\n• Atomic bombs and secret weapons\n• Regular updates with new content\n***IMPORTANT: Call of War is a free game and is continuously being updated and further developed. To ensure further improvements and fresh content, there is the possibility to purchase premium currency and premium account in-game.***","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bytro Labs","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":45034,"name":"The Adventurer - Episode 1: Beginning of the End","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c4/5c418b6545c22598caa4038785a24c55.jpg","description":"Imagine every time you fall asleep new adventure awaits you...\nIn episode 1, Kingdom of Bisera, all virgin girls mysteriously disappeared over night. It's your task to find & rescue them.\nAs you explore lands on your mission you will encounter various type of enemies each with his own abilities and weaknesses, you will be able to recruit old friends and new allies.\nMost hilarious NPC's in gaming history, you will enjoy many many jokes and funny quotes.\nFeatures;\n3D maps & battles\nCamera and point of view variety\nEpisodic Story\nHumor\nControls:\nMovement: Arrows\nRotate: Q,E\nZoom in/out: C,V\nCamera Angle: R,F\nChange Camera: B\nInventory: X\nAction/Use: ENTER\nPlans:\nGame will have 4 more episode's to complete the story, they will come as free DLC's for people who purchased the game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ZemunBRE","platforms":[{"id":0,"name":"PC"}]},{"id":41162,"name":"World of Warcraft: Mists of Pandaria","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb2/fb2a6a5c396ab1b7226de29e41a6ae63.jpg","description":"With Deathwing's menace ended, Warchief Garrosh Hellscream seized the opportunity to strike at the Alliance and expand the Horde's territory on Kalimdor. His assault completely obliterated the human city of Theramore, causing world-wide violence between the factions to erupt anew. A destructive naval skirmish left Alliance and Horde forces washed ashore on the fog-shrouded island of Pandaria, which had appeared in the open sea, defying modern maps and charts. As both warring factions established footholds on the resource-rich continent, they made contact with the noble pandaren, one of its most prolific peoples. This ancient race worked with the Alliance and Horde in the hopes of dispersing the Sha: dark, ephemeral beings roused from beneath Pandaria by the bloody conflict.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28140,"name":"Funimation","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b71/b7155879fbe7821bc7e86913be99cc75.jpg","description":"Subscribe to FunimationNow and take your love of anime onto the big screen with this PlayStation® app! Watch the largest collection of English-dubbed anime online featuring iconic classics and the hottest new shows of the season available in English sooner than ever.\n- Unlimited access to hundreds of English-dubbed anime shows\n- Watch HD shows, movies, OVAs, and extras completely ad-free\n- Exclusive English SimulDubs™ within weeks of their Japanese broadcast\n- Support original Japanese creators by getting your anime from an official source\nApp Features\n- Episode progress sync across devices\n- Marathoning/Auto-play next episode\n- Queue sync across devices\n- Support for PlayStation®3, PlayStation®4, and PlayStation®Vita\n1 player\nDUALSHOCK®3\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2017 Funimation Productions, LTD. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Funimation","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":21069,"name":"Living Legends: The Frozen Fear Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/472/4726d803873de362b87e7e665af2a06b.jpg","description":"Can you uncover the secrets that lay buried within the glaciers of the past? Find out in Living Legends: The Frozen Fear Collection. This incredible two pack includes the Collector's Editions of two games in the acclaimed Living Legends series: Frozen Beauty and Ice Rose. Each game includes a strategy guide, bonus materials, and, of course, plenty of thrilling hidden object adventure mystery!\nLiving Legends: Frozen Beauty\nThe Queen has chosen your sister as her successor, but are her promises too good to be true? You were only six when your mother vanished, leaving you to care for your younger sister, Elizabeth. After she receives an invitation naming her as the Queen's successor, she pleads with you to join her in her new royal life. All she has to do is pass a simple test to prove her worth. Is this too good to be true, or is your luck finally changing? There are many secrets awaiting you in the Queen's castle, but the biggest dangers lie beneath the icy mountain passes in Living Legends: Frozen Beauty, a chilling Hidden Object Adventure game.\nLiving Legends: Ice Rose\nNovelist Edward Grand has found evidence of a terrible tragedy in the city of Rosemount and sets off to investigate in Living Legends: Ice Rose! Help Edward gather information for his new book and explore the Castle of Ice Queen in this incredible Hidden Object Puzzle Adventure game. Scour the frozen landscapes and thaw out important locations as you solve an intriguing mystery in Living Legends: Ice Rose!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"4Friends Games","platforms":[{"id":0,"name":"PC"}]},{"id":18872,"name":"Interloper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/088/0880c902a6944ff7325fe92fc59957ca.jpg","description":"Interloper is an online multiplayer real-time strategy game with matches that take only 5 minutes. Instead of destroying your opponent, you win by claiming domain. By predicting your opponent's movements, you corner them to claim the entire map.\nInterloper distills RTS mechanics to their essence, bringing a focused, stripped down, fast-paced, and accessible strategy experience.\nFeatures:\n•\tFast-paced strategy that’s easy to learn, hard to master.\n•\tShort, intense matches taking no longer than 5 minutes.\n•\tCompete in online multiplayer, or against AI of various difficulties.\n•\tExtensive singleplayer content revealing the depth of the game.\n•\tView replays of other player’s matches and upload your own.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mathew Purchase","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18602,"name":"Theatre of War 2: Kursk 1943","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a38/a38d82b744abaf9881f8def8539414da.jpg","description":"Theatre of War 2: Kursk 1943, the historically accurate and detailed real-time tactical war game, welcomes military history fans to the battle which gave the Red Army the strategic initiative for the rest of the war. Assuming the role of either the Russian or German battle group commander, acting under direct orders of division commanders Ivan Chistyakov or Valter Hoernlein, players will control their troops in historical scenarios on precisely reconstructed authentic battlefields.Five days of JulyIn Theatre of War 2: Kursk 1943, you control the units of the battle group belonging to German division Grossdeutschland or the forces of the Soviet 67th Guards Rifle Division and 3rd Mechanized Corps, which participated in the defensive stage of the Kursk battle at the south face of the Kursk salient. There are two campaigns:\nFiery Salient (forces of the Soviet 6th Guards and 1st Tank Army, July 5-10, 1943)\nOperation Citadel (German division Grossdeutschland Kampfgruppe, July 5-10, 1943)\nEach campaign consists of up to 9 engagements and puts you in charge of a typical military unit from that period. Each soldier and officer is a unique personality with characteristics and skills which can change during the campaign. Careful planning and troops selection is recommended before each engagement.\nTake control over the mighty Soviet or German battle group in one of the battles which changed the history of the world\nSimulation-level visibility, ballistics and armor penetration systems. All vital vehicle systems and crew members are individually modeled\nTwo historical campaigns (up to 18 missions total) and an unlimited number of customizable engagements waiting to be created with a few mouse clicks using the built-in Mission Generator\nSophisticated AI for both enemy and your own units\nOver 60 Soviet, German and lend-leased US and British player-controllable units (not counting various infantry squads)\nUnsurpassed management of battle personnel. You can choose, assign, promote and award up to several thousand people with various characteristics. You can even rename units for easier recognition in the heat of battle\nTeam multiplayer for up to 8 players (control of key points or assault/defense) with reinforcements, artillery barrages and air strikes\nTools for creating your own missions and maps (built-in Mission Generator, wizard-like Simple Editor, full-blown Mission Editor and 3D Map Editor).","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":18553,"name":"Sentinel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9c2/9c243ee0856a7e1fbb1401593625b11b.jpg","description":"Inspired by the literature of Arthur C. Clarke and the 2D Exploration Platformers of the 90's and the 2010's, SENTINEL is a 2D exploration-based platformer that takes place in an alternate future. When a mysterious pyramid structure was discovered during the 1969 moon landing, humanity began focusing less on our planet and more on the stars. After years of research, humanity finally discovered a way to enter the strange monolith, but there was a catch: every person who entered never came back out. With volunteers dwindling, a bounty was raised to entice new explorers: $150 billion to the first person who can successfully enter and exit the pyramid.EXPLOREIn SENTINEL, you assume the role of a nameless bounty hunter. Your goal is to explore every inch of the level and try to learn what this strange pyramid really is. The game is played in one large level that features 13 unique rooms for you to explore on your journey. while this task seems tough, you'll be well equipped for your journey in your Nanite Suit.\nFIGHTWith the Nanite Suit, you'll be able to navigate the terrain of this unexplored labyrinth, and you'll be able to fight back against the many strange foes that await you. This game features five unique enemy types found across the map, and two boss encounters to really test your skill.\nGROW STRONGERAs you explore, you'll find new upgrades for your Nanite Suit that change the way the game is played. Whether it's vaulting off of enemies or blasting through the sky, you'll keep adding tools to your arsenal as you progress. Each ability you unlock allows you to explore, fight, and move in new ways.\nNobody knows what's in this thing. Nobody alive anyways. Maybe it's time you changed that. Good luck!\nSENTINEL is a playable concept piece, and thus is fairly short (Like, less than an hour short). While we currently aren't actively developing more levels for the game, we will continue to make bug fix and quality updates to this version of the game. If you'd like to show your support for the game, report a bug, make a suggestion, or just chat with the developers, please join the discord server linked on this Steam page!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Matthew Brown","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18360,"name":"Hare In The Hat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec6/ec619a8dbdeb94a2e2c05e3309e18569.jpg","description":"Fancy Point & Click cartoon adventure with puzzles and mini-games of varying difficulty. Game combines Hidden Objects and Room Escape mechanics among with traditional puzzlers like chess game and Hanoi tower.\nAction in this chapter takes place in magician's chambers, filled with puzzles, riddles, clues and hidden objects where you have to find and a way to release the Hare from captivity.\nEvery night evil magician puts the Hare to the hat. It's a prison! Would you save the poor creature?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"RunServer","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":18295,"name":"Demolition Inc.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00e/00e499a5d608397a5a3157d3f3f4dd19.jpg","description":"Full Controller SupportFree update with new features:Gamepad support (Windows only) : play the game on your TV with Big Picture Mode and a controller\nNew tutorial levels: improved learning curve for new players\nBlack Cow Market: get help when you are stuck and buy enhancements for your UFO\nNew vehicles: vehicle AI improved and new vehicle types with different behaviours\nImproved physics simulation: better performance and accuracy\nSteam Workshop\nEasy to use, all-in-one level editor with Steam Workshop integration: build and share your own levels, then challenge your friends to beat your highscores or just enjoy levelling cities. Setup your own chain reactions. Play and share your levels with the community.\nAbout the GameDemolition, Inc. is a new action strategy game: Assume the role of the daring demolition worker Mike and start a devastating chain reaction on earth. Use cool tools and weapons and expand your destructive powers!\nNavigate Mike's UFO over cities of earth and unfold complete chaos with your tools and weapons: Cars which drive into tower blocks and let them collapse, high-rises which fall onto other high-rises, and exploding cows which let whole streets of houses come tumbling down!\nDemolition, Inc. is 100% physics technology: nothing is predetermined, and nothing is pre-animated. Only you make a determination what you do and what you see! Every time you play will have a unique experience.\nKey features\t\t\t\t\t\t\tGround-breaking technology - Car and building physics are fully simulated. Everything is destructible and nothing is pre-animated. No game round is like the other.\nCombining action and strategy - Use the endless possibilities of combining your tools and weapons to make devastating chain reactions. Only this way you can manage to tear down whole cities before the army arrives!\nTools and Weapons - Use you tractor beam to take control of cars, place anti-gravity ramps to maximize damage, use the huge wrecking ball to make way. Improve your skills on the way and unlock breathtaking and crazy new tools and weapons!\nExciting levels - Three cities and 15 districts are awaiting to be demolished by you and lead to their true destination!\nCampaign mode - Fulfill your mission and destroy on city after the other. By cunning use of your tools and weapons you will turn district after district to rubble!\nRampage mode - Limitless destruction. Go mayhem with all your tools and weapons you have unlocked. The level is your playground and you experience new breathtaking scenes of destruction anew over and over again.\nOnline high scores - Compare your skills with those of your friends and the world-wide steam community. Play against the clock or try to make as many points as possible by demolishing districts in a creative way!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Zeroscale","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17846,"name":"Monster Truck Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ac/9ac9703b3834b4095d9767596d8c883c.jpg","description":"Drive and destroy your way to glory\nYour fans are calling out for destruction and you’re going to make sure they get it! Get behind the wheel of one of 30 monster trucks and put it to its limits to destroy everything in sight. Spin your wheels in competitive Drag races or send your ride leaping off jumps and smashing into other cars in Freestyle mode.\nA MONSTER GAME\nDrive 30 different monster trucks including the legendary Bigfoot through drag races that test your handling and freestyle races where destruction and stunts wow the crowds.\nREALISTIC TRUCKIN, REALISTIC DESTRUCTION\nPlay around with truck physics that cause trucks to bounce, drift, and tire slip realistically. Smash through cars to see the dynamic damage system in action and impressive graphics.\nTINKER UNDER THE HOOD\nVisit the garage and upgrade your trucks with new new engine, intake, trans, shocks, and exhaust part that radically change your ability to leap further over cars and smash through objects.\nKey FeaturesThrilling and destructive gameplay\nRealistic truck physics and a dynamic damage system\n30+ real monster trucks to choose from such as BIGFOOT ®, USA-1, Rislone, Outback Thunda, Bearfoot, Western Renegade, Black Widow and many more\nCompete on real life tracks as created by the Monster X Tour crew\nConquer Drag race, Freestyle events and Championships\nUpgrade your trucks as your competition gets harder\nEnjoy the realistic physics, graphics and handling in 16 real world arenas","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"ODD Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":17704,"name":"Monuments of Mars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f0/2f0ba4f9aa0bb4be4fd466bc82e5131e.jpg","description":"You are the last hope. Can you explore the strange Martian stuctures and reveal their secrts? Can you survive to discover what happens to the men who manned the previous missions?Features\nSurvive the Red Planet: Over 20 levels filled with otherwordly hazards and enemies.\nLive Forever: Unlimited lives - never see a Game Over screen again!\nThe Mystery of Mars: A mysterious and fascinating story.\nTotal Recall: Game saves, high-score table and keyboard configuration.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14510,"name":"Crab Dub","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c05/c0525a8944daed9b8ee27161ca53eb25.jpg","description":"More games by Anatoliy Loginovskikhhttp://store.steampowered.com/app/449440/\nhttp://store.steampowered.com/app/474820/\nAbout the Game\nDeep deep down at the bottom of the ocean is where the evil Dr. Taco reigns. His biggest dream is to conquer the entire ocean. Together with his business partner, Mr. Rhino, they sponsor a high-tech project called «Crab Dub». The project’s ultimate goal is to create an army of Cyber-Crabs that would faithfully serve Dr. Taco and help him to fulfill his evil plan. However, the underwater inhabitants very soon discover about this project. They hire Blue Cassette Player to stop Dr. Taco and his companion. Mr. Rhino decides not to wait for the «Crab Dub» project to be completed and launches the first Cyber-Crab prototype. It’s mission is to eliminate the Blue Cassette Player and anyone else who stands in Dr. Taco’s way.\nThe game contains clicker elements\nGame palette contains 20 primary colors\nAll objects in the game are animated\nFive types of weapons (blaster, submachine gun, laser, shotgun, bubble-gun)\nThree game zones: Ocean, Space and Blender\nExclusive soundtrack\nGood luck! Get ready for new adventures!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Anatoliy Loginovskikh","platforms":[{"id":0,"name":"PC"}]},{"id":5386,"name":"Astro Tripper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e43/e43ba95e19f1fa3043dd3925eb56e5c3.jpg","description":"Astro Tripper is a furious shoot-em-up experience inspired by the painful, knuckle busting video games of years gone by. An evolution of PomPom's 2001 award winning game, Space Tripper. Travel the surface of large horizontally-scrolling platforms, and pit your highly maneuverable craft against hoards of enemies eager to blow you to bits, eat you or worse.\nGameplay is simple. You are free to travel anywhere on the platform at anytime, but don’t fall off! Powerful Blue Lasers and Red Spread Lasers come equipped, so use both weapons tactically to get through tricky situations. Power up your weapons with power crystals dropped by destroyed enemies. Oh, did we mention the blasting absolutely anything that moves?\nEnemies encountered are varied. Zippy UFOS. Fat Motherships. Tanks. Choppers. Slimy Slug creatures. Alien Insects. Aztec structures brimming with electricity. And of course, Big Bosses! 14 unique levels spread over 4 diverse worlds means there’s always something new just around the corner.\nKey features:\n\nFurious retro shoot-em-up gameplay\n14 completely unique levels spread over 4 worlds\nVibrant 3D visuals and effects\nGlobal Online Leaderboards\nUnlockable Challenge Games\nAchievements\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"PomPom Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":60551,"name":"Undead Horde","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/747/74761d1f597c1409fa3af470ba2bfd0a.jpg","description":"Become a necromancer and raise the dead - Undead Horde is a necromantic action game with elements from RPG, strategy and hack'n'slash. You'll battle against the evil humans who've driven the necromancers and their undead minions into exile. You'll re-animate all kinds of creatures and build an army of up to 100 undead. You'll army follows you or attacks by itself depending on your commands.\nExplore and conquer a fantasy world filled with creatures from humans to giant scorpions\nRe-animate your slain enemies and make them part of your undead army\nEndless number of new weapons, trinkets and magical items\nLevel up and create the necromancer of your nightmares\nSell and trade your loot with various merchants\nManage shops with upgrades\nYou will channel the dark energies to re-animate the dead. The more powerful you become, the more undead you can re-animate and control. Most enemies you meet and vanquish are potential additions to your army!\nNecromancers can choose from three disciplines each time they become more powerful: Executioner, Re-Animator or Arcanist. You can stick to a discipline or make a hybrid.\nExecutioner discipline focuses on dealing damage and survivability.\nRe-Animator focuses on building the largest army.\nArcanist  focuses on casting spells and having a large manapool.\nThe world is filled with items you can use to grow your power. You can choose which items to equip and which items to sell. Items will give devastating powers and enhance your necromancer in various ways.\nUndead Horde is being developed by 10tons Ltd. Current estimated release date is late 2018. Music: “In Light Of Darkness” by Jay Man","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"10tons","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":50275,"name":"Eternal Hour: Golden Hour","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e15/e15f8e313f1c0601c525570b09841835.jpg","description":"Play through two prequels that explore the origins of Eternal Hour's storyline!\nEternal Hour: Strings of Fate invites you to play as Rin, Yasu's Aunt, eleven years before the events of Eternal Hour! You will discover more about Rin's past and how she came to live in Tokya, and how she became Yasu's guardian. You'll also experience sweet moments of gentle romance as Rin and her new friend, Megumi, slowly fall in love, even as they experience tough times together.\nEternal Hour: The Lost Date invites you to play as Yasu ten months before the events of Eternal Hour, in what seems to be just a normal day, when Yasu meets Katashi, Tamiko and Naoko for a fun trip to the beach. The day turns into a mysterious adventure after they stumble upon a magical symbol etched on the ground within a cave, and everything seems to go insane.\nPlay through both adventures, and experience the mysterious backstory behind Eternal Hour!Features:1080p HD Resolution\n~3 Hours of Gameplay\nAnimated CG Scenes\nFull English Voice Acting","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Seventh Heart Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":39038,"name":"Silent Hill: Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8b/f8b33ff2ae4ba5a100edb73b01ddf38c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Climax UK","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"}]},{"id":22953,"name":"Theme Park","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/180/180b5f6e5d8c770bbbf941b9875046b6.jpg","description":"Think you can design and build the greatest amusement park in the world? You select the site, you layout the rides. In fact, you control every aspect of running a profitable amusement park; from hiring employees, to developing new rides, to maintaining an adequate supply of soft drinks. Any mistakes, and the bustling hordes of fun-seekers will let you know. Oh, and that Merry-Go-Round in flames is a clue too.Select from dozens of rides and attractions.\nExperience fireworks, weather effects, and more!\nKeep your employees happy, or be forced into some real-time deal making.\nVisit the Bank Manager to keep an eye on your cash flow.\nCheck the park status screen to see what your visitors are thinking. You'd better build a burger stand, the little peeps are getting hungry!","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Bullfrog Productions","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"Jaguar"},{"id":0,"name":"3DO"},{"id":0,"name":"SNES"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Genesis"}]},{"id":21578,"name":"Samantha Swift and the Hidden Roses of Athena","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91e/91e1c7a5bcecda24042277de0a0fb400.jpg","description":"On a quest to recover the Scepter of Zeus for The Museum of Lost Secrets, archeologist and adventurer Samantha Swift stumbles upon one of the greatest archeological finds of all time!  Unfortunately, she also runs into greedy treasure hunter Ravena Stryker.\nAs Sam, you'll use your keen sense of observation to uncover treasures around the globe and unravel the mystery of the Roses of Athena in this hidden objects adventure game.  Together with associates Dr. Norwynn Butler and Adam Woodson, you must be cautious to guard the shield from falling into the wrong hands-Ravena and her benefactor are always watching you!\nCombines two great game modes-Hidden Object and Puzzle-Solving Adventure\nCollect artifacts and finds for The Museum of Secrets Lost\nMore than 50 exciting levels to explore!\nFind all six Roses to complete the Treasure of Athena as you travel the globe.\nHunt for tools to help you uncover Secret Items in each round.\nPiece together your finds to make even greater discoveries!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":21032,"name":"The Emptiness Deluxe Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f99/f9910403cbe42ec66f2c787c905f194f.jpg","description":"You are lost.\nYou find yourself in a house, a house unlike any you've ever seen before. You quickly realize that this is no ordinary house, but rather a mysterious structure built out of your own doubts and fears. And you are trapped.\nYou are wandering and looking for a way out, but something terrible stands in your way. You strive for light, but the darkness won't let you go. You need to pass a series of tests, a series of challenges that will test your wits, your will and even your sanity. Open the doors to break out from the dark corners of your soul. Be persistent and courageous and endure to the very end! Can you endure the dark journey into The Emptiness?\nWarning! The game is not recommended for people with an unhealthy state of mind, nervous disorders or heart disease. Experience The Emptiness and discover a psychological adventure game unlike anything you've ever seen before!Features\nA unique and thrilling psychological hidden object quest.\nA dark and brooding atmosphere that will keep you on the edge of your seat.\nLive actors and professional voiceover for the ultimate story presentation.\nMultiple ways to solve the mind-bending puzzles thrown in your path.\nTwo difficulty modes for the perfect level of challenge.\nMultiple game endings. How will your story end?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hooligans Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19968,"name":"Mind Snares: Alice's Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fc/8fcafdd10f036f0f88dddb443c04f08d.jpg","description":"Mind Snares: Alice’s Journey is a mature adventure game that blends together elements of the surreal, psychological thriller, and horror genres.\nAlice’s car breaks down and plunges into a river. The next thing she knows, she wakes up in a strange world made of her own memories, dreams and nightmares. Ruling over this bizarre dream land is the mysterious Shadow, who forces the protagonist to  face her deepest fears.\nIn order to escape this ominous, psychedelic world, Alice needs to follow an enigmatic lifeline and locate four magical totems that will allow her to rebuild a bridge back to her own reality. But this proves to be no easy task. Alice must venture deep inside her own subconscious, to face motley characters embodying  friendly as well as hostile parts of her own psyche.\nAlice solves charades and puzzle that test her intellectual prowess. She must confront the ghosts from her past, suddenly made real by the Shadow’s insidious power.\nWill our protagonist muster the strength to defeat her own demons? Or will the Shadow win?\nThe fate of Alice lies in your hands!\nFeaturesVenture through 38 surrealistic, hand-painted locations of Shadow Land!\nFace 22 mini-games and 19 hidden object scenes!\nFollow the lifeline to find  4 totems hidden throughout the game!\nMeet 8 oneiric, but larger than life, characters!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"G5 Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19583,"name":"Elven Legacy: Ranger","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6af/6af713838976319bd914a638bf919e7d.jpg","description":"The Order of Marcus, long dormant in its isolation, is expanding. The renowned ranger Cornelius, armed with his spear and trained in the arts of subterfuge, has been tasked with preparing the world of Illis for the coming of the order.\nNew Features:\nRanger Cornelius possesses a holy spear that can apply special powers to his attacks. In Elven Legacy, each unit's operation could only be performed once per turn - one move and one attack. Ranger Cornelius can now use special attributes of his sacred spear without losing his turn.  For example, he can activate a paralysing stroke and then throw the spear at the enemy. The enemy unit will not only suffer damage from the attack, but they will also be unable to move during the enemy’s turn.\n\nPlus:\n16 New Missions\n3 New Heroes\n5 Unique Artifacts\n12 New Spells\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C:InoCo","platforms":[{"id":0,"name":"PC"}]},{"id":18864,"name":"Squarelands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae4/ae43b752e50c3dc3458d9159f68a4bbe.jpg","description":"Squarelands is sandbox adventure game where you explore a randomly generated world while fighting, building and becoming stronger as you play! Mainly inspired by Terraria, Squarelands aims to provide plenty of freedom for the player.Features:\nDay/Night Cycles\nMining, Crafting and Building\nProcedural Map Generation\nFishing and Farming\nHundreds of Items and Objects\nDeath Penalties (and Optional Permadeath)\nKey Rebinding","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Oryon Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16743,"name":"Delta Force: Black Hawk Down","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfb/cfb83c71b4141850ac7189a7dd110bf1.jpg","description":"In late 1993, the United States launched dual military operations in Mogadishu Somalia. Delta Force Operatives and Army Rangers were sent in to capture Somali warlords and restore order. Experience the intense combat of Operation Restore Hope in this ground breaking first person shooter. As a Delta Force operative participate in a number of daring and intense raids against the oppressive Somali warlords in and around Mogadishu.\nFeatures\nEngage in Close Quarters Battle in a maze of city streets or snipe across the plain with Delta Force's signature long-range engagements\nOpen fire from heavy weapons mounted in Black Hawk helicopters or on Military Vehicles\nGear up with an arsenal of authentically modeled weapons used in the streets of Mogadishu\nNew AI system drives unprecedented teamwork with your fellow soldiers and enemies that skillfully hunt you down\nFight through a variety of compelling missions, each with multiple objectives\nNonstop, large-scale multiplayer action over LAN or via NovaWorld\nPowered by a new game engine optimized to showcase the latest 3D graphics and processor technology\nDeveloped with direction from Special Operations Forces advisors on realistic tactics, situations and details","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12747,"name":"Midas Gold Plus","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b5/2b5cfe0fff2975b717ebe0002efa8dd3.jpg","description":"What if you could turn everything you touch into GOLD?\nGods gave you the ability to turn everything you touch into gold. Take the opportunity to build an empire of unimaginable riches and become the first capitalist of the ancient world, an original tycoon!\nChampions are the Heroes of your Realm and it’s their duty to follow you on your adventure !\nUnlock them and take advantage of their unique abilities in 3 different modes!\nRage - Clicker\nMana - Idle\nEnergy - Hybrid\nTouch stones and they will be transmuted into gold. Build a city and upgrade it.\nManage your kingdom from your castle, prepare for war, raid Mythical Cities and let your civilization flourish.\nDead enemies, revived from the eternal oblivion and they are thirsty for blood.\nGrow your own pet to fight the dishonored enemies in blitz arena fights all around the earth and send them to the exile of the underworld.\nLevel them up to fight even more powerful and evil enemies and obtain stronger pets. Enemy’s fallout will be inevitable.\nFood, upgrades and potions will help your pet evolve and boost its' power and soul to fight in the arena and ascend in the league.\nAchieving high ranks will give a great boost to your gameplay.\nPlay the in-game events and optimize your gaming experience as well as boost your progress in the game. Grind them every day and collect all the Ancient Artifacts.\nKing Midas, honor your gift and the world is yours!\nTap tap the stone\nCollect infinite gold coins\nDonate everything to the temple and reap diamonds from the elder angels\nStudy the ancient scrolls using your knowledge and improve your kingdom\nRecruit champions\nPet battles\n3 different play styles\nRaid mythical cities and crush your enemies\nResearch unique technologies\nBuild the legendary town of Midaeum\nSetup your War Outpost and Shelter to meet enemy armies on the battlefield and doom them\nVarious events through the year\nMedieval graphics\nSteam cloud save\nBackup online save – shadow copy\nSteam trading cards\nSteam achievements\nSteam leaderboard\nSupport portal\nAre you ready to get rich with the click of a button\nMidas Gold Plus belongs to the Clicker genre and revolves around the legend of king Midas.\nIt is a fantasy game that you can play between other games' play sessions or while you are at work and want to spend 10 minutes having fun. Age is not a restriction for this game.\nMidas Gold is a fun time killer game which you will never regret downloading! Start over now!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Holyday Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]