[{"id":21754,"name":"Avernum 4","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fa/1fa78f0b24123a177ef82d67c185b13d.jpg","description":"Avernum is one of the great tales of indie gaming, an epic series of fantasy role-playing adventurers set in an enormous, subterranean nation. Avernum is a land underground, a subterranean nation full of rogues, misfits, and brigands, struggling for survival and wealth in the monster-infested darkness. Avernum 4 is the first chapter in the Great Trials Trilogy, three games that tell the tale of your land’s struggles in the face of powerful forces that seek to destroy it.\nAvernum 4 is an enormous fantasy role-playing adventure. Wander a gigantic world, full of multitudes of characters, hundreds of side quests, and traps, tricks, and treasure in every corner. Experience the life of an adventurer: the fame, the wealth, the hapless townsfolk begging you for help at every turn! This epic tale is guaranteed to give you weeks of entertainment, with an impossibly huge world that dares you to uncover all of its secrets.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"}]},{"id":21245,"name":"Geneforge 4: Rebellion","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d43/d43dccba22510d0fcbf95cb4be5ca899.jpg","description":"Geneforge 4: Rebellion is an Indie fantasy role-playing adventure, the fourth chapter of the Geneforge Saga. Once again, return to the world of the Shapers, where you will explore a vast world, choose what side you will fight for, and create and mold your own army of strange, powerful monsters.\nGeneforge 4: Rebellion features an enormous world, with over 80 areas to explore. Choose among several sides, each with its own beliefs, cities, and quests. Help the rebels or fight them. Slay your enemies or use stealth and diplomacy to outwit them. Your choices will shape the world, and there are dozens of different endings.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15231,"name":"The Dweller","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fb/7fbf39fa291ac716ba7119a466a83551.jpg","description":"\"The Dweller\" is a puzzle game where YOU ARE THE MONSTER.\nA team of archaeologists are exploring an ancient underground city. Unfortunately for them, they've awoken a monster... You play as that monster. It's your goal to get rid of all those pesky intruders invading the ruins that you call your home.\nYou are an ancient and powerful entity, however, your movement is restricted to the cave rock, so use your wits and the various boulders in the caverns to navigate the ruins, and reach and eliminate everyone in each level. Discover new mechanics as you play through the game, such as teleportation.\nAs you beat levels, you unlock notes that reveal the story of the game. Discover the fate of the archaeologists, learn of a mysterious clandestine organization, and maybe even find out your origins.\n-Scare, Crush, and Devour the archaeologists!\n-Non-linear level map\n-Deviously difficult puzzles\n-Over 50 levels\n-More than 25 story notes.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Villainous  Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11110,"name":"Guns n Zombies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d3/2d3dd1f8a4d34701aee014b2b51d3339.jpg","description":"An artificial nano-virus has wiped out humanity almost completely turning all humans into a mob of deadly mutilated zombies. Only a few people managed to survive and you are one of them!\nThe main features of the game:\n- HORDES of ZOMBIES!\n- A fresh look at a zombie apocalypse story\n- Robotized zombies infected by a nano-virus\n- Lots of enemies who are different from each other not only in their appearance but also in behavior\n- Random gameplay generation: each battle is different\n- Several protagonists each with their own specialization\n- Tons of devastating weapons and special abilities that can help you out in any sort of trouble\n- Massive turrets in addition to your arsenal\n- A thrilling plot and a long journey from an ordinary town to a place that’s hard to imagine\n- The survival mode where you can challenge yourself to stay alive in the Pandemonium and compete with other Steam players.\n- And of course a true post-apocalyptic  atmosphere!\nThis is the world after a zombie apocalypse in which the main characters have to go through many perils. It is a story about ordinary people who, when faced with danger, decided not to run away from it, but to fight back. As the story goes along, you will learn what caused the disaster and help other survivors to overcome its aftermath. You will discover how this event has affected the world. But can you reverse the outcome of the catastrophe and give the new world a chance to arise on the ruins of the old one?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Krealit","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5163,"name":"Command & Conquer: Red Alert","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e87/e87bbd9feb37b226b1b6a4f11e9492a0.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nRe-live the glory of the first Red Alert™ in the Command & Conquer™ franchise with this downloadable PS one® Classic.  Imagine an alternate history where Hitler never existed, and the USSR and Stalin rose to power and begin a full scale invasion of Europe.  Welcome to Red Alert™, comrade.  Wage World War II like never before as the Allied faction and restore freedom, or claim Europe for the glory of the Soviet Union in over 25 strategic missions.\n\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 978 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\nCommand & Conquer™ Red Alert™ © 1996, 2009 Electronic Arts Inc.  All Rights Reserved.  All other trademarks are the property of their respective owners.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"}]},{"id":4343,"name":"Magic: The Gathering - Duels of the Planeswalkers 2013","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5e2/5e27abecb45f7659d230bea5b94c300f.jpg","description":"Special EditionThe Magic: The Gathering –Duels of the Planeswalkers 2013 Special Edition includes:\nMagic: The Gathering – Duels of the Planeswalkers 2013 Full Game\nMagic 2013 Official Soundtrack\nWallpapers:  5 wallpapers; in multiple sizes.\n2nd Path of the Planeswalkers Graphic novel .PDF\n10 Foil Conversions.  Early access to foiled cards for the Ten Base game decks.\nAbout the GameFace a greater challenge with Magic: The Gathering — Duels of the Planeswalkers 2013!\nIn the latest version of this hit franchise, play with friends or the AI as you travel across fantastic planes, take on new encounters and opponents, solve challenging puzzles, and face up to three other players in the Planechase multiplayer format. After honing your skills, pit yourself against the ultimate villain of the Multiverse, the dragon Planeswalker Nicol Bolas.\nFeaturing ten customizable decks, Magic 2013 offers new features including individual records for your game play, new game items to unlock, and, for those already skilled in slinging spells, the option to choose what lands to tap when you cast your spells.\nKey features:\nBigger and better in every way: Duels of the Planeswalkers 2013 adds to the hit franchise with updated graphics and music, the latest cards and decks, and additional features, challenges, and an updated multiplayer game mode!\nMultiplayer Mayhem: In the Planechase multiplayer format, you and up to 3 other (players or AI) will face strange phenomenon as you battle across the Multiverse in an ever-shifting environment in local and online play.\nDecks using some of the latest cards: Duels of the Planeswalkers 2013 features ten distinct decks using cards from the latest Magic: The Gathering expansions, including your first chance to play with cards from the Magic 2013 Core Set before their official release. Each deck also offers 30 additional cards that can be unlocked through gameplay as well.\nChallenging Encounters: Experience encounters, a unique type of puzzle available in Duels of the Planeswalkers 2013, where your opponent plays a stacked deck that represents a particular type of Magic strategy.\nPlay Your Way: In addition to being able to modify your decks to play the way you want you will also be able to choose what lands to tap when you cast your spells.\nBuilt for all experience levels: With an expanded tutorial and deep game play, Duels of the Planeswalkers 2013 offers content for all Magic fans from “new to the game” all the way to “expert Planeswalker”.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Stainless Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":22,"name":"Farpoint","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd3/fd3ba352de494fe390dfe53d326c646a.jpg","description":"Farpoint is a riveting VR space adventure set on a hostile alien planet. On a mission to pick up scientists studying an anomaly near Jupiter, a sudden rupture nearby sends you and their station crashing onto an unknown alien world.\nSeparated from your colleagues, you must use holographic logs scattered throughout the landscape to reunite with the scientists and escape the planet. Explore and discover the secrets of the planet, blasting your way through hordes of indigenous and alien life as you keep moving to survive.\n•    Experience a full-length single player campaign as you traverse an unnerving alien world, searching for survivors and a way home.\n•    Master various weapons – from charged plasma rifles to a railgun - in the fight through packs of hostile alien life.\n•    Explore and fight together with a friend in 2 player online co-op.*\n*Active PS Plus membership required.\nVR Games may cause some players to experience motion sickness.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\nOnline Play (Optional)\nPlayStation®VR Required\nPlayStation®Camera Required\nEnhanced play with 1 PS VR Aim controller\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nPlaystation®4 system, PlayStation®VR and PlayStation®Camera are required to experience VR functionality.\n©2017 Sony Interactive Entertainment LLC. Farpoint is a trademark of Sony Interactive Entertainment LLC. Created and developed by Impulse Gear, Inc. All trademarks are the property of their respective owners. Appearance in this game does not imply sponsorship or endorsement.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Impulse Gear","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":638642,"name":"Resident Evil Code: Veronica X HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/928/92898d8a4b0c0c51166c8241305d549c.jpg","description":"A classic horror title, revived for the PlayStation®Store! It has been 3 months since the destruction of Raccoon City. Claire Redfield travels to Europe in search of her brother Chris.\r\nClaire infiltrates the Paris laboratory of Umbrella Corporation, but is captured after a heated gun fight. The captured Claire is then sent as a prisoner to the mysterious Rockfort Island, but shortly after her arrival the island is attacked by a mysterious figure!\r\nAmidst the chaos, a horde of zombies are released!\r\nCan Claire escape the horrors of the island and reunite with her brother...?","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":471019,"name":"Alba: A Wildlife Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8df/8df22025406ab798567a0d9eb4a8ea4f.jpg","description":"Alba: a Wildlife Adventure is a new tale from the creators of Monument Valley and Assemble with Care. When Alba visits her grandparents on a Mediterranean island, she is ready for a peaceful summer of wildlife exploration with her friend Ines. But when she sees an animal in danger, she realises she needs to do something about it!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ustwo games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":428960,"name":"Cyrano Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/492/492a5608057e970425c3320bb90a2cf1.jpg","description":"Moons of Madnesshttps://store.steampowered.com/app/1012840/Moons_of_Madness/\nAbout the GameSolve challenging enigmas to uncover the mysteries on board the Cyrano spaceship.\nAs the Invictus base faces eldritch horrors, the unaware relief crew aboard the Cyrano spaceship begins to experience strange symptoms on its approach to Mars. As the Orochi employees get closer to the red planet and its twin moons, insanity starts creeping into their minds.\nThanks to the personal audio logs of Dr. Olivia Mason, Navigation Specialist for the Cyrano, we gain insight into the evolution of the team members’ daily tasks, struggles and state of mind while on their journey. All the while, descending into a black hole of knowledge and torment because of the hold the planet and its secrets have on the team’s sanity.\nTo live the experience and access these confidential logs, players must interact with an unknown force and feed it answers to unlock and understand Dr. Mason’s take on the events. The mysterious force’s voice and eerie reactions will guide the player to true cosmic wisdom, or infinite madness...\n\n\nA game that learns your fears and may offer you a prize in return.\nBorn from an Alternate Reality Game experiment in Google AI, Cyrano Story is a short and complex puzzle game created by Alice & Smith which reveals insight into the backstory of Funcom’s cosmic horror game, Moons of Madness.\nThis permanent ARG will require you to research images and clues online, and test your knowledge of historical culture to find relevant information and keywords to progress. Everyone who completes the final puzzle will have a random chance of receiving a free Steam key for Moons of Madness.\nOriginally created as a transmedia campaign to promote the release of Moons of Madness, featuring a live event in Berlin and interactive online community events, the game has since been enhanced with more puzzles and new content to replace the live elements. For hints and help, reach out to the Cyrano Story community on Discord or visit the Game Detectives walkthrough of the original ARG.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Funcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":392250,"name":"KartRider: Drift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be8/be8b872c00c25b32d359427c436636da.jpg","description":"Welcome to the newest free-to-play title in the popular multiplayer racing franchise with over 300 million players! KartRider: Drift is the only free-to-play, cross-platform kart racer where arcade thrills, the fastest drift fueled skilled competition, & deep kart + character customization in stunning Unreal® Engine 4 graphics awaits you on the track.\nChallenge your friends across platforms with no barriers, no Pay Walls, & no Pay To Win elements preventing you from having a great time while topping the leaderboards. Created from the ground up for dynamic, online gameplay there’s new content being added regularly and huge content updates every Season. No Limits. All Drift.\nThis is KartRider: Drift\nExperience the newest free-to-play title in the popular franchise with over 300 million players! Discover the cross-platform multiplayer kart racer featuring high definition Unreal® Engine 4 graphics that is the most expansive, accessible, & competitive kart racing title ever!\nGrab the Wheel for Free\nRace Together Anytime & Anywhere! KartRider: Drift is easy to pick up + play across PC & Xbox with No Pay Walls. With local play split screen, & online features there’s always a way for you to play completely free with friends across the globe.\nRacing Never Looked Better\nTake control in the only kart racing game with high definition Unreal® Engine 4 graphics & full freedom to personalize your ride. Endlessly customize your character to fit your own unique personality & craft the perfect kart to cross the finish line & top the leaderboards in style.\nTake the Lead\nElevate your game through the fastest & most competitive multiplayer sprints in kart racing  - KartRider: Drift’s exclusive Speed Mode. Push yourself to the limit with Speed Mode’s precise controls, advanced drifting system, & highly skilled gameplay. With no items & no RNG, success on the track is determined by skill & mere seconds.\nKart Racing Evolved\nMore than any other kart racing title, KartRider: Drift is a living, online multiplayer game that is always adding new karts, characters, skins, tracks, & customization options at regular intervals plus huge Seasonal content drops. Keep your garage stocked & your skills sharp as the game grows over time!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"NEXON KOREA","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":353919,"name":"Granblue Fantasy: Versus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6df/6df25df71825f338195c69cd7ae07b85.jpg","description":"Venture into the skies, where glory awaits!\r\n\r\nA brand new fighting game from the developers of Guilty Gear and BlazBlue, set in the world of Japan's megahit RPG, Granblue Fantasy.\r\n\r\nFeaturing original gameplay tailor-made to appeal to both Granblue and fighting game fans alike!\r\n\r\nA new era of fighting games is born!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Arc System Works","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":63549,"name":"Fortune-499","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db5/db5a7104cc596e975384f47bfd170f95.jpg","description":"Fortune-499 is a game about money and magic. You play a fortune teller working in the magical resources department of a large corporation. You engage in day-to-day office activities such as forwarding emails, attending meetings, fighting back hordes of monsters, and dealing with printer jams. With some tricky magic up your sleeve and your job on the line, it's up to you to build a future out of the hand you've been dealt.\nBattle monsters by predicting their next move.\nBuild a deck of fortunes.\nUncover a plot both magical and mundane.\nCheck your email every morning.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"AP Thomson","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21264,"name":"Geneforge 5: Overthrow","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d18/d18683e862aa53d7a9f853ecd97876b4.jpg","description":"Geneforge 5: Overthrow is an Indie fantasy role-playing adventure, the final chapter of the epic Geneforge Saga. Return to the world of the Shapers one final time. Explore a vast, war-torn world, create and mold your own army of strange, powerful monsters, and choose a side to help lead to final victory.\nGeneforge 5: Overthrow features nine character classes and an enormous world with over 80 areas to explore. Choose among five different factions, each with its own beliefs, cities, and quests. Help the rebels or fight them. Slay your enemies or use stealth and diplomacy to outwit them. Your choices will shape the world, and there are dozens of different endings. Choose for yourself how the saga will finally end.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13528,"name":"klocki","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/761/7615e72664d77164ac5d0d0938e4d7bd.jpg","description":"„klocki” is my second puzzle game after successful \"Hook\".\nIts a relaxing and minimal experience. Loaded with a lot of different puzzle mechanics.\nThank you for playing and your support!\nMaciej Targoni","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Maciej Targoni","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":3730,"name":"Shin Megami Tensei: Persona 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/052/05237236b13f321e0fd9efa984a7d7a1.jpg","description":"A rumor is going around school that by looking at a TV screen at 12:00 AM on a rainy night, the face of your soulmate will be revealed.  But is that all?  A chain of murders appears to be connected to the rumor, and you and your team of Persona users must brave the mysterious TV world before another schoolmate dies.This title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionalities may not be available.  This item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account. ©Index Corporation 2008. Produced by ATLUS. SMT, SHIN MEGAMI TENSEI, and PERSONA are registered trademarks of Index Digital Media, Inc.\r\n\r\nPlease Re-enter Text Here\r\n\r\n  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":553116,"name":"Neon Beats","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/428/428309b4d0fb1febba668e6216f7da89_KnbenZ3.jpg","description":"Beat your best scores in Neon Beats, a 2D platformer game with rhythm based levels!\nYou just entered an abstract world and embody a cube moving on a white line.\nA relaxing and catchy music starts to play along with colourful shining neon lights all around.\nYour first jump, not so difficult, is followed by a swing above sharp spikes and a slide down to the depth.\nDeeper you progress in the levels, harder the challenges become.\nQuickly, the rhythm is accelerating.\n\nYour superlanding on the ground triggers an exciting music drop, and a killing wall starts chasing you.\nThe only way to survive is to run.\nA boost makes your speed increase drastically and the finish line is only a few jumps away.\nYou dodge a first spike, get bumped over a second, and perform the perfect jump to the end.\nThe trajectory seems to be ideal, until you fall down into killing spikes... Now, you can restart. And restart again. Until you get the world record!\nIn Neon Beats, you will find:\n•\t9 different levels with its own music\n•\tRhythm based gameplay\n•\tA character with smooth and responsive controls\n•\tSimple and elegant neon ambiance\n•\tSeveral challenging level elements\n•\tHidden collectibles adding instruments to the music\n•\tA score system based on your time, collectibles and deaths","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Plug In Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":427971,"name":"Disc Room","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f88/f88d992e78f533684f1965bee823f062.jpg","description":"Are you ready to get sliced in half? The year is 2089 and a giant disc has appeared in orbit of Jupiter. Step into the oversized space suit of a brave scientist and explore this sprawling intergalactic slaughterhouse.\nAnd remember: what kills you only makes you stronger.\nDisc Room is a collaboration between Kitty Calis, Jan Willem Nijman, Terri Vellmann and Doseone.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Terri Vellmann","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":18256,"name":"Final Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/26a/26aa3cd2a147693d88e055043bdedfa3.jpg","description":"Final QuestLong ago the peaceful world of Paylea was ravaged by a fierce conflict. King Edward, the Sepcom Emperor is torn apart by envy and bitter hatred. He waged war and battled to decide the fate of the world.\nRalph and his team, a band of mercenaries were once quest hunters. Now they seek out the magical gem and those who are trained to use it, in the hope that they can turn the tides of war.\nA time of change is coming. One small boy, the last of a long line of Gem Warriors, will soon discover the true power of his heritage. In so doing, he will embark upon a Final quest to free the people and to find his long lost father.Features Travel across a huge world - enjoy a deep and engaging story.\nA real time day/night system.\nSelect your party members.\nChange your job class.\nDo battle with a variety of enemies in the fast paced ATB battle system.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RPG Video","platforms":[{"id":0,"name":"PC"}]},{"id":16025,"name":"eden*","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a45/a45c425e4830965c42f59716c413617f.jpg","description":"The final love story on a dying planet.\nIn the near future, an ominous red star suddenly appears in the sky. Its presence is about to bring about the extinction of all life on Earth. The unified government proposes an evacuation project to take all of mankind into space, but in order to make the seemingly impossible project a reality, 'felixes' are brought into the world. Engineered to be highly intelligent with perpetual youth and longevity, the genetically modified superhuman felixes stand as humanity's only hope for survival.\nSion, the most gifted of the felixes, has been kept in a research facility built on a solitary island for the past hundred years. Her sole purpose, saving all of humanity. Ryou Haruna, a soldier from the Earth's unified government is sent to watch over Sion, who desperately seeks freedom from the military that's imprisoning her. Earth's last love story is about to begin.\n----\nA tale of the planet's final love story told using the full force of minori's critically acclaimed illustrative style, engaging musical compositions, and the highly talented staff that has led fans coming back for more every single time!\nEden tosses aside the traditional sprite and talking heads conventions used by many visual novels and instead employs a far more cinematic approach consisting of almost all event illustrations. Told using a widescreen resolution of 1024 x 640, eden promises a play-experience more akin to enjoying a movie than reading a book. We hope that this new approach to the visual novel medium provides a much more enjoyable experience for everyone.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Key","platforms":[{"id":0,"name":"PC"}]},{"id":15997,"name":"Scania Truck Driving Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c1/1c15df97ccbbf47e08cf39990f7fba9a.jpg","description":"Get behind the wheel of one of the most iconic trucks on the road with this highly detailed Scania R-series truck simulation by SCS Software, developers of Euro Truck Simulator 2.\nProve your truck skills - Put your driving skills to the ultimate test with 10 individual truck maneuvering challenges that serve as a practical exam as you strive to gain your driving licence. Complete intricately designed courses and tasks, in realistic environments that put you firmly into the driver's seat.\nCan you avoid obstacles whilst reversing a trailer?\nDo you have the lateral thinking required to find your way through a complex obstacle track?\nCan you park with precision?\nCompete - Once you have mastered the basics and gained your licence, compete against the best as you take part in a dozen disciplines inspired by the Young European Truck Driver competition - the virtual re-creation of Scania Driver Competition events. Learn the tricks to navigate your truck with centimetre precision!\nDrive of your life - If that is not enough, experience the drive of your life, with a series of over a dozen ultimate challenges that put man and machine to the test. From mountain roads, to bad weather, to blocked routes, you will need to work in perfect harmony with your Scania truck to reach your destination safely.\nFreeform missions - Drive through in a series of freeform missions, that has you delivering the goods around a huge, intricately detailed 3D city. Pick the loads that appeal to you as you ferry freight with complete freedom!\nLearn more about Scania - Take the opportunity to learn more about the world leading Scania trucks with a unique opportunity for a virtual visit to Scania's own Demo Centre - the very place where Scania shows off its vehicles to VIP guests!\nOnline leaderboards - Upload your high scores and download the best result charts to see how you rank against the experts. Study the techniques used by the masters in downloadable re-plays that both teach and inspire virtual Scania drivers!\nVirtual truck gallery - When you want to take a short break from the wheel, what better than a visit to the virtual gallery. A must-have for any Scania truck fan: feast your eyes on a vast gallery of Scania vehicles photos and videos. Check out highlights from previous seasons' Young European Truck Driver competitions to whet your appetite as you strive to match the performances of the true masters of trucking.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SCS Software","platforms":[{"id":0,"name":"PC"}]},{"id":8760,"name":"Star Crusade CCG","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/018/018aab2c38960f2064c01edd745d2880.jpeg","description":"War is coming. Dive into fast-paced, strategic battles with countless unique card and deck combinations. Build your deck, forge your destiny and shape the fate of the Galaxy!\nAs the galaxy crumbles, whose side will you take?\nChoose your allegiance from six unique factions:\n* The Shan'Ti, who shape genetics into living weapons\n* The cybernetically augmented Hierarchy and their rigid, cold order\n* The psychically gifted Annunaki, who are worshipped as gods by their zealous followers\n* The insidious Consortium, who focus on intrigue and vicious mercenary armies\n* The brutal, adaptive Hajir-Gog, whose endless tide represents a scourge to galactic civilization\n* The fearless, battle-hardened Terrans, with their massive weapons of war\nStar Crusade™ CCG Features:\nUNLIMITED STRATEGY:\n- Customize the size of your deck for the best odds\n- Personalize your starting strength\n- Choose a commander and unleash powerful, unique abilities\n- Craft a killer deck from 400+ available cards\nEASY TO PLAY, HARD TO MASTER:\n- Play immediately and practice your strategies in Casual mode\n- Conquer the Galaxy in Raid mode\n- Hone your skills in the competitive multiplayer Ranked mode\nVARIED AND CHALLENGING MISSIONS:\n- Embark on intense tactical missions across the sector\n- Take on new events that bring life to the game world and flesh out your experience\n- Earn rewards for your victories\nPLAY ANYWHERE:\n- Fully cross-platform, real-time gameplay\n- Bring your card collection with you from iOS to PC and vice versa\nRICH SCI-FI UNIVERSE:\n- Take command of one of the six factions vying for supremacy in an unclaimed exotic sector of space\n- Discover the history of Star Crusade through beautiful, hand-drawn illustrations\n- Learn more about the deep and complex universe through lore and events hidden throughout the game\nCOMMUNITY POWERED:\n- Experience thoughtful gameplay from a passionate team of CCG players\n- Join a community-centered, ever-evolving game world centered on interesting player choices\n- Submit your ideas, feedback or suggestions – we’re always glad to hear from you!\nExperience the ultimate tactical CCG, with millions of possible card combinations and a rich universe of lore to uncover.\nDownload now and join the Star Crusade!\nThis game requires an Internet connection and 1.6 GB of space on your device to play.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ZiMAD","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":605610,"name":"Just Act Natural","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/047/047c11e0cc0c3b092295f38761365764.jpg","description":"Heads up: This game is online multiplayer only. As I am just a humble Indie, it is likely that, at the moment, you’ll have to set up games with your friends or on our welcoming Discord server(where you can also contribute to the game’s development!). Join the discord here:https://discord.gg/YpGWCbDfyX\nJust Act Natural is an asymmetric online multiplayer party game where one group of players hide among a crowd of NPCs doing various tasks while other players seek them out from above.\nPlay online with up to eight players!\nThe game features a hand-sculpted clay art style using hundreds of clay models that are scanned and imported virtually.\nGame Features:\n> Asymmetric online multiplayer for up to eight players\n> 4 unique hand-made stages to choose from\n>Various Items for both roles to use to their advantage\n> Original soundtrack","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Conor Garity","platforms":[{"id":0,"name":"PC"}]},{"id":52312,"name":"Luigi's Mansion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/815/815c297ed2985f8818d07dc7924d8fc8.jpg","description":"Luigi's Mansion is a 2001 action-adventure game developed and published by Nintendo for the GameCube. The game was a launch title for the GameCube and is the first game in the Mario franchise to be released for the console, launched in Japan on September 14, 2001, in North America on November 18, 2001, and in Europe on May 3, 2002. It is the second title in the franchise in which Luigi is the main character, instead of Mario, with players controlling him as he explores a haunted mansion, searching for Mario and dealing with ghosts that lie within its rooms by capturing them through a special device supplied by Professor E. Gadd.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"GameCube"}]},{"id":50744,"name":"Unavowed","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/75f/75fe2c0e03a03d703c97ee238725bd5d.jpg","description":"A demon possessed you one year ago. Since that day, you unwillingly tore a trail of bloodshed through New York City. Your salvation comes in the form of the Unavowed – an ancient society dedicated to stopping evil.\nYou are free, but your world is in tatters. You have no home, no friends, and are wanted by the police. Your old life is gone, but perhaps you can start a new one. Join the ranks of the Unavowed, and fight against the oncoming darkness.\nFeatures:\nChoose a male or female protagonist\nThree playable origin stories\nBranching storyline\nA total of four companion characters to choose from, each with their own talents and abilities.\nTwice the resolution of a typical Wadjet Eye Game!\nAll the usual guff – voice acting, commentary, original music, etc","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":50338,"name":"Survived By","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50e/50ef6d315fa6f0a035a4ce421d226674.jpg","description":"Survived By is a free-to-play MMO bullet-hell game where permadeath is just the beginning. Every time you die, you’re survived by a new descendant who carries a small part of your legacy with them.\nTeam up with hundreds of survivors as you shoot your way through hordes of Chimera, explore dungeons, collect loot, craft gear and of course… die. Again, and again. Who will you be survived by…?\nSign up on the Survived By website and get into the action.\nKey FeaturesMassively-multiplayer, online bullet hell with permadeath – Team up with hundreds of survivors, as you dodge bullets and slaughter hordes of Chimera on your journey to level up and craft the best gear and weapons. Be careful though, once you die… it’s almost game over.\nPermadeath is just the beginning – Every time you die you’re survived by a new descendant, who carries a small part of your legacy with them. These legacies provide new buffs, stat boosts, and special abilities. Play as different survivors to collect them all and make your way to defeat the hardest dungeons and bosses of the Heartland.\nGorgeous pixel art set in a mysterious, war-struck fantasy world – Explore Heartland in all its pixelated glory. Discover the secrets behind the mysterious yellow resin that has overtaken the land and the Chimera that have pushed humanity to the brink of extinction.\nUpdated frequently and built with the community – We will be constantly talking to you and your fellow players to build Survived By into the game you want it to be.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Human Head Studios","platforms":[{"id":0,"name":"PC"}]},{"id":23474,"name":"Planet Ancyra Chronicles","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/781/7818d46c8ce8a76d4cbb29a27a3e8b18.jpg","description":"Planet Ancyra – a planet too far and the graveyard of a humanity that became lost in the depths space.  A planet where the human mind became overwhelmed by fears of conspiracy, betrayal, and madness.\nCompleting the stories first laid out in ‘Solarix’ and ‘DeVoid’, the previous releases from indie studio Pulsetense Games, players experience one of the greatest sci-fi stories ever written. Dive into the psychotic mind of engineer, Walter Terrace (from Solarix) and Elizabeth Woolgather (DeVoid) who was sent to discover the disappearance of the Solarix crew. As the game evolves, unravel the mysterious events surrounding the Planet Ancyra interstellar research base, investigate the enigmas discovered and tie up clues about the lives of colony workers.\nGame-play features :\n* SCI-FI themed first-person adventure game with over 20,000 words of text to explore plus over 2 hours of audio recordings.\n* A vast story-based exploration game set across highly detailed space stations, alien forests, deserts, colony settlements and military installations.\n* Decipher the crews video, audio and text logs to discover and uncover a multi-layered background story.\n* Steam Achievements, Trading Cards and Controller support.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Pulsetense Games","platforms":[{"id":0,"name":"PC"}]},{"id":19761,"name":"Game Character Hub","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16f/16f52b2dad6397254d7f73f7ef313174.jpg","description":"Game Character Hub is the ultimate program for creating and editing 2D game assets. It provides a built-in generator for character and tileset creation. While the program was made to be compatible with RPG Maker XP, VX and VX Ace, the elements found in the program should work with other 2D game engines as well. RPG Maker assets are for RPG Maker use only.Key Features\nWith Game Character Hub, you can easily create characters by choosing generator parts provided in the program. Simply select a template, add items and you're done! You can also create your own custom templates and parts. Note that almost the same logic applies to tilesets, so it doesn't necessarily need to be characters!\nWith Game Character Hub's flexible layering, you can easily customize parts according to your needs; such as changing the opacity, renaming, merging and deleting parts to name a few.\nGame Character Hub's Preview window lets you see whats going on without having to stop what you're doing! You can pause the animation and change different settings such as the animation speed, background color and even zoom! You can also set custom animation previews with the Animation Management feature. Useful if you want to see if your Autotiles or Behaviour poses seamlessly transition to one another!\nWith Game Character Hub's palette editor, it's easier for you to create your own palettes and change values. What's more is that you can generate palette colors from all visible layers or specific ones. Great for finding the colors you need!\nTired of manually merging tile sheets on your own? Game Character Hub has a built in tileset merger to save you the work!\nGame Character Hub allows you to easily convert your character assets for different RPG Maker engines.Other Features Include...\nFlexible GUI Layout - Change the layout of the program to your liking!\nExpansive History Window - Easily undo and redo artwork at any point in time during development.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sebastien Bini","platforms":[{"id":0,"name":"PC"}]},{"id":13689,"name":"Jigoku Kisetsukan: Sense of the Seasons","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fb/7fbbe0182a6224de908c4df1da79b1e2.jpg","description":"Jigoku Kisetsukan is a vertical scrolling shoot 'em up of the bullet hell genre with anime-style drawings and chip music.\nThe game features 6 playable characters with different play style, 5 stages and 4 levels of difficulty.\nEach character has a slightly different storyline and a unique final boss fight.Keyboard ControlsZ: Shoot / Confirm\nX : Special attack / Back / Skip dialogue\nShift : Focus mode\nArrow keys : Movement\nF5 or Alt+Enter : Toggle fullscreen\nF6 : Toggle V-sync\nF12 : Take a screenshot\nESC : Menu / Skip dialogueGamepad ControlsA : Shoot / Confirm\nB : Special Attack / Back / Skip Dialogue\nLB : Focus Mode\nStart : PauseDocumentsReadme : Mechanics explanation, music credits and more.\nCharacter book : Illustrations and background of the characters.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Emad","platforms":[{"id":0,"name":"PC"}]},{"id":324,"name":"Psychonauts In The Rhombus Of Ruin","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/97e/97e803f50c87271466ffebe8585de458.jpg","description":"**Note: This game is a VR-only experience and requires a VIVE or Oculus headset**\nOnce again players will assume the role of Raz, an intrepid young psychic and now fully fledged member of the Psychonauts — an elite group of international psychic secret agents!\nThe story picks up exactly where it left off at the end of Psychonauts (2005)—with Raz, Lili, Sasha, Milla, and Coach Oleander flying off to rescue Truman Zannotto, the Grand Head of the Psychonauts. Their mission takes them straight into the heart of the Rhombus of Ruin—a mysterious part of the ocean as deadly as two Bermuda Triangles back to back!\nWhen the rescue party itself is kidnapped and held prisoner in the Rhombus, Raz is immobilized and must use only his psychic powers to reunite his friends, reveal the identity of the kidnapper, and free Truman before the madness of the Rhombus consumes all their minds.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":17532,"name":"Dusty Revenge:Co-Op Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/441/4413b90654e7141ee61589ede3a37201.jpg","description":"Revenge will consume you, but redemption will push you to your breaking point.\nPlay as Dusty, a multi- weapon wielding warrior ready to face loads of outlawed criminals, dangerous creatures and the ruthless evil villain that rules them all. Meet friends along the way with new weapons and talents, journey through lavishly drawn environments and work together to fulfil your unquenchable thirst for vengeance. Players can call upon two support characters, Rondel the artillery support who tramples enemies with his massive rocket launchers, and McCoy the sharpshooter who takes down loads of enemies stealthily with his deadly accurate rifle.FeaturesStylistic 2D action combat blended with unique support character abilities and frantic platforming.\nUnique ally system. Take on large enemy clusters with your heavy arms specialist ally or take precision kills using your sharpshooter support as you brawl your way through countless minions.\nFeaturing new local co-op mode with a new playable character, 'Kitsune'.\nUnlock new 'Boss Rush' mode and test your fighting prowess.\nStunning visuals. Dusty Revenge Co-op Edition will immerse you with 10 beautiful hand drawn environments and 8 different boss fights.\nNew Content. Dusty Revenge Co-op Edition polishes up with a new playable character, a new level, new enemies and new bosses.\nWhat others say about Dusty Revenge:\nDestructoid\n“All in all, it feels like a condensed 2D Devil May Cry 3, which is a great thing, and shows that PDDesignStudio really has a knack for designing technical action.”\n“All along the way, the art is stunning, breaking the boundaries of an indie studio and venturing into major release territory.”\nJay is Games\n“The real juicy parts of the game take a little time to kick in (why isn’t the bear with the massive gun there from the beginning?!), but once they do you’ll realize this is much more than a simple sidescrolling punchfest.”\nMash Those Buttons\n“It’s got a huge move set, simple attacks to learn, beautiful stages, great enemy and level design, and a fun, unique soundtrack. It does a lot of work to keep the game interesting and varied for its players, something very few brawlers manage to pull off effectively.”","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"PD Design Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16956,"name":"Shattered Haven","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f1/4f1337f1eb3a87a9271e22d06613da7c.jpg","description":"An Environmental Puzzle Game About Family, Grit, and Survival.\nGrays roam the land, largely in the absence of human interference.  These aren't your typical Zed -- theirs is a very different sort of apocalypse. Animals spontaneously transform into twisted, violent beings.  The earth decays, collapsing into a network of abysses.  The wilderness thickens.\nIt has been nine years since That Day when it all started.  Pockets of humanity still exist, but are ignorant of one another.  Within these isolated havens people try to live as best they can -- for even in a world so broken and dark, daily life must go on.\nDarrell and Mary Williams were able to build such a life inside a five-acre fenced yard out in the country.  They were even secure enough in their isolated compound that they had a daughter five years after the zombie-like grays appeared.\nLife carried on as normally as it could, until another refugee on the run is killed during a nearby attack. Her son is saved and taken in by the Williamses -- who do not realize that this kind action will destroy their home and threaten their entire family.  They find themselves caught in the midst of a struggle between two eldritch horrors, and the path to survival is anything but clear.Key Features Solve environmental puzzles under pressure.  Figure out how to use the tools, traps, and weapons in each level to clear all the Grays.\nNearly 100 hand-crafted levels with multiple difficulty levels ranging between casual and hardcore, developed end to end by two experienced adventure level designers.\nComplete bonus objectives for higher scores and gold markers.\nFollow the story of Darrell and Mary as they try to save their family from a new and unexpected threat through in-game storytelling and painted-style cutscenes.\nGuide different members of the Williams family through branching story paths that result in one of several endings.  Depending on your actions, the story may end very poorly, happily, or anywhere in between.\nMusic and sound by composer Pablo Vega provides a chilling atmosphere for players to experience.\nIncluded level editor:  The same editor used to make the main adventure will let you make your own levels, cutscenes, or even entire adventures.\nLocal 2-player co-op.  Using two gamepads, two players on the keyboard, or any combination of the above.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arcen Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16423,"name":"Nostradamus: The Last Prophecy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14c/14cf690b0d7c909dc8473e52ff31bebe.jpg","description":"The Spiritual. The Supernatural.  The Skeptical.  All are touched upon in Nostradamus: The Last Prophecy.  The player is immortalized as a profiler of sorts in this treasure hunt game - a brilliantly vivid historical rendition of the acclaimed quatrains of Nostradamus.\nThe adventure begins in the South of France as Salon-de-Provence, and its Royal Family fall prey to unfathomable terrors.  You play as Madeleine de Nostradame, the daughter of the famous astrologer, author and apothecary as she hunts down an assassin who uses astrology to disguise his crimes as fearsome prophecies.  But when past, present and the uncertain future collide…your more logical nature may turn superstitious.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microids","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13860,"name":"Aurion: Legacy of the Kori-Odan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ee/9ee8657dc2d2386f600e8a9bff408abb.jpg","description":"Aurion is an epic action RPG set in a wonderful African Fantasy world with a unique, open and dynamic fighting gameplay.\nEnzo Kori-Odan, the prince of Zama is a victim of a coup d'etat orchestrated by his brother in-law on the day of his coronation and wedding with Erine Evou. The royal couple is then exiled and decides to go around the world in search of allies. They will especially have to reunite Enzo’s warring legacy in order to retrieve their throne.\nBeyond retrieving their position, the dethroned Royal couple will precisely discover the geopolitical and existential dilemmas attached to their functions of King and Queen. They will have to find answers in order to secure the fate of Zama.\nAurion is at the same time a mystery and an evidence in the Auriona planet. This energy was discovered a long time ago and is manifested in various ways (battle, handicraft, etc) in daily life. Those who use it in battle are called Aurionics letting them increase their power and have access to untold fighting techniques for a short time interval.Features\nEpic and strategic Real-Time Fighting, visual evolutive Combos!\nGather your Legacy and merge the Aurions to create new ones (21 aurionical transformations can be done!)\nPowerful duels with immersive fighting dialogues\nUnique scenario & lots of powerful enemies and bosses","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playdius","platforms":[{"id":0,"name":"PC"}]},{"id":1178,"name":"1001 Spikes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/54c/54cd445862b90312271c1a8e6e0f5a31.jpg","description":"Discover the lost treasures of Ukampa in South America as Aban Hawkins searches for his estranged father, world-famous archeaologist, Jim Hawkins. The elder Hawkins mysteriously disappeared while exploring the ruins. Before his disappearance, the elder Hawkins entrusted his daughter, Tina with a map to the location of the ruins but with a grave warning that death awaits around every corner.\nAban Hawkins races into the frozen tundra of the antarctic, undiscovered temple ruins and the vast caverns of South America in search of his father and the legendary treasure rumored to lie behind the Golden Door of Poko-Mum.\nFeatures\n■ 1001 Lives to pass 100+ Levels\nDevious traps and cleverly designed levels ensure a variety of challenges that will test the limits of your skills, reflexes and patience.\n■ 4-Player Local Co-op and Versus Gameplay\nTest your platforming and treasure skills with up to 4 of your friends!\n■ Retro with style\nClassic 8-bit style chiptunes by Rushjet1 and Misoka with true-to-Famicom graphics\n■ Secret of Ukampa\nUnlock nearly two-dozen secret characters, each with vastly different gameplay and abilities\n■ Watch the Story unfold\nThe action and mystery advances through in-game cutscenes, each character with their own unique story!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nicalis","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":29176,"name":"Fallout 4 VR","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/701/701016393d9dab6ef30c17ea66ca58e6.jpg","description":"Fallout 4, the legendary post-apocalyptic adventure from Bethesda Game Studios and winner of more than 200 ‘Best Of’ awards, including the DICE and BAFTA Game of the Year, finally comes in its entirety to VR. Fallout 4 VR includes the complete core game with all-new combat, crafting, and building systems fully reimagined for virtual reality. The freedom of exploring the wasteland comes alive like never before.\nAs the sole survivor of Vault 111, you enter a world destroyed by nuclear war. Every second is a fight for survival, and every choice is yours. Only you can rebuild and determine the fate of the Wasteland. Welcome home.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21824,"name":"Avernum 5","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbd/cbd8f90a09ec4bf8e5e25a8c3d2f5d27.jpg","description":"Avernum is one of the great tales of indie gaming, an epic series of fantasy role-playing adventurers set in an enormous, subterranean nation. Avernum is a land underground, a subterranean nation full of rogues, misfits, and brigands, struggling for survival and wealth in the monster-infested darkness. Avernum 5 is the second chapter in the Great Trials Trilogy, three games that tell the tale of this land’s struggles in the face of powerful forces that seek to destroy it.\nAvernum 5 has a fascinating storyline, full of betrayal, mystery, and unexpected turns. Explore a gigantic world, with hundreds of quests, multitudes of side dungeons, and many hours of adventure. The game features clever enemies and dozens of interesting scripted encounters. Learn over 50 spells and battle disciplines. Hunt for hundreds of magical items, or find the materials to craft new, unique equipment.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"}]},{"id":19662,"name":"Sword of the Stars II: Enhanced Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71a/71a4fb1f0e7b2e4c58bdb44bffda0e2c.jpg","description":"The Enhanced Edition contains Sword of the Stars II: The Lords of Winter and the first expansion, the End of Flesh. The new expansion introduces the new playable race, the Loa. All previous DLCs containing new avatars, new combat music, alternate voices, skins, and new badges for the warships are also included.\nCustomize your own starships, amass your fleet, explore the outer reaches of the galaxy and expand your empire. Research new alien technologies and bring them into battle with  a mix of turn-based strategy and real-time skirmishes.\nNow a new Faction bursts onto the scene, a race of Artificial Intelligence who once served as slaves and now return seeking vengeance. Playing as the Loa, your Fleets will become masters of metamorphosis, shape-shifting into new forms to become the ships you need, where you need them. Durable and hardy, your colonies can be built on any rocky planet. Building an empire of silicon and steel, you will bring your former masters to their knees…or will you bring about the End of Flesh.\nKey Features\nPlay as the Loa, with over 120 new ship sections and their own unique drive system – the Neutrino Pulse Gate\nOver 25 additional technologies, including a new Cybernetic Tech Tree\n10 new weapons and attacks to use in battle\nNew ship sections for the original six Factions, including 2 new Leviathan class vessels\n2 new Independent Races to encounter, study and incorporate into your empire\nNew Random Encounters, a new Grand Menace, and new Star Maps\nNew Evacuation Mission, and Supplemental Mission system allowing players to focus on the Target or the Fleet\nAll Race DLCs: Suul’ka, Liir, Morrigi, Hiver, SolForce, Zuul and Tarka","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kerberos Productions","platforms":[{"id":0,"name":"PC"}]},{"id":17053,"name":"YOU DON'T KNOW JACK Vol. 4 The Ride","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/603/603fee953aca0ea74f3065f994ebb979.jpg","description":"Play the game that many consider to be YDKJ’s most fun offering – The Ride! Already played it? Trust us, you've forgotten everything by now.\nFor the fourth volume of the mega-award-winning CD-ROM trivia game show, the YOU DON’T KNOW JACK crew decided to throw out the YDKJ rule book and start fresh! This ain't your daddy’s YOU DON’T KNOW JACK! Suffice to say, you can take any preconceived notions you've had about the YOU DON’T KNOW JACK series and chuck ’em down an open elevator shaft because YOU DON’T KNOW JACK Volume 4 is going to take you on The Ride of your life!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":16428,"name":"Return to Mysterious Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7f/b7ff8920ae0d85717f57a228a07098de.jpg","description":"Join intrepid sailor and recent island castaway Mina as she explores the hidden secrets within the Jules Verne classic inspired Mysterious Island. Gather key articles left from the island’s previous inhabitants and combine them in unique and interesting ways to stay alive and stay hopeful for rescue. Surviving means more than living off this lush land, but also fending off the haunting resident specter and solving the islands deepest secrets!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Kheops Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]