[{"id":58798,"name":"The Quiet Man","genre":"Action","price":0.0,"description":"THE QUIET MAN™ delivers an immersive story driven cinematic action experience seamlessly blending high-production live action, realistic CG and pulse-pounding action gameplay. Unravelling within a single night, players take the role of deaf protagonist Dane as he fights his way through a “soundless” world to discover the motives behind the kidnapping of a songstress from a mysterious masked man. Embark on an adrenaline-fueled motion picture like experience which can be completed in one sitting.","imageUrl":"https://media.rawg.io/media/games/989/989f1d666c3b3442b9e144ef476267f2.jpg","releaseYear":2018,"developer":"Human Head Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":55029,"name":"Golden Axe (1989)","genre":"Action","price":0.0,"description":"Golden Axe (ゴールデンアックス, Gooruden Akkusu) is a side-scrolling, beat 'em up, hack and slash arcade video game released in 1989 by Sega for the System 16-B arcade hardware. It is the first game in the Golden Axe series.\nMakoto Uchida was the lead designer of the game, and also was responsible for the creation of Altered Beast. The game was ported to the Sega Genesis and Master System consoles, among many other systems.","imageUrl":"https://media.rawg.io/media/screenshots/cbc/cbca22c381d18a8df6e9361a33f8a899.jpg","releaseYear":1989,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"Atari ST"},{"id":0,"name":"Wii"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Genesis"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"}]},{"id":53709,"name":"Batman: The Video Game","genre":"Action","price":0.0,"description":"Batman, also known as Batman: The Video Game, is a group of platform games developed by Sunsoft for the Nintendo Entertainment System and Game Boy, loosely based on the 1989 film of the same name. Despite having the same title, each is actually a different game. The NES title is arguably the best known and contains five levels culminating in a showdown with the Joker in the bell tower of Gotham Cathedral. It was received well despite changes from the movie upon which it was based.\nSunsoft followed up the release of Batman with Batman: Return of the Joker.","imageUrl":"https://media.rawg.io/media/games/60d/60debf64816d925fa1e4baf3c795fa7a.jpg","releaseYear":1989,"developer":"SunSoft","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"NES"},{"id":0,"name":"Genesis"}]},{"id":46528,"name":"Odysseus Kosmos and his Robot Quest","genre":"Indie","price":0.0,"description":"Odysseus Kosmos and his Robot Quest it’s a traditional 2D point’n'click game with retro-pixel style graphics. It’s an adventure game, a game with heart, about space ship’s engineer Odysseus Kosmos and his service robot Barton Quest.\nDownload pilot demo episode for free (pilot episode is really shorter than any of the future five full episodes, yet it delivers a small independent story).Story\nImagine you’re a talented and funny ship’s engineer, part of the crew of a ship on a voyage to a black hole deep in outer space. Your shipmates are down on the surface of a planet where time moves far, far slower and you, along with your robot, have been waiting for years for them to return to your orbital station.\nThe situation looks pretty bleak - but never lose heart! There is a host of scientific problems to solve and experiments to conduct, an enormous ship that only you can keep in working order, and a star system dominated by a black hole that hides incalculable secrets, which turns out to affect your ship in strange and unexpected ways. Your future is full of surprises!Features:\nThis game has a soul:);\nCool retro art;\nSci-fi story of good-hearted humour;\nSpecial game mode for blind people;\nCharacter customization if you buy 2 DLCs for $40 each.","imageUrl":"https://media.rawg.io/media/screenshots/9c4/9c4039df3f50c173fffda381a6b91acb.jpg","releaseYear":2017,"developer":"HeroCraft","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":45896,"name":"Farm Manager 2018","genre":"Strategy","price":0.0,"description":"Manage your own farm in the game Farm Manager 2018! To expand your farm business, produce cheap and sell your products in high prices. Control the process of land cultivation, employ the best staff, buy the most appropriate farm equipment, raise livestock and process the harvested crops. Various camera modes allow you to enter into a strategic view as well as to look at the world through the eyes of the employee. Respond to the changing weather and seasons. Create a greenhouse to sell crops in early spring. Buy new and used, special agricultural machinery, to quickly collect and sell crops before their expiration date. Optimize costs and employ seasonal workers only at the harvest time. Accept challenges from neighbors to prove who is the best farmer in the area.\nYou do not want to cultivate typical wheat, don't you? Perhaps you would love to have an orchard with apples, strawberries or cucumbers. In the Farm Manager 2018 you can have more than 20 different crops that you can cultivate by hand or using machines, where each harvest has a precise expiry date. Before you plant your seedlings, first remember about the proper preparation of the land for cultivation. Watch your plants as they grow from green, fragile seedlings up to the state of flowering, ripening and being ready for harvest.Do not forget about watering in periods of drought. If plants are not threatened properly they become ill, lose their quality and eventually decay.\nOn the machines market you can buy both new and used agricultural machinery. You have a choice between nearly 40 machines. Remember that cheaper and previously used may quickly spoil, especially when inexperienced employee operates the machine. Before buying first agricultural machine build a garage to ensure sufficiently large parking space.\nA real farm is not just about agriculture fields. You can choose from more than 40 buildings starting from farm buildings and barns ending with manufacturing plants and factories. Has the plague on your harvest had happened to you? Maybe it is time to invest in a factory? Build a specialized factory to process what you have managed to grow. Produce juices and frozen food. You produced too much sheep's, cow's or goat's milk? Start to produce cheese or butter, unless you prefer to switch your farm for the production of meat.\nThe cultivation of plants is not enough? The Farm Manager 2018 allows for breeding animals. Starting from the smallest such as bees, rabbits or turkeys, but you can also breed goats and cows. Be sure to provide them with adequate animal feed and skilled caregivers.Take care about newly purchased animals before they begin to produce eggs or milk. Bees love buckwheat and colza, so create an apiary nearby the field with the proper plants. When the animals get sick you will need to call the vet, and if you want to breed your animals, you'll have to call the inseminator.\nChallenge with variable weather conditions such as drought or torrential rain and collect all the crops before the first frost and snow. Look out for the rainbow during a gentle rain or watch the lengthening shadows, changing sunlight and color dependent on the current season. At any time you can enter the photo mode to perform spectacular shots of your farm bathed in warm autumnal colors, or in a dark scenery during a lightning storm in the background.\nThe Farm Manager 2018 offers 3 different game modes! You have a campaign, 15 scenarios and leisure mode. The campaign will guide you through all major aspects of the game and learn how to properly manage the farm. Scenarios show how to deal with specific situations and tasks. In leisure mode you will have complete freedom of actions that will enrich your tasks and contracts. Choose your favorite game mode, and let's do it!\nIf you miss any crop, machinery or building you can always make it by yourself, by simply adding to the game and share with other players. Shared standard components allow for faster creation of the target model. The expected object parameters can be set by selecting it in a clear form.","imageUrl":"https://media.rawg.io/media/screenshots/9ec/9ec6626db847bf3f6cc2bb31cfdd219c.jpg","releaseYear":2018,"developer":"Cleversan Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":38543,"name":"World in Conflict: Soviet Assault","genre":"Strategy","price":0.0,"description":"The game that was universally hailed as Strategy Game of the Year 2007 returns with all new content! World In Conflict Soviet Assault features 6 new single missions a bevy of new weapons and even more explosive World War III action. The new missions are interspersed with the storyline of original, but now you'll go on the attack as you take control of the Soviet army in an attempt to paint the free world red.\n\nThe Soviet Assault expansion is fully compatible with your original World In Conflict save files.","imageUrl":"https://media.rawg.io/media/games/47e/47eba4f9a16a30af665b34a6ff4d2375.jpg","releaseYear":2009,"developer":"Massive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":32601,"name":"Tunnel B1","genre":"Action","price":0.0,"description":"Speed through a set of tunnels on a mission to destroy your enemy's ultimate weapon.\nYour mission is to destroy the ultimate weapon of your enemy. This involves travelling through a set of precarious tunnels in your high-tech hover-craft at breakneck speed, avoiding or destroying enemy vehicles, choppers and sentry guns. Just to add to your predicament , many sectors must be cleared before the time runs out..\nThe good news is that you can constantly upgrade your weapons - and you will need to...\nFirst published by Ocean Software in 1996, the title features a soundtrack by Chris Hülsbeck of Turrican fame.","imageUrl":"https://media.rawg.io/media/screenshots/99d/99d6424d054347a0b845aa7f87c08dff.jpg","releaseYear":1996,"developer":"Kaiko","libraryGames":null,"platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":30463,"name":"Elf","genre":"Action","price":0.0,"description":"Cornelius the Elf was living peacefully in a forest with his sweetheart Elisa. However, an evil creature known as Necrilous the Not-Very-Nice kidnapped Elisa and disappeared with her. Cornelius must embark on a perilous journey to rescue the love of his life.\nTo reach her, you must traverse enchanted woods, underground mines, jungle swamps, and snow-capped peaks, where bizarre, villainous creatures and devious puzzles will test your mettle every step of the way!\nFortunately, your magic ring can cast many spells, increasing in power as you tread deeper into the mystical lands of goons, goblins, and demons. You can even control some of the background game features, helping you get to where you think you should be. Numerous secret areas lie deep within the forest, where vital clues can aid your quest, but beware ... you own ghost may materialize to haunt you!\nElf is a platform action game with light adventure elements. Cornelius is armed with a ring that fires projectiles at enemies. During the course of the game he can collect herbs and animals (called \"pets\"), which can be traded in shops for upgrades such as stronger attacks, extra speed, magic spells, or devices such as a flying machine. In addition, certain segments require the player to communicate with NPCs populating the game world and fulfill their requests, usually by obtaining specific items for them.\nThe game keeps track of the player character's behavior, assigning the player a rating and affecting the ending scene depending on the protagonist's actions, which mainly involve killing or sparing the lives of the game's non-hostile characters. The protagonist's health is measured in hearts and lives, which can be replenished or increased. The player can save the game between stages.","imageUrl":"https://media.rawg.io/media/screenshots/7ed/7edab8e6666ea1431d44d59f7a4989a5.jpg","releaseYear":1991,"developer":"Ocean Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28499,"name":"Fuzion Frenzy 2","genre":"Action","price":0.0,"description":"Fuzion Frenzy 2 combines over 40 mini games with futuristic arcade action, custom tournaments, Xbox Live features and more to create the ultimate party game exclusively on Xbox 360. Play with your friends and family to find out who is the strongest among you.","imageUrl":"https://media.rawg.io/media/games/316/316284cf3adcbcafd0161453760d4d55.jpg","releaseYear":2007,"developer":"Microsoft","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":25087,"name":"WarioWare: Smooth Moves","genre":"Casual","price":0.0,"description":"Wario and his pals learn fun, wacky moves after discovering a strange book and a mystical device called the Form Baton. Familiar characters from the WarioWare universe will return to this installment and some new ones will appear. Players must clear fast-paced sets of microgames, changing the way they hold the Wii Remote each time.","imageUrl":"https://media.rawg.io/media/games/c60/c60a8b651af718906b1242edca8623d0.jpg","releaseYear":2007,"developer":"Intelligent Systems","libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":24883,"name":"Shrek the Third","genre":"Action","price":0.0,"description":"When the King falls ill, it’s up to Shrek® to find the true heir and\nsave Far Far Away. Journey with Shrek®, Donkey, and Puss-in-Boots on\nthis all new twisted fairy tale adventure. Along the way, meet new\nfriends, conquer bold enemies, and visit never before seen lands from\nthe movie and visit never before seen lands from the movie and beyond.\n\nDefend the kingdom of Far, Far Away against Prince Charming and his\nbumbling band of fairytale friends\n\nTravel through the epic Shrek universe in peril-filled levels like the\nAcademy Grounds, Evil Queen's Castle, Pirate Ship and more\n\nPuzzle and Platform challenges, including 3 Princess levels (players\nplay as Fiona and Sleeping Beauty)\n\nEach Character has their own special ability - Use Shrek's Ogre Power,\nFiona's Flying Kicks, Puss n' Boots' Cute Puss and more -- you'll need\nthem all to get back home to Far, Far Away","imageUrl":"https://media.rawg.io/media/screenshots/725/7250bd3762727b6c7d91a3c47811f02a.jpg","releaseYear":2007,"developer":"Amaze Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"}]},{"id":23867,"name":"Kirby's Epic Yarn","genre":"Platformer","price":0.0,"description":"Go behind the seams with Kirby in his latest adventure!\n\nKirby's first console platform game since the Nintendo 64 days\nintroduces an amazing new look based on animated yarn and a world of\ncloth and textiles. The creative approach is woven directly into the\ngame play and allows the ever-morphing Kirby to take on a variety of new\nforms. A simultaneous two player* mode will have players of all skill\nlevels enjoying this one-of-a-kind experience.\n\nThe look of the world is stunning, but it's also interactive. Pulling\non stray threads might reveal hidden areas. When Kirby literally goes\nbehind the scenes, the virtual fabric warps and bends to show his\nlocation.\n\nThanks to his versatile yarn composition, Kirby can take on a variety\nof forms both in his common actions and when he transforms into\npowerful vehicles. When Kirby dashes, he zips around as a car. In\nwater, he turns into a submarine. At times he can even transform into\na massive robotic tank, a UFO and other vehicles.\n\nTwo players can play through the entire game together.\n\nBeads and collectible items are scattered throughout the environments\nfor players to find.","imageUrl":"https://media.rawg.io/media/screenshots/cbc/cbc476a2a00b82853bc30b32d46edcab.jpg","releaseYear":2010,"developer":"Good-Feel","libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":23823,"name":"Mario Party 2","genre":"Board Games","price":0.0,"description":"Get ready to party like it's the year 2000 all over again, complete with\nfancy costumes, bags of surprises, and games galore! Mario and his\nMushroom Kingdom friends return for a brand-new round of Bowser-bashing\nboard game action. Each of your favorite characters don different themed\noutfits to take part in five fun-packed Adventure Boards: Pirate Land,\nWestern Land, Space Land, Mystery Land, and Horror Land. Then battle\nBowser on his own specific board...if you're brave enough.\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","imageUrl":"https://media.rawg.io/media/screenshots/0b6/0b6ec07c8e6f4a88c47f79190caa3d97.jpg","releaseYear":1999,"developer":"Hudson Soft","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 64"}]},{"id":23565,"name":"Utawarerumono: Mask of Deception","genre":"Adventure","price":0.0,"description":"Utawarerumono: Mask of Deception is a grand tale that will enchant the hearts and minds of players as it takes them on an incredible journey. The story begins with an amnesiac man, Haku, who is rescued by Kuon, a woman with beast-like ears and tail. With a beautiful visual novel story experience, Haku and Kuon will meet a cast of intriguing and colorful characters in the beautiful empire of Yamato. But trouble is brewing on the horizon, and the pair will find they need to join forces with their friends to fight to survive monstrous foes and dark conspiracies alike in this incredible adventure.\nUtawarerumono: Mask of Deceptions’ music breathes life into the world and the story is told in its powerful, original Japanese voice with English subtitles. Along with its VN portions, it features fast-paced SRPG combat that highlights unique combat features, such as ZOC, elemental weaknesses, precision timed Attack Chain mechanics and Final strike.\n1 player\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2017 AQUAPLUS. ©ATLUS. ©SEGA. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/8a1/8a1c80ad1bf419ffbdb8b0c210e73012.jpg","releaseYear":2017,"developer":"Aquaplus","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":22064,"name":"#monstercakes","genre":"Casual","price":0.0,"description":"Steam InventoryPlay game and receive sticker packs. Open packs and get stickers. Use stickers on the game board, trade, sell or use them in your showcases!\nAbout the GamePretty simple game combination between 2048 and match-3 settings with awesome monster cakes. Put your monster cake in the good hole and combine them together to get higher monster cake. Combine them as high as you can and be on the top of the leaderboard!\nContact e-mail: contact@palenogames.ru","imageUrl":"https://media.rawg.io/media/screenshots/384/384429987952c4a26a267089600ece4c.jpg","releaseYear":2017,"developer":"Paleno Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21838,"name":"Office Space: Idle Profits","genre":"RPG","price":0.0,"description":"Do you hate your job? So do we. Team up with the gang and take down the man in Office Space: Idle Profits!\nYou are a disgruntled employee at Initech and layoffs are imminent. You need a plan to get back at the company, big time. Team up with Peter, Samir, and Michael to install a virus in the company's mainframe that will siphon undetectable pennies out of each department and place it in your own retirement account. It’s basically the plot to Superman 3.\nEndless Gameplay!\nHundreds of upgrades and achievements to unlock as you rip off Initech! TPS reports, daily bonuses, and more!\nCollect Characters!\nCollect all your favorite characters from the movie and more. Level them up for big bonuses!\nStress Relief!\nClick furiously to relieve stress, level up, and unlock your favorite scenes from the movie!\nOffice Parties!\nCompete in regularly scheduled events to win rare items and characters!\nStart at the ground floor stealing money from Initech! As you earn more you can install viruses in each department to grow your income even faster. Collect characters to help you out by assigning them to different departments. Then you can sit back and watch the money roll in! IT and Lumbergh are sure to catch on though so you’ll have burn the building down and start over at some point (but you’ll start over with new bonuses and all your characters so you can rip off Initech even faster than ever before).\nSo fun you might even play on Saturday!\nPlease Note: Office Space: Idle Profits is a free-to-play game, but some extra game items can be purchased for real money.","imageUrl":"https://media.rawg.io/media/screenshots/5ba/5ba3346f71e3dfbb672f00eca777d684.jpeg","releaseYear":2017,"developer":"Kongregate","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":21442,"name":"Theatre Of The Absurd","genre":"Adventure","price":0.0,"description":"Scarlett Frost, specialist in the dark arts has been summoned to a luxurious and remote theatre in the snowy Italian Alps. Could it be that the infamous and diabolical Hapsburg Cube has been found and purchased by the sinister theatre proprietor, Dr. Corvis ? The cube is said to imprison a powerful and ancient Babylonian demon that would wreak hellish destruction if the cubes should break.\nIn a moment of desperate confusion the cube breaks and the demon bursts forth into the souls of the Dr. Corvis and his young Daughter Bethany. The ancient theatre in the lonely winter mountains becomes an arena of spiritual war, between the darkest forces of the underworld and the cunning and esoteric mind of Scarlett Frost.\nBut Scarlett soon finds out that the only way to fight a demon this powerful is to become possessed by one herself. Only then can she acquire a ticket to the Theatre of the Absurd.\nFeatures:\n•\tLearn several dark arts and use them against the demons. Watch as your own hand channels all of the powerful spells as you unlock puzzles and vanquish evil spirits from the theatre.\n•\tExplore the beautiful and ancient theatre crafted by an award winning design team.\n•\tCollect the Bell Artifacts needed to save the girl from the beast.\n•\tMatch wits with diabolical characters and ancient demons.\n•\tSearch the terrible labyrinth of the mysterious and timeless Theatre of the Absurd.\n•\tGlimpse the terrible past for survival clues… if you dare.\n•\tUntangle unique puzzle environments with found objects and dark cunning.\n•\tCan you coax the demon out of the little girl before it takes her soul?\n•\tHours of mind-bending, next generation hidden object adventure presented with unique  3-d effects.","imageUrl":"https://media.rawg.io/media/screenshots/acb/acb6fd236f4e952d19ced979581f2eed.jpg","releaseYear":2014,"developer":"Gogii Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20905,"name":"Arkhelom 3D","genre":"Action","price":0.0,"description":"Arkhelom 3D is a shoot-em'up inspired by classics of the genre. It combines horizontal, vertical and side-scrolling levels, over 70 enemies types (including final bosses), 24 amazing levels, online world ranking, 9 ships types with evolution levels and a lot of items to improve your lasers, missiles and droids. Also special items: \"stop time\" and \"capture enemies\". Play levels ir order you prefer  with progressive difficulty.","imageUrl":"https://media.rawg.io/media/screenshots/778/778bf847f5683611ace28685462600e3.jpg","releaseYear":2015,"developer":"DreamsSoftGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20048,"name":"Bezier","genre":"Action","price":0.0,"description":"Bezier is a dual stick blaster set inside a vast computer built deep underground. The story traces the principal's escape from this \"Noah's Ark\" gone wrong. A simple shooter on the surface, the deeper narrative pulls in his relationship between evolution and god, family and love. These themes question his motives, force him to confront what is real and lead him to salvation.\nPowered by the BezierSynth traditional rendering is renounced in favour of a fluid aesthetic guided by story elements, player interaction and the audio engine. An eighty minute soundtrack blends together orchestra, synthesizers and many ethnic instruments to drive the drama through fifteen zones. Almost one hundred different enemies, voice acting, reward based achievements and different game modes make Bezier the mindless blaster with a big heart.","imageUrl":"https://media.rawg.io/media/screenshots/a73/a739112a9db2bcdac977a2e1a5cdfebb.jpg","releaseYear":2016,"developer":"Philip Bak","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18973,"name":"Emerland Solitaire: Endless Journey","genre":"Casual","price":0.0,"description":"If you're looking for something more than just solitaire, this is the game for you. It has many different levels, different types of cards, and companions to help you through the game-all of this will turn the time you spend playing this game into a true vacation.","imageUrl":"https://media.rawg.io/media/screenshots/07a/07a95ae67ecbdc27d43f1fb5481758c1.jpg","releaseYear":2015,"developer":"Rainbow Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18198,"name":"Astroflux","genre":"Action","price":0.0,"description":"Play Astroflux - a retro styled, action packed MMO space shooter.\nYou start the game with a puny \"pew-pew\"-ship and start your journey to explore the huge Astroflux Universe. Team up with other players and take down the aggressive bosses and hordes of enemies while you search for new materials and scraps to upgrade your ship.\nAstroflux sports cozy arcade graphics paired with modern awesome particle effects. And, the soundtrack is great!\nEnjoy and fly safe!","imageUrl":"https://media.rawg.io/media/screenshots/af5/af56ad2092c5833693b82995e17f7a30.jpg","releaseYear":2016,"developer":"Fula Fisken","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16883,"name":"Heroes of Hellas 3: Athens","genre":"Strategy","price":0.0,"description":"Rebuild Athens from the ashes of its destruction and secure the help of the Heroes of Olympus as you battle an evil god!  Through addictive match three-gameplay and compelling city building interludes, you will gather gold, meet the needs of a ravaged population, and search for legendary lockets that will allow you to summon the gods and appeal to them for help.  Two years in the making, Heroes of Hellas 3 is both a spectacular epic and a highly accessible casual game.  Are you ready to meet the gods?","imageUrl":"https://media.rawg.io/media/screenshots/73c/73c2c4ef4f4db75034231877ef83b347.jpg","releaseYear":2015,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":16271,"name":"Supreme Ruler 1936","genre":"Strategy","price":0.0,"description":"Supreme Ruler The Great WarBattleGoat Studios is excited to announce that the newest release in the Supreme Ruler series is now available!  Be sure to check out Supreme Ruler The Great War on Steam: http://store.steampowered.com/app/600280/\nSupreme Ruler UltimateBe sure to also check out Supreme Ruler Ultimate on Steam: http://store.steampowered.com/app/314980/\nAbout the GameSupreme Ruler 1936 is Real Time Geo-Political/Military Strategy Game for PC (and soon Mac).  Take control of a nation in the World War II era and guide it through a significant Military Campaign, or attempt one of many Set-Piece Historical Scenarios.  Players can also customize their play experience with the Sandbox Mode and play as any Nation with their own preferred Victory Condition.\nPlay Multiple Campaigns from either the Axis or Allied perspective.\nTake Control of any Nation in Sandbox Mode and impact the outcome of the era.\nChallenge yourself with Historical Scenarios for a faster-paced gameplay experience.\nThe butterfly effect...  Influence the timeline and outcome of thousands of historical events.\nUse Diplomacy, Trade, Espionage, and Intimidation to influence the policies of other nations.\nResearch new Technologies to give your nation a significant military advantage.\nModernize your economy to support whatever social and military policies you choose.\nSophisticated Real-Time Strategic and Tactical Control of your Military Forces.\nDetailed historically-accurate armies down to the Battalion level.\nChoose your level of control.  Make all decisions or use your Cabinet Ministers to help.\nBattle the elements! Fully integrated weather model influences battlefield outcomes.\nSignificant graphic improvements to 3D terrain and Graphic User Interface\nUp to 16 players in Multiplayer over local network or Internet","imageUrl":"https://media.rawg.io/media/screenshots/2c8/2c85eb96f14f4a037fe24bd29f66f458.jpg","releaseYear":2014,"developer":"BattleGoat Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15625,"name":"Machine Learning: Episode I","genre":"Action","price":0.0,"description":"Machine Learning: Episode I is a first person arcade puzzle game built for HTC Vive. You play as an A.I. robot created in DARPA laboratory in the near future. One of the scientists is here to test your physical, perception and cognitive skills. By using the power of room-scale VR and Vive controllers, you will be solving a variety of unique puzzles.\nA highly advanced set of tools is at your disposal. You have to be quick and attentive to prove you are ready to fulfil your purpose.\nMore to come in the next episodes...\nDeveloped by Singularity Lab. We are currently looking for investors and clients.","imageUrl":"https://media.rawg.io/media/screenshots/b5f/b5f6fd322b4be21ff4009740201593ac.jpg","releaseYear":2016,"developer":"Singularity Lab","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15227,"name":"Palinurus","genre":"Desconocido","price":0.0,"description":"Palinurus is a Kinetic Visual Novel that was created in two weeks for the 2015 NaNoRenO Visual Novel Jam. One year after the initial release, we are proud to announce the Palinurus Anniversary Edition, which features new sprites, backgrounds, music, a completely redone UI, bug fixes, and more.\nA drifting traveler boards a one-man space shuttle destined for Alpha Centauri. This shuttle is piloted by Budapest, an artificial intelligence program designed to serve humanity. She is a hardworking, diligent program, just a little naïve to the ways of the universe, and intensely dedicated to her directive. But when disaster unexpectedly befalls their ship, the two of them are sent careening through uncharted space, left with dire prospects for rescue.\nStuck in a floating cockpit drifting through the empty ocean of stars, they have only each other to rely on. Between interesting discoveries both old and new, Budapest quickly develops new traits and quirks beyond her programming. As she attempts to navigate her own troubled seas, the passenger discovers that there is more to this program than previously expected.\nWatercress is an international, internet-based group of volunteer developers who work together to have fun and create interesting stories along the way.","imageUrl":"https://media.rawg.io/media/screenshots/319/31915dfb1af022d4c69f6706a793052d.jpg","releaseYear":2016,"developer":"Watercress Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14066,"name":"M.U.D. TV","genre":"Strategy","price":0.0,"description":"Always wanted to see if you can hack the day-to-day life of a TV producer? Here's your chance!\nMUD TV is your ticket to the weird wild world of television. Once you take control of your own station it's up to you to determine the line-up, hire actors and directors, produce your own shows, series and movies and to grab those lucrative advertising deals from right under your competitors' noses. Oh, and about the competition: you can either play MUD TV alone, with your friends over a network or via Internet! Go head-to-head with your opponents as you fight for market share amongst the retired and housewives, headhunt their best employees and, if that doesn't do the trick, a little sabotage should keep your enemies from getting too bored! Or, as an alternative, you can assume control of a station together with a friend and run it cooperatively.\nCreate your own crazy station and take it to the top of the ratings\nCreate your own television empire and build offices, studios, newsrooms and many other important facilities to help secure your success\nCreate your own character and guide them through your own hard-earned television empire\nProduce your own movies or secure the rights to the best of what the free market has to offer before the competition does\n","imageUrl":"https://media.rawg.io/media/screenshots/2a9/2a96cc9a1520da889ac36c98c1f189ec.jpg","releaseYear":2010,"developer":"Realmforge Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13673,"name":"Riddled Corpses","genre":"Action","price":0.0,"description":"InfoArcade game 8/16bits. we will have hordes of zombies and all kinds of monsters, all created with love pixel art.\nRiddled Corpses  have 6 stage,very different from each other, as a city or a desert.\neach scenario will have new enemies, but all related to the zombied.\nthis game is hard...\nCharactersThe game has 6 playable characters, each with their type of shooting and special ability.\nOne of the characters is new to this new version (PC).\n- jon : police chief expert fast gun , is the main hero of this adventure , has no special ability.\n- cloe : jon aide ,she uses Uzi, fast and effective , has the special ability that all that loose the walking dead will be attracted to you like a magnet.\n- liery : special guest Candy Cut game , character has the ability to duplicate gold by 2.\n- Fael : Hero of other dimension, has the special ability double life (6 lifes)\n- Erika : special guest Devils Cauldron game , this girl have all ability!\n- Nora : New Character for PC version,is a cop of the future, their abilities are amazing.\nSpecial ability\n- clock : paralyzes zombies giving more time to remove them more easily .\n- dynamite : eliminate all monsters of the screen with big explosion.\n- turret : you can put a turret to shoot all enemies on the screen, will have a short duration.\ngame modes\nArcade Mode:\ntypical arcade mode, with boss at the end of stage etc ...\nSurvival Mode:\nyou'll have to survive the hordes infinitely.\nBoth game modes will have highscore_online.\n2 players can play in arcade mode. you can play with your friend cooperatively.Gamepadxbox360, xboxone, ps3 or ps4 gamepad good work (use Ds4Tool for ps4 pads)\nIt also has graphic options using Scale2x etc to smooth pixels.","imageUrl":"https://media.rawg.io/media/screenshots/6e7/6e79e7712bc21a2d946dae946ac21170.jpg","releaseYear":2015,"developer":"Daniel Fernandez Chavez","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13212,"name":"VR Battle Grid","genre":"Action","price":0.0,"description":"Ready to sink the fleet? Step right into VR Battle Grid where you are the naval commander and the rockets are ready to launch! It's you against the machine. Do you have what it takes to win?\nHunt down six classes of hidden ships: Aircraft Carrier, Amphibious Assault, Cruiser, Littoral Combat, Destroyer, Submarine. This classic strategy game played and known the world over by many names, including battleship, battleships, sea battle, salvo, combat, wings, grid attack, ship attack, attack at sea, l'attaque (French), bataille navale (French), Морской Бой (Russian), zeeslag (Dutch), 海戦ゲーム (Japanese), okręty (Polish), and more.\nOnce you strap our your HTC Vive headset you'll definitely want to put on those headphones (or earbuds), because VR Battle Grid uses true spatial audio to create the most immersive experience. True spatial audio means that a rocket directly behind you sounds different from one directly ahead, and splashes at your feet sound different than one above you.\nThis is an early version, but it already fun to play. Your feedback is greatly appreciated. Please tell me (fredsa@gmail.com) what you like and don't like about the game, so I can make it better.","imageUrl":"https://media.rawg.io/media/screenshots/286/2869dd5e04c0994947926a4203079e8c.jpg","releaseYear":2016,"developer":"Fred Sauer","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12514,"name":"Super Helmets on Fire DX Ultra Edition Plus Alpha","genre":"Action","price":0.0,"description":"A simple construction worker with a simple objective… save the world.\nSounds quite simple, huh?\nThis might be a little difficult to achieve though.\nSuper Helmets on Fire DX is a crazy side scrolling action platformer game, with lots of nods to old school games, mixed with hardcore runner gameplay and a pinch of RPG lite elements.\nYou take control of The Worker,  a simple guy that works at a building site in a bustling megalopolis. But one day, while mining some rocks, he discovered a secret that would have better been hidden forever!\nThe Ancient Evil God, a huge sphinx with the power to destroy the world, wakes up from his eternal slumber and sends our hero into an adventure through time and space, where he will try to save all his companion workers and the world!Key features:Classic side scrolling running gameplay.\nHigh difficulty using fast reflex based gameplay. You will need to conquer the jump and crouch buttons if you want to survive.\nStory mode with escalating difficulty and bosses.\n5 worlds to visit, including The City, Egypt, The Future...\nProcedurally generated levels that will learn from your gameplay behaviour.\nRPG-lite stat based challenge mode where you can modify your favourite character.\nVarious skills that will help you during runs to get better records.\nMore than 10 characters to unlock and play with, parodying popular characters!\nEndless running Classic mode, with no character abilities. Only your skills and proficiency will help you in this mode.\nAwesome chiptune soundtrack created by Carlos Viola.\nSTEAM online leaderboards and achievements. Show your friends who is the best!\nTrading cards and badges.\nFor Windows, Mac and Linux.\nSupports controller and keyboard. Although we recommend using a controller.","imageUrl":"https://media.rawg.io/media/screenshots/c4e/c4e2152dcca8cfcc427634aa59ce640e.jpg","releaseYear":2015,"developer":"GamesBoosters","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":12452,"name":"Arsenal of Democracy: A Hearts of Iron Game","genre":"Strategy","price":0.0,"description":"Taking place from 1936-64, Arsenal of Democracy lets you play as any nation during the era of WW2, complete with detailed models for economics, diplomacy, research, and intelligence. Warfare is also fully represented with all three branches of operations: land, sea, and air. The game builds on the experience and community input of the successful Hearts of Iron titles.\nDeveloped by BL-Logic, a development studio made up of fans of the series and active members of the modding community, Arsenal of Democracy is the ultimate World War II simulation. It is described by Project Leader Lennart Berg as \"Hearts of Iron II on steroids!\"\nRewrite history as the head of any nation during World War II in a variety of single-player and multi-player scenarios\nUse advanced combat mechanics based on historical research and the work of military theorists to destroy your foes on land, sea, and air\nMaster the most detailed and flexible economic and production systems of the series\nKeep your war efforts operating smoothly with realistic logistics and trading subsystem\nEngage in espionage, intelligence, diplomacy, and global trade to give your nation a decisive edge\nDetermine your country’s national identity, social policy, and ethnic culture\nCreate your own campaigns, units, countries, minister traits, and national ideas with extensive modding capabilities\nExperience classic Hearts of Iron gameplay, improved with a fine-tuned technology tree, refined balance, advanced statistics, and polished graphics\nRemoved Province Limit: build your own maps without limitations\n","imageUrl":"https://media.rawg.io/media/screenshots/924/924bd24c2510653b6910ace32fe03532.jpeg","releaseYear":2010,"developer":"BL-Logic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12438,"name":"Ley Lines","genre":"Action","price":0.0,"description":"Ley Lines is a single-player action-adventure puzzle-solving game developed by a team of students at Florida Interactive Entertainment Academy! Thank you so much for taking the time to look at and play our game.  Overview  You are the last hope of a ruined world, capable of restoring the severed Ley Lines.\nThroughout the ruined temple of Miria's Heart, attune to and master five unique powers, allowing you to alter gravity, slow time, shift space, and much more. Unique puzzles scattered throughout the temple's remains can be overcome in a variety of ways by using and combining your world-bending abilities. Powers Gravity Well\nArrows fired while attuned to the Gravity Ley Line can produce spherical wells of potent energy.\nObjects will be drawn to the epicenter of these wells, allowing the player to unblock otherwise impassable barriers, curve the trajectory of her arrows, and even slingshot herself to new heights.Light Bridge\nArrows fired while attuned to the Bridge Ley Line can produce long platforms of hard light.\nBy striking a beginning point and an end point on receptive relics in the environment, the player can cross wide chasms and even break through brittle structures.Levitation\nArrows fired while attuned to the Levitation Ley Line can make receptive relics weightless, and movable at a distance through thought alone.\nBy arranging weightless platforms in a series, players can climb to otherwise unreachable locations through levitation alone, or use cleverly placed floating relics in combination with other ley abilities to solve puzzles in unique ways.Time Slow\nArrows fired while attuned to the Gravity Ley Line can slow objects to a fraction of their former speed.\nIn situations where slowing fast-moving relics individually is not enough, the player can also temporarily slow down all time around her.\nThe unbound and corrupted ley energy of the temple causes many objects to move rapidly and randomly. Slowing time is often the only way to bypass these dangerous obstacles.Warp\nArrows fired while attuned to the Warp Ley Line can transport receptive relics forward in an instant, even bypassing otherwise impermeable barriers.\nThe player is also capable of placing a single \"warp point\" to which she can recall at any time, even if the path behind her has been blocked.","imageUrl":"https://media.rawg.io/media/screenshots/b83/b83b177e364b4927332d2ef280979857.jpg","releaseYear":2016,"developer":"Miria Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9589,"name":"Oh My Godheads","genre":"Action","price":0.0,"description":"Oh My Godheads is a fast and frenetic multiplayer fracas in which four players swing pointy swords, sling explosive pies and celebrate the death of their foes with exuberant aplomb. Choose from a wide variety of characters, before grabbing the Godhead and bringing it back to your base - while unleashes its wrath on you and those around you.\nKEY FEATURES:\nSeven Godheads, each with its own game-changing ability to end its bearer’s life - including explosions, mind control and the ability to freeze foes.\nLocal multiplayer mayhem for up to four players allows you to fling a flurry of explosive pies at your friends as you do your very best to capture Godheads!\nSeven game-changing locations – visit the waterfalls in Japan, Italian volcanoes, Aztec pyramids and more; each with their own obstacles to overcome.\nEight curious characters are realised in beautiful low-poly stylings. Who can say no to a Penguin with a top hat, monocle & smoking pipe?\nCapture the Head sees two teams scramble to secure the Godhead and bring it to the goal before it, or someone else, clobbers them over the head.\nKing of the Head removes the goals & teams, and grants victory to whomever holds the head longest; while Headhunters sees the player with the most kills reign supreme and Last Man Standing grants victory to the last player alive.\nTrials of the Gods pose a series of short solo challenges set forth by the gods.\nA.I. Worried you don't have enough players to take the challenge? Fear not, the Gods have seen fit to grant life to strange mechanisms that fill the role of human players. Add as many A.I. companions/opponents as you need to fill in your teams.","imageUrl":"https://media.rawg.io/media/screenshots/19a/19a70aab3a2c1b9dfb8da934e0618f2d.jpg","releaseYear":2017,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":6156,"name":"RunGunJumpGun","genre":"Action","price":0.0,"description":"Special EditionThe Special Atomik Edition of RunGunJumpGun comes with the game's thumping Original Digital Soundtrack (in High-Res MP3), and a Pack of Exclusive High-Resolution Wallpapers, including Original Cover Art created by famed artist El Huervo.\nAbout the Game\nRunGunJumpGun is a tough as nails 2D Action Platformer that puts a teeth-rattling, gravity-defying weapon in your hands. With a cast of crazed characters, simple but beautifully difficult gameplay, and a pulsing musical score, RunGunJumpGun is a loud, trippy mess of twitchy platforming goodness.\nThe two-button setup is treacherously  simple. One button shoots your massive gun downwards, propelling you through the air. The other shoots forward, destroying anything that’s in your path. But there is no stopping in this beautifully surreal world littered with deadly traps and soul-crushing obstacles around every corner. Players will have to constantly alternate between the two firing modes to maneuver through meticulously crafted levels where death is a promise not a possibility. There is only running, gunning, jumping, and gunning, in a mad dash to survive long enough to die again.\nThe game takes place in the Extax System, a solar system where the Sun has begun to swell and devour planets. With most of the planets already devoured, the remaining worlds have descended into madness and superstition. Each denizen has their own theory on why the sun seems so enraged, but they all hang on one central element: Atomiks, the primary resource in the entire system.\nYou play as a scavenger, a rogue from outside the Extax System who seems to have only one goal: get Atomiks. What do the Atomiks mean to the scavenger? Does he want to scoop up precious resources for himself, or use them as a way to appease the sun and end the suffering of the system? Or Maybe they’re just shiny pick-ups in a video game to him.\nBeautifully Difficult: Every second counts, and the game will test your reflexes to the fullest\nNonstop Action: Merciful respawns let you die fast and keep you constantly in the action\nTwo button gameplay: One button lets you fly, the other blasts obstacles into heaps of rubble.\nThree Unique Game Worlds: Each world presents its own distinct challenges which require players to change their playstyles\nOver 120 levels of Mayhem: Each level is meticulously crafted to hone and test the player’s speed and tenacity.\nMarathon Mode: For players looking to compete for the global high score.\nSurreal visuals: Trippy and hyper-colourful fantasy-sci-fi art style\nHyperkinetic soundtrack: Pulsing musical score blending hip hop, electronic and movie-score vibes.\nWarped space-opera narrative: The game features a cast of crazed, beautifully illustrated characters.\nMasochistic Collectables: The quest to collect “Atomiks” littered throughout levels lends an extra level of insanity to already merciless level design. A gift to self-hating completionists.\nAccessible single-hand gameplay: Appropriate for players with disabilities.\nMade by free range developers fed a pure mixture of VVVVVV, Hotline Miami, and Super Meat Boy.","imageUrl":"https://media.rawg.io/media/screenshots/c8d/c8d962a7fede71b6bb86ec16e5f2ad4e.jpeg","releaseYear":2016,"developer":"Good Shepherd Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":3319,"name":"Aces of the Luftwaffe","genre":"Action","price":0.0,"description":"JUMP INTO ACTION AND BECOME A FIGHTER ACE YOURSELF!\nYOU have to show what you’re made of as the war over Europe is in full swing. Fight waves of Axis planes and panzers until you hit the boss enemies – the ACES OF THE LUFTWAFFE.\n✪✪✪ THE STORY ✪✪✪\nIt is the darkest hour for England. The Axis are sending their best into the Battle of Britain, and only a handful of brave pilots are left to destroy them. Get into your war plane and don’t let go of the trigger before each and every enemy has been blown out of the skies! But even if you vanquish the notorious Aces of the Luftwaffe, are you prepared to take the fight to the mainland?\nWill YOU foil the occult plans of the Luftwaffe to spread darkness over England?\nFeatures:\nFight thousands Of Enemy Air Planes\nChoose and Upgrade Your Plane and Pilot\nBeat Super tough Bosses\nFly Bombastic Missions\nEnjoy Mighty Power-ups\nThank you for playing ‘Aces of the Luftwaffe’!","imageUrl":"https://media.rawg.io/media/screenshots/0e6/0e661c4e6bd2037429607a8487cb396d.jpeg","releaseYear":2013,"developer":"Handy Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":2978,"name":"Zotrix","genre":"Action","price":0.0,"description":"Zotrix is an arcade space shooter inspired by early shooter games on arcade machines from 80's and early 90's. Designed for all generations it contains missions with nice and colorful enemies while focused on the arcade element of the gameplay.\nThis being said, this is an upfront disclaimer about a lot of repetitiveness in the gameplay as it is the case with older arcade games.\nYou dive into deep space escorting a cargo ship from your fleet. Quickly you realize you're within the boundaries of enemy territory. Chains of enemy ships are lining up one by one while you perform maneuvers to clear the perimeter and avoid being cleared out yourself. Victory doesn't come easy as you have to earn every single space credit out there fighting in over 50 missions.\nBy clearing your mission objectives, reward is coming to your account and you're ready to upgrade your ship with decoys, shields, laser boosters and much more. You can even buy a new, better fighter. As you progress, you will get engaged in trading earned resources such as cobalt, nickel, palladium and others in trading room every space station features.\nBuild your strategy by carefully choosing routes from your space station towards another and have your take in every mission. Each mission will pit a challenge in front of you and most of the missions will get you to face a bigger and badder alien ships.","imageUrl":"https://media.rawg.io/media/screenshots/ae6/ae6f82f2340f1730f877807fbb49f6e5.jpg","releaseYear":2015,"developer":"UFO Interactive Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":1795,"name":"Tallowmere","genre":"Action","price":0.0,"description":"Indulge Lady Tallowmere and see how far through her lovingly violent dungeons you can delve in this 2D indie action roguelike-inspired platformer. New rooms are procedurally generated every time you play, meaning you'll have to be on your guard for every randomly-placed enemy, elite, boss, and treasure chest you'll come across.\nEach room gets progressively bigger, harder, and more rewarding the further you go.\nThe concept is simple yet hard to master:\nRaise your shield to block enemy attacks.\nLower your shield and strike your foes when the timing is right.\nJump or move to avoid traps, or use your shield to reduce damage taken.\nFind the key to advance to the next room.\nCollect weapons, outfits, headgear, and shields of various rarities to aid your journey.\nTurn in souls from slain enemies to increase your base stats and passive abilities.\nStay alive as long as you can!\nBrace yourself as you learn the quirks of each foe, trap, and room type so you can strive for that \"one more run\" high-score victory! Each dungeon is infinite in length so it's up to you to push your limits; local scoreboards and online leaderboards let you track your greatest efforts.\nAvailable for Windows, macOS, and Linux. Play with keyboard (and optionally mouse buttons), or use your favourite gamepad/controller.\nTallowmere offers single-player and local co-op madness (up to 4 players) for fun frantic couch gaming.\nKey Features\n✓ Action roguelite platformer with randomly-generated levels, each room bigger than the last\n✓ Wreak havoc with trusty axes, hefty clubs, teleporting katanas, stealth-enabling emerald daggers, freezing ice wands, bouncing grenades, embroiling flamethrowers, and powerful rocket launchers\n✓ Find and equip outfits, headgear, shields, and more\n✓ Hunt for power with 7 tiers of item rarities ranging from Basic to Otherworldly\n✓ Learn to conquer multiple enemy types with elite variations, including fire mages, archers, leapers, conductors, ogres, flail knights, feelers, bloats, and zaeries\n✓ Satisfying combat with persistent bloodsplats and gibs\n✓ Tactical shield blocking\n✓ Infinite jumping\n✓ Deadly traps and obstacles to try and avoid, such as spinning pinwheels, acid clouds, and extremely pointy spikes\n✓ Coins, hearts, souls, and keys to collect from slain foes\n✓ Hardcore permadeath to keep your adrenaline going\n✓ Treasure chests to loot\n✓ Potions to keep you alive\n✓ Special room events and bosses to master\n✓ Passive abilities for you to gain strength and then some\n✓ Coin-loving merchants\n✓ Difficulty settings to match your pain threshold\n✓ Challenge modes\n✓ Combat/event log\n✓ Soft savegame system (so you can quit and resume later) and personal high-score system with cross-platform Steam Cloud support\n✓ Global Steam leaderboards for speedruns and bragging rights\n✓ Sacrificial kittens\n✓ Dev console for cheats\n✓ Runs on Windows, macOS, and Linux\n✓ Play single-player or local couch co-op (up to 4 players with 4 controllers sharing the same screen)\n✓ Keyboard and mouse support\n✓ Gamepad/controller support\n✓ Independent game developer\nYou're not afraid... or are you?\nTo those who will be lured into Lady Tallowmere's dungeons: good luck.\nSupported LanguagesEnglish\nFinnish (Suomi) – translated by Tomi Turkki & Olli-Samuli Lehmus\nFrench (Français) – translated by Christophe Braguy\nGerman (Deutsch) – translated by Spiffosi, sePL, & John Westfield\nItalian (Italiano) – translated by Luca Pattarini\nJapanese (日本語) – translated by Teyon Japan\nPolish (Polski) – translated by Maciej Ułanowicz\nRussian (Русский) – translated by Tycho Davidianus\nSimplified Chinese (简体中文) – translated by Kai Shao\nSpanish (Español) – translated by Jose M. Gaspar\nTurkish (Türkçe) – translated by A. Ozkal\nBonus\nBuy Tallowmere on Steam and get the Android port as a free DLC.\nNote:\n• \"Local Co-op\" means you can connect up to 4 controllers and play with your friends in the same room sharing the same screen. Network/LAN co-op is not available.","imageUrl":"https://media.rawg.io/media/screenshots/771/771384fa010d71a8b88bf97eec016603.jpg","releaseYear":2015,"developer":"Teyon","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":967340,"name":"Station to Station","genre":"Strategy","price":0.0,"description":"Join our Discord!\nAbout the GameAttention all passengers! We are thrilled to announce the highly anticipated arrival of 'Station to Station' on your PCs!\nFEATURES\nA relaxing and peaceful experience\nBeautiful, colorful voxel art\nOptional strategic gameplay to earn high scoresCONNECT THE WORLD\nIn Station to Station, your world starts small with a handful of rural structures. Place stations and create connections to foster growth and expansion. As you build more connections, your area will grow, transforming into a vibrant, lush environment full of life and color! To keep you on your toes, the game also features engaging puzzle elements, challenging you to optimize routes and solve logistical conundrums.\nADMIRE VOXEL-ART VIEWS\nHop on board and steam through colorful biomes. Breathe life into the dry desert sands, and transform the untamed mountain terrain. Build and watch your tranquil world come to life with an ever-widening tapestry of flora and fauna!\nTHRIVE\nFor those eager to put their management and planning skills to the test, each level offers optional challenges, stack bonuses, and unique mechanics tied to every biome! Whether you seek relaxation or mental stimulation, 'Station to Station' has something for everyone!\nGET ON BOARD AND RELAX\nFollow us, join the community, and choo-choo with the devs. Check the external links to join our Twitter and Discord!\nStation to Station is inspired by titles, such as Mini Metro, Train Valley, Dorfromantik, Terra Nil and Islanders.","imageUrl":"https://media.rawg.io/media/games/fab/fabb514d218bc2d3d8b3a554790bc722.jpg","releaseYear":2023,"developer":"Galaxy Grove","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":964421,"name":"Thronefall","genre":"Action","price":0.0,"description":"Get involved!\nAbout the GameA strategy game without all the headache? We got you covered.\nSaddle the horses! See your kingdom come to life, fight gripping battles to defend it and still be done in time for lunch.\nWith Thronefall we tried to strip a classic strategy game from all unnecessary complexity, combining it with some healthy hack and slay. Build up your base during the day, defend it til your last breath at night.\nWill you be able to strike the right balance between economy and defence? Do you need more archers, thicker walls or an additional mill? Will you keep the enemies at bay with your longbow or charge your horse right into them? It's going to be a tough night, but nothing beats seeing the sun rise above your little kingdom to live another day.","imageUrl":"https://media.rawg.io/media/screenshots/cb2/cb280b9ff4009e2e040a031b26b8b541.jpg","releaseYear":2023,"developer":"GrizzlyGames","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":934637,"name":"King Of The Castle","genre":"Strategy","price":0.0,"description":"Become the Monarch in this medieval party game and navigate a hilarious world of politics, treachery, and all-out rebellion, as your decisions see an empire flourish or come crashing to your feet.\nKing of the Castle is a multiplayer game of shifting power dynamics and intrigue. Host games of 3 to 24 other players who join as the 'loyal' Nobles of your Council, voting on your decisions - and twisting the story to their own sinister ends.\nThe perfect addition to your game night, tabletop group, or friends who just love to scheme against one another.\nPlot regicide (and worse) in video call or couch co-op, with each game featuring them as central characters in this Game of Phones.\nWith over 900,000 words across 950 possible Events and 80 unique Endings, no two reigns will be alike!\nBalance the competing demands of your Kingdom's Regions, each with 18 possible Schemes to overthrow you.\nFive unique Regions with their own Events - the brash Barons, ruthless Counts, wealthy Patricians, honourable Grandees and pagan Chiefs.\nForge a unique history of your realm. King of the Castle remembers your every deed or misdeed and knits them into the story of your game.\nBuild a narrative across over 17,000 choices, with each player a central character in their own emergent tale of ambition and betrayal.\nPlay on after your victory (or usurpation) in Dynasty Games, with special Events and choices based on your previous game.\nBribe, persuade or beg to get the votes you need, or just alter the Laws of Land to twist democracy in your favour...\nTax to watch the gold (and salt) pile up.\nWatch your back! If Defiance gets too high, Regions can revolt in a Rebellion that'll tear your Kingdom apart.\nPersonalize your Monarch or Noble with over 10 Quadrillion customisation combinations, including premium only options.\nBy owning the game, take the starring role and appear in both Twitch and Party Games more often.\nWill you be the one to overthrow your favourite streamer?\nKing of the Castle is fully Twitch-integrated and makes for the ultimate community game!\nStreamers play as the Monarch and - with a simple “!join” command in chat - their Council can be joined by an unlimited amount of players, who use chat commands and our Twitch Extension to try and bump them off the throne.\nhttps://store.steampowered.com/app/1839880/King_Of_The_Castle","imageUrl":"https://media.rawg.io/media/screenshots/2fb/2fbaa534573c2f45efa9ef6005fc454f.jpg","releaseYear":2023,"developer":"Tributary Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":833571,"name":"Islets","genre":"Action","price":0.0,"description":"Iko is an aspiring yet hopeful warrior exploring the land and sky to reunite a series of floating islands. With his rickety airship, he must travel from island to island in order to reignite each one’s magnetic core while fighting off the many adversaries standing in his way.\nIslets is a surprisingly wholesome metroidvania about making connections with the people around you. By reuniting the islands and befriending a cast of charming characters, the world expands and reveals new parts of each area for Iko to explore. Scour every nook and cranny in order to collect the many upgrades hidden around this world and face its numerous hidden challenges!\nThere’s also a tour guide to show you around, but you should be careful. The guy’s got some really weird vibes...FeaturesConnect the islands like a puzzle to discover new ways to explore previous areas and reunite the vast world around you.\nFight back against terrifying monsters and ruthless sky pirates in epic boss battles.\nDiscover upgrades to help you on your journey by completing challenges and uncover the islands’ many secrets.\nMake friends with a wide cast of charming characters—including a pretentious warrior classmate, a suspiciously friendly frog, and so many others.\nBecome immersed in a visually stunning hand-painted world with lush, vivid environments for you to experience.","imageUrl":"https://media.rawg.io/media/games/37c/37c521e41bf65943389ebe4a6cb00b14.jpg","releaseYear":2022,"developer":"Kyle Thompson","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]}]