[{"id":9890,"name":"The Black Death","genre":"Action","price":0.0,"description":"Note on Early Access:\nThe Black Death will launch on to Steam’s Early Access program. This means the game is still in active development and is liable to change. The Early Access program will not only allow the player enjoy the fantastic gameplay experience that is The Black Death, but will also allow the player to make a real difference to how the game progresses.\nThe Game:\nWelcome to the gritty medieval world of The Black Death. The plague has left a trail of destruction across Western Europe. Those who endure struggle against sickness, scarce resources and other desperate survivors.\nStart as a beggar and work your way up to a number of realistic professions, each with their own ways to survive. Enter a huge multiplayer open world, set in 14th century western Europe. Trade at fisherman’s ports, loot disease infested cities, hunt wild animals in dense forests, fight in bandit camps, upgrade your properties and much more. Loot, pillage, craft and survive in an epic struggle against The Black Death.\nKey Features in Early Access -\nRich profession based role playing combined with medieval era survival.\nA huge open world (8km2) based in 14th century western Europe. Explore thriving castles, bandit camps, busy ports and abandoned mines\nUnique medieval professions to unlock, each with a rich skill tree and their own way of surviving.\nA living world with hundreds of NPC’s and day / night cycle. Trade with merchants, hunt animals, talk to townsfolk and fight bandits.\nOver 300 in game items. Craft over 40 different weapon and armour pieces, using medieval tools and utilities.\nBuy and upgrade properties - and protect it from other opportunistic players…\nLarge scale multiplayer, with up to 50 players per server","imageUrl":"https://media.rawg.io/media/screenshots/09d/09d1ba5bbb767b4f130437a76c0e3c26.jpg","releaseYear":2016,"developer":"Small Impact Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9795,"name":"Just Get Through","genre":"Action","price":0.0,"description":"The procedurally generated platformer Just Get Through, a game by the german, one-man game studio Retrific, features various gamemodes, daily runs, steam leaderboards and trading cards, a sandbox, user-generated levels, explosions, traps, precise walljumping and more. Together with roguelike elements like permadeath, procedural generation, an endless amount of challenging levels and more this underrated game forms your next platformer challenge. You play as a dude trapped somewhere in a jungle-like environment. You try to escape but there is no exit - only those portals. And everytime you jump through one of them, you just land in another dungeon with even more traps.\nUse your skill and your explosives to get through an infinite amount of levels and to reach the first place in the global online highscore.\nOr play user-made custom levels, that were created in the powerful sandbox mode.\nFeatures:\nA slower platformer with long runs\nVarious game modes\nDaily Runs\nDestructible Environment\nEndless fun in different randomly generated levels\nWeekly Runs\nSteam Cloud for Custom Levels and Progress\nUpgrades\nBeautiful particles and effects\nGamepad Support\nDozens of unlockable color themes\nSandbox Mode\nUser-generated levels\nConsistent Style\nStart a run within seconds\nSteam Trading Cards\nSmooth 60fps\nDetailed stats\nCreate, play and publish custom levels ingame\nNo microtransactions\nThrowable TNT to destroy walls and traps\nSteam Leaderboards\nSteam Achievements\nPermadeath\nand much more\nTry the demo for a glimpse of the game!\nThis game was made by Retrific's founder Jonathan Mannshoven.","imageUrl":"https://media.rawg.io/media/screenshots/499/499a2ea7944a644d5aaa4aec97712db4.jpg","releaseYear":2015,"developer":"Retrific","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9776,"name":"BlastZone 2","genre":"Action","price":0.0,"description":"***BlastZone 1 + BlastZone 2 combo: Comes bundled with BlastZone 1, both in its original form and as a remastered version in the form of \"Classic\" mode; get two games for the price of one!\nBlastZone 2 is an action packed side scrolling shooter that will really get your adrenaline pumping! Play solo or join up with a friend locally or online and battle the alien forces that have invaded the planet and take the fight to them! Feel the excitement of breaking through the enemy barricade at high speed! Enjoy innovative gameplay mechianics such as 2nd person shooter sequences and creative use of 3D gameplay mechanics added to the traditional 2D formula. There are also tons of game modes, ship types, difficulty levels, and turbo modes to keep you entertained for a very long time. There are litterally hundreds of ways to play the game, so every player can have their own unique experience! Explore the many multiplayer strategies such as the heavy gunner and light defender to buy time while the ultimate weapons charge up!\nBlastZone 2 is a new approach to the shooter genre that emphasizes fast paced and strategic gameplay with tons of content to explore.\nNOTE: BlastZone 2 fully supports a wide variety of DirectInput and XInput gamepads, including the XBox 360 gamepad.  If you're unsure about your gamepad's compatibility, test it out with the free demo.\nFeatures include:\n2D controls, but with hazards and gameplay elements moving around in full 3D space\nCooperative multiplayer both local and online for 2 players\nAn 8 mission campaign that really keeps you on your toes\nUnlock the full power of your ship with hyper mode and unleash the devastating power of the omega cannon!\nClassic A mode, a greatly improved version of BlastZone 1\nClassic B mode, with a unique points-budgeting mechanic\nSurvival mode, similar to mission mode, but lasts forever.  Go for the leaderboard highscore!\nBlitz mode, start with a fully powered ship to fend off massive hordes of enemies!\nMultiple difficulty levels designed for new players up to genre veterans so everyone can have fun\n4 expansive game play environments, such as mountains, caves, and outer space\n7 selectable ships, each with different stats and abilities\n15 weapon types including beams, cluster grenades, force fields, power bolts, and machine guns\nHundreds of different enemy types, each with different behaviors and stats\nAn online world leaderboard to see how you stack up to the competition\nA Turbo mode for each of the survival modes for experienced gamers\nAdditional levels and content to be released for free","imageUrl":"https://media.rawg.io/media/screenshots/b08/b08df87584a20635d1b683274860ae42.jpg","releaseYear":2015,"developer":"Matt Edzenga","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":836480,"name":"Backpack Hero","genre":"Desconocido","price":0.0,"description":"Join our Discord!\nAbout the Gamehttps://store.steampowered.com/app/1970580/\nStorm the Dungeon! Backpack Hero is the inventory management roguelike! Collect rare items, organize your bag, and vanquish your foes!\nBackpack Hero is a twist on your standard deck-building roguelike! It isn't just about what you carry, but how you organize items within your bag! Their placement has huge effects on their power! You can move items to increase their power!\nCollect hundreds of rare items. Each item has unique effects and can be good in the right arrangement!\nBattle with over 40+ enemies. Enemies have varied attacks. Learn their attack patterns and vanquish your foes!\nEndless dungeons to explore! Randomly generated levels have unique layouts, interesting events, and unpredictable challenges.\nThere's more to Backpack Hero than just organizing your backpack. You explore ancient dungeons, caves, swamps, and more! Don't get lost!\nMany animals live in the dark dungeons beneath the world. You will encounter colorful friends and deadly foes!\nWhen you aren't putting your life in danger, you will use the resources you have gathered to upgrade your town! By organizing the perfect town, you will restore the world of Orderia and rescue the animals who live there! Your progress in the overworld unlocks new content but it won't give you any unfair advantages on a trip into the dungeons.\nPlease join our community! Our developers visit every day and will take your feedback seriously!","imageUrl":"https://media.rawg.io/media/screenshots/11e/11e4cfebb24aa7707a734021f8dbfa49.jpg","releaseYear":2022,"developer":"Jaspel","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":823666,"name":"Flower girl 2","genre":"Casual","price":0.0,"description":"This game is free to play, and you can fully experience the complete plot of a flower demon.\nBuy DLC to get 5 new flower demon plots. More happiness is waiting for you to explore!\n[2] [introduction to the game] [/]\n《Flower Girl 2 》It is a game of beautiful girl + elimination + plot combination. The story is the story of players stealing sacred objects and fleeing the flower demon country with the tears of the flower god.\n◆ super cool elimination play makes you unable to stop.\n◆ rich story plot.\n◆ exquisite original design.\n◆ increase the rhythm click play method after the first death.【Character introduction】Mimosa: Spring\nHeight: 161cm\nCircumference: 95-75-95\nPersonality: simple, shy, blushing and curious\nRepresentative color: Green\nFlower language: repentance and politeness\nCarnation: Shio\nHeight: 165cm\nCircumference: 95-75-95\nPersonality: naive, lovely, cheerful and ignorant\nRepresentative color: white\nFlower language: infatuation, difference and love\nLily: Snow\nHeight: 167CM\nCircumference: 90-80-85\nCharacter: noble, proud and charming\nRepresentative color: Pink\nFlower language: loyalty, holiness and elegance\nPhalaenopsis: Rin\nHeight: 172cm\nCircumference: 75-90-75\nCharacter: fragile and fragile\nRepresentative color: Purple\nFlower language: pure love\nRose: Dream\nHeight: 165cm\nCircumference: 75-80-90\nPersonality: mature and sexy\nRepresentative color: Red\nFlower language: encounter by chance\nCanna: Aoi\nHeight: 174CM\nCircumference: 90-80-97\nCharacter: IKEA female\nRepresentative color: yellow\nFlower language: a bright future","imageUrl":"https://media.rawg.io/media/screenshots/c00/c00b456bba9426b31c4770e72470ddc6.jpg","releaseYear":2022,"developer":"ohiyosoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":787638,"name":"Plants vs. Zombies Garden Warfare 2: Deluxe Edition","genre":"Action","price":0.0,"description":"Ready the Peashooters and prepare for the craziest, funniest shooter in the universe: Plants vs. Zombies Garden Warfare 2.\nDr. Zomboss has conquered Suburbia and transformed it into a zombie-filled, plant-free paradise. Help the plants reclaim their turf in the new 24-player Herbal Assault, or choose your side in 4-player co-op or solo play. With new modes, classes and loads of humor, Plants vs. Zombies Garden Warfare 2 lets you wage war on seriousness (and your friends!) however you want.\nPlants vs. Zombies Garden Warfare 2 also introduces the Backyard Battleground, your very own interactive hub where you and up to 3 friends can take on daily quests and challenges and interact with your favorite PvZ characters.\nDeluxe Edition includes:\nGrass Effect Z7 Imp and Mech Character Variant\nExclusive Plant Class Custom Accessories Pack\nExclusive Zombie Class Custom Accessories Pack\nPhenomenal Character Variant Pack\n200,000 Coins Starter Pack\nEmoji PackKey Features:\nPlants attack. This time, bring the fight to the zombies. Go on the offensive as the plants to reclaim Suburbia, or stop the botanical invasion and preserve Zomburbia in all-new game modes.\nMore characters, classes, and skins. 6 new classes join the cast, making for 14 playable character classes. Choose from more than 100 playable plants and zombies from the past, present and future and stand out as you fight.\nPlay your way. Plants vs. Zombies Garden Warfare 2 delivers tons of lawn-inspiring game modes so you can play together or by yourself. Need some company? Play in the new Herbal Assault mode and join 24-players online to duke it out all over Suburbia. Or join the plants or the zombies and team up in 4-player co-op mode. And if you want, you can even play solo!\nA living PvZ world. The struggle for Suburbia is in full bloom across 12 maps bursting with personality and humor. Fight your way through Zombossified cityscapes and crowded airspaces, all layered with hidden secrets waiting to be discovered.","imageUrl":"https://media.rawg.io/media/screenshots/291/2911a3f5851647bb1d678ba5ad55ee0b.jpg","releaseYear":2016,"developer":"PopCap Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":787612,"name":"World Seed","genre":"RPG","price":0.0,"description":"Free to try (not \"to play\")Game clients that are free automatically gets marked as \"free to play\" on Steam.\nMy goal is to let you try the game out before deciding if you want to purchase it or not. Not the other way around (forcing you to pay upfront in order to play). Please think twice before you leave a bad review because of this.\nThere is a one-time purchase, via the in-game store, at the price point of $8.99 to play the full game.AboutWorld Seed is a procedurally generated sandbox MMORPG with roguelike features. The main focus of the game is build-diversity & character progression.\n\"The six gods of the universe battle for singularity and you must fight back to preserve balance.\"\nIn this game you'll become stronger by crafting & upgrading your equipment or simply roll the dice and hope for some epic loot to drop as you slay enemies.\nIt's a harsh world to survive in, so make sure to bring some friends along when in need of help.Freedom of Choice\nYour strategy is valid\nWorld Seed won't push you in linear line of progression. We believe great games are the ones that offer the player to choose their own path, guided by the rules of the game.\nBuild diversity\nThere are few restrictions on how you build your characters. We're actively working towards keeping most builds and strategies viable.\nDistance from center\nThere is no traditional leveling system in World Seed. The further from the center you travel, the harder the game gets.\nDefeating high-level creatures will reward you with equipment of the same gearscore.\nTier progression\nThe rarity and quality of your items are based on item tier. There are 10 tiers in the game represented by roman numerals.\nEvery tier of an equipment unlocks new tier perks for you to choose from.Infinite WorldWorld Seed features an infinite world which is procedurally generated. Its content is renewed every hour.CraftingWorld Seed offers two methods of crafting: your typical “x materials to craft y,” but also upgrading. Upgrading items in World Seed is done by combining three equal items to a better one, yielding +1 in tier level.\nMost items in World Seed can be upgraded this way. This offers a unique feature which prevents items from becoming obsolete as you progress further into the game.","imageUrl":"https://media.rawg.io/media/screenshots/fbb/fbb81a968b02fb37be1dfdae1521cbfd.jpg","releaseYear":2022,"developer":"Kortes","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":765103,"name":"Amanda the Adventurer","genre":"Educational","price":0.0,"description":"Having inherited their Aunt Kate’s house, Riley Park starts exploring what the reclusive woman left behind. In the attic, Riley is surprised to find a stack of VHS tapes next to an old TV set. The tapes seem to be episodes of an early 2000’s era children’s cartoon they have never seen before. Intrigued, Riley pops the first tape into the VCR.\nNot the highest budget production from the looks of it. It appears to have been made locally and features a little girl named Amanda and her loyal yet shy best friend, Wooly the Sheep. While the episode appears charming and simple on the surface, an uneasiness starts to settle in as Riley realizes that Amanda and Wooly seem to be communicating directly through the television set. A gnawing feeling in the back of their mind presses them to stop, but Riley is compelled to continue watching the tapes. It’s almost as if Amanda needs something, and Riley becomes fascinated with finding out what that something may be.\nA short yet intricate single player horror experience\nAnimated tapes that tell an unsettling story, all under the guise of a welcoming children’s cartoon\nClassic, 90’s-style CGI that recalls a simpler era of animation\nCharacters who interact directly with the viewer—a dream come true for any 90s kid...or is it a nightmare?\nChallenging, escape room style puzzles using clues hidden within the tapes\nWhat lies beneath the friendly and colorful facade of Amanda the Adventurer? Who left these tapes behind? Is the price you will pay worth the answers you seek?","imageUrl":"https://media.rawg.io/media/screenshots/f87/f87deaeea65c87353189a3f94d6e3447.jpg","releaseYear":2022,"developer":"MANGLEDmaw Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":743757,"name":"Who's Lila?","genre":"Adventure","price":0.0,"description":"Who's Lila is a point-and-click adventure where, instead of choosing dialogue options, you control the character's face manually.\nLife’s never been easy for William, but today is special – a girl named Tanya Kennedy suddenly goes missing and the only thing Will's friends know – he was the one to see her last.\nWill you remain secretive and make William act as though nothing happened, or will you let true emotions show through his mask?\nIn Who's Lila, a specifically trained face-recognizing neural network allows you to make this choice! In dialogue, instead of choosing a text option, input facial expressions by moving parts of the character’s face. The neural network will then analyze the emotion and output the result, thus progressing the plot.\nApart from the struggles provided by your own face, you will be met with a gritty dither-punk world of Who’s Lila. Prepare yourself for dream-like landscapes, surreal architecture, steam-filled factory interiors, and David Lynch-inspired beauty of the industrial and the mundane.\n________________________________________________________________\n«Sometimes there is fear in the unknown, but we are good detectives and we have to know everything»\n________________________________________________________________\nDavid Lynch\nWill you make sense of this strange story, or will you lose yourself in the beautiful mystery? Will you try to discover every possible turn of events, or will you stick to a single storyline?\nAnd most importantly, will you be able to answer the ultimate question:\nWho is Lila?\nFeatures:Neural network-powered emotion detection\n15 endings and choice-driven gameplay\nSteam achievements\nDitherpunk visual style\n6+ hours of gameplay\nUnlockable palettes\n50+ unique soundtrack pieces written specifically for the game\nAnd more..","imageUrl":"https://media.rawg.io/media/games/934/9347c2fb668594139f2c3975556623e4.jpg","releaseYear":2022,"developer":"Garage Heathen","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":664879,"name":"PIGGY: Hunt","genre":"Action","price":0.0,"description":"\"The PIGGY universe expands with PIGGY: HUNT, a multiplayer adventure where survivors team up to escape the wrath of the Infected, the monstrosity trying to hunt them down.\nSurvivors: complete tasks, solve puzzles, find and use tools to help one another survive and escape!\nInfected: use traps and all of your senses to hunt down the Survivors!\nFeatures:\n• Fast-paced fun for up to 6 players; more players available with custom-game mode!\n• Highly customizable characters, weapons, and items.\n• Use custom-game mode to create endless playable options.\n• 3 House maps to play, each with different mechanics to win.\n• Officially licensed game from MiniToon.","imageUrl":"https://media.rawg.io/media/screenshots/5f2/5f2cff1738e4357edeab0ce9bce45d1e.jpg","releaseYear":2021,"developer":"Shaggy Doge","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":644794,"name":"Dark Roll: Free Kick Challenge","genre":"Simulation","price":0.0,"description":"Dark Roll - Play today for FREEhttps://store.steampowered.com/app/962810/Dark_Roll/\nAbout the GameA ball rolling game, where you take football free kicks. Single player challenges, Steam Leaderboards and ranked multiplayer. Free to play.\nDark Roll: Free Kick Challenge is a spin-off based on the original Dark Roll game.\nFree kick simulator, where you have to score goals, playing as an orb. Play alone to complete all the challenges, or score as many goals as you can and compete against others in Steam Leaderboards. Once you feel confident enough in your skills, you can face other players in a ranked multiplayer free kick shootout, where each player has 5 chances to score a goal. Complete various tasks to unlock more orbs, each having different parameters such as: size, speed, brake, power, swerve and jumping.FEATURESSimple to understand gameplay mechanics\nDemanding level of difficulty\nOver 20 orbs with different parameters to play as - most of them you have to unlock\nRanked multiplayer\nSingle player challenges\nSingle player modes where you compete against others in Steam Leaderboards\nSteam achievements designed to extend the gameplay and provide additional challenges","imageUrl":"https://media.rawg.io/media/screenshots/7e5/7e5207f132991c71c7e2ab461be884da.jpg","releaseYear":2021,"developer":"Artbarian Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":579642,"name":"Cats in Time","genre":"Adventure","price":0.0,"description":"MORE FROM PINE STUDIOhttps://store.steampowered.com/app/1435790/Escape_Simulator/\nAbout the GameHello explorers!\nMy name is Professor Tim Edger, and I'm the inventor of the time machine and an avid cat lover! Sadly, I have a problem, and maybe YOU can help me.\nYou see, my beloved cats are missing. While playing in the lab, they've activated my time machine and ⚡ZAP ⚡, now they are lost in space and time! You have to travel from ancient Egypt, all the way to the streets of late 20. century New York, and even beyond the present - to future Tokyo.\nYour goal is to find all the cats! Please be careful; these cats are really good at hiding.\nBEAUTIFULLY CRAFTED 3D LEVELSEscape to 30 distinctive locations set in seven different ages.\nTACTILE PUZZLESSolve amazing puzzles and riddles to save all the trapped cats.\nCUTE CATSSave almost 300 cats hiding in the most unusual of places.\nULTIMATE VERSIONThe Steam version is also the ultimate version of the game and features new levels, more detailed 3D graphics, new controls, widescreen support, extra content, and a few surprises!\nRELAXING SOUNDTRACKListen to the relaxing sounds of the period while exploring. Take your time (heh), and enjoy the trip!\nProfessor Tim E.","imageUrl":"https://media.rawg.io/media/screenshots/8c3/8c3b6b7bdfa8f7d21ad6ac12f1b246e0.jpg","releaseYear":2021,"developer":"Pine Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":570116,"name":"Game Master Engine","genre":"Adventure","price":0.0,"description":"March Stretch Goals\nRoadmap To v1.0More Info\nWe created this roadmap to help show everyone our goals for the future. Now that we are on Steam we hope to use this Early Access funding to cycle it back into Game Master Engine and create a better product overall. What we have now is a great prototype but we are eager to polish it and add in even more of our ideas!Phase One\nMore Assets\nWe currently have a healthy library of textures, props, particles and minis, but we want to greatly increase the size of the collection so you have almost anything you need for most standard scenarios.\nPolish\nThe first phase will be about improving the existing features we have already introduced. For example, we offer an overworld map maker in game that allows users to create a region or world map for their campaigns that you can then use to travel to battlemaps you have stored all over the map. We want to greatly improve upon this idea and expand it so users can easily map out their entire campaign in 3D on a single platform.Phase Two\nHost Games Online\nBy adding the ability to host games online we plan to open up the gates for users to be able to play over long distances and get immersed in the worlds their GM makes for them.\nPlayer Controlled Minis\nThe plan here is to give all the players who join a hosts game the ability to take control of their own characters and save their character info for future use.\nMore Tools For Combat\nBy introducing functions like dice rollers, rulers, line of sight checking, fog of war & more we want to take the weight of running a game online off the shoulders of the GM a little bit.\nCustom Ability Creation\nThis would allow you to bring any of those crazy character/enemy abilities to life. Save the details of your new ability in some text boxes, choose a particle effect to be cast alongside the use of the ability if you wish and set up a dice roll button for ease of use.\nCustomize Minis\nHelp set each mini apart from the other with some of these planned functions.\n- Choose mini base design\n- Add colored rings around the base for things like status effects\n- Change the texture of the model\nMap Sharing Database\nBrowse user created maps to help you fill your catalogue to use in various scenarios.\nAbout the GameMake a map to match any situation.\nBuild 3D battle maps for your tabletop role playing games with ease. Choose from nearly 700 props to begin building your world and dive into untold adventures with your party.\nGame Master Engine, or GME, is a new tool for game masters and players alike to add another layer of immersion to their group's sessions by making on the fly map building a simpler process. With tons of props and tools for customizing each map, no two encounters will ever be quite the same!\n- View maps in 2D or full 3D with full range camera.\n- Rotate and resize any prop to create anything you might need or want.\n- Save, load and share save files.\n- Even a simple button press to export a .png version of your map.\nOver 850 assets to begin creating with and plenty more still on the way. Choose tile textures to paint the ground. Props to fill the scene. Particle effects to give it life. And adjust the sun/weather to set the mood.\nJust about everything you place into the world can be adjusted in one way or anything. Scale the size in any axis. Rotate in any axis. Creativity will allow the provided assets to be used in more ways than one.\nBeautiful minis provided by our friends over at \"The Dragon Trappers Lodge\". New minis get added every month to help you bring your encounters to life. Drop them into the world and start playing.\nOpen a submenu for each mini and individually give them stats.\nGame Master Engine Includes\nThe packs included are as follows:\nBarricade\nCabin Village\nCampsite\nCrepuscular Forest\nDark Rock\nDungeon One\nWooden Furniture\nMultistory Village\nRock & Cliff\nRoyal Castle\nDwarven Statues\nTreasure Chests\nGravestones\nDwarven Fortress\nAssorted Fantasy Buildings\nDesert Temple\nJungle Temple\nLow Poly Ruins\n(Sci-Fi) Ships\n(Sci-Fi) Alien Ships\n(Sci-Fi) Alien Ruins\nEverything included here is just the beginning. We have much much more planned for the near future.","imageUrl":"https://media.rawg.io/media/screenshots/1f6/1f6fa77430213a998fc02f488c441271.jpg","releaseYear":2021,"developer":"Game Master Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":548112,"name":"鬼谷八荒","genre":"Action","price":0.0,"description":"Tale of Immortal is an open-world sandbox game based on Chinese mythology and cultivation. You will grow to become immortal, conquer the beasts from the Classic of Mountains and Season, make your choices carefully and grasp your own destiny.\nLive the mythologyWith a background based around ancient Chinese myths and stories, players will have a variety of interactive options with scenes and in-game NPCs, which will affect the storyline of the game and transform the game world.Become ImmortalThe theme of the game combines the immortal cultivation and the unique cultural background of The Classics of Mountain and Sea.\nPlayers will experience the journey from a mortal to a strong, god-like being.\nA word from the dev team:\nOur studio hopes that in this game, players will express the theme of \"Always stick to your heart, dare to fight against difficulties; make choices carefully and grasp your own destiny.\"","imageUrl":"https://media.rawg.io/media/screenshots/fc4/fc4ce8e79ac029b103d3405c1b45cd1a.jpg","releaseYear":2021,"developer":"鬼谷工作室","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":544038,"name":"Project Morpheus: Prologue","genre":"Adventure","price":0.0,"description":"Welcome to Project: Morpheus, in this prologue packed with around 1-3 hours of content, you will reprise yourself as EAST, and play your way in this world where reality and dreams collide.Key Features\nSolve the mysteries, escape the nightmareEAST, a veteran who encountered an accident during a trip, woke up finding himself in a completely strange wilderness.\nUnravel mysteries as you venture into this space, where secrets were hidden.\nExplore, search and manage your resourcesSolve puzzles, collect resources, gather information and everything that can help you to survive.\nThe special physical inventory system will future challenge you to fit items with limited spaces, and manage encumbrance at the same time.\nPlan your strategy, progress through the crisisThe use of each prop and every bullet is very important.\nChoose the right tools and strategy to face or escape from your enemies.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -A word from the teamWe are a game development studio dedicated to creating action-adventure FPS/TPS games, for PC and consoles.\nThe team currently consists of 1 game designer and 1 lead programmer. And we are looking for inspirational individuals who share the same vision to join our team.","imageUrl":"https://media.rawg.io/media/screenshots/8cb/8cb07f504228ad6f362f5beaf2cc22a2.jpg","releaseYear":2021,"developer":"TEAMRANGER","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":491781,"name":"Drill Deal: Borehole (Alpha)","genre":"Indie","price":0.0,"description":"AlphaDrill Deal: Borehole (Alpha) is the first (fully playable) mission of the upcoming Drill Dill game, that allows you to check the game and get used to oil rig management mechanics. The content of this alpha:\n2 levels (a tutorial level that introduce you the mechanics of oil rig management, and a full scenario where you need to face scary pirate lord Jack Torpedo)\nmanagement of needs of the cute oil rig crew\n13 buildings and 10 storages to build\n11 partners to cooperate and contracts to sign\n15 resources to drill out, refine and manage\npossibility to build a multiplatform oil rig\nAbout the GameThis is an Open Alpha page for Drill Deal. If you want to wishlist the game please make sure to do so here:https://store.steampowered.com/app/1083300/Drill_Deal/\nBuild your own Oil Rig!\nBuild up your oil platform from a single tiny rig to a large complex of connected platforms. Optimise your construction for the efficiency of production, increasing your cash flow, while keeping your employees happy and safe.\nTake care of your company reputation\nSign long term contracts for selling your products. Acquire new clients for new resources.  Manage your reputation and relations with clients to improve profit.\nMultiple unique events and scenarios\nManage your platform during an environmental crisis. Face many different challenges and threats like storms, blizzards, fire and many more. Keep your employees safe from pirate and terrorist attacks or from dying of deadly diseases.\nManage your Oil Rig crew\nCarefully select your employees with different skills and statistics. Keep them happy and improve their quality of life on the platform. Build entertainment, provide better accommodation, better food and health care. A skilled and happy workforce is key to increasing your production output.\nBuild Oil Rig in different places and face different challenges\nExperience different scenarios in different places of the world. Ranging from freezing arctic with snow and blizzards, through tropical waters with pirates, to haunted islands.","imageUrl":"https://media.rawg.io/media/screenshots/4d0/4d06f1de6d9e3df017a2fa3f423a7b21.jpg","releaseYear":2020,"developer":"A2 Softworks","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":432497,"name":"Down In Bermuda","genre":"Adventure","price":0.0,"description":"An unnatural storm leaves an adventurous aviator stranded for decades within the infamous Bermuda. Overcome creatures of the deep and unravel the islands secrets in search for a way back home.\n\n\nDown in Bermuda is a quirky adventure filled with puzzles to solve and mysteries to uncover. Our adventurous aviator Milton finds himself trapped in a time bubble deep inside the Bermuda and needs your help to escape.\n\n\nCrack codes, solve puzzles, collect magic orbs and escape each of the three unique islands (with more to come), each one leading to the next on a quest for a way back home.\n\n\nFrom the studio who brought you the suave secret agent adventure Agent A: A puzzle in disguise.","imageUrl":"https://media.rawg.io/media/screenshots/023/02358f5ce4e62bd1286061b396c2f0fd.jpg","releaseYear":2019,"developer":"Yak & co","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":428843,"name":"Royal Crown","genre":"Action","price":0.0,"description":"You have been summoned to the world of fantasy battle royal RPG, ROYAL CROWN where only the strongest survive.\nStart your journey in a land of fairy-tale fantasy with dazzling scape and exciting adventure!\nWait, please read before you ‘Freefall’! It will increase your survival chance by 50%!\n[TRIPLE SURVIVAL PLAY]\nStruggle to the end to become the final survivor in this fantasy battlefield.\nAim for victory by jumping into battles or, you have the choice to hide in bushes to avoid powerful enemies and look for an opportune moment to strike.\nYou can also cut down trees to create new paths or ambush enemies by predicting their routes!\nTake advantage of your surroundings to make the battle for survival more dynamic!\n[TRIPLE CLASS PLAY]\n16 unique classes to choose from to create unique battle strategies!\nGo solo or make a team of 3 to own the zone with class synergy and attributes!\nThere are multiple ways of fighting and surviving depending on the characteristics of the team.\nBecome the true champions of the battleground with the best team play!\n[TRIPLE ADVENTURE PLAY]\nEnough with boring battles and tedious farming!\nYou and the other players aren’t the only ones in this world.\nFind hidden items spread across the zone, or hunt field monsters to gain experience and become stronger!\nCollect and cook food ingredients together, cut down trees, mine ores, and even make items that give you an edge in battle!\nAnd beware of the legendary dragon that lies in rest, once it wakes you will face it’s detest.\nAnswer the call of the arena and fight for survival and enjoy the thrill of endless fantasy adventure.\nWill you become a hero in this world of tiny villages, rifts, and fearsome deserts?\nFreefall in to the world of ROYAL CROWN Now!\nTRIPLE PLAY! ROYAL CROWN!\nEnter the world of Battle Royal, MOBA, and Action now, let’s GO!","imageUrl":"https://media.rawg.io/media/screenshots/df6/df6a098cd0916d473369427734e33813.jpg","releaseYear":-1,"developer":"Meerkat Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":371855,"name":"Apocalipsis: The Tree of the Knowledge of Good and Evil","genre":"Adventure","price":0.0,"description":"In Apocalipsis you play as Harry, for whom the loss of his beloved was the end of his world. Now he has to venture out into the strange, unwelcoming and haunted lands to get her back. On his journey he will meet fantastical creatures, straight from the visions of the 15th and 16th artists such as Hans Holbein or Albrecht Dürer. In Apocalipsis the static woodcuts of old start living their own life, they form a whole new world inspired by the Book of Revelation and the aesthetic of Danse Macabre - a world filled with dread, death, and disease. Yet, there is still a space for true love in these sinister lands…\nApocalipsis is also the first appearance of the best-selling black metal band, Behemoth, in the world of video games. With Behemoth’s music hidden in gameplay and Nergal (the ominous leader of the band) narrating, it’s one hell of an experience!","imageUrl":"https://media.rawg.io/media/screenshots/1b7/1b7c8c7b137f44cddfc6853a8c418431.jpg","releaseYear":2018,"developer":"Punch Punk Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":311665,"name":"Super Neptunia RPG","genre":"Action","price":0.0,"description":"Story\nThe self-proclaimed hero, Neptune, awakes in a familiar world, but has no recollection of anything other than her name. With the help of a mysterious girl named Chrome, as well as three other familiar faces beloved in the Neptunia™ series, Neptune embarks on a journey through the mysterious dimension to try to regain her memory.\nLittle do they know, the world they inhabit is under attack by an enemy who wants to take civilization back to the time where 2D reigns supreme.\nCan Neptune and her friends save the world and 3D games as we know it, or will they be flattened into two dimensions forever?Key Features\nNew Me in 2D – Your favorite Goddesses jump from three dimensions to two! Artisan Studios and Compile Heart proudly present new, vibrant backgrounds and newly developed 2D animations hand drawn in this action-inspired side-scrolling RPG! With Artisan Studios and Tsunako collaborating to create new background and character art, fans and newcomers alike can see Gamindustri in a new 2D perspective.\nWhere You Lead, I Will Follow – With four Goddesses to rotate on-the-fly during battle, players can change their formation type and unleash devasting attack combos. Depending on which Goddess is leading the pack, players can strategize attacks from four different formations: Strike, Magic, Support and Heal!\nGoddess ‘bout to Break! – Strut your stuff and dish out your special Break Attack to ensure victory! Armed with their classic ability to transform, the Goddesses gain additional stat bonuses that enhance their attacks and lay waste to any enemy!\nPut a +2 Str Ring On It – Strengthen your Goddesses by utilizing Skills and Abilities that can be unlocked with weapons, armor, or accessories! Strategically assign Skills and rearrange your abilities for each battle.","imageUrl":"https://media.rawg.io/media/screenshots/5e0/5e01184a8c9d35fc96be0d167ba0590e.jpg","releaseYear":2019,"developer":"Idea Factory","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":269480,"name":"Batman: Arkham Collection","genre":"Action","price":0.0,"description":"Batman: Arkham Collection brings you the definitive versions of Rocksteady's Arkham Trilogy games, including all post-launch content, in one complete collection.\nExperience two of the most critically acclaimed titles of the last generation - Batman: Arkham Asylum and Batman: Arkham City, with fully remastered and updated visuals. Complete your experience with the explosive finale to the Arkham series in Batman: Arkham Knight. Become the Batman and utilize a wide range of gadgets and abilities to face off against Gotham's most dangerous villains, finally facing the ultimate threat against the city that Batman is sworn to protect.\n\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nBATMAN: ARKHAM KNIGHT and BATMAN: RETURN TO ARKHAM software © 2018 Warner Bros. Entertainment Inc. Developed by Rocksteady Studios. Remastered by Virtuos.\nBATMAN and all characters, their distinctive likenesses, and related elements are trademarks of DC Comics © 2018. All Rights Reserved.\nWB GAMES LOGO, WBIE LOGO, WB SHIELD: ™ & © Warner Bros. Entertainment Inc.\n(s18)","imageUrl":"https://media.rawg.io/media/screenshots/fd9/fd9eae438821129fa47d4498717fad33.jpg","releaseYear":2019,"developer":"Warner Bros. Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":243197,"name":"Capcom Beat 'Em Up Bundle / カプコン ベルトアクション コレクション","genre":"Action","price":0.0,"description":"Relive the glory days of cooperative arcade games with the Capcom Beat 'Em Up Bundle! This comprehensive collection includes seven classic games, each with various multiplayer options, online capabilities and detailed galleries!\nSay goodbye to game overs! Adjust your difficulty settings or give yourself more lives to battle through each game in its entirety. You can also play the English or Japanese versions of each title!\nGames included: Final Fight, Captain Commando, The King of Dragons, Knights of the Round and Warriors of Fate, as well as two games that were previously unavailable on consoles: Armored Warriors and Battle Circuit!\nGrab some friends, stare down the bad guys and BEAT 'EM UP!","imageUrl":"https://media.rawg.io/media/screenshots/513/513b224d04b977b153642d23b0e54726.jpg","releaseYear":2018,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":57324,"name":"Castlevania: Rondo of Blood","genre":"Adventure","price":0.0,"description":"Castlevania: Rondo of Blood is a platform-adventure video game developed by Konami for the PC Engine's Super CD-ROM² System directed by Toru Hagihara. It is set in the fictional universe of the Castlevania series, where the protagonist Richter Belmont goes to save his lover Annette, who was abducted by Dracula. It was released in Japan on October 29, 1993. A direct sequel to it, Castlevania: Symphony of the Night, was released in 1997. The game was remade for the Super Nintendo as Castlevania: Dracula X, and the PlayStation Portable as Castlevania: The Dracula X Chronicles. In 2008, the original game was released for the Wii's Virtual Console service in Japan and for the North American and PAL regions in 2010.","imageUrl":"https://media.rawg.io/media/screenshots/106/106b9cf907a9b1193ed3ed03ec99cdc3.jpg","releaseYear":1993,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"SNES"},{"id":0,"name":"PSP"},{"id":0,"name":"Wii"}]},{"id":49562,"name":"SEGFAULT","genre":"Action","price":0.0,"description":"Welcome To Segfault!\nTake the role of black hat hacker, breaching through the most secure companies in the world. Extract confidential data and sell it to the darker side of the web.\nSegfault is focused heavily on skill, as well as progression. Your task will not be as easy as you think. Order upgrades from the Deep Web, fuse together components, and become the most renowned hacker in the world. Compare your Play Style with the rest of the world as you strive to become the top ranked hacker.\nFeatures:\n~Single Player Campaign\n~Component  Synthesis\n~65 Upgrades\n~Steam Achievements\n~Statistic Tracking\n~Online Leaderboards\n~Mutator mode with 504 possible combinations\n~Bipolar AI assistant","imageUrl":"https://media.rawg.io/media/screenshots/833/8339120612a942bd46e3a737684af032.jpg","releaseYear":-1,"developer":"NodziGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":47178,"name":"Beyond the Void","genre":"Strategy","price":0.0,"description":"Beyond the Void (BtV) is a unique combination of strategy and 1vs1 competitive game that takes place in a world between science-fiction and fantasy.\nExperience the thrill of being a mercenary captain! Take command of a mothership that complements your style of playing and draft its skills. You’ve got only one true goal: To forge a strong fleet and conquer your opponent’s home planet! Now, Captain, balance your strategy and resources to win the war…Beyond the void!\nChallenge your friends to 1vs1 online matches, train against the AI, or compete in ranked games.First, DRAFT the skills of your mothership to fit your strategy. Collect resources and conquer neutral planets as you forge your fleet and improve your mothership’s statistics.Then, DESTROY your opponent’s fleet as you lead your powerful army through an epic space war. Your skills as a player are your best tool.Last, DOMINATE the game, defeat the enemy by conquering their base planet. Your victory is the first step toward building your reputation amongst the BtV community. Fight for the top rank.\nBeyond the Void is revolutionary, offering true ownership of game items in its digital second-hand market, which is based on the Ethereum blockchain.\nBeyond the Void is a free to play competitive game. Players have the opportunity to unlock or purchase cosmetics items to stand out and be easily recognized by your fans during tournaments.\nYou, the game-player, are witnessing the birth of a revolutionary concept in gaming: True ownership of digital assets. In other words, everything you own in BtV also exists outside of, and independent from, the game platform.\nWith traditional game platforms, you leave your winnings and game assets behind the moment you leave the platform. They only exist within that world, and that world can be taken away from you at any time; by a business or technical failure, by a ban.\nIn contrast, your blockchain-enabled game assets (e.g., avatars, motherships, skins, chest, ...), are portable. They exist inside and outside the game platform. You own them and can do what you want with them. You can buy, sell, and trade them directly with other people. You can offer them for sale at the shop.\nShop features:\nA variety of skins, avatars, titles, holotag, event cards and packs are available.Your assets are yours. You can buy, sell or trade them on the shop.Nexium is an ERC20 token used to buy items in the online shop.Nexium token is compatible with MyEtherWallet.More free and premium content will be added on a regular basis thanks to the great work of the development team.\nTo support our continuous cycle of play/iterate/improve, use the “Report a bug” button in the game or mention it in the “Feedback” channel on our Discord. We’ll use your feedback for our official release :)\nLet’s get to know each other on social media and discuss game polishing :)","imageUrl":"https://media.rawg.io/media/screenshots/4cc/4cc4a5c37a1488f6bcac87c2c9317b85.jpg","releaseYear":2017,"developer":"B2Expand","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":41561,"name":"Total War: Rome II","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/bba/bbad8a33d92d98f61d91ce94fed238e2.jpg","releaseYear":2013,"developer":"Creative Assembly","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28318,"name":"Blacksite","genre":"Action","price":0.0,"description":"Modern day fears come to life in a familiar, yet extraordinary setting: A small American town swarming with alien life. The government is desperate, struggling to contain secrets so terrible they can no longer be kept. Everything hinges on the actions of Aeran Pierce, a former Special Forces assassin thrown into one of the most explosive moments in American history.  A Living, Breathing Squad Lead well and your squad will rally in battle. Waver and their morale will sink, affecting their tactics and their will to fight.  One-Button Squad Command Issue orders to your troops, directing them to plant C-4, snipe an enemy from long range or take control of vehicles left behind by the wounded.   Battle Online Dominate the masses in modes like Team-Death-Match and Human vs. Reborn  Drive, Shoot & Ride Drive the latest military vehicles or take position in the gunner’s chair in daring, low-level helicopter raids.","imageUrl":"https://media.rawg.io/media/screenshots/23b/23b432db6e27e42b7438f86d578fb6fe.jpg","releaseYear":2007,"developer":"Midway Studios - Austin","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28115,"name":"Fighting Fantasy Legends","genre":"Adventure","price":0.0,"description":"Return once more to a land of danger!\nFighting Fantasy Legends Portal is a gateway to adventure in the Fighting Fantasy world!\nPlay as a novice adventurer and rise up through the ranks to saviour of the world in this epic tale of deadly traps, fearsome monsters and devious adversaries. Play three classic Fighting Fantasy gamebooks by author Ian Livingstone - Deathtrap Dungeon, Trial of Champions and Armies of Death.\nDEATHTRAP DUNGEON is an adventure through a deadly labyrinth. Countless adventurers before you have taken up the challenge, but none have survived.\nTRIAL OF CHAMPIONS sees you return to the deadly labyrinth where new traps and terrors, mazes and monsters, await your every turn.\nARMIES OF DEATH approach from the east, and you must build up a force of veteran fighters to confront Agglax the Shadow Demon.\nRelive these exciting adventures in a whole new way - powering up your Skill and Luck dice and collecting powerful cards to help you on your quests.\nThese three books are just the start of your adventure - more content will be added!\nFeatures List -\nOfficially licensed game based on the multi-million selling Fighting Fantasy gamebooks.A card-based RPG with Roguelike elements.A detailed branching narrative system ensures that no two games are ever the same.Uses the classic Skill/Stamina/Luck attributes from the gamebooks.Unlock monster cards in your Creature Codex.Earn XP and level-up your Skill & Luck dice.Three difficulty levels.Take on powerful beasts from the Fighting Fantasy world such as the Bloodbeast, the Pit Fiend and Agglax the Shadow Demon.Unlock character Titles based on your choices.","imageUrl":"https://media.rawg.io/media/screenshots/d82/d82fa3ae5745b30e2e5cbec69f7597aa.jpg","releaseYear":2017,"developer":"Asmodee Digital","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":27989,"name":"Yoshi's Woolly World","genre":"Adventure","price":0.0,"description":"Set off with a friend* through a wild, woolly world in this grand Yoshi™\nadventure! A treasure trove of clever handicraft stages are ready for\nyou to explore. Unravel their secrets and color your world with a\nspectrum of yarn balls to knit new paths and get every last collectible.\n\nKnitting yarn, patchwork, and other handicraft materials combine into a\nwhimsical and crafty backdrop for our knit Yoshi to explore. Instead of\neggs, this time Yoshi tosses yarn balls that he can use to clear blocked\npaths, tangle-up enemies, or even knit together platforms and warp\npipes. Yoshi can also tug at stray yarn to unravel walls and reveal\nhard-to-reach areas filled with hidden collectibles. Tackle challenges\nin local 2-Player co-op by partnering up with a friend. Gobble 'em up\nand spit 'em out to reach new heights or take out craftwork creepers\nlike paratroopas, piranha plants and shy guys! It's time to get crafty.\n\nToss yarn balls to knit together background elements or tie-up enemies\n\nUnravel puzzles and walls to discover hidden areas and collectables\n\nExplore each crafty stage to discover new surprises—there's no time\nlimit\n\nDiscover and explore new areas in 2-player cooperative multiplayer\n(additional accessories required for multiplayer mode; sold separately)\n\nMellow Mode gives Yoshi™ wings so everyone can enjoy\n\n*Additional accessories required for multiplayer; sold separately.","imageUrl":"https://media.rawg.io/media/games/a8d/a8d018e6f3f48d57bc62c7c58e3e7133.jpg","releaseYear":2015,"developer":"Good-Feel","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"}]},{"id":27789,"name":"Chroma Blast","genre":"Action","price":0.0,"description":"Chroma Blast is a fast paced twin stick shooter with many different styles of play where you fight through waves of enemies while constantly leveling up your ships colorful arsenal. Beat your friends and challenge yourself in the leaderboards, or seek out a true test of skill for those good enough to find it.\nFeatures\n6 challenging enemies\nA deadly boss\n31 unique weapons\nOnline leaderboards","imageUrl":"https://media.rawg.io/media/screenshots/93b/93b1e5ccd6e7d707bf62285a4e5c13fd.jpg","releaseYear":2016,"developer":"Wizbyte Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":27026,"name":"Animal Crossing: City Folk","genre":"Simulation","price":0.0,"description":"Go fishing, collect shells or watch fireworks with friends? Build a\r\nsnowman, exchange presents with family or decorate your house for the\r\nholidays? Take a trip to the city, go on a shopping spree or visit\r\nfriends from all over the globe? In Animal Crossing: City Folk,\r\nlife moves at a relaxed pace, but the world brims with endless\r\npossibilities.\r\n\r\nThere's always something new to do. In the living, breathing world of Animal\r\nCrossing: City Folk, days and seasons pass in real time, so\r\nthere's always something to discover. Catch fireflies in the summer,\r\ngo trick-or-treating on Halloween or hunt for eggs on Bunny Day. If\r\nyou're in the mood for something a little faster paced, take a bus to\r\na new urban city area that's unique to Animal Crossing: City Folk.\r\nThere you can catch a show at the theater or check out the sales at\r\nGracie's boutique. But if you don't show your face back home for too\r\nlong, your neighbors will miss you.\r\n\r\nUp to four people from your household can live and work together to\r\nbuild the perfect town. Design clothes and patterns, write letters and\r\npost messages on the bulletin board for each other, or invite up to\r\nthree friends to visit your town.\r\n\r\nGet to know your neighbors. The heart of Animal Crossing: City Folk\r\nis building relationships with the animals in your town as well as\r\nwith other players. Befriend your animal neighbors by exchanging\r\nletters, gifts and favors. Animals can also move from town to town,\r\nbringing their memories and stories from their old towns with them.\r\nAnd since animals are notoriously loose-lipped, they spill all the\r\njuicy details.\r\n\r\nExpress your personal style. Customize your town, your house and\r\nyourself by collecting bugs, fish, fossils, art, furniture, clothes\r\nand accessories. You can also go to the salon in the city to change\r\nyour hairstyle and get a Mii makeover. Plus, if you design clothes in\r\nthe tailor's shop, animals will wear them and maybe even bring them to\r\nother towns.","imageUrl":"https://media.rawg.io/media/games/276/27688f45ec85b6847928b6e07494451e.jpg","releaseYear":2008,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":26511,"name":"NBA Jam","genre":"Sports","price":0.0,"description":"It’s baaaaaaaaack… EA SPORTS NBA JAM revives the classic franchise with\nvintage NBA JAM gameplay, and all-new features that deliver a fresh new\ntake on the game. Featuring the sights and sounds that fans of the\nfranchise will instantly recognize, EA SPORTS NBA JAM mixes the old\nschool with the new, to deliver a one-of-a-kind sports presentation on\nthe Wii.\n\nShoves, spins and of course, backboard smashing dunks take centre stage\nwith classic two vs. two gameplay that lies at the core of NBA JAM. -\nChoose from all new motion controls, flip the controller on its side, or\nplug in the Classic Controller or Classic Controller Pro and jump in\nusing classic controls and play with a roster of current NBA players,\nNBA legends and a few special appearances on the hardwood.\n\nWith a distinct art style, NBA JAM brings photo realism to the Wii.\nUnmatched player likeness and reactions exaggerate the outrageous moves\nthat make up the core JAM experience, elevating the already intense\ngameplay to new heights.\n\nWith modes aplenty, classic JAM gameplay, and loads of characters and\nunlockables, you’ll see why the revival of NBA JAM is a slam dunk.\n\nFeatures\n\n• Classic NBA JAM Gameplay – Fast paced two on two action is what lies\nat the core of the NBA JAM experience. Take on a defender one on one,\nand pull a last minute spin as he goes to shove you. Throw an alley-oop\nto your teammate as he comes down with an on fire, backboard smashing\ndunk.\n• Multiple Control Schemes—Whether you prefer to shoot using\nthe Wii’s motion controls, or by pressing a button, NBA JAM gives gamers\nthe chance option when it comes to control schemes. -Choose from motion\ncontrols, classic controls or plug in the Classic Controller or Classic\nController Pro, and dominate the hardwood on your terms\n• Two\nCampaign modes—–Want to experience some nostalgia? - Then pop into\nClassic campaign mode to get exactly what you remember from NBA Jam.\nLooking for something a little bit different? Jump into the Remix Tour\nand experience an all-new twist on Jam – choose your own path to glory\nas you participate in game modes that you might not expect and face off\nagainst some of the biggest legends in the sport.\n• Game Modes\nAplenty—–Step beyond the traditional with additional game modes. From\nBackboard Smash to Domination and from 21 to Elimination, NBA Jam offers\nloads of gameplay depth to keep your experience engaging and fresh.\n•\nPlayer Likeness—Witness as the past and future collide in the visuals of\nNBA Jam. A distinct art style that screams Jam from the moment you boot\nup the game is mashed with the most realistic player likeness ever seen\non the Wii (or perhaps on any console), creating a presentation that is\nunlike anything you’ve seen but yet is strangely familiar\n•\nUnlock this or Unlock that – Complete Jam Challenges to unlock game\nmodes to characters, to secret teams and Special Courts, NBA Jam will\nfeature a whole lot of content for you to unlock as you progress thru\nthe game..\n• Boss Battles—They are some of the greatest players to\nhave ever played the game of basketball. They are legends that will not\ngo down easy. They are standing in your way and you need to get by them.\nJump into a unique take on the Jam franchise with boss battles. The best\nplayers doing what they do best. They will frustrate you with their\nskills, but you have to beat the best to be the best.\n• All 30 NBA\nTeams and more…The top three players, as chosen by the fans, from every\nNBA team in the are featured in NBA Jam, but that’s not all. Over 100\nunlockable teams, characters, privileges, and mascots will also be\nplayable.\n• Tim Kitzrow – The original voice that captured the\nattention of a nation is back voicing all the classic lines you remember\nfrom the original NBA JAM, as well as a host of new ones, including some\ncreated by fans\n• Multiplayer Goodness – Go at it alone or jump into\nthe multiple multiplayer options available in NBA JAM. With two on two\nco-op play throughout the campaign mode, as well as two on two\nhead-to-head competition, there are lots of ways to share the NBA JAM\nlove.\n","imageUrl":"https://media.rawg.io/media/screenshots/044/0443b65fa47f4148a3d518d57a22ca3a.jpg","releaseYear":2010,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":24353,"name":"Guitar Hero: Warriors of Rock","genre":"Arcade","price":0.0,"description":"Join with friends on an epic rock journey to save rock n' roll.\nFeaturing an impressive 90+ track set list, a totally redesigned\nrock-inspired guitar controller and a host of all-new gameplay features,\nliving room legends and their friends can strum, drum and wail in the\nmost immersive music videogame experience to date.\n\nFeatures\n\nQuest Mode - Build an army of warriors and fight to save rock\n\nQuickplay + Rank up with up to 13 challenges per song - over 1,000 on\ndisc\n\nParty Play Mode - Jump in / jump out of gameplay without the fear of\nfailing\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","imageUrl":"https://media.rawg.io/media/games/800/80081e1e39de018f19c35fd18c6a8cd8.jpg","releaseYear":2010,"developer":"Vicarious Visions","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":23424,"name":"Juanito Arcade Mayhem","genre":"Action","price":0.0,"description":"Juanito Arcade Mayhem is a new game where you have to save the most famous classic Arcade Video Games from an alien invasion. You will only have your pyjamas and a fearsome arsenal of weapons to defeat very disgusting enemies and epic hardcore bosses.\nWhen the mutant Clonocells from outer space attack, a young and lazy boy by the name of Juanito becomes the last hope. Chosen by Gluk, a bipolar manipulative alien, Juanito must enter an arcade cabinet and save all the infected retro videogames.\n80+ unique levels, inspired by 8 classic arcade games.\nEach world has a unique mechanic based on the game it features.\n10+ weapons, power-ups and upgrades.\nSeveral boss battles and a final ruthless boss fight.\nAn Endless Survival Mode to put your endurance to test.\nIn-game Steam Leaderboards to compete globally in 12 different rankings.\nLocal Co-op Mode to play with a friend.\n80 Steam Achievements.\nOriginal Soundtrack (8-bit, chiptune, electro, techno, dubstep, remix).\nSteam Trading Cards.\nSteam Cloud to carry your game data everywhere.\nController compatibility.","imageUrl":"https://media.rawg.io/media/screenshots/1a5/1a596ce9f55dd0c696b5c48ad22b0afd.jpg","releaseYear":2017,"developer":"Game Ever Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":23393,"name":"WILL: A Wonderful World / WILL：美好世界","genre":"Adventure","price":0.0,"description":"Use your wisdom and intelligence to help those who look forward to your people.\nReadYou need to read each of the game characters sent to your letters, understand their troubles and solve their perplexities. Maybe you will not be friends with them, but please believe that they are grateful for what you have done.\nReasoningThe story of the occurrence is not a simple guess, I believe that sentence \"things out of reason.\" So, make a decision to remember before moving Oh, this is the fun to change the fate of where.\nFindLife because of the brain hole open and beautiful, and sometimes some brave try will make you overjoyed. To create and their common memories of it.","imageUrl":"https://media.rawg.io/media/screenshots/149/149e8565e53de35f424c7cc5472f1385.jpg","releaseYear":2017,"developer":"WMY Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":22638,"name":"Anno 1503 A.D.","genre":"Strategy","price":0.0,"description":"ANNO 1503 A.D. includes Anno 1503: The New World and its expansion Treasures, Monsters & Pirates.\nLay claim to the New World in an epic saga of adventure and discovery. ANNO 1503 A.D. is a PC title that blends the excitement of real-time strategy with the depth of empire building.\nThe aim of the game is to establish colonies and seek out wealth and power. Watch your colonies grow while establishing trade and diplomatic ties with neighbouring cultures. Engage in combat on land and at sea to protect your colonies or to maintain freedom and independence.\nThe all-new combat system allows for much more sophisticated tactical preparation and some truly epic land and sea-based battles. Enjoy the variety and challenge of five varying climate zones while competing against computer-controlled players, including interactions with nine different cultures such as the Africans, Aztecs and Native Americans.\nStretch your influence through a powerful economic system which varies depending on location and includes goods such as weaponry, raw materials, and necessities such as clothes and food as well as more exotic items like silk and spices. Trades can be made several different ways, via an easily accessible trading menu that allows you to interact with other nations and form peace treaties. However, some cultures may rely on a more offensive, aggressive style of interaction, which can lead to potential conflict.Unique blend of real-time strategy with the depth of an empire-building epic.\nCompete against computer-controlled players and interact with nine different cultures from the 16th Century - each with their own personal traits and unique characteristics.\nSettle in climates as diverse as frozen tundra, bleak deserts and lush jungles - each with their own unique natural resources, vegetation, wildlife and terrain.\nNew combat system - vary your tactics based on the opponent, terrain and weaponry.\nEnhanced AI - differences in cultures lead to a variety of behaviors and interactions.\nOver 250 authentic building types including tobacco plantations, watchtowers and cannon foundries.\nSeveral gameplay modes - Single Scenario, Campaign, and Open-Ended","imageUrl":"https://media.rawg.io/media/games/5eb/5eb9aac9096bfbf08eaedfa147a05f9a.jpg","releaseYear":2003,"developer":"Max Design GesMBH","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21014,"name":"Rake","genre":"Action","price":0.0,"description":"Actuality: During the summer of 2003, events in the northeastern United States involving a strange, human-like creature sparked brief local media interest before an apparent blackout was enacted. Little or no information was left intact, as most online and written accounts of the creature were mysteriously destroyed.\nWitnesses told stories of their encounters with a creature of unknown origin. Emotions ranged from extremely traumatic levels of fright and discomfort.\nIn early 2006, the collaboration had accumulated nearly two dozen documents dating between the 12th century and present day, spanning 4 continents. In\nalmost all cases, the stories were identical...\nDo ghosts exist? What about Bigfoot, Chupacabras,Rake or Skinwalkers? And how will we ever know?\n\"RAKE\" is the first game in our series of games about paranormal phenomena.\nYou play as Gordon Davis, a scientist, a traveller and an explorer of unknown creatures and unusual events. Having learnt one more legends, Gordon travels through\nthe country in search of poltergeists,Bigfoot, Mothman and other American legends...exploring haunted houses, trekking through creepy bushy  forests and scanning the sky and lakes to collect data about the mystical events...\nSo, you are in the place where the strange humanoid - Rake was most frequently seen. Most often he was seen at night. Therefore, you can use the cameras, motion sensors, night vision device for the strange phenomena detection. In the afternoon you are installing equipment in all areas of the forest. You can also mount the cameras on animals, if you manage to lure them into a trap. At nightfall your task is to watch on the monitor for events taking place in the forest. You can switch between the cameras. If you notice something unusual, you can go to a place where the camera has spotted the creature. Do not forget to take a rifle. So you have to hunt down a strange creature, and then kill it or trap it. However, be careful, it can disrupt your plans ... And while watching on the monitor, be aware, it could be closer than you think. The game is over, when you will it... or it kills you...\nGood luck!\nMac OS and Linux versions are in testing. Multiplayer now is in testing.\nIt will be added for free after update the game.\nAttention!There are some terrible moments\nin the game. It is not recommended\nfor children 18+ and adults with\nnervous disorder.","imageUrl":"https://media.rawg.io/media/screenshots/bd1/bd1e08e1443c4af1be128e09db0eb079.jpg","releaseYear":2015,"developer":"Konsordo","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20818,"name":"Archon Classic","genre":"Strategy","price":0.0,"description":"Inspired by chess, but adding combat that YOU control, Archon was the original Battle Chess. You must try to outmaneuver your opponent using teams of fantasy creatures or monsters in this epic struggle of Light and Dark.  On the chess board, when you challenge a piece, you are teleported into a Combat Arena where you fight in REAL-TIME until only the victor emerges to claim the square on the chess board. Conquer your opponent by defeating all of their pieces on the chess board or claim all the Power Squares for a quick victory! You can play Free-For-All mode, where it's everyone for themselves, or play using teams and gang up on your opponents pieces in battle (2 vs. 1.)\nArchon:Classic can be played using USB controllers (the best way) or with keyboard and mouse. First developed in 1983, Archon quickly became a hit and instant classic because of it's unique combination of action and strategic gameplay. We've recreated it to play just like the original, but we've added enhancements for today's gamer. So grab some friends and experience the classic game that started the Action/Strategy genre.\nKey features:\nUp to 4 Player support...pure mayhem in battle!\nPlay in \"Free-for-All\" or \"Teams\" mode\nUSB controller support\nOptimized to run even on on netbooks\n3 Different Boards (Modes) to play\n4 AI settings with 3 different personalities\nVarious spells to use\n18 pieces per team, plus others you can summon\nPieces gain experience and level up\nPrimary and Secondary abilities\nChoose modern or classic icons\nFully Featured 1 Player Campaign called, \"Conquest\"\nConquest features 4 campaigns (over 60 quests)\nOver 16 hours gameplay on Conquest alone!\nTracking and Statistics per game (fully featured)\nAchievements and Leaderboards","imageUrl":"https://media.rawg.io/media/screenshots/2cd/2cd4c5f840ef10aa066d076425c5ce4a.jpg","releaseYear":2010,"developer":"React Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20585,"name":"Sherlock Holmes Consulting Detective: The Case of the Mummy's Curse","genre":"Adventure","price":0.0,"description":"The London Times started it all – calling the murders the work of an ancient Egyptian curse. I accused the tabloid of capitalizing on the superstitions of the populace. Yet, three men were dead, with the wrappings of a 4000-year old mummy binding their fates together. I find it hardly plausible and daresay believe the answers lie within the fabrics of a far more mortal realm. Once again, I have called upon the good doctor to accompany me.\nZojoi teamed up with famed board game company Sleuth Times to reproduce the award-winning Sherlock Holmes Consulting Detective video mysteries for Windows and Mac. This original titles was considered the pioneer products for emerging optical technologies and took advantage of the medium with full-motion video (FMV), intriguing storylines and fun game play. The restored retro game feature recaptured video, high-resolution graphics and strong storytelling and design.\nDirect the famous Baker Street detectives through the fog-filled streets of London, and solve mysteries in a faithful adaptation of the board game that features:\n30 minutes or more of original video footage\nSherlock Holmes, his case companion, Dr. Watson, and over 20 additional characters (both trustworthy and unscrupulous!)\nFull English subtitle support\nSearch the London Times for clues, peruse Holmes’ personal files, scour through the London Directory and receive hints from Watson himself\nPresent your findings to the Queen’s magistrate – and learn how you did against the master detective","imageUrl":"https://media.rawg.io/media/screenshots/5aa/5aa0d98f896bed1236ed98e67cf18eb6.jpg","releaseYear":2015,"developer":"Zojoi Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19907,"name":"Streets of Chaos","genre":"Strategy","price":0.0,"description":"The Conspiracy DLC now included with the main game! New features added below, feel free to check it out!\nThe year -- sometime in the future. The world as we knew it has crumbled and descended into chaos. Crime of all types is rampant and committed openly. Police and other vital services are stretched to the limit.\nYour time is now.\nLoosely inspired by the classic strategy PC game Chaos Overlords, Streets of Chaos is a unique strategy/board game hybrid where you become the leader of a rising resistance in a world gripped by crime and anarchy. Your very simple goal: to take over the city and run it -- your way. Your obstacles: the police, the judges and one other rebel leader who, like you, sees this broken city as his for the taking.\nFeatures:\n- Recruit randomly generated members of your posse with 7 different stats forming their skills, equip them with weapons and armor and send them on missions of various types. You decide how to allocate their attention. Take over a street, hack a database for some cash or resources, or search for that rogue rebel leader and take him out.\n- Choose from dozens of game challenge combos for long term playability.\n- Hire lawyers to defend you, bribe (or assassinate, if they get in your way) judges. Use the system to your advantage.\n- A totally randomly generated world to play in every game. No two games are EVER the same! Equipment, characters, city layout, it's all different every time you play.\n- Includes full original music, an attractive and intuitive interface and tons of strategic angles and paths to victory. Deal with vicious HQ attacks, make side deals with rival gang members, exchange resources for game benefits, deal with random events changing the rules, and more!\n- Designed to play: Help popups are on every screen and mouse over tool tips are liberally scattered through the game to make getting into playing quick and easy, along with a quick tutorial.\n- High-res profile portraits included.\n- Buy randomly generated items at the Pawn Shop to equip your crew with that boost their abilities.\nStake your claim today on these Streets of Chaos!","imageUrl":"https://media.rawg.io/media/screenshots/d45/d4536ce54075d1a0f8593df686729f8b.jpg","releaseYear":2015,"developer":"SimProse Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]