[{"id":4101,"name":"Bayonetta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bee/bee483efadcf9d7e657e52184316a34e.jpg","description":"Bayonetta is a slasher game developed by Platinum Games.\n\nThe game is set in a fictional European city of Vigrid. The main character is a witch named Bayonetta who fights angels with pistols and magic wishing only one thing: to recall everything happened to her.\n\nBayonetta is a third-person game. The player controls Bayonetta and uses close to medium range attacks, complicated combos and a wide variety of weaponry. Special Torture Attacks are present in the game when Bayonetta uses a torture weapon such as guillotine to execute an enemy. The Witch Time ability allows the player to slow down time after an enemy attack is successfully dodged.\n\nAs the plot advances, the player transforms Bayonetta to a panther or other animals in order to enhance her abilities. The game consists of several chapters with each having multiple parts. A scoring system is present in the game as a medal is awarded at the end of each mission. Special medals can be found scattered across the secret areas of the levels.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Platinum Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":4573,"name":"PAYDAY The Heist","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/546/546cf59a24b0ae308e311a07611ca22f.jpg","description":"PAYDAY The Heist is a dynamic co-op shooter that allows players to assume the role of a bank robber and to try on the criminal life from the first-person view. This game is the first part of the PAYDAY series and the beginning of the story of four outlaws – Dallas, Hoxton, Chains and Wolf. The gameplay is about completing 6 different heists throughout America alone (with bots) or in a team (up to 4 members). Each robbery could be carried out in two separate ways: players should decide whether stealth or a breakthrough attack is more suitable and prepare all the ammunition properly in advance. The squad of criminals searching for another “big score” is set up against easy-to-manipulate civilians and powerful police forces, so players are to try their best to prevent the alarm signals and not to face armed resistance. However, if the heavy combat begins, the best option will be to keep shooting countless enemies down till the money is in the bag and the heist is over.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"OVERKILL Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":2728,"name":"Tom Clancy’s The Division","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c73/c73c4ffebfe968ba0982a56c2b5020ef.jpg","description":"Tom Clancy’s The Division is an action shooter in a third-person perspective with role-playing elements. The game includes both single and multiplayer (co-op) experience. Playing for The Division agent gamers will fight against the sources of virus throughout the city to save America from the terrible cataclysm. The main action is set in New York City, so players have an opportunity to explore an open-world Manhattan infected with the dangerous pandemic. According to the storyline, the disease called “Green Poison” or “The Dollar Flu” appeared as a result of a failed experiment and spread with dollar banknotes on Black Friday 2015. Players should assume a role of The Strategic Homeland Division agent whose aim is to clear the city and to prevent further extension of the pandemic. The gameplay is about completing the missions, earning experience points (for the player progress) and currency (for upgrading the equipment level), and gradual fight against infection. Due to properly worked out high-quality textures all the objects and the city itself are meant to be willingly destructible for the improvement of gaming experience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":22511,"name":"The Legend of Zelda: Breath of the Wild","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc1/cc196a5ad763955d6532cdba236f730c.jpg","description":"The Legend of Zelda: Breath of the Wild is an adventure game developed by Nintendo. It is the nineteenth installment in the series.\n\nAfter awakening from a hundred year sleep, memoryless Link hears a mysterious female voice that guides him to a destroyed kingdom of Hyrule. He finds a Wiseman who says that a ruthless creature, Calamity Ganon, was imprisoned for 100 years. Even though the creature is trapped, it is still gaining power. Link sets out to kill Ganon before he frees himself and destroys the world.\n\nIn contrast to the previous titles in the series, Breath of the Wild the player to explore a vast open world. At the beginning of the game, a small tutorial is given to the players and they are free to travel the world at the pace they see fit. Link can climb almost every surface in the world, cook food to restore health. Fast travel to certain places in the world is also available for the players. The world is highly interactive thanks to the chemistry engine.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"}]},{"id":12756,"name":"Warhammer 40,000: Space Marine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ac2/ac25b5cef220bf5b8d052e0978451cab.jpg","description":"Reviews\nSteam Big Picture\nAbout the GameIn Warhammer® 40,000® Space Marine® you are Captain Titus, a Space Marine of the Ultramarines chapter and a seasoned veteran of countless battles.\nA millions-strong Ork horde has invaded an Imperial Forge World, one of the planet-sized factories where the war machines for humanity’s never ending battle for survival are created. Losing this planet is not an option and be aware of the far more evil threat lurking large in the shadows of this world.\nDEVASTATING WEAPONRY\nExperience 40,000 years of combat, evolved. Enhance your vast arsenal as you unlock new weapons, upgrades, armor & abilities through an accessible progression system. This devastating weaponry empowers players to deliver bone crushing violence and dismemberment to their enemies.\nBLOCKBUSTER ENTERTAINMENT\nWith an Imperial liberation fleet en-route, the Ultramarines are sent in to hold key locations until reinforcements arrive. Captain Titus and a squad of Ultramarine veterans use the bolter and chainsword to take the fight to the enemies of mankind.\nBRUTAL 8VS8 ONLINE COMBAT\nForm your own Space Marine squad or Chaos Space Marine warband and face off in 8 vs 8 online matches. Gain experience and unlock new weapons and armor to customize the Devastator, Assault, and Tactical Marine classes.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":45821,"name":"Frostpunk","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a88/a886c37bf112d009e318b106db9d420a.jpg","description":"In an ultimately frozen world, people develop steam-powered technology to oppose the overwhelming cold. The city ruler has to manage both the inhabitants and the infrastracture the citizens live in. Leader’s tactical skills face challenges, frequently questioning morality and the basic foundation of what we consider an organized society. Here optimization and resource management often clash with empathy and thoughtful decision-making. While city and society management consume most of the ruler’s time, at some point exploration of outside world is necessary to understand its history and present state.\nWhat decisions will you make so the society can survive? What will you do when pushed to the limits? And...\n...who will you become in the process?\n\nTHE CITY MUST SURVIVE\nFrostpunk is a city-survival game where heat means life and every decision comes with a cost.\n\nMAINTAIN THE HOPE\nSurvival is about hope and will to live. Your ability to spark and maintain these two in your people will be a determinant factor for success.\n\nMAKE THE LAW\nSociety is a group of people abiding the same rules and sharing similar beliefs. Establishing laws and customs will be a crucial factor shaping your society.\n\nWEIGHT YOUR CHOICES\nWill you allow child-labour? How will you treat the sick and wounded? Frostpunk challenges a player’s tactical skills, while questioning one’s morality.\n\nEXPLORE\nThe world covers not only bits of the past but also the potential means to secure the future of your people.\n\n\"(...) this is a game about finding reasons to survive rather than just the means to go on living.\"\n- Adam Smith, Rock, Paper, Shotgun\n\"In a steampunk ice age, the only thing that can be crueler than the bitter cold are the decisions you have to make to keep your people alive.\"\n- Stephanie Chan, VentureBeat\n\"(...) decisions push your morality to its limits for the sake of productivity, which could make for an captivating, draining adventure when the game releases later this year.\"\n- Suriel Vazquez, Game Informer","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":2553,"name":"Ratchet & Clank","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d30/d30ef0c7dd4878161b1f781e297ae6a0.jpg","description":"A game about the adventures of Cosmic fennec Ratchet and his friend and ally, the robot Clank, whom Ratchet carries behind him in his satchel.\r\nRatchet wants to be a space ranger, and he gets a chance to show that he deserves it. The missions look very serious, Ratchet himself is very serious - but this is a game, and one of its main features is humour and an elegant parody.\r\nThe game corresponds to the canon of the genre, but always offers something that makes every mission and every decision fresh. For example, a mission in which it is necessary to steal weapons technology from an enemy planet - to execute it, you need to knock out as many brains as possible from giant flying octopuses. Why? Because these brains can exchange the necessary technology from one local scientist, who needs brains for the experiments, but the boss does not give it to him.\r\nThe gameplay consists of destroying enemies in a variety of unexpected ways, with weapons of fourteen kinds, and among them a shotgun that turns enemies into pixel pictures and then crushes them into pixels. There are a lot of such finds in the game. In addition to shooting, there are chases and other things. And besides weapons - a lot of useful original devices.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":14512,"name":"Age of Wonders III","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f95/f95ec06eddda5c5bf206618c49cd3e68.jpg","description":"Age of Wonders 3 is a turn-based strategy game developed by Triumph Studios. It is the fourth title in the Age of Wonders game series.\n\n###Story\nAge of Wonders 3 is a fantasy game. It tells the story of a conflict between the Commonwealth Empire and the alliance of dark and forest elves. While the Commonwealth desires to take over the world and push all the old customs and traditions aside, elves fight to prevent such a thing from ever happening. Elves gather all the oppressed races and nations together to take the fight back to humans.\n\n###Gameplay\nAge of Wonders 3 gameplay is based around a 4X principle, which focuses on exploration, expansion, exploitation, and extermination. The players slowly build up their empire from the ground up. Multiple ways of achieving that are available, such as diplomacy, colonization, or plain old simple war. \n\nAt the beginning of the game, the players choose and customize the character they will play as. This character becomes a leader of a specific nation in the game. Six races are available. The races have their own perks, which must be carefully chosen to suit the player's play style. \n\nThe leader and empire perk trees are present in the game. As the players build up their empire, new units and buildings become available. There are 6 leader classes available for the players. Leaders can gain experience and level themselves up. The game also features a karma system, which influences the way the players are seen by their people.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Triumph Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14446,"name":"Call of Duty: Black Ops II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ee/8eed88e297441ef9202b5d1d35d7d86f.jpg","description":"Call of Duty: Black Ops II is a first-person shooter, a direct sequel to Call of Duty: Black Ops that features its protagonists. The story is divided into two time periods. It starts in 1986 with Alex Mason that has to return to work after his retirement to catch Raul Menendez, responsible for multiple crimes. The second storyline takes place in 2025; you play as David, Mason’s son, who also needs to find Menendez who sparks the second Cold War. The game has several endings depending on your actions in both storylines.\nThe campaign mode in Black Ops II is also selected in two parts. There are story missions, where you can make decisions that will affect the future of the characters. Additionally, Strike Force missions, available in 2025, feature permanent death - if the character is killed, you can’t return to the checkpoint, and have to continue the game without them.\nLike two previous games in the series, Black Ops II has the Zombies mode with a completely new story. It starts with nuclear experiments in 2025 Nevada that cause the appearance of zombies.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Treyarch","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":22121,"name":"Celeste","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/594/59487800889ebac294c7c2c070d02356.jpg","description":"Celeste is a platformer about climbing a mountain, from the creators of TowerFall.\nExplore a sprawling mountain with over 500 levels bursting with secrets, across 8 unique areas. Unlock a hardcore Remix for each area, with completely new levels that will push your climbing skills to the limit.\nMadeline can air-dash and climb any surface to gain ground. Controls are simple and accessible, but super tight and expressive with layers of depth to master. Deaths are sudden and respawns are fast. You'll die a lot, but you'll learn something every time.\nMeet peculiar characters and climb through a personal story of breaking through your self-doubt to find yourself, set in the present-day Pacific Northwest. Uncover the mystery of the mountain's power and outrun your reflection on your journey to reach the top.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Matt Makes Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":4094,"name":"Metal Gear Rising: Revengeance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8e6/8e699e91cf77c2060b6d515e2135b1b1.jpg","description":"After the events of the uprising took four years. Naomi Hunter creates the FOXAVILE computer virus that destroys the system of \"Sons of the Patriots\", thereby putting an end to the military economy, what turned the war into a profitable business. PMSC (Private Military Security Companies) began to protect essential people and act as peacekeepers. You play as Raiden, a katana-wielding cyborg who is forced to join the PMSC to protect his family.\n\nMost of the gameplay Raiden has to cut enemies and some objects with a mighty high-frequency sword. Along with the standard attacks available \"Free sword mode\" that allows you to control the assault. In the open mode, attacks are more powerful, but the range of their impact is lower. For the elimination of enemies in Free mode are given points that allow you to restore health and the scale of the free sword with the help of fluids that are in the spine of dead cyborgs.\n\nBeing undetected, you can perform silent and quick kills on some enemies approaching from behind or from above. Available, at least, ten kinds of weapons and a few suits.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Platinum Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"}]},{"id":15426,"name":"Black Mesa","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/009/009e4e84975d6a60173ec1199db25aa3.jpg","description":"Black Mesa is the original Half-Life as if it was made in the 21st century using modern graphics and updated mechanics. This remake of the classic game was envisioned by a group of enthusiasts, approved by Valve, and spent eight years in the making. The name, Black Mesa, refers to the secret research facility where the game is set. The player assumes the role of Gordon Freeman, a scientist caught in the midst of an experiment gone wrong. An anomaly breaks out, and hordes of monsters invade Black Mesa.\nWhile Black Mesa and Half-Life are basically the same game, there are many subtle changes besides the improved graphics. The amount of ammo has changed, as well as the order in which the weapons appear in the game. The iconic crowbar is found in a different place. There are also new options like zooming in and out and reprogramming gun turrets. Some of the levels were shortened, and some of the monsters became stronger. NPCs became more intelligent, and they will perform certain actions to aid Gordon. Design of the characters also became more varied, and women finally appeared in the game. Black Mesa also introduced an achievement system and a multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Crowbar Collective","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18614,"name":"Half-Life: Source","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d54/d54f0267a042f44c032d8ca264584ecf.jpg","description":"Half-life: Source is a reissue of the 1998 Half-Life game based on a more modern \"Source\" game engine with many innovations in graphics performance and gameplay.\n\nThe game's plot is entirely consistent with the plot of the original Half-Life and tells us the story of the research centre \"Black Mesa\", which is located in the USA, New Mexico.\n\nYou play as a young researcher Gordon Freeman, who works in the laboratory of unusual materials. In case of having a low level of tolerance,  the scientist does not know the risks posed by the work to be undertaken. One morning Gordon was sent to a test chamber to perform a standard analysis of the crystal. The consequences of the experiment, however, are catastrophic.\n\nA distinctive feature of the Half-Life gameplay is the continuous interaction of the player with the environment. For example, the player can move the box to the desired height. On the base of interactivity were built a lot of puzzles that may require the player's ingenuity.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Valve Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3631,"name":"inFAMOUS Second Son","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be2/be239d5eb4d0bf02bf722aff51e694ad.jpg","description":"Action adventure game inFAMOUS: Second Son is a spin-off to the original inFAMOUS series. Players take control of Delsin Rowe from the third-person perspective in the open-world environment. The story takes place in Seattle 7 years after Cole McGrath’s sacrifice and the annihilation of The Beast (the ending of inFAMOUS 2). The protagonist is a 24-year-old local from the Akomish reservation. He has a Conduit’s superpower that gives him the control of different materials. Delsin also has an extraordinary parkour skill that allows him to climb vertical surfaces. Having supernatural power, Delsin is set up against mutant hunters from Department of Unified Protection (D.U.P.) As the story progresses, Delsin comes across new Conduits and acquire new special abilities spending Blast Shards scattered throughout the map of Seattle. While completing Delsin’s story players are able to choose whether they want to follow the good branch (healing civilians and stopping unnecessary violence) or the evil branch (murdering innocents and redundant enemies).","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":9966,"name":"Dead by Daylight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e11/e11325e2f89151d31f612e38dee3b6a0.jpg","description":"This asymmetric multiplayer horror game in which one of the players tries on the role of a brutal killer, while the other four try to escape. Survivors play with a third person perspective, and the killer uses the first-person camera. The game has no singleplayer.\r\n\r\nPlayers can choose from 13 survivors and 12 killers. Each of them differs from each other with own upgrades system and special actions. There is no need to be polite and cooperative - every player for himself. Each level is procedurally generated, and each new round is offering a unique experience. The game engine selects from 10 presets,\r\n\r\nThe plot of the game tells a story about the supernatural being of The Entity, who created the world and populated it with serial killers. To save players have to perform a number of tasks, which include the repair of generators and other interactions with the items on the map. All actions with objects launch the so-called Skill Check - RNG that decides whether or not the action will be successful.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Behaviour Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":30899,"name":"Mafia: The City of Lost Heaven","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74c/74ca0ec569682a150f3c6f9f661fb6a5.jpg","description":"It’s 1930. After an inadvertent brush with the mafia, cabdriver Tommy Angelo is reluctantly thrust into the world of organized crime. Initially, he is uneasy about falling in with the Salieri family, but soon the rewards become too big to ignore. As he rises through the ranks, the paydays keep getting bigger, but the jobs get even dirtier. Tommy may ultimately earn the respect of the Salieris, but becoming a Made Man will leave him more conflicted than ever with the new life he has chosen.Experience New HeavenExplore more than 12 square miles of New Heaven, a quintessential 1930's American city based on historic Depression-era architecture and culture.Authentic Story and Action-packed GameplayPlay more than 20 thrilling missions inspired by events from the 1930’s. Rise through the ranks of the Salieri family from foot-soldier to Made Man, taking on mob hits, car chases, bootlegging, shootouts, bank robberies and more.Era-inspired Vehicles and WeaponsAs a daring getaway driver, get behind the wheel of more than 60 historically-inspired cars featuring realistic physics and real-time damage.\n \nComplete those grittier jobs with more than a dozen weapons at your disposal. Choose from baseball bats, sawed-off shotguns, magnums and the renowned Tommy gun to deal with any wise guy who dares to cross you.\n\nNote: This rerelease of Mafia has an edited soundtrack and does not include any licensed music.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Illusion Softworks","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":2597,"name":"LEGO The Lord of the Rings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89a/89a700d3c6a76bd0610ca89ccd20da54.jpg","description":"LEGO The Lord of Rings is an adventure game that reimagines the events of the Lord of the Rings film trilogy with humor and Lego style. The game doesn’t follow the plot of the saga directly but features all the characters, major events and voice acting from it.\n\nThere are 80 playable characters in the games, including Frodo Baggins, Legolas and other heroes, even not mentioned in the movies. Each of them has unique abilities and their own inventory. You can also create your own character. You play as a part of the party that needs to destroy the Ring. Besides the story mode, there is a free roam mode where you can explore the open world of the game switching between two characters.\n\nThe game keeps the balance between environmental puzzles based on LEGO mechanics, QTE-fights and exploration. Different actions are more suitable for different characters. The game features multiple collectibles, side quests and unlockable heroes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"}]},{"id":9671,"name":"Rust","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/447/4470c1e76f01acfaf5af9c207d1c1c92.jpg","description":"To survive is the main task in the game Rust. It is necessary to survive in the area, which is now wholly wild but was recently inhabited.\nAt the beginning of the game, there is only a rock and a torch. The rest will have to be found or stolen.\nBears and wolves roam the terrain, there are diseases and radiation in the game, but the main danger comes from other survivors. The game has only a multiplayer mode. We have to engage in skirmishes and hand-to-hand fighting with them.\nPlayers can not only compete, but also unite. Rare minutes of peace and security worth devoting to construction, equipment and strengthen the shelter, the base.\nSometimes some helicopters shoot everyone on the ground. Fortunately, helicopters can be brought down.\nWeapons can be found, collected and improved. Sophisticated and more effective weapons sometimes cannot be assembled independently, you need to use drawings and find rare details, sometimes leaving very far.\nSometimes planes drop from the sky \"parcels\" with various useful staff. The falling parcel is visible from afar, the path to its fall can be long. The package can be noticed by others. A long road can be facilitated by a vehicle. For example, a boat.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Facepunch Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":2115,"name":"Overcooked","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/270/270b412b66688081497b3d70c100b208.jpg","description":"Overcooked puts the player into the shoes of two restaurant chefs at once. Each level is a kitchen, and your goal is to cook a list of meals following the onscreen recipes. The time is limited, and there are restrictions on how much money the player can spend on the ingredients. The player controls two characters that can be switched at any time or ordered to do a list of actions. \nThe kitchens are often set in the oddball places, such as a pirate ship, two speeding trucks, a pedestrian crosswalk, or an iceberg. The level elements are dynamic and may move or change during the gameplay. Tables and ovens can slide, and the cooks can fall off the level, though they will respawn shortly. \nThere’s a story mode in which cooking is tied to the plot. The game is set in the Onion Kingdom that was attacked by an insatiable spaghetti monster. The chefs travel back in time to refine their cooking skills and feed the monster when it appears again.\nSince even in the single mode the player has to control two cooks, the game predictably has a co-op multiplayer and a competitive mode in which the players try to “outcook” each other. Both modes, however, are local, and there’s no online multiplayer.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":42895,"name":"Assassin's Creed Syndicate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f1/9f189c639f70f91166df415811a8b525.jpg","description":"In 2015, the characters Shaun and Rebecca penetrate into one of the offices of \"Abstergo industries\", which is located in London, where they install bugs. There they find information that Abstergo looks through the life of British Assassins Jacob and Evie Frye, hoping to find a Piece of Eden hidden in London.\n\nIn the centre of the story of the past are the twin assassins Jacob and Evie Frye. They go to London to put their orders there and at the same time to find a Piece of Eden.\n\nHowever, a more exciting innovation in the mechanics of Syndicate was the harpoon. It is actively used during a secretive passage - harpoon allows you to change position and save time instantly.\n\nAnother important aspect of the game is the gang. You can spend money and resources not only on yourself but also on your allies. By investing in the development of Rooks, you will help them to sabotage the Gallows. Outside the story, the campaign begins classic Assassin's Creed: towers, the liberation of territories and a lot of third-party jobs.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":13913,"name":"Deus Ex: Game of the Year Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67e/67e5be6ad7a555248f50bd367e9a071c.jpg","description":"The year is 2052 and the world is a dangerous and chaotic place. Terrorists operate openly - killing thousands; drugs, disease and pollution kill even more. The world's economies are close to collapse and the gap between the insanely wealthy and the desperately poor grows ever wider. Worst of all, an ages old conspiracy bent on world domination has decided that the time is right to emerge from the shadows and take control.\n\nKey Features:\n\nReal role-playing from an immersive 3D, first-person perspective. The game includes action, character interaction and problem solving.\n    \nRealistic, recognizable locations. Many of the locations are built from actual blueprints of real places set in a near future scenario.\n    \nA game filled with people rather than monsters. This creates empathy with the game characters and enhances the realism of the game world.\n    \nRich character development systems: Skills, augmentations, weapon and item selections and multiple solutions to problems ensure that no two players will end the game with similar characters.\n    \nMultiple solutions to problems and character development choices ensure a varied game experience. Talk, fight or use skills to get past obstacles as the game adapts itself to your style of play.\n    \nStrong storyline: Built on \"real\" conspiracy theories, current events and expected advancements in technology. If it's in the game, someone, somewhere believes","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Ion Storm","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":4123,"name":"Batman: Arkham Asylum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d56/d564ee964eb3c17892b3b35dd607f836.jpg","description":"Batman: Arkham Asylum as an action-adventure game developed by Rocksteady Studios. It is the first installment in the Batman: Arkham series which is based on Batman comic series.\n\nBatman successfully captures Joker and transports him to the Arkham Asylum on the Arkham Island. Batman suspects Joker of surrendering intentionally hence why the hero decides to escort Joker personally. Joker breaks away from the security frees all the inmates and captures the asylum. Batman sets out to restore order in Arkham Asylum.\n\nPlayed from a third-person perspective, the gameplay of Batman: Arkham Asylum can be divided into three types: world exploration, stealth and beat 'em up. Batman explores the asylum while solving puzzles and using his wide range of gadgets. If Batman is spotted, the game turns into a beat 'em up featuring fast hand-to-hand combat. Batman himself does not use any weapons due to his moral choices while the enemies grow stronger and begin using different weaponry as the game progresses.\n\nIn some cases, while confronting a group of enemies, it is suggested that Batman's actions should not be spotted and the game turns into a stealth action.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rocksteady Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":13247,"name":"Human: Fall Flat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74d/74dafeb9a442b87b9dd4a1d4a2faa37b.jpg","description":"Human: Fall Flat is a low-poly adventure game with platforming elements and physics-based puzzles. You play as Bob, a fully customizable character that travels from one dream to another. Bob has neither no background nor superpowers. His abilities don’t differ from yours: he can grab things, climb ledges and so on. \n\nEvery level consists of multiple puzzles that can be solved in different ways. You can push and pull carts, break walls and interact with everything else comparable to your own size. The game heavily focuses on physics. Puzzles’ solutions are intuitive and make you act like in real life. In their core levels are quite linear: you need to reach the door at another side of the location to get into the next dream. While at the first levels you need to find exits from tiny rooms, the further you go, the larger locations become. There is a lot of content in the game in general, and it clearly references the sandbox genre where you can do almost everything you want.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"505 Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":28152,"name":"STAR WARS Battlefront II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f54/f54e9fb2f4aac37810ea1a69a3e4480a.jpg","description":"Despite its name, Star Wars Battlefront II is the seventh game in the Battlefront series of action games. It is a direct sequel to the 2015 Star Wars Battlefront that became the series's reboot.\r\n\r\n###Story mode\r\nThe game is set in the Star Wars universe during and after the fall of the Galactic Empire. Its story mode fills the gap between the original trilogy and Episode VII: The Force Awakens. In the story campaign mode, the player controls the Imperial Inferno Squad led by the game's main protagonist, Iden Versio (who is voiced by Janina Gavankar). She and her special forces group participate in a variety of missions spanning almost 30 years. On certain levels, the player will also control other characters, including rebels.\r\n\r\n###Arcade mode\r\nBesides the story mode, there's the Arcade mode that offers the players to take on the role of any Star Wars character from the said period, such as Darth Vader, Han Solo, Luke, Rey, Kylo Ren, among others. The player can choose the battle to participate in, the side to fight for, and the character, or even to customize the mission. \r\n\r\n###Multiplayer\r\nThe Arcade mode offers a local cooperative multiplayer. Besides that, there are nine online multiplayer modes that include traditional types like team deathmatch and capture the flag. Some of this modes, like Galactic Assault, support up to 40 players at once and allow the players to participate in a large-scale battle between the rebels and the Empire.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Electronic Arts DICE","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17857,"name":"S.T.A.L.K.E.R.: Shadow of Chernobyl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/348/348640e78a7fcd4bb7dcad4fea014eeb.jpg","description":"This post-apocalyptic game that spawned the S.T.A.L.K.E.R. franchise is inspired by (but not really based on) the 'Roadside Picnic' novel by brothers Strugatsky and Tarkovsky's movie 'Stalker', borrowing some of the terms and aesthetics from both. S.T.A.L.K.E.R.: Shadow of Chernobyl is set in Ukraine, in the infamous Chernobyl Exclusion Zone. Several parts of the open-world setting were modeled after the real Chernobyl surroundings, including the power plant and the city of Pripyat, although designers took some liberties. The bleak environment and dark ambient music help to create an unsettling atmosphere of this place. \nAccording to the backstory, in 2006, the second Chernobyl disaster occurred, turning the surrounding area into post-apocalyptic ruins, full of grotesque mutants and time-space anomalies. The \"stalkers\" in this world are the explorers who wander The Zone in search of valuable loot. You play as the Marked One, a stalker who lost his memory. All that remains of his past is a memo that says “Kill Strelok”. The Marked One will have to learn more about himself, Strelok, The Zone, and its mysteries. The plot is non-linear, and there are multiple endings that depend on the quests you completed earlier.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"GSC Game World","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":18183,"name":"Company of Heroes","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fa/0fadc446fd1e9ae9e23a32793d9a5406.jpg","description":"Company of Heroes is an RTS game set during the WWII, featuring an extensive single-player campaign and various multiplayer modes. One of the fundamental differences from other strategies of the time is the dynamic environment and complete destruction of almost any object on the map.\nThe game starts with the invasion of Normandy by the Allied forces and leads through Europe. The almost cinematic experience of every battle allows players to immerse in the darkest hours of humankind fully. The warfare itself in the game is exceptionally refined, featuring cover systems and different damage types, making players plan their movements, know their enemies and know themselves. However, not every battle is won by plans, and thus, reaction to the surroundings also plays a significant role.\nCompany of Heroes successfully reimagined how WWII RTS should look like and play like, with its different squad compositions, various routes to be taken, and new challenges in the form of multiplayer battles with players who will try to outcompete you, outplay you and overrun your forces.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":46956,"name":"Doki Doki Literature Club!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/972/972aea3c9eb253e893947bec2d2cfbb9.jpg","description":"Doki Doki Literature Club puts you into the role of an anime character, an average Japanese schoolboy. Your protagonist joins a literature club in which he's the only male member. The remaining four girls – Monica, Sayori, Natsuki, and Yuri – compete for the boy’s attention. Each girl represents a certain anime character stereotype, such as tsundere, genki or kudere. As you get to know them closer, however, they turn out to have individual character traits on their own. Eventually, you will choose one of the girls to romance with and follow her personal storyline. The gameplay is based on interactions with the other characters and carefully choosing dialogue options. You will also perform tasks as a club member. The latter includes \"writing\" poetry, although the player actually only gets to select certain words to fill the blanks.\r\nThe plot and dialogue are front and center in this game. The visuals and soundtrack, however, are static and minimalistic: the music is looped, and characters have a very limited number of sprites in each scene. There's no voice acting, and you only interact with characters through text.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team Salvato","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3209,"name":"Until Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d64/d6443375f9971152866ea76bff97d6d6.jpg","description":"Ten young people spend time in a cottage on a mountain. Around the cottage, there is a forest and something supernatural. First, they joke with each other, then unknown and deadly participants appear in the game.\nSome people will die in any case, the lives of others will depend on the player. There will also be helpers - one of them will tell you that the mountain is inhabited by Wendigo - supernatural beings who were once human beings, but after eating people’s flesh they became obsessed with evil spirits and turned into bloodthirsty monsters.\nWendigo will be settled in some of the dead characters - and they will come to life and will get superpowers that help win even the Wendigo.\nThe plot is ramified so that you will have to go through the game several times to familiarise with all the options.\nThe player has to make decisions quickly, conduct investigations, collect and take into account numerous clues. Actually, this is the gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":14962,"name":"Dark Souls: Prepare To Die Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/511/5116b4524cea34c6b3f12e0ca027d850.jpg","description":"Dark Souls: Prepare To Die Edition is an RPG set in the grim landscapes of Lordran, bringing the series for the first time on PCs. An open, seamless world, which spans from the top of the mountains to the lowest depths, offers players a new experience in the form of constant dangers and easily overpowering enemies.\nThe main character of the game is the Chosen Undead, whose features and background are customizable by the player, following a steep path of fate, death, and life after death. The time is running short in the world, and only you can decide, will it hold fast or expire. The evergreen hills and the thick forests, the dark dungeons and the burning lakes of lava underneath the earth, all shall welcome the Chosen Undead with a deadly embrace. The outstanding soundtrack lets all the players immerse in the world of Dark Souls. \nThe game features a well-crafted fighting system, with various weapons and armor, magical enchantments and handy tools to help the player on their journey. Another point of interest would be the multiplayer mode, allowing players to invade each other’s worlds, and fight to the death or cooperate and take on the strongest in-game bosses.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"FromSoftware","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":750,"name":"FINAL FANTASY XV","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ee/2eeed8524931b4fae1e4a40d0e5443b5.jpg","description":"Final Fantasy XV is an action RPG developed by Square Enix and is not connected to the previous installments of the series.\n\nThe story takes place in a world of Eos. Noctis Lucis Caelum, the heir of the Lucis Empire throne sets out on a quest with his comrades in order to recover a stolen magical gem the theft of which sparks a global conflict between all the nations in Eos.\n\nThe combat system resembles the same one featured in Final Fantasy Type-0 but is heavily modified. There is no option to control any of the four main protagonists apart from Noctis himself, yet it is possible to command your teammates. It is possible for the players to use vehicles such as tanks or robots or summon beings that differ in rank based on their size. There are no battle-specific battle screens in FFXV.\n\nMagic is also present in the game. By consuming the power of natural elements from their sources, Noctis is able to cast spells. The Protagonists have the ability called Link Form which allows for contextual attacks.\n\nThe main emphasis is put on the road trip with your friends. FFXV features a massive open world which can be freely explored. Dynamic day-night cycle and weather systems are also present.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19569,"name":"Hitman: Blood Money","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/233/233cdc08cce0228f6f35222eca3bff92.jpg","description":"Money Talks. Silence Pays. Prepare to Make a Killing. When assassins from Agent 47's contract agency, The ICA, are eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. Sensing he may be a target, 47 travels to America, and prepares to make a killing.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox"}]},{"id":58550,"name":"Ghost of Tsushima","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f24/f2493ea338fe7bd3c7d73750a85a0959.jpeg","description":"The year is 1274. Samurai warriors are the legendary defenders of Japan--until the fearsome Mongol Empire invades the island of Tsushima, wreaking havoc and conquering the local population. As one of the last surviving samurai, you rise from the ashes to fight back. But, honorable tactics won't lead you to victory. You must move beyond your samurai traditions to forge a new way of fighting--the way of the Ghost--as you wage an unconventional war for the freedom of Japan.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":11312,"name":"The Long Dark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd2/fd20a68d7ef195855588c937865dd0a7.jpg","description":"The Long Dark is a game about surviving in the unforgiving conditions of frozen North Canadian taiga. The Arctic wilderness may be breathtakingly beautiful, thanks to the game’s artful visual style, but it is also deadly. Low temperatures, hungry animals like wolves and bears, and starvation can easily kill your character. To stay alive, he will need to learn how to light a campfire, find shelter, care about his wounds, hunt for food and protect himself in an unfriendly environment. Many necessary items in the game, including some of the weapons, need to be crafted out of the junk that you can find in the woods and in abandoned buildings.\nIn the story mode, called Wintermute, you control a pilot, Will Mackenzie, who was hired by his ex-wife Astrid to deliver a mysterious cargo. Eventually, his plane crashed in the woods. Will is injured, and Astrid is missing, presumably lost somewhere in the wilderness. Your goal is to survive and to rescue your companion. Wintermute follows a linear plot and only allows you to explore a limited area. However, it is recommended to start with, since it serves as a sort of tutorial to the open-world sandbox mode. This is the most popular mode, in which you are not confined to the plot and can discover new areas.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hinterland Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":50778,"name":"A Way Out","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/473/473bd9a5e9522629d6cb28b701fb836a.jpg","description":"This action-adventure game released under the auspices of EA Originals Electronic Arts initiative. The game can not be played alone: ​​there is simply no singleplayer. The available options are either to play the game on one device using split-screen or using the online multiplayer. You do not need to buy two games to play with somebody: when buying a friend, you can give the code for downloading a full version of the game, which, however, will be active only if you pass it together.\r\n\r\nThe story tells of two prisoners who were together in one prison in the US at the beginning of the 70s. To avoid the dangers of prison, they decide to flee. A Way Out is a third-person adventure game in which the story is told simultaneously for two characters. Since they develop asynchronously, there are often situations where one of the players loses the control over the character because of the story cutscene, and the other can safely move around the prison. Roles are not fixed and can change during the playthrough.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":670682,"name":"Counter-Strike: Condition Zero Deleted Scenes","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9fd/9fd128fef547eb630182a1995b1edeb5.jpg","description":"Counter-Strike: Condition Zero Deleted Scenes (CS:CZ DS) is a bonus game, originally developed by Ritual Entertainment, included with Counter-Strike: Condition Zero making up a series of eighteen unconnected single-player missions which were cut from the main game.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5193,"name":"Oddworld: Abe's Oddysee","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ae/2aedae90b1377a0f3e5ce54d24f8e41a.jpg","description":"Oddworld: Abe’s Oddysee is the first chapter of the Oddworld franchise. The game is set in the fictional Oddworld universe inhabited by extraterrestrials. The story follows Abe, a slave on the Mudokon meat factory, who suddenly realizes the perspective of being slaughtered in the near future with all of his fellow slaves. Players are offered to take control of Abe on his way to the liberation of the rest of enslaved Mudokons. The gameplay features classic platformers’ mechanics: all the action is divided into 2D levels that should be passed. In the course of the completion, Abe is going to solve puzzles, overcome obstacles and defeat (or dodge) enemies. Each players’ mistake from failing a grenade throw to falling from high ground will cause death and a restart of the level from the last checkpoint, which means difficulties. On the way through the Oddworld Abe can use his supernatural ability to telepathically influence Sligs (unplayable characters). However, their help is only available in safe areas, so the Mudokons’ rescue is though up to Abe.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":14016,"name":"Tropico 4","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1e/d1e70ce3762efcfc170c6bd067d7e9e3.jpg","description":"Tropico 4 is a simulator/strategy game, where the player takes control of a small island nation as its president. The game is the fourth installment in the series, which have seen lots of changes throughout its existence.\nThe game focuses on the well-being of your nation’s citizens, the political sphere around the country and the economics. The player will face various difficulties in guiding the country through one of the most challenging times of our world. Victory can be swift, but the consequences will always happen.  The unique art style of the game, as well as the soundtrack and in-game humor, will provide an excellent experience for new and seasoned players alike.\nThe different paths that can be taken in the game for success’s sake will challenge the players to make the most exquisite decisions, and the overall goal of making all people happy is a challenge in itself. Juggling between different factions of people, dealing with disagreement, and sometimes foreign invasions and natural hazards.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":3368,"name":"Titan Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fc/2fc6994425146f9dba3133400b414e29.jpg","description":"Between our world and the world beyond it lies the Titan Souls, the spiritual source and the entirety of all living things. Now among the ruins and among the titans a lone hero armed with only one arrow gathers again the souls of the Titans in search of strength.\n\nTitan Souls is a 2D game in the open world with a top-down camera. The player has only one arrow and can only withstand one hit from the enemies. The main task is to defeat 19 giant monsters called Titans, who can also endure only one hit. There is only one way to beat each titan and only difficulty increases: the fact that the player needs to retrieve the only arrow after every unsuccessful attempt\n\nThe developers were inspired by Dark Souls the series Shadow of the Colossus and \"The Legend of Zelda\", taking incredible complexity, atmosphere and puzzles from them. The game was meant for replaying for truly devoted fans to achieve faster times and fewer deaths.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":250,"name":"The Binding of Isaac: Rebirth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/926/926928beb8a9f9b31cf202965aa4cbbc.jpg","description":"The Binding of Isaac: Rebirth is a remake of The Binding of Isaac.\n\nThe plot is based on a biblical story. Little Isaac and his mother live happily in a small house on the hill. And suddenly the mother heard a voice, which told her that her son is defiled by sins and must be saved. The voice asks the woman to remove all evil from Isaac to save him. There are 12 endings in the game.\n\nBy controlling Isaac or other of the six characters to choose from, the player must go through several levels of the basement, consisting of many rooms that are procedurally generated in the game, and the places are inhabited by hostile creatures with who you have to fight. Inside the rooms, the gameplay is designed as a shooter. The character can shoot to defeat his enemies with tears that he cries while avoiding collisions with them. Also, if the character loses all his health, he does not continue the game from the saved point, he dies. After that, the game starts from the beginning.\n\nThe game will include all the content of the original game, as well as some innovations: a new Chapter, new characters and enemies, as well as new items and rooms.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nicalis","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":16359,"name":"Divinity: Original Sin - Enhanced Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/33b/33b825c76382931df0fd8ecddf5caebe.jpg","description":"In the fantasy world of the game, there is a confrontation between the Order of the Sourcerers, the adepts of the magic of the \"Source\" and the Order of Source Hunters. Hunters believe that the Source's magic is dangerous and consider it their duty to destroy it.\n\nAt the beginning of the game, two characters are created, which the player will control. You can choose the gender, appearance, features and skills of the characters.\nThe game world is totally interactive. Almost all items can be transferred. For example, to make a barricade of them at the entrance. You can create strong combinations of objects. For example, tie a knife to a broomstick and get a spear.\nIn the game world, much is connected. If the enemy is wet, it will be harder to defeat him with a fiery spell. The player's actions also do not remain without consequences, especially immoral, such as looting and murder.\nBetween the characters is a dialogue. If it concerns a joint action, but the characters can not agree, the game itself will decide for them. It is interesting that the relationship in this pair can also develop in a romantic direction.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Larian Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]}]