[{"id":1230,"name":"Wheels of Aurelia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d61/d61928dc44ba1812244c7dd8f82700ce.jpg","description":"Soundtrack Included!Full game soundtrack included, including four songs written, composed, and performed for the game in the style of Italian 70s music.\nAbout the GameA narrative road trip game set in the roaring Italian 70s, it tells the story of Lella, a restless woman driving on the roads of the western coast of Italy, the famous “Via Aurelia”.\nThis is an interactive fiction in the shape of an isometric driving game and with a focus on replayability: every playthrough lasts about fifteen minutes and there are sixteen different endings to discover.\nThe 1970s in Italy were a time of terrorism, kidnappings, and political turmoil. Based on your choices and the places you'll decide to visit you may end up in car chases, illegal street races, or in tense debates with a catholic priest, and more from a cast of characters that you have never met before in a video game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Santa Ragione","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":783865,"name":"Shotgun King: The Final Checkmate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c31/c316119c765eadca9fd31a86fad8d82e.jpg","description":"Chess, but all your army has gone over to the white side, leaving you with nothing but your royal shotgun and your wounded pride. Carried by your dark folly, you decide it's time to teach those white pieces to fear the Shotgun King.\nEvery turn, you may either move your king or shoot at enemy pieces, after what you'll need to move again to reload your shotgun. Avoid checkmate and kill the enemy king to complete the floor. After each floor, you may choose between two random combinations of one upgrade for you and one upgrade for the other side. Choose wisely and keep on winning floors and you just may get your kingdom back.\nRuns may take ~20 minutes to complete. The game features 5 difficulties, plus an endless mode!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Goblinz Studio","platforms":[{"id":0,"name":"PC"}]},{"id":437062,"name":"THE WONDERFUL 101: REMASTERED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/888/8881f924d07c5d964850528a892596c1.jpg","description":"As Wonder Red, leader of the Wonderful 100, you will unite your band of Wonderful Ones to morph into powerful transformations such as a fist, sword, glider, gun, and more to battle invaders throughout Blossom City and across the world. The Wonderful 100—and YOU—are the city's best weapon.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Platinum Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":58351,"name":"BlazBlue: Cross Tag Battle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8d/d8de0c77a04b3421b74d98679bb5602a.jpg","description":"Digital Deluxe EditionThe following items are included in the Deluxe Edition:\n●Basic game\n●DLC Characters All-in-One Pack\n*You will be able to use the additional characters when they become available at their respective launch dates.\nAbout the GameTHE COLLISION IS INEVITABLE! THE IMPACT WILL BE UNAVOIDABLE!An unrivaled clash of explosive proportions! The beloved BlazBlue franchise Crosses universes, Tags in fan favorites, and Battles it out in BlazBlue: Cross Tag Battle! Created through an all-star collaboration between BlazBlue, Atlus’ Persona, French Bread’s Under Night In-Birth, and Rooster Teeth’s hugely popular RWBY web series, Cross Tag Battle celebrates the fighting genre for pros and newcomers alike! Choose your team in fast paced 2v2 team battles filled with the craziness you’ve come to love from BlazBlue, with all the tight mechanics, smooth gameplay, and gorgeous 2D graphics you expect from Arc System Works.\nBlazBlue, celebrating 10 years of fighting game excellence in 2018, is a series long beloved by the fighting game community for its deep and engrossing story, its vast cast of balanced characters, and its quick and kinetic gameplay style.\nAtlus’ Persona series, a worldwide RPG phenomenon and no stranger to the fighting game genre itself. Persona characters have appeared in Arc System Works games before, notable Persona 4 Arena and Persona 4 Arena Ultimax.\nUnder Night In-Birth is veteran fighting game developer French Bread’s first foray into an original title, coming hot off the heels of their success with the cult classic series Melty Blood.\nRooster Teeth’s animated mega hit, RWBY, has been a popular franchise for years, crossing both gender and age barriers to become a mainstream hit. Characters from the RWBY series have never appeared in a fighting game before. Until now.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Arc System Works","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":31495,"name":"Baldur's Gate","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a91/a9108384b5d691080b294cd744f350c9.jpg","description":"Forced to leave your home under mysterious circumstances, you find yourself drawn into a conflict that has the Sword Coast on the brink of war. Soon you discover there are other forces at work, far more sinister than you could ever imagine...\nSince its original release in 1998, Baldur’s Gate has set the standard for Dungeons & Dragons computer roleplaying games. Customize your hero, recruit a party of brave allies, and explore the Sword Coast in your search for adventure, profit… and the truth.\nRunning on an upgraded and improved version of the Infinity Engine, Baldur’s Gate: Enhanced Edition includes the original Baldur’s Gate adventure, the Tales of the Sword Coast expansion, and all-new content including three new party members.\nKey Features\nNew Adventure: The Black Pits\nNew Characters: The Blackguard Dorn Il-Khan, Neera the Wild Mage, and Rasaad yn Bashir the Monk\nNew player character voice sets\nNative support for high-resolution widescreen displays\nOver 400 improvements to the original game\nImproved multiplayer support with connectivity between all platforms","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"BioWare","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19557,"name":"Theatre of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b8/2b89858ce6c9eb04c68bbe477caf40f8.jpg","description":"A Strategy Board Game Like No Other\nThe rolling hills of the battlefield lay before you as you carefully move your units into position. The clock is ticking, and the enemy is already attacking the vulnerable city near the center of the board with bomber units. Will you pull off your attack and annihilate the enemy? Or will you be outsmarted by your cunning opponent?\nFrom the studio that created the Harpoon series comes this unique real-time strategy game set on a surreal tile-based board game battlefield. Wage war over three eras of combat: Clash swords and loose arrows in Medieval style, roll tanks and march infantry to victory in the Great War setting, and take to the skies with aerial units in the Contemporary mode. Each battle setting has its own unique set of pre-arranged battle scenarios to test your ability to use each unit’s strengths to your advantage, and to guard against their weaknesses. Put your strategic abilities to the ultimate test!\nEngage your opponent in a game that looks like Chess, but plays like a real-time strategy game with individual unit stats, projectile attacks, and the ability to move multiple pieces simultaneously.\nGain the advantage by adjusting your view of the battlefield between a 3D angle and an overhead tactical perspective. Zoom in and out, and pan the camera around the battlefield to find and engage your enemy.\nPlay against the computer in 35 designed scenarios, or compete against a friend in the local two player versus mode.\nNote: Original network multiplayer modes are included but, due to the age of this title, not supported for this release.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"1C Company","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":1125,"name":"WWE 2K17","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb2/eb299a5235932d21d32e1f8da06043dd.jpg","description":"Digital Deluxe Edition\nIn addition to the base game, the WWE 2K17 PC Digital Deluxe includes over 20 characters, 50 new moves and access to loads of additional content.\nOver $50 of DLC content!\nWWE 2K17 MyPlayer Kick Start\nNXT Enhancement Pack\nAccelerator\nLegends Pack\nNew Moves Pack\nFuture Stars Pack\nHall of Fame Showcase\nNot all DLC available at launch.\nAbout the GameNow on PC!  Welcome to Suplex City, courtesy of cover Superstar Brock Lesnar!  WWE 2K17 returns as the reigning, defending, champion of fighting video games! WWE 2K17 features realistic graphics, ultra-authentic gameplay, and the largest roster to date featuring your favorite WWE and NXT Superstars and Legends.Exclusive to PC, the WWE 2K17 PC Standard Edition includes the Goldberg Pack!Playable WCW Goldberg with black tights\nPlayable WWE Goldberg with black and white tights\nTwo Playable Arenas: WCW Monday Nitro and Halloween HavocImmersive Gameplay & More: Experience the most authentic WWE gameplay ever, featuring thousands of new moves and animations, backstage and in-arena brawling, and the biggest roster of WWE and NXT Superstars and Legends to date.Powerful Creation Suite: Create and develop your custom WWE with the deepest Creation Suite to date, featuring new creation options such as Create a Video, Create a Victory and a Highlight Replay system. New features and additional content allow you to create the most amazing custom Superstars, Arenas, and Championships.MyCAREER and WWE Universe with New Promo Engine: The all-new Promo Engine brings the drama and personality of the WWE Superstars to life in MyCAREER and WWE Universe modes. Choose your words wisely and smack talk your opponents, start rivalries or form alliances. Your words will shape your characters as they rise through the ranks of NXT and WWE to become WWE Hall of Famers! Become a Paul Heyman Guy in a new subplot exclusive to WWE 2K17.Soundtrack by Sean \"Diddy\" Combs aka \"Puff Daddy\": Enjoy a star-studded soundtrack featuring the top names in the music industry, such as Twenty One Pilots, French Montana and Black Sabbath, curated by Executive Soundtrack Producer Sean \"Diddy\" Combs aka \"Puff Daddy\"!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"2K","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":46970,"name":"SOS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/881/881cd0dc39b21fc3f0d9a726c2f552d4.jpg","description":"Congratulations, contestant!\n\nYou’ve been chosen to participate in SOS. An interactive game show in which you and 15 other contestants will be dropped onto La Cuna Island with one simple goal – Get the hell off La Cuna Island.\n\nHow it works is simple: Find a hidden relic, signal for extraction, and escape on the chopper. How to do it is hard: You’ll have to use your personality to build alliances, out-scheme opponents, and entertain the audience. Oh, not to mention avoid hordes of bloodthirsty monsters.\n\nIf you’re lucky enough to survive, you’ll be greeted with fame and fortune. And more importantly, you’ll still be alive.\nKEY FEATURES:\nSURVIVE THE SHOW – Contestants only have 30 minutes to find a relic, signal for extraction, and grab one of three spots on the rescue chopper.\nREAL-WORLD VOICE RESTRICTIONS – Players must find and interact with other contestants to survive, but like the real world, they can only communicate with those within shouting distance.\nBECOME A STAR – Harken back to the days of 90’s reality shows by setting up alliances, stabbing your friends in the back, winning the affection of viewers and becoming the ultimate star.\nCOMMUNICATE AND WORK TOGETHER – In SOS, a player's voice and personality become their ultimate tools for survival. With limited resources and no long-range weapons, a player’s ability to buddy up with other contestants, share resources and know when to go it alone is key. Three people can escape the island, make sure it’s your group!\nHERO PLATFORM INTEGRATION - Streamers have the ability to use Outpost Games’ Hero platform with SOS, giving them a new way to engage with viewers and grow their channels, while viewers can watch their favorite streamers play the game and become an interactive part of the experience like never before.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Outpost Games","platforms":[{"id":0,"name":"PC"}]},{"id":42120,"name":"Pro Evolution Soccer 2014","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c5/1c5f5781c1560df2e1e14fa158d3124d.jpg","description":"The Games on Demand version supports English and French. Delivering unbelievable realism, PES 2014 sets a new benchmark in soccer games. The ball is the focus, offering new levels of control and fundamentally changing play. Konami's celebrated Fox Engine offers stunning detail and combined with a new soccer system offers improvements at every level. Other key features include the M.A.S.S physics engine, which makes every tussle unique and true-to-life, plus new animation tech and emotion mapping of players, teams and fans.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"PES Productions","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"}]},{"id":28471,"name":"Tales of Vesperia","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7cb/7cb09794d809e4b30ad6fc487a23296c.jpg","description":"Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   \"Tales of Vesperia\" is the latest installment in the worldwide multi-million selling Tales RPG series. Experience sharp, beautiful graphics in HD, captivating voiced events and real-time, action-packed battles featuring all new enhanced systems such as \"Fatal Strikes\" and \"Burst Artes.\"","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":22576,"name":"Aporia: Beyond The Valley","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b0/4b0ea5c8b3271e7ee5a1ca0360655ef2.jpg","description":"\"... could well cement itself among the top puzzle adventure games of the longstanding genre.\" - PC Gamer (Preview)\n“The most striking thing about Aporia, to me, is that the Myst comparison feels right.” Kotaku (Preview)\n“The overall ambition and premise of the game have definitely caught our attention, as it’s a gorgeous world with an interesting narrative approach.” - Game Reactor (Preview)\nAporia: Beyond The Valley brings a unique approach to the art of storytelling, by not using dialogue or text. It offers new, interesting puzzle mechanics, and elaborate environmental storytelling within an immersive world.\nThe mystical world of Ez’rat Qin - once a mighty civilization, now a crumbled ruin.\nYou awake after hundreds of years of sleep, in an abandoned land and no memory of your past. Immersed in this world of dark beauty, thrilling mystery and ancient puzzles, you embark on a quest to find out what happened in this world, and to discover who you are.\nAporia: Beyond The Valley is a first person puzzle game set in the world of Ez’rat Qin. Explore a world filled with strange nature, ancient technology, and haunted by a spirit roaming the fog-covered forest. With a whole new story and puzzle mechanics, Aporia: Beyond The Valley presents players with the challenge of actively exploring and piecing together a non-linear story of what happened in this mysterious world.\nKey Features -\nAn immersive, detailed world created in CryEngine.\nExplore a story about humanity, technology and civilization told without text or dialogue. Uncover clues, devise theories, and make up your own mind.\nAvoid traps and solve brain twisting puzzles made to make you question what happened in The Valley.\nExplore bizarre architecture and overgrown nature, choosing your own path in the game’s non-linear world.\nCompletely original musical score.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Investigate North","platforms":[{"id":0,"name":"PC"}]},{"id":21616,"name":"A.I.M.2 Clan Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af3/af30874ae76d8789c1ae50da6c367dfe.jpg","description":"A.I.M. 2 is the sequel to the epic science fiction first-person action RPG developed by SkyRiver Studios. Its compelling story and unique look lift off exactly where the original ended.\nNew clans led by Mechminds of the Fifth Generation are powerful and well-organized formations with far-reaching plans. Powerful groups have different interests that often crossed, war broke out again. However this time it is the struggle not for mere control, this is struggle for survival. The clans want to eliminate the weaker ones standing in their way and will stop at nothing to dominate their enemies. To achieve their goals they use not only military means, but economic ones as well. As of now none of the clans has managed to achieve complete victory.\nYou are a part of the oldest clan called the Reckoners, a dedicated group looking for the firstborn Mechmind of the Fifth Generation. This could be a chance to restore former might for your clan which has lost its power and even be victorious in the war.\nThis version of the game has been updated specially for Steam to make it compatible with modern PCs.\nOriginal sci-fi storyline plunging you into the world of intelligent robots\nOpportunity to create a personalized clan consisting of independently operating machines\nTactical operations as well as clan strategic management\n36 different gliders are available to fly\nHuge game world with diverse locations, including subterranean caverns\nDifferent options to interact with other Mechminds\nAdvanced trading system\nUpdated for compatibility with modern PCs","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"SkyRiver Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18675,"name":"Dragon Saga","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/961/96104a4102db6b848d338f27877eee37.jpg","description":"Dragon Saga is a free to play arcade style side scrolling 3D Fantasy MMORPG set in a world of Dragons and magic. Choose one of six classes (Warrior, Mage, Thief, Archer, Shaman, and Twin Fighter) and explore a rich world filled with unique monsters. Power up to unlock devastating abilities, hidden combos and hilarious skill effects.Explore a Wonderful Fantasy world filled with Hilarious Monsters and Characters.Engage in Dragon Saga's unique Skill-Based Action Combat.\nAdventure with your friends through over 30 Unique Maps.\nStarting with 6 Unique Starting classes expand into 30 different classes and customize your character.\ninvite your friends to your own Private Home with decorated with furniture that give you in-game buffs.\nTake care and love a large variety of pets that gives you buffs and sometimes a ride.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gravity Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":16508,"name":"Rising Angels: Reborn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96c/96c941e09dba90a1b1a1636b194cf730.jpg","description":"Despite brilliance and skill, Natalie Puccile, a Special Investigations and Tactics officer with the Katajion Directorship, has spent her career watching over a listening post in the middle of deep space. After the orders that she has always dreamed of finally arrive, she finds herself in charge of a small destroyer and tasked with discovering the fate of a missing research team investigating an ancient civilization. Mystery swirls all around her as she reunites with old friends, meets emotional trials head-on, and faces the danger with new allies.\nAs the universe she knows falls apart around her, it is up to Natalie’s brilliance and the dedication of the crew of the KSS Nimross to avert a galaxy-shattering event that could spell the end of all space travel. With determination in her heart, Natalie rises to the chance to beat back the danger and perhaps find love in the twinkling lights of the distant stars.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"IDHAS Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14153,"name":"Rise of the Ancients","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68f/68f4f9437379719ce9e67d2175b73c87.jpg","description":"They appeared seemingly from nowhere and are ready for battle... You have to take up the defense of the land and prevent the Ancients from seizing the kingdom! Devise defensive strategies to ward off the attacking enemies!\nIt's a hardcore classic Tower Defence. Even tutorial in this game is hard to beat. Only few can complete this game. A lot of different levels and special effects are waiting for you. There are many types of enemies who require unique tactics.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Talentplace","platforms":[{"id":0,"name":"PC"}]},{"id":13591,"name":"OR","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a2/2a26601630d1f0334e937cfd8f2b865c.jpg","description":"Do not underestimate the apparent simplicity of OR because it will amaze you. In the game there will be pitfalls of every kind! The 3D graphics allows you to see the light from above. This opens up a world of possible combinations. With gameplay based around light, OR is a simplified Puzzle/Arcade game.\nPlay through 10 worlds with progressive difficulty, let the light guide you!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Camagames","platforms":[{"id":0,"name":"PC"}]},{"id":12917,"name":"UBERMOSH:WRAITH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d7/9d74c58c6fc8b0f2c3dd8918c5ee0e51.jpg","description":"Cut bullets with your sword in a gun filled pit. The the fourth volume of the series blends the projectile cutting from the original UBERMOSH, the psionic power Brainclap from UBERMOSH:BLACK, the swarm and endless map from UBERMOSH Vol.3, the new power Manastrike, a new class of enemy, more agressive enemy respawns, more achievements, various class mods and more music to pump the combat.\nFrom rookie to a godlike entity, UBERMOSH:WRAITH boost up the initial concept of \"90 seconds arena\" and invites you to react faster to beat your previous scores.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Walter Machado","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12765,"name":"Party Jousting","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a20/a20299bf89cd29020d82669acce00efd.jpg","description":"YouTube: Chicharoney\nYouTube: Rufus Draconem","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"vikingfabian.com","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":12159,"name":"Bad Dream: Coma","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/685/6852e30bb358bbf005d8e14191df5f8b.jpg","description":"Welcome in Bad Dream: Coma. A point&click  game where unique minimalistic art style creates an unforgettable and atmospheric experience. Travel through the surreal and disturbing dreamland where everything depends on your actions. You can't die but you can suffer greatly...\nTIP OF THE ICEBERG\nThe game is designed in the \"action-reaction\" way and there are no obvious choices. Beat the game once and then be curious \"What if I would do it differently\". Sometimes it's something small but from time to time you'll see huge differences. The smallest things can be most rewarding.\nDARK, SAD AND DISTURBING WORLD\nVisit the place known from the previous chapters of the Bad Dream Series. Encounter well known creatures in their new form, or find the way to erase them from your memory and turn this dream to the peacefull nap.\n* highly atmospheric world created with simple yet beautiful graphic design, and carefully selected sounds\n* non-linear gameplay with high replayability\n* hidden content for curious players\n* original soundtrack","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desert Fox","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":8093,"name":"Zombie Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/854/8541cd7b85b52245908e59a59a006b22.jpg","description":"Epidemic, you're a Special Forces unit fighter, that's why you're still alive. Your task is to hold your positions.\nSingle Player:  Kill hordes of zombies alone.\nCooperative game:  for 1-4 players.\nWeapons:  Check out the wide range in the arsenal and arm yourself with your favorite firearms! (currently 5 types of weapons)\nZombies:  An easy target, but they get stronger and faster each time\nMutants:  Difficult to kill, getting faster each time\nLocations:  2 highly detailed maps on which you can think about where to hold the defense.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Teyon","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":720950,"name":"Martial Law","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d56/d565c8f998468b59f79125b8164f774f.jpg","description":"Martial Law is a game about difficulties that came with Communism in Poland. Game is meant to visualize the realities of Polish families back then, their ways of thinking and understanding the world. The story is shown from the perspective of a man who is abandoned because of his low social status. He tries his best to be there for his daughter despite the difficulties. Game is also meant to be educational. There are many places you can stop to learn more about Polish culture from the communist era.Martial Law features! Many endings!\nVisual Novel\nLearn more about polish culture from the communist era\nSolve family issue\nGet beat up by a “comrade for debating”\nTalk to a grumpy old man!\nMake your kid happy. :)\nMake right choices, or don’t. It’s up to you.\nGame originally developed during GameJam Polskigamedev.PL 2021","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"FIXER","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":257189,"name":"StarCraft: Brood War","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d4/5d43fe0388f02f989d6afb0a9d50ad6c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Saffire","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60633,"name":"MU Legend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/43d/43db161826e5aebaff969f35eda7beb4.jpg","description":"Following the footsteps of internationally successful MU titles (MU Online, MU Origin), MU Legend offers an authentic alternative to the dungeon crawler gaming experience.\nA game with its own unique signature, MU Legend blends the dark fantasy world of an MMO with the richness of hack 'n' slash gaming.\nEnhancing the key features that have made the ARPG genre popular over the decades, MU Legend allows the imagination to run wild through a world of RPG myths and legends.\n\"Rich PvE and PvP Content\"\nMU Legend gives players unparalleled access to a wide array customization and a vast range of PvE and PvP content.\nPvE-driven players can enjoy a great variety of features: From procedural solo & co-op dungeons to legacy MU content such as Blood Castle & the Endless Tower, players are spoiled for choice when it comes to hunting for the greatest gear.\nFor PvP aficionados, matchmaking and ranking systems allow the most skilled players to rise to the top and get the recognition they deserve: Warriors can not only face off in classic 1v1 battles, but can also claim victory in 3v3 team brawls. Plus, guilds can get in on the action in a massive tournament where up to 16 guilds compete fiercely for 1 territory. In MU Legend, PvP players have all the opportunities they need to shine on the battlefield and make their mark on history.\n\"Experience the difference of MU Legend with fast-paced & action-driven gameplay of a new kind.\"\n\"Immersive, powerful atmosphere\"\nFrom the very first level, MU Legend evokes a sensation of almightiness.\nIn best hack 'n' slash tradition, but unlike most current action RPG games, all classes in MU Legend possess powerful area-of-effect skills right from the start, making levelling a truly thrilling and satisfying experience for players of all levels.\n\"Character and Skill Customization Unleashed\"\nMU Legend offers deep and sophisticated character skill customization, which is a dream come true for those skill-tree designers out to satisfy their curiosity or improve their gameplay abilities.\nEach character can be customized and tailored to fit any player's gameplay methods!\n\"Suitable for Low- and High-Spec Computers\"\nPlay MU Legend on a wide range of systems: Powered by Unreal Engine 3, MU Legend is supported both by more modest PC configs as well as those with the best hardware setups.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Webzen","platforms":[{"id":0,"name":"PC"}]},{"id":36189,"name":"Sonic Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a81/a81b9c8026fa40e060a08b24093008ea.jpg","description":"Sonic teams up with Knuckles, Tails and nine other characters from Sega's classic Sonic universe in a new take on platforming action in Sonic Heroes for PlayStation 2, GameCube, and Xbox. Utilize the abilities of three different characters in order to complete levels by switching on the fly. Four teams of three characters: Team Sonic, Team Dark, Team Chaotix, and Team Rose race through specially designed levels that require logical character switching. Level designs promote replay value by adding multiple paths and missions. New Sonic story is told through cinematic pre-rendered movies between levels.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Sonic Team","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":35351,"name":"The Lord of the Rings: The Battle for Middle-earth","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e8/3e81bd749511c8a841e65da9375efb5c.jpg","description":"###Experience Middle-earth like never before in The Lord of the Rings’, The Battle for Middle-earth’. \nThe first The Lord of the Rings game that puts you in command of a real-time, open world. Control the legendary heroes, massive armies, and epic campaigns of Middle-earth based upon all three films of The Lord of the Rings’ trilogy. From waging all-out combat among the vast forces of good and evil to controlling your favorite heroes and characters to managing the troops and resources of your side, the fate of a living, breathing Middle-earth is in your hands.\n\nWhether choosing to command the forces of good or evil, PC gamers are in complete control of the epic campaigns depicted in all three films of the trilogy. More than faceless units, every character in the game expresses real-time emotions that change depending on their situation—watch your swordsmen tremble with fear as they nerve themselves to face advancing Trolls and feel their exultation as they celebrate a hard-fought victory.\n\nBuilding on a highly advanced version of the acclaimed Sage 3D game engine first used in Command & Conquer’ Generals, The Lord of the Rings, The Battle for Middle-earth allows you to command the forces of light or darkness in two separate campaigns. You'll have to choose your forces wisely, since each army has its own unique strengths and weaknesses. The Lord of the Rings, The Battle for Middle-earth offers a truly memorable entertainment experience: the first RTS game that brings an entire world to life.\n\n###Key features\nEpic battles\nFight the epic, sweeping battles from the Academy Award-winning The Lord of the Rings’ film trilogy from a whole new perspective—as commander of hundreds of soldiers and creatures.\n\n###Massive armies\nControl massive armies and interactive battlefields across the vast world of Middle-earth.\n\n###Lead the forces of good or evil\nLead the forces of good or evil by controlling one of four unique groups, from the Riders of Rohan to the forces of Sauron, each with its own playing style, resource management, and base-building techniques.\n\n###Highly detailed map of Middle-earth\nTake command of strategic territories across a highly detailed, 3D map of Middle-earth and turn the tide in the battle to control The One Ring.\n\n###XP base hero system\nForge new heroes, customize their abilities and powers, then lead them into battle where they'll gain experience and rank in their quest for victory.\n\n###Life-like units that display emotions\nWatch your armies come to life as they express emotion—from anger to fear to triumph—when reacting to events and their surroundings.\n\n###Streamlined interface\nMake smarter and faster decisions in the heat of battle with an all-new intuitive, streamlined interface that gives you contextual control of your forces and structures.\n\n###Massive multiplayer online battles\nChallenge fellow rulers online in massive multiplayer battles.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"}]},{"id":20121,"name":"All Is Dust","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aed/aed3882dd30abbe7867a45ba6029492e.jpg","description":"It’s the year 1931, and Oklahoma has been brought to its knees by the Dust Bowl. But the suffocating dust is the least of your problems...\nTake on the role of Thomas Joad, a proud farmer and father. Over the course of three nights he tries to unravel the mysterious and horrific events that are plaguing his once beautiful land.\nExplore the dried up farm to find clues to what’s going on. Evade and outsmart the dangers of the field. Unravel the events leading up to these horrific nights. Try to come to terms with your fragile existence.\nAll Is Dust.\n--------------------------------------------------------------------------------\nExplorative gameplay interspersed with terror and panic.\nOculus Rift compatible for the most immersive horror.\nHand-drawn cutscenes.\nEerie 1930s themed music and SFX.\nTotally free! No DLC or nothing!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mannequin Games","platforms":[{"id":0,"name":"PC"}]},{"id":18296,"name":"Containment: The Zombie Puzzler","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e2/0e26c1b396ebcc7256fcefedc96e64ea.jpg","description":"Containment: The Zombie Puzzler is an action puzzle game like you’ve never seen before. The goal of Containment is to surround zombies with survivors of the same color. But watch out for the zombies—they'll fight back by infecting the survivors in the street. Through the game's pulse-pounding campaign and multiple survival modes, you'll use your wits, items you find you along the way, and even the town around you to contain the zombie outbreak.Key Features:Not a Match 3 In Containment, you don’t match three of anything—you eliminate zombies by surrounding them with survivor tiles.\nThese Tiles are Alive Each tile is a fully animated character that interacts not just with its fellow survivors and zombies, but also with the environment.\nUnique Storytelling There's no time for cutscenes or dialog boxes when the undead are trying to eat you—the story of Franklin County and its survivors is told through in-world text as you make your escape through what's left of the city.\nReal-Time/Turn-Based Containment combines the cerebral strategy of a puzzle game with all the real-time action you'd expect from a zombie attack.\nWMD’s Playing the game well rewards you with useful items that you can use against the zombie horde to devastating effect.\nThe Environment is Your Friend Franklin itself becomes a weapon as you knock over signs, power up heavy cranes, and roll cars over zombies.\nBoss battles Yeah, that’s right. We even have boss battles. You haven’t seen zombies like these before.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bootsnake Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14659,"name":"Stigmat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a16/a165f806feccc6fbe89ee0d373748283.jpg","description":"Little game about a small but brave and courageous creature who lost the most precious thing in life - his only eye.Walking on a sunny hills, our hero meets the most ruthless and evil enemies in the underworld - Doctor Worm. Villain has swallowed the eye and hides deep into his laboratory. And our hero falls into the pit. Dr. Worm has been stealing different body parts for a week from people of sunny hills to create a horrible monster with which Dr. Worm wants to capture the world. Your task is to get your eye back and do away with the villain forever!\nFeatures:\n1. Hardcore platformer with special graphics;\n2. More than 15 levels in each of them you will find the deadly traps and mystical mysteries;\n3. Move through the story and get additional effects and hats for the hero;\n4. Epic music that will make you listen to it over and over again;\n5. Secrets rooms with interesting details, characters and objects","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Akakiy Petrushkin","platforms":[{"id":0,"name":"PC"}]},{"id":13716,"name":"AXYOS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/942/94264511c88fb211ea454dfcac3b06fe.jpg","description":"AXYOS is an experimental FPS being made for players by players!\nInspired by giants of gaming industry, we made a decision to create our own game, which would inherit some key aspects of FPS and MOBA genres but was built relying on opinions of common gamers. This is how AXYOS came to be. Together, we can make this game happen!\nTo say it simple - this game is a combination of a MOBA genre and mostly multiplayer FPS. We are trying to implement MOBA elements such as Ingame shop and session level-up system inside of a shooter mechanics. By the time of full release, we will introduce more and more of such elements and balance these two genres within one game.\nWe are set to leave the Early Access program and get to full release as soon as it is possible!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Axyos Games","platforms":[{"id":0,"name":"PC"}]},{"id":13368,"name":"GlassWire","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc8/cc829c281ed92257e79efb0934345ec5.jpg","description":"GlassWire visualizes all your network activity so you can improve your Internet connection quality, save bandwidth, and help protect your computer from malware. If any unusual network-related activity is detected GlassWire warns you with a temporary polite notification that won't disturb your game-play.\nDo you host any games on remote servers? GlassWire can monitor your game servers remotely so you can check their network connection quality, detailed bandwidth usage, and also look out for hack attacks. Do you not agree with how much bandwidth your hosting company claims you are using? If so you can double check your daily, weekly, or monthly bandwidth usage with GlassWire.\nIf you notice a strange connection on your computer or game server GlassWire allows you to block the connection with its simple firewall. Since GlassWire works with the built in Windows firewall it's unlikely to cause stability problems with your software or computer.\nProtect your Internet resources, computers, and remote servers with GlassWire's free network security monitoring software.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SecureMix","platforms":[{"id":0,"name":"PC"}]},{"id":9667,"name":"Love, Money, Rock'n'Roll","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/243/243e88ecc6c6f267454d2986a3605753.jpg","description":"Nikolai, the son of two soviet engineers and a normal Japanese student, has no idea his world will soon be turned over. The familiar and dear will clash with the grim ghosts of the past in his soul. Now Nikolai will have to decide whom can he really trust and find out why those with power and money have taken an interest in him, the lives of average people insignificant to them.Heroines\nHimitsu is Nikolai’s childhood friend. She is kind, caring, she always worries for him, sometimes even too annoyingly so. But is simple friendship really enough for her? Perhaps, the years of devotion earned her something more?\nCatherine is Nikolai’s ex-girlfriend who left Japan about a year before the beginning of the game’s events. Their parting wasn’t the prettiest, and Nikolai still carries quite uncomfortable memories about it. Perhaps he would have forgotten them with time, but Catherine suddenly returns and, moreover, transfers into his class. Why did she return? Does she still love him? Does he still love her?\nEllie is the granddaughter of the board chairman of the school Nikolai goes to. She is a self-willed, proud girl and thinks highly of herself, but cannot be said to lack ardour. Is everything really as simple as it looks at the first glance, or is there more than meets the eye behind the image of a spoiled young lady?\nKagome is the representative of Nikolai’s class. He has never paid attention to her before, but a certain sequence of events makes them come to know each other. Kagome isn’t loved in the school, and she isn’t really burning with desire to become friends with anyone either. Is there a reason for her behaviour? What hides behind the facade of a simple unsociable girl? What secrets does she hide?Main featuresFour heroines, each with her own story and several possible endings\nOver 100 backgrounds and over 100 event CGs\n3,5+ hours of music\nUnity3D as the game engine\nOver 300 000 words in the script\nFully animated background and character sprites\nMultiplatform (including web- and mobile versions)","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Soviet Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":3584,"name":"Resonance of Fate","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23c/23c05dddf504b4990619f5aca006ce53.jpg","description":"Resonance of Fate is developed by the heralded RPG developers, tri-Ace, who have had a hand in developing some of gaming’s most celebrated RPG franchises. Sega and tri-Ace now introduce Resonance of Fate, which adds a new spin to the genre with a new cinematic action gameplay system centered around gun play and a steam punk styled world.\n• Experienced RPG development team, Tri-Ace, behind this entirely new vision of fate within a steam punk world\n• Battle in fantastic cinematic action wielding firearms in a Semi-real time gameplay system\n• Built around the gigantic machine city, the story will delve deep into fate and the machinery that controls it.\n• Masterfully crafted environments illustrate the deep tapestry of this dystopian world\n• Customize your characters and weapons changing your playing experience visually and  within the gameplay\n1 player\n1MB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\nSEGA is registered in the U.S. Patent and Trademark Office. SEGA, the SEGA logo and RESONANCE OF FATE are either registered trademarks or trademarks of SEGA Corporation. © SEGA. All rights reserved.\nDeveloped by tri-Ace Inc.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":1055,"name":"You Must Build A Boat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/199/1998f74879b6f184d6a05cdd67057741.jpeg","description":"You must build a boat.\nYou must spring out of bed.\nYou must bargain with the lizardman.\nYou must heed your undead navigators.\nYou must slide rows or columns of tiles on a 6x8 grid.\nYou must match at least 3.\nYou must run to the right.\nYou must focus intently on 2 areas of the screen simultaneously.\nYou must match keys to unlock chests and swords to attack.\nYou must literally collect your thoughts and trade them for dragons.\nYou must not dally.\nYou must not be too hasty.\nYou must voluntarily ramp up the difficulty by taking on multiple quests at once.\nYou must incrementally reach your goals. You must build a boat.\nYou must try again.\nYou must try again x5.\nYou must win every time, even when you don’t.\nYou must remain optimistic.\nYou must upgrade your magic staff.\nYou must occasionally stop playing to allow for your hand to uncramp.\nYou must take credit for random chain combos you made no effort to arrange.\nYou must trust a blue bean man to make dangerous investments with your money.\nYou must forget about the blue bean man.\nYou must mind the asp.\nYou must reconcile that despite the game’s title, you begin your journey in possession of what is, in no uncertain terms, already a boat.\nYou must build a boat.\nYou must go all-in on the retro aesthetic.\nYou must trade junk for gold with the voidorb.\nYou must pray for salt.\nYou must consume fish and tomatoes for time.\nYou must venture through hell.\nYou must disarm traps like your life depends on it.\nYou must make an offering at the chapel.\nYou must rally the Fantasy Union and the Undead Buddies to your cause.\nYou must weigh anchor and methodically yet joyously hop in sync with your entire crew.\nYou must feign interest in critiquing the gardener’s work.\nYou must look up at the clock and wonder how it’s so late already.\nYou must build a boat.\nYou must build a boat!\nYOU MUST BUILD A BOAT!!!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"EightyEight Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":455513,"name":"Gloomwood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/48d/48da9c403b56050377a8d335ab7bb79b.jpg","description":"Gloomwood is a stealth horror FPS that follows your mysterious abduction to a forgotten, twisted Victorian metropolis in the midst of a horrifying transformation. Wield your canesword and take to the shadows as you uncover the accursed mystery hidden within the fog.\n\nFrom the producers of DUSK, AMID EVIL and FAITH comes a frightening, gothic immersive sim that will have you explore haunted streets, dark tunnels and decadent mansions.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"David Szymanski","platforms":[{"id":0,"name":"PC"}]},{"id":375282,"name":"Total War Saga: TROY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/750/7505f6d30a1c6dac215728bd53e7fccb.jpg","description":"Mac & Linux\r\nA Total War Saga: TROY will be released for macOS and Linux shortly after Windows.\r\nAbout the GameIn this legendary age, heroes walk the earth. Yet it takes only a single impulsive act to spark a conflict that will shake the world. Audacious Paris, prince of Troy, takes beautiful Helen from her palace in Sparta. As they sail away, Helen’s husband, king Menelaus, curses her name. He will bring his errant wife home – whatever the cost!\r\nKing Agamemnon, wide-ruling lord of finely-walled Mycenae, hears his brother’s call. He summons Achaean heroes from far and wide, among them swift-footed Achilles and Odysseus of the silver tongue. The Greeks set course for Troy, towards inevitable war and slaughter. For there, on the battlefield before the great city, legends will be born…\r\nTROY is the latest Total War Saga title; inspired by Homer’s Iliad, it focuses on the historical flashpoint of the Trojan War, evolving the series with new period-inspired features.\r\nThrough Total War’s unique blend of grand, turn-based empire management and spectacular real-time battles, Troy explores this epic conflict from both the Greek and Trojan perspectives – peeling back the layers of myth and legend to reveal the realities that may have inspired them.\r\n\r\nExperience the events surrounding the era-defining Trojan War, brought to life as never before. Realize your legend as one of eight iconic heroes. Dive into a character-led narrative drama and overcome your antagonists. Build your empire through strategy, statecraft, diplomacy and all-out war, as you conquer this vast and striking recreation of the Bronze Age Mediterranean.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Creative Assembly","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":279033,"name":"A Dance of Fire and Ice","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff9/ff937e37fd58db9f77873f2018b1ec15.jpg","description":"A Dance of Fire and Ice is a simple one-button rhythm game.\nPress on every beat of the music to move in a line.\nEvery pattern has its own rhythm to it. It can get difficult. This game is purely based on rhythm, so use your ears more than your sight.\nNote that it is quite strict and unforgiving, so please play the online version here if you're not sure if this is for you! If you've played the Rhythm Heaven series - this is about as strict as that.\nExplore the cosmos: Soar through each genre of music in a variety of colorful fantasy landscapes.\nPredict every moment: With a track that shows you every rhythm ahead of time, you’ll learn to sight-read levels as they come. No tricks, and nothing is reaction-based.\nPlay new levels for free: Tackle new songs and new rhythms as we expand the game with free level patches over the coming months.\nCalibrate your experience: Manually adjust your calibration on-the-fly, or use our auto-calibration method. The game is precisely timed, and you won’t experience any slow desync over time like you might with other music-based twitch games. (We’re musicians and off-sync games hurt us.)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"7th Beat Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":36858,"name":"Eets","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/104/1041893771063f87d42aa8098561e472.jpg","description":"Eets is a puzzle game developed by Klei Entertainment. The game draws heavy inspiration from the classic Lemmings and The Incredible Machine. There is no story mode present in the game.\n\n###Gameplay\nThe game features 100 levels with 600 more available for download free of charge. \n\nEets is the main protagonist of the game. This tiny creature is afraid of the dark, gets angry when it gets hit and becomes happy when it eats a bit of small sweet orbs. The main objective of each level is to guide Eets to the exit of the level by manipulating his mood, solving puzzles and putting specific items in the right places. For example, explosive mushrooms can be used to get Eets over a pitfall, whales can be used to push the items up in the air, and the gravity pills can allow Eets to reverse the gravity and walk on the ceiling. \n\nThe game features a mood system. When Eets is angry, it jumps a bit higher. If it is frightened, it may not jump at all. \n\nIn the Xbox 360 version of the game, an action mode is included. This mode is heavily inspired by the Patapon series of games, where the players use the button combinations for Eets to execute specific actions and prevent it from getting killed by an endless horde of enemies created from something that appears to be Marshmallow. There are multiple types of these enemies, each of which acts out differently.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":22318,"name":"VITATIO 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d8/4d83d24d6ce2c154726587c5bb9d25e7.jpg","description":"VITATIO 2 brings you a new take on the previous game, in this game you have to guide your crystal through the mazes, collect power crystals and bring them to the power core in order to power it up, you can pass a level with 1 power core but for the 100% achievements you will need to bring them all back\n★ TRADING CARDS\nCollect all 5 trading cards!\n★ DIFFICULT GAMEPLAY!\nYou will need to be very careful not to touch the sides as you guide your crystal straight and true through the maze\n★ TRAIN YOUR REFLEXES!\nVITATIO 2 requires patience, planning and a steady hand, one small slip and you're finished\n★ ACHIEVEMENTS!\nThe game includes over 85 achievements for you to unlock!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ColloseusX","platforms":[{"id":0,"name":"PC"}]},{"id":19755,"name":"Ragnarok Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d1/2d15a5802b276caf76f0e23410dce74f.jpg","description":"After a thousand years of a fragile peace, clues showing that the war between Gods, Humans and Demons, that was once responsible for an unspeakable destruction, could have started to appear. As troubling events happen, rumors rise about mysterious and evil forces coming back to life. What could have possibly happened to Ymir, that God supposed to maintain peace over the world ?\nAfter the long and gruesome war between God, Humans, and Demons... Scarred during the dangerous moments in battle, and avoiding total destruction altogether, the Humans, God and Demons entered a long truce.\nThe 1000 years of fragile and forged peace...\nIn the land of Midgard, the existence of peace eventually led the humans to erase their memories of the scars and hardships of the wars in the past. Not remembering the faults of the past, culture was spreading throughout the land along with selfishness, corruption, and arrogance.\nThen one day, strange occurrences started happening, breaking the balance that once existed in Midgard. There came a strange howl from the boundaries that divided the humans, God, and demons; creatures began attacking; increasing earthquakes and hail - and...\nThe mysterious legend of demons...\nAs the fragile peace began to fall apart, stories about the parts of Ymir, protecting the peace, began to spread among the adventurers. Forgetting the true nature of it, people set out to seek each of the pieces for their own selfishness, and the wealth that would come with it...","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Gravity Europe SAS","platforms":[{"id":0,"name":"PC"}]},{"id":17212,"name":"BlackSmith HIT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87a/87a5799f22254bf16532d0887089ac67.jpg","description":"BlackSmith HIT – Hit the iron when it is hot! And show who is the real blacksmith!\nSarcasm mode on :-)\nBlackSmith HIT is exclusive and interesting arcade game, which proffers ultra realistic hammering experience that features stunning graphics, amazing animations and simple intuitive controls. Hammer the gold iron, toss away the cold ones and earn amazing rewards by unlocking new levels.\nBlackSmith HIT is promised to render dynamic strength of character in you and guarantees you tremendous satisfaction, only if you are up for it. If you’ve what it takes to be a real blacksmith, your hammer awaits you, grab it and smash ‘em up hammer man. All the earnest players who have the passion and zeal to compete, BlackSmith HIT has it all stored for you.\nBrand your name among the best blacksmiths in the world.\nAs tempting as it sounds already, the game is reasonably simple. All you’ve to do is HIT and CATCH! HIT HARD AND PLAY SMART! Your priority is to keep the anvil at the highest temperature. Well of course there’s a catch. To optimized the right level of temperature toss the gray iron bars over your shoulder with the pliers in your hand.\nWin maximum number of real gold horseshoe and accomplish as many as strokes you can. Your progress will embark a world full of possibilities for the blacksmith. With every pre-defined sets of challenges you complete a new and bewildering blacksmith character is unlocked. You have to unlock 13 surprisingly creative characters and 13 scenes tailored to them. Your every move is important, and it is followed by a certain reaction.\nFeatures of the game:\n- multiplayer mode only on Steam (for 4 Players!)\n- be the best blacksmith in the world\n- experience the astonishing graphics, amazing animations and splendid soundtrack\n- choose from 13 awesome characters and tailored scenes\n- earn gold horseshoes and you decide how to spend it\n- try the addictive and intuitive gameplay\n- gain bonus score in the HIT&HIT\n- compete with others and check out your score on the global results\nWhat are you waiting for? Suit up; let out the THOR inside you grab your hammer because you know you're worthy of it and HIT LIKE A BLACKSMITH!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ENTERi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]