[{"id":861280,"name":"From Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fe/0fe11b6e3ca05679b3fbe3a75133991c.jpg","description":"That's no bubblegum army, that's an endless horde of menacingly pink aliens taking over our planet! Enough sweet talk, grab your gear, we need you and your squad to defeat the pink pests!\n\nYOUR MISSION: Liberate Earth from the Alien horde!\n\n\nWhile you can play From Space solo (if you're brave enough) you'd be wise to invite some friends to help you out. With online play you can create a four-person squad. Look, there's a lot of those pink pests out there so the more people, the better. Oh, and with a squad, you'll have some witnesses to tell everyone how awesome you are. It's basically a win-win scenario.\n\n\n\n\nWith a variety of weapons (Rocket Launchers, Miniguns, Flamethrowers and more!) there’s no excuse not to annihilate those aliens! Build your ideal spec and use tactical items such as grenades and mines, or slow down the hordes with barbed wire and machinegun turrets. Remember to scavenge the world for loot, you'll need it!\n\n\n\n\n\nNo matter what type of player you are, there’s a wide range of characters in From Space's roster, each with their own unique ability and weapons. Find the perfect balance with your friends as you build the ultimate super squad.\n\n\n\n\n\nAs you level-up, you’ll be able to attach special perks to your character, helping you to master the art of destroying aliens. You'll need to find ways to combat increasingly more powerful aliens, and perks will help you accomplish all of your pink alien squashing dreams. Need to rethink your strategy? No problem! We like innovators! Perks can be swapped around, even between your squad!\n\n\n\n\nWe’re going to level with you... an alien threat is terrifying, terrifyingly fun! Look, the world is already pretty beat up as it is. Who's going to notice if you cause a little bit more destruction while saving the day? People have insurance it's fine...","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Triangle Studios","platforms":[{"id":0,"name":"PC"}]},{"id":680044,"name":"Come Home","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9e/d9e5b749589cc80daffba66f25d6d4ab.jpg","description":"When your father goes missing, you return home from studying abroad to help uncover clues to where he could have gone. But returning to your hometown brings back a lot of old feelings and you soon find yourself meeting new people and rekindling relationships with old friends as well. How are you supposed to focus on finding your father, when there are so many other interesting characters who all want your attention as well. You can't just let love pass you by. Your father would understand.\r\nCome Home has 20 romanceable characters, each with their own individual storyline. All romances are optional, so you can pick and choose the characters you like, ignoring the ones that you don't. None of the romance paths are required to play through the main story. You decide how you spend your day, from focusing on schoolwork, to dating, to just hanging around the park or playing games on your computer. An in-game hint system is there for you if you get stuck, making walkthroughs unnecessary.\r\nThis is an adult game and there is a lot of sex in it. There are many scenes that will happen throughout the story, along with repeatable activities with the many characters in the game. All scenes are fully rendered and there are plenty of animations as well. Plus, any time that you'd like to see a scene again, you can replay the scene in its entirety from the gallery.\r\nThere are so many interesting characters waiting for you. All you need to do is Come Home.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"R.J. Rhodes","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":489293,"name":"Graven","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/771/77147800b4b3c72c0abfdc8610559e40.jpg","description":"A faithful priest of the Orthogonal order, exiled unto death for a crime in defense of another, you live again in a small boat, adrift in a swamp. A stranger ferries you to solid ground and bestows upon you vague instructions, along with a mysterious staff and book. Go forth, pious priest, alleviate suffering, uncover deceptions, and smash the eldritch perversions encroaching upon reality itself.\n\n\n\nA marriage between modern development tools and techniques with a stark late 90s aesthetic bring the action first person puzzler GRAVEN to life, featuring character designs by Chuck Jones (Duke Nukem 3d, Half-Life) and the voice talent of Stephan Weyte (Blood, Fire Emblem, Dusk) in a dark yet distinct medieval fantasy experience.\n\n\n\n\n\nSolve puzzles and scour lore to uncover the motives of the foul heretical sects behind the plagues and seasons undermining the land.\nAlter your environment with all that surrounds you, wielding spells and crystals to adjust as you see fit in your pursuit.\nDiscover new weapons and upgrade them at blacksmiths and alchemists to customize your capability.\nExpand your horizons by returning to old stomping grounds with new abilities and seeing how far down the chasms go.\nSlay over thirty distinct enemies in an ever broadening world across numerous biomes.\nWalk the parallel path, lest you stumble into the recesses of the world, where the fog knows no light, and creatures beyond time roam free.\nEarn your peace.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Slipgate Ironworks™","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":484976,"name":"Hidden Deep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/966/966b9c525337d0415917e695942a0d44.jpg","description":"Hidden Deep is a 2D Action & Exploration Sci-Fi thriller which action takes about 1.6 km under the ocean floor. A group of researchers detected there some strange anomalies of unknown nature and organized an expedition to examine this mysterious phenomenon. After 681 days contact with the researchers suddenly breaks off. At this point you are entering as the leader of the second team who must find out what happened there.COMMAND YOUR TEAMControl your team members directly or by giving orders. Accomplish missions by coordinating your team's tasks.FACE A LETHAL DANGERDeal with sneaky and deadly alien lifeforms, environmetal traps and many other hiding threatsOPERATE SPECIALIZED EQUIPMENTExplore underoceanic caves using grappling-hooks, scanners, drones, heavy machinery and moreRICH DARK SCI-FI STORY which pays tribute to many 80's and 90's classic movies and games especially Aliens, The Thing and first Half-LifeTWO GAME MODES- Story mode with narrative-driven handcrafted levels\n- Survival mode with randomized levels aimed on fast intensive action\n(CO-OP mode is considered but is not there yet)OVER 20 HOURS OF GAMEPLAY IN STORY MODEStory Mode will have 50 or more levels (currently designed) and will require at least 20 hours to beatINTEGRATED LEVEL EDITOROFFICIAL LEADERBOARD FOR SPEEDRUNNERS","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Cogwheel Software","platforms":[{"id":0,"name":"PC"}]},{"id":350748,"name":"Children of Silentown","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a15/a154fbb7432eddb43bf9e121602ed203.jpg","description":"DON'T FORGET TO...\nAbout the Game\nDuring the day the forest is calm and peaceful.\nIt is during the night that you hear the roars...\n...of monsters.\nAccompany Lucy and her friends in this grim, beautifully hand-drawn adventure game by the creators of Little Briar Rose, in collaboration with studio Luna2.\nLucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play.\nPeople disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or so she thinks.\nExplore Silentown in search of hints, but beware: do not enter the forest.\nA unique, unsettling 2D art style fitting for a mysterious, dark tale.\nMusic plays a crucial role, and learning how to sing will help Lucy in times of need.\nCombine items to obtain widely unexpected results!\nMany quirky characters (and animals!) to interact with. Be nice to them before they disappear.\nPlay minigames with the other children of the village!\nA very mean cat, programmed to mess with Lucy at any given chance.\nCurious, original puzzles: use a leash and a pair of shears to break in your mother’s best friend’s house, all in order to steal… a flower?!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Elf Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":319133,"name":"Guilty Gear 20th Anniversary Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c7/1c76aacb40f2a2ab8c62963b7593cfc1.jpg","description":"~~CANCELED~~\nClassic entries of the GUILTY GEAR series now back in the newest game console!\nAlso available as a 2-in-1 twin pack for Nintendo Switch!\nPioneer of the high-speed fighting game genre, \"GUILTY GEAR\", and the XX series final instalment, \"GUILTY GEAR XX CORE PLUS R\", now together as 1 pack!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Arc System Works","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":244808,"name":"Virgo Vs The Zodiac","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/756/756f31d26493b078ea78b5de6051e502.jpg","description":"Virgo Vs The Zodiac is a sci-fi/fantasy JRPG inspired by the Mario & Luigi RPG series and the Mother RPG series in which you play as an obsessed villain.\nThe game features traditional turn-based combat with real-time execution of moves: blocking, countering and timing your attacks carefully as well as predicting your foes' moves is essential to succeed in Virgo’s twisted and unforgiving cosmic quest to bring back the Golden Age, a period of peace, symmetry and balance, or so she thinks.\nIn this galaxy where every action means a reaction, you’ll play as Virgo, the Holy Queen, often called Dreadful Queen by heretics, bringing mayhem to the Zodiac Realms and leaving a trail of stardust on the way, all to fit her excessively righteous worldview.\nUnforgiving timed-actions combat where all conflicts are lethal unless you protect yourself; precise timed attacks and blocks will bring an end to heresy.\nCounter-Turn system: Any attack can be countered by a variety of equippable counter skills.\nSpare enemies and make friends!\nNo random encounters: Battles fought are plot-relevant.\nNon-self insert and overly villanious Main Character.\nUnlikely friends and foes such as Goats, Save Dinosaurs and a Cookie Companion. Choices matter, multiple endings.\nRewards through exploration: As you delve into the most heretical star clusters of the galaxy, you'll find a vast amount of explorable areas brimming with interactive objects. Many choices that will impact the game can be brought up through world interaction and exploration.\nInteract with different Zodiacs outside of the main quest within the Zodiac Memories.\nCrafting and upgrading a multitude of items shareable between your party members, SHMUP minigames and you can also ride in Alpacas!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Moonana","platforms":[{"id":0,"name":"PC"}]},{"id":59125,"name":"Teenage Mutant Ninja Turtles II: The Arcade Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/694/6941f9167313b2ec0b874c253419aa78.jpg","description":"April O'Neil, the reporter friend of the Teenage Mutant Ninja Turtles, is kidnapped by the villainous Shredder and his two goons, Bebop and Rocksteady. The four ninja turtles: Raphael, Michelangelo, Donatello and Leonardo fight their way through hordes of Foot Soldiers in order to rescue April. They battle familiar foes such as the mad scientist Baxter Stockman, General Traag from Dimension X and the evil alien brain Krang, up to the final showdown with Shredder himself.\r\n\r\nTeenage Mutant Ninja Turtles is an arcade game made by Konami during the height of the cartoon series' popularity. Depending on the version of the game, up to two, three or four players can take part in the action. The game plays like a simplified Double Dragon. While most of the standard Foot Soldier enemies are easily dispatched, some attack with knives or ray guns and are thus more dangerous. At the end of each level, players encounter a boss (or in certain cases two bosses working in tandem, such as Bebop and Rocksteady).\r\n\r\nThe NES version of the game, renamed Teenage Mutant Ninja Turtles II: The Arcade Game in the West, features additional content not present in other versions of the game: two new levels (Snowy Central Park and The Dojo), new bosses (including Tora, Shogun and Baxter Stockman as a fly), additional music tracks as well as more variations of Foot Soldiers.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Atari ST"},{"id":0,"name":"NES"},{"id":0,"name":"Commodore / Amiga"}]},{"id":58976,"name":"Firewall Zero Hour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/73c/73c32be2ea9a5bc518193ce333da9b7c.jpg","description":"In Firewall Zero Hour, choose from one of 12 contractors hired by anonymous contract handlers and work as a team to either protect or obtain valuable data, housed on a laptop and located in dangerous locations around the globe.\nEach team’s anonymous contract handler acts as their ‘eye in the sky’ and guides each match by providing objectives and critical information along the way. Accomplish your objectives through highly coordinated teamwork, taking advantage of an arsenal of modern weapons and equipment to succeed.\n●\tThe power of the PlayStation®4 system and PlayStation®VR come together to deliver a realistic strategic shooter brought to life with the added immersive power of virtual reality.\n●\tChoose from 12 playable contractors from around the globe – each with their own individual starting perk. Compliment your chosen contractor with a variety of upgradable weapons, equipment, and skills.\nPS4 Pro features vary from title to title. Enhanced play with 1 PS Aim controller.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nDUALSHOCK®4\nOnline Play (Required)\nPlayStation®VR Required\nPlayStation®Camera Required\nEnhanced play with 1 PS VR Aim controller\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nOnline features may be terminated at any time. Online multiplayer requires a PlayStation Plus membership.\n©2018 Sony Interactive Entertainment LLC. Firewall Zero Hour is a trademark of Sony Interactive Entertainment LLC. Developed by First Contact Entertainment, Inc.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":55301,"name":"Super Mario Land 2: 6 Golden Coins","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c5/0c5568ff89d3b90c74660df1a748275a.jpg","description":"Super Mario Land 2: 6 Golden Coins is a platforming video game developed and published by Nintendo for the Game Boy, and is the sequel to Super Mario Land, also on the Game Boy. It was released in Japan on October 21, 1992, in North America on November 2, 1992, and in Europe on January 28, 1993. Super Mario Land 2 was created by director Hiroji Kiyotake rather than Mario series creator Shigeru Miyamoto.\nIn Super Mario Land 2, the player assumes the role of the protagonist Mario, whose main objective is to reclaim his castle, stolen by the antagonist Wario who is the evil doppelganger of Mario. However, the magical seal that Wario placed on the castle entrance can only be undone by collecting the six Golden Coins, which are guarded by Wario's henchmen in various locales of Mario Land. Mario's quest revolves around retrieving each of the golden coins in order to regain access to his castle and defeat Wario. Super Mario Land 2 is notable for its debut of Wario, who later became the protagonist of the spin-off Wario series starting with the game's sequel, Wario Land: Super Mario Land 3.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"Nintendo 3DS"}]},{"id":50454,"name":"Knights of Valour","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9cc/9cc39a8a24d2dd1552b23e130332e4e1.jpg","description":"Arcade never dies! Experience the side-scrolling, beat 'em up arcade masterpiece!\nBased on the legendary arcade franchise, Knights of Valour is an action-packed and fast-paced beat 'em up, taking place in beautiful, side-scrolling stages.\nChoose out of a pool of more than seven different characters, each with unique traits to fit your individual playstyle. Collect equipment and learn lots of new skills to enhance your characters' abilities, and create customized skill combos to design unique serial attacks. This allows for a huge variety of character and equipment combinations for both the single player and the online co-op gameplay for up to four players.\nPlay solo or with up to three friends via online coop mode, and defeat the henchmen of the Yan Emperor to keep an ancient evil from destroying the world!\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1 player\nNetwork Players 2-4\n6GB minimum save size\nDUALSHOCK®4\nOnline Play (Required)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nCopyright© (1999-2017) International Games System Corp.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Games in Flames UG","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":49283,"name":"Wormix","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fac/fac10e7713c87430474e69023832368b.jpg","description":"Do you like shooting? Then arm yourself - the world of Wormix awaits you! You will find yourself in the shoes of a small but VERY dangerous fighter, gather together a team of thugs and show 'em all how to fight! Wormix is a turn-based tactical game where you can play against your friends or AI, using dozens of weapons and numerous strategies.KEY FEATURES\nThe dynamic turn-based fights: look at the battlefield, think-through the strategy a little bit and then show your skill in jumping and shooting!\nCharacter and team customization: many options to setup your fighters.\nHuge weapon arsenal: from the UFO and mini-spiders to the jetpack and the watermelon bombs!\nDozens of the fighting arenas: all with their own unique tactics and tricks.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Pragmatix","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":46311,"name":"Puzzle Pirates: Dark Seas","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/516/5168dc28764d619ec2e5e4230961d84a.jpg","description":"Brace yourself for swashbuckling puzzle action as you pillage your way to glory across the briny deep! Create and customize a pirate, collect booty, and join a player-run crew of cutthroats! Every activity in Puzzle Pirates is a uniquely fun puzzle: be it sailing, gunning, or hauling treasure, your own puzzling skill determines your success!key FeaturesCo-operative Piracy: Sail the seas with your friends and pillage brigands and merchants aboard your very own pirate ship!\nA Plethora of Puzzles: Play more than 20 puzzles and mini-games, representing various piratey exploits, such as Swordfighting and Sailing!\nSail to Adventure!: Explore a living world filled with thousands of other players! Hunt dangerous Sea Monsters and voyage to lost treasure-filled realms, such as the Haunted Seas!\nIntense PvP: Pick your side and fight Defiantly for honor, or lurk in the Shadows to infect and dominate the ocean.\nBooty!: Customize your pirate with a bounty of different clothing items and equipment!\nPlayer-Run Economy: Run your own shop and produce weapons, ships and other goods for sale. Band crews together under a mighty “Pirate Flag” and become governor of a pirate haven.\nFree to Play!: Puzzle Pirates is free to play, no subscription is required to enjoy everything the game has to offer!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Grey Havens","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":36968,"name":"Onimusha 3: Demon Siege","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9fd/9fda933c14f0e76bd9a5120f9dc96a0c.jpg","description":"In Onimusha 3 Demon Siege the year is 1582 and 10 years have passed since the events that unfolded in Onimusha 2 Samurai?s Destiny. The stage is set at the burning Honnoji Temple, as the famous Onimusha warrior Samanosuke Akechi (Takeshi Kaneshiro) continues to fight the demons in his path. The moment has finally arrived for Samanosuke to confront the true enemy that has eluded him until now, the undying Nobunaga Oda. Unfortunately before the long-awaited final battle begins, Samanosuke is suddenly engulfed in a whirlpool of light and disappears. The year is 2004. A peaceful French metropolis is suddenly attacked by demons. In the blink of an eye, the city is transformed into a hellish sea of blood as Genma demons slaughter civilians and soldiers one by one. Within this pit of darkness appears one man who stands up against the Genma demons, Jacques Braun (Jean Reno). As a member of the French army, Jacques is deployed to the nightmarish scene only to discover himself amid a plague of horrific enemies that are beyond anyone?s imagination. An ancient samurai warrior unexpectedly appears to help him defend the helpless city. As they cooperatively fight off the demons, Jacquesis caught in a mysterious vortex and vanishes to feudal Japan, leaving the warrior behind in modern day France. Why has Samanosuke appeared in present Paris and Jacques in feudal Japan? What fate awaits these two men? The fierce and bloody battle is unfurled as the beginning of the final Onimusha chapter unfolds.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":22354,"name":"Freaky Awesome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed7/ed7d0dc8fb988bffd2a8d194c62e8196.jpg","description":"Rogue-lite with online co-op!\nAbout the GameWanna tear off your head and throw it at an enemy? Just do it! Or maybe lay eggs and see your tiny copies hatch to fight at your side? Whatcha waiting for?\nFreaky Awesome is a rogue-lite with the randomly generated environment, permadeath and a whole lot of gradually unlocked content. Game developers are fans of such games as Binding of Isaac and Broforce. But Freaky Awesome raises the degree of madness! During the fight, you can mutate into a new form with unique mechanics and quickly adapt to survive. In addition to mutations, you can unlock skills and objects that affect mechanics and gameplay. Play solo or co-op with your friends!\nMutate to survive!Dead mutants leave nasty puddles of mutagen. Be careful and wise because if you step into it, you’ll replenish your health receiving a dose of a mutagen that will change your character at some point.Invite friends to online co-op!You can play alone or invite friends to join you and explore the game together in teams of 2 to 4 players. Coop benefits everyone so that every player will be able to apply it later during a single game or a multiplayer game with other people.Gain new mutation forms by slaying them!To unlock new mutation, you should free it from confinement and then kill it in combat. Once done, you’ll be able to turn into this form in your playthrough which entails a significant change your character’s mechanics. A couple of seconds ago you threw your head at your opponents, and now you lay eggs so that your tiny copies can hatch to fight at your side, or maybe your enemies get electrocuted. That’s quite OK.Make use of the environment!But be careful! Explosions, flying barrels, circular saws, flames out the walls or flying pig heads won’t give you a second to breathe. You can both use the environment as a weapon or get killed by it.The game is changing!It applies to randomly generated locations as well as more general things. The game plot itself is designed to make the game change after every successful session. It means new unlocked locations, new enemies, bigger levels with new mechanics, stronger bosses. And with each session, you’ll move along the storyline.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Mandragora","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21021,"name":"Mahjong Pretty Girls Battle: School Girls Edition","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e13/e13c4b1f11e22178a58d20d83d5b3c47.jpg","description":"\"Are You Ready?\"\n\"School Girls Edition\" for \"Mahjong Pretty Girls Battle\" has now appeared!\nAn extraordinary collection of Pretty School Girls is waiting for you!\nThe heated struggle to determine the world's top School Mahjong girl is about to begin!\n■Brand new \"KAWAII\" cute school girls gathered for a hot Mahjong battle!\n23 different sexy girls to choose from!\nAn extraordinary collection of Pretty Girls is waiting for you!\n■Hear their sexy voices in heated Mahjong battles!\nVoices of all 23 girls are included.\nSquealing in ecstasy when they win, crying in sadness when they don't succeed.\nAudio enjoyment for your gaming pleasure.\n■Authentic Japanese Mahjong rules\nIncluding settings for some famous local rule variants.\nThe Pretty School Girls will help you practice Japan's most famous game.\n*This game is character replaced version of \"Mahjong Pretty Girls Battle\".\n*This game is an authentic Mahjong game. (No undressing or nudity is included in the game.)\n*Characters and character images used under license from their respective owners.\n*The game is single player only with additional AI players for authentic Mahjong play.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zoo","platforms":[{"id":0,"name":"PC"}]},{"id":17823,"name":"Drunken Robot Pornography","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af1/af15a732e6d9dd1ab5b95787e879bdc5.jpg","description":"Drunken Robot Pornography (DRP) is a bullet-hell first-person shooter for Windows. Battle giant robots -- called Titans -- as they try to slice you apart with their lasers. Pick off their missile launchers, fry away their carbon fiber armor, and tear off their claws, leaving them writhing.\nDrunken\nYou're Reuben Matsumoto. You used to own a bar.\nRobot\nYou gave your robot bartender, Tim, sentience. He went nuts, stole your other 12 bots, and burned down your bar.\nPornography\nHe's attacking Boston with 20,000 drones, 40 Titans, and his lieutenants, the 12 Drunken Robot Centerfolds.\n30-story tall giant robots. Jetpacks. Guns. It all started so innocently. Your robot bartender, Tim, used to make the best drinks at your nightclub. But you gave him sentience so that he could better empathize with the customers. Struck by the world's problems, he went crazy, burned your club to the ground, and fled with your twelve exotic robot dancers. Weeks later, giant robots started attacking the City of Boston -- not a coincidence!Key features:3D First-person bullet-hell giant robot boss-battle(Titans) action!\nBuild Titans with the Giant Robot Construction Kit -- 600+ Titans in Steam Workshop already!\nCreate your own levels in the Arena Builder -- 200+ maps in Steam Workshop","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dejobaan Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17578,"name":"Avalon Lords: Dawn Rises","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71e/71eaeaee9993d95fa70e8258aef9ff85.jpg","description":"*** PLEASE NOTE - this game is currently in Early Access. Expect there to be some bugs and incomplete content. We are working hard to fix things as well as add in more stuff. We value your feedback and invite you to give us your thoughts in the Community Hub.\nGood day traveler! I see that you are new to the lands of Spero, located within the Western realm of Avalon. Please allow me to be your humble guide as you take your first steps towards taming these lands and conquering your foes!\nDid they hand you a brochure at the gate when you first came in? No? Well then, my sincerest apologies, please let my good friend Steam Guide help you get up to speed. In just a few minutes he can certainly aid you with information on our Game Controls, the various Building Types you can construct, as well as the Troop Types that can be found within our great land.\nNow then, if you would just step this way, we can continue with the tour...\nAvalon Lords: Dawn Rises is a medieval real-time-strategy game set in the lands of Spero during the Order of Dawn’s rise to power. During its Early Access launch, the game will feature three multiplayer combat modes, and post-launch, we will be adding single-player campaign modes.\nOur story begins in the Plains of Spero, where five great City States rule over the land. Tensions have risen to boiling point, and several powerful City Lords wish to take control of the region and name themselves king. Peaceful negotiations have descended into to all-out war, plunging the region into chaos. Lords fight against each other to gain power and land - each one hoping to claim the throne...\nYou start as a minor general in the City of Avon, one of Spero’s five City States. Lord Avon has sent you out to form a new city in a strategically desirable part of the realm and defeat anyone seeking to claim those lands for themselves. Along the way you will meet a rising leader who seeks to unite the warring Lords under one order – the Order of Dawn.\nAvalon Lords: Dawn Rises features three different multiplayer game modes played out within a beautifully sculpted 3-dimensional environment. In Conflict Mode you will need to gather resources, construct buildings and recruit soldiers in order to defeat your foes. Combat Mode puts you straight into the action; you can recruit your forces in the Army Builder and deploy them in battle without the need for gathering or building. Finally, join your faction allies in Empire Mode to help conquer locations across the land.Game FeaturesStrategic gameplay! Simply having the most troops does not guarantee a win; it's how you use those forces that counts.\nLarge scale epic battles! Watch as hundreds, perhaps thousands, of soldiers engage in massive conflicts.\nConstruct your cities in open sandbox fashion. There are no grid lines to follow here; place buildings anywhere you wish.\nConstruct over a dozen different types of buildings, each with their own unique purpose. Many buildings can be upgraded to make them better, stronger - yes, we have the technology!\nTroops each have their own abilities and are effective in different ways. With over a dozen different types of troops, you can mix and match them to create an unstoppable force.\nSiege weapons - so awesome they need a listing all their own!  They are capable of doing great damage from a distance, destroying buildings and devastating troops.\nWork your way through the Technology Research tree to upgrade your forces and create more durable buildings.\nPersistent player accounts - with every battle, you gain experience to level up your account. Use the Honor points you acquire to buy permanent Specialization perks, which will follow you no matter where you go in the world of Avalon.\nOnline multi-player modes include a choice of both Free-For-All or Team Combat, with up to six players at a time. Feeling especially tough? Take on others in a 1 versus 2 or 1 versus 3 match and show them all who is the real Lord of Avalon!\nSingle-player practice matches - not yet ready to venture forth against live players? Try your hand against the CPU AI, which features four difficulty levels ranging from “Easy” to the dreaded “Knightmare” mode.\nJust feel like watching the carnage for a while? Check out a live match using the custom Spectator Mode, which is designed to include all the information you would need for an eSports shoutcast!\nFree camera movement - move your camera any way you wish. Zoom way out to get an overall sense of the battlefield or way in to watch the bloodshed up close and personal!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Animus Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16648,"name":"Shake Your Money Simulator 2016","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/345/345c97ec23b46f627bf4c6e8756384fa.jpg","description":"\"Shake Your Money Simulator 2016\" is the newest spend-money simulation which will teach your wallet to hide money from your eyes . Besides , this is a first game in 2016 , where you can finally look at pixel opossum !\nFeatures\nDeep storyline\nYou can spend money\nYou can't earn money\nYou can spend more money that you actually have\nOpossum\nMade with love by CharlieH\nComing Features?\nFeel free to ask me about new things in community hub .\nTogether - we will do \"Shake Your Money Simulator 2016\" better !","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CharlieH","platforms":[{"id":0,"name":"PC"}]},{"id":14207,"name":"Dispatcher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/340/3406b1016aeddfe1d252ce537852e48e.jpg","description":"“Humanity found a way into the depths of the space. First brave hearts set off to grasp the unknown. It found them first.\nDreams of pathfinders crashed against the cold flesh of the space. Now and on only one thing matters: what are you capable of to survive?”\n“Dispatcher” is a first-person horror with RPG elements.\nThe game takes place in the near future on a spaceship “Dispatcher” which crew got into an accident and trapped with alien monsters. The few survivors have been infected and are not as friendly as you think.\nBut was it an accident?\nClue features\n- Scary mixture of survival horror and atmosphere of classic space science fiction of 60-80’s;\n- Stealth-based gameplay with RPG elements;\n- System of characters’ upgrade that unlock according to the amount of gained experience;\n- 6 character classes, each of which has its own strengths and weaknesses;\n- 4 unique kinds of unpredictable monsters;\n- Partial random generation of levels;\n- Hardcore mode for the most daring players;\n- Beautiful graphic that can fully immerse you into the atmosphere of fear and terror;\n- Also chicks in skinny clothes, blood, screams and other possibility.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"CivilSavages","platforms":[{"id":0,"name":"PC"}]},{"id":13155,"name":"Four Last Things","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83e/83ea8e19f64d90967abace50f5c57e6e.jpg","description":"In the beginning God created the heavens and the earth. God saw all that he had made, and it was good. Then the Lord God formed a man from the dust of the ground and breathed into his nostrils the breath of life, and the man became a living being.\n'Ooops,' said god, seeing he had created a fool. But before he was able to remedy his error, man spoke;\n'No backsies!' he chirped, and scuttled off into the forest.\nAbout\nFour Last Things is a point-and-click adventure game made from Renaissance-era paintings and public domain recordings of classical music. It is about sin, and the Four Last Things – Death, Judgement, Heaven and Hell – and strives to be intelligent and ridiculous in equal measures.\nIt's kind of like if Monkey Island had been made in 16th century Flanders, by a time-travelling Monty Python fanboy...\nFeaturesPointing and Clicking\nRenaissance Artwork\nClassical Music\nSinful Behaviour\nDetailed, Interactive Game World\nSimple Visual Interface\nNonsense\nPiffle\nMoments of Surprising Profundity","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Joe Richardson","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":9952,"name":"Dimension Jump","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d6/8d68b78472997bd28feb9b7e7c80c08c.jpg","description":"Dimension Jump is a precision puzzle platformer, where you don’t just jump between platforms, you jump between dimensions!\nOnce you’ve picked up the basics you’ll have to master the art of dimension jumping, gravity switching and teleporting to get through some of the most challenging levels on offer.\nWith over 90 levels to complete, each with challenge times and bonus stars, there will be plenty to challenge all skill levels. As you progress through level sets the difficulty increases, adding in new mechanics and putting all the skills you’ve learned to the test.\nCollect Steam achievements by completing level sets and other accomplishments, challenge your friends with your own custom levels using the level editor, and compete against the world on global leaderboards for the fastest times.FeaturesDimension jump your way through over 90 levels\nChallenge variants of every level to really test your skills\nCollect Steam achievements\nCompete for the fastest time on global leaderboards\nBuild and share your own levels via Steam Workshop","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Redpoint Games","platforms":[{"id":0,"name":"PC"}]},{"id":9650,"name":"Auto Age: Standoff","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f16/f1671d5fafa343d13c42286f8f6881aa.jpg","description":"Welcome to the Auto Age The year is 2080. America lies in ruins. Bands of militarized motorists work to keep the peace in the east. Wheeled gangs rule the western wastes. A mysterious voice crackles through the static of radio relays, beckoning travelers into the desert canyons of the Dead Zone.\n\nChoose your side and speed full throttle into a deadly game of ruthless car combat soaked in '80s Saturday morning cartoon style. Will you rally behind SAIGE and Val Vega to fight for a better future, or seek total domination with the evil Dark Jaw and his ragtag Jawlings?\nTeam-Based Car CombatHurl headlong into the chaos of twelve-player online combat, buckle up for classic couch co-op, or even do both. With Auto Age: Standoff's versatile split-screen play, you and three other friends can skirmish privately or team up together in online battles.Pimp Your RideIn a high-tech world of lowlifes, you'll need every advantage you can get. Choose your chassis and gear up with powerful weaponry and the latest gadgets, including missile launchers, ramming plates, mines, boosters, and more.\n14+ vehicles including light, medium, heavy and tower classes\n30+ weapons and gadgetsMultiple Modes of MayhemFire up classic Deathmatch combat (free-for-all and team-based) and rampage across five wasteland maps, or battle for control of Eagle's Nest in Point Capture mode where coordination and strategy is king. Twelve players supported in a single online match.1980 Meets 2080Get hooked on our retro-future dashboard mixtape and soundtrack where synthwave and guitar-shredding fuel your quest for vehicular destruction.\nMixtape tracks by:  20Six Hundred, Skull Fist, Stilz, and TWRP.\nUnderscore by: Jim Guthrie and JJ Ipsen\nTheme song by: Matthew Reid","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Phantom Compass","platforms":[{"id":0,"name":"PC"}]},{"id":3129,"name":"Grand Ages: Medieval","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/936/936fb3bc45c61b713dd5b646ddb91aa5.jpg","description":"What is Grand Ages: Medieval?\n\"Grand Ages: Medieval\" is an entry in Kalypso's \"Grand Ages\" series of finely-crafted strategy games of different genres developed by different studios. This game is not a sequel to the 2009 title \"Grand Ages: Rome\", a classic RTS with a focus on city building. \"Grand Ages: Medieval\" is a larger scale, real-time empire simulation game combining elements of trade, expansion and exploration with a heavy focus on economical domination.Features:\nExplore a gigantic game world of over 20 million square kilometres, plot strategically where to found important cities and defend your kingdom against foreign powers\nProduce and trade 20 different goods to meet the demands of your citizens and soldiers: such as coal, fruits and pottery\nResearch and utilise 50 major technological advancement of the Middle Ages: including the three-field crop rotation, the low warp loom or the longbow\nRaise an army and fight your opponents with knights, archers and cavalry\nFace devastating natural disasters like storms, fires, volcanoes, droughts, earthquakes… or even the Black Death\nChallenging Multiplayer Mode for up to 8 players\nIt is the year 1050 AD. At the beginning of the High Middle Ages development in Europe has seen an unprecedented level of progress and a rapidly growing population spreads across the length and breadth of the continent. New frontiers are explored, settlements founded and vast trading routes established. As the head of one of these small settlements, it falls upon you to lead your people towards greatness. Explore a vast world, gather resources, encounter other societies and use your trading expertise to expand and make your fortune. Found new cities, progress your nation with inventive technology and protect your trade routes against barbarian attacks until you are powerful enough to begin your conquest over Europe and forge a bold new empire.\nGrand Ages: Medieval is a real-time strategy game from Gaming Minds. Lead your people and advance through the decades by utilising construction, research, expansion and conquest in an area extending from Scandinavia and North Africa; to Portugal, the Caucasus and the Middle East. Rise from the humble role of a simple mayor governing a small settlement and rule over all of Europe. Experience an exciting campaign with elaborately designed cut-scenes, play by your own rules in free play or test your skills in multiplayer against up to 8 players!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kalypso Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":971,"name":"Spider: Rite of the Shrouded Moon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c79/c7935080d06e2f8c1119ac2386e26f0b.jpg","description":"\" A secret society built Blackbird Estate for a specific purpose..\n..Not even the family living there today knows what it was.\"Web Crafting, Insect Hunting Gameplay You are a spider on the hunt!  Build webs of your own design to trap and eat a wide variety of dynamic insects, each with its own behaviors and vulnerabilities. You must possess the agility and cunning of a spider to master the deep scoring system and top the per-level leaderboards in this unique, innovative blend of action, strategy, and puzzle gameplay.Your Real World Time and Weather .. Inside The Game! Prepare to be immersed as never before. Spider uses your location to reflect the time of day and weather in the game with that outside your window. Moths, fireflies, and crickets only come out at night. When it rains in real life, the rain also falls on Blackbird Estate. Play on a stormy night when lightning electrifies the top of the tower, or explore during a full moon when rare moths can be found.Hours and Months of Replayable Content Over 30 unique levels, each of which features redesigned gameplay in all 4 conditions, along with shuffled content and multiple areas, leading to countless combinations of challenges, collectibles, environments, secrets to discover, and high scores to master. Collect dozens of insects, multiple spider skins, and 48 achievements of increasing difficulty.Solve Cryptic Puzzles and Unravel the Mystery Welcome to Blackbird Estate, an abandoned mansion built long ago by an enigmatic secret society for a mysterious purpose, unknown even to the family who until recently lived here. Use the map to explore the grounds, collecting clues that can be pieced together to open hidden passages, decrypt secret messages, and uncover long-buried secrets. The clues may help you solve the estate's 7 puzzles, but you're on your own when it comes to the ultimate mystery: The Rite of the Shrouded Moon!A Story of Spider Proportions What really happened at Blackbird Estate? Slip under the floorboards and through keyholes for a spider's unique perspective on this dramatic story told in the background without text or dialog. Piece together the tattered tale of a mad inventor, a brave child, and an adventurer of the high seas who hides a dark secret. Search for clues at a crime scene, a faulty time machine, and a graveyard full of unexpected surprises.Two Games In One Play for high scores and the story won't slow you down. Or if you prefer to solve the mystery, you can ignore the leaderboards entirely. Do both for the greatest challenge, or neither to breeze your way to the exciting conclusion.  Spider allows you to seamlessly customize your experience and decide what kind of gameplay you're in the mood for.\nThe Steam Version features precision aiming mechanics designed for both gamepad and mouse/keyboard, along with a wide, high resolution view, essential tools for topping the leaderboards.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tiger Style","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":949931,"name":"Landfall Archives","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b1b/b1b9f4082f6208527c67af297055f631.jpg","description":"Break into the Landfall Archives and steal previously unreleased games, demos, interactive slide shows, and even an old version of TABS!\nLandfall Archives is a collection of every project Landfall and friends have worked on since 2016 that didn't make it to the shelves but which all deserve to see the light of day. This collection of 23 projects includes:\nAnything for my pals (2021)\nControl a herd of Pals to help you navigate through a short level with obstacles.\nRobots Forever (2018)\nFind weapons to fight modular robots! Every robot part has its own health and can be destroyed separately so you better watch out…\nRobots Forever 2 (2019)\nThis game builds on the concept of modular robots from the first Robots Forever. Included are more robots with varying sizes and parts, as well as randomly spawning weapons with upgrades.\nPost Game (2019)\nSmall building game where you build conveyor belts and other parts to move packages around a facility. The more packages you get into the containers, the more credits you collect!\nPhysics Survival (2019)\nA physics animated top-down game where you explore and interact with the environment and animals to gather resources that you can use to get more equipment and units.\nTABS 2017 (2017)\nTABS 2017 is an early version of Totally Accurate Battle Simulator using the 2.0 physics system that was scrapped in 2017 in favor of the current 3.0 version. In the game you use a variety of different units to beat a level or you can play around in the sandbox mode.\nAirships 1 (2018)\nAn exploration of airship building, using a system with different modular parts you can use to build your ship. Fly the ship around the landscape to explore! We imagined this to be a way to travel around in some of the other prototypes.\nAirships 2 (2018)\nAnother version of airship building with different modular parts and improved stabilization for the airships, aiding in flying and construction.\nWrecktangels (2019) Local PVP\nSimple side-view battle game where you jump and shoot each other while using a time-slow mechanic. The world is built out of objects that collapse and break apart as they are hit, to keep you on your toes!\nRTS card game (2021)\nPlay cards to spawn units, and cast spells during real-time strategy gameplay. Build your own deck and combine cards to change which units and abilities are part of your deck. We made this to explore real-time card mechanics with some light RTS gameplay.\nPhysics Fighter (2021)\nBrawl with enemies in small rooms, using your fist, legs, and a knife. The enemies have different attacks and patterns that they follow during fights to keep you on your toes.\nMedieval America (2020) Online PVP\nPhysics shooter where you battle your enemy on a destructible level that collapses as the battle goes on, be careful not to fall!\nPlant Plane (2019)\nGo on a peaceful journey along the level in a plane, creating bushes and leaving nature around you as you fly past.\nOcean Plane (2023)\nFly around and fire small missiles at airships and towers, in and around an ocean.\nPlayful (2021) Online PVP\nA 1v1 game where you can battle and play in different scenarios with your own rules and goals. It was made to be a sandbox to create your own small games in.\nBlob Game (2018)\nA small experience of being locked in a room with an unknown creature while a voice speaks to you. There are a few different endings to this game, can you find them all?\nWalking House Game (2021)\nPrototype for a building game where you control and build a walking castle. Travel to explore and gather resources around you to build and upgrade your base. Beware of the enemies lurking nearby!\nMissile Game (2021)\nControl missiles and fly them through different levels with varying obstacles to bring down physics towers, with the goal of destroying the small objects you find in the structures.\nCreepy Robots (2017)\nRun and climb around a small town scene while being chased by humanoid robots!\nROUNDS 3D (2022) Online PVP\nPrototype for a 3-dimensional version of the game ROUNDS. It’s mainly explored with the shooting mechanics and a handful of upgrades.\nCounts and Stakes (2020) Online PVP\nA vampires vs vampire hunters-themed top-down-shooter focusing on precise aiming. Play against other players in small arenas with physics obstacles that you can interact with.\nPhysics Presentation (2018)\nNot exactly a game, but more of an interactive slideshow made to be used as a presentation explaining the principles of the physics used in Landfalls games.\nAuction Brawl (2017) 2-4 Local Splitscreen\nSplit screen fighting game where you bid on items that you then use to brawl against the other bidders. You can also grab and use most other items in the auction room to fight your fellow players!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Landfall","platforms":[{"id":0,"name":"PC"}]},{"id":613542,"name":"Sex with the Devil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55f/55feb29817d6076b61a54b5cd0adec81.jpg","description":"CHECK THIS!And the best thing: this is only the beginning! We will be updating the game and adding new FREE content on the regular! Expect new levels and more unique scenes!\r\nAbout the Game\r\n\"Hypocrites are people. They are all like that by nature. Imagine a masquerade ball. One dozen, two, three, a hundred or more people Dancing and spinning in the rhythm of music. But everyone is wearing a mask.\"\r\nWhat is forgiveness and what is a lie? Where does desire end and vice begins? The project \"Sex with the Devil\" will allow you to ask these and many other frank questions about the greatest personification of evil in human culture.\r\nThe ancient tempter always liked to watch your sinful life, and after death you appear before him in hell. Knowing that you can induce people to fall into sin on social networks, Satan offers to have fun and play a game. The reward will be answers to your deepest questions and fulfillment of your carnal desires.\r\nKey features:\r\nBeautiful and juicy demonesses;\r\nAn abundance of hot scenes;\r\nA unique atmosphere of grotesque in the game incarnation of hell;\r\nExplicit scenes of madness and ultra-violence;\r\nThe opportunity to get answers to many pressing questions;\r\nIntriguing plot.\r\nGameplay contains:\r\n1. Conversation with the Devil. At this point you can communicate with the Devil and prepare to play with him;\r\n2. Hell game. For his entertainment the Devil will send you to his labyrinth, full of traps, and start a hunt. If you'll be able to find an exit, as a reward he will grant you one wish;\r\n3. Making a wish come true. For your victory in the previous round, Satan will fulfill your dirty dream. It can be sex with the Satan, beating him up or just a friendly handshake. Also, the Devil can answer any new questions you might have.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Evil Boobs Cult","platforms":[{"id":0,"name":"PC"}]},{"id":542682,"name":"Sunlight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d42/d42aca3ff5140f3b1541867169c5f946.jpg","description":"One tree planted for every download\nEverything is connected, and Sunlight is no different. For every copy of the game that is downloaded, a tree will be planted. Read more about the climate project on Sunlight's Ecologi page.\nAbout the GameSunlight is a short, vibrant and thought captivating exploration game, from the creators of Among the Sleep, Mosaic and The Plan. Journey into the uncharted forest, guided by the harmonised whispers of the trees. Each tree with different voices, genders and dialects, speaking as one.\n\nTaking artistic inspiration from expressionist painters like Monet and Munch and focusing on a powerful 3D audio experience with breath-taking choir work, Sunlight will leave you feeling entranced and in wonder in this artistic approach to telling you a story.\n\nPlaytime: 30 minutes.\nThe visuals, that were hand painted using Quill, makes the experience feel like exploring a three dimensional painting.\nThe hauntingly beautiful music, composed by Tchaikovsky, was recorded in the Archbishops palace in Trondheim, Norway, and sung by the award winning choir Kammerkoret Aurum. Along with a wide range of voice actors spanning multiple continents, the atmospheric and meditative story comes alive.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Krillbite Studio","platforms":[{"id":0,"name":"PC"}]},{"id":532388,"name":"Fights in Tight Spaces (Prologue)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7cc/7cc53fe0d9ee5dd807c581637d60dd1a.jpg","description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1265820/Fights_in_Tight_Spaces/\nAbout the GameCard-based Tactical Fighting!\nFights in Tight Spaces (Prologue) allows you to get hands on with the first mission of Fights in Tight Spaces absolutely free!  If you enjoy the game, please take a moment to Wishlist the full version here... https://store.steampowered.com/app/1265820/Fights_in_Tight_Spaces/\nThe game blends deck-building, turn-based tactics, and thrilling animated fight sequences in classic action-movie settings. Learn to balance your hand, momentum, and positioning to overcome the odds to defeat your adversaries.\nPick from over 150 cards as you build a deck to suit your play style and your opponents’. Encounter random events, acquire enhancements (or injuries), and make critical choices about how best to upgrade your agent for the fights ahead.FeaturesControl the Space: Use the environment against your adversaries\nTrain your Abilities: Build a deck to suit your play style, upgrade your moves, and equip your agent with a range of enhancements\nProtect High-Value-Targets: Use your skills and abilities as you act as bodyguard to VIPs\nEndless Threats: With a new mission each time your play, evolve your tactics, unlock new possibilities, and perfect your strategy to defeat the criminal underworldSummaryIn an era where espionage is handled largely by data-packets being pored over by teams of analysts, Section Eleven’s approach is more hands-on, dealing with the sorts of criminal organizations who live and operate outside the realms of electronic communication. When the rest of the intelligence services have failed, they call Section Eleven.\nAs a Section Eleven agent, it is your job to find direct solutions to emerging threats… largely by smashing people’s faces into things.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ground Shatter","platforms":[{"id":0,"name":"PC"}]},{"id":523065,"name":"BustyBiz","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fb/5fb2f2590a861a07bb96b9a4c087ff06.jpg","description":"\nImagine this! One day you’re just struggling to make it by, dreaming of the day in which you will strike it big! Then, out of the blue, you’re suddenly whisked away by a mysterious group insisting that you are the only heir and descendant of the old noble family of the\n.\nHow will you handle the pressure of holding inline the largest, steamiest, and richest family business in modern history? Easy! You simply do everything you can to match your ancestors’ undeniable skills and revive their legacy, of course!\nYour mission is clear. If you want to succeed in this highly competitive industry, you will have to hire the sexiest babes you can find, train them to become pros, win their heart, and roll in the dough...all in the comfort of your very own luxury villa!\nBuild the biggest and naughtiest empire the world has ever seen and make your fantasies come true!\nCustomization is key! Build and upgrade your own luxury villa!\nNever a crowd! With so many hot, unique, highly talented girls to pick from, there is never a dull moment! Convince them to move in with you and win their hearts with steamy chats and sweet gifts!\nTake part in the action! Each girl has 3 animated and modifiable H Scene videos to get your gears going!\nChoose to automate shootings to increase earnings through indirect income! You don't have to tap and tap like in an online casual clicker simulator!\nGet idle cash and generate permanent income. Keep the chicks working even when you are offline!\nHire managers to keep your chicks even more motivated.\nExpand your empire and start one porn franchise after another including Zappers, CT CreamTeam, THiCC and Toys In Us.\n: Cheating, Anal, Gangbang, Beach, Western, Harem, Big Tits, Anal, Urban Fantasy, Romance, Voyeurism, Exhibitionism, etc","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"3X Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":510104,"name":"A Kingdom for Keflings","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/905/905179f368b31f6c52b90b9f23d1f82e.jpg","description":"(Online Interactions Not Rated by the ESRB) Xbox LIVE Multiplayer 2-4, HD (High Definition). Unlock the full version of A Kingdom for Keflings for even more homes, buildings, and workshops to build!  Join up to three of your friends via Xbox LIVE to cooperatively construct the kingdom of your dreams. The full version of A Kingdom for Keflings includes achievements to earn, more Keflings to attract and many more opportunities to fill your kingdom full of love! This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":413099,"name":"The Uncertain: Light At The End","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be7/be716deeb543938fbb8cb672856e14a9.jpg","description":"Your friends and family have been kidnapped and you have no clue as to their whereabouts or what has become of them.\n\nYou are alone and afraid, constantly forced to hide from the robots who until recently served you - now they have turned against you, hunting you and everyone else like animals.\n\nUltimately, you are powerless. The only thing that you can do is hide and survive without any hope or understanding of why this is happening.\n\nYou are an outcast, an outlaw, you are simply just human.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ComonGames","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":403002,"name":"The Room VR: A Dark Matter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a3/4a311d4b56ea5f90de2ad08864582466.jpg","description":"The Room VR: A Dark Matter is the next chapter in the mysterious world of The Room series. The game begins deep within The British Museum in London, where the disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and discover an otherworldly element which blurs the line between reality and illusion.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Fireproof Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":326273,"name":"Jack Move","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/821/82173558c916895ea061afeae415f990.jpg","description":"Join our Discord\nAbout the Game\nJack Move features beautiful modern pixel art, a unique turn based battle system and an 8 to 10 hour campaign. Players take on the role of Noa, a vigilante hacker who is thrust into a world of murder, kidnapping and dark research after her father goes missing.StoryThey whisper her name on the streets: Solares. A mysterious veteran of the Data Wars, she keeps the fight against the Corporations alive as a vigilante hacker-for-hire, empowering the downtrodden and undermining those with power.\nWhen she receives an emergency message from her estranged father - the eccentric Dr. Abner Solares, whose wife's death spurred him to become the leading researcher of 'digital reanimation'  - Noa is thrust into a world of murder, kidnapping, dark research, and the corporation that would steal it for their own ends: Monomind.\nWhat starts as fight to save your father will become a fight for the future of mankind itself...Cyberspace BattlesJack Move features beautifully animated turn based battles. Inspired by JRPG greats such as Final Fantasy 7-10, Grandia and Golden Sun, with a modern twist.\nThe single party member system allows for exciting and tactical battles. Customise the software of your Cyber Deck to switch roles mid battle, balancing offence, defence and buffs. Choosing which software you load during a battle is the key to victory! Hardware upgrades can help boost your stats, increase the amount of software you can install or give Noa extra abilities.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"So Romantic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":60098,"name":"VR Benchmark Kanojo","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/384/3847c540ab93c4e4167dcd284a6229a0.jpg","description":"<strong>[VR Benchmark from VRKanojo]</strong><br/><br/>It is a benchmark for VR. Let's measure the performance of your PC!<br/><br/>It has a function that can become a fan in extra mode.<br/><br/>------------------------------------------------------------------------------------------<br/>We have a product version here.<br/>http://store.steampowered.com/app/751440/VR_Kanojo__VR/","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Illusion","platforms":[{"id":0,"name":"PC"}]},{"id":59707,"name":"Aground","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e8/7e86c37135f105cc1eaada8d15a06439.jpg","description":"Splash!\nYou’re plunged deep into the black, frigid waters. Your lungs scream for air. With your last bit of strength, you pull yourself ashore.\nYou have nothing but the clothes on your back and fallen branches all around. That ship was your last hope, and now it lies in pieces off the shore of this deserted island. Are you the only one who survived the crash?\nYou're not alone. You don't know how the others survived. You don't know if you can trust them.\nYou have to rebuild. You have to learn ancient skills long since forgotten by humanity.\nThis island may be deserted, but with work, innovation and a little help, perhaps you can make it a home.\nBut to have a future, you’ll have to challenge the forces that caused the crash in the first place…\nAll you can do is hope that when THEY return, this time you’ll be ready.\nTry the Demo!\nAground started out as a web game you could play for free in your browser, and after getting excellent ratings and over 2.5 million plays across many portals, we ran a successful Kickstarter which let us make the early access version available here! However, the web version is still available as an expansive free demo, with around 8 hours of play that will give you a great sense of the game. Give it a try! Your saves will transfer seamlessly to the early access version should you decide to get it!\nWhat Is Aground?\nAground was designed around the theme of Progression, and inspired by Utopian Mining, Starbound and A Dark Room. You start out with only the rudimentary ability to gather wood, and you can eventually build your way up to a thriving settlement, expand to other islands, develop advanced technology, and learn magic. Will you be able to confront the threat that caused you to crash? Fly dragons? Launch into space? The sky is literally not the limit.\nWith Aground, our goal is to keep you continually surprised, with exciting new options opening up around every corner, so you’re always wondering “what’s next?”. By the end of the game, even though there are a lot of systems and complexity, since everything has been built up bit-by-bit, it is all easily manageable.Where To?\nWe have a LOT planned between now and the full launch - from completing the story, to space travel, co-op multiplayer and more! Be a part of the journey and offer suggestions as we post monthly updates to improve the game! See our full roadmap here: https://steamcommunity.com/app/876650/discussions/0/1744469130471927220/\nFeel free to post comments in our discussion threads or join our Discord server to chat with us!\nWho are We?\nWe’re Fancy Fish Games - a small indie team that has released 12 games, 5 commercially on Steam (including Aground), since 2012. We follow our passion, making games that catch our fancy - our games tend to be quirky, surprising or thought-provoking. You can read more about us and how we bring Aground to life in our developer interviews:\nDavid Maletz - New Ground\nAaron Norell - Pixel Perfect\nChase Bethea - Sound BytesWhat can you do in Aground?\nThere’s a lot to do! Here’s a quick list:\nMine Ores, Gems, and other Resources\nBuild Structures\nComplete Quests\nFight Enemies and Bosses\nCraft Tools\nFarm Crops\nCook Foods\nBefriend NPCs (or not)\nAdvance your Technology\nDiscover Magic\nRide Vehicles and Mounts\nRaise Dragons\nCapture Enemies\nLevel up your Skills\nGo Fishing\nExplore Secrets","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Fancy Fish Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":56122,"name":"Metal Gear Solid: The Twin Snakes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/275/2752034244033a258fd5fcdfb8501b72.jpg","description":"Metal Gear Solid: The Twin Snakes is an action-adventure stealth video game co-developed by Silicon Knights and Konami Computer Entertainment Japan for the Nintendo GameCube video game console in March 2004. The game is a remake of Metal Gear Solid, originally developed by Konami for the PlayStation in 1998.\nThe Twin Snakes features graphical improvements over the original, new cut scenes written and directed by Ryuhei Kitamura, and gameplay functions originally introduced in the sequel Metal Gear Solid 2: Sons of Liberty. The game includes a revised translation with re-recorded voice acting using almost all of the original English voice cast. The game was met with positive reception.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"GameCube"}]},{"id":51579,"name":"Please close the doors","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ea/6eaae1e462f808cb9ab988efcf5cf734.jpg","description":"There were eight people in the stopped elevator of \"The Moscow pharmacological company\" and FSB hunts for one of them. In order to disappear unnoticed, the criminal is ready to kill everyone who is stuck with him in one elevator until \"security officers\" have reached him.\n\"Please close the doors\" is a quest with elements of the detective and thriller in which the player should find out who is a criminal until he hasn't killed all the peaceful characters during interruptions in light. You will interrogate each of characters, question them how they spent that day until being stuck in the elevator and look for inconsistencies in their words. You will have to conduct the interrogations very careful, because too detailed questioning can make the innocent become nervous or angry and make them stop answering your questions, and the criminal, having guessed that you approach him, can kill you during the following cutoff of light.\nWill you be able to get out of this situation alive, having avoided not only the murderer, but also the staff of FSB who don't want someone to know the mysteries of the state company?\nFeatures.\nDifferent endings, dependent not only from the actions chosen by you, but also from the relations with characters and final outlook.\nSet of types of weapon: from mops and scissors to alarm and ordinary guns.\nOriginal soundtrack.\nThe alternative Universe the history of which you should learn from notes, newspapers, memoirs of characters and environment.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Koyotis Studio","platforms":[{"id":0,"name":"PC"}]},{"id":49706,"name":"War Planet Online: Global Conquest","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd4/cd4f958f9fb5c0fa399f33144251d92f.jpg","description":"\"When the entire world is at war, bold generals rise to the challenge and lead their armies toward Global Conquest. The time has come for you to strike! Do you have what it takes? Build your base, dominate regions of an actual real-world map, and lead your faction to conquer every nation of the globe!\nYou are a lone military force in a world completely engulfed by war. But you are destined to rise up and conquer it all! So build a mighty base, gather strong allies, and launch a global assault in the most explosive MMO real-time strategy game!\n**GAME FEATURES**\nREAL-WORLD ACTION\n• Immerse yourself in a world where thousands of real players struggle for dominance 24/7.\n• Talk to your allies (and taunt your enemies) in the global chat, or plot your next attack in the private Faction chat.\n• Build your forces from units based on actual modern war machines including armored tanks, lightning fast jets, long-range artillery and much more!\n• March your army across a faithfully recreated World Map.\nREAL-TIME CONQUEST\n• Fight for supremacy in live, real-time PvP warfare.\n• Utilize cunning strategies to strike your enemies where and when they least expect it.\n• Call on Allies for reinforcements to overcome any obstacle!\nREAL MILITARY STRATEGY\n• Customize your base to create an impenetrable fortress that will crush any invasion.\n• Recruit skilled commanders that specialize in various types of operations.\n• Forge a massive Alliance with other players and coordinate amazing feats of strategy together.\nWhat are you waiting for, sir? The world needs a general like you to dominate and win this war!\n_____________________________________________","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Gameloft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":46270,"name":"Darkestville Castle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f50/f50787157504d6e695d15025bb09fb36.jpg","description":"Like any decent demon Cid spends his nights performing all kind of evil deeds to the peaceful people of Darkestville. Little does he know that his old arch enemy is about to change his life forever.\nLive the adventure of Cid, the demon of Darkestville, a laid-back being of pure darkness that will see his evil routine life disrupted by The Romero brothers, a group of demon hunters hired by Dan Teapot, Cid’s arch enemy.  Follow CId through an epic quest full of danger, intrigue, and ridiculous premises.\nThe game pays tribute to late 90’s point-and-click adventure games, featuring fascinating fairy-tale story and trendy visuals in Tim Burton’s style. It delivers more than 7 hours of truly enjoyable gameplay to both old and new generations. Dive into the unforgettable good old-fashioned atmosphere of classic adventure games and meet dozens of funny characters living in this amazing hand-painted world of Darkestville Castle.\n• Point-and-click adventure classics in the same vein as Monkey Island and Day of the Tentacle\n• Lots of Tim Burton-esque gallows humor\n• Funny characters and charismatic protagonist\n• Dozens of carefully designed levels\n• Quirky and trendy visuals\n• Numerous puzzles\n• Captivating story\n• More than 7 hours of exciting gameplay\n• Violence, horror and death-free adventure for all ages\n• This Game has been awarded with an INDIE PRIZE as the BEST GAME NARRATIVE","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Бука","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]}]