[{"id":6303,"name":"SAS: Zombie Assault 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f98/f989a06e10e4e666d233072c61ef264f.jpeg","description":"A virus outbreak on a distant trans-federation planet unleashes horrors from humanity's past. A powerful, rapidly growing zombie horde threatens the very existence of humankind, and the only ones capable of fighting back are the highly skilled, highly weaponized special forces of the S A S. Choose from 3 unique character classes, maximize the fully customizable skill tree, and select from hundreds of weapons and armor pieces to build the ultimate zombie killing hero. Play dynamic, challenging levels in single player or 4 player cooperative multiplayer and give our ravaged civilization its last best hope for survival.\nINTENSE ACTION\nZombies swarm the screen, exploding into bits under your hail of bullets. Each of the 17 unique zombie types have special attacks and behavior, and they can evolve - manifesting terrifying new powers as you progress through the game. And just when you think you've beat them all, savage boss zombies hunt you down, puking out acid worms or storming after you in rage mode. Learn their strengths and weaknesses as you lead the action across 7 story-driven maps with varying victory conditions.\nUNBEATABLE 4 PLAYER CO-OP\nQuickmatch with up to 3 other players of similar level and use the custom skills and weapons chosen by all players to form an effective fire team. Coordinate auto-turret placements, high level room-clearing powers like Assault Team, Aerial Bombardment, and Zombie Antidote, and move physics objects to create temporary cover while you paint the room red.\nHEAPS OF EPIC LOOT\nOver 160 incredible guns and armor pieces are locked up tight inside increasingly rare strongboxes that you can find in secret rooms or on the mangled remains of your enemies. Your loadout includes a pistol and two rifle class weapons - choose from fast firing submachine guns, devastating shotguns, high damage assault rifles, brutal machine guns, flamethrowers, rocket launchers, lightning guns, and more. Armor up for protection against physical, thermal, and chemical attacks, then round out your arsenal with auto-turrets, grenades, and special high damage ammo to rip through the undead before they rip through you.\nAMAZING RPG-STYLE UPGRADES\nThe Assault, Medic, and Heavy Gunner classes each have unique upgrade trees, giving each character 19 skills to customize. Hundreds of guns and armor pieces have a range of grades and a powerful RED version when you reach high levels. In addition you can add powerful augmentations to your guns and gear which enhance core properties like damage and rate of fire, but can also improve reload time, resist damage, and heal.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":2155,"name":"Bad Hotel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/313/3134def01c3c23347507c57c213581f7.jpeg","description":"IGF FINALIST 2013\nBAFTA WINNER 2012\nTIGA AWARD FINALIST 2012\n1. Build Hotel.\n2. Make Music.\n3. Stop Tadstock.\nAn insane hybrid of a tower defense game and a procedural music toy with tons of bullets (and healthy number of Wu-Tang references and credit crunch satire).\nThe hit game for iOS now available on Windows and Mac! You are a budding entrepreneur, whose hotel is rather unfortunately located within the territory of Tarnation Tadstock, the Texas Tyrant. Your only defense against Tadstock’s army of seagulls, rats, yetis, and more is to build your hotel as quickly and intelligently as possible, using an array of increasingly sophisticated weapons.\nThe beautiful artwork, quirky storyline, and frantic gameplay all work seamlessly together with a generative music system, which creates original music depending on the player’s actions and decisions. The player becomes a composer, creating complex musical structures to defend their hotel. A vast variety of music can be generated, from delicate beach chillout to country banjo techno.\nGet the BAFTA-winning game that Kotaku said was \"wonderful\" and The Guardian called \"an unlikely work of minimalist art\".","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Lucky Frame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":28544,"name":"Aegis Wing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a5/4a5947b3d7dbeab8f12b5193995cbe74.jpg","description":"Single Player, Xbox LIVE Multiplayer 2-4, HD (High Definition). Ready to save the universe from an Araxian invasion? Challenge them solo or recruit up to three friends for an all-out assault. Feeling lucky? Try it on Insane mode – the rewards are greater but the name is all too accurate. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Intern Game Team","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":20515,"name":"Blaster Shooter GunGuy!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b7/6b743d12886c87cb1f231b164f3756ca.jpg","description":"Just UpdatedController Support, Updated Audio, Difficulty Tweeks\nAbout the GameHis mother was a Ninja, his father was a Gun. But now, GunDad has been kidnapped. And it's up to you, GunGuy , to go out into the world and SAVE GUNDAD!\nBlaster Shooter GunGuy is a challenging 2D action platformer with collectathon elements. Designed to be difficult but fair you take on the role of GunGuy and jump n shoot your way through 56 different levels comprising 7 worlds with each world culminating in a boss battle. Every stage holds three gems, collect them to unlock more playable characters. Each world also hold a unique challenge level that will test your prowess and if completed will also reward you with an additional playable character. All playable character have their own stat changes; some hit harder, some jump higher, but each is unique in their own way. Blaster Shooter GunGuy features Steam Trading Cards so you collect inside the game and out!\nFEATURES\nChallenging 2D Action Platformer!\nMore Than 50 Levels Spanning 7 Completely Different Worlds!\n7 Difficult Boss Battles!\nDozens of Collectibles!\nDifficult Challenge Stages to Test Your Skills!\nUnlock More Playable Characters To Keep The Fun Going!\nSteam Trading Cards!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Adam DeLease","platforms":[{"id":0,"name":"PC"}]},{"id":9730,"name":"Monster Slayers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c7/8c7f85dcd24fe3ede787a364e184f1d4.jpg","description":"Developed by Nerdook (Reverse Crawl, Vertical Drop Heroes), Monster Slayers is a complete reimagining of the free web-based hit of the same name, which has been played over 4 million times on gaming portal, Kongregate. A rogue-like deck-building RPG adventure, Monster Slayers uses an innovative card-based battle system and lets you customize a deck to suit your play style. Create a new hero to join the Monster Slayers Guild and choose your path through the perilous Northern Valley as you follow your quest to defeat the legendary Harbinger and become a true Monster Slayer.FeaturesBattle undead goblins, lion outlaws, mighty dragons and other monstrous foes using a unique card-based combat system\nStrategically shape your deck as you acquire new cards from merchants, treasure chests, and allies\nCollect fame from each run to unlock new abilities that can be used by future heroes\nEvery playthrough is different: levels, enemy encounters and loot are randomly generated\nChoose from six different classes: Rogue, Ranger, Knight, Barbarian, Cleric, Wizard\nRecruit companions to join you on your quest and make use of their special abilities\nEquip your hero with stat-boosting loot to improve the chances of victory\nFight for your place at the top of the Monster Slayers leaderboards\nInspired by the much-loved deck-building RPG, Dream Quest, created by Peter Whalen (Hearthstone)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3384,"name":"Woah Dave!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0b/f0b62e6cda41ae5e98daa0e903e8fcd8.jpg","description":"From the folks behind the BIT.TRIP series comes the frantic insanity that is WOAH DAVE! Help our hero, Dave Lonuts, survive an insane alien invasion and line his pockets with shiny pennies.\nHurl alien eggs, skull bombs, and explosive WOAH blocks to stay alive and sky rocket yourself to high score fame and fortune.\nThe brave players who manage to survive the alien onslaught and collect the most coins will be rewarded with top placement on the fierce online leaderboards. Do you have what it takes to be the world’s best Dave? Or will you end up playing second fiddle to another, more powerful Dave?\nWoah Dave! also features a local two-player competitive mode, where two Daves can go head-to-head in a battle to collect the most coins. We aren’t exaggerating when we say it could very well result in ruined friendships and unsalvageable marriages. Competitive games are good like that.\nIf that isn’t enough Dave for you, there’s also Bonkers Mode with more aliens, more lava, and more chances to get killed. Those who brave the storm will be rewarded with a splendor of precious coinage; those who fail will be revoked of their License to Dave.\nGood luck, and may the best Dave win.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":564761,"name":"Pokémon Legends: Arceus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/80a/80a3e1060b49c02f901e781b263cd881.jpg","description":"First came Sinnoh remakes. Then came Sinnoh pre-makes.\n\nIntroducing #PokemonLegendsArceus​, a new challenge and a new frontier for the Pokémon world.\nThe Pokémon Legends: Arceus game honours past Pokémon games’ core gameplay while infusing new action and RPG elements.\n\nYou’ll need to catch, survey, and research wild Pokémon in a long-gone era of the Sinnoh region to create and complete the region’s first Pokédex.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":59894,"name":"What the Golf?","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/56e/56eb7239aa2e1d4a7938d37e16c19352.jpg","description":"The golf game for people who hate golf!\n\nA silly physics-based anti-golf game where you get to golf anything. Every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?\n\nGolf is always the same: perfectly round balls, 18 holes, blue sky, neatly cut grass and fancy people in nice clothes. What's not to hate? – Hate no more!You must have a lot of questions about our vision for golf.\n\nWhy is the golfer not part of the game?\nDo you play with a golf club or a golf club?\nCan all ball games be reimagined as golf?\nWhat is a First Person Golfer?\nAre all Olympic Games just special case golf games?\nCould golf “steal” some ideas from other games?\nCan you hear people golf in space?\nHow many balls does it take to fix golf?\nHow would you like some FLIPPING golf?\nIf you can imagine it, you can golf it...\nWith advanced video game technology we can turn anything into a golf game.\nWHAT THE GOLF? is a silly reinvention of golf that doesn't care too much about rules, pars, eagles, or any of that. You get to hit things and they fly away with fun physics.\nIt's a goofy game that borrowed the shooting mechanic from golf but uses it for moving houses, driving cars, and golfing people.\nWHAT THE GOLF has a wide range of different mini-game like levels that all have slightly different mechanics.\n\nFeatures\n\nMore surprising new golf mechanics than you can imagine\nEpic golf boss fights\nWill NOT make you a better golfer\nMade by people who know nothing about golf\nFirst (and hopefully the last) game that let you golf a horse\nIf you see what you like? Then do remember to put the game on your wishlist.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Triband","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":15672,"name":"Tom Clancy's Rainbow Six 3 Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e6/8e664023701a3befa545d8ff131e3245.jpg","description":"Raven Shield:\nCommand an elite multinational squad of special operatives against hidden terrorist forces. In Tom Clancy's Rainbow Six 3: Raven Shield, the third installment to the wildly popular Rainbow Six series, Team Rainbow faces the hidden global forces of a new and secretive foe. Command Rainbow in a race against time - in locations including England, Norway, the Caribbean islands, and Rio de Janeiro during Carnaval - to stop a madman and his doomsday plot.\nAthena Sword:\nCommand the world's most elite force of multinational counter-terrorist operatives in their latest mission. Track the desperate remnants of the international terror network from Tom Clancy's Rainbow Six® 3: Raven Shield™ into the exotic regions of the Mediterranean and prevent their mad agenda of international anarchy and devastation.\nRainbow Six 3 Gold Download Features\nPick your team members, assembled from the best counter-terrorism and military units from around the world. Then outfit them with the right armor, weapons, and high-technology equipment for the mission at hand.\nAfter equipping your team, plot out the assault of the target area on the map interface. Lay out a plan for each squad to maximize surprise, stealth, and safety.\nAfter all the planning - execute! In first-person mode, lead one squad or control all three through different radio commands and signals. Enter and clear a room of terrorists, rescue hostages, defuse bombs, and recover vital intelligence to help you in later missions.\nAll-new eight-mission campaign in locations from Italy and Croatia to Greece.\nFive new multiplayer levels (Chemical Factory, Ferry Boat, University, Italian Alleys, and Jungle).\nThree new multiplayer game modes (Adversarial Terrorist Hunt, Adversarial Scattered Hunt, and Capture the Enemy).\nSeven additional real-world weapons (for a total of 64) with sound effects from the team that worked on the blockbuster movie The Matrix.\nThree bonus classic missions from the original Tom Clancy's Rainbow Six® and Tom Clancy's Rogue Spear®, updated with the latest graphics and technology.\nPlease note that as of August 2016, the online features for this game are no longer supported.  The Multiplayer mode / Co-op mode will no longer be accessible.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PC"}]},{"id":14928,"name":"SHOGUN: Total War - Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e63/e63a8e381843572c639093a1ca6ab9b8.jpeg","description":"SHOGUN: Total War™ - Collection includes the base game SHOGUN: Total War™ and its official expansion pack - Mongol Invasion.\nAbout SHOGUN: Total War™\nJapan, 1542, a country in turmoil. The last shogunate has collapsed, leaving a nation divided into numerous factions, each led by a daimyo, a feudal warlord.\nEach daimyo is out to scheme, murder, and wage war to become supreme ruler. The emperor is powerless, a puppet of whichever faction controls Kyoto. Into this melting pot come the first European explorers; bringing guns, religion, and disease.\nOut of this chaos will emerge only one daimyo, he who will master all the varied skills that make up the art of war;  Politics, economics, subterfuge, strategic warfare, and battlefield tactics.\nOnly one will become Shogun.\n•\tThe first, original title in a 15 year series of award-winning strategy games.\n•\tThe debut of the now legendary formula of Total War gameplay; a unique mix of turn-based grand strategy and real-time battles.\n•\tZen-like simplicity belies a deep and rewarding game, even when measured against the best contemporary titles.\n•\tNow updated for modern resolutions and Steam integration.\nAbout SHOGUN: Total War™ - Mongol Invasion\nThough in history, Kublai Khan’s otherwise unstoppable Mongol Horde were turned back from Japan’s shores by catastrophic weather, in this expansion for SHOGUN: Total War, the ultimate ‘what-if’ question of the period is asked.\nAs either the invading Mongols or the ruling Hojo clan of Japan, it is up to you to take the islands for the Khan or secure your homeland against an imposing threat.\n•\tFeatures a new playable faction, and new units on both sides of the conflict.\n•\tAdds new campaign and multiplayer modes.\n•\tIncludes a map editor to complete the challenge and further enhance a seminal title.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Creative Assembly","platforms":[{"id":0,"name":"PC"}]},{"id":14010,"name":"Grand Ages: Rome","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c11/c115321fd1b4d55f67897bae90699d9e.jpg","description":"Raise massive armies, embark on epic campaigns to expand the Empire, and take control of the known world! Engage in grand-scale city building and create magnificent cities with creativity and control like never before. Intuitive controls make it easy to launch bone-crushing combat missions and manage every aspect of your thriving civilization.\nAfter decades in exile, your family name has been all but forgotten in Rome. But, the departure of the tyrant Sulla has changed everything, and Rome stands on the brink of a new era. Sides must be chosen as Caesar and Pompey battle for control of the Republic. The stage is set for you to gain power and influence over one of the greatest civilizations in history.\nAdvanced Battle System\nTake command of 18 different military units, including naval command, elephant cavalry, and mercenary forces. Recruit citizens of Rome, draft captured enemy forces, and pay foreign squads for their special skills. Defend and expand the Empire by land and sea with exciting RTS gameplay.\nIntense Multiplayer\nOnline multiplayer functionality with 6 different strategy modes —  play competitively or cooperatively. Create buddy lists and challenge your friends to a battle, or use the matching system and take on an unknown foe with the same skill level. Advance your career and increase your rank from praetor to consul and beyond.\nEpic Campaigns\nRub shoulders with Julius Caesar, Mark Antony, Cleopatra and more in a non-linear historical campaign featuring over 40 missions. Choose your own fate as you create and destroy alliances with more than 20 different historical figures. Celebrate your victories by erecting legendary monuments such as the Coliseum, Circus Maximus, the Pantheon, and more.\nComplex Economy\nFlow resources eliminate tedious micromanagement, giving you the freedom to create thriving cities with multi-leveled economic systems. Information overlays visualize the city economy and satisfaction of the people on every location on the map.\n4X REAL-TIME STRATEGY:\nExplorE  — Journey to ancient Gaul, Britannia, Egypt, and more to colonize barbarians and establish new trade routes.\nExpand — Stake your claim throughout the known world in the name of Rome! Help build the empire through military conquest and economic prowess.\nExploit  — Natural resources are yours for the taking as you establish farming, mining, and logging operations. Raze barbarian villages for riches, labor, and property.\nExtErminatE  — Destroy all who stand in the way of Rome's glory! Defend your territories by land and sea to secure peace and prosperity for the empire.\nDetailed citybuilding alongside rtS combat dramatically widens audience.\nCompetitively priced within the genre.\nExtensive online multiplayer connectivity — play competitively or cooperatively.\nGame's scale is far beyond the city of rome, allowing players to experience all areas of the roman Empire by land and sea.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PC"}]},{"id":11405,"name":"AION Free-to-Play","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5e/b5e9c57e2d68cf3527bd9bdf9d0326f3.jpg","description":"Only Light can cast a Shadow\nAtreia is a shattered world. Hatred and jealousy is spreading through the two races like wildfire: while the Elyos lead a life of abundance on the light side of the planet, the Asmodians lead a life of desolation, encased in permanent darkness. Choose your side and charge into battle with your faction for Atreia’s future. Adventure awaits, realised in breathtaking graphics: explore the light and dark sides of this oppressed world, or face other players in PVP. Only the bravest heroes will be accepted into the circle of the Daevas. With their mighty wings, the skill and strength of these creatures is far superior to humans.\nAre you ready for the adventure of a lifetime? Then prove it - in AION free-to-play, the free fantasy MMORPG! EXPERIENCE AION FREE-TO-PLAY\nCreate your own personal hero.\nSelect from 6 classes, 11 specialisations and countless items.\nExplore Atreia, a fascinating world of light and shadow.\nFight in dynamic PvPvE battles with hundreds of players and NPCs.\nExperience the adventure of your life – on the ground and in the air!------------ Update 5.6: Baleful Omens ------------Ereshkigal has awoken from her slumber and brought great misery to Atreia. After the massive devastation wrought by the Dredgion Invasion, the fight for survival continues unabated. Many Daevas have gone missing since the attack, while a fragment of the Artefact Core was lost. The agents will send Daevas to hunt for them, but they will need to train harder than ever before, for their homeland is in great danger!\nExperience new adventures and great features in update 5.6 – now on the European servers!\nWhat awaits you:\nFour more instance: Tower of Challenge, Narakkalli, Museum of Knowledge and Neviwind Canyon\nGroup battles in the Gold Arena\nUpdated starting areas and new servers\nMinions supporting you in battle","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NCSOFT","platforms":[{"id":0,"name":"PC"}]},{"id":705616,"name":"Warhammer 40,000: Space Marine II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/950/950f4eae6dc907d7f534d5dcce454487.jpg","description":"The galaxy is in peril. Entire worlds are falling. The Imperium needs you.\n\nEmbody the superhuman skill and brutality of a Space Marine, the greatest of the Emperor’s warriors, with Clive Standen (Vikings, Taken) as the iconic Captain Titus. Unleash deadly abilities and an arsenal of devastating weaponry to obliterate the relentless Tyranid hordes. \n \nHold at bay the horrors of the galaxy in epic battles on far-flung planets. Uncover dark secrets and drive back the everlasting night to prove your ultimate loyalty to humanity.\n\nFocus Entertainment and Saber Interactive are proud to announce Warhammer 40,000: Space Marine 2, the new third-person action title from the cult-classic Space Marine franchise which recently celebrated the 10th anniversary of the original game. Unveiled at this year’s Game Awards, the world premiere reveal trailer of Space Marine 2 heralds the next installment for Captain Titus and mankind’s ultimate protectors, complete with a glimpse of brutal gameplay action. Heed the call of battle. For there is only war.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Saber Interactive","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":665016,"name":"Blade of Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/203/20345d9164f477415f7c118a540797ed.jpg","description":"game introduction\n\"Blade of Darkness\" is an abyss-themed 2.5D barrage shooting Rogue Like game.\nGame Features\n1. The location where you enter the portal is random.\n2. The abyss species encountered are rich and diverse.\n3. We can enrich our abilities in the abyss.\nUse W-A-S-D to control the main character's movements\nShoot with the left mouse button\nA portal from the abyss appeared in the town. In order to protect the town, the protagonist of the warrior decided to enter the portal to prevent the invasion of the abyss. Come on, warrior.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"General Arcade","platforms":[{"id":0,"name":"PC"}]},{"id":627634,"name":"Behind the Frame: The Finest Scenery","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b5/9b5b8cf04ca150ec83867b388f29b999.jpg","description":"• Paint, sketch, and retouch your artwork to complete your masterpiece and your memories\n• Dive into and explore beautiful panoramic, hand-animated worlds inspired by Miyazaki/Studio Ghibli visuals\n• Experience an evocative story, through the eyes of a passionate artist\nBehind the Frame is a vivid, interactive fiction about an aspiring artist on the cusp of finishing the final piece of her gallery submission.\nA relaxing, eloquent experience that can be played at any pace. Become immersed in a panoramic world filled with resplendent colors, beautiful hand-animated visuals, and a smooth, easy-listening soundtrack.\nAs a passionate artist, seek the missing colors that will bring your paintings to life - all while remembering to take the occasional coffee and breakfast breaks that keep you going. There is more than what meets the eye, for every painting has a story to tell.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Akupara Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":292838,"name":"Tetris 99","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d53/d539b82df1642578d33e57462536daf5.jpeg","description":"The free to download online software, Tetris® 99, is available as a special offer for Nintendo Switch Online members. In large-scale, 99-player battles, it'll take speed, skill, and strategy to knock out the competition and become the last player standing. You can target opponents by sending them Garbage Blocks, but be careful…your rivals can target you back! Defeat opponents to acquire KO badges that may give you the advantage on future attacks. Survive the onslaught and look forward to upcoming online events!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Arika","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":35402,"name":"Cossacks 2: Napoleonic Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec1/ec1f0752f11e58487137d0c88ded7437.jpg","description":"In Cossacks II: Napoleonic Wars , lead your 19th century army to glory in this much-anticipated sequel to the internationally acclaimed Cossacks: European Wars. Whether fighting as Napoleon's highly disciplined \"Grand Arme\", the tenacious Russians and their Cossack horseback warriors, the Austrians, Britons, Prussians, or Egyptians, the challenges will be daunting as you master weapons and tactics during a time that redefined modern warfare.\nKey features:\n\nMassive Historical Battles - Fight through battles of the 19th century, with massive armies colliding in varied types of terrain and weather.\nVaried Game Play - Enjoy the strategic campaign for the dominance of Europe, follow in the footsteps of emperors and generals in history-inspired battles, or duke it out in open-ended skirmishes.\nThere's More To Winning Than Combat - Learn to weaken your enemies economically before the first musket volley is fired. Forge treaties, devise treacheries, or simply buy your opponents' loyalties.\nRealistic Troop Morale System - Only well-led, well-provisioned troops live long enough to grow in experience and become valuable battlefield assets.\nOnline Play - Compete against or in cooperation with other armchair emperors via LAN or Internet connection.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":21577,"name":"Puzzle Kingdoms","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/450/450b6645e4e1c203495b9fb887926fac.jpg","description":"Puzzle Kingdoms challenges players to plan out strategic attacks in order to defeat their opponents. Order troops across the map, conquering cities through innovative puzzle gameplay. Players build and manage armies led by heroic commanders to save the world of Etheria from the brink of destruction. By matching corresponding gems on the game board, players will both inflict damage on enemy forces while building mana that can be used to perform devastating attacks that will cripple their opponents.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Infinite Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"}]},{"id":20212,"name":"Labyrinthine Dreams","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa3/fa306f9968d3cede01999829276704ef.jpg","description":"Labyrinthine Dreams is a short puzzle game about Beth, a young woman who is standing at Death’s Door. After a traumatic childhood and a tough entry into the world of adulthood, she was just starting to take control of her life. However, she is now up against an insidious enemy who threatens to take everything away from her. During what may be her final hours, Beth wanders through important moments in her life while also staying a few steps ahead of the monster who won’t rest until she is no more.\nMazes in dreams are said to symbolize the dreamer’s feeling of “being trapped.” As Beth tries to find meaning and strength in her life, players must guide her through a variety of mazes, each with its own twist. The most challenging sections are reserved for confrontations with the monster, who must be outmaneuvered and outwitted to proceed.\nFeatures\nA unique and emotionally powerful story with vivid characters and potent real-world themes.\nA variety of mazes which challenge players while complementing the narrative.\nGorgeous artwork that brings the surreal world of Beth’s unconscious to life.\nA captivating original score from Joel Steudler.\nVoice acting that drives home the story’s emotion.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Solest Games","platforms":[{"id":0,"name":"PC"}]},{"id":19292,"name":"Avernum: Escape From the Pit","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/844/84467ca3ea30a075af9f262cf662813b.jpeg","description":"Avernum is an epic fantasy role-playing adventurer set in an enormous, subterranean nation. Avernum is a land underground, a subterranean nation full of rogues, misfits, and brigands, struggling for survival and wealth in the monster-infested darkness.\nYou have been banished to the underworld, never to see the light of day again.\nThe surface is ruled by the cruel Emperor Hawthorne, master of the Empire. All of the known lands are subject to his brutal command. Everyone who speaks out, misbehaves or doesn’t fit in is cast into the dark, volcanic pits of Avernum, far below the surface. There, you are expected to die, a victim of starvation, horrible monsters, or simple despair.\nBut not all of the Avernites have surrendered. With magic and steel, they are forging a new nation deep underground. You can join them and fight for safety. Or freedom. Or, if you dare, revenge on the surface-worlders who tried to destroy you. Join your new countrymen, explore a huge game world, hunt for hundreds of magical artifacts, choose from hundreds of quests, and become the hero of the underworld!\nKey features\nEpic fantasy adventure in an enormous underworld.\nHuge outdoors, eighty towns and dungeons, and hundreds of quests.\nThree separate game-winning quests. Seek safety, escape or revenge. Complete just one or all three!\nUnique races and settings make Avernum different from any adventure out there.\nHundreds of side quests and magical artifacts to discover.\nRich game system with over 50 spells and battle disciplines and a multitude of beneficial character traits to choose from.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":16880,"name":"Depth Hunter 2: Deep Dive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f78/f78c3f5c2198605055531836e8536adb.jpg","description":"Depth Hunter 2 offers 25 exciting missions in 3 huge locations around the world. Players will hunt different fish species and face the difficulties of breath-holding spearfishing, an ancient fishing method.\nPlayers will also have to find treasures and get the possibility to take underwater photos to capture the beauty of the simulated, detailed and lively underwater worlds they’re exploring also in a exploration mode.\nSpearfishing and Underwater Hunting are ancient fishing and hunting methods, used to catch fish by using a mechanical harpoon. Today, spearfishing is a sports activity in many countries around the world, especially in the UK, around the Mediterranean Sea and in South America. Spearfishers hunt while diving apnea, holding their breath, so have to coordinate their energy carefully while monitoring their prey, especially in tactically challenging hunting situations.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Biart Company","platforms":[{"id":0,"name":"PC"}]},{"id":13749,"name":"Oozi: Earth Adventure","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/349/3493604e42f2086ba838d8eb62d746e0.jpg","description":"Oozi: Earth Adventure is a classic 2D platformer with old school gameplay -  no puzzles, no punishment, just 100% pure classic platforming fun! Its most prominent features are HD visuals and beautiful hand-drawn art, but despite its visual style, it’s a good fit for all kinds of gamers. The variety of difficulty levels – from Kid to Hardcore – allows everyone to enjoy the game regardless of their skill level. It tells the story of Oozi - an alien spaceship pilot who crashed on planet Earth, lost his space suit and needs to find his way home.\nThe game heavily utilizes Steam integration, including Achievements, Leaderboards, Cloud Save, Trading Cards and special feature – Quantum Ghosts, holographic recordings of players from alternative universes.\nRelive an old-school platformer experience - this time with beautiful, high-definition visuals.\nFour difficulty levels, including Kid difficulty - made specifically for the youngest gamers\nQuantum Ghosts - watch how players from alternative universes played through the game\nChallenge mode - additional 44 short, but extremely difficult levels with various objectives\nFight various enemies and discover new gameplay mechanics in distinct worlds - jungle, cave, lab or even an alien planet.\n5 hours of story mode – 20 levels and 4 boss fights\nSteam Achievements, Leaderboards, Cloud Save, Trading Cards and Full Controller Support\nOozi Earth Adventure offers an addicting platformer experience that hearkens back to the days when \"scrolling parallax backgrounds\" were super hip and the entire summer's agenda was to set a new high score. - Impulsegamer\nFantastic visuals and tight platforming - extraguy.com\nOozi: Earth Adventure feels like it deserves pride of place in a SEGA Mega Drive compilation - dealspwn.com\n... absolutely stunning to see... , with a lush array of colors... impressive 2D artwork as the lush environments and bright world look fantastic... - armlessoctopus.com\n...provides a solid platforming experience, complete with lush visuals and challenging gameplay... worth playing for any fan of 2D side-scrollers... - extraguy.com\n... fun platforming game with magnificent visuals ... - gamerdork.net\n... it’s strong in every department, and it’s an absolute must buy ... - writingsofmassdeduction.com","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Awesome Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":11329,"name":"Space Pirate Trainer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed7/ed776abe33fe959af934a4f3fa64a123.jpg","description":"Space Pirate Trainer is the official trainer for wannabe space pirates on the HTC Vive.\nRemember those awesome classic arcade cabinets? Imagine if those were immersive... Space Pirate Trainer puts you in one of those; fighting off relentless waves of droids with all the weapons and gadgets you would ever need as a Space Pirate. You better dodge some of those incoming lasers though, since just using your shields won't get you in the top rankings. Pick up your blasters, put on your sneakers, and dance your way into the Space Pirate Trainer hall of fame.\nNo real droids where harmed during the creation of this game.\nUse your straps and stay in your VR area to make sure no humans will be harmed.\n(Other VR headsets TBC)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"I-Illusions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9684,"name":"InnerSpace","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99d/99dc576ed1cd45a0121eb69697c3ffd4.jpg","description":"YOUR GREATEST JOURNEY IS WITHIN\nFor as long as they can remember, the people of the Inverse have looked down at the sky, to the locked door of the Ancients, and wondered: What is beyond? For ages they have lived here, built their cities around the mysterious megalithic ruins of the ones who came before. Amid such mystery and grandeur, the people know only one thing for certain: Once, a long time ago, gods lived here.\nNow, at long last, an archaeologist of the Inverse has unlocked the door of the Ancients. As his cartographer, it is your purpose to soar through virgin skies, dive into lost oceans, and chart the unknown. In a mind-bending world of inside-out planets, discover relics of the past and uncover the true history of the Inverse, and what that holds for its people, its gods, and its future.\nInnerSpace is an exploration flying game, and the first title from PolyKnight Games. Inspired by the character-driven narratives of Journey, Proteus, and Grow Home, InnerSpace began as a project among college friends and evolved into a successful Kickstarter campaign. This fall, PolyKnight is proud to welcome you and all its backers inside the Inverse. Your greatest journey is within.\nFeatures:\nDiscover The Inverse - InnerSpace is a game about exploration, about player-driven moments both small and grandiose. Take your time, soar through the skies and dive through the oceans, and the secrets of Inverse will reveal themselves.\nRelics of the Ancients - Scattered among the ruins are priceless relics that reveal key information about the civilizations that once were, as well as provide technological upgrades to your glider.\nColossal Mystery - You are not alone. Discover the giant demigods who now rule this realm. Only by uncovering their secrets will you learn the truth of the Inverse.\nThe Art of Flight - Featuring an ephemeral art style and soothing electronic musical score, InnerSpace delivers a thoughtful, provocative flying experience unlike any other.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3622,"name":"PHANTOM BREAKER: BATTLE GROUNDS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28b/28bea642b3ef0db50158096daa70b566.jpg","description":"Phantom Breaker: Battle Grounds is a 2D beat 'em up from Mages/5pb, the makers of Steins;Gate, Bullet Soul, and other great games.  Choose a fighter and battle against the bizarre minions of the evil wizard Phantom.  Enjoy classic beat 'em up gameplay with a fighting game twist.  Dash through colorful Tokyo locales, strengthen your characters, team up with your friends, fight dragons and killer robots!\nStory Mode - Enjoy a lighthearted story as you battle Phantom's minions across 8 stages inspired by famous Tokyo districts.\nArcade Mode - Challenge yourself to get the biggest combo, the highest score, or the fastest completion time.\nMultiplayer - Easy to learn mechanics make playing with your friends a snap.  Team up with your friends for the local co-op or online campaign, or go to the battlegrounds arena and fight a pitched PVP battle!  Up to 4 players supported.\nCustomizable, Persistent Characters - 4 starting characters and 6 unlockable ones.  Each character has a fully customizable stat and skill tree, and levels persist between all modes.  Choose a favorite character and build them how you like!  Every character has unique special attacks.\nRetro Charm - Vibrant sprite graphics and a catchy chiptune-inspired soundtrack for the discerning retro gamer!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MAGES","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":3282,"name":"Astebreed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d5/9d56233a4b87b29c9520aa7582b64dba.jpg","description":"You are Roy Becket, a young pilot with dreams of becoming as skilled as his adoptive father. When a galactic war with an ancient mechanical alien race reaches its boiling point, Roy is forced to spring into action and take control of an otherworldly bipedal war machine in hopes of saving what's left of humanity.\nJoining Roy is a young girl who claims to have escaped the clutches of the nefarious aliens. Forever altered through horrible experimentation, she now possesses the very abilities humanity will need to push back the doomsday clock.\nTogether, they must battle an unrelenting army alone and reunite their shattered family.\nThe End of All Things is in sight. At the edge of eradication stands Astebreed.Arcade Shooter EvolvedAstebreed takes the classic arcade shooter and breathes new life into it. Using lovingly crafted 3D models, cutting edge particle effects, and tried-and-true Japanese mecha designs, Astebreed delivers an unparalleled atmosphere of beautiful destruction.A Full ArsenalRoy has a considerable arsenal to combat his foes, as well. Armed with the mysterious Lucis device, Roy's mech can shoot from a distance, paint targets for precision homing attacks, and even get close for a killing blow with a powerful blade attack. No enemy shall escape your wrath, no matter where they hide.Dynamically Changing PerspectiveYour enemies are not always ahead of you. Your enemies swarm, fly and intercept, and Astebreed's dynamic perspective always keeps the action in view. Seamlessly switching between vertical, horizontal, and 3D shooter, Astebreed will keep you guessing what your next threat will be, without ever interrupting the action.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ACTIVE GAMING MEDIA","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":59317,"name":"Asphalt 9: Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e96/e96d3582bf1bd6dbe6edae5319dcdb83.jpg","description":"Get in gear and take on the world’s best, most fearless street racer pros to become the next Asphalt Legend – from the creators of Asphalt 8: Airborne.\nAsphalt 9: Legends features a top roster of real hypercars for you to drive that is unlike that found in any other game, from renowned car manufacturers like Ferrari, Porsche, Lamborghini and W Motors. You’re free to pick the dream car you need and race across spectacular locations against rival speed machines around the world. Hit the fast track and leave your limits in the dust to become a Legend of the Track!\nA CONSOLE EXPERIENCE IN THE PALMS OF YOUR HANDS\nImmerse yourself in one of the most hyper-realistic arcade racing games, with meticulously detailed real cars, cool HDR techniques, and stunning visual and particle effects that turn every race into a real blockbuster race movie.\nTHE MOST PRESTIGIOUS MOTOR CARS\nCollect over 50 of the world’s best speed machines. Each cool vehicle has been carefully selected based on its aesthetics and the top driving performance you need in the most desirable line-up of any Asphalt games to date.\nCUSTOMISATION AT YOUR FINGERTIPS\nUse the new car editor to define the exact color and material of your car. You can also pick the color of the Rims, and more, to look your best on the track.\nA BLAST OF ARCADE FUN\nCharge your nitro to unleash the ultimate Nitro Pulse for the ultimate boost of speed you need to make your car break the sound barrier! Double-tap the brake to do a 360° at any time to take down your multiplayer or AI opponents in style and watch the burnout behind you!\nBECOME A STREET LEGEND\nStart your street journey in Career mode by completing over 60 seasons and 800 events. And become a real Asphalt racer legend by racing against up to 7 rival players from all over the world in the online multiplayer mode.\nULTIMATE RACING CONTROL\nMaster the innovative TouchDrive, a new driving control scheme that streamlines car steering to free your mind to focus on the arcade fun and fast speed.\nSTRENGTH IN NUMBERS\nFor the first time in any of the Asphalt games, you can create your own online community of like-minded racer friends with the Club feature. Collaborate with your fellow speed freaks and motor heads to race your best and unlock the best Milestone rewards as you drive up the ranks of the multiplayer Club leaderboard.\nThe perfect game for fans of free games, arcade racing, driving fast, drift racing, weaving through traffic, and nitro-charged, power motor competition!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Gameloft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"}]},{"id":46755,"name":"Kritika Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d08/d08b698c2cff069df2dbba83dd691879.jpg","description":"Kritika Online is a hyper-stylized, fast-paced, action brawler. You work together as a team to aggressively clear compact instanced dungeons—known as danger zones—quickly and efficiently. The faster you clear the dungeon, the better your loot at the end. This is an amazing game for min-maxxers who pride themselves on their combat ability. Kritika Online not only provides quick action but it also provides all the depth you would expect out of an MMO.\nCombat in Kritika Online is dynamic and fast-paced. You need to jump, dodge, and utilize combos to beat a variety of creature while employing smart strategies to take the biggest of them down.\nTake on the bad guys with oversized blades, alchemical superguns, and dazzling acrobatics. Kritika Online takes style points seriously, and only the best fighters earn the coveted MVP award at the end of each zone.\nDanger Zones designed for quick play sessions propel you into the action, without lengthy world travel. And each one has a super-sized boss you'll just love to beat on! The action is fast, and the enemies are furious.\nBrawl with friends or rampage solo through hordes of enemies in a variety of game modes across in a fully realized, immersive arcade brawler!\nKritika Online lets players choose skills and gear best suited to their playstyle. Nearly every piece of gear in Kritika Online can be customized and improved to help you build your ultimate character.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"ALLM","platforms":[{"id":0,"name":"PC"}]},{"id":27023,"name":"The Legend of Zelda: Phantom Hourglass","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b23/b23b3b0f25b10123c0338cf9f5c8bc12.jpg","description":"The epic story of The Legend of Zelda: The Wind Waker continues as Link\nfinds himself lost and alone in unknown seas in a new adventure.\nFeaturing intuitive touch-screen controls and innovative puzzles, The\nLegend of Zelda: Phantom Hourglass offers new challenges for fans of the\nseries and an easy-to-grasp introduction for gamers new to The Legend of\nZelda. But time grows short, and only the Phantom Hourglass can buy Link\nthe minutes he’ll need to survive.\n\nMany months have passed since the events of The Legend of Zelda: The\nWind Waker, and Link, Tetra and Tetra’s band of pirates have set sail in\nsearch of new lands. They come across a patch of ocean covered in a\ndense fog, in which they discover an abandoned ship. Tetra falls into\ndanger when she explores the ship alone, and Link falls into the ocean\nwhen he attempts to rescue her. When he washes up unconscious on the\nshores of a mysterious island, he is awakened by the sound of a fairy’s\nvoice. With the aid of this fairy, he sets off to find Tetra – and his\nway back to the seas he once knew.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii U"}]},{"id":15500,"name":"Zup! 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/061/06123c43baa64c5c4adfd36c477519be.jpg","description":"Minimal physical puzzle with explosions\n▪ 60+ Levels\n▪ 220+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nSpecial thanks to Dainyer\nMusic: Aηacom","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":9638,"name":"Tormentor X Punisher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4a/b4a7a0dea215e9856a59df832c1db77f.jpg","description":"Welcome to Planet F*ck You!\n\nIt's a real planet, look it up.\n\nEverything in Tormentor❌Punisher can be killed in one hit, including bosses and yourself. Bosses change the shape of the arena, conjuring rooms and traps to make it more hellish and brutal. Demons adjust to your play style and punish you accordingly. Explore and discover new ways of killing enemies to gain cool upgrades. Reload your machine gun by firing your shotgun. Yeah, you read that right.\n\nKill, destroy, f*ck up demons, rack up combos, get upgrades by performing unique kills, and try to survive the constant onslaught. Oh, and look good to your friends by smashing their scores on the leaderboards.\n\n**Got It? Good. Let's F*cking Do This!**\n\n• Fast-paced gameplay that will make the bones in your hands shatter!!!\n• Random order boss spawns featuring fun champions such as BIGBONES, GUTSHANK and PRIESTESS!\n• Leaderboards to prove you're better than the rest of the world, or at least your friends!\n• Undo demons with your besties in local co-op!\n• An eardrum rupturing original soundtrack!\n• Intense sound design with gurgling demons and all that shit!\n• Crunchy comic book-inspired visuals!\n• An annoying Twerp demon celebrating your demise!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"4EversGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":6313,"name":"FOTONICA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7b/c7b211b0d5442ccc235ace4690c38a63.jpeg","description":"Ever wondered what running at 140mph feels like? FOTONICA is a first-person game about the thrill of speed and traveling flawlessly through complex environments.\nFOTONICA is simple, but is not easy: it follows a tradition of arcade games that are easy to pick up and almost impossible to master. A multi-layered level design across eight different tracks, together with a procedural endless mode make for a game that is incredibly deep. Think you can outrun your friends? Try the split-screen versus challenges.\nThe visuals are a treat for the nostalgic player but also for those hungry for new aesthetics.  Every pixel is drawn to convey the maximum sense of speed, an exhilarating journey through light and void.Key features 8 Levels to explore and master.\nPlus 3 different endless levels to compete for high-scores.\nFour-player split-screen local multiplayer mode!\n20 Achievements to unlock plus game stats.\nOnline rankings.\nBeautiful, smooth, and unique vector-style graphics.\nElectronic music by Michael Manning, Nicolò Sala, and legendary composer Baiyon.\n4 Difficulty settings to let you play an even faster version of FOTONICA.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Santa Ragione","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":537743,"name":"Ender Lilies: Quietus of the Knights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6e/f6ebc5c1953b3733a6fcaa484ad72497.jpg","description":"Story\nOnce upon a time, in the Kingdom of End,the Deathly Rain suddenly started to fall,\ntransforming all living things it touched into bloodthirsty corpses.\nIn an instant, the realm fell into chaos.\nThe cursed rain never stopped pouring on the remaining ruins...\nIn the depth of an old forgotten church,\nLily opens her eyes.\n\nExperience\nENDER LILIES is a dark fantasy 2D Action RPG about unraveling the mysteries of a nation destroyed by a cataclysmic event. The fallen Kingdom of End is a tragic and beautiful world featuring a majestic castle, submerged forests and forbidden underground areas.\n\nOn this sorrowful journey, encounter horrific enemies against whom a moment of inattention could be fatal. By releasing foes from their undying curse, you may gain their strength. Overcome the hardships of your journey and uncover the truth with the aid of the fallen knights.\n\nMusic\nExplore a challenging supernatural world to haunting music by musical group Mili, whose credits include Goblin Slayer opening “Rightfully” and other anime franchises such as Ghost in the Shell.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Live Wire","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":297208,"name":"NieR:Automata Game of the YoRHa Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/219/2191c87e13c5fac11afa3e07dd991d7a.jpg","description":"The NieR:Automata™ Game of the YoRHa Edition includes the game itself and comes packed with DLC and bonus content for the full experience of the award-winning post-apocalyptic action RPG, including:\n3C3C1D119440927 DLC\nValve Character Accessory\nCardboard Pod Skin\nRetro Grey Pod Skin\nRetro Red Pod Skin\nGrimoire Weiss Pod\nMachine Mask Accessory\nExclusive set of wallpapers in the following sizes: 1024 x 768, 1280 x 1024, 1920 x 1080, 2560 x 1600","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Platinum Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":19686,"name":"Takedown: Red Sabre","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85f/85f9e2fc2810e68bcd2ed94c4140391e.jpg","description":"TAKEDOWN is a thinking-person’s shooter; brutal, hardcore and deadly - like the real thing. Not for the faint hearted, Takedown requires you to bring your 'A' game - FPS fans looking for an ultra hardcore experience only need apply!\nThe player that takes things slow, aims carefully, and plans their moves right will overcome the player who runs in with guns blazing. Close-quarters battle brings the fight inside, as you would see SWAT teams or SOF units taking down small numbers of dangerous adversaries. Non-linear environments allow for multiple routes and tactics and add replayability.\nIn recent years, shooters have become homogenized. There used to be a wide range of different games to choose, from run-and-gun action titles to slow-paced tactical shooters focusing on strategy and tactics, but now most shooters follow the same model of big set pieces, regenerating health, linear levels, and “cinematic experiences.” The realistic tactical shooters with in-depth planning have almost entirely disappeared in recent years.\nThis game focuses on realistic weapons modeling, squad based play, in a close-quarters battle setting. To succeed in this game you need to take things slow, study your environment, and execute flawlessly. If you get shot, there are consequences. You won’t be hiding behind a wall waiting for your health to regenerate. If a team member goes down, you will have to assess the situation and reallocate team members if necessary to complete the mission. Don’t expect all of the tools and plans to be forced fed to you – it is up to the player to ensure their team is equipped and ready for the tasks at hand.  With features such as realistic bullet penetration, accuracy, and recoil, choosing the proper weapons, ammunition, armor, and gear for the mission is up to you, so choose carefully.\nGameplay modes include single player, co-op, and competitive multiplayer. If you are a fan of old school shooters where thinking meant more than running and gunning or perks, or if you are just looking for something different in your shooter games experience, this is the game for you.Key Features:Fight Smart in Deadly, Close Quarters Combat – Players must think and move tactically, stay alert, watch, listen and choose wisely while setting up their squad for the perfect shot.\nTackle Engagements That Are Different Every Time – Nonlinear maps allow for multiple tactics and approaches to both attack and defense. Gamers must choose their gear to best execute strategy.\nOut Think The Enemy – Gamers need to work closely and communicate well with their team to not only attack the enemy but to coordinate to secure multiple objectives.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Serellan","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":19642,"name":"Five Nights at Freddy's 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/748/748e8b410abcaee51a7438639f040ee4.jpg","description":"This time, the terror has followed you home.\nIn this last chapter of the Five Nights at Freddy's original story, you must once again defend yourself against Freddy Fazbear, Chica, Bonnie, Foxy, and even worse things that lurk in the shadows. Playing as a child whose role is yet unknown, you must safeguard yourself until 6am by watching the doors, as well as warding off unwanted creatures that may venture into your closet or onto the bed behind you.\nYou have only a flashlight to protect yourself. It will scare away things that may be creeping at the far end of the hallways, but be careful, and listen. If something has crept too close, then shining lights in its eyes will be your end.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":19460,"name":"Jolly Rover","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f25/f25826241a1002f7bed2af9de3ba61ff.jpg","description":"It be the golden age of pirates! Dogs of the sea! Quite literally.\nOur swashbuckling sausage-dog star is Gaius James Rover, son of the famous clown Jolly Rover, who died from a blow to the groin from an improperly loaded joke cannon.\nFollowing the tragically comedic death of his father, young Gaius, who insists on using his middle name James, goes to live with his uncle, a wealthy plantation owner on a small Caribbean island. While practising a particularly tricky juggling move, he accidentally taints a barrel of rum with tobacco, creating a potent and addictive brew which he coins ‘Jolly Rover’, one of the most prized substances in the Caribbean.\nAlas, the wealth of Jolly Rover sales only manages to fill the pockets of his uncle, and Gaius longs for action and adventure and, more importantly, the opportunity to start his own circus and follow in the footsteps of his father.\nIt is not long before the fumbled juggling ball of opportunity raps Gaius smartly on the head yet again. While his uncle is away, a large contract for Jolly Rover arrives from Guy DeSilver, Governor of the notorious Groggy Island, with payment upfront!\nIn a blinding flurry of optimism, Gaius pools his meagre savings with this advance and charters a ship and crew to take him to Groggy Island. Along the way he meets a colourful band of seafaring cutthroats, scallywags and rogues otherwise known as pirates.\nIt is here we begin to follow the short and stubby tail of Gaius across three wild and untamed tropical islands, as he attempts to fulfil his dream of starting a circus, hampered only by pirates, villains, voodoo, love and considerable lack of loot.\nJolly Rover is a traditional 2D point and click adventure, including casual elements, such as an integrated hint system, and task bar. Bonus elements include unlockable Captain Bio's, music, concept art and developer commentary!\nKey features:\nOver 60 beautifully rendered scenes to explore\n25 colourful, fully animated and voiced characters\nTraditional point and click adventure with simple one-click interface\nOrganic and fully integrated hint and task tracking system\nUnlockable extras include Captain Bio's, concept art, music tracks and directors commentary\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Brawsome","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12025,"name":"High Octane Drift","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ff/2ff3fbffc465087b95e36b2f33b0371d.jpeg","description":"High Octane Drift is a 3d racing game about drifting motorsport, filled with full-throttle fun and a healthy competitive spirit. You start as a rookie in a live drifting community, earning reputation and cash to build your unique drifting car, gather your crew and win top class High Octane drifting series.\nRealtime multiplayer up to 32 players;\nEver growing collection of cars with changeable aerodynamic elements;\n1500+ performance parts for 20+ swappable engines;\nCustomizable suspension, gear ratios and wheel lock angles for fine tuning;\nCreate and upload your very own car liveries for everybody to see;\nBuild rare parts in a workshop for ultimate performance;\nTeam up to beat other crews;\nParticipate in different events and championships to get exclusive prizes and fame;","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cruderocks","platforms":[{"id":0,"name":"PC"}]},{"id":10396,"name":"Spellsworn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae3/ae330076ae5c7330eeb8b52dd86414b7.jpg","description":"Inspired by arena and player vs. player classics, such as League of Legends, Super Smash Brothers, and the Warcraft 3 Mod, Warlocks, Spellsworn is a PvP arena game in which you must use magic and quick reflexes to outsmart and obliterate your opponent. Set in a world gripped by a war of magic, you and other spellcasters fight for control over 5 rounds of battle in areas of power.\nUsing a limited amount of currency that increases throughout the game, you must determine the best spells for the job from your varied arsenal and defeat your enemies by reducing their health to 0. Will you focus on Offensive spells such as Fireball and Meteor, or will you Windwalk your way through your opponent’s attacks and Counter Pulse their spells back at them? With an ever-changing environment that poses as much of a threat as your opponent, adaptation is just as important as a quick hand and mind. In such a brutal and chaotic world, only the skilled and strong will be victorious.\nSo, don your robes, banish your summoned Rock Pillars, and prepare to do battle in the arena of Spellsworn!\nTest your wits and reflexes in spell-filled multiplayer combat, either alone or in teams - supports up to 8 players.\nChoose your loadout from over 40 spells across 6 different disciplines - Offensive, Defensive, Area, Utility, Travel, and Melee\nEngage in battle across 3 unique arenas, each with their own dangers and demands\nGain experience through battle, earning skins, weapons and more as you level up","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frogsong Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3888,"name":"F1 2013","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6e3/6e319b00ea9844539b3b20753d8ca0b4.jpg","description":"Make history in FORMULA ONE™! Experience all-new 1980s classic content plus all the cars, stars and circuits from the 2013 FIA FORMULA ONE WORLD CHAMPIONSHIP™ in F1™ 2013.  F1 2013 includes F1 Classics, an expansive new game mode introduced by legendary broadcaster Murray Walker, where you’ll race famous cars from Ferrari, Williams and Lotus against icons of the sports including Nigel Mansell, Mario Andretti and Gerhard Berger. Classic content also includes two historic circuits – Brands Hatch and Circuito de Jerez - and can be played in a range of modes including split-screen and online multiplayer.\nF1 2013 also features all of the current drivers, team moves, tire changes and remodeled handling to bring alive the experience of racing motorsport's most advanced and exciting cars. New enhancements, improvements and new, expanded and returning game modes combine to deliver the most complete simulation of a FORMULA ONE season in video game history.\n1-2 players\n455KB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-16\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© 2013 The Codemasters Software Company Limited ('Codemasters'). All rights reserved. An official product of the FIA FORMULA ONE WORLD CHAMPIONSHIP.\nThe F1 FORMULA 1 logo, F1 logo, F1 FIA FORMULA 1 WORLD CHAMPIONSHIP logo, FORMULA 1, FORMULA ONE, F1, FIA FORMULA ONE WORLD CHAMPIONSHIP, GRAND PRIX and related marks are trade marks of Formula One Licensing BV, a Formula One group company. Licensed by Formula One World Championship Limited. All rights reserved.\nAll other copyrights or trademarks are the property of their respective owners and are being used under license. Unauthorised copying, adaptation, rental, lending, re-sale, arcade use, charging for use, broadcast, cable transmission, public performance, distribution or extraction of this product or any trademark or copyright work that forms part of this product is prohibited. Online features may be terminated after 30 days notice on www.codemasters.com. Developed and published by Codemasters.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]}]