[{"id":9495,"name":"ArmA II: Operation Arrowhead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cce/cce227a4ac4e432ee0ba19d0dfe77c30.jpg","description":"This expansion pack to 2009's ARMA 2 features a standalone plot and setting and does not require installing the original game.  Operation Arrowhead is set in an alternative 2012 in Takistan, a made-up mountainous Asian country reminiscent of Afghanistan. The protagonists are the NATO forces consisting of American, Czech and German military. Their mission is to overthrow the corrupt regime of colonel Muhammad Aziz and to protect neighboring (equally fictional) Karzeghistan from a Tatkistani invasion. The player will lead them through a series of battles in the desert, highland, and urban environment. At the various stages of the game, the player will control not only foot soldiers but also tanks and helicopters. \n\nOperation Arrowhead adds certain new features to ARMA 2 gameplay. The expansion introduces additional vehicles and weapons, enhanced infrared vision, removable backpacks, and drones that can also be controlled by the player. There are also DLCs that allow you to add British soldiers and a private military company. The game is considered quite hardcore by its difficulty, even for experienced gamers, so it is recommended to complete a tutorial stage at the beginning.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":2287,"name":"Her Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9a/a9a4e45ad8e653df2295e8410b7e96fd.jpg","description":"There is a small little genre of interactive movies in the game industry, but it seems that not only Quantic Dream makes this type of games. Her Story also is an interactive movie video game which is written and directed by Sam Barlow. Her Story is about a man who is missing and the player has to focus on searching through databases of various video clips from police interviews with missing man’s wife Hannah Smith, in order to solve a case. \r\n\r\nHer Story is the first game made by Sam Barlow since his departure from Climax Studios. He wanted to create a game which focuses on story. He decided to use live action footage and created a police procedural game. In order to make it as much realistic as possible, Barlow watched lots of real police interviews, by doing so he discovered that there is a lot of ambiguity in those files and he wanted to incorporate that into the game as well.  \r\nThe game was praised because of its original narrative, character performance and interesting gameplay mechanics.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sam Barlow","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":31771,"name":"The Elder Scrolls II: Daggerfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/522/522f66c5f8542a945b9e2b1942f1ad63.jpg","description":"The ancient golem Numidium, a powerful weapon once used by the great Tiber Septim to unify Tamriel, has been found in Iliac Bay. In the power struggle that follows, the King of Daggerfall is murdered and his spirit haunts the kingdom. The Emperor Uriel Septim VII sends his champion to the province of High Rock to put the king’s spirit to rest and ensure that the golem does not fall into the wrong hands.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":20992,"name":"Cry of Fear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e06/e062facadfeb0a0339103bf7e81ca129.jpg","description":"Cooperative horror games can work. It’s achieved either through building a game with a constant threat to all players or if it’s a game mode that adds horror elements or atmosphere to already existing multiplayer game. Originally developed as a Half-Life mod, Cry of Fear is a free-to-play horror game, that has single-player and multiplayer modes. Players take control of Simon Henriksson that finds himself after a car accident in a dark city overrun by monsters. Now Simon has to explore the city and find the source of the evil.\nThis take on a psychological horror introduces several mechanics in order to make the gameplay challenging, Cry of Fear can be played in single-player and multiplayer with three other players, which doesn’t change the events of the campaign. Players have limited inventory space, only six slots to manage their healing items and weapons. But, characters are allowed to dual-wield items, meaning that player is capable of finding the combination of action items for specific game sections or specific team role players might take in multiplayer. Similarly to Silent Hill series, in order to progress players will have to solve puzzles while city swaps between “safe” and “nightmare” modes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Team Psykskallar","platforms":[{"id":0,"name":"PC"}]},{"id":313843,"name":"Goat of Duty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eef/eef872fddedf40e6d2236bb981725cc6.jpg","description":"In the grim darkness of the distant future, there are only goats.\nIt all started with a freak nuclear accident that gave all goats the necessary intelligence to quickly overthrow their human owners with their powerful rams, high jumps, and ear-blowing bleats. No, wait, that wasn’t it. The goats were intelligent from the very beginning, but since they had no thumbs, they waited patiently for humanity to develop automated robots capable of producing what they needed in order to... No, that doesn’t work either. In an alternate universe, goats are the mightiest warriors of the...\nOK, look, we admit it. There’s no lore here. You are a goat. You’re armed to the teeth (well, the horns). There are other goats out there who want to kill you. It’s as simple as that. Now go out there and show 'em what you’ve goat.\nGoat of Duty is a fast-paced and intense multiplayer first-person shooter, and that’s pretty much all you need to know. No nonsense: no need to master a convoluted metagame, learn different characters, combine skills, strategic team play... just devilish combat arenas, powerful weapons, and fast-paced action. Well, and lots of silly humor, crazy goatstumes (skins), and goat mechanics for you to troll your friends to your heart’s content!\nGoats. You are an armed goat fighting other goats. It doesn’t get any better than that!\nExperience intense deathmatch multiplayer battles for 2 to 10 goats\nFast-paced gameplay: Goats are fast and nimble, after all; they can climb pretty much anything and jump really high.\nOld-school, no-nonsense shooter experience: Just you and your skills against your enemies!\nWear crazy goatstumes, dance like a goat, and troll your buddies when you bleat them in combat!\nFour multiplayer modes: Classic free-for-all and team deathmatch and two original Goat of Duty creations (stay tuned for details!).\nExplore a variety of crazy maps with different playstyles: Feel right at home on a futuristic farm, explore mountains in distant planets, survive the desert of the lambs, experience hair-rising fear at the horror well, wander adrift the space station, or encounter mind-boggling randomness at the medieval village -- among others!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"34BigThings","platforms":[{"id":0,"name":"PC"}]},{"id":4520,"name":"Alice: Madness Returns","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b5/0b5410b1e4b3fb72696dcefbf4f1cf40.jpg","description":"This sequel to American McGee's Alice follows the protagonist, Alice Lidell, as she returns to the dark world of her subconsciousness, the nightmarish version of Lewis Carrol’s Wonderland. After she was released from the psychiatric asylum, Alice moved to the orphanage, where she’s being treated with the use of hypnosis. It doesn't stop her from descending again into the grotesque realm of disturbing visuals, creepy music, and absurdist logic. She will again meet the Cheshire Cat, the Mad Hatter, the Caterpillar, the Queen of Hearts, and many other darker versions of Carrol’s whimsy characters. Her journey through the Wonderland serves as a metaphor for Alice fighting her own madness.\nThe game is played in the third-person view. On her way, Alice will jump the platforms, solve puzzles, and fight enemies. The combat system allows for a seamless flow of attacks, dodges, and combos. Besides her trademark Vorpal Blade, Alice will use other, somewhat surreal weapons, such as Teapot Cannon, Clockwork Bomb, or Pepper Grinder. In the sequel, Alice gains a new ability called Hysteria that can be activated when her health is the lowest.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":5711,"name":"The Incredible Adventures of Van Helsing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c3/3c363e31f4add887affadc82c641de72.jpg","description":"The Incredible Adventures of Van Helsing is an action RPG with elements of the hack and slash genre and the first part of the trilogy of the same name. It tells the story of Van Hellsing’s son who continues his father’s work and kills monsters on the streets of the fictional Borgova city. There he fights against a cult that spoils the life of civilians.\nYou can develop the hunter's skills and upgrade his weapon and magic possession. Van Helsing Junior also has an ally, a ghost named Catherine who helps him in battles. Depending on your choice how to upgrade her, she can be a tank or a healer. The variety of weapons is not very huge; however, there are several ways to customize your character cosmetically.  \nWhile the developers took inspiration from Bram Stoker’s Dracula, the game only slightly reminds of this novel. However, they successfully caught the atmosphere of a little 19th-century town and filled it with deep NPCs and interesting technological details.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":445442,"name":"Helltaker","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/67a/67aef58e8ead90609f7adbd20d72a033.jpg","description":"You woke up one day with a dream. Harem full of demon girls. You've opened the portal in hopes of fulfilling your wildest desires. Hellfire burns through your lungs, death awaits around every corner and everything looks like from a cutesy mobile game. You are in hell.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"vanripper","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17975,"name":"DOOM II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/38a/38af969459ad6e5de116ec8a4a84218c.jpg","description":"The game from the legendary programmers John Carmack and John Romero, who worked together with American McGee, on the first-person shooter game that will run on anything: from mobile devices to engineering calculators. The game became the second in the series Doom, received improved multiplayer, graphics and improved optimization.\n\nGameplay-wise game is not so different from its predecessor. The developers decided to take advantage of the progress of the computer hardware to fine-tune their game engine. The player still took control of the nameless space marine, which traveled through 30 non-linear levels. A level is considered to be completed after the player finds the coded doors. A rich arsenal of weapons and a variety of models of enemies will not get bored.\n\n The plot continues the story of the first part: after defeating the invasion of demons on the moons of Mars and returning from Hell, the protagonist finds the Earth captured by the creatures that he just conquered. A solo company can be fashioned alone, and in multiplayer, to battle with friends today: for the game, there is a huge amount of third-party mods to play online without using of archaic dial-up connection.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":16856,"name":"AudioSurf","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f5/0f585fa72f534f62f9e5da051179f5de.jpg","description":"Audiosurf is a puzzle rhythm game developed by Invisible Handlebar. \n\nPlayers control a levitating vehicle and race it down a multi-colored highway. The players have to collect colored blocks known as \"cars\" and form clusters of three or more blocks of the same color. Hot colors such as red or orange get the player more points than cold ones such as blue or purple. The more clusters formed - the more score the player gets. Players are also awarded different bonuses depending on how did they complete the race. Players are also awarded one of the medals: bronze, silver or gold based on the selected difficulty.\n\nPlayers are free to choose one of 14 different vehicles to use. Each vehicle belongs to one of the three difficulty groups and has unique abilities. Using different vehicles may change the gameplay drastically.\n\nThe main feature of Audiosurf is the synchronization of the track, traffic pattern, and color with the song you choose. The song dynamics affect the track elevation (in case of a song build-up for example).\n\nOn launch, the game featured the soundtrack from Valve's The Orange Box and songs from independent artists. Players can also choose any track saved on their PC.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Dylan Fitterer","platforms":[{"id":0,"name":"PC"}]},{"id":906547,"name":"Hogwarts Legacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/044/044b2ee023930ca138deda151f40c18c.jpg","description":"Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and new locations as you explore and discover fantastic beasts, customize your character and craft potions, master spell casting, upgrade talents, and become the wizard you want to be.\r\n\r\nExperience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. You have received a late acceptance to the Hogwarts School of Witchcraft and Wizardry and soon discover that you are no ordinary student: you possess an unusual ability to perceive and master Ancient Magic. Only you can decide if you will protect this secret for the good of all, or yield to the temptation of more sinister magic.\r\n\r\nDiscover the feeling of living at Hogwarts as you make allies, battle Dark wizards, and ultimately decide the fate of the wizarding world. Your legacy is what you make of it.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Avalanche Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":4483,"name":"Duke Nukem Forever","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08a/08aa92e004f13ad2d41127327314c3f9.jpg","description":"Duke Nukem is a larger-than-life macho who smokes cigars, speaks in one-liners, and has a kink for hot girls and big guns. Twelve years ago, Duke defeated invading aliens and became a worldwide celebrity, but now another invasion forces him to go out of retirement. He has to save all the Earth's women, who are being kidnapped by aliens. Most weapons are the same as in the original game. However, this time Duke cannot carry all his arsenals and is restricted to only two weapons at a time. He can also use “holoduke”, a holographic version of himself, to distract enemies. Duke restores his health over time using a new mechanic of “ego bar” — a measurement of Duke’s enormous ego that needs to be bolstered.\n\nThis belated sequel to Duke Nukem 3D spent 15 years in development, so it may feel like an artifact from another era. This is especially obvious from the game’s vulgar black humor. The protagonist may urinate, drink beer, and tell somewhat chauvinistic jokes about women. There's also controversial Capture the Babe multiplayer mode, based on \"capture the flag\", but instead of flags, there are girls that have to be spanked.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Gearbox Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16649,"name":"Serious Sam 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc7/bc77b1eb8e35df2d90b952bac5342c75.jpg","description":"Serious Sam 2 is the sequel to the Serious Sam: The Second Encounter. The game has single-player and multiplayer mods. In the single-player campaign, the player controls the main protagonist of the series named Sam “Serious” Stone who is once again challenged by extraterrestrial overlord Mental and his infernal forces that want to destroy the humanity. In order not to let them do that, Sam must to go through various different worlds and collect parts of a medallion. In his journey, Sam meets natives living in the worlds in which he travels as well as he is guided by the Sirian Great Council. The multiplayer game mode includes online co-op and deathmatch regimes. Serious Sam 2 includes new engine called Serious Engine 2, which features high dynamic range rendering and light bloom. \nLike the first game in the series, Serious Sam 2 is just a plain shooter where the player has to kill dozens of various enemies including bosses. Once again, the player can choose between various of different weapons in order to kill hordes of enemies from other worlds and prevent the annihilation of humanity.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Croteam","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":13512,"name":"Cortex Command","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f81/f81fd968a3161e7d35612d8c4232923e.jpg","description":"Cortex Command is a 2D pixel art tactical game. The story is set in the future where humans united with machines so they can send their brains everywhere in the universe. Since then humans explore other planets, interact with aliens and mine gold. You play as one of these brains that are settled on an unnamed planet and needs to survive there.\nAs a brain you must complete multiple missions that include self-defense, exploring dangerous parts of the planet, searching for elements of the mechs and so on. There are several factions in the game; each of them has different units you can use to fulfill your plans. The environment is fully destructible and provides you with gold and other resources to protect your brain and attack the opponent’s base.\nThe game features a turn-based strategic campaign along with a four-player multiplayer mode. Cortex Command can also be easily modified with several in-game editors.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Data Realms","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5706,"name":"Valkyria Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d4/0d4e5446db732e2fcce34d1dcb4dd914.jpg","description":"Valkyria Chronicles takes place during the early period of World War II in a fictional region which is in Europa. The peaceful nation of Gallia is attacked by East European Imperial Alliance because of Ragnite ore which is a petrol in the game's universe and which Gallia nation has a lot. The main focus of Valkyria Chronicles plot is the resistance against Imperial Army. \nOne of the game's selling point is the visual style which is similar to cell-shading and looks like it all was drawn with a pencil. This is one of those \"playable anime\" kind-of games. The gameplay itself is fun yet difficult if a player doesn't know what to do. It is turn-based and every turn should be well-measured. There are phases of player characters and of enemies. Wins that which is planning his turns more thoughtful. The game also has a strong anti-war message.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":4186,"name":"Persona 4 Golden","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b2c/b2c9c6115114c8f7d461b5430e8a7d4a.jpg","description":"Persona 4 Golden is the jRPG and the remake of the Persona 4, released four years after the original. This is the fifth part of Persona series which is at the same time a sub-series to an even bigger franchise called Shin Megami Tensei. The remake is released exclusively for PS Vita handheld. \n\n###Gameplay\nThere is a similar pattern to all Persona games: the gameplay is divided into the usual school life and the underworld dungeon crawler part. During the first sections of the game, the player controls the protagonist and examines the city, transits between location and forms Social Links with the other students. The underworld part includes distorted location from the common life which the protagonist must explore with his squad. During the exploration, there are multiple random encounters and boss battles involved. \n \n###Story\nThe story takes place in Inaba — fictional city. The main characters explore the serious of murders bizarrely to find out, what happened and who is behind those killings. During their investigations, the team comes across a unique ability to summon their inner selves called personas.\n\n###Golden version\nThe new character —Marie with the individual story arc was added into the expanded version as well as an internet connection allowing one to get help in the battles. Also, minor improvements were introduced into anime videos and lines in the game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Atlus","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":15861,"name":"STAR WARS - The Force Unleashed Ultimate Sith Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b2d/b2db4496b084b235742cf6e9894bbf36.jpg","description":"The first game in The Force Unleashed project is set in the Star Wars universe after the ending of The Revenge of the Sith and describes the early years of the Galactic Empire. The game is one of the few that allow the player to assume the role of a Sith disciple, although you will eventually have to choose between the light and dark side of the Force. The protagonist is Starkiller (a reference to the early draft version of Skywalker), the secret padawan of Darth Vader himself. The young apprentice is tasked with hunting down and killing the few remaining Jedi Knights. He will travel to various planets of the galaxy far, far away and fight Jedi and rebels using his lightsaber and special Force abilities, such as telekinesis and force choking. Both types of attacks can be used to form combo movements. Defeating enemies earns Starkiller experience points that can be used to level up his skills.\nUltimate Sith Edition includes three additional levels: two DLC missions set on Tatooine and Coruscant and a previously unreleased level set on Hoth. The Tatooine mission starts the Infinities plotline, which follows the non-canon “dark” ending of the original game. The Hoth mission concludes it and sets you up against the famous Luke Skywalker.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Aspyr Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":28631,"name":"Fable III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/827/8276bc29cdc27752e27802b94aea255e.jpg","description":"Set half a century after the ending of Fable II, the third part sees the fantasy kingdom of Albion dramatically changed. The scientific progress has come, bringing new machines, factories, firearms, gaslight, steampunk aesthetics and a new way of life. And the Industrial Revolution is about to provoke the actual revolution. Too many people in the kingdom are not content with the changes and are about to overthrow the current king, who is also the main character's brother. Unlike the previous game, you are an aristocrat from the very beginning. It is up to you to take action and save your homeland this way or another, and it depends on you if your character is remembered as a wise and just leader or an evil tyrant.\n\nThe plot is non-linear, so the player's actions and decisions can influence not only other characters' perception of him but also the world in general. Compared to Fable II, social interactions with NPC became simpler and more straightforward. It is usually enough to be nice to people to make them like you, or even fall in love with you. To make an engagement, however, you will have to complete certain quests.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Lionhead Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":3838,"name":"Need for Speed Rivals","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1fa/1fa75f0895240b12fc65cc98ae9649fd.jpg","description":"Welcome to Redview County, where a street-racing rivalry between cops and racers never stops as both sides compete in an all-out war featuring the fastest cars, mods and technology in a gritty open road environment.  Play as either a cop or racer, where each side of the law has its own set of high stakes challenges, rewards and consequences. Risk everything in the ultimate high stakes rivalry.\nVideo output in Full HD 1080p requires 1080p native display.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2013 Electronic Arts Inc. All Rights Reserved","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Criterion Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":28615,"name":"Gears of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/988/98834d39955e7f15d3717fac438128aa.jpg","description":"The game from the famous game designer Cliff Bleszinski. Gears of War for many years has become the hallmark of the game console from Microsoft. Gears of War is a third-person shooter that uses a cover system from the game Kill Switch as the main game mechanics: the protagonist sticks to the walls, ledges and other elevations on the map, shooting back at the enemies. This is the first game of the series.\n\nThe action takes place on the exoplanet Sera. On it, there is a stronghold of human civilization, which after a thousand-year conflict is on the verge of collapse. Underneath all the main human cities, dwells the Locust Horde - inhuman monsters the size of a truck.\n\nThe player becomes a soldier Marcus Phoenix from the Coalition of Ordered Governments. The action begins 14 years after the first contact: the prison in which the Phoenix was kept attacked by The Horde. An old friend helps Marcus to get out and thus begins an adventure to save the world from chthonic invaders.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":7439,"name":"Call of Duty: Ghosts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb2/eb24800b4491701eca481e7c990bce4a.jpg","description":"Call of Duty: Ghosts is the tenth major game in Call of Duty series and the sixth developed by Infinity Ward. The game tells a story about the nuclear destruction of the Middle East in the near future. The game’s main characters are the Ghosts, a force of U.S. Special Operations unit who conducts missions behind enemy lines. The unit is led by U.S. Army Captain Elias Walker, his sons Logan and David Walker but also with Riley, Captain Thomas A. Merrick and Sergeant Keegan p. Russ. The main antagonist of the game is Gabriel Rorke, who was a former leader of Ghosts but now works for the Federation after being brainwashed by it with torture and hallucinogens.\nIn Call of Duty: Ghosts the player controls not only a character of Logan Walker, but also an astronaut specialist Baker, Logan’s father Elias Walked and Riley – a dog who is the part of Ghosts team in some missions. \nThe game also features usual multiplayer and Extinction mode which tells a story set in the alternate reality about ancient creatures called Cryptids who want to destroy humanity.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Raven Software","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":3601,"name":"inFAMOUS: First Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3bd/3bd37baee6dc6e15c278a83c787ebd8d.jpg","description":"InFAMOUS First Light is a third-person open-world game developed by Sucker Punch. It is a spin-off/prequel hybrid to inFAMOUS Second Son, the third installment in the series.\r\n\r\n7 years ago an explosion in a fictional Empire City caused a plague outbreak. During that time people with superpowers known as Conduits start to appear. Most of the conduits died fighting the outbreak. After these events, the U.S. government established the Department of Unified Protection. The Conduits are considered bio-terrorists and held prisoner. The game tells the story of Abigail Walker who possesses the power of neon, how she was captured by the D.U.P. and imprisoned in Curdun Cay. The story is set 3 years before the events of InFAMOUS Second Son.\r\n\r\nThe game focuses on the neon power that was one of the powers present in InFAMOUS Second Son. Neon power is used for distant precise powerful attacks. The Neon Beam deals a lot of damage yet it has a low fire rate. In addition to normal Neon Beam, it is possible to use Stasis Bubbles that freeze the enemies. A more powerful charged Phosphor Beam is also present. Players can travel at high speeds using the Light Speed.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":13566,"name":"Into the Breach","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/800/800d07ca648a9778a8230f40088e0866.jpg","description":"The remnants of human civilization are threatened by gigantic creatures breeding beneath the earth. You must control powerful mechs from the future to hold off this alien threat. Each attempt to save the world presents a new randomly generated challenge in this turn-based strategy game from the makers of FTL.\r\n\r\n### Key Features:\r\nDefend the Cities: Civilian buildings power your mechs. Defend them from the Vek and watch your fire!\r\n\r\nPerfect Your Strategy: All enemy attacks are telegraphed in minimalistic, turn-based combat. Analyze your opponent's attack and come up with the perfect counter every turn.\r\n\r\nBuild the Ultimate Mech: Find powerful new weapons and unique pilots as you battle the Vek infestation across Corporate-Nation islands.\r\n\r\nAnother Chance: Failure is not an option. When you are defeated, send help back through time to save another timeline!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Subset Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":5538,"name":"Dark Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/582/582b5518a52f5086d15dde128264b94d.jpg","description":"Bone-rattling because of its complexity adventure in the Lordran, land of the ancient lords and endless mysteries. We are playing for a tacit prisoner, whose goal is to become human again. This is the first game in the series.\n\nThe main game mechanics is exploration. Dark Souls is a third-person action RPG, a part of the Souls series. The player slowly advances from one point of contact to another, defeating more and more powerful enemies. Completing the game is a truly hard task with the first, one of the main features of the series - a constant repetition and search for better tactics to overcome a certain enemy. After each savepoint respawns defeated enemies, after each death the player loses all the accumulated in-game currency.\n\nIn the game there is an unconventional multiplayer system: players can invite other people to join their game sessions for a duel or to help each other with difficult bosses.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":54491,"name":"Quake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a8/3a82d7f5c90ab082fe475e28d58bee8b.jpg","description":"###The roots\nOne of the classic representatives of the first-person shooter genre. Designed and released in 1996 by the authors of the groundbreaking game Doom - iD Software. This is the first game to start the still ongoing series. Unlike its famous predecessor, the game uses an engine capable of rendering full-fledged 3D: the game supports an earlier version of 3D acceleration through OpenGL. After moving to a new engine, the game needed a new control scheme: the movement is now possible in all three directions, including the vertical axis. This feature added to the game an additional difficulty: player have to expect the enemy attack from any direction. The game also has a full-fledged multiplayer, the previous version of which the Doom players liked.\n\n###Key features\nIn a single player campaign, the player takes control of the main character named Ranger, who went to the portal in order to stop the unknown enemies, code-named Quake. The plot of the adventure consists of 32 separate levels. Six more maps are available in multiplayer for the battles between the players for deathmatch mayhem. Two mission packs were released for the game, which adds new enemies, new levels, new maps, new weapons and a new experience for players to the original game. Both packs were greatly received by both players and critics.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"id Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":13525,"name":"Assassin's Creed 2 Deluxe Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c14/c14d85f2ec10e82e3d5cd837c9c0a56d.jpg","description":"Assassin's Creed 2 Deluxe Edition is the second major installment of Assassin’s Creed series and the first with the main protagonist named Ezio. The first game in the series called Assassin’s Creed was praised for its mechanics and interesting setting yet it was highly criticized for being too repetitive and boring. It took 2 long years for Ubisoft to repair their mistakes and that resulted in Assassin’s Creed II. Now, the game looks a lot better not only graphical bus also gameplay-wise. It became much more interesting and epic. \nAssassin’s Creed II offers a fictional history setting which as in all the others games in franchise tells a story about the never-ending war between assassins and the Knights Templars who want to control the world. The story of the game is set in modern times and it fallows Desmond Miles who once again has to go into the machine called Animus to relive his genetic memories of his ancestor who now is Ezio Auditore da Firenze.  The main story takes place in Italy during the Renaissance period in the 15th and early 16th century. Cities of Florence, Venice, Tuscany and Forli are fully explorable. Ezio fights those who betrayed his family and the player is kindly welcomed to experience this epic story as the Ezio himself.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17676,"name":"Doom 3: BFG Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/645/64578c2a6daa30995692525172fd13ef.jpg","description":"BFG Edition is an updated re-release of the 2004's Doom 3, a part of Doom series.\n \n###Changes from Doom 3\nBFG Edition features improved graphics and sound, two expansion packs, and certain updates that alter the gameplay. It introduced checkpoints that automatically save the player’s progress. There are slight changes in the controls, as this version doesn’t allow the use of hotkeys. This edition also includes a copy of the original Doom in its Ultimate version.\n\n###Plot\nThe plot is identical to Doom 3. The game is set on Mars in the 22nd century. The player controls a nameless space marine (nicknamed \"Doomguy\" by the fans). His task is to defeat the demons of Hell that invaded the Delta Labs research facility. Doom 3 features the series' trademark violence, monsters, and black humor.\n\n###Expansion packs\nBFG Edition includes two expansion packs. The Resurrection of Evil was previously released in 2005. The plot, set two years after Doom 3, follows a team that comes to a space station and discovers the hellish Artifact. This expansion introduces new weapons, such as The Grabber and the double-barreled shotgun, as well as additional multiplayer maps.\n\nThe Lost Mission is a new story expansion that was not previously released. It allows you to play as a marine from the Bravo squad that was only mentioned in the original Doom 3. The protagonist's goal is to descend into Hell to find and destroy a teleportation device that demons are going to use to invade Earth.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"id Software","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":14211,"name":"Children of Morta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/434/43431e04f0cd5419a3d8e31a5c8c3d5d.jpg","description":"The Bergson family has watched over Mount Morta for generations as the guardians of the mystical mountain. They now face their most dangerous trial as a family.  Corruption has spread, morphing the once peaceful mountain into a violent and monster infested nightmare.\nExperience what it means to be in a family of heroes.  Take part in their journey, their struggles, and their victories!  Witness a love for eachother unmatched by even the gods themselves.  Fight through hordes of monsters unimaginable as you explore a mountain constantly in flux.  Gorgeous and breathtaking procedurally generated dungeons guarantee a unique experience every time you leave the safety of the Bergson’s house in pursuit of the truth behind the Corruption.\nKey Features:\n6 Playable Characters\nJohn, Mark, Linda, Joey, Kevin, and Lucy are all prepped and ready for the forthcoming fray.  Discover each family member’s unique fighting style and delve into their personalities and past.\nProcedurally Generated World\nEvery forest, dungeon, or temple you explore and skirmish through is procedurally to guarantee a unique experience every play through.\nMountain of Mystery\nDelve into the mountain and discover the mystical world of Morta.  Unearth why the Corruption has come to this seemly peaceful mountain.  Find lore scattered about giving glimpses into the lives of the mountain’s residents.\nPixel Art to A New Level\nA combination of hand painted pixel art and frame by frame animations partnered with modern lighting techniques come to life to create the beautifully dangerous world of Mount Morta.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Dead Mage","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":58735,"name":"Unravel Two","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e3/3e355e1b8a5ee47f4c76e28e3055236d.jpg","description":"When you cut ties to the past, new bonds form. In Unravel Two, create a Yarny of your very own. Then build relationships with other Yarnys in local co-op or as a single player, fostering friendship and support as you journey together.\nBegin your adventure in a cold and imposing land, then watch your surroundings blossom with new life as you chase the spark of adventure. Dive into an immersive story filled with energy, exuberance, inspiration – even monsters. Approach every challenge with positivity and fearlessness to awaken the world around you, and discover an unbreakable bond between friends.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":2296,"name":"Fahrenheit: Indigo Prophecy Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b51/b51c46cccb277e6451e2a67e4213a820.jpg","description":"Fahrenheit Indigo Prophecy Remastered is an upgraded version of Fahrenheit, an interactive drama game. It heavily focuses on making decisions and has several endings depending on your choices. The remastered version has improved graphics and isn’t censored. the mobile port has controls suitable for portable devices.\n\nOne of the first games in the interactive movie genre, Fahrenheit influenced its rules largely. So, the key feature of this game that the gameplay is based on context-sensitive actions. Available options are shown at the top of the screen, and your choices during the events directly affect the way the story develops.\n\nYou take on the role of Lucas Kane who unexpectedly to himself kills a man in one of New York’s cafes. Trying to understand why this happened, he returns to the crime scene. The game switches between him and a couple of detectives that investigate the murder. This is another key feature of the game that helps to show the story from different points of view. In the end, these lines are put together to have the overall ending.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":57908,"name":"Tomb Raider II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfc/cfc91eccc1de338b75a0576310ccbcec.jpg","description":"Tomb Raider II is an action-adventure video game, part of the Tomb Raider series and the sequel to the 1996 video game Tomb Raider. Developed by Core Design and published by Eidos Interactive, the game was originally released for Microsoft Windows and PlayStation in 1997 and then ported to Mac OS in 1998. Eidos released an expansion pack, Tomb Raider II: Golden Mask for PC in 1999. The expansion pack includes four bonus levels.\nThe game sold over 8 million copies worldwide as of 2003, making it one of the best-selling games released up to that point and the second best selling of the franchise.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Square Enix","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"}]},{"id":9871,"name":"Guns of Icarus Alliance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/57f/57fc2051dd27c9947d12cdf63790d122.jpg","description":"Guns of Icarus Alliance is an extended player versus environment edition of Guns of Icarus Online, a player versus player multiplayer FPS. It contains Set in a steampunk world, the game is focused on airship combat where you take the role of a member of a four-player team. Every player is responsible for their part of the ship and needs to perform different functions. The game features all content from the original game, including PvP mode.\n\nThere are three classes in the game: Pilot, Gunner or Engineer. Only the good interaction and balance between these roles will let your team be successful during battles. You can build and customize your own ship and complete different missions against AI opponents. Raising your rating within the faction, you will gain all perks a leadership can give. Additionally, the game features the fight over certain territories you can conquer. As a result, every match affects the entire war map, taking into account your and your opponents’ wins and fails.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Muse Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":50418,"name":"Deiland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8b/a8be68d2c23d09f180946fbe5d9cdc56.jpg","description":"A long time ago, when the universe was young, children were sent to Minor Planets. Their mission was to awaken the magic of the Crystals kept within the planet's interior.\nThis is the story of Arco, the youngest of these children who lives on the smallest planet, Deiland. The tiniest of them all.\nDeiland is an adventure game that combines RPG and sandbox mechanics. Its simple calm appearance is the result of the effort put into its creation. It seeks to surprise players with small details and an interesting storyline and appealing characters. Deiland planet is our home, and living on this small place will be a unique experience for every player.\nBut it isn't all peace and tranquility on Deiland. A shadow wonders in the absolute darkness of the universe. The shadow speaks through dreams to evil creatures pressing them in to its service, with the sole objective of finding children and their planets and to rob them of their power of the Crystal and subdue them.\nMain features\nDeiland is a sandbox planet that you can develop in your own way.\n12 characters to meet with 100 quests to complete.\nMore than 120 inventory items to manage and trade.\nSurvival mechanics: hunger and fatigue.\n12 structures to build and 4 house levels.\nImprove your skills. The game has some RPG mechanics, like character leveling, 4 magic spells to learn and 4 skills to upgrade (strength, intelligence, agility and stamina).\nImprove your equipment with 7 tools (each with 3 levels).\nDay/night cycle and climate events.\nMore than 50 craft recipes: tools, cooking dishes, hand-craft items and magic potions.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Chibig","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":10389,"name":"Gothic II: Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b7/5b7929040526f74f5e6073c06e7de902.jpg","description":"The second game from the series Gothic.\nIn the first game, people who inhabit a fantasy kingdom, lose the war to the orcs. To win, the king needs magical ore mined in local mines. The king decides to send to the mines everyone who is accused of any crime and create a magical Barrier around the mines so that no one can escape from the mines. However, Barrier surrounded a much larger area and the prisoners became masters inside the Barrier. Inside Barrier and beyond, there is a struggle for ore, power and the things necessary for life. In addition to the king, the magicians who built Barrier and various groups of convicts take part in the struggle. The hero of the first game is one of those who are sentenced to work in mines. He wants to become free, forced to carry out various assignments of the warring parties and seek a way out. He has to fight and solve other problems. The first game ends with the destruction of the Barrier. The second game begins two weeks after the end of the events of the first game. During the events, as it turned out, the hordes of magical creatures were awakened, this sets the plot of the second game.\nFights in the game are near and far. For each type of battle there is a weapon. Stock inventory allows you to store any number of everything. In addition to the \"ordinary\" weapons, magical spells operate. The game allows you to turn into different animals. Becoming an animal, you can act and even fight - there are battle regimes for such cases. The Gold edition includes Gothic II and the addition Night of the Raven.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Piranha Bytes","platforms":[{"id":0,"name":"PC"}]},{"id":58754,"name":"Tom Clancy’s The Division 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e5/0e5e869f2e8f496b3f09e00187ea94fc.jpg","description":"Tom Clancy's The Division 2 is the sequel to the 2016 Tom Clancy's The Division. The game is inspired by the Tom Clancy political thriller books.\r\n\r\n###Plot\r\nThe game is set in the ruins of Washington D.C. in the near future, some seven months after the events of the original game. The smallpox epidemic devastated much of the United States, leaving it with multiple contamination zones. A civil war breaks out among the factions of survivors as the gangs of raiders terrorize the capital. The main characters are the elite members of the Strategic Homeland Division. Their task is to bring law and order back to Washington.\r\n\r\n###Gameplay\r\nThe player controls his or her Division agent from the third person view. The game is set in an open world modeled after the real Washington D.C., including all of its famous landmarks. Tom Clancy's The Division 2 combines elements of tactical shooters and role-playing games. The agents have customizable abilities, weapons, and tools, and can level up. When they reach level 30, they receive a specialization: Survivalist, Demolitionist, or Sharpshooter. The game also unlocks new co-op missions.\r\n\r\n###Modes\r\nBesides the story campaign mode, the game has two multiplayer modes: player versus player and cooperative. Up to eight players can join forces on a raid.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Web"},{"id":0,"name":"Xbox One"}]},{"id":887,"name":"Call of Duty: Infinite Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f7/6f7341dd656910be2c2cda39193a7ec9.jpg","description":"Thirteenth in a row the main game of the series Call of Duty\n\nThe single player campaign of this game takes action far beyond our planet. Earthlings do not have enough resources, they go after them to other planets, organize colonies, but at some point the inhabitants of the colony on Mars begin to fight for independence from Earth.\n\n###New conditions and mechanics\nNew conditions bring new gameplay mechanics into the game, such as zero-gravity environments. Players have a boost pack, and a grappling hook, which allow players to move in these zero-gravity environments easily, they can visit different planets, satellites and asteroids in the solar system.\n\nBoth space combat and the \"boot-on-the-ground\" gameplay are available in the game as its key focuses.\n\nThe player controls Captain Nick Reyes, a Tier 1 Special Operations pilot, engaged in aerial combat with enemies using his transforming fighter, the Jackal.\n\nRetribution is a central hub of the game’s world. In Retribution, you can view your progression and start main campaign missions. There are also group of secondary quests called \"Ship Assaults\" which gives cosmetic and customization items, upgrades to the Jackal, and some new story details.\n\nHero also has a wrist computer, which allows him to hack into enemies' gadgets and machines.\n\n###Multiplayer\nThe «Combat Rigs» is a major overhaul to the class system introduced in Infinite Warfare. Like a Specialist system in Black Ops III, there are six rigs: Warfighter, Merc, FTL, Stryker, Phantom and Synaptic. With different payloads, weapons, abilities and playstyles for each class.\n\n###Zombies\nThe game has a completely separate part - the cooperative multiplayer Zombies mode, which has its own gameplay mechanics and story.\n\nIn this mode, the action takes place not in space, but on Earth. Or rather, in the special reality of the horror film, in which the characters of the game and the actors are captured - the stars of many famous films: David Hasselhoff, Kevin Smith, Pam Grier, and Cassandra Peterson who reprises her role as Elvira, Mistress of the Dark.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Infinity Ward","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":17998,"name":"Antichamber","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76f/76ff4289a2a3ad7659cae129b859d67e.jpg","description":"You control a nameless and faceless protagonist, who starts in a white chamber in the center of a high-tech maze. Your goal is to move forward through the maze by solving many difficult and intricate puzzles. Antichamber reminds Portal game series and Cube films to some extent, but with more emphasis on puzzle solving, sketchy graphics, and very little plot. Unlike in Portal or Cube, the protagonist cannot die, even if the player fails. There are no traps, and the only penalty for failure is that you have to try again. The protagonist is armed with a variety of “guns”, each of them allows you to manipulate a certain set of objects in the maze. \nAntichamber is defined by its impossible, non-euclidian geometry that bends 3D space in the ways not found in the real world. All the regular laws of physic do not apply in this place that seems to be straight out of M. C. Escher's drawings. Doors can become portals leading to an unpredictable place, or even different places, depending on how you enter them. The visual style of Antichamber is very minimalistic. Walls, doors, and ladders are only outlined with sketch-like black contours, while any color serves to attract the player's attention to a certain object. Everything else is blank white, which makes for a cold, neat atmosphere of a math exercise.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Alexander Bruce","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":2639,"name":"Day of the Tentacle Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/764/7648a8802fae5247298d775c85e9535f.jpg","description":"Day of the Tentacle Remastered - the classic two-dimensional quest, the continuation of the first game Maniac Mansion, where the  Purple  Tentacle burst out of the laboratory of the crazy Dr Fred Edison. It was initially released 25 years ago by Lucas Arts and Tim Shaffer. The player controls in-game characters by clicking on objects in the game world with the mouse. \n\nThe game begins three years after the first part, the Purple Tentacle drinks toxic water from the sewage. It becomes smarter and gains arms. Dr Edison again must save the world and stop the tentacle calamity.\n\nOne of the main mechanics of the game is time travel: at the very beginning of the game, the protagonists are separated because of a faulty time machine. Players solve riddles, search for necessary items and try to stop the Purple Tentacle - the result of an unsuccessful scientific experiment.\n\nThe remastered version includes visually reworked game locations, an original soundtrack and an indescribable atmosphere of craziness.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18449,"name":"Divinity II: Developer's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c88/c88c0929d09ec9270ca1207a0838c202.jpg","description":"Dragons: they have been hunted, they have been slain, but now the hour to strike back has come. Break free from the confines of the human body and take to the skies in this epic RPG adventure that challenges your wits and pits you against a thousand foes. Spread your wings, burn your enemies: become the dragon!\n\nThis Developer's Cut includes the ultimate edition of Divinity II, good for 100+ hours of highly acclaimed RPG gameplay, as well as the brand new Developer Mode and many more amazing extras!Key Features:Developer Mode: Play the original version, or experience the game like the designers did and fool around with console commands to your heart's content! Ever wanted to test some new skills on a hoard of a hundred goblins? Go for it! Ever wondered what it would be like to explore the game-world in the guise of a troll? Well there you go! Discover a whole range of spectacular developer commands and feel like a wizard at play!\n\nHatching the Dragon: Watch this unique, behind-the-scenes documentary that gives you insights into the creative process of Divinity II: its ups and downs, its triumphs and defeats.\nTreasure Vault: Rummage through a wealth of design documents, concept art and videos that give you an uncensored look at Divinity II not as a finished game, but as a work in progress. Experience firsthand just how a game is made!\n\nFight as both human and dragon: For the first time, an RPG unleashes the power of the Dragon on you! Climb high and vaporize all that stands in your way as you strategically use both your human & dragon forms to defeat the enemy and become the ultimate Dragon Knight!\nDynamically unfolding storyline depending on your choices and skills: Divinity II gives you a wide range of moral choices when deciding on how to act on quest objectives.\n\nUse your powerful Battle Tower as base of operations: Looming like a colossal stone claw over Sentinel Island stands the Battle Tower, a vast citadel built many centuries ago by a long forgotten Dragon Mage. Become bound to the Battle Tower through a mystical relic known as the Dragon Stone.\nBuild your very own ultimate fighting creature: Conjure the spirits to bring to life a creature made from body parts you have collected during your battles. This creature's power is literally the sum of his body parts; once you are able to assemble this abomination, summon it to support you in combat!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Larian Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":3726,"name":"Trials Fusion","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69b/69bb243ea9896ddfc2e051b58e81624d.jpg","description":"The ideological heir to the mobile hit mid-2000 Gravity Defied, Trials Fusion is an extra challenging platformer with trial bikes. The game is the sequel to Trials Evolution first in the series, released on the consoles from Sony.\n\nThe game is rendered fully in 3D but uses only a 2D perspective for player’s comfort. The player controls the biker, whose task is to pass the obstacle course by performing tricks. The game is well-known for its complexity, which only increases by the end of the game: the geometry of the tracks becoming more complicated. In the new part, the developers added a free mode in which the player can perform as many tricks as possible using the right analog stick of the controller.\n\nDespite the obvious focus on the gameplay, the game has a story. In 2042, an unidentified fell from the skies onto the world and new Anomaly AI system had been launched. These events changed the changed world forever and created perfect conditions for all crazy tracks the game includes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]}]