[{"id":14614,"name":"Learn Japanese To Survive! Hiragana Battle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/199/1992b64c877855e19e67dde0c1f8f55a.jpg","description":"Learn Japanese To Survive! Hiragana Battle is an educational game that is the ideal introductory course to the Japanese language!\nYou’re reading this page now because you have more than a passing interest in learning Japanese. Maybe you’ve tried learning it before, but never had any luck? That’s completely normal, so don’t worry! Learning a language can be daunting. And with a language like Japanese, full of strange and wonderful written characters, you might not even know where to start.\nYou need a learning tool that’s going to keep you interested, challenge you at the right pace, and most importantly, keep you coming back for more.\nThat’s why Learn Japanese To Survive! Hiragana Battle was made! This isn’t just educational software – this is a full-blown RPG specifically designed to keep you engaged. By playing along, you’re going to be introduced to the Japanese language like never before.\nLearn how to read and write Japanese characters (Hiragana) at a steady pace. There’s a new set of characters to learn each chapter, and your revision takes place on the battlefield! If your knowledge is up to scratch, you’ll claim victory in exciting strategic battles. If you’re falling behind, you have the opportunity to revisit specific chapters and brush up on your knowledge.\nAs a bonus, you’ll also learn common Japanese words and phrases and important grammar points!\nWhat is Hiragana?\nHiragana is the basic writing system used in Japanese. Japanese actually combines 3 different sets of characters to form written works – Hiragana, Katakana and Kanji. This game focuses solely on Hiragana, the foundation. By learning Hiragana, you can write and pronounce nearly any Japanese word.\nFeatures:\nAn exciting story based on the concept of learning Japanese. As the characters in the story learn Hiragana, you learn along with them!\nLearn every single Hiragana character, with detailed instructions on how to read and write each character.\nVisual animations displaying how to write each character.\nAudio speech examples demonstrate how to pronounce each character.\nExciting gameplay with familiar RPG elements – collect items, complete quests, engage in battles!\nEarn experience points and level up your characters.\nRevise completed lessons to brush up on your knowledge.\nIn-game quizzes to test what you’re learning.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sleepy Duck","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":949868,"name":"The Murder of Sonic the Hedgehog","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e11/e118b6b051c0bab9b70ce0402719bbd6.jpg","description":"It's Amy Rose's birthday, and she's hosting a murder mystery party on the Mirage Express! When Sonic the Hedgehog becomes the game's victim, everyone is off to get to the bottom of things. However, something feels a bit off - is this really an innocent game or is something more sinister afoot?","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"SEGA","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":369160,"name":"Boreal Blade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5d/d5d3d40f3c4876aa6158c28678e51f6c.jpg","description":"Boreal Blade is a team-based melee fighting game with a focus on player vs player combat, combining reactionary and tactical gameplay with extraordinary freedom to variate your attacks and develop your unique fighting style.\n\nThe game features four distinctive fighting styles with the possibility to choose between one-handed and two-handed weapons, a shield and a weapon combo, long thrusting pole weapons and fighting unarmed. Players can even throw items during battle! Three armour classes with their strengths and weaknesses are also included to guarantee a varied, ever-alterable fighting experience. Arm yourself and prepare to dive into the battle!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Frozenbyte","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":314402,"name":"missed messages.","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/826/8263a1d6dbb8fde57d329a0933159cba.jpg","description":"\"goth gf's iPhone\" airdrops you a photo.\r\nAccept or decline?\r\nA romance / horror story about life, death, and memes.\r\nA shift in perspective can change everything.\r\nWarning: contains mentions of suicide and self-harm.\r\n4 endings\r\n15-30 minutes each play-through\r\nOriginal art and story\r\nWholesome memes\r\nAvailable for Mac, Windows, Linux･ ｡･｡･ ｡　*\r\nHope you enjoy :)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Angela He","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":27022,"name":"Super Metroid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc9/fc9bb16db9714d3731823fb0bf706533.jpg","description":"After having defeated Mother Brain, the leader of the Space Pirates who wanted to use alien creatures known as Metroids to dominate the world, the bounty hunter Samus Aran took the fight to the Metroids' homeland and eradicated them. Only a single Metroid larva remained. Samus took it to a galactic research station, and scientists assured her that the powers of the larva can be harnessed to help people. However, everything goes wrong when a dragon kills the scientists, takes away the larva, and destroys the research facility. Samus follows the dragon to the planet of Zebes, where she fought Mother Brain before. She must explore the dangerous planet, stay alive, and figure out a way to retrieve the larva.\n\nSuper Metroid is a platform game and a follow-up to Metroid II. Like the previous games in the series, it is not divided into separate levels; the planet Zebes is an open world which Samus traverses back and forth. This world is divided into rooms separated with doors which must be shot to be opened. Shooting is also used to open up secret passages, some of which contain nifty bonuses, but finding most of them is required to proceed in the game.\n\nThere are many items to find on the way, and each new item usually makes heretofore inaccessible areas available to Samus. The items include both weaponry (such as missiles, super missiles, or upgrades to Samus's standard laser gun), energy tanks that increase Samus' max health, and other gadgets (like a grappling hook that allows Samus to stick to the ceiling).\n\nThere are various enemies - alien fauna - lurking around planet Zebes. The enemies all respawn after re-entering a room, though Samus' increasing capabilities mean that they become easier to defeat as the player makes progress. After killing them, the enemies typically leave behind some health or ammo.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"SNES"}]},{"id":20837,"name":"Sparkle 3 Genesis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18b/18b81812829bc49465e4a6d97af596c6_RdH7DXE.jpg","description":"Special OfferBuy Sparkle 3 Genesis on Steam and get the fantastic Soundtrack from the game for free. A set of cool chillout tunes will accompany you wherever you want!\nAbout the GameTake the evolution into your own hands.\nStep into the amazing world of Sparkle – a surreal ocean, where life is thriving and conditions are perfect to make an evolutionary leap.\nA beautiful visual experience. Control the fate of a single dreamlike organism through the course of it’s life. Explore the vast ocean in search of micro-elements that will help you evolve from a tiny speck of life into a magnificent Sparkle. You can choose whether your Sparkle will become a quick and relentless hunter, a peaceful plant-eater or a creature whose feature lie in between.\nEvery element you eat matters. Every element will influence how your sparkle grows, what his skills will look like, what his strengths and weaknesses will be. Spend the micro-elements in the genetic store to improve your Sparkle the way you want. Partake in quests essential to your Sparkle growth. Evolve special skills that will help you in your journey. Become the master of the evolution.\n- Virtually unlimited number of gene manipulation to perform\n- 12 dreamlike levels to explore\n- multiple quests to complete\n- special class powers to unlock\n- fights with epic bosses\n- mesmerizing ambient soundtrack","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":15969,"name":"Ys I & II Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/207/20734e3a3ee4fe81259793fc04198171.jpg","description":"Long, long ago, there was an ancient kingdom called Ys which prospered under the auspices of two heavenly Goddesses. Over time, the kingdom came to be known as Esteria, and its divine history was largely forgotten by all but the descendants of those who once preached the Goddesses' will. The only reminder of this lost lore was a cursed spire at the foot of a giant crater, which locals came to regard as \"The Devil's Tower.\"","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo DS"}]},{"id":10412,"name":"Tabletopia","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d62/d628164463ac6fc7ab28b5a988191582.jpg","description":"What is Tabletopia?Tabletopia is the only free-to-play sandbox virtual table with 100% licensed board games made by professionals. Already 450+ games and counting!\nPlay how you want with whom you want: your guests don’t need accounts to play. Enjoy the amazing graphics, realistic physiscs, and digital perks like ready setups, customizable cameras, and intuitive controls. Make your own games with no programming skills required.What does Tabletopia offer?Advanced digital arena for playing board games in an experience almost like gathering around a real table.\nHundreds of licensed board games, including both designer classics, recent hits, and tomorrow's Kickstarter releases.\nTrue cross-platform experience: available now on PC, Mac OS X, coming soon to iOS and Android devices.\nAutomated game setups, shuffling and dealing of cards, tracking player turns, and many other automated features.\nPublic and private game tables, matchmaking system, etc.\nAbility to create your own games with no programming knowledge required (browser version).\nSpecialized tools for designing, playtesting, demonstrating, and monetizing your board games (browser version).How do I play games on Tabletopia?Tabletopia is a sandbox system. That means no AI to enforce the rules, so you still need to read the rulebook to know how to play the game.\nChoose a game from our extensive library, create a table, send the link or room number to your friends or other Tabletopians, and let the game begin. Or go to Find & Play section and join an already created table. It’s that simple!How much does it cost?Tabletopia is free-to-play on Steam. No subscriptions or recurring payments are required to play.\nWith free Tabletopia you can:\nAccess 450+ games for free (some setups and expansions may require Premium).\nInvite your friends outside Tabletopia to play free games.\nPlay up to 2 games simultaneously.\nPremiums are available as in-app purchases for 3, 7, and 30 days in the Tabletopia client. Once your Premium expires, you are switched back to the free plan with access to all basic games and features.\nWith Premium Tabletopia you can:\nAccess all games, expansions, and setups.\nInvite your friends outside Tabletopia to play any games, including premium games.\nPlay up to 10 games simultaneously.Why Tabletopia and not other similar platforms?Officially licensed games. All the games in our catalog are fully licensed and created in partnership with their designers and/or publishers. By playing our Premium games you directly support their authors.\nFree-to-play, free-to-share. Tabletopia for Steam is free-to-play with hundreds of board games available at no additional cost. All games can be shared and played with people who don't have accounts. It's free.\nFriendly interface. Tabletopia is developed by professionals with maximum usability in mind. Its friendly interface, intuitive controls, built-in tutorials will make your gaming experience smooth and easy.\nAmazing visuals. Tabletopia boasts outstanding 3D graphics and top-notch quality of all game components and visuals. It also features a flexible camera with refined controls and custom settings.\nDigital advantages. Being a sandbox system, Tabletopia still provides numerous advantages of a digital product, such as ready game setups, shuffling and dealing of cards, tracking player turns, etc. Game objects can be rotated, flipped, locked in place, magnetically placed, and decks of cards can be shuffled and dealt from at the click of a button.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tabletopia","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1189,"name":"Dead Synchronicity: Tomorrow Comes Today","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a58/a581d36545d6da2217cb7068801ca651.jpg","description":"Dead Synchronicity stands as a modern adventure classic, telling a dark, sad and brutal tale that will leave you wanting more, but equally satisfied.\n80% - Adventure Gamers\nDarkness.\nAnd then there was light… but not enough for Michael to find out who he is and what happened to the world out there. The “Great Wave”, the “dissolved”... are just hollow words in his looted mind.\n\"Dead Synchronicity: Tomorrow Comes Today\" is the first part of the \"Dead Synchronicity\" series:\nHelp Michael face a dying reality, a universe that’s fading away. Face a merciless world that gets sick and vanishes. Face no past, no present, no future. Face the impending moment of “dead synchronicity”.\nAnd you’d better hurry. Because, otherwise... what will you do when Time dissolves itself?\nA terrible pandemic is turning all of humanity into “the dissolved” - the sick whose deliria provide them with supernatural cognitive powers... but also steer them towards a gruesome death.\nThe root of this illness seems to be “the Great Wave”, an inexplicable chain of natural disasters that destroyed all energy sources and communications and plunged the world into a chaos ruthlessly controlled by both the authorities and the army alike.\nMichael, a man with no past, will have to recover his identity and decode the events that brought the world to the edge of collapse. Because, if he doesn’t hurry, he won’t be able to avoid the impending moment of “dead synchronicity”, when Time itself dissolves…\nDead Synchronicity: Tomorrow Comes Today is a point and click adventure that features a stunning dystopian plot, a distinctive, expressionist 2D art style, and an atmospheric soundtrack.\nThe game pays homage to classic adventures (The Secret of Monkey Island, Broken Sword, Day of the Tentacle...) but revolves around a more mature theme, along the lines of games such as I Have no Mouth and I Must Scream or Sanitarium.KEY FEATURES\nClassic adventure gameplay combined with mature theme\n2D graphics featuring a unique, expressionist style\nSpace-time distortions, a dystopian atmosphere... and a dark, bloodstained plot\nFeaturing soundtrack from indie rock band Kovalski (available as DLC)\n\"Guybrush meets Mad Max meets 12 Monkeys\"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Badland Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19567,"name":"Resident Evil: Operation Raccoon City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2da/2da15efa5704b4674f856f9d53607d9f.jpg","description":"It‘s September 1998 and Raccoon City is being consumed by Umbrella’s deadly T-virus outbreak. With a cover up required, Umbrella orders an elite squad into Raccoon City to destroy all evidence of the outbreak and eliminate any survivors. Meanwhile, the US Government has quarantined the city and dispatched its own team of elite Spec-Ops soldiers to track down the source of the mysterious outbreak.\nGear up as a member of the Umbrella Security Service and battle against all of the forces at play in Raccoon City. You’ll come face-to-face with horrifying Resident Evil enemies like hunters and lickers as you navigate the Raccoon City Streets in search of your targets which include series icons like Claire Redfield and Leon S. Kennedy.\nOne thing is for sure, in Raccoon City, all roads lead to hell.Key Features:Experience the Fear: Set in the terrifying world of Resident Evil\nThree Corner Conflict: Zombies and Bio-Organic Weapons (B.O.Ws) create an unpredictable third force that leaves the battlefield in chaos\nCampaign Mode: Both single player and up to 4 player co-op: You are part of the Umbrella Security Service. Protect the truth behind Raccoon City’s downfall by any means necessary\nCompetitive Multiplayer: Bring the fight online in 4v4 competitive multiplayer modes such as Team Attack, Biohazard, Survivors, and Heroes Mode\nDefine your Play Style: Gain new abilities and skills unique to your playable character as your experience level increases\nInternational Team Development: a fully loaded, third person co-op / multiplayer shooter developed in collaboration between Capcom Japan development studios and an experienced Western multiplayer specialist studio","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":17735,"name":"RollerCoaster Tycoon 3: Platinum","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98e/98eb9408aad5c0604f80af90a9cef583_Twsspgi.jpg","description":"Rollercoaster Tycoon 3 Platinum combines the excitement of rollercoasters with the fun of great strategy sim. RCT3 Platinum combines the roller coaster theme park fun of the Roller Coaster Tycoon 3 with included expansion packs Soaked! and Wild! Now enjoy more options than ever. Build your own water slide or create your own safari with real animals. Watch guest reactions to your ultimate theme park!\nGrab a front seat for the ride of your life with the jaw-dropping Coaster Cam.\nSee every detail in stunning 3D with fully controllable park cameras.\nCope with changing weather patterns and enjoy beautiful vistas, sunsets, moonlight, and more.\nExperience the latest extreme coasters and heart-pumping rides! Live Every spine tingling detail in stunning 3-D with fully controllable cameras.\nSpice up any backgrounds, rides, fireworks display and laser light shows with your own music.\nCreate your own park guests and groups with the Peep Designer and experience their reactions to the rides you build! Soak them and watch their reactions! Send them on wild safari and let them pet the animals!\nCreate savage encounters and thrilling safaris! Conquer 12 Wild! Scenarios and experience cool jungle and prehistoric design themes.\nPlay through dozens of scenarios in three difficulty modes or build without limits in Sandbox mode.\nCreate pyrotechnic wonders and laser light shows with the RollerCoaster Tycoon® 3 MixMaster.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11807,"name":"Super Daryl Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/648/648b4d790f8a7531f07fe0f37995d1e5.jpg","description":"Super Daryl Deluxe is a 2D comedy action-RPG that follows an orange headband- and bellbottom- wearing adolescent who is forced to spend the height of his awkward teenage years in a new school that has, unfortunately, been taken over by evil self-help authors. His name is Daryl, and he just wants to make friends.\nWhat starts out as an innocent effort to help jump-start a young contraband textbook business turns into a dangerous quest through the underbelly of the school (and all of the classroom-based dimensions therein) in the hopes of stopping the Honors Students from brainwashing everyone and offering the world up to the evil authors behind it all.Key Features:\nPlay as a sweaty, noodley silent protagonist that's bringing headbands and bell-bottoms back in style.\nDecimate enemies and bosses alike with a customizable combat system and over 40 unique skills available to unlock, purchase, and upgrade. Skills that span across multiple playstyles and transform both visually and mechanically as they rank up.\nLevel up and utilize fancy equipment to get the most out of your high school experience! With so many hats, outfits, weapons, and accessories to find and equip you'll always be ready for the next test!\nChapter based story with a focus on humor and minimal plot holes.\nGet into all sorts of quirky scenarios that will remind you of your own high school experience! Help Death kick his gambling addiction! Become product manager of a contraband textbook business! Beat up the Honors Students!\nMeet hundreds of unique characters and explore a semi-open world composed of beautiful, strange areas. Each classroom in the school is an alternate dimension based on the classroom's subject.\nLoads of quests and tasks to do for complete strangers in return for their valuables and lunch money.\nDiscover so many hidden areas, secrets, and rare items that you might never get around to completing the story we wrote for you!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Dan","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":5424,"name":"flOw","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50c/50ca35b80bd7a35a1a7d9fecdbcd6517_kJS1cIB.jpg","description":"Now for the PSP® (PlayStation®Portable) system, flOw is a game about piloting an aquatic organism through a surreal biosphere where players consume other organisms, evolve, and dive into the abyss.\nWith an embedded design of DDA (dynamic difficulty adjustment), players with differing skill levels can intuitively customize their game experience and enjoy the game at their own pace.\nYou can play as one of 5 creatures, each in a unique environment.  Use the analog stick for an organic experience that will allow you to glide, flit, and flOw through the universe.\nKey Features\n•\tVibrant environments immerse you in the flOw universe.\n•\tDynamically Adjusting Experience – Customize your game experience.\n•\tMultiplayer mode – Ad-hoc mode is supported on the PSP® system\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\nflOw ©2007 Sony Computer Entertainment America Inc. Developed by thatgamecompany.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":845261,"name":"Assassin's Creed Mirage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fbd/fbd0128013b7965904be571e75fb30c0.jpg","description":"Experience the story of Basim, a cunning street thief seeking answers and justice as he navigates the bustling streets of ninth–century Baghdad.\r\n\r\nIn Assassin's Creed Mirage, you are Basim, a cunning street thief with nightmarish visions seeking answers and justice. Join an ancient organization and come to understand a new creed – one that will change Basim’s fate in ways he never could have imagined.\r\n\r\nParkour seamlessly through the city and leverage the largest assortment of tools to date, and stealthily take down targets with more visceral assassinations than ever before.\r\n\r\nDiscover a narrative-driven action-adventure experience that follows the transformation of a defiant young man into a refined Master Assassin with a conflicted destiny.\r\n\r\nJourney to Alamut, the legendary home of the Assassins who laid the foundations of the Creed in this heartfelt homage to the game that started it all.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":61046,"name":"Dead Frontier 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8d/b8d2839d94d907119d9d41e021348d44.jpg","description":"KEY FEATURES Old school survival horror awaits in this dark and atmospheric world. Conserve your ammo and make every shot count.\nScavenge for scarce resources and rare equipment in the twisting corridors of expansive and ever changing abandoned buildings\nCome to the aid of the desperate survivors you encounter along the way, or leave them to their misery\nTrade for what you need in a realistic player-driven economy\nCreate your own unique character build by selecting from a huge variety of skills, rare equipment and cosmetic items\nWork together with other players or operate as a lone wolf\nTake to the streets and settle scores in gripping PvP\nEthical free-to-play. Spending real money will never give you a gameplay advantage. Only cosmetic items and utility upgrades are available from our shop.\nAdd Dead Frontier 2 to your wishlist to be notified when it launches!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Creaky Corpse","platforms":[{"id":0,"name":"PC"}]},{"id":55348,"name":"Batman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3eb/3eb40bdb4464529e4ce4a569bf48a4a8.jpg","description":"Batman is an isometric action game developed by Ocean Software. It is the first licensed Batman game in the history of the franchise. The game features an 8-bit monochrome style. It was the first game ever to use a checkpoint system. In order to save, Batman has to have a Bat-Signal on him. Loading the game uses one of Batman's 8 lives.\n\nThe objective of the game is to save Robin who was kidnapped by the Joker and the Riddler as he was repairing the Batmobile. However, before rescuing Robin, Batman has to find seven parts of his hovercraft that are scattered around the Batcave. At the beginning of the game, Batman has no equipment whatsoever and the players have to find it while traveling through the game's 150 isometric screens.\n\nThere are plenty of items in the game, such as the Bat-bag that is used for picking up objects, the Bat-boots used for jumping. The players can use certain powers in the game. For example, become invincible for a short amount of time or traverse at higher speeds.","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Ocean Software","platforms":[{"id":0,"name":"Commodore / Amiga"}]},{"id":17912,"name":"Bloodline Champions","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c0/7c024af6de26f3833760d6d2331d5ccd.jpg","description":"Engage in the most intense and fast paced player vs player action as you take control over one of several different bloodlines, each with their own unique weapons and abilities.\nFree to play and critically acclaimed, Bloodline Champions is a next generation online multiplayer arena game where skill and team play is the most important factor to win. Every ability requires aiming and can be avoided by enemy players. Join the fight today and experience the unique combination of a top down shooter and a fast paced fighting game together with a healthy amount of RPG elements.Key features: Experience intense, adrenaline-fueled multiplayer battles with thousands of other players.\nChoose your character from more than twenty bloodlines, each with their own abilities and specialties. From the fire-wielding Igniter to the elusive Ranid Assassin, each offers a unique experience!\nEarn experience and rise in level to unlock upgrades that will let you customize your bloodline according to your play style!\nDirect controls, cursor-based aiming, focused characters and an easy-to-learn interface allow you to enjoy Bloodline Champions just minutes into your first battle!\nThanks to a robust matchmaking system you will be off onto the fields of battle immediately after joining. Play up to five versus five battles, either with strangers automatically matched to your level or with a team of your best friends!\nShort and intense battles, focus on player skill, and an elaborate stat-tracking system makes Bloodline Champions perfect for competitive gaming.\nVibrant graphics, a unique art style and a superb sound design brings the world of Bloodline Champions to life as you keep yourself busy with dealing out death and destruction.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Stunlock Studios","platforms":[{"id":0,"name":"PC"}]},{"id":268372,"name":"Size Matters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/066/0669755f19a0ad7521643c78bb361197.jpg","description":"Discord\nAbout the GameAboutYou play as a scientist who is shrinking every second - it's a race against time! Find all the ingredients and formulas scattered around the laboratory - which are necessary for producing the life-saving antidote. Save yourself from shrinking to death!\nOperate equipment such as: Chemical Processor, The Reverter, Code Combiner, Antidote Producer and more!\nBut beware, your time is very precious - you need to process ingredients using lab equipment all while searching for missing components or rearranging the lab so you're able to reach stuff when you're smaller!GameplaySearch the laboratory for ingredients and formulas which aid you to produce the three key components of the antidote!\nEvery formula is tied to one of the machines in the lab. You can produce new ingredients, which may be used in other formulas or are one of the three key ingredients you need for the antidote\nOnce you collect three key ingredients, place them inside the antidote processor to produce an antidote!\nWhen you shrink too small the game is over!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Mazen Games","platforms":[{"id":0,"name":"PC"}]},{"id":41462,"name":"FIFA 13","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a0/3a0eb6aa1a04f80492efcd7dea8ad428.jpg","description":"Since the 1990 FIFA series has been expanding with each passing year. But the 2012 year was different for the format, because this year when FIFA 13 was released, it was still the time of motion controls. The game supports Kinect, PlayStation Move and version for Wii U includes the touch-based shots, where players can direct the ball precisely while managing and playing the match in real-time. \nFIFA 13 follows the game modes and features of the previous iteration but adding more current content for the time. For example, adding the Saudi Professional League, bringing back five international teams, yet removing Croatia, due to the licensing disagreement. Newly added game mode FIFA Ultimate team, which gives players the ability to make their own team with real-world players. All professional players are purchased as cards, randomly obtained through card packs. Said cards are divided into three tiers: bronze, silver, and gold, representing their quality.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":20879,"name":"Rush Bros.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0a/c0a82563bdef5b57fc44a694ba392e02.jpg","description":"Steam Greenlight\nThis game was picked with help from the Steam Community. To vote for other games you’d like to\nsee made available on Steam, please visit Steam Greenlight.\n\"GOOD WILL\" UPDATE 1.06 IS LIVE!\nAbout the GameRush Bros. “Discover gameplay with custom music”\nRush Bros is a music reactive Platform Racing Game that features a single player and a competitive multiplayer either split-screen local or online between two simultaneous racers. rush through over 45 unique levels jam-packed with puzzles, obstacles and power-ups in a race to the finish line where the victor can literally crush his competition.Key Features: 45+ music-infused, platform racing tracks jam-packed with puzzles, obstacles and power-ups\nFeatures musical tracks by Xilent, Dead Day Revolution, Black Parrot, Animal Music, winners of the Beat Battle and more!\nSpecial themed stages including ReverbNation, Infected Mushroom, Dead Day Revolution, Xilent, Side FX, and the list keeps growing\nReactive level design where the music you play directly affects the movement of traps, obstacles and backgrounds\nSingle Player Mode allows players to learn the levels and race against their own Ghost Data\nTwo Player Local Split-Screen Action\nOnline Multiplayer that supports Cross-Platform competition between PC and Mac gamers\nRock out to your own MP3 or OGG music library\nRemix your gameplay by turning on \"Fast Forward\" to speed everything up, \"Survival Mode\" where it is one hit and game over or the new \"Zombie Repellant\" which turning off will add the new zombeats to each level\nPlay as the Rush Sisters!Two Djs Enter, One Dj Leaves!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"XYLA Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":455566,"name":"Morbid: The Seven Acolytes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa6/aa6aa25c310f1d5ed97964ec39868254.jpg","description":"You are the last surviving Striver of Dibrom. Your duty, for which you have trained your whole life for, is to defeat the Seven Acolytes, accursed and powerful beings, possessed by malevolent deities called Gahars.\n\nExperience epic bosses and a multitude of bloodthirsty encounters as you build your character.\nChallenging foes, mini-bosses, and memorable large-scale boss fights with fully orchestrated music, are central to the world of Morbid. To overcome these obstacles you must master the combat, as well as improve your character and gear through a wealth of elements such as Quests, Perks, Runes, Upgrades, and Looting.\n\nExplore the diverse fantasy world of Mornia abundant with deep and immersive lore.\nThe Gahars have bound their twisted minds to the flesh of the Seven Acolytes, for without hosts they cannot survive. You must slay the Acolytes, thus ridding the Gahars of their flesh. Succeed, and you'll free the kingdom from the heavy yoke of their terror. Fail, and the malicious gods rule on, as the Acolytes rise anew, and madness prevails.\n\nFeatures Overview\n-Experience epic, brutal boss encounters and explore a diverse array of environments\n-Perk levelling system with multiple ways to build your character\n-Deep, immersive lore with NPC's to meet throughout the world\n-Over 25 Unique Melee Weapons, such as Swords, Axes, Maces, Spears, Two-Handers, as well several guns ranging from Pistols, Shotguns and Rifles\n-Epic fully orchestrated soundtrack comprising of 18 tracks\n-Health, Stamina and Sanity management is important as you traverse the world","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Still Running","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":19004,"name":"Sometimes: Success Requires Sacrifice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/437/4370de2bc95349080c30e9b468f9208e.jpg","description":"Sometimes: Success Requires Sacrifice, the title says it all! You get thrown into a dark room, with no light to be found anywhere! Are you willing to end your life to light the way for the next generation to proceed further? Play it today and find out!\nSometimes features a classic mode, as well as several minigames to keep you entertained! Several in-game achievements and a statistics tracker will accompany you throughout your journey so that you can see how sacrificial you have been.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NodziGames","platforms":[{"id":0,"name":"PC"}]},{"id":12629,"name":"Hide and Shriek","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d1/0d1f5f49262446085d4cd5abb529e00b.jpg","description":"It`s Halloween and the students of magic at Little Springs High and Innsmouth Academy are about to honor an ancient tradition: sneaking into school after midnight, turning themselves invisible, and scaring the living hell out of each other!\nHide and Shriek™ is a one vs. one multiplayer romp played out in ten minute matches. Your objective is simple: be a mischievous little rascal and scare your opponent half to death before time runs out! If there is no clear winner when the timer stops, the player with the most points wins the game. Points can be acquired by scaring your opponent, luring them into traps, or performing an ancient ritual.\nThere is just one catch: you are both invisible!\nYou will need to use cunning traps and potent spells to reveal your opponent. Once you spot them, sneak up on them and give them a good scare! Just remember they are looking for you too, and if you`re not careful you might be the one jumping in your seat!\nPlay with friends or strangers in ten-minute one vs. one multiplayer matches!\nYou are both invisible! You will need all your cunning to spot your opponent: look for doors opening, objects flying in midair, or traps being sprung!\nOver thirty different spells to discover, each with their own impish effect: blind your opponent, booby-trap doors, unleash a demon upon them, and much more!\nShriek at your opponent to scare them! Use scary masks of famous characters like Donald Trump and Hillary Clinton, or use skulls and zombie heads that can be modified with accessories like gooey eyeballs, bloody hatchets, and much more!\nDominate the leaderboards or get scared trying!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Funcom","platforms":[{"id":0,"name":"PC"}]},{"id":2145,"name":"Marvel: Ultimate Alliance 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/07e/07eb7a6f6d0ddd87d981c0c68bff32f8.jpg","description":"The Marvel Universe is being torn apart. The Superhuman Registration Act becomes law and Super Heroes must register as weapons of mass destruction, becoming licensed government agents. As Civil War is stirred, Iron Man leads the Pro-Registration side while Captain America spearheads the stand on Anti-Registration. The enemies you battle and the missions you accomplish depend on which side you choose.Create and customize your ultimate team\nAssemble your dream team from the Marvel Universe and select from over 24 playable characters, each with specialized powers.Cooperate with your ultimate alliance\nTake full advantage of the Marvel Universe by playing Cooperative Mode with up to four friends, both online and offline.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox One"}]},{"id":313739,"name":"Tabletop Playground","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5a/c5ae5b4ca2ecff960204917c709ece55.jpg","description":"Ever had the urge to play a board game but none of your friends were around? Had this great idea for a game you want to create? Looking for people to try your game? Or do you just want to throw stuff around? Tabletop Playground got you covered!\nTake a seat at a virtual gaming table like you would in your own living room and invite all your friends. Create all kinds of things and enjoy watching them roll, bounce and slide over the table. You make your own rules! But it's not just a physics simulation: Tabletop Playground has additional features for objects like dice or cards. For example, you can stack, shuffle or deal cards, and put keep your cards hidden from other players.\nYou can start playing right away with the included classic board games, or head to the Steam Workshop to find games created by the community. If you don't find what you're looking for, use the in-game Editor and create it yourself! You can make your own game boards, pieces, dice, card decks, tables, and more!FeaturesMultiplayer physics simulation for up to 8 players simultaneously\nInteract with objects like on a real gaming table: pick them up, rotate, knock, drop or throw them\nSupport for interactions that aren’t possible in reality: copy and paste, modify object’s colors, dimensions, friction, and much more!\nMeasure distances and angles, or create formations for wargaming\nSave and load the game state at any time\nMany different backgrounds, both panoramas and full fledged 3D environments\nBeatiful graphics using Unreal Engine 4\nOculus Rift and HTC Vive support, playable with and without motion controllers\nIncludes classic games like Chess, Go, Backgammon, Checkers, and standard cards used for games like Poker, Rummy, or Black Jack,\nEasily create your own games using the in-game Editor using custom images and 3D models\nFind more games created by the community on the Steam Workshop","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Plasticity Studios","platforms":[{"id":0,"name":"PC"}]},{"id":47525,"name":"Disneyland Adventures","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9c/f9c8171193011119bc83c7ea13a23442.jpg","description":"Experience the magic of Disneyland like never before! Take a journey where stories come to life and dreams come true, right in your living room! Explore Disneyland® park — from Main Street U.S.A. to Critter Country — join Peter Pan to battle Captain Hook, high-five Mickey Mouse or hug Snow White.\nDisneyland Adventures allows children, families and Disney fans of all ages to explore Disneyland park, step into adventures based on attractions, engage in challenging quests, and interact with beloved Disney characters.\nFeatures:\n•\tCreate Memories - Whether it's your first time or hundredth time exploring Disneyland, relive your fondest memories or embark on new adventures\n•\tDiscover Disneyland park - Whether you want to go on an adventure in your favorite attraction or explore the entire park\n•\tEnjoy 18 iconic attractions - Fly with Peter Pan and defeat Captain Hook in Peter Pan's Flight and ski the exhilarating slopes of the Matterhorn\n•\tMeet the Characters - Share magical moments with your favorite Disney characters - hug your favorite princess, collect autographs and accept quests\n•\tCollect and Unlock - Collect Disney-themed items and rewards as you make your way through the Park to discover locations and game experiences","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":20084,"name":"Romance of the Three Kingdoms Maker / 三国志ツクール","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bf/4bfb7439560f10522bfa3186944b5b00.jpg","description":"■ Characteristics of \"Romance of the Three Kingdoms Maker\"\n(1) Based on the classic \"Romance of the Three Kingdoms II,\" but with totally new graphics!\nThe historical simulation game system is based on the classic title \"Romance of the Three Kingdoms II,\" but the user interface has been given a complete visual overhaul. While enjoying these great new visuals you can also enjoy the same simple and fast-paced game play.\n(2) So many options for editing! Create your own unique scenario!　(* the function available only for the full-edition owners)\nA wide range of editing options are available, including officers' names, faces and parameters, countries, forces, rewards, battlefields and titles. Freely editing them all will even allow you to create a totally new world, far removed from the \"Romance of the Three Kingdoms\"! There are also a replete selection of support functions, such as auto creation of officer parameters or back story based on selected images.\nAs well as thousands of available images for officer faces, including those taken from the history of the \"Romance of the Three Kingdoms\" series, a function is also provided to easily add your own images to the game.\n(3) If you just want to play rather than create, try the \"Free Play Edition\" for free! Packed with features for players to communicate with each other!\nEdited original scenarios can be freely passed between players, and you can load and play any scenario created by another player. The \"Free Play Edition\" scheduled to be distributed for free alongside the full title can also load and play any scenario data.\nThe \"Twitter Post Function\" also allows any game screen to be easily captured, commented on and tweeted, promoting further communication and exchange between players.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"}]},{"id":914,"name":"Wonder Boy: The Dragon's Trap","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c57/c57924c382278ee6c31a82c2e95fba0b.jpg","description":"Boasting beautiful, hand-drawn animations and a re-orchestrated soundtrack, the cult classic returns with a unique blend of exploration, action, and adventure!\nCursed into a half-human, half-lizard monstrosity by the Meka-Dragon, you are in search for a cure! The only way you can return to human form is to find the Salamander Cross, a magical item with the power to remove curses...\nWith each dragon slain, the curse intensifies, transforming you into different animals! Explore large, interconnected locations populated with grumpy monsters and exotic dragons!\nPlay as the game’s classic character, Hu-Man, or as his brand-new, long-awaited co-star Hu-Girl. You can also inhabit Lizard-Man, Mouse-Man, Piranha-Man, Lion-Man, and Hawk-Man, and use their unique abilities to uncover the land’s deepest secrets.\nEnjoy 3 difficulty levels catering to players of all types, and switch from modern graphics and sound to 8-bit graphics/audio at any time - even during gameplay!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"DotEmu","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":638650,"name":"Ghost of Tsushima Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/193/193c9fe23ca026914fdf41d551ff3df9.jpg","description":"Explore the brand new Iki Island, plus PS5-specific enhancements like DualSense haptic feedback, Japanese lip sync, and more.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":44431,"name":"OLDTV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/826/8260f4b4707141db95cecfe36ab5b815.jpg","description":"Not recommended to individuals prone to epilepsy or have colorblindness\nYou are a gifted child\nYou will switch through every channel on the planet\nFeatures\n- Simple Gameplay\n- Unusual Achievements (fail tutorial, play in monochrome mode, etc)\n- An immersive Soundtrack, favored by beta testers\n- Multiple Modes and Secrets\n- Localized in 10 different languages\n(English, Chinese (Traditional and Simplified), Russian, Ukrainian, Polish,\nJapanese, German, Norwegian, Spanish, Brazilian Portuguese, and French)\nOLDTV is a small game inspired by a little nostalgia & the Stroop test","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Creability","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":40774,"name":"Elsword","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/069/069a8d658b2c06bd29c2a571a1b269d7.jpg","description":"Mystery Attendance Event\nDaily Rewards, Accumulative Rewards, and even Special Saturday Rewards are all for the taking, you just need to login into the game.\nDuration: 01/10/2018 - 01/30/2018 (Ends 23:59 PST)\nFor all the details, visit our website here.\n3rd Jobs - 1st Path RELEASE\nThe highly anticipated 3rd Job First Path Update is here! This is the first of 3 updates that will feature 37 new Job classes in total; each update will usher in a new Job for every character for each Line.\nIn addition, the following features are debuting today:\nOne new dungeon: Forgotten Elrian Sanctum\nFirst and second Job Advance items are free\nVisual Update – Every Character (except Rose and Ain) have had their feet and hands resized for aesthetic improvement\nIn-game Prizes, Playtime Sweepstakes, Snowball Games, 2X’s EXP in PvP Arena and More!\nTo learn more about Elsword please visit www.elsword.com and keep watching the official Facebook page here.\nPlay Your Manga!\nAbout the GameElsword is a free-to-play, online action RPG that uses classic side-scrolling beat ‘em up gameplay mechanics and deep customization to bring a unique manga experience to life.\nIn Elsword, you star in your own comic book while experiencing all the excitement of a massively multiplayer online game. Get ready for fast-paced gameplay, stunning animation, and epic bosses. Whether conquering hordes of enemies in dungeon runs or showing off your skills in the PvP arena, Elsword is the most intense free-to-play action RPG to date.Key Features•Co-Op Gameplay - Party-up with friends to explore over 50 unique and beautifully rendered dungeons, towns, and secret levels.\n•Unique Characters, Unique Stories- Players can choose from nine customizable characters, each their own unique story, play style and special skills to develop.\n•Skill-Based PVP Combat- Elsword offers intense and strategic PvP with matchmaking and multiple competitive modes. Challenge your friends in matches of up to 8 players at a time.\n•Customize like Crazy- Each character features multiple job changes, dozens of skills and endless opportunities for customization. Create or discover your personal look.\n•Community Support- Constant game updates, item and content expansions, and special events including GM Livestream play sessions, community contests and PVP Tournaments are all a part of the Elsword experience.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"KOG","platforms":[{"id":0,"name":"PC"}]},{"id":19551,"name":"Technobabylon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f18/f1803948ed4dd2bcfc011c8c19a09dda_KSo4Jxi.jpg","description":"The year 2087 is upon us — a future where genetic engineering is the norm, the addictive Trance has replaced almost any need for human interaction, and an omnipresent AI named Central powers the city. Its all-seeing CEL police force keeps tabs on everyone, including three people who are about to meet their maker.\nCharlie Regis, an agent of the city’s all-seeing secret police, finds himself blackmailed with the lives of his unborn children. Pushed to the limits by his deceit and his past, how far is he willing to go to save his legacy?\nLatha Sesame, a jobless agoraphobe addicted to the Trance, has become targeted for assassination. Without knowing who to trust, she must face the dangers of “meatspace” and survive a fate that has invisibly ruled her entire life.\nMax Lao, a tech-savvy case officer who joined CEL to forget her criminal past. Now she finds herself torn between two loyalties. When she’s asked to apprehend her best friend and partner, she must choose to follow her friend or the law.\nAs these three struggle to save themselves, they will soon discover a string of conspiracies that threatens not only their lives, but everything they think they know.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":298413,"name":"Boneworks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e92/e920c7dab5e9d2ce0c8b7f0a78f10d18.jpg","description":"BONEWORKS Interaction SystemsATTENTION: This game demonstrates advanced VR mechanics and concepts, players are recommended to have previous VR experience and understanding of common VR gameplay principles before proceeding.\nAbout the Game\nBONEWORKS Is a narrative VR action adventure using advanced experimental physics mechanics. Dynamically navigate through environments, engage in physics heavy combat, and creatively approach puzzles with physics.\n\nAdvanced Physics: Designed entirely for consistent universal rules, the advanced physics mechanics encourage players to confidently and creatively interact with the virtual world however you want.\nCombat: Approach combat in any number of ways you can think off following the physical rules of the game's universe. Melee weapons, firearms, physics traps, environments, can all be used to aid you in fights with enemy entities.\nWeapons, lots of weapons: Boneworks provides players with a plethora of physics based weaponry; guns, swords, axes, clubs, spears, hammers, experimental energy weapons, nonsensical mystery tools, and anomalous physics weapons.\nInteraction: Hyper realistic VR object and environment interaction.\nStory: Play through the game's mysterious narrative and explore the deep inner workings of the Monogon Industries' artificial intelligence operating system; Myth OS.\nCharacter Bodies: Accurate full IK body systems built from the ground up provide a realistic looking body presence and allow for a maximum level of immersion with physical interaction in the game space.\nMore feature information soon.\nATTENTION: This game demonstrates advanced VR mechanics and concepts, players are recommended to have previous VR experience and understanding of common VR gameplay principles before proceeding.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Stress Level Zero","platforms":[{"id":0,"name":"PC"}]},{"id":51357,"name":"PUSS!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/00a/00a7cd04f8376da1144416bcd5adb3af.jpg","description":"In this game, you play as a cat that is trapped in another dimension.\nFind the way out or stay there forever!\n\nFeatures:\n\nYou can do it with just one hand!\nThe easiest controls ever!\nBossfights! The real Bullet Hell!\nFree your future partners and they'll help you fight evil!\nCompare the results of your run with the results of other players on the leaderboard.\nThe levels are tougher than they look at first sight.\nThey also appear in a random sequence!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"teamCOIL","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":49333,"name":"Total Tank Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5f/f5f495470e5300f19dd709aaaf1f5b9b.jpg","description":"TOTAL TANK SIMULATOR OVERVIEW\nTotal Tank Simulator, a physics-based strategy that takes you to WW 2. Command an army of tanks, planes, cannons, infantry, special units and much more. Choose the best strategy using hundreds of units. Play historical factions and units that were used on the battlefield. Issue your orders before the battle and take control over any unit during it. Play huge single player campaign or compete with other player in multiplayer.\nGAMEPLAY\nPlay one of six historical campaign or sandbox. Deploy your units and watch how your soldiers go into battle. Be strategic and focused.\nMultiplayer\nMultiplayer will be the key element of Total Tank Simulator. Play againts any other player. Compete in co-op 2 vs 2. Gain XP by winning online battles and unlock new abilities.\nSingle Player:\nsix historical nations\nhundreds of units and missions\nadvanced tech tree\ncomples game economy\nhundreds of unique maps\nBattles:\nhundreds of units used in a single battle\ndozens of units types with unique mechanics\nissuing orders before the battle\ntaking control over every unit during the battle\ntypes of units have different armor and use different shells\nType of units:\ndozens of light, medium and heavy tanks\ninfantry\ntank destroyers\nanti-tanks\nartillery\nunique national units\nsecret projects\nSandbox:\nplay any two nations against each other\ntest different strategies\nplay massive battles with hundreds of units\nplay historical battles\nplace hundreds of units\nissue orders before the battle\nMODS:\nCreate mods and new units using Steam Workshop","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Noobz from Poland","platforms":[{"id":0,"name":"PC"}]},{"id":1679,"name":"Soda Dungeon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3bb/3bbaf919ad803b3c57519b12c4d40c3f.jpeg","description":"The smash-hit mobile game finally comes to your desktop. Manage your team of adventurers as you raid the local dungeon for treasure! Upgrade your tavern, purchase new sodas, and attract new party members. Gold, legendary items, and more await you! With huge golems, interdimensional beings, demons, monster lobsters, and much, much more to slay, the only thing that ISN'T standing in your way is a pay wall... Soda Dungeon is completely free to play, with no frustrating timers, lives system, or anything that might get in the way of a thirsty traveler's dungeon delving.\nSoda Dungeon features hundreds of unique enemies and items to discover. Attract valuable classes to your tavern such as the Thief, Knight, Healer, Darkmage, Shifter, and more! After gearing up your team you also have the option to enable \"Auto-combat,\" where you can step away from the game, let your team go questing, and reap the rewards when you return! Ascend higher and higher in the dungeon as you advance through new dimensions, face huge dungeon bosses, and unlock the power of the ancient soda relics!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Armor Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1222,"name":"Motorsport Manager","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/733/733ad3aa67a63f7441c687c041953dd0.jpeg","description":"Motorsport Manager - Challenge Pack DLC and 'Devil's in the Detail' free update OUT NOW\nAbout the Game\nThe ultimate management game for fans of motorsport.\nFeel the thrill of race day.  React in real-time and make split-second decisions to gain the edge on your rivals.\nMaster advanced technology to customise every aspect of your car’s performance.\nCreate a top racing team composed of drivers, managers, mechanics and designers.\nStep into a living, breathing world of motorsport with you at the centre.\nHave you got what it takes to become the manager of a high-performance motorsport team?\nMotorsport Manager is a highly detailed, best-in-class management game for fans of motorsport. You’ll hire the drivers, build the cars and embed yourself in the dynamic world of racing.\nEvery single detail will need to be considered in order to push your way to the championship title. Split second decisions on the race track combine with carefully laid pre-race plans; everything from building and customising your car to race-day tactics will affect your path to either ultimate victory or epic failure.\nStop watching, start winning and take control as the manager of your own motorsport team.\nThe Drivers. Your drivers have unique personality types, sparking drama within the team. Will you get the best out of them with tough love, or an arm around the shoulder?\nLocation, Location, Location. The location of your HQ is all-important in this globe-spanning sport. Some drivers might find it hard to resist joining an Italian team...\nPick the right people. Scouring the world for hidden gems is all the more satisfying when you find a young mechanic who can shave seconds off your pit stop times.\nThe Factory.  Build new cars and parts from scratch, then evolve the technology over multiple seasons to create the perfect driving machine.\nThinking Ahead.  Make the call on every part that goes into next season’s car. Get it right, and you’ll be in the perfect position come pre-season testing.\nHone your expertise.  Make detailed mechanical tweaks or choose your team’s recommendations.\nThe Race Weekend.  Set initial strategy across practice, qualifying and race – and adjust your tactics according to on-track developments.\nMaster the Pitstop.  Risk it all with a high speed pit stop that could put you out in front of your rivals.\nWeather Systems.  Dynamic and game-changing weather.  Will you pit for intermediate tyres or hold out on slicks for as long as possible?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Playsport Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":905,"name":"RONIN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f0/6f0c7996a3751dd4cf42251ef56c11ee.jpg","description":"Ronin is stylish a turn-based action platformer following the exploits of a vengeful heroine determined to strike down five prominent figures of a powerful corporation. Move with precision by meticulously planning out each silent step, soaring leap, and devastating swing of your blade from the shadows as you seek your revenge.\nTurn-Based Action: Carefully plot your movements to setup the perfect strike before retreating back into the shadows or boldly confronting your opposition head-on with your katana.\nDecisive Strikes: Dispatch all that oppose you with your lethal blade and razor wire or avoid their attacks with a holographic replicator and grappling hook to find a more advantageous position.\nPath to Vengeance: Battle through over fifteen complex missions as you stalk and cut down five closely guarded figures within a secretive conglomerate.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":799323,"name":"20 Minutes Till Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8a/b8a76e9c84fb8dbecebf83c4162c6553.jpg","description":"Survive the onslaught of an endless horde of monsters for 20 minutes!Unique Builds Every RunIn this roguelite survival game, select from a variety of upgrades to create a unique and overpowered builds every run. You can be a fire wizard, for example, and ignite monsters with every pump of your shotgun, or an agile ninja who controls magic knives to pierce your enemies.\nSelect Your HeroChoose from a diverse selection of characters and weapons that offer a variety of gameplay experiences.\nFeatures Over 50 different upgrades too choose from for a unique experience every run!\nWide cast of characters, with more to come post-launch.\nCasual quick 10-20 minute play sessions, for busy gamers.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"flanne","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":284763,"name":"Colt Canyon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e28/e283bf6d6bfeb6bddba82edf7a311f1a.jpg","description":"Loot. Shoot. Dodge. Reload.\nTake your revolver and rescue your kidnapped partner in this atmospheric and punchy rogue-lite game.\nColt Canyon is a 2D pixel art shooter where you control a cowboy, or one of the many other unlockable characters, whose mission is to save his kidnapped partner from the ruthless bandits. Take your gun and TNT and shoot your way through a hostile canyon full of hidden treasures, weapons, obstacles and all kinds of bloodthirsty scum. Maybe you can save more people than just your partner. But watch out. Once you got your partner your job is not done. You'll also have to get back home...FEATURESRange of characters and weapons to play and unlock\nDynamic and immersive environments and enemies\nAI-Controlled companions\nLocal Coop\nUpgrades for you and your companions\nRandomized, persistent and open levels\nStrategic stealth and fast-paced action\nBoss Fights\nRoguelike elements\nPermadeath\nHigh replayability\nBeautiful minimalistic pixel art\nPunchy particle effects\nand much more...","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Retrific","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]}]