[{"id":532487,"name":"Ragnarock","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/04b/04bb5715c79f2399b0127ba877983203.jpg","description":"JOIN OUR DISCORD (link on website)\nAbout the GameAre you ready to rock? Ragnaröck is a solo/multiplayer VR rhythm game in which you play a viking captain competing in a ship race. With your two hammers, crush the incoming runes in sync with epic viking music. Keep hitting the runes perfectly to accumulate combo energy in your hammers, and you will be able to activate a speed boost!\nViking music: The tracklist is curated with love and care and will be regularly updated. Unleash the drummer in you and play to the epic rock and metal tracks of Alestorm, Gloryhammer, Wind Rose and many more. All have a festive viking/celtic/pirate style, which will make you feel the viking power in you!\nSimple gameplay: Following the tradition of arcade games, Ragnaröck is easy to play, hard to master. To move forward, only your sense of rhythm matters. However, to win the race, you will have to train and use your skills wisely. Multiple difficulty settings will help you improve over time. Only the most experienced players will be able to collect all gold medals, beat the high scores and sign their name on the leaderboard!\nMultiplayer mode: The multiplayer PvP mode brings real-time competition against your friends or other people. Start a public or private game (up to 8 players) and beat them all to finish in first place! In solo, you can also race against a ghost ship (representing your best score) to add some competition.\nMythological environments: Ragnaröck transports you to the land of the vikings in a stylized environment inspired by nordic mythology. More environments to discover will be added over time.\nSupport for custom songs: Want to play a track from your personal music library? You can create a custom playable song from any song you own, and play it in solo mode. More info in our FAQ (Community Hub).\nRegular updates: More songs and environments will be added regularly, as well as new features developed with the community. Join us on Discord to give us your feedback. We look forward to hearing from you!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"WanadevStudio","platforms":[{"id":0,"name":"PC"}]},{"id":59911,"name":"Football Manager Touch 2019","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/561/561b785e7414bd1eb27afa3c019c848e.jpg","description":"In Football Manager 2019 Touch you’ll speed through the seasons, skipping the pre-match proceedings and media circus to focus your attention on the best bits – squad building and Match Day.\nEven Match Days can be accelerated with an Instant Result feature that will see you smash through the seasons on your way to domestic glory, and beyond.\nWhilst you’re trading control for speed, you won’t be losing any detail – as Touch packs the full depth and power of Football Manager’s world-renowned database:\n50 playable nations\n130 of the top leagues\n2500+ manageable clubs\n500,000+ fully modelled players\nThe Bundesliga and Bundesliga 2 are fully licensed for season 2018/19 and give a very early taste of what’s to come as we build towards kick-off on November 2nd.\nIn total, there are 26 fully-licensed league competitions from 11 countries as well as a host of individual club licences from some of the world’s biggest leagues, with more still to be confirmed.\nLicensing updates along with new features and game upgrades will drop mid-October on our social channels, so get following now to get ahead of the game.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sports Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58005,"name":"Xenogears (1998)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dcf/dcffe9223dde1ac7df552d7ff972c3b2.jpg","description":"Xenogears is a role-playing video game developed and published by Squaresoft for the PlayStation video game console. The debut entry in the wider Xeno franchise, it was released in Japan in February 1998, and in North America in October the same year. The gameplay of Xenogears revolves around navigating 3D environments both on-foot and using humanoid mecha dubbed \"Gears\". Combat is governed by a version of the turn-based \"Active Time Battle\" system. The story follows protagonist Fei Fong Wong and several others as they journey across the world in an attempt to overthrow the all-powerful rule of Deus. The story incorporates themes of Jungian psychology, Freudian thought, and religious symbolism.\nCreated by Tetsuya Takahashi and his wife Kaori Tanaka as a proposal for Final Fantasy VII, it was allowed to be developed as its own project, first as a sequel to Chrono Trigger and then as a wholly original game with a science fiction premise. It was developed under the working title \"Project Noah\". The characters and mecha were designed by Kunihiko Tanaka, whose designs were portrayed during in-game cinematics through the use of anime cutscenes. Due to time constraints and the team's general inexperience, the second half of the game's plot was primarily told through cutscenes.\nThe game was nearly left unlocalized due to its religious content; its localization was handled entirely by Square Electronic Arts staff and translator Richard Honeywood, who described it as one of the most troublesome games of his career. The game received critical acclaim, with praise particularly going towards the storyline, gameplay, characters, and physiological and religious themes, though the rushed pace of the second disc, due to a lack of gameplay and excessive narration, was generally panned. By 2003, the game had shipped over a million copies worldwide. It has since gained a cult following and is often acknowledged as one of the greatest role-playing video games of all time. While a direct sequel was never developed, Takahashi would later found the studio Monolith Soft and develop the Xenosaga trilogy as a spiritual successor.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":50280,"name":"Dragon Cliff 龙崖","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d8/7d82825cb16f0c16964109743ec1cda4.jpg","description":"Years after Prince Lu’s rebellion, the Crown Prince of Dragon Court has been mysteriously kidnapped. Dragon Cliff is an RPG/Town Management game. Players are to recruit adventurers, kill monsters, hunt treasures, craft armories, accommodate residents, upgrade town facilities and finally reveal the great mystic behind the Dragon Emperor.Features\nUp to 25 adventurer classes to choose from. Every class has its own unique battle ability and progression curve. Whether it’s a young warlock, wind wizard, drunk reader, fire spirit or a soul thief, they are all ready to server your town with their exclusive tactics and strategic strength.\nTime Based Command battle system: During battles, adventurers follow their ability rules to execute turns by themselves. ‘Rage Points’ are accumulated following each unit move, and players can quickly unleash powerful tactics at any time by spending them.  As tactics are played in real time instead of taking turns, battles are fast paced and intense!\nThere are almost 100 different active and passive skills to be explored with. Every skill has its distinguishable strategic pros and cons, and begging for players’ experimentation.\nMore than 300 different weapons, armors and accessories to be discovered or produced.\nMore than 200 types of monsters among 5 different maps wait for your exploration.\nBy attracting high class residents and upgrading town facilities, players can build schools and even casinos, specialize in adventurer’s battle skills and improve armory technologies.  There are up to 20 different types of residents to be attracted, and each type has its own unique contribution combinations, ranging from technology, culture or political points to valuable raw resources!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Meta Interaction","platforms":[{"id":0,"name":"PC"}]},{"id":46018,"name":"Yono and the Celestial Elephants","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/133/13343396119c0242092f3762e3f41131.jpg","description":"Ready your trunk, it's time for an adventure!\nElephants are a mighty protectors of the world, born from the stars once per millennium. This is the age of Elephant Yono. But Yono is still so very young and in a kingdom inhabited by feudal Humans, undead Bonewights and robotic Mekani, it's not easy to keep one's trunk out of trouble.\nYono and the Celestial Elephant is a grand adventure, featuring carefully designed puzzles, treasure hunts, a sprinkling combat and a world full of people. Play as a young elephant tasked to save a world he’s never seen before, and explore the rich history of a kingdom where humans, zombies and robots live side by side.FeaturesUse your elephant trunk to solve puzzles and find secrets. Load it up with air, water and other things for different effects.\nVisit 4 towns full of people, shops and side-quests.\nSolve 3 deep dungeons of puzzles, monsters and finally a scary boss.\nExplore forests and caves to find treasures and upgrades.\nDiscuss ascetic virtue ethics with the undead, existentialism and freedom of will with the robots, and political philosophy and the roots of power and authority with the humans.\nPiece together ancient texts to uncover the history of the world, the development of humankind and the influence of past Elephants.\nPlay the game in the original English, or try it out in Swedish, French, German or Spanish.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":45291,"name":"Ys SEVEN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d0/4d03cffe8d3646f5d1c97811c0fd00f0.jpg","description":"Originally released as a PSP exclusive, Ys SEVEN was the first fully 3D Ys title, the first Ys title to include a party-based battle system allowing players to swap control of characters in real-time, and the most story-heavy Ys game of its time.\nThis original PC port presents the game in full upscaled HD with a wide variety of resolution options, smooth 60 fps gameplay, full Steamworks integration featuring a variety of new achievements, and even a revised localization to ensure players receive the most immersive gaming experience possible.\nJoin redheaded adventurer Adol Christin and his loyal companion, Dogi, as they make good use of their pirate connections from adventures past to weigh anchor in the bustling port city of Altago – a former world trading capital that was cut off from foreign visitation for far too long by an all-too-recently ended war with the Romun empire.\nThe people of Altago are still distrustful of foreigners, and the land is crawling with monstrous creatures who are invulnerable to standard steel, rendering Adol’s tried and true arsenal of weapons from games past ineffective. Forced to rearm and retrain from scratch – and to prove his worth to this new country’s somewhat xenophobic populace – Adol takes up a king’s quest to explore a nearby set of ruins, only to find himself embroiled in a high-stakes game of appeasing ancient dragons and saving the world… yet again.\nAlong the way, he’ll meet a variety of companions old and new who will join him in his quest via the newly introduced party system, wherein up to three characters may be controlled at any one time. Only by mastering the use of pierce, slash, and thrust attacks, as well as dozens of unique skills, quick dodging, “flash guarding,” and more can Adol and his team uncover the mystery of the Five Great Dragons, the five ancient tribes of Altago, and the recent string of earthquakes that threaten to tear apart this ancient and storied land.\nCome take part in the first Ys adventure of the modern era! The frenetic challenges and massive bosses that made this historic series famous are back, and they’re bigger than ever.\nMake SEVEN your lucky number!Key Features:\nFast, real-time combat with dozens of unique abilities, both physical and magical\nA brand new party system allowing for up to three playable characters at once, including Adol’s loyal sidekick Dogi and fan-favorite mercenary Geis from Ys VI: The Ark of Napishtim\nEnormous screen-filling bosses set to quintessentially Ys rock music composed by the legendary Falcom Sound Team jdk\nOne of the most complex and involving storylines of the entire series, spanning well over 20 hours’ worth of gameplay\nUpscaled HD graphics and consistent 60 fps framerate bring this former PSP-exclusive title up to modern PC standards\nFull Steamworks integration, including a bevy of new achievements","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":30766,"name":"Broken Sword 1 - The Shadow of the Templars","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ec/4ec35727cdac7a195d6d4334e9876c50_NzpL8w9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Revolution Software","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"}]},{"id":21954,"name":"WWE Smackdown vs. RAW 2009","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/32e/32ee631a1b9e9330324d1e1eec65e927.jpg","description":"In WWE, the only person you can rely on, other than yourself, is your partner. You have each other’s backs, and together, you can accomplish more than you ever could on your own.  Play the all new tag team match in this demo of WWE SmackDown vs. Raw 2009.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"THQ","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"}]},{"id":19917,"name":"30 IMPOSSIBLE LEVELS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b9/3b90defe9e8994640da7cab9553d3c89.jpg","description":"At the end of the 29th century, when people were almost omnipotent, from the earth\nrose colossal ancient creatures living on Earth hundreds of thousands of years ago.\nDeity opened a portal to their measurement once called humanity as \"Hell.\"\nThe chief god of darkness - Magna Messor called the legions of hell is to destroy humanity forever, but people had to use the orbital weapon is to destroy legions.\nWith shower Bereaved Magna Messor restore the evil army and then mankind will have no chance to escape ...\nYou - just a soul among millions of other souls, prisoners\nsarcophagi cubic shape and doomed to eternal torment. Fortunately, your will\nIt has not yet been broken, and you try to escape from the Underworld.\n30 IMPOSSIBLE LEVELS - this gloomy ultra-hardcore and bloody platformer in which\nYour task is to pass 30 levels and get out. However, do not forget,\nDark gods have awakened and your escape is not in their plans ...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Abstract Tree Studio","platforms":[{"id":0,"name":"PC"}]},{"id":13630,"name":"Professional Farmer 2014","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f5/5f5b42a5a1e824c7dc4a531640ecba83.jpg","description":"Collector's EditionExtra Content included in Professional Farmer 2014 Collector's Edition:\nFarming Giant: In the best tradition of the Giants-series the player will get a first-class business simulation crafted with a lot of details. The player will build farms, maintain and upgrade his properties.\nAgricultural Simulator: Historical Farming: The game takes you to the good old days and you will experience the charming farming of the 60's and 70's.\nGood Ol’ Times DLC: 7 additional, historical Tractor models for Professional Farmer 2014.\nAbout the GameTractors And Farm Machines Get Your Farm Up And Running\nThe PC simulator \"Professional Farmer 2014\" takes the player to the countryside and gives hobby farmers full control in the comfort of their home. Farm management, cultivating fields, planting crops, animal husbandry and buying and selling produce are just a few of the major game elements this simulator offers.\nStarting out with a small estate, the player begins their career as an up-and-coming farmer and little by little acquires new fields, tractors, machines and animals, and can either specialize or make use of all options that farming has to offer. The key to success lies in good planning by season, expert knowledge that you acquire throughout the game, and skill and good old-fashioned hard work. As a farmer, the player learns to live with the forces of nature, accept the weather and respond so as to perfect the yield from fields, care for the animals and prepare the budget for new investments. Many tractors and farm machines (combine harvesters, field choppers, attaching parts and trailers, etc.) by renowned manufacturers are available to cultivate the farm and manage all the work.  Only good planning and hard work will turn fallow earth into a flourishing and fertile soil. Of course, you can drive and control all machines yourself, be it hooking up the plough, re-filling the tractor or unloading the harvest.\n\"Professional Farmer 2014\" has a broad variety of crops, depending on the environment and climate, with which the farmer can cultivate the fields diversely, effectively and with a high yield. Even crop rotation plays an important role in planning! The integrated seasons influence the game and provide the player with a constant stream of tasks and jobs.\nThe local farmers market is your first stepping-stone to success! After just a short time, you should take our home grown and harvested produce to the market and earn your first money by selling it. As you sell more, you will soon see more and larger machines in your fleet and be able to grow larger quantities of produce. Gradually, you will even be able to construct new buildings and acquire new fields.FeaturesFor the first time ever in a farming simulator: Different seasons and yearly planning\nCountless original tractors\nCampaign mode contains a plethora of missions for hours of engrossing fun. It has it all, from short tasks to extensive missions\nSandbox mode lets the hobby farmer enjoy the game without restrictions - no time pressure or to-do lists","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"PlayWay","platforms":[{"id":0,"name":"PC"}]},{"id":13044,"name":"WayOut 2: Hex","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd0/fd03020a36eae395275b64de5154db59.jpg","description":"Trading Cards and Achievements Available\nAbout the GameSequel of mind-blowing puzzle WayOut. Now with new hexagonal tiles, levels and challenges.\nBased on Lights Out gameplay, WayOut goes beyond that and brings great variety of level shapes and mechanics into it. Each level has the same goal - switch off all tiles using the least amount of moves. Test limits of your brain by perfecting each puzzle. Let your mind be your guide in meditative and relaxing, yet challenging, journey.\nAccording to Zen philosophy, game has minimalistic UI - no timers, score or move limit labels. No distraction, just you and puzzle.Features combination of new and classic Lights Out mechanics\n60+ handcrafted levels\n6 chapters, each with its own gameplay experience\nunique graphic style along with ambient soundtracks grants beautiful relaxing atmosphere\n2d and grayscale mode for true puzzle fans","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Konstructors","platforms":[{"id":0,"name":"PC"}]},{"id":12295,"name":"Construction Simulator 2015","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f8/2f89f4438f7c0f252fbda1fae00897e4.jpg","description":"Content Overview\nDeluxe Edition contentDeluxe Edition Content\nAdditionally to the full version of the successful Construction Simulator 2015 the Deluxe Edition offers you all currently released DLCs and construction vehicles such as:\n1. DLC: Liebherr 150 EC-B\n2. DLC: Liebherr LB 28\n3. DLC: Vertical Skyline\n4. DLC: Liebherr LR 1300\n5. DLC: St. John’s Hospital Fuchsberg\n6. DLC: Liebherr LTM 1300 6.2\n7. DLC: Liebherr HTM 1204 ZA\n8. DLC: Liebherr A 918\nSteam WorkshopCreate and upload new mods to add vehicles and missions to work on your very own construction site in Construction Simulator 2015.\nYou can even use all the new content together with your friends as long as they have it installed, too. Click here to learn more and get started!\nAbout the GameIn Construction Simulator 2015, you take the controls of 16 realistic construction machines made by LIEBHERR, STILL and MAN with high-quality 3D graphics.\nExcavate the foundation of a house with realistic machines, pour concrete into the wall panels of a factory with an enormous concrete pump, or test the steadiness of your hands by placing gigantic roof trusses with a mobile crane. Thanks to the realistic controls, you can steer an excavator with two joysticks using SAE controls and feel as if you are working on a real construction site.\nDiscover the world on your own or with your friends!\nExplore an expansive, freely navigable world with various towns, fields, and even a highway – you will find a variety of new challenges for your constantly growing motor pool. If you are successful, then even larger and more lucrative jobs and various office locations with even more possibilities will beckon.\nWork is more fun with friends, and construction is no exception. Operate vehicles with friends in multiplayer mode, and complete construction missions together or just play around in the wide-open game world.\nUp to four workers can participate in multiplayer games. The player who opens the game serves as the host and takes the lead role in running a construction company shared by the other players in a cooperative game.\nMany tasks are waiting for you!\nIn a single game, you can work together to accomplish construction tasks. Dig pits together using multiple excavators, while another player transports the excavated material to a gravel plant. In an advanced game, you can work on up to three construction sites at one time and really start raking in money with your construction company.\nAre 200 working stages in over 150 different missions not enough for you? The Construction Simulator 2015 offers plenty of opportunities to integrate your own vehicles and construction sites into the game. You can use the developer’s own Construction Kit to shape your own worlds and create your own game content.\nYou can of course also share your mods with the wider community of fans through Steamworks or on fan sites. This way, a huge community of players can access an endless and varied supply of user-created content.\nThe barrier to entry into the world of modding is not particularly high – all you really need is a 3D graphics program like 3ds max or Maya as well as the free version of Unity3D.Features:Over 200 missions ensure hours of enjoyment\n16 realistic construction machines made by LIEBHERR, MAN and STILL\nRealistic vehicle controls – e.g. SAE controls for excavators supported\nRealistic sound effects recorded from the original machines\nMultiplayer mode\nFor beginners and pros: freely switch between arcade and pro controls\nExpansive, freely navigable world with diverse areas and districts\nNumerous dealers and suppliers that you can visit\nDetailed tutorial ensures a smooth start in the game\nNon-linear dynamic mission system provides endless gaming enjoyment\nFor DIY fans: the modding of construction sites and vehicles is fully supported\nExperience system with numerous levels that allow you to unlock special missions\nDiverse gamepads, steering wheels, and joysticks are supported (Unfortunately, “Thrustmaster” joysticks and steering wheels are not supported by now)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"astragon Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9632,"name":"Stonehearth","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/693/6935da4fc03d06a7563f8093e039ff0f.jpg","description":"Stonehearth is a game about exploration and survival in an epic fantasy setting. Your job is to help a small group of settlers survive and carve out a place for themselves in a hostile land. You’ll need to establish a food supply, build shelter, defend your people, and find a way to grow and expand, facing challenges at every step.\nStarting from procedurally generated terrain with dynamic AI encounters, Stonehearth combines city sim and good old combat with infinite building possibilities. It’s designed to be moddable at every level, from your city to the people and creatures inhabiting the world, and will ship with the tools and documentation for you to add your own customizations to the game, and share them with friends.Build and Grow Your City\nThe heart of the game is city building and management. When you're just starting out, you'll need to juggle tasks like obtaining a sustainable food supply, building shelter, and defending your fledgling settlement from raiders and other threats.\nOnce you've achieved a foothold in the world, it's up to you to write the destiny for your people. You have the flexibility to choose your own path in this game. Do you want to build a great conquering empire? A vibrant trade city? A spiritual monastery? We really want you to feel like this is your settlement, and give you the tools that make it look and operate exactly as you wish.Level Up Your Settlers\nAll the settlers in your towns have jobs. A job is like a class in a role playing game. Each job has a specific role like hauling materials, building, crafting, and fighting. As your hearthlings work at a job they will gain experience and levels. Some jobs, when they meet certain prerequisites, can upgrade to entirely new jobs with new capabilities.\nUsually, to assign someone a new job you'll also need to craft a tool for them. The Mason can craft blocks, statues, and tools from stone, but to do it he'll need a mallet and chisel crafted by the carpenter. Our goal is to have a job tree that's both very wide and very deep, so there will be plenty of different kinds of things to do in the game, but also a lot of depth to explore if you want to concentrate on any one area.Epic Boss Fights!\nAs your town becomes more wealthy and prosperous, you risk attracting the attention of one of the world's Titans, epic boss monsters looking to protect their turf, or just to plunder your riches. Each boss will have a unique lore and set of abilities used to lay waste to your city. (The Titans are hanging back during Early Access... but they're coming.)Player Driven Legacy Through Modding\nWe LOVE mods and want to make it as easy as possible to author and share mods.\nWant to see a new kind of sword in the game? You can model it, define its stats, and then craft it in game. You can also share the design with other players so they can enjoy it too, or bring their authored content into your game.\nAs a modder you’ll be able to do basically anything that we as developers can do: introduce new items and monsters, write new scripted adventures, influence the AI, you name it. It goes back to that original pen and paper RPG experience, where “the game” is a collaboration between the core ruleset and the stories crafted by the gamemaster.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Radiant Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":8332,"name":"Gentlemen!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/947/947408e70eabb3bcf8359b90363a7813.jpeg","description":"Gentlemen! is a frantic local multiplayer Victorian-themed deathmatch game for 2-4 players. Full controller support!\nLocal multiplayer! Play your friends. Crush their dreams. Smell their fear. Destroy them with a thousand pigeons. You'll need to hone a delicate balance of technique, knowledge, cunning, and blind panic (just like a real duel!).","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Blazing Griffin","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":3791,"name":"Surge Deluxe","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"A new energy source provides humanity with enormous electrical power, but by-product materials build up fast, and must be constantly cleared to keep pressure levels in check. Shatter the dangerous by-products by routing electrical surges between matching blocks, and then vent pressure in huge blasts to buy you more time! Surge Deluxe puts sizzling electrical energy at your fingertips!\nCan you handle the pressure..?\n1 player(s)\nNetwork Features\n500KB Minimum\nTouchscreen\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\nSurge®Deluxe © 2013 FuturLab™ Limited. All rights reserved. 'Surge' is a registered trademark of FuturLab™ Limited. Surge®Deluxe developed and published by FuturLab™ Limited. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"FuturLab","platforms":[{"id":0,"name":"PS Vita"}]},{"id":3412,"name":"La-Mulana EX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d0c/d0c8a5b63f23a645d0400b61bab59a94.jpg","description":"Will you fall prey to deadly traps or unravel the secrets of LA-MULANA?\n\nLA-MULANA is an \"Archaeological Ruin Exploration Action Game\" in which you search inside ancient ruins, seeking out the \"Secret Treasure of Life\" - which sleeps in the sprawling ruins of \"LA-MULANA\" and is said to be the beginning of all civilization.\n\nApart from the plethora of traps lying in wait to stop intruders, there are also monsters on the prowl, protecting the ruins.\n\nHead for the innermost depths of the ruins while solving a variety of mysteries, fending off monsters, and disarming traps.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pygmy Studio","platforms":[{"id":0,"name":"PS Vita"}]},{"id":701,"name":"Solitairica","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/717/71712b1c40e5f33b58f55f9faea41c88.jpg","description":"Solitairica takes RPG combat and challenging roguelike progression to a fresh new place—the world of solitaire!\nGather your weapons and prepare to battle the armies of Stuck. In the land of Myrriod, all of the hearts have been stolen by the horrible Emperor Stuck, and you are the latest warrior brave enough to try to return them, saving the world from total heartless destruction!\nWith the guidance of the great Kismet who will teach you the power of solitaire and the four great energies—attack, defense, agility and willpower—to battle your enemies... you could finally be the one to save the realm.\nEach player’s journey will be a unique challenge, with a horde of ever-changing enemies and a wide variety of items and spells to explore. Battle your enemies with brute force, or cleverly constructed builds with devastating combos, and defeat the Emperor Stuck!\nKey Features:\nIntroducing a brand new turn based solitaire combat system.\nProcedural enemies that combine hilarious and dangerous traits for endless variety.\nHeaps of items and scores of spells to combine. Millions of builds to try!\nChallenging and dynamic roguelike progression.\nFour great energies to master: attack (destroy cards), defense (counter and armor), agility (peeking and quickness) and willpower (healing and the arcane).\nCollect wildstone each journey to unlock perks and new classes which change the way you play.\nDeck upgrades include Ace, King and Queen cards which provide powerful boosts during battle.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Righteous Hammer Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":973835,"name":"One-armed robber","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/698/6985f4280a5d1fe98ff7992cc2a430af.jpg","description":"Experience the challenge of robbing banks, but now with only one arm! Grab a friend and you'll have two arms in total.\nUnlock and buy new guns, which can be customized to fit your playstyle. If you are trying to go stealth, the optimal choice might be a suppressor, but if you're going loud, damage and bullets is all that matters, so put on an extended mag and get going!\nEach heist is suited for any playstyle, whether you want to sneak in and take out guards quietly, or you go in guns blazing shooting everthing in your sight until you reach the vault, the choice is yours.\nAs you become a more experienced robber new tools will be unlocked, which will make it easier for you to complete the heists. Each tool has a special purpose, and unique tools make it possible to complete heists in new ways you couldn't do before.\nWhether you go loud or stealth, once you are in the vault, the objective is the same: Gather as much loot as possible, and get out alive!\nIf you can't fit all the loot in the vault in your duffel bag, you can either run back to the truck and get a new one, or get your friends to help you carry out everything!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Duhndal","platforms":[{"id":0,"name":"PC"}]},{"id":959855,"name":"Combat Master: Season 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41b/41b57d6e82da4d238c7901626e2b1ecd.jpg","description":"Join fast-paced action-packed combat. Play Combat Master -- the ultimate FPS experience on your PC and Mac. Best-in-class multiplayer gunfight. Next-level performance. And a whole lot more.\nCombat Master is designed for extreme performance on low-end hardware, so please don't judge graphics that hard '))\nWhether you're a tactical professional, or simply love the tactical aesthetic, Combat Master provides a shooter gameplay that focus on the quality and innovation you're looking for.\nNEXT LEVEL PERFORMANCE\nThe world’s fastest FPS for low-end hardware. Exceptional performance with outstanding AAA graphics.\n- Lightning-speed loading time, get to action in seconds!\n- Optimization for low-end and top-tier devices with various settings available for customization.\n- Blazing-fast loading time.\nTHE ULTIMATE MULTIPLAYER EXPERIENCE\n- No auto-fire, no aim-snap!\n- No lootboxes, no money-pulling mechanics.\n- No advertisiments. Completely Ads-free.\n- No advantage for paying users, everyone's equal.\n- No \"every-day update\" downloads.\nFully customizable Controls and Interface.\nOffline Mode.\nVarious Maps with vertical gameplay, close-quarter or ranged combat.\nNEXT-GEN GUNFIGHT\nSuper fast paced gunfight.\nParkour Jumps, Slides, Climbs.\nThrowing Knives.\nAAA-grade Animations.\nImpressive Arsenal.\nNETWORK BREAKTHROUGH\nAAA-grade network tech with dedicated regional servers, low ping and optimized traffic usage.\nMade by true enthusiasts with special love for firearms and gaming comunity. No corporates, we are building Combat Master together with you.\nSee you in game! GL HF,\nAlfa Bravo Inc Team","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Alfa Bravo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":863724,"name":"Oxygen: First Breath","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a82/a8209dbd7286e5892fe4bebd4ea8273f.jpg","description":"Wishlist Full Versionhttps://store.steampowered.com/app/2061430/Oxygen\nAbout the GameSTORYA natural disaster hit us and brought humanity to the verge of extinction. Only a few survived because of \"Large Igneous Provinces\", these are volcanoes that don't explode but huge cracks open in the Earth's crust and lava just starts bubbling out, oozing across the landscape, releasing tons of toxic gases. The most dangerous thing about an igneous province is that it can keep up the oozing for centuries. With the wind effect, these gases spread all over the world and changed the atmospheric composition. One of these toxic magmatic gases reduced the oxygen level in the air. Sadly, there’s only little oxygen left in the world. Before it's too late for humanity, the Oxygen Center is invented. It generates oxygen by electrolysis of underground water, and the required electricity is generated by using coal but you should be slowly moving away from coal towards sustainable sources of energy. This is the only hope for us...\n\nBUILD, MANAGE, and RESEARCHThe world has changed. Start a new civilization for all survivors around the globe. Fulfill your people's basic needs with a nice living place, steady water and food supplies. Research new features and buildings to increase their confidence and education level.\nLEAD YOUR PEOPLENow it's your time, you’re the leader. Prove your worth as a leader to everyone! Coordinate and assign your people to different workplaces. Let them produce all required materials.\n\nOVERCOME THE NATURAL CHALLENGESProtect your people. Prepare for recurring and intense frosts and droughts, and plan ahead by stocking up water and food. Get ready for deadly winds, and generate the required energy by using coal or make your plan to move away from coal towards sustainable energy resources.\n\nEXPLOREFind all survivors around the globe and let them join your settlement. Detect abandoned areas and then send your team to explore the area and collect anything useful.\n\nKEY FEATURESKeep the Oxygen Center running and build your own city around itSurvive in a world of constant threats including deadly winds, crack explosions, frosts and droughtsGather or produce many different resources and try to stock all types of food, material, and waterLead your people and increase their confidence and education level for better productivityFind and warmly welcome every survivor around the globeResearch and develop to unlock new features and buildingsFind all abandoned places around your settlement and send your team to collect food and materialTake care of the dead trees and revive them","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Turquoise Revival Games","platforms":[{"id":0,"name":"PC"}]},{"id":813655,"name":"Matchpoint - Tennis Championships","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de6/de6973bcbb9afb5c5a67ecec1236ecec.jpg","description":"🎾 Welcome to Matchpoint 🎾\n🏆Matchpoint - Tennis Championships🏆 is a modern take on tennis, featuring a true-to-life on-court experience supported by a deep career mode and unique rivalry system.\nThe game places a strong focus on tactical realism, positioning and aiming, allowing the player to move their superstar in exactly the right way to get the most out of their shots.\n🏆Matchpoint - Tennis Championships 🏆 combines slick character animations, authentic ball physics and enhanced player control to replicate the realistic rhythm of the game - every swing and hit feeling unique and satisfying.\nLEGENDS EDITION CONTENTS\nAbout the Game      Enter the world of professional Tennis “Matchpoint - Tennis Championships” offers a deep career mode featuring a unique merit-based ranking system.      Create your own 3D tennis starChoose your look, fashion and play style with an array of customization options including true to life techniques such as left-or right-handed, one-handed or two-handed backhand.\nDominate the court as a tennis professional Matchpoint – Tennis Championships features 16 real-life international tennis stars from the professional circuit, including Nick Kyrgios, Kei Nishikori, and Amanda Anisimova.      Study your rival’s moves and tacticsWatch your opponents and get to know their strengths and weaknesses to gain a tactical advantage before you even hit the court.      Practice makes perfectHire a personal coach to hone your skills. Buff your strengths and diminish your weaknesses with an in-game coaching system of individual training modules.\nMaster all strokes and shots in grand styleDetermine the outcome of a rally by choosing the best technique for the time: top spin, flat, lob or slice shot.      Compete in exhibition matches at spectacular venues around the globeEach court has its own characteristics; study your arenas of play and adapt your game to grass, clay and hard courts.      Replay modeBreakpoint or deciding match point, capture your fiercest rallies on film and study the outcomes to improve your game.\nTake on opponents in local or online matchesPlay against a cunning AI or face your friends and rivals on the court via local sessions and online cross-play.      Fine-tune your tactics in Practice and Mini-Game modes Jump into a variety of training sessions to hone your perfect game and become a force to be reckoned with on the court.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Torus Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":608644,"name":"Redmatch 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e68/e6856679a5dbaaa322a6e617f0bd5164.jpg","description":"Redmatch 2 is a free online multiplayer first person shooter with 15 maps and multiple weapons and gamemodes to choose from. Upgrade your players stats in-game using kill-points to get an advantage! Perfect for a few matches with friends.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Rugbug Redfern","platforms":[{"id":0,"name":"PC"}]},{"id":460404,"name":"Bloodstained: Curse of the Moon 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f31/f3191c3915338853097fc6197a0a4044.jpg","description":"Join Zangetsu,  Dominique, and the rest of a brand new cast of characters as they battle with swords, whips, and more to defeat a new demonic threat in Bloodstained: Curse of the Moon 2!\n\nCurse of the Moon 2 brings classic 2D action and a dark, 8-bit aesthetic together with modern playability. The multiple-scenario structure of the previous title returns with an epic new story supervised by IGA (Koji Igarashi) himself. \n\nPlayers take control of Zangetsu, a swordsman from the far east who bears a deep grudge against demonkind. Zangetsu must battle his way to the demonic stronghold, but he doesn't have to do it alone! Zangetsu can ally himself with a brand new cast of characters he meets along the way and add them to the playable roster. \n\nThree brand-new playable characters appear in Curse of the Moon 2, including the exorcist Dominique. Each new character adds a variety of gameplay options, abilities, and ways to complete the games' many stages.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Inti Creates","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":409574,"name":"Werewolf: The Apocalypse - Earthblood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dbe/dbe51f372bc094270b2e500b5c864723.jpg","description":"With his former pack in danger, Cahal returns to find Endron, the energy arm of Pentex, installing an extraction site and destroying the forest around his Caern.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":385481,"name":"Being a DIK - Season 1","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d5/7d5e713dc3c7effc4eed32d665309e6e.jpg","description":"A young man, from a low-income family, moves away from his widowed father and his summer love to attend college at Burgmeister & Royce. As he is cast into freshman life and persuaded to join the up-and-coming fraternity Delta Iota Kappa, he'll be exposed to a new world filled with conflicts, alcohol, drugs and sex.\r\nBeing a DIK is a choice driven adult Visual Novel (VN).\r\nIn this game you play as a young male attending college and the choices you make will affect the characters around you and shape your character and adventure.\r\nWill you choose to play as a nice, caring and romantic guy or as someone more straightforward and daring?\r\nThe girls in the game like different and may or may not be attracted to you based on your choices. Can you resist the temptations along the way to get the girl of your dreams or will you relent and just...experiment? Hey, it's college after all!\r\nThe game is a Visual Novel and it's made more interactive through optional mini-games and free-roam events where you can explore the current environment. You can purchase boosters, cheats and skills to make the mini-games easier to pass and find hidden items that unlock special lewd artwork and more.\r\nBeing a DIK Season  1 includes Episodes 1-4:\r\nEpisode 1 - The Initiation\r\nEpisode 2 - Maggot Brothers\r\nEpisode 3 - 100%\r\nEpisode 4 - When worlds collide\r\nSeason 1 is packed with more than 300 animated scenes and 7000 images.\r\nYou can expect an 8-12 hour game that can be replayed numerous times to experience different paths and girls.\r\nBeing a DIK: Season 2, and future seasons, will be a continuation to the story and released as DLC.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Dr PinkCake","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":288604,"name":"Small Arms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79a/79a5ae3074683c2b09f443d86219ca7c.jpg","description":"Single Player, Xbox Live Multiplayer 1-4, HD (High Definition). Can’t get enough brawling and shooting action? Buy Small Arms™ to unlock all the levels, characters, and mini games. Get linked into the Small Arms community and earn a Six Degrees of Small Arms achievement! Can you beat the single-player mission? Conquer your friends on your couch or over Xbox Live®? Are you ready to check the leaderboards and claim your bragging rights? Then don’t delay - buy Small Arms now! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Gastronaut Studios","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":61681,"name":"PRO FISHING 2018","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/045/0450707ed83bb1f05fe0968466fbb6ed.jpg","description":"Personalize your character, choose equipment and go fishing! Pro Fishing 2018 is a modern fishing game that will provide you a lot of fun and will allow you to spend time with friends in multiplayer mode. And it's free!\nThe game offers huge maps with many fisheries. However, you don't have to worry that you will spend a lot of time traveling! Get on the ATV and get to your favorite fishery!\nYour favorite fishing spot is in the middle of the lake? Nothing hard! Buy a pontoon and sail where others didn't make it!\nCarp, perch, catfish ... whatever you want! In our game you will find many fish species that can easily be caught but not easy to reach the shore! I think we should wish you good luck?\nSpeaking of fish, we have an advanced artificial intelligence system. Each fish behaves differently. You must consider weather conditions or the time of day. I wonder who will be smarter? You or fish?\nHave you ever seen such water effects? Certainly not! This is not only due to the advanced water system - Ultimate Water System but also our combat system. Each species of fish fights differently, and will strike at different times of the day. Huh! A lot to discover before you!\nRain, fog, wind, heat! Day and night! That's all in Pro Fishing 2018. Didn't you catch the catfish during the day? Try it at night! Do you have a problem with carp? Wait for the rain! Real dynamic weather - same for every player!\nWhat would be fishing without competition? Still fishing - it's obvious. But the possibility of rivalry arouses in us the desire to beat all records and show who is the best. Are you pissed off by your friend? Prepare your fishing gear and break his records!\nAre you saying that is not enough? In that case, defeat him in the tournaments!\nOur multiplayer is the most extensive system among fishing games. Tournaments, fishing clubs, duels!\nWe are the only one who offer you to set up your own fishing club. Invite your friends and challenge other fishing clubs to duels! If you get bored with it, you can do an internal tournament and see who is the best angler in your club!\nClimb in the rankings, win prizes - be the best!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Dueking","platforms":[{"id":0,"name":"PC"}]},{"id":46046,"name":"Tank Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a4/4a44c3240b16d01577023cb88d08cf0f.jpg","description":"Cross Platform\nAbout the GameAs soon as early access period will end, you would be able to accomplish in-game transactions\nTank Force - the coolest free online tank shooter\nThis is a new word in online tank battles, which combines the best qualities of a tank simulator and thrilling arcade battles. Large-scale battles and lots of really existing tanks and their modifications are already available in Tank Force.\nTank Force is a game with excellent graphics, advanced tanks and maps that allows you to compete with and beat your opponents from around the world.\nChoose the real tanks from Russia, NATO. Take part in large-scale online tank battles in unique arenas, get rewards and higher rankings than other players. Earn money every day by winning in hot tank battles!\nMany players from around the world are part of a growing community of tankers. Lead your tank into battle and join them, join in the fight for dominance.\nPlay Tank Force for free, unlock new tanks, explore realistic arenas, enjoy the amazing graphics.\nConstantly updated content that includes tanks, maps, missions, events, and much more. Everything is free and was done to make tank battles even more exciting.\nDive into the world of tank battles:\nCross platform PVP battles 10x10\nDifferent battle modes\n29advanced crawler and wheeled tanks\nRealistic combat arenas that represent different geographical zones\nPossibility to take into battle 10 tanks\nAbility to play with advanced AI and real players\nComplete, get and learn:\nRegular in-game events\nTank development tree\nUnique rewards for contribution to development of the community\nYou'll get:\nRealistic physics\nExcellent graphics and sound\nDestructible environments\nAttention to detail\nParticipation in the life of the project and the community\nBrand-new solutions in the world of tank battles\nAbility to play on your PC and your phone\nBattle it out on realistic maps, get legendary tanks, complete missions and earn a reputation among other players. You can get all that in one game - Tank Force, a free online tank shooter.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Extreme Developers","platforms":[{"id":0,"name":"PC"}]},{"id":23761,"name":"Fire Emblem Fates: Birthright","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/339/33935a906179894aa1e23b0c2c089716.jpg","description":"Two kingdoms are on the brink of war. Whose side will you choose? Torn \n      between two families, you're an heir of Hoshido, raised by Nohrian \n      royals. If you choose the path of Birthright, you'll battle the \n      corrupted king of Nohr beside a family of strangers.\n    \n      You may also choose the path of Conquest, where you must fight to change \n      your misguided kingdom from within. Learn about Fire \n      Emblem Fates: Conquest.\n    \n      Command warriors with expert precision and forge deep relationships to \n      master this turn-based strategy game. For the first time ever, your \n      customized avatar is the main hero. An army of knights, mages, archers \n      and more are at your command in the most tactical battles in series \n      history. Each unit and weapon has strengths and weaknesses you must \n      consider for every foe you face. Partner allies on the battlefield so \n      they can support each other in combat. Building relationships is key—the \n      closer your allies become, the better they'll fight together. Their \n      future is at your command, but first you must make the most important \n      decision in the history of Fire Emblem.\n    \n\n        For the first time in the Fire Emblem™ series, your customized avatar \n        is the main character (Prince or Princess of Hoshido Kingdom)\n      \n\n        Epic storyline centered on your avatar, forced to choose between \n        bloodline and family who raised you.\n      \n\n        New \"My Castle\" area to interact with your allies and build stronger \n        relationships\n      \n\n        Have StreetPass™ encounters with other players to visit their My Castle\n      \n\n        Tap in corresponding Fire Emblem amiibo™ figures and Marth, Ike, \n        Lucina, and Robin will appear in your game, ready for you to battle \n        and recruit\n      \n\n      Once you choose your path between Fire Emblem Fates: Birthright \n      and Fire Emblem Fates: Conquest, you will enter a complete \n      gameplay experience with different sets of characters to battle against \n      and ally with. When you want to explore the other path (which is also a \n      complete gameplay experience), you can purchase it at a discounted price \n      in-game, adding an alternate take to the events that transpired between \n      the kingdoms of Nohr and Hoshido.\n    \n      Please make sure not to purchase both Birthright and Conquest at full \n      price on Nintendo eShop. To purchase the second path at a discounted \n      price, please select the Explore Fates option that appears at the \n      beginning of Chapter Six, or purchase a download code at retail to \n      redeem within the in-game shop Dragon's Gate.\n    \n      * The third path—Fire Emblem Fates: Revelation—will bring a \n      conclusion to the saga. In order to play Fire Emblem Fates: Revelation, \n      you must own either the Fire Emblem Fates: Birthright or the Fire \n      Emblem Fates: Conquest game. At the beginning of Chapter Six, you \n      can access the in-game shop Dragon's Gate or select the Explore Fates \n      option to purchase it. Download codes for Fire Emblem Fates: \n      Revelation will also be available at participating retailers.\n    \n      \"Fire Emblem Fates will fuel your inner fire\" \n      - Desctructoid (8.5/10)\n    \n      \"It’s an emotional and engaging journey…\" - \n      IGN (9.4/10)\n    \n      \"…a captivating story within each game\" \n      - Polygon\n    \n      9.25/10 - Game Informer","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":22313,"name":"UnnyWorld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2b/f2b17902186569c0270e9c1196c3ca1b.jpg","description":"You are the newcomer who has come from the outer space, and where you landed, there is a new threat already. Deal with enemies and conquer the planet, which you have declared your own homeland in between infinite stars and tiny worlds...!\nHave you even dreamed to own a planet? Now you can get it! Evolve your planet as you want. Upgrade buildings, improve defense and hire monsters to protect the planet from other players. Or take your sword and use a magic ship to raid other planets.\nChallenge other players and dive into the brand new MOBA World.\nControl a hero in real-time during 3vs3 Arena battles! Your team is waiting for you! Create your guild and find allies. Become the best and lead your guild to victory.\nUnnyWorld is a brand new game. We love our players and care about your opinion. Please share with us your ideas and emotions, and together we will bring UnnyWorld to the new eSports level.\nMain Features:\n·      Brand new MOBA experience.\n·      Compete in real-time PvP battles.\n·      Team up with your friends to fight in Arenas 3vs3.\n·      Joy with innovative system to cast spells.\n·      Fast matches. Around 4 minutes.\n·      Easy to learn, but hard to master.\n·      Explore the world of space fantasy.\n·      Manage your resources to build and evolve your planet.\n·      Develop the best defense using walls, towers and monsters.\n·      Raid other planets to get resources and trophies.\n·      Dive in the nice and colorful world.\n·      Collect all heroes on your Planet.\n·      Complete achievements to get great rewards.\n·      Complete everyday's tasks to get more powers & resource to personalize your world!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Unnyhog","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21529,"name":"Discovery! A Seek and Find Adventure","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec7/ec7b7152d88e2402f3afb1c3c7a5dc44.jpg","description":"Break out your magnifying glass and passport-It's time for Discovery!, the seek-and-find game show with your host, Jerry Landers and the beautiful Jill Summers. Step up to the wheel, and choose today's adventure!  Will it be Spain, China, Australia, or one of three other fabulous international hot spots?\nEnjoy the sights, sounds and hidden-object adventures around the globe and across the U.S.  Hunt for the more than 1,000 hidden objects and compete against 20 eagle-eyed contestants for a chance at the U.S. Roadtrip Jackpot Round. Play five different game modes and four fun mini-games in this seek-and-find adventure!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":21380,"name":"Woodcutter Simulator 2013","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecf/ecf9bb90318afb4cc1d5f15abce3874c.jpg","description":"Woodcutter Simulator 2013 allows the player to control and operate an entire lumber mill. From clearing woods to the evacuation of the logs, the player has to undertake all arising tasks to complete numerous missions – from cutting trees for demanding customers to producing woodchips for heating purposes.\nBesides heavy machinery like cutter, feller buncher and puller the player can finally simply use a chainsaw for working in the woods. With all this, the Woodcutter Simulator 2013 offers the players a great feeling.FeaturesWork with the chainsaw in 1st-person-view\nDirect delivery with trucks\nNew forest areas with new tasks\nDay and night phases and varying weather\nRealistic physics\nChallenging Missions\nDetailed graphic and carefully crafted environmentSteam Version includes all Gold Content\nNew low-loading truck\nNew Objects and Quests\nAdditional Missions\nNew Vehicle for chipped wood production","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20652,"name":"Ultionus: A Tale of Petty Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24c/24c34cd2f8558a6f27bc27dc4345cf80.jpg","description":"Galactic hero Serena S has been trolled on Spacebook. This is obviously a cause to embark on an epic quest to punish the troll in question, who just happens to be The Space Prince. Guide Serena through 7 stages of shmup action, jumping, shooting, and yet decidedly more jumping and shooting to her ultimate goal of total testicular annihilation of her foe. Ultionus is a love-letter to the home computer arcade games of the late 80s and early 90s, particularly Halloween Harry, Astro Marine Corps, Duke Nukem 2 and especially Phantis/Game Over II. The game features tons of lovingly crafted pixel art, and a rockin' chiptune soundtrack by the legendary Jake 'Virt' Kaufman.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Last Dimension","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17644,"name":"Triple Town","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75e/75eeab8a389360e6ca9992cad90a09a2.jpg","description":"Triple Town is an award-winning original puzzle game in which you try to grow the greatest possible city. The larger the city you build, the more points you score. You build your city by matching three or more game-pieces: combine three grasses to make a bush, three bushes to make a tree... until you've filled the board with houses, cathedrals and castles. Along the way, you'll have to outwit giant bears who will try to block your progress.\nHow large can you grow your dream city before the board fills and the game ends?\nThis is the ultimate hardcore version of Triple Town. There are no in-app purchases of any kind in the game. There is no DLC. When you buy the game, you get everything it has to offer with that purchase. We hope you enjoy it!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Spry Fox","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":16852,"name":"Relive","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/025/025aee2d38a265055b722ff6ec93f4b1.jpg","description":"Relive is a game about cardiopulmonary resuscitation, but it is also an adventure game. The main purpose is to increase the awareness about this topic and push people,\nespecially teenagers and young adults, to take a CPR classes and be prepared to intervene in case of need.\nWhile the topic is serious, we tried to create a fun and entertaining game, a SCI-FI opera where players can enjoy their gaming experience while the CPR concept slips through the game. To move forward in the story and complete successfully Relive, you will need to learn the bases of CPR, in an interesting and non-invasive way.\nTo keep the CPR skills razor sharp a tournament mode encourages group play. Family, schools and friends will be able to organize fast and fun CPR challenges and see who will be able to beat the best score.Why CPR?In Europe every day 1.000 people die of cardiac arrest. If immediate CPR is performed, the chances of survival remarkably increase. In more than 70% of instances, cardiac arrest is witnessed and CPR could be initiated by bystanders. As of today, in Europe only in 15% of cases witnesses perform CPR (European average). Taking a CPR class is the best way to rise this 15% of bystanders and save lives with no additional risk.Is Relive really free?Yes, Relive is completely free. The development of this game was made possible thanks to Future of Health Award, which purpose is to “bring serious gaming and healthcare together in order to contribute to more advanced healthcare across Europe“. Project CoordinatorFederico Semeraro, Italian Resuscitation Council, BolognaScientific Supervision - Italian Resuscitation Council, BolognaErga Cerchiari, Past-President\nGiuseppe Ristagno, Scientific CommitteeTracking engine - Istituto di Tecnologie della Comunicazione, dell’Informazione e della Percezione, Scuola Superiore Sant’Anna, PisaAntonio Frisoli, Associate Professor\nClaudio Loconsole, Post-Doc Research Fellow\nFabio Stroppa, Scholarship Holder\nNicola Mastronicola, Scholarship HolderGame developement - Studio Evil\nDutch translation - Kirsten Eijkelenboom\nRelive team is the winner of the Future of Health Award 2012.\nThe award is a joint initiative of CZ healthcare insurance and Games for Health Europe","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Studio Evil","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16185,"name":"Disney Movies VR","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0c/e0c457552049792733ae14b30f8f8c83.jpg","description":"Transport yourself into the wonderful world of Disney from your very own living room with Disney Movies VR. This app is a fully-immersive experience where you visit themed worlds, including Disney, Marvel and Lucasfilm, and interact with some of your favorite characters in their natural environments. Choose from multiple scenes in Disney movies including The Jungle Book, Captain America and Star Wars and be a part of the action! Disney Movies VR is your ticket to full immersion into the many Disney experiences optimized for virtual reality. Brought to you by the imaginative minds at Disney.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Walt Disney Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16055,"name":"Verde Station","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a33/a338acae290a57f7b2874bdad0872b62.jpg","description":"Verde Station is a first-person story/experience game set on a space station. During your year long solo mission you begin to question the world around you. The game reacts in subtle ways to how you play. Aboard Verde Station, you will test your wits, question everything, and strain to keep your sanity. Welcome to solitude.\nIt is highly recommended that if you like games that aim to surprise you and keep you questioning what's happening, do not read much about the game. The less you know the better experience you'll have. You can only play it for the first time once.Gameplay:Verde Station is a game of small details, many of which can easily be missed. It can be considered a mystery box game, walking simulator, exploration game, or story game. At its core, Verde Station is an interactive exploration game that lightly reacts to how you play it. Examine every detail of the station, pick up and view items, and dig into computer terminals. You will uncover clues about the station and have to decide if you can trust what you see and hear. As the answers come, so do more questions.Key Features:Reactive Storytelling: The core story of Verde Station is fixed but depending on how you interact with the game you will have a slightly different experience. The world around you reacts to the type of player you are. These are subtle changes specifically designed to match your personality. They are also specifically designed so you won't notice most of them until a second or third play-through.\nInteractive Exploration: Examine every item in the station or just a few. Some items even react to how you interact with them. The more you explore, the more story you reveal, and the more you discover about what's really happening. Or so you may think.\n\nNo combat and no true puzzles: There are a few elements you may need to think through but no true puzzles. But there are rewards for those that explore everything. Go as fast or as slow as you like throughout the station. Only the most engaged players will find everything their first play through. If you interact with the world differently in a second play-through you'll see different things.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Duelboot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15374,"name":"Lethis - Path of Progress","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd5/dd59f418ac2a0ddaa9606bf9b2cb83f1.jpg","description":"The Game:\nLethis – Path of Progress is an old school 2D city builder set in a Victorian Steampunk universe called Lethis.  You will have to build and manage cities, provide resources for your inhabitants while making sure there are enough workers to sustain your production lines. Trade with others cities, honor the requests of the Emperor and make your citizens happy.History:\nWith the discovery of condensed steam as a source of energy, the world of Lethis sees an unprecedented Industrial Revolution. As a result, the Empire enters a period of urbanisation. New cities are built everywhere. This rural exodus leads to new towns in strategical places to ensure the growth of the Empire. A time of great change is also a right time for new discoveries and innovation in science. Cities are built around great monuments like gigantic zeppelin hangars and observatories.Features:A campaign mode containing 26 missions with 3 difficulty levels\nA sandbox mode for unlimited fun\nOver 24 different resources to manage\nMore than 40 different buildings and 4 unique Monuments\nOver fifteen different characters that roam the city\nMaps that reach up to 300 per 300 box tiles\nAn amazing soundtrack with over 20 different songs","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Triskell Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":15197,"name":"Koi-Koi Japan [Hanafuda playing cards]","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9e/d9ee1d6831bc0c8101a4321762154303.jpg","description":"If you want learning \"Hanafuda\", \"Koi-Koi Japan\" is the fastest way!\nEveryone can be a \"Koi-Koi\" Master!\n\"Hanafuda\" is a traditional Japanese card game.\nNow you can play Koi Koi, its most well-known variation.\nIn Koi Koi, you compete to snatch up cards that will allow you to win by forming Yaku, or card combinations, before your opponent does.\nIf you form a Yaku, you can aim for even more points by calling \"Koi Koi\" and continuing the game. I hope you'll try this simple, but fiercely competitive game of strategy.\n◆Optimized for Hanafuda Beginners\nWe've prepared an easy-to-use tutorial for those who may be playing for the first time.\nNow anyone can learn the basic rules and start enjoying Koi Koi right away.\n◆Beautiful Japanese Design\nThe cards with floral and animal designs evoke a sense of \"wabi sabi,\" a uniquely Japanese aesthetic. Combined with elegant music, this enchanting game is sure to captivate you.\n◆Great Replay Value\nEnjoy the game again and again with extra features such as achievements and Collection Mode where you can collect postcards depicting Japanese scenery.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zoo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13870,"name":"Space Colony","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45f/45f5daf75350dc85e183c6353c76e5a8.jpg","description":"Half way across the galaxy with limited resources, a mega corporation looking over your shoulder and a ragtag crew expecting a pay cheque, it's up to you to survive and turn a profit. You have a base to build and hostile alien threats to neutralise, but ignore your crew and the colony is doomed. Each colonist has a mind of their own, so keeping them safe, happy and alive is no easy feat. Nurture your crew and they’ll team up to protect your intergalactic empire, forget to pay them and you’d better post a guard at the reactor!\nAs a commander of military and commercial installations on Earth, Blackwater Industries wants to see how you handle the rest of the galaxy. In Space Colony your career is in the hands of an unruly crew, all looking to escape life back on Earth. Choosing from more than 100 different buildings, it’s up to you to design and build a colony that meets their needs. Before you shell out your credits on iron extraction and lucrative space chicken production remember that without laser defences, a sauna and a half-decent restaurant nobody is going to want to work for you.\nSteam Edition\nCreated exclusively for Steam, this remastered version of Space Colony features a new Galaxy mode 'Obar' mini-campaign, Steam Workshop support, achievements, trading cards and Steam Cloud for saved games. Space Colony: Steam Edition is the definitive version of the sci-fi base builder for fans of the original, the builder genre and the Stronghold series, with which it shares DNA in both gameplay and an irreverent sense of humour.\nAlso supported are settings for HD graphics unavailable in the original version, allowing players to view their entire base on a single screen! Detect alien life forms early and counter-attack before they get near your crew, keep an eye on all workers at once or harvest resources off-base while making sure everyone visits the colony psychologist.\nFeatures\nRemastered for Steam - New 'Obar' mini-campaign, Achievements, Trading Cards, Steam Workshop, Steam Cloud support and a re-balanced Easy Mode.\nConstruct a Colony - Design a base for cosmic warfare or interplanetary tourism with military and civilian campaigns.\nDefend Your Crew - Protect your colonists from alien life forms with Hovermines, laser turrets and the fearsome Dogbot.\nTrain Specialists - Select your crew from a cast of 20 unique characters and train them in cybernetics, mining, lasers and more.\nExplore the Planet - Increase your wealth and standing with Blackwater Industries by mining minerals and expanding your colony with over 100 different structures.\nHD Upgrade - High resolution graphics allow you to view your entire colony on a single screen.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]