[{"id":15510,"name":"Alone in the Dark 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1c/f1cf2b855d70efedeaadc10aa5eb8835.jpg","description":"Sharpen your spurs and polish your six-shooter. You're Edward Carnby back in action in the wildest Western epic this side of the grave!\nYou've been summoned to Hill Century Studios' latest movie set: a two-bit ghost town by the name of Slaughter Gulch. The film crew's been kidnapped, and only your sharp shooting and even sharper sleuthing can save the heroine, Emily Hartwood.\nEnjoy up to 70 hours of gameplay piecing together this dusty puzzle and breaking the grip of the town's curse. Every cobwebbed corner holds a new clue, but be warned: you'll find no friends in the trigger-happy souls who drift across your path like so much tumbleweed.\nSo saddle up and get ready to ride into the shadowy unknown, but hold on tight...you can't imagine how wild the west can get.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Infogrames","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12000,"name":"LuckCatchers","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37c/37c0ca28b9b226a47b0822598522c067.jpg","description":"Massively multiplayer online game in the world of magic and steam. Become a pirate or a trader, a carrier or a manufacturer in this unfriendly world inhabited by dragons.\nFind yourself in the world on the Edge of the Inside Out","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DiP Online","platforms":[{"id":0,"name":"PC"}]},{"id":10996,"name":"Zero Reflex: Black Eye Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6db/6db6411c8806cf5e852debb05eb7a376.jpg","description":"Do you have what it takes?\nZero Reflex : Black Eye Edition is a psychedelic fast-paced game with a simple aim: you have 30 seconds to avoid deadly projectiles from a sadistic eyeball. EYE will do everything to kill you, and it includes rockets, shurikens, giant snakes, robotic tentacles and more! Surviving brings you to the next challenge, but don’t take it lightly: if you die, EYE will send you back to the previous level(s)!\nWhy “Black Eye Edition”? Because the challenge of this version will punch you in the face really hard!Features\nA new Psychedelic mode for a mind-expanding visual experience\n5 new levels wild deadly mechanics for a total of 25 unique environments\nA Training mode to muscle up your game before challenging the EYE\n4 difficulty levels: the further you go, the harder you are punished for your mistakesHistory\nZero Reflex is a little game project with minimalistic and clear design but with very addictive and frustrating gameplay. Do you have what it takes? Fun Fact: the initial code name of the project was The Reflexx 2. Due to similarities with many other published games the team decided to go with the name \"Eye Will Survive!\" which is a pun title inspired by the song \"I will survive\" by Gloria Gaynor, which after the soft launch was again renamed into Zero Reflex.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Exordium Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":975605,"name":"Enshrouded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23a/23a1c71366aea4341aec483c9dd08a59.jpg","description":"JOIN OUR DISCORD\nAbout the GameThe realm of Embervale is lost. In their greed for magical power, your ancestors unleashed a pestilence that consumed the world.\nEnshrouded is a game of survival, crafting, and Action RPG combat, set within a sprawling voxel-based continent. As you journey across the mountains and deserts of an open world, you are free to choose your path and shape your destiny.\nIgnite the Ancient power of the Flame, and piece together the fragments of a story that unfolds below the surface.SURVIVE THE SHROUDYou start with nothing but the will to survive the wilds. You must scrape and scavenge through the ruined remnants of a lost kingdom, and fend off the beasts that hunger for your flesh.\nJourney through forests, caves, dungeons, searching for secret knowledge and treasure. Build the strength to venture into the Shroud and bring the fight back to the horrors of the deep.\nHEART POUNDING ACTION COMBATThe Shroud consumes the land it corrupts, mutating and guiding all life it encounters. Cleave your way through ravaging factions and formidable bosses, battling Scavenger in the forests, Vukah in the caves, and Fell creatures in the mist.\nDuck, parry, and surprise your foes with unexpected fighting skills and powerful spells. Exploit the weaknesses of your enemies as you develop your own unique playstyle with an in-depth skill tree system.\nCREATE EPIC BUILDSBring life back to the land! Voxel-based building unleashes your creative vision, allowing you to create grand architecture on an epic scale, customized with a vast assortment of materials and furniture. Build not only for yourself, because NPCs will take refuge within your walls, unlocking advanced workshops and the ability to craft epic weapons and armor.\nCRAFT GEAR WORTHY OF LEGENDCraft and customize a staggering array of legendary weapons and armor to become a force to be reckoned with. You'll need to master the shield, the sword, the staff and the bow to withstand the merciless advance of the Shroud.\nCALL UPON YOUR ALLIESJoin with friends in 16 player co-op gameplay. Carve out unique roles and complimentary skills that will prove your worth in battle as together you raid, gather treasure, and overcome the Fell hordes that ravage the land.\nUNLOCK THE SECRETS OF A FALLEN REALMJourney through the biomes of Embervale to immerse yourself in vibrant fallen cultures and ancient myths, from the mystical desert of the Kindlewastes to the dark canopies of The Revelwood.\nWithin the fog, and beneath the ruins of a lost kingdom lies an ever-unfolding story of magic, ruin, hope, and redemption waiting to be discovered.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Keen Games","platforms":[{"id":0,"name":"PC"}]},{"id":635365,"name":"NEKOPARA - Catboys Paradise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/121/121a09be673cb83fae2ec5e667728016.jpg","description":"Meet your catboy heartthrob in NEKOPARA - Catboys Paradise!STORYYour grandfather has recently passed away and you end up inheriting his café and house. You intend to keep the café running as a tribute to your grandfather, but you have no idea as to where to start. That's when a school gets in touch with you and asks if you are willing to host some trainees who have some experience in running a café. You take the offer without much hesitation. To your surprise, however, the trainees are not four humans but four humanoid cats! Humanoid cat workers aren’t that rare these days, but this is still your first interacting with one. And thus, your story begins as you work alongside four catboys!CHARACTERSLaurier (CV Kaito Ishikawa)\nBreed:  Khao Manee\nHeight: 182cm\n\"The sleepy prince who does things in his own way\"\nLaurier appears to be a lazy catboy that takes naps whenever he can. When it comes to work, however, he always does his job perfectly. Due to his friendliness and handsome appearance, he is very popular with female customers. He is actually a talented catboy who can achieve anything if he sets his heart to it.\nFennel (CV Wataru Komada)\nBreed: American Burmese\nHeight: 178cm\n\"The supportive catboy who aims for perfection\"\nFor the sake of you and the café, Fennel strives to provide you with useful advice. He is a hard-working perfectionist who sets high standards for himself. Since he sleeps less in exchange for more time to study, nobody has actually ever seen him sleeping.\nSage (CV Yuuichirou Umehara)\nBreed: Bengal\nHeight: 190cm\n\"The strong, yet kind-hearted older brother\"\nSage is a catboy that's rough with words, but he always takes care of everyone like an older brother. He is a big-hearted catboy who does not care too much about details. He never hesitates to offer help whenever he can.\nDill (CV Junya Enoki)\nBreed: Calico\nHeight: 174cm\n\"The adorable catboy fashionista\"\nDill is a very approachable catboy who can make friends with practically anyone. He is a big fan of fashion, which explains why his biggest worry is buying too many clothes. Sometimes he picks clothes for you or helps you with makeup.FEATURESVisual novel with 4 routes for each catboy!\nJapanese voice acting\nJapanese, English, Chinese language options\nCG Gallery ModeSTAFFCharacter Designer: G Yusuke\nStory: Yuki Yuno\nMusic: POPHOLIC\nVideo Production: Nirai-kanai\nProducer: Sayori","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"NEKO WORKs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":286584,"name":"WRC 8 FIA World Rally Championship","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9b/f9b11c1d5def5bc4541d48c1764e716c.jpg","description":"The WRC championship is the most difficult and unpredictable motorsport competition in the world. Drivers, co-drivers and technical staff have to constantly adapt to get the best from their cars and be the fastest on each surface, whatever the weather, both day and night.\nWith the new dynamic weather system developed for WRC 8, rain, snow and hailstorms have a bigger impact, resulting in a much more true to life simulation. Road grip changes during the race, cars need to be tuned specifically for each special stage, tyre choices and stock management need to be considered, and making proper use of the weather team to get the best advice... The weather is much more than a visual effect - now it's finally coming into its own, adding a whole new dimension to the game.\nIn solo mode take on the new challenges of a completely overhauled, more realistic career mode, designed in conjunction with WRC drivers: schedule and activity management between rallies, research and development to improve the car, recruitment and management of your staff (mechanics, engineers, medical and weather teams, financial director, communication manager, etc.).\nIn multiplayer mode, weekly challenges and eSports WRC  are back and the competition is more intense than ever.\nWith 50 teams, 14 rallies and more than 100 special stages from the 2019 season, WRC 8 offers the most content ever in an off-road racing game. Rise to the challenge!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"KT Racing","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":236733,"name":"Glass Masquerade 2: Illusions","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f4/0f49c2d3f6e7826fe55b4bb884c11fbe.jpg","description":"Welcome to Glass Masquerade sequel - an artistic puzzle game inspired by stained glass artisans and Wonderland depictions of the 20th century. You need to combine hidden glass pieces to open misty portals of illusions across a tangled mind.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Onyx Lute","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":54096,"name":"Teenage Mutant Ninja Turtles III: The Manhattan Project","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c4/9c4e5733c25e2fa94851413de3092a40.jpg","description":"Teenage Mutant Ninja Turtles III: The Manhattan Project is a side-scrolling beat-'em-up released by Konami for the Nintendo Entertainment System (Family Computer) in Japan in 1991 and for the Nintendo Entertainment System in North America in 1992. It is the third video game iteration of the Teenage Mutant Ninja Turtles for the NES. The game features play mechanics similar to the previous game, Teenage Mutant Ninja Turtles II: The Arcade Game, but it is an original title for the NES without any preceding arcade version.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"NES"}]},{"id":52295,"name":"Dragon's Crown Pro","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a7/0a7380ae1a427b742902beb5d94f047c.jpg","description":"Journey to the kingdom of Hydeland, and seek the Dragon’s Crown!\nThe most beautiful 2D action RPG in history, which enchanted over a million adventurers on the PlayStation®3 and PlayStation®Vita, is journeying to the PlayStation®4!\nRegardless if magic or steel is your fancy, Dragon’s Crown Pro offers a variety of ranged and close combat options for this classic, side scrolling, beat ‘em up. Band together, or journey solo, as one of six playable classes and explore a winding dungeon with new adventures at every turn.\nWith refined, painted artwork and 4K compatibility, exploring dungeons and battling dragons has never looked so spellbinding. The soundtrack of swords and sorcery has also been revamped and re-recorded by a live orchestra. These improvements and more are conjuring a new era of high-fantasy adventure!\nAdditional hardware required for Interconnectivity.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-4 players\nNetwork Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer\nDUALSHOCK®4\nInterconnectivity PS4™ • PS Vita\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© ATLUS. © SEGA. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":40841,"name":"Resident Evil Code: Veronica","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a5/0a512dd1d273d1a7aba705944264ac44.jpg","description":"First released on the Sega Dreamcast the game featured fully 3D environments, which was quite revolutionary for the series as it previously relied on static background images. A first re-release of the game was the Kanzenban (完全版) edition for the Dreamcast which was later also the base for later ports of the game. It subsequently got ported onto the PS2 and the Gamecube, renamed to Code Veronica X and re-released again as HD version for the PS3/4 and XBOX 360.\n\nClaire Redfield, known from Resident Evil 2, searching for her lost brother, Chris, gets subsequently captured trying to infiltrate an Umbrella Research Facility, followed by being imprisoned and transported to a remote prison known as Rockford Island.\nThere she must face the horrors she lived through in Raccoon City again as you guide her through a dark and eerie facility full of zombies and other horrors.\nYou will solve many puzzles on your way in classic Resident Evil fashion and fight mutations other than zombies with various different tactics as you go from saveroom to saveroom and try not to die.\n\nAs a bonus for completing the game you also unlock a fun battle mode.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Dreamcast"}]},{"id":36582,"name":"The Suffering: Ties That Bind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/814/8141c08ab6786cda63b1cedca5ccba24.jpg","description":"Fear What's Inside.\n\nThe City has its demons... and so do you.\n\nAn inescapable enemy torment and persecutes torque. Even as he struggles to rid the streets of evil. The Dark Heart of the city can feel like a prison.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Surreal Software","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":22493,"name":"TDP5 Arena 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2e/d2ed9508790480afef03e42c519b2ea3.jpg","description":"TDP5: Arena - the outstanding Free-To-Play 3D online shooter game with RPG elements, styled as 2D platformer.\nThe game will immerse you into the world of underground fightings of Darkness Project.\nDifferent game modes and wide choose of weapons will not leave you indifferent, and rating system, unique talents plus\nother very interesting features of this game certainly do not make you bored!\nFlexible talent system - there are 211 unique talents! Design your fighter by choosing the most important ones!\nThe achievement system - 390 achievements that will surprise you!\nDynamic Rating system - Play better than the others and receive rewards for that!\nFlexible leaderboard - Now each player has a chance to find out where they will be better than the rest!\nThe friendly shop - you can either rent or buy good weapons that you liked!\nSystem implants\nVarious amplifiers\nMore than 50 types of weapons\nInteresting game modes - DM, TDM, CTF, DOM, ELM","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JAVELIN OÜ","platforms":[{"id":0,"name":"PC"}]},{"id":20210,"name":"DRAKERZ-Confrontation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/01b/01b026564966ddf3a7ebc8c8f6875a11.jpg","description":"Most other TCG play either with \"virtual\" cards or with \"real\" cards ( paper ). With DRAKERZ-Confrontation, you will enjoy the best of both gaming experiences in playing with your \"real\" premium cards , you will experience new sensations , halfway between the board game and tactical game cards. The calculation points and the cost of cards, entirely managed by the computer allows you to stay focused on the basics: the fight.\nAs your virtual cards (no need to camera), they are accessible from your account on any connected computer.\nDRAKERZ - Confrontation is an online game where players from around the world embody Drakerz , the riders of Drakos . Alongside these mythical creatures, half-dragon, half- chimera, players compete in epic duels to register their name in the legend of Oniris , the dream world .","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Peoleo Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19546,"name":"Fester Mudd: Curse of the Gold - Episode 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71b/71b06596f7e549756f1f752b93e902e9_goFpoXY.jpeg","description":"Set in Wild West, FESTER MUDD: CURSE OF THE GOLD is a three-part comic saga of exploration, reunion, and redemption...and a love letter to the classic adventure games of the 90s!\nRoused from a life of sloth to reunite with his long-lost brother in search of unimaginable riches, reluctant hero Fester Mudd somehow manages to be intrepid but cowardly, ambitious yet lazy, dimwitted but brilliant.\nIn Episode 1, Fester hits the trail to join his brother, Bud, in the downtrodden town of Loamsmouth. But when Bud is found to have mysteriously vanished, Fester realizes that the journey will be far longer and more treacherous than he bargained for...and he must enlist the aid of an experienced gunslinger to help him make his way through Indian territory to track down both his missing brother and the gold that awaits them both!\nBut gunslingers don't come cheap...and Fester must find a way to convince him to join him on the perilous quest.\nThis Episode sees Fester exploring Loamsmouth and surrounding territories. Along the way, he'll meet and deal with an assortment of Old West roughnecks, flim-flammers, and other larger-than-life characters...and give adventure game fans a huge blast from the past!\nIMPORTANT: The development of Fester Mudd games has been cancelled, and this episode is the only one available. Please note that it was designed to be part of a trilogy, and you will not experience the full story as the other two episodes won’t become available. The developer sincerely wishes to thank everyone who played and supported the journey of Fester Mudd.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Replay Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":18283,"name":"Defenders of Ardania","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e9/2e91b57d01c48b3d37944ba69aca8aae.jpg","description":"Defenders of Ardania (DoA) is a next-generation tower defense game set in the rich fantasy world of Majesty, but with a twist. Besides the addictive core mechanics of placing towers to stop advancing enemy units, DoA also allows players to take on the role of the attackers seeking to conquer the enemy base.\nDoA’s innovative new game concepts include light RTS elements, taking the popular genre to the next level. Players must oversee unit production and upgrades while assembling the most effective army from one of three playable races, each with unique locations, towers, and units. However, without magic, a fantasy game is little more than a toothless lion (or dragon, rather), so a wide range of spells will be available for players to decimate their enemies and protect their forces.\nAlthough DoA includes a single-player portion, the focus of the game is undoubtedly multiplayer, where two to four players can take each other on or compete against AI opponents via Internet, LAN, or PSN. The multiplayer component offers three different game modes where players can assume either the defensive or offensive sides – or both!\nKey Features\nAn intriguing new take on the massively popular tower defense genre: players lead both offensive and defensive operations\nArdania: the world of Majesty with three playable races and their unique environments\nDefense: 24 different upgradeable towers to erect against the invading enemy\nAttack: 24 varied units with diverse attributes to assemble into an offensive force\nStrong multiplayer component with a variety of game modes for up to four players\nInteractive environment that affects gameplay\nA wide range of offensive and defensive spells","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Most Wanted Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":18132,"name":"Shut Eye","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/131/131b5cb1044949f23b32d820677d3dd8.jpg","description":"A childs mind can be quite innocent and yet troubling. Take control of a young child as she spends the week away from her parents in a place away from home.\nKeep her safe and awake, as things there may go bump in the night. These toys are out to play, but the question is are they real or is this just the innocent mind of a child.\nYou play as a young child, who is away from her parents as they are on a much needed holiday. The young child has suffered from anxiety most of her life, which leads to confusion and an      over active imagination.\nWhich leads to trouble for the character when the light goes out an the moon comes out.\nYou must survive the nights an keep your aniexty down, as through out the night you will experience the mind of an over active childs imagination.\nEach night you may encounter different types of creatures. But don't let their cuteness fool you. As the higher you aniexty goes the harder things become.\nKeep her calm. Keep her safe. Keep her in the light.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17712,"name":"Legends of Aethereus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/464/4641e9793df6da60024980f15399ffeb.jpg","description":"The planet of Aethereus is an ancient and mysterious world filled with majestic forests, misty swamps, deep caves and ancient ruins. Devastated by three large astronomical events, the Three Great Skyfalls, it is a world just coming out of chaos and ruin. The recent unearthing of The Gauldron Tablets has revealed the existence of The Seven Ancient Skyfall Relics. The promise of unlimited power for those who possess the objects has led to a frenzied search across all of Aethereus.\nAs a member of the Nexus City-State, one of the last bastions of freedom and hope on Aethereus, you will be entrusted with the critical undertaking of procuring the The Ancient Skyfall Relics. Standing in your way are the Serpentica Shamans of Ghalia and the hordes of Khagal Tribes they control as well as the oppressive Venatan Empire forces lead by the notorious General Zhorgal.\nYour epic journey of adventure and discovery begins now.\nJoin forces in online multiplayer cooperative expeditions as the Inventor or Officer while you embark on a variety of story driven hand-crafted expedition levels or explore the wilderness through a variety of procedurally generated exploration quests. Design and build new gear and weapons while you develop your character across a diverse and expansive skill tree allowing for a multitude of character strategies.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Three Gates","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":16819,"name":"Shadow Puppeteer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62c/62c890588e2e2a4d8aa462e3e4314596.jpg","description":"Invite a friend to explore the strange, yet beautiful world of darkness and light in Shadow Puppeteer, an award-winning, local co-op adventure.\nAssume the roles of a boy and his shadow, separated from one another by the evil shadow puppeteer. Work together to manipulate light, solving puzzles that bring you closer to finding this villain and freeing other shadows he has stolen.\nWinner of the 2015 Indie Prize Director’s Choice Award and applauded for its stunning art, enchanting music and clever puzzles, Shadow Puppeteer will captivate players from beginning to end.\nKey Features\nSingle Player or Local Co-Op\nEnjoy Shadow Puppeteer by yourself or with the company of a significant other, family member or friend in shared-screen co-op.\nEasy-to-Learn Controls\nOptimized for controllers, Shadow Puppeteer is easy to pick up for players of all skill levels.\nEntertaining Puzzles\nHarness the power of light to solve cleverly crafted puzzles in 2D and 3D space.\nRich Atmosphere\nBreathtaking 3D art and an amazing soundtrack transport you to the delightful world of Shadow Puppeteer.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sarepta studio","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":16528,"name":"Spirits of Xanadu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f3/7f34f1dd2095d3a10a8749646d98266f.jpg","description":"At the farthest edge of the explored universe, the research ship Xanadu slumbers in orbit around a mysterious planet. Her systems remain active but there has been no message from her crew for months. Now a lone operative has been sent to wake the Xanadu and bring her home to Earth.\nSpirits of Xanadu is an atmospheric exploration game set aboard a deserted starship in an alternate 1980s. It draws inspiration from classic sci-fi films, novels, and games to create an immersive and highly interactive environment, featuring puzzles and FPS elements in the service of a unique and layered plot.Key Features:Discover the truth\nGet to know the crew and piece together what happened through fully voiced audiologs in addition to various types of documents and e-mails.\nThree distinct endings\nMake a decision based on what you have discovered, and decide the fate of the Xanadu.\nNo hand holding\nYou have one primary objective: Return the Xanadu back to Earth. There are no objective markers, you have no map, and the ship has been sabotaged. You begin your mission with only a flashlight and a message from your superiors back on Earth, the rest you'll have to figure out on your own.\nHot robot action with first person shooter combat\nEvade the ship's security system while battling hostile robots.\nFully interactive environment\nInspired by the immersive environments of games such as Deus Ex and System Shock 2: Open every drawer, use every computer, and read every document you find. More importantly, you can flush every toilet.\nOptional 'Peaceful' mode\nNot a fan of violence against robots? Switch to the Peaceful difficulty setting in the options menu to make the robots passive, allowing you to explore the ship, experience the story, and solve puzzles at your own pace.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Good Morning, Commander","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":3306,"name":"Tetris Ultimate","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5b/a5bf45471fd9fdf562d337be7ef01524.jpg","description":"Experience the Best of TetrisIn this fast-paced game of skills, you can take on the puzzle game solo, battle a friend, partner up with friends, or make battle teams. Up to four players can get in on the action.\nMarathon – Get to level 15 and rack up as many points as you can.\nEndless – Go as high as level 30 and keep clearing lines as long as possible.\nUltra – Get your highest score before time runs out in this three-minute challenge.\nSprint – Clear 40 lines as quickly as you can.\nBattle – Go head-to-head to knock out your opponents.\nPower-Up Battle – Be the last person playing after using crazy power-ups! Go on the offensive with Carousel and make your opponent’s Well shift to the left after each move, or trigger Let it Rain and dump garbage down on top of them. Buzz Saw helps you out by clearing away a number of your lines – especially useful when you’re in a spot of trouble.\nHaunted – Complete Marathon mode while your Tetriminos disappear.\nLandslide – Try to clear lines while random Minos are dumped on your screen every 10 turns.\nTime's Up – Starting with a 30 second game, clear lines and perform special moves like T-Spins and combos to add time to your game.Stay Connected With FriendsSocial Feeds keep you up to date with in-game events and allows you to track your friends’ scores. Tetris Ultimate captures and saves your play style, allowing you to always be able to play with or against your friends, even when they are offline. If your scores get beat, view your friends’ strategies via their in-game replays, then challenge and beat them!Celebrate Wins and CompeteLeaderboards make it easy to post your scores and see how you measure up against your friends. Challenge yourself and stack your skills and scores against other great players around the globe. An official Tetris Rank in the shape of Tetriminos has been implemented to classify and identify the top players. Play by Championship Rules for an even greater feat to see where you place among the most elite players. Are you one of the best in the world?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":830178,"name":"Police Stories: The Academy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/218/218fa0654f03540e1c7527b0014abd87.jpg","description":"Main Gamehttps://store.steampowered.com/app/539470/Police_Stories/\nAbout the Game\nPolice Stories: The Academy is a free version of Police Stories with a new story, missions, and locations. Here, Rick and John are still inexperienced trainees who are just learning to be cops.\nAnother day at the police academy goes awry when unrest breaks out in the city. To make matters worse, a \"rat\" who works with the local mafia has turned up at the police station. And, of course, only two student cops can defy all the trouble!\nLike the original game, The Academy is inspired by SWAT 4 and cop TV shows. A fresh take on top-down shooters with an emphasis on tactics where decisions have to be made in a split second. Rescue hostages, neutralize criminals and defuse bombs in single-player or co-op mode. And remember, shooting first is not the best decision!\n3 new missions and locations, plus the police academy training ground. Help young Rick and John become brutal cops!\nThe Surrender System allows you to apprehend the suspects without resorting to violence. Fire a warning shot near them or engage them in melee combat - those are just some of the ways you can make them submit.\nIssue commands to your fellow cop Rick Jones. Make sure to use him wisely - and who knows, he might save your life in return.\nRandomly placed criminals, hostages and evidence make every level run unique. The placement changes every time you restart, leading to new interesting situations and opportunities.\nAs a law enforcement officer, you will have access to end-of-the-line police equipment, such as under-the-door cameras, door blast charges and many others.\nVarious types of lawbreakers, from small petty criminals to well organised gangs and terrorists. Each type has not only unique weapons, but different behaviour and shooting skill.\nComplex Tactical Gameplay: Try not to get spotted, don't waste bullets, regularly check your surroundings and make sure to take criminals down quietly.\nAll your actions are scored in real time. Playing aggressively won't get you a high enough result to start the next mission - so keep that in mind!\nCo-op. Complete mission together for better scores and more fun!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"HypeTrain Digital","platforms":[{"id":0,"name":"PC"}]},{"id":722617,"name":"Supraland Six Inches Under","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8d0/8d0ecdf342058e29f24f4aaf21fa9f6c.jpg","description":"Supraland Six Inches Under is a First-Person-Metroidvania. That means, you're in a gated world and the more abilities you gather, the more parts of the world you can access.\n\nThe gameplay consists of roughly 55% exploration, 40% solving puzzles and 5% combat.\n\nIt was supposed to be a little DLC for Supraland , but it got a bit out of hand and got more and more ambitious. It can be considered \"Supraland 1.5\" because there are still a lot things from the first game, but at the same time it's a new world with a bunch of new mechanics.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Supra Games","platforms":[{"id":0,"name":"PC"}]},{"id":619344,"name":"Stranger of Paradise: Final Fantasy Origin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb6/eb65582e5eade59096e2d74d59c09d9a.jpg","description":"With the memory of their struggle buried deep in their hearts... \n\nJack and his allies, Ash and Jed, burn with resolve to defeat Chaos as they throw open the gates to the Chaos Shrine. Yet doubts remain—are they truly the Warriors of Light the prophecy foretold?   \n\nStep into a world of dark fantasy and revel in the exhilarating, action-packed battles!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":427462,"name":"Deceive Inc.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ee/3ee7288cdb49b9987b75d9a6f69855a7.jpg","description":"Welcome to DECEIVE INC. , a private corporation with complete monopoly over the international espionage market. You can disguise yourself as anyone you meet in an instant, have access to state-of-the-art gadgets the rest of the world can only dream of and possess skills that would make Hollywood super spies jealous.\nBut your are not alone. Rival spies are after the same objective and every single one of them is as skilled, cunning and well-equipped as you are.\nBlend in, grab the objective and break out. In the end, only one spy can complete the mission and get the paycheck. Company policy.\nFind your playstyle with a roster of diverse agents each with their own unique weapon and skillset. From world-renowned burglars to up-and-coming espionage sensations, DECEIVE INC. prides itself on being an equal opportunity employer.\nCreate your loadouts from a plethora of highly versatile gadgets. With agent's favorites like the Inflatable mat, holo-mimic and bullet proof umbrella, our world-class R&D department got you covered. Literally.\nEvery DECEIVE INC. agent is outfitted with a high-tech holographic watch allowing you to disguise yourself as guests, staff members or even security guards to gain access to restricted areas without arousing suspicion. Guaranteed to keep you hidden as long as you don’t shoot… or get shot.\nInfiltrate sprawling locations filled with people to suspect, electronics to hack, restricted areas to trespass in and windows to jump from. How you get inside the vault and steal the objective is entirely up to you… and all the rival spies who will stop at nothing to beat you to it. No pressure.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Sweet Bandits Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":301593,"name":"Kingdom Wars 2: Definitive Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da4/da46732285f588a4b2f888044c21b8ea.jpg","description":"Kingdom Wars 2: Definitive Edition is an intense real-time strategy game set in a dark fantasy world of Orcs, Elves and Dragons, that combines the best of Zombie survival and long term crafting with complex fast-paced city building and skirmish siege combat that turns beautiful landscapes into gory blood-soaked battlefields.\nCompletely RedesignedThe original Kingdom Wars 2 has been reworked and redesigned from the ground up. With new engine, sweet new graphics, and a total update of presentation, and interface. This is not just a high definition version, but a new gameplay experience.The Great RacesThe game is focused on the dominant races of Humans, Elves and Orcs with each able to recruit from other races depending on the alliances, techs and buildings they have available. Among the other races you will find scurrying Goblins, lumbering Ogres, mighty Minotaurs, ancient Treants, magical Dragons, crafty Dwarves, and fearsome Skeletal Warriors.Heroes and WizardsEach of the great races can recruit a variety of Heroes each with their own abilities to bolster their allies or decimate their foes. The three Orders of Wizards have also each aligned themselves with one of the great races, and use their vast magical power to shift the course of battle with terrifying Lightning Storms and devastating Blizzards.Story-driven CampaignPlay an epic story-driven singleplayer campaign combining engaging cinematic narrative and original gameplay to determine the fate of the three great races as they try to survive in a world engulfed by total war after they fall out of favour with the gods.Skirmish BattleEngage in the complex city building and economy of a fast paced skirmish environment as you gather resources, construct buildings, reinforce walls and train troops before being swept up in field and siege battles with up to four players or AI. Craft the right Techs and Cards, and perfect your strategy and play style to ensure that victory is yours.Survival ModeThe dead have risen and are marching towards your settlement with blood-thirsty determination. How long can you survive when your own dead bolster the ranks of the enemy if you don't burn the bodies quickly enough? Go it alone to prove your mettle as you play in solo mode or share in the struggle by inviting a friend to co-op mode.Siege Combat MechanicsAttackers can demolish gates with Battering Rams, scale walls with Ladders and Siege Towers, bombard the defenders and breach walls with Trebuchets and Dwarven Cannons. Meanwhile the defenders can hold the gates with boiling Oil Pots, skewer the advancing hordes with hidden Spike Traps, crush their enemies with Stone Tippers, and more. Set the battlefield ablaze with flame throwing Dragon's Breath machine, cower the moving shield that is the Mantlet, and mow down your enemies with the spinning blades of the Grinder.Complex Crafting SystemEvery battle gives a chance to collect crafting items ranging from the common Tools and Blueprints to the rare Legendary Weapons and Tomes of Magic. Crafting is tied into every aspect of the game, from crafting new deadly siege weapons and units buildings, to creating new game cards, or researching new industrial technologies.Tech TreeEach of the great races has their own Tech Tree to unlock and research using various combinations of crafting items, providing opportunities for management and long-term strategic thinking as players unlock their ideal set of buildings, units and abilities to ensure victory in battle.Strategic Card GamePlayers build combinations of playable card decks that they acquire through crafting that they use during battle to give extra resources, provide re-inforcements or call upon magical effects. Players need to think strategically about which cards to take into battle and tactically about when to use them, as playing the right card at the right time can shift the tide of battle.Online CommunityUse the chat channels to make friends, get help and arrange battles. Join guilds and alliances to show your allegiance and gain extra rewards. Invite your friends to co-op battle together and challenge your enemies to battle.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Reverie World Studios","platforms":[{"id":0,"name":"PC"}]},{"id":52170,"name":"Under Night In-Birth Exe:Late[st]","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b04/b044028be7f531fc87ea9ca51a6c775b.jpg","description":"The Hollow NightSince time immemorial, the organization “Night Blade” has acted as guardians in what is known as the “Hollow Night”. While resting from her eternal labors in a nondescript town that the Princess of the Night Blade, Linne, meets a young boy named Hyde, who is in possession of the fabled sword of destiny that she has been searching far and wide for.\nIn the Hollow Night, monsters called Voids feed upon the power that manifests there, while those known as In-births use that same power for their own ends. While investigating the reason behind the sudden increase in the numbers of both Voids and In-births in the Hollow Night, Linne hears of an evil plot being hatched by someone calling themselves “Paradox”. This person turns out to be none other than Hilda, the leader of a shadowy organization known as “Amnesia”.\nVowing to stop “Paradox” before her nefarious plans come to fruition, Linne heads off into the Night. Unbeknownst to her, the young boy she encountered, Hyde, follows behind her with a desperate need to know who, and what, she is.\nAnd thus, the story of the Hollow Night and In-births begins–-Fantasy Light-Novel type Stylish Action FightingThe mystery of the Hollow Night is unfolding before you. At the center lies the Abyss, an unimaginable and uncontrolled phenomenon that threatens all.\nPick one of 20 unique characters and fight your way through the dangers of the “Hollow Night”, and claim your victory over those who would get in your way. Experience intuitive and tight 2D fighter controls, with a splash of devastating combos and unique fighting styles to keep your appetite for battle sated!New System: Cross-Cast Veil OffActivate Veil Off within a combo to send your opponent flying with the shockwave, allowing for follow up extra attacks!\nDuring \"Cross-Cast Veil Off\", you will have access to special moves such as Infinite Worth even if your EXS is at 100.\nThis gives you the chance to inflict serious damage with your combo!\nMaster the use of Cross-Cast Veil Off to turn the tide of battle in your favor!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Aksys Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":50313,"name":"Descent (1996)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9a/e9a432ccf67122208c3f0cbc14490e16.jpg","description":"Welcome to the world of Descent - the amazing experience of 360° fluid 3D motion that is still unmatched. Plunge through mines that defy physics, blast your way past enemy robots and experience vertigo like never before. Arm yourself with deadly weapons and confront creatures with highly advanced artificial intelligence; they will plot, wait and ambush you from all sides.\nYou are about to embark on a new and exciting journey. One that will fill you with a sense of wonder and discovery. Light and sound will mix like a kaleidoscope to thrill you as never before. Spin 360° through twisting levels of mechanical monsters, deadly traps and hidden tunnels. Explosive 3D multi-directional sound effects and pulsing musical score will keep you on the edge of your seat.\nDon't keep this feeling of nausea to yourself, go Head-to-Head with 2-player modem support or 8-player network and Tournament Mode. Brace yourself for the world of Descent... if you can handle it. Get them before they get you...Dynamic gameplay that is hard to match even by today’s standards\nA great musical score composed by artists such as Type O Negative and Skinny Puppy\nChallenging multiplayer modes","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Sora","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 4"}]},{"id":43737,"name":"Dark Souls III: Ashes of Ariandel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7dd/7dd40d079709bc24b057f0c7ca093d70.jpg","description":"You, are the unkindled.  As part of the Dark Souls™ III Season Pass, expand your Dark Souls™ III experience with the Ashes of Ariandel™ DLC pack.  Journey to the snowy world of Ariandel and encounter new areas, bosses, enemies, weapons, armor set, magic spells and more.  Will you accept the challenge and embrace the darkness once more?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FromSoftware","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":30434,"name":"Disciples II: Dark Prophecy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e5/7e52380c948889f2888a18577562cc7e.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Strategy First","platforms":[{"id":0,"name":"PC"}]},{"id":30016,"name":"Warcraft 2: Beyond the Dark Portal","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f6/1f613bb69b69b8d4589a425a8b09114d_RuknkqQ.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Cyberlore Studios","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":28700,"name":"Naruto Rise Of A Ninja","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fcc/fcc84bf33a0a2f36603651c61e6efe92.jpg","description":"(Online Interactions Not Rated by the ESRB) This game supports English, French, Italian, German, and Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". For the first time ever, experience Naruto from the series’ beginning in a game exclusively developed for the Xbox 360 from the ground up. Re-live the hit anime and experience Naruto’s transformation from noisy ninja-academy dropout to respected ninja.  Experience Naruto Like Never Before    • Embark on anime authentic missions and adventures    • Explore environments recreated directly from the anime in full 3D  Unparalleled Depth and Variety of Gameplay    • The first Naruto game to combine action adventure gameplay, platforming, head-to-head fighting and in-depth RPG style character development.  Fast Paced Ninja Combat Offline and Online     • Build your fighting techniques, learn to control your chakra and master new attacks.    • Play with friends - select your favorite character and battle a friend in head-to-head multiplayer or sign onto Xbox LIVE and challenge the world's best. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28561,"name":"The Walking Dead: Michonne - Episode 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d82/d82cefd7ead472ce8bdde05b4b5ed48e.jpg","description":"The Walking Dead: Michonne - A Telltale Miniseries stars the iconic, blade-wielding character from Robert Kirkman's best-selling comic books. Haunted by her past, and coping with unimaginable loss and regret, the story explores Michonne's absence between issues #126 and #139 of the comic book. Over the three episodes of the miniseries, players will discover what took Michonne away from Rick, Ezekiel, and the rest of her trusted group… and what brought her back.  Download Episode One of The Walking Dead: Michonne - A Telltale Miniseries, a three part episodic game series from the creators of The Wolf Among Us, The Walking Dead: A Telltale Games Series, and Tales from the Borderlands.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":28438,"name":"ilomilo","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/260/26022d29c98d698293e89b70a3035cf7.jpg","description":"Explore the visually lush dream world of IloMilo.  Challenge yourself with exciting puzzles as you dive deeper and deeper into the story.  Play along with a friend or family member and share the journey.   Beautiful and full of charm, the game is equally appealing to seasoned gamers and young families alike.  The puzzles are easy to learn, but challenging and deeply rewarding to find all the hidden surprises.  Experience the unique, fun new co-op experience where you and a friend or family member can take control of ilo and milo and help guide each other through the exciting puzzles. Play-Pause-Resume between Xbox 360 and Windows 8 (Xbox LIVE Gold required).","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Southend Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":24329,"name":"KINGDOM HEARTS Re:coded","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/65f/65f4371671478eff172fad8d60653a66.jpg","description":"With Organization XIII defeated and order restored to the worlds, it was\njust another day in the Kingdom...until Jiminy Cricket noticed lines in\nhis journal that he did not write. Realizing that “bugs” are appearing\nin the journal’s records, King Mickey calls upon Sora, the only person\nhe can count on to save the glitch-filled worlds. What Sora discovers in\nthe datascape is a truth that not only links him to the past, but also\nopens the door to his next journey...\n\nThe future of the KINGDOM HEARTS series arrives on Nintendo DS: From\nworld-renowned creator and character designer Tetsuya Nomura comes the\nlatest installment in the beloved KINGDOM HEARTS series. Sora, Mickey,\nDonald, Goofy and a host of familiar faces from KINGDOM HEARTS and\nFINAL FANTASY unite once again for an exciting new adventure.\n\nClassic KINGDOM HEARTS gameplay with innovative twists: All-new\nfeatures include a new character growth system created specifically\nfor the Nintendo DS release, building on the series’ immersive blend\nof action and role-playing elements.\n\nAn assortment of diverse and entertaining boss battles: Guide Sora\nlike never before through boss battles inspired by side-scrolling,\nshooting and classic FINAL FANTASY games.\n\nEndless possibilities in the Avatar Menu: Players can design their own\navatar using over 800 unlockable parts and trade playable maps with\nfriends.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":20886,"name":"Dawn of Magic 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/307/307cda39c70f0dc3c3e9597ec5fe4251.jpg","description":"The well-known Action-RPG Dawn of Magic will now be continued as the evil forces won't leave the world without a desperate struggle after the death of the monstrous immortal Modo.\nPeace is ruined, the fragile balance of the forces that remained for 10 years has fallen into pieces. It is your task to save the world against the Legions of Shadows — and again, you do not have much time to accomplish your mission!\nMake comprehensive use of your magic abilities with more than 100 different spells and try do defend yourself not only with mighty wizardry, but as well with the pure power of steely blades.\nAre you ready to start another risky journey to the labyrinths of The Other Worlds to stop the invasion of the Legions of Shadows in the Dawn of Magic?\nKey features\nComprehensive Action-Role-Playing\nBalanced wizardry system based on 12 schools of magic\nMore than 100 spells that can be combined\nDynamic combat mode using combos, skills and magic\nDozens of different elaborated characters and monsters\nAdvanced NPC system\nMultiple dangerous adventures and fascinating quests\nAtmospheric sounds, speech and music themes\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C","platforms":[{"id":0,"name":"PC"}]},{"id":18895,"name":"Clown House (Palyaço Evi)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c0/6c015ce438c8e7a337803cb0e00b2e76.jpg","description":"A horror game you’ve never experienced before! Step inside the grotesque house of lunatic clowns.\nYou are trapped in a darkened house with lunatic clowns, due to a meaningless reason. You need to find the key to escape the house. Hidden in a random spot. Some of the clowns are evil and they want to kill you. You don’t know which. You have a pistol in your hand, use it to defend yourself. If you kill an innocent clown, you lose the game.\nKey’s location and the innocence of clowns change each time you start a new game.\nThe game offers a small room and three clowns by far. Wait for Clown House 2 for a big mansion and more clowns!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Aslan Game Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18269,"name":"Dark Void Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c0/5c01e4c84fa5a6ba52e99af6bdbf0e00.jpg","description":"Rise On! After 20 years, the legendary lost project \"Dark Void\" is back!  To commemorate the game's humble origins, Capcom has commissioned the recreation of the original 8-bit classic, now re-titled \"Dark Void Zero\". In this critically acclaimed 8-bit de-make, you play as Rusty, warrior test-pilot and Nikola Tesla's trusted friend.  With the help of your state-of-the-art rocket pack, blast through three deliciously retro levels of baddies in your quest to close Portal X and save the human race!\nDark Void Zero on PC is packed with all new online features! Get rewarded for your skills with Achievements via Steam. Connect with Friends. Compete to be the best on the block or the best in the world in the Score and Speed Runs in the all-new Online Leaderboards!\nExperience two all-new alternate endings! Only the best of the best will survive to see them!\nAnd don't forget!  Like its parent game, Dark Void Zero features an award-worthy soundtrack created and performed by famed Battlestar Galactica composer Bear McCreary.\nDark Void Zero on PC: The fate of the human race rests in your hands!  Rise On!\nStrap on Tesla's first prototype ROCKET PACK and take control of 5 experimental weapons!\nThree levels of intense sci-fi, sidescrolling action!\nONLINE LEADERBOARDS: Top scores! Speed runs! Can you be the best?\nACHIEVEMENTS: Hone your skills and score bragging rights with Steam achievements! 30 achievements will rate your skill, speed, and stamina.\nFRIENDS: Add your Steam friends and compete for top honors!\nPC ALTERNATE ENDINGS: What's this? Two brand-new never-before-seen endings? Only the best of the best will survive to see them!\nRETRO: 8-bit graphics and \"De-Mastered\" Dark Void Zero score by Bear McCreary!\nGAMEPAD Support: Xbox 360 Controller for Windows supported. (Generic gamepads with analog sticks may also work, though are not officially supported.)\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Other Ocean Interactive","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"}]},{"id":18067,"name":"Doorways: Old Prototype","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea7/ea7799b208151c328abe4eae6fbc2886.jpg","description":"Doorways: Old Prototype is a short game created before the development of Doorways: Prelude, the first episode in the Doorways saga.\nThis version was built between late 2011 and early 2012.\nIt’s an early prototype made to show the main features of the game.\n----\nDoorways is an episodic game, it's divided in three parts and they can be played separately:\nDoorways: Prelude (Chapter 1 & 2):\nhttp://store.steampowered.com/app/248470/\nDoorways: The Underworld (Chapter 3):\nhttp://store.steampowered.com/app/311250/\nDoorways: Holy Mountains of Flesh (Chapter 4):\nhttp://store.steampowered.com/app/383930/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Saibot Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17249,"name":"Rubber and Lead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/395/395ea52f4fd39e352eb26c31d35fc55c.jpg","description":"Rubber & Lead is a homage to AutoDuel, a fantastic game from 1985. Action and RPG elements are blended together to create an exciting combination! You must drive and shoot your way through post-apocalyptic Arizona. Choose your mission, upgrade your car, equip your weapons, and blast away your enemies! Warning: Driving without shooting can be fatal.\nGame Features:\nFight In Arenas\nRun Missions\nLevel Your Skills\nBuy A New Car\nUpgrade Your Car\nBuy Perks\nBlow Raiders Up\nHave A Lovely Day","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Omega Point Games","platforms":[{"id":0,"name":"PC"}]},{"id":17116,"name":"Metal Reaper Online","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9a/c9a9b56d26a301fea928c70f4ab7a9bf.jpg","description":"Metal Reaper Online is based on gun shooting battle's MMORPG.\nWith post apocalyptic background, merging military shooting contents and MMORPG to give various contents and better accessibility.\nGame material and control are very similar with FPS, and serve comfortable contents.[ Features ] 4 different playable military branches    - Former RPG's job. Each branch has it's own unique skill and weapon to use\nUse gun to hunt down various type of enemies    - 8 kind of weapon types to defeat enemies!\nCharacter appearance will changes belongs to your character equipment    - Equip 120+ kind of armor to upgrade yourself\nLots of map and quests    - 85+ maps to explore and 1300+ quests to do\nPvP and PvE Contents    - Currently 3 kind of PvP mode is available\n- 20+ Missions(former dungeon) and Zombie Annihilation contents\nImmersive in-game storyline","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"N2Games","platforms":[{"id":0,"name":"PC"}]}]