[{"id":60771,"name":"My Brother Rabbit","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b4/3b476707eb97b784c76841e5a5d85a2d.jpg","description":"A loving family discovers that their daughter has fallen ill. While her parents set out to get her the treatment she needs, her determined older brother turns to the power of imagination to help them cope. While the outside world offers a harsh reality, these innocent children create a surreal fantasy world that gives them the play and comfort they need. Embark on a grand journey to five different lands filled with incredible robo-moose, floating baobabs, giant mushrooms, and clocks melting to the rhythm of passing time.\nImagination will find a way\nIn this magnificent land of make-believe, a cute little rabbit wants to nurse his ill friend the flower back to health in any way he can. He must use his wits to decipher puzzles inspired by classic point-and-clicks, uncover hidden objects, and play minigames to continue his adventure. Is it just child’s play or does it all have a deeper meaning that reflects reality?\nAn emotional story of love and courage\nTake part in this inspiring story of siblings who support each other in difficult times through the power of imagination. Accompany them on the quest to help the flower regain its health.\nTons of environmental puzzles, minigames, and hidden objects\nTravel through the wondrous lands of a colorful universe where you must question everything you know about reality. Help the rabbit solve puzzles, find hidden objects, and assemble strange machinery in a world where conventional logic doesn’t apply.\nFantastic music by Arkadiusz Reikowski\nEvery step in the journey is accentuated by the atmospheric music created by the composer behind the scores for Layers of Fear, Kholat, Husk, and >observer_.\nA nostalgic journey to a time when dreams had the power to build worlds\nRemember your childhood and see the world through young eyes again. Believe in the power of imagination: it always finds a way, even in the darkest of times. Your empathy and ingenuity can save the day. How will this journey end?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":43946,"name":"The House of da Vinci","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/901/901c8aaf0b2f0726b394746f6f33ab18.jpeg","description":"Enter The House of Da Vinci, a new must-try 3D puzzle adventure game. Solve mechanical puzzles, discover hidden objects, escape from rooms and dive into the authentic atmosphere of the Renaissance. Use all your wits to find out what's behind your master's disappearance.KEY FEATURES\nSOLVE MECHANICAL PUZZLES\nBrain twisters and baffling riddles are all based on Leonardo’s inventions.\nENJOY INTUITIVE TOUCH CONTROL\nNavigate Leonardo’s workshop intuitively. Playing the game couldn’t be more fun.\nEXPERIENCE THE RENAISSANCE\nWar machines, complex lockboxes, mechanical puzzles, room escapes will all test your skills.\nMASTER UNIQUE MECHANICS\nDetect hidden objects by seeing through the surfaces around you.\nPEEK INTO THE PAST\nAn unusual gauntlet allows you to witness events that happened earlier, and learn more of the story.WHAT’S THE STORY BEHIND THE HOUSE OF DA VINCI?You are Da Vinci’s most promising apprentice. Your master, Leonardo, has disappeared. You have no idea where he’s gone or what has happened. So you begin your quest, your search for the truth. However, Leonardo's workshop is full of puzzles, inventions, escape mechanisms and objects hidden in all corners of beautifully decorated rooms. You’ll need to use all of your brain cells to find out what’s really going on!\nWe’ve applied our own imagination to the story of the world’s greatest inventor, Leonardo da Vinci, providing players with unique special abilities throughout gameplay. We allow you to warp back into your early days as a young apprentice, exploring the 16th century world around you, peeking into Leonardo’s mechanisms, puzzles and devices, as you eventually become powerful enough to control time itself and learn the secrets hidden in the past.\nMany challenging puzzles are inspired by Leonardo Da Vinci's real inventions and ideas. Mysterious locations were created based on original artworks and the wonderful Florence, Italy of 1506.LANGUAGESThe House of Da Vinci is now available in English, French, German, Spanish, Brazilian Portuguese, Czech, Slovak, Russian, Turkish, Italian, Polish, Japanese, Korean, Simplified Chinese, Hindi and Malay.WHO ARE WE? Blue Brain Games is an enthusiastic indie team of graphic artists and developers, all of whom are fans of both 3D puzzle games and the renaissance genius Leonardo Da Vinci. The House of Da Vinci was successfully funded on Kickstarter in late 2016. Install the game now and join over 2.391 adventure game enthusiasts that backed The House of Da Vinci!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Blue Brain Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":29243,"name":"Unto The End","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/977/977e315de9b728b662262e8cf34b18fd.jpg","description":"Unto The End is a hand-crafted cinematic platformer about a desperate journey home. Master combat through improvisation and observation in intense sword fights. Spot opportunities to use artifacts and trade items. An adventure told through your actions, how will you make it home?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"2 Ton Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":28345,"name":"Texas Hold'em","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/929/9297c7745c7c154a6062b49248e5c847.jpg","description":"Single Player, Xbox LIVE Multiplayer 2-8, HD (High Definition), Xbox LIVE Vision. Upgrade to the full game! Test your skills in Xbox LIVE tournaments and custom matches, or simply enjoy a friendly game with your pals. Measure your progress with our unique bankroll system, and track your stats by profile. Texas Hold'em features advanced AI, multiple configurable game modes, and Xbox LIVE Vision camera support. There are no refunds for this item. For more information, see www.xbox.com/LIVE/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"TikGames","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":26914,"name":"WWE '13","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c04/c0490101ed41235c38f02cf39099114a.jpg","description":"Last summer, one man revolutionized the sports entertainment industry.\nIn a legendary moment at the end of Monday Night Raw, CM Punk shook up\nWWE and a hero was born. Fifteen years ago, one Stone Cold Rattlesnake\nrevolutionized entertainment and ignited a new generation of WWE fans\nwith his relentless Attitude. Now, a new revolution is upon us, and it\ndoesn’t start with someone on TV, the web, or at a live event. This\nrevolution starts with you. It’s time to Live the Revolution.\n\nTHQ’s flagship franchise in the company’s WWE videogame portfolio\nreturns, promising to deliver the smoothest, most authentic, and most\nimmersive WWE action ever, presented with a grittier Attitude. You have\nheard the legendary stories and witnessed the history, but now relive\nthe Attitude Era of WWE in an all-new, breakthrough, story mode. With\nthe new WWE Live™ presentation system, featuring a completely overhauled\naudio system and Spectacular Moments, that make you feel like you’re\npart of a WWE live event, WWE® ’13 will be the boldest, smoothest, and\nmost immersive, WWE simulation to date.\n\nGAME FEATURES:\n\n• WWE LIVE™ – Bring the atmosphere, spectacle, and\nfervor of a raucous WWE Live event into your living room with\nawe-inspiring Spectacular Moments and a new audio system that delivers\nthe most authentic and dynamic commentary, sound effects and crowd\nparticipation ever in a WWE game.\n• RELIVE THE ATTITUDE ERA\n– It was a time when Stone Cold Steve Austin battled for supremacy\nagainst his maniacal boss, Mr. McMahon. An era where The Rock told\nopponents to “know your role, and shut your mouth”, where the Undertaker\nthrew Mankind off the top of the Hell in a Cell, and D-Generation X\nbroke all the rules. Now, for the first time, relive this groundbreaking\nera in an all-new storyline mode that will make you experience the\nMonday Night Wars like never before.\n• WWE UNIVERSE 3.0\n– The fan-favorite WWE Universe mode returns, giving you more control\nover WWE than ever before. Your choices determine your destiny as you\ndynamically shape your schedules, television shows, and rosters, and\nform alliances and make enemies on your way to the top.\n• PREDATOR\nTECHNOLOGY 2.0 – With new animations, transitions, and modified\ncontrols built on the Predator Technology™ game engine, WWE ’13 will\ndeliver strategic, fluid, and fun WWE action that plays more smoothly\nthan any prior WWE game.\n• CREATE YOUR WWE – WWE ‘13’s\nindustry-defining creation suite gives you the ability to create\nSuperstars, entrances, finishing moves, and more!\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Yuke's Co","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":19904,"name":"The Average Everyday Adventures of Samantha Browne","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/413/413e8e60a391b86a9048997663780d5d.jpg","description":"Samantha Browne has been waiting patiently in her room for everyone else to fall asleep, go out, or do whatever it is people who enjoy social interaction do. She's hungry. Okay, she's past hungry. She's at whatever stage is right after hungry. It's not that she doesn't have food, she has a box of oatmeal just sitting on her shelf waiting for her consumption. Thing is, she needs some help. Your help specifically and well, helping Sam isn't always easy.Key FeaturesOriginal artwork and animations by illustrator and comic book artist, Reimena Yee Dynamic soundtrack by Adrianna Krikl Player decisions impact the outcome of the game in unexpected ways Oatmeal not included\nFind the right words to help Samantha or suffer the consequences. Don't worry though, it should be as easy as making some oatmeal.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lemonsucker Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17525,"name":"Xenophage: Alien Bloodsport","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/044/0442261508896e75f36210320defd486.jpg","description":"Because of the aggressive tendencies shown by your semi-sentient species, the Council has bestowed upon you the honor of relieving their boredom by fighting for the propagation rights of the species of your world. The combat will be weaponless. The matches will take place in a holographic simulation of you or your opponent's homeworld, and will be farcast to the Council Chamber. If you fight well enough, you will be given the honor of defeat at the hands of the Grand Champion. Failure to fight will result in automatic forfeiture of propagation rights.Game Features8 characters, 2 champions, and a nasty surprise.\nHigh resolution (SVGA) 640x480 mode for much greater detail.\nThe fully rendered foes are the largest, most detailed characters even seen in a fighting game, nearly as tall as the entire screen.\nInnovative panoramic screen panning, zooming and real-time scaling, shadows and special effects.\nInteractive, animated environments, with special dangers!\nSpecial moves, combos, resurrections, and humiliations.\nStory mode, Free Play mode, and Training mode.\nThe Blood Flow Meter lets you adjust the gore.\nFlesh ripping, blood sucking, claw slashing, tail whipping, karate kicking, fist ramming, body slamming, blood spurting action - need we say more?","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Saffire","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17076,"name":"Linea, the Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/942/9420d28264857cfd0a3011b125545c7b.jpg","description":"The goal of the game is to survive for more than 60 seconds on each level, dodging platforms and objects, listening to bitpop soundtracks. Four levels, online-records, achievements and trading cards are waiting for you.\nFeatures: Challenging gameplay, aimed at reaction\nFour unique levels, each with its difficulty, design and music\nMore than 20 achievements, 7 of them are hidden\nOnline leaderboards\nSteam trading cards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"KHB-Soft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16936,"name":"Dracula Origin","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/082/08263419e431b28364aa7ede8b69dcfb.jpg","description":"Dracula: Origin reveals the dark origins of the Dracula curse. Once the ardent defender of Christendom, Dracula loses his faith in God when he is abandoned by his one true love after she marries. Dracula then makes a pact with the Prince of Darkness, and becomes a vampire. As time goes by, Dracula discovers the existence of a manuscript that allegedly details a rite which brings damned souls back from the beyond.\nIn Dracula: Origin, the player takes the role of the famous Professor Van Helsing whose life's aim is the destruction of Dracula. Van Helsing must stop the vampire from finding the manuscript. A rich adventure that takes him from London to Egypt, Austria and through Carpathian Europe right into the terrifying home of the Dark Prince.\nFeatures:\nA fantastic, gothic, romantic atmosphere faithful to Bram Stoker's original universe for a total immersion in the adventure.\nA relentless hunt throughout several countries, in pursuit of one of the most terrifying characters in fantastic literature.\nSuperb graphics combining 2D environments and 3D characters backed by an excellent scenario.\nInteract with more than 40 characters. Use and combine more than 150 objects belonging to the vampire world (stake, statue, garlic, mirror and many more).\nHelp system that shows the interactive possibilities (objects and actions) to help players in need.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":13730,"name":"Sid Meier's Colonization (Classic)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f9/1f911a50ef57c956862ec423520268ab.jpg","description":"Special OfferOfficially Licensed Sid Meier's Colonization T-Shirts are available on Amazon!\nAbout the GameThe Tradition of Civilization Continues\nThe New World lies before you with all its peril, promise and infinite possibility. Your colonists anxiously follow you to shore. The treasures of an entire continent await you.\nFinally, the much-anticipated follow-up to Civilization is here! Sid Meier's Colonization takes you into the Colonial Era to discover, explore and colonize vast territories that promise both danger and reward.\nPlay one of four colonial powers as you set sail to discover the New World. Explore new lands and strategically plant your first colony. Direct its growth, manage its resources and establish lucrative trade routes. Balance economics, political and military strategy to create your own powerful nation.\nBut beware of your enemies! Angry natives and rival powers can encroach upon your territory. You'll have to overcome your foes with superior military strategy and wily diplomacy. Only then can you launch your revolution and declare your independence.\nColonization, The newest strategy game from Sid Meier continues the great tradition of Civilization.\nManage your growth, development and trade to create a powerful nation.\nPit your strategic skills against Colonization's advanced artificial intelligence.\nPlay either the French, English, Dutch or Spanish colonial powers each with distinct characteristics and political situations.\nCustomize your games and choose your own level of difficulty so you never play the same game twice.\nDiscover and explore the Americas or create your own scenario with a random map generator\nSame design principles and interface as award-winning Civilization, making game play easy and fun.\nBonus soundtrack included!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MicroProse Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12710,"name":"Soundodger+","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee3/ee3ddb88b864eb58d079445c4d34ef15.jpg","description":"Soundodger+ combines the twitchiness of bullet hell shooters with the sonic thrills of rhythm games to create a wholly unique experience. Studio Bean has updated the original Adult Swim Games title with all-new tracks, controller support, and a fully-featured level editor. Plus, auto-generate stages from your own music library!Update! October 13, 2014\t6 new music tracks (see below for full track list)\nSteam Trading Cards supportUpdate! March 7, 2014\t6 new music tracks (see below for full track list)\nSmooth Listening Mode: play for score without audio penalties when getting hit\nLarger window sizes added: press F3 when in windowed mode to cycle between themKey Features\t35 music tracks, over half new to the Steam edition\nArtists include celebrated game musicians Disasterpeace (FEZ, Runner2), Danny Baranowsky (The Binding of Isaac) and more\nAuto-generate levels in a snap using your personal music collection\nCreate and share original levels using the all-new level editor\nEngage slo-mo for the trickiest sequences, or embark on a risk-free musical journey in Zen modeFull Track List\tAnoctave - Frog of Lore\nAustin Wintory - Lost Age\nBean - Senioritis\nBean - Sixteen & Dangerous\nBean - Solvalou\nBill Kiley - Foxtail Socks\nBill Kiley - Glowing Cubes\nBill Kiley - Rake Leaves Into Piles\nBill Kiley - Ye Olde Future\nChelsea Howe - A Walk In The Park\nD.WIGHT - Outside Wars\nD.WIGHT - Waves From Nothing\nDanny Baranowsky - Kirkhope\nDelasaurus - Fields & Reaches\nDisasterpeace - Daisy Wheel\nGhost Kollective - Dummy (Radio Edit)\nLifeformed - Chloroplast Skin\nLifeformed - Forgotten Tea\nLouis Gorenfeld - MIDI Murder Box\nMike Forst - I Do, What I Want\nMike Forst - Katapult\nNorth Base - Overdose\nSonic - Distant StarsNew Tracks! March 7, 2014\tBean - Shibuya\nBen Prunty - Crispy Static\nChipzel - Tokyo Skies\nDoseone - Samurai Gunn (Title)\nEirik Suhrke - Menu (Super Crate Box)\nJukio Kallio - Nuclear Throne (Theme)New Tracks! October 13, 2014\tA_Rival - Venus\nConstrobuz - HP Restored\nPopskyy - Samurai\nSferro & Tommy - Rapture (Rex Ronan Remix)\nTommy - Nocturnal Wanderings\ntrash80 - missing_you","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Studio Bean","platforms":[{"id":0,"name":"PC"}]},{"id":11346,"name":"LoveBeat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c5/4c5fd6db55a2e1b69356387630a3189d.jpg","description":"LoveBeat is a free-to-play rhythm game that you can dance by hitting arrow keys and spacebar. A lot of amazing indie songs will give you both the excitement of playing the game and the delight of listening to your favorite songs at the same time.\nBuild new friendships with other LoveBeat dancers all over the world by using plenty of cheerful emotes and social functions. New fashion items are updated regularly to allow the players to showcase their trendy styles. You can also change character’s body shape and apparels to express your own style.\nLet’s join LoveBeat dance party where it’s full of friendly people all over the world!Key FeaturesSkill Based Gameplay\n- No cheap power-ups here, only your skill matters. So practice makes perfect in this challenging rhythm game.\n- 11 game modes are provided including individual, team, and couple plays. Compete against other players though single play mode, or Carry your buddies in team stage mode.\nVarious indie songs\n- More than 560 songs are provided to play. You can choose your taste of music in the chart with the filters of Genre, BPM and more.\n- Our official partner ‘Jamendo’ and ‘Thinkroot Records’ offer various songs. You can also request to add songs that you’d like to play in the game.\n- Introduce your own written songs in LoveBeat! Just email us to add your songs.\nFresh contents and offers\n- We perform maintenance to update brand-new songs, apparels and more for players on a biweekly basis.\n- There are always events to participate on LoveBeat. Grab many rewards including free clothes from that.\nDynamic social interaction\n- Express your feelings to friends using personal and mutual emotes and more.\n- Make online best friends with in-game community system such as marriage, couple and Fam.\nFancy fashion items\n- Get dressed fashionably. There are more than 4,000 items including hairstyle, facial expression, outfit, accessory and more. Enjoy styling your character and become LoveBeat’s fashion leader!\n- You can choose body types among Kid, Teen, and mature (idol) type model. Show off your unique style to others.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CRAZYDIAMOND CO","platforms":[{"id":0,"name":"PC"}]},{"id":10719,"name":"Oriental Empires","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/750/7500ed130988da631388f313c6c922ce.jpg","description":"Step into the world of the ancient Orient. Control a city or tribe from the dawn of Chinese history, and turn it into a great empire. Develop your land, create great cities, raise huge armies and fight epic wars. Advance your technology, culture and religion to create one of mankind’s great civilizations. All the action takes place on one spectacular game map that brings to life the mountains, forests, plains and deserts of China. Zoom in close to review your troops and see your peasants toiling, or zoom out for a strategic overview. Plan your battles, end your turn, and then watch as your armies obey your orders, with hundreds of soldiers battling right on the game map.\nFEATURES\nStart out as a single nation or tribe, starting from humble beginnings with a single settlement and expand your empire and develop your culture with the aim of becoming the universally recognized Son of Heaven and ruler of the world.\nPersuade the other factions to recognize you as such by either military force, or by diplomatic persuasion.\nPlay as one of 16 different factions each with their own special bonuses or penalties.\nVast beautifully rendered map featuring an attractive and authentic depiction of the landscape of China and Mongolia.\nLarge scale battles with hundreds or thousands of soldiers, depicted in detail right on the game map. Watch skilled armies and reinforcements go to battle, according to the battle orders and formations set by the player.\nFully animated 3D models, with variations in face and clothing for each model, including infantry, cavalry, chariot and artillery units, as well as naval forces.\nLong seamless zoom range lets you step right into the game world or zoom out for a strategic overview.\nDevelop your settlements by constructing buildings and developing the landscape around them, build markets and ports to enable trade by land and water.\nElaborate research tree including technology as well as cultural, philosophical and religious developments.\nMany other elements will determine the outcome of you quest for dominance such as Leaders, Sieges, Unrest and Rebellion, and Authority and Culture ratings.\nAs Emperor, set edicts, laws and decrees to balance power and move into a glorious new Era, with new technologies and military units that change the game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Shining Pixel Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9622,"name":"State of Anarchy: Master of Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1c/b1c59b562690bf5f9620d2fb5f0a5da8.jpg","description":"You were an ordinary citizen in a small town… Now it’s on fire! Rioters are storming the houses, anarchy reigns the streets! The perfect time for an alien invasion! Somebody must stop this madness… It’s gonna be YOU!\nFight your way through the burning streets, chase the aliens and hit their homeworld. YOU GOTTA TEACH’EM A LESSON!!!\nFeatures:\n- Prepare for insane bullet hell action,\n- Enjoy hilarious doodle graphics and mouth made sound effects,\n- Play 4 mission types: storm a bank, chase a UFO, hit an alien homeworld and escape in a spaceship!\n- Use 13 weapons,\n- Shoot 60+ enemies and bosses,\n- Drive 3 cars and 6 spaceships,\n- Obtain new talents and weapon upgrades,\n- Beat 48 stages,\n- Enjoy awesome rock music!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sometimes You","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3381,"name":"Run Sackboy! Run!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/578/578756464643170dc64a72e727eadf91.jpg","description":"Get ready to run like the wind as Sackboy® sets off on a blistering adventure with the nasty Negativitron nipping at his heels.\n• Collect chains of bubbles, find exciting power-ups and unlock new costumes.\n• Buy bubble packs to spend on new items and purchase Save Me hearts for extra lives.\nPlus\nCollect stickers to unlock an exclusive Run Sackboy! Run! T-shirt for Sackboy® to wear in LBP™2, LBP™3, LBP™ Karting, and LBP™ PS Vita – plus costumes for Sackboy®, OddSock, Toggle and Swoop in LBP™3 on PS3™ and PS4™.\nImportant\n• Download this game for free. You can play it without making in-game purchases but optional in-game purchases are available from PlayStation®Store that may enhance your gameplay experience.\n1 player(s)\n100KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n©2014 Sony Computer Entertainment Europe. Developed by Firesprite Limited. “LittleBigPlanet”, “LittleBigPlanet logo”, “Sackboy” and “Sackgirl” are trademarks or registered trademarks of Sony Computer Entertainment Europe.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"}]},{"id":2172,"name":"Corpse Party","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2cd/2cd5653488f354b7d40ee7cb21d2e68d.jpg","description":"Kisaragi Academy student Mayu Suzumoto is transferring to a new high school, leaving behind a sizable group of friends and countless lovely memories. To help her cope with this move, her friend Ayumi has devised a seemingly innocent plan: the whole group will come together to perform a charm she found on the internet called “Sachiko Ever After,” which is supposed to bind all of its participants together as friends to the end.\nThis does not go as expected.\nFollowing an intense earthquake, the group awakens to find themselves separated and trapped in an alternate reality version of Heavenly Host Elementary, a tragedy-stricken institution that once stood on the site of their own school but was torn down long ago. Here, the vengeful spirits of elementary-aged children threaten their lives and their sanity, and the only hope of escape – much less survival – is to uncover the chilling details surrounding the murders of those trapped before them.\nCorpse Party is the original Windows edition of the cult classic horror game that gained a considerable fanbase when released on Sony’s PlayStation®Portable system in 2011. Beginning life as an independent RPG Maker adventure title in 1996, the gameplay was greatly refined and the story greatly expanded for this 2008 remake, featuring more characters, more detailed interactions, darker story elements, over 5,000 lines of voice-acting and dozens of shocking, gruesome endings. Players take control of nine main characters and several side characters who’ve been split up into groups of two or three and trapped in a run-down, otherworldly elementary school full of vengeful spirits, deadly mysteries and – of course – corpses. As they walk around examining objects and bodies in an atmospheric 2D environment, a horror tale spanning over 50 years begins to unfold, and player choices determine both how the story ends and who lives to see it through.KEY FEATURESHighly Detailed Retro-Style Graphics Used to Enhance Atmosphere\nModeled after the very first RPG Maker Corpse Party, the game’s 16-bit-style 2D visuals help create an intentional disconnect that sparks the imagination, leading the player to envision far worse things than even the most powerful next-gen system could display.\nAdventure-Style Gameplay Where Your Decisions Make All the Difference\nPlaying like a cross between a point-and-click adventure game and a classic JRPG sans battles, Corpse Party gives players the freedom to thoroughly explore every last corner of Heavenly Host Elementary School, significantly altering the course of the story and its final conclusion based on where the characters go and what they do.\nChapter-Based Storytelling with PC-Exclusive Content\nThe tale is told through five main chapters with multiple endings each and numerous scenes that differ from the game’s PSP™ system and Nintendo 3DS™ system counterparts. In addition, there are four bonus chapters, one of which is a PC-exclusive retelling of the “Tooth” story from Corpse Party: Book of Shadows, recreated with added content in classic Corpse Party adventure style.\nOriginal Japanese Voice Cast and Character Art plus Text Skip Feature\nOver 5,000 lines of spoken Japanese dialogue from the original indie voice cast complement the action, giving new spins on familiar characters for series veterans. In addition, the original PC-exclusive character art is fully intact, and dedicated players seeking every ending are given a speedy fast-forward function to make replays a breeze.\nThe Game That Started It All\nWhen first released in 2008, this title sparked a Corpse Party boom in Japan: remakes, sequels, spin-offs, fan games, manga, anime, a live-action drama series and more, as well as countless Corpse Party-inspired horror games created by other indie developers in the same style. Come see how it all began, and experience the horror the way it was meant to be seen...","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"XSEED Games","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"}]},{"id":552995,"name":"Krunker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/305/305765e9055bbcb0a37cb2717c74211c.jpg","description":"Shoot your way through 12 rotation maps to earn rewards. Master the highly skill-based movement system unique to Krunker. If dropping Nukes and Quick-scoping people in pubs isn't your thing, Krunker also offers thousands of custom games to choose from.\nInfected, Parkour, Free for All, Capture the Flag and much much more. With Krunker's robust modding and mapping tools - there are no limits to what you can create and experience.\nKrunker also features a Thriving Economy with thousands of Skins and Items to Unlock, Sell and Trade.\nDedicated Servers on every Continent & an easy to use server browser.  You can host your own custom server with 2 clicks!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Yendis Entertainment Pty","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":461648,"name":"Crucible","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff8/ff87cbfdf6a4c39551e2024b1a4ac3e6.jpg","description":"Crucible is currently in Pre-Season, so we’ll be adding core features and improving the game to prepare for the launch of our first major season in the future.\n\nCrucible is a team-based action shooter driven by the choices you make. Each match in Crucible is a fight for survival and control. Not only will you be going toe-to-toe with your fellow competitors, but you’ll have to adapt and overcome all the challenges the planet itself throws your way. You and your teammates will need to work together to take down alien creatures, capture objectives, and pursue your opponents in search of victory.\n\nHUNT LEVEL ADAPT\nWhether you prefer to bring an axe to a gunfight, think that the best way to solve problems is by lighting them on fire, or want to keep your options open with multiple weapons, there’s a hunter to suit your playstyle. Crucible's 10 hunters each come with their own unique set of abilities—how you use them is up to you.\nBegin every match on a level playing field. Each hunter has their full array of weapons and abilities at their disposal from the word “go.”\nBefore each match, you’ll select which upgrades to unlock as you level up. With these upgrades, you can define how your hunter fights. Bring along additional utility and tricks or go all-in on your damage output—it's up to you.\nEssence is a strange substance with incredible properties, and it's the object of all the commotion on the planet Crucible. You can get it from opponents and creatures you kill, or by controlling objectives. As you collect Essence, you'll level up.\n\nYou'll get access to your pre-selected upgrades with each of your first five levels. After that, more levels mean more power and health.\nUse your abilities and your wits to master the environment and battle conditions around you. Learn the lay of the land and use it to your advantage. Capitalize on events, grab all the Essence you can, hunt down the opposition, and claim victory.\n\nHeart of the Hives\nHives are lethal drone-spitting terrors that spawn across the battlefield. Capturing the hearts they leave behind as they die is your key to victory. Each match is a four-on-four fight to be the first team to capture three hearts.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Relantless Studios","platforms":[{"id":0,"name":"PC"}]},{"id":364870,"name":"Heavenly Bodies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/02e/02e25dae6cd7eaa0276eff1d2f95a9d1.jpg","description":"Heavenly Bodies is a game about cosmonauts, the body, and the absence of gravity.\r\n\r\nDiscover the ever-changing nuances of weightless motion in this challenging physics game. Wrangle control of your cosmonaut’s arms with the left and right thumbsticks to push, pull, and clamber through fully physically simulated scenarios aboard a scientific research station.\r\n\r\nYou have been entrusted to bring into operation Earth’s proudest feat of engineering. With only radio contact with mission control as your aid, you will have to use your sharp mind and dexterous limbs to assemble space telescopes, maintain delicate solar arrays and research cosmic botany. But without gravity, nothing is still, nothing is secure, and nothing is simple.\r\n\r\nHeavenly Bodies has a highly unique movement system designed to use a dual-analog joystick controller. Rebindable keyboard and mouse controls are technically supported, but they do not provide the intended experience.\r\n\r\nFeatures:\r\n\r\n    A collection of stellar scenarios inspired by the feats of space explorers and researchers throughout history.\r\n    Expressively control every limb of a weightless cosmonaut to perform challenging and delicate maneuvers.\r\n    Play single player or with a friend via local-coop. You'll be able to play missions either solo or with a space friend.\r\n    Play online with Steam's Remote Play Together.\r\n    Manipulate incredibly expensive space vehicles and elaborate machinery.\r\n    Stylised 70s visual aesthetic influenced by archival space photography and technical illustration.\r\n    Customisable control mode difficulty\r\n    Rebindable controls","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"2pt Interactive","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":257277,"name":"The Mirror Lied","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89d/89d2935066cc22cc0013da437f415d84.jpg","description":"\"A birdie flew across the roof yesterday.\nShe said she’ll fly over again today.\"\nFrom a decade ago, by the creator of To the Moon and Finding Paradise: A 30-minute experimental adventure game about a faceless girl stuck inside a house with no door to the outside.\nA short play fitting for a single sitting.\nA lousy original soundtrack consisting of one single tune.\nAn abstract experience that you hereby agree not to sue the developer for.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Freebird Games","platforms":[{"id":0,"name":"PC"}]},{"id":61699,"name":"Honey, I Joined a Cult","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7c/e7c023fd645921bf4fd4819a0fd18fc1.jpg","description":"Honey, I Joined a Cult puts your in control of your own 1970s cult. Build and expand your base, manage your resources and make as much money out of your followers as possible.\nChoose a humorous name for your:\nCult\nLeader\nDivine Being\nHoly Room\nFollowers\nThen decide on:\nA funky symbol for your merch\nA weird uniform to impress the public\nAn imposing hat to make the other cults jealous\nA strange relic to worship and adore\nSet up your cult HQ. Cultists don’t want much but they’ll definitely need to use a toilet at some stage, and beds mean they can indoctrinate with a decent night’s sleep. The Hypno-Chamber will remind followers of what’s really important and the Pool of Revelations will reveal their hidden traits – maybe they’re a genius, maybe they spend an especially long time on the toilet.\nIf you’re going to progress you’re going to need some wealthy and influential members, preying on the destitute just doesn’t pay the bills. Not everyone wants your cult to succeed though; the Government, journalists and cultists’ family members all seem to hate you?! And that’s to say nothing of the local rival cult.\nWatch out for your leader too – his ego will get out of check. Looks like you’ll be building a statue to his awesomeness after all.\nWhatever happens, keep making money as you slowly realise the Grand Plan.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sole Survivor Games","platforms":[{"id":0,"name":"PC"}]},{"id":60767,"name":"Disgaea 5 Complete / 魔界戦記ディスガイア5","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/57c/57c2979804dbcb3b207ab7828863efc6.jpg","description":"In a universe ruled by Overlords, only one shall prevail!\nDisgaea 5 Complete tells a tale of revenge and rebellion. As a new and terrible Overlord named Void Dark seeks to enslave the countless Netherworlds, one young demon has stood to end his reign—Killia. In Disgaea 5 Complete, lead Killia and his tenacious army of rebels on their dark and dangerous path to vengeance. Filled with more over-the-top action and hilarious writing than ever before, Disgaea 5 Complete’s damage numbers are surely headed for the record books.\nDisgaea 5 Complete is a strategy RPG that offers hundreds of hours of over-the-top, award-winning gameplay. The game includes all 8 bonus scenarios, 4 fan-favorite characters, and 3 character classes that were originally DLC in the PlayStation®4 release of Disgaea 5: Alliance of Vengeance.\nAim for the top in this crazy, nonstop strategy RPG of ridiculous proportions!\nKEY FEATURES\nThe Complete Disgaea5 Experience - Enjoy the full Disgaea 5 story along with 8 bonus scenarios, 4 fan-favorite characters and 3 character classes from the Disgaeaseries!\nA Legendary RPG Series Reborn - The latest flagship RPG from the most prolific strategy RPG developer in the world welcomes newcomers and veterans alike with a brand-new story and dials the hilarity and strategy up to level 9999!\nHundreds of Hours of Content - Following Disgaea tradition, Disgaea 5 Complete offers hundreds of hours of deep strategic content.\nDeep Strategic Battles - Engage in exciting tactical battles with inventive systems like Magichange, Geo Effects, Alliance Attacks, Character Towers and more!\nExtensive and Fun Customization - Recruit new units from over 40 jobs and races, then dive in and strengthen them as you see fit in their personal Chara Worlds! Find hundreds of items or make your own at the Alchemist, then power them up and discover hidden abilities in the Item World! Or, if you’re feeling wild, change the rules of the game at the Dark Assembly! The possibilities are endless!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Nippon Ichi Software","platforms":[{"id":0,"name":"PC"}]},{"id":60731,"name":"Farm Together","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf9/cf970e84fffa9e95f750e01ad225c3a6.jpg","description":"The ultimate farming experience!\nFrom the creators of Avatar Farm comes Farm Together, the ultimate farming experience!\nStart from scratch, with a small plot, and end with a huge farm that extends further than the eye can see!Grow your farm\nGrow crops, plant trees, take care of the animals, and much more! Spend your hard-earned money in new buildings and items for your farm! Earn experience and unlock even more items and buildings!\nHop onto your tractor and speed up the tasks, but watch out or you'll run out of gas!Chill out\nStay for as  long as you want! In Farm Together time advances even if you're not online, so you can be sure you'll have something to do when you come back later.\nManage your farm all by yourself, allow entrance only to your friends, or open it to the public and start cultivating together! A simple permission system allows you to limit what strangers can do, so they can help with it without risks of vandalizing.Customize your farm and your looks\nYou'll have plenty of customization items at your disposal: Fences, roads, buildings, decorations... Show your gardening and decoration skills to your neighbours!\nAnd don't forget about your clothes! Customize your avatar and your tractor to your liking, and go visit your friends' farms!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Milkstone Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":53748,"name":"Chip 'n Dale Rescue Rangers 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7c5/7c50dd0415eb0a57505c58d4e50e4d24.jpg","description":"Chip 'n Dale Rescue Rangers 2 (チップとデールの大作戦2, Chippu to Dēru no Daisakusen 2, \"Chip 'n Dale's Mission 2\") is a platformer video game released in December 1993 in Japan, and the following month in the United States. It is based on the Disney cartoon Chip 'n Dale Rescue Rangers, about Chip and Dale, two crime-fighting chipmunks. It is a sequel to the 1990 video game.\nThe game was included in The Disney Afternoon Collection compilation for Microsoft Windows, PlayStation 4, and Xbox One released in April 2017.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Capcom","platforms":[{"id":0,"name":"NES"}]},{"id":49873,"name":"Total War Saga: Thrones of Britannia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/799/799246f90d0c15a882a11716bf70b7f9.jpg","description":"The year is 878 AD, the embattled English king Alfred the Great has mounted a heroic defence at the battle of Edington, and blunted the Viking invasion. Chastened – but not yet broken – the Norse warlords have settled across Britain. For the first time in nearly 80 years, the land is in a fragile state of peace.\nThroughout this sceptred isle, the kings of England, Scotland, Ireland and Wales sense a time of change approaching; a time of opportunity. There will be treaties. There will be war. There will be turns of fortune that become the stuff of legend, in a saga that charts the ascent of one of history’s greatest nations.\nKings will rise. One will rule.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Creative Assembly","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":49697,"name":"Black Survival","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/505/505e0930de6b7888f28ca2c85d2ea542.jpg","description":"* Black Survival aims to be a fair and competitive game without any Pay to Win elements!\n* Game Introduction\nReal-Time Survival Game played by 10 people on a deserted island\n1. PvP games last roughly 20 minutes. Fights are easily played with a single touch.\n2. The island is divided into 22 areas, including Hospital, Forest, Beach, etc… As time passes, they turn into Restricted areas, narrowing the battlefield.\n3. Fencer, actor, doctor, police, hacker, cook, student, and more! There are over 30 kinds of different characters to choose from.\n4. Gun, Bow, Hand, Blunt, Blade, and more! There's a total of 7 weapon types, each with their own strategies.\n5. Hundreds of different ingredients are hidden all over the island that can be used to craft over 600 types of weapons, tools, and foods.\n* Gameplay\n1. Find different ingredients and craft a better weapon!\n2. Hunt wild animals and level up!\n3. Run away from the ever expanding Restricted Areas!\n4. If you want to survive, get stronger before everyone else. Kill the rest!\n----\nDeveloper contact\nCompany: Archbears\nAddress : Gangnam-Gu, Seoul, Republic of Korea","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Archbears","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":38995,"name":"Battlefield 2: Modern Combat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eaa/eaa4cc9b2c9b07182a7047cd4242a355.jpg","description":"Battlefield 2: Modern Combat is a sequel to the award-winning Battlefield franchise. Invade the high tech frontlines of modern warfare, engage in battle with over 64 players in some of the largest online battles on PC, as you fight for one of the three military superpowers - the US, the Chinese or the newly formed Middle East Coalition. A variety of solider classes including Assault, Sniper, Special Ops, Combat Engineer, Medic, Heavy Weapons, and Anti-Tank units New state-of-the-art weapon systems, including wire-guided missiles and Laser designated bombs Material penetration feature makes sure players know the difference between cover and concealment Character Persistence and Growth. With in-game success, players increase their rank from recruit all the way to General -- unlocking new weapons, medals, and more Join a squad or select the new Commander Mode to assume the strategic role of a battlefield commander directing his forces Full in-game community support including, buddy lists, stat tracking, live chat rooms, and in-game clan creation Voice over IP supported with Headset","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"}]},{"id":30407,"name":"Neverwinter Nights","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa3/aa3e6aa0f32fba9cd8f8ef4c46708152.jpg","description":"Neverwinter Nights is a classic Dungeons & Dragons RPG— enhanced for iOS! Explore 100+ hours of gameplay including the original campaign, plus six free DLC adventures. Play solo or team up with friends for a grand adventure across the Forgotten Realms.\nDEVICE RECOMMENDATION\nOptimized for iPads\nRecommended for iPhones with screen sizes of 7 inches or larger\nCONTENT\nNeverwinter Nights (Classic Campaign)\nShadows of Undrentide (Free DLC)\nHordes of the Underdark (Free DLC)\nKingmaker (Free DLC)\nShadowGuard (Free DLC)\nWitch’s Wake (Free DLC)\nAdventure Pack (Free DLC)\nFEATURES\nRe-engineered UI for iPads and iPhones\n- Virtual joystick and context sensitive button makes gameplay easy\n- UI Scales automatically or can be set to your liking\nCross-Platform Multiplayer\n- Adventure with friends!\n- Cross-play support includes compatibility with mobile, tablets, computers and consoles\n- Join persistent worlds, with community-run campaigns and up to 250 players\nImproved Graphics\n- Pixel shaders and post-processing effects make for cleaner graphics and visuals\n- Adjustable contrast, vibrance, and depth of field options\nSTORY CONTENT:\nNeverwinter Nights (Original Campaign)\nYou find yourself at the center of intrigue, betrayal, and dark magic in Neverwinter Nights. Journey through dangerous cities, monster filled dungeons and deep into uncharted wilderness in search of the cure for a cursed plague ravaging the city of Neverwinter.\nShadows of Undrentide (Free DLC Expansion)\nAnother adventure begins in the updated expansion, Shadows of Undrentide! Charged by your master to recover four ancient artifacts, travel from the Silver Marches to unravel mysteries of a long-dead magical civilization.\nHordes of the Underdark (Free DLC Expansion)\nThis expansion continues the adventure started in Shadows of Undrentide. Journey into the ever-more bizarre and hostile depths of Undermountain to challenge a gathering evil.\nThree Premium Modules (Free DLC)\nDiscover over 40 hours of new Dungeons & Dragons adventures across the Forgotten Realms in these premium modules for Neverwinter Nights:\n- Kingmaker\n- ShadowGuard\n- Witch’s Wake\n- Adventure Pack\nLANGUAGES\n- English\n©2020 Beamdog. ©2020 Wizards of the Coast LLC. All Rights Reserved. Wizards of the Coast, Dungeons & Dragons, Neverwinter Nights, and D&D are trademarks of Wizards of the Coast LLC. Hasbro and its logo are registered trademarks of HASBRO, Inc. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"BioWare","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":23385,"name":"Rise of Insanity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef5/ef5c1928c6684eae3da90bdf7363d496.jpg","description":"Rise of Insanity is a psychological horror for PC, additionally with support for VR (but googles are not required).\nImpersonate into the role of the doctor of psychology and get into psychedelic detective story, located in American '70s, with professional dialogues and realistic graphics. Dark atmosphere of uncertainty is surrounding the player, who by explorating of many locations, meet logical puzzles, and events like...flying through deepest parts of human’s consciousness.\nOvercome your fear and get to know what has really happened to your family.\nSome aspects of human’s consciousness today, as well as in the 70’s, were mysteries for the doctors. Dr Stephen Dowell has to face the case of his new patient. The symptoms indicate many different disorders that are not connected to each other. Will the doctor solve the puzzle of the mysterious disorder?\nThe Game CharacteristicsMysteryNo one knows what has happened to your family. Cops cannot manage with the investigation. Did your family get lost or were they murdered? Only one suspect is your patient you are testing your experimental methods of treatment on. Who is responsible for everything that has happened?LocationsThe realistic graphics and diverse locations were inspired on architectural trends from early 70’s in the USA. Visit them all and check what do they hide and to what will they lead you.MechanicsWalk, explore, examine and solve the mysteries and sometimes, even flying. compass the deepest parts of human’s consciousness.Cinematic GameplayProfessional dialogues and soundtrack allow you to entirely drill down to the history and experience the same as the main character.Overcome Your Fear The constant pressure and uncertainty create a real challenge which we want you to meet. Don’t let us down and overcome your fear.For VR playersBecause it is a horror type game and we really wanted to preserve the immersion, the game does not posses the system of movement based on teleports. If the traditional way of movement causes the motion sickness (VR sickness), we do not recommend to play VR version. The game posseses the alternative snap rotation.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Red Limb Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21671,"name":"Luxor: Quest for the Afterlife","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59a/59a5bfd5825a4ca796284fb33715f1e0.jpg","description":"LUXOR, the #1-selling, action-puzzle game, blasts outside Egypt's borders and onto the Silk Road in search of riches beyond imagination.  One of the most beautiful and well-known faces in history is also one of its greatest mysteries. When the sacred artifacts of Queen Nefertiti are robbed, her earth-bound spirit calls upon you to find them so her eternal spirit will rise. Wielding the falcon-wing shooter of Horus, you choose your own paths on an expansive journey out of Egypt.\nIn your quest to reveal and assemble Queen Nefertiti's artifact pieces, you'll explore exotic Persia, Syria, India and other regions of the Near East. Track down each of the robbers before the sands of fate shift and defeat them in an all-new Battle Mode. Your great adventure awaits in, LUXOR: Quest for the Afterlife!\nChoose the path of your quest as you venture from Egypt to 18 cities in 6 exotic regions along the Silk Road\nCompete against enemies in an all-new Battle Mode\nTrack down enemy leaders to obtain the most valuable artifacts\nQueen Nefertiti speaks to you, her champion, in a quest for her afterlife\n100 all-new levels in Adventure Mode\nUnlock upgrades in the in-game store, including new ball and shooter sets\nLocate the pieces of Nefertiti's artifacts and assemble them to upgrade you abilities in the Adventure campaign\nVivid Widescreen-supported backgrounds","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20619,"name":"Rats - Time is running out!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d6/5d6c6926f82e4b4eda538323e88c48db.jpg","description":"Run through labyrinth-like banks, uncover secret rooms, solve puzzles, discover blueprints to unlock powerful tools, control time, run from guards -- and if you’re lucky, open the vault, grab the diamond . . . and get out before time runs out!\nKey Features:\nDevour powerful cheeses and enjoy their delicious effects on time.\nDiscover blueprints and unlock an arsenal of ridiculous tools with your coins.\nBlast your way across a bank on a rocket! Disguise yourself as a typewriter!\nSolve puzzles to gain access to the vault.\nSimple controls: Perfect for those who don't like to read instructions!\nFor once, have both time and money!\nSynopsis:\nCitizen of Swine Island City: It’s  to take back what’s ours from the dirty, rotten, scoundrel Pigs who have ruled us for far too long! Snatch their diamonds, loot their coins to your heart’s content -- all the while eating the finest and most powerful cheeses known to the animal kingdom! It won't be easy, folks; although they may look adorable and huggable, the guards are relentless and will stop at nothing to take you down. Stay focused, be clever -- and most of all, keep your eye on the clock!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Citeremis","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19976,"name":"Time Mysteries 3: The Final Enigma","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db3/db3ac6ac49dff9b26d6a41ae09253f4e.jpg","description":"Time Mysteries 3: The Final Enigma is the epic finale to the time-travelling adventure series. In the face of the looming magical cataclysm, Ester Ambrose has to fight to save her future once again.\nDestroying Viviana’s crystal tomb was supposed to turn Ester Ambrose’s fight against evil powers into nothing more than a distant echo of her past, a faint memory of a nightmare never to befall her again.\nHowever, the most difficult and dangerous, but also the most fascinating, part of the story is yet to begin for the Ambrose family heiress. To save the future, she has to face the past on another journey through time and space.\nFeaturesA portable time machine – change the history to your will\n26 unique mini-games and 17 hidden-object scenes\n42 atmospheric, hand-painted locations\nTime manipulation puzzles\nAdditional adventure, play as Michael!\nA Time Mysteries Encyclopedia\nPossibility to replay Hidden Object Scenes and mini-games\n6 beautiful wallpapers for your desktop","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":18620,"name":"Vigil: Blood Bitterness","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76e/76e096005bb763638dbb65e89c9a1fb2.jpg","description":"Vigil: Blood Bitterness plunges you into the dark and disturbing story of an ancient civilization where you must reveal the secrets of your past and exact revenge on the Evil destroying your universe. Ritualistic killings and blood lust blur the line between your own kind and the Evil you seek to annihilate. Your ultimate goal is to free yourself from this tormenting place and understand the origin and the purpose of this never ending Evil.\nVigil is a stylized gothic horror adventure game that uses black and white imagery similar to Frank Miller's Sin City™ to create a unique visual that draws you deeper into the gruesome world of your character, Dehon. Avoid deadly traps, solve puzzles to unravel your past, and even devour the faces of your slaves for sustenance towards your ultimate goal of freedom.\nEasy point-and-click playability\nEngrossing story with deeply disturbed and complex characters\n3D graphics with revolutionary black and white art and dynamic camera angles\nChallenging puzzles to solve and reveal the mysteries of your civilization\nCompelling pre-rendered cut scenes to advance the horrific story\nA gallery of clues in text, pictures, videos and sounds\nSet up multiple player profiles","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Freegamer","platforms":[{"id":0,"name":"PC"}]},{"id":17621,"name":"Dark Ages","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/888/8889e690a1853d1d79a7652e1254c032.jpg","description":"Dark Ages was the first shareware game to support the Adlib & Sound Blaster music cards.  If featured a movie style soundtrack of eight unique songs and themes.\nEach volume of Dark Ages has its own unique appearance, with different goals, level designs and locations. Each volume has 10 huge scrolling levels packed with devious traps, creatures and treasures.Game Features\nBuilt in instructions\nSave and restore\nPermanent high scores\nSound on/off\nFlexible keyboard configuration\nThree skill levelsBonus InfoThe EGA/VGA graphics are colorful and stunning, with fast scrolling screens and high-speed animation. Dark Ages has such demanding graphics and animation that it requires an 80286 (or 80386) machine to run at proper speed, otherwise it may run too slowly. (NOTE: Dark Ages runs too fast on 486 or higher computers. You will need to slow them down to play).","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Scenario Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17244,"name":"Irrational Exuberance: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/793/793351cdb4b8ab0a6113fba99cd7abbd.jpg","description":"Irrational Exuberance is an experiment to probe the possibilities of full room-scale VR and the HTC Vive, unfolding organically as you discover and engage with deep space phenomena. Prologue is the first taste of the galactic fantasy, delivering you to a lonely asteroid in deep space, underneath comets and giant stars. Irrational Exuberance has been an audience favorite at Sundance and the Kaleidoscope tour and praised as a defining VR experience by the media for its use of space, sense and setting.\nThe full release, scheduled for late-2016, will feature dramatic interactions, deeply-immersive moments, and impossible vistas.\nFeaturing:\nUNCOMPROMISING DESIGN: Exclusively designed for room-scale VR interaction, Irrational Exuberance is a non-violent, organic experience that offers cinematic moments of space, solace and spectacle.\nAMPLIFIED SENSES: A highly tuned, evocative spatial audioscape takes audiences to the surreal depths of space, from crumbling meteorites to chiming ephemera to the distant hum of stars.\nHYPER PRESENT REALITY: Beautiful worlds, mysterious sensations, and nuanced interaction weave together to create a heightened sense and awareness of this alternate reality.\nCOMPREHENSIVE PREVIEW: A short, but impactful experience that foretells the events of the full Irrational Exuberance release.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Buffalo Vision","platforms":[{"id":0,"name":"PC"}]},{"id":14275,"name":"LostWinds 2: Winter of the Melodias","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/534d29272318e5c24de56fee5d535d13.jpg","description":"LostWinds 2: Winter of the Melodias is the follow-up to the award-winning title ‘LostWinds’.\nIn this new adventure players are able to instantly transform Mistralis between Summer and Winter, harnessing the brilliance of nature: frozen winter ponds and waterfalls become deep, teeming summer pools and chambers in which to dive and unlock secrets, enemies can be frozen or doused, and the very air itself used to form snowballs or moisture-laden clouds.\nOther amazing new abilities include the cyclone, which can be used to transport Toku, smash powerful enemies and even drill through the rocks of Mistralis’ diverse, richly interactive Chilling Peaks and Melodia City areas.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Frontier Developments","platforms":[{"id":0,"name":"PC"}]},{"id":13495,"name":"NeverEnd","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe1/fe18503c602afb5d040ac4bea40dcbcd.jpg","description":"NeverEnd is a Rogue-Like Dungeon crawler, where you, a simple adventurer suddenly wakes up in another dimension. Inside of this dimension there is no sun and the whole world is caved in. Enemies swarm you from left and right and you need to learn how to defend yourself.\nThe goal of the game is to escape this dimension. But in order to achieve that goal you'll need to upgrade your gear and become stronger. Use your powerful weapons and skill to beat hard enemies and the final boss. You are not alone in this dimension as strange men will help you achieve your goal along the way.\nWhile playing NeverEnd you'll come across Shopkeepers selling different items. You can find anything from Fire Swords, Swift Blades, Bows, Hooks with many more items to buy. There are also Farmers who sell their animals for mounting but that's not the only thing they do, you can tame enemies and make them fight for you aswell, this way you can strategies and set up a team for beating enemy hordes easier and faster.\nIn order to beat NeverEnd you need to have good gear and a lot of skill, use your items and shield wisely. NeverEnd is a hard game so stay tough and enjoy the game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Evgeniy Kolpakov t/a Sometimes You","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12736,"name":"PixelJunk Nom Nom Galaxy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab9/ab9c27cb274ef05a8f98e9af99b8e036.jpg","description":"From the award-winning developers behind PixelJunk Monsters, PixelJunk Eden, and PixelJunk Shooter comes a genre-blending mash-up of Soup-tacular proportions!\nWelcome to Soup Co., Astroworker! As an integral part of the Soup Co. family, your mission is to explore the remote planets in search of tasty ingredients to make the galaxies most delicious soups and then rocket them into the gullets of our hungry customers. But this isn't your typical soup kitchen - Astroworkers must battle against the planet's elements, alien plants and animals, and dastardly rival soup corporations! Build your base of operations with the help of your fellow Astroworkers and handy Soup Co. robots, make the galaxies most mouth-watering soups, then defend yourself from local wildlife and our rivals.\n#nomnomGALAXY is a sandbox-styled mix of platforming, base building, tower defense, and good old fashioned monster-stomping! You'll create huge factory-bases where you'll experiment with tons of ingredients, make hundreds of types of soups to feed the galaxy, and rise in the ranks of the Soup Co.! Each planet will have its own challenges, from poisons gas to killer tomatoes. Only the most adept of Soup Meisters will succeed!Key Features\nHundreds of different types of soups to discover\nExtensive soup recipe system that uses ingredients all of the planet's plants and animals\nTower Defense gameplay from the makers of one of the most acclaimed Tower Defense games on any platform, PixelJunk Monsters\nLiving planets that evolve as your base expands\nTons of robot helpers to automate factories, defend your base, and collect ingredients\nBattle rival soup corporations throughout the galaxy for soup supremacy!\nLocal split-screen co-op and up to 4 players online","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":11352,"name":"Masquerada: Songs and Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bae/bae9b578326aebed04a67265410a8859.jpg","description":"Navigate the masked deceptions and deadly magic of a vividly Venetian city in this fully voiced pause-for-tactics RPG.\nIn the turmoil-ridden Citte della Ombre, religion holds no sway. Only the songs sung of one’s deeds will carry an Ombrian’s legacy beyond death. Those who hold even the smallest morsel of power will make every effort to ensure their songs live on. Enter the Mascherines - masks that grant their wielders the power to channel the elements and cast destructive magic.\nThe Mascherines have perpetuated a culture of inequality between the power-hungry guildsmen known as the Masquerada and the impoverished lower classes, the Contadani. A prolonged civil war, ignited by Contadani rebels who steal Mascherines from the Masquerada, has only drawn scars of mistrust across the Citte since.\n\nOne of Ombre’s finest sleuths, Cicero Gavar, was exiled for a crime against the state five years ago, but he is now summoned back to Ombre to solve the mysterious kidnapping of the diplomat Razitof Azrus. As other members of the Masquerada join his investigation, all having their doubts about one another within this culture of deception, their faith will be pushed to the limit as a deeper conspiracy lurks in the shadows of Ombre.\nFEATURES:\nYour Fight, Your Pace: Use the tactical pause to control the rush of combat, position your party and plan their attacks by the second.\nA Game of Tag: Lay elemental magic tags upon your enemies, and activate the tags with another element for crowd-controlling status effects!\nVivid Comicbook Art: Feast your eyes on dreamy colours and environmental linework inspired by French comic artists, blended with stylized 3D characters for a timeless aesthetic.\nA Fully Voiced Tale: The drama at the heart of Ombre unfolds over 12 hours of narrative, fully voiced by VO heavyweights like Matthew Mercer and Jennifer Hale.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ysbryd Games Worldwide","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":7161,"name":"Krosmaga","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/635/635748dcc7177771b67d34f97136c695.jpeg","description":"Exclusive Expansion Gift\nTo celebrate the release  of KROSMAGA 1st Expansion on Steam, receive* 3 Necroms and Paladirs card packs\n*These packs are unlocked automatically in-game.\nAbout the Game\n--- THE CARD GAME OF THE GODS!...AND FOR ALL THOSE WANTING TO BECOME ONE. ---\nKrosmaga is a game of skill where the Twelve Gods of the Krosmoz universe settle their differences by pitting creatures, mortals, and demi-gods against each other in a battle of truly epic proportions! The game combines the deck-building strategy of a CCG with the excitement and challenge of a tower defense game in a divine setting where the stakes could not be higher.\n--- CHARACTERISTICS ---\n• BECOMING A GOD IS EASIER SAID THAN DONE! Play as a god and unleash your powers on the battlefield! The rules of the game are simple enough for mere mortals to understand.\n• MASTER YOUR DECK: Use the gods’ premade decks or create your own. You’re the master of your own strategy!\n• CONSTANTLY CHANGING: With hundreds of cards to collect that you can win, buy or craft, you will constantly be upgrading your deck!\n• CALL ON ALL THE HEROES OF DOFUS AND WAKFU...AND MAKE THEM BATTLE!\nThe warriors and creatures you’ll play come from all four corners of the Krosmoz, a multiverse rich in myth and legend. Take control of the heroes of video games, books, animated series , and even a movie (DOFUS: Book I - Julith).\n• RUTHLESS PVP BATTLES: Challenge friends and players from all over the world. There can be only one god!\n• TAKE ON SUPERHUMAN CHALLENGES: To keep things interesting, epic and surprising adventures await you in single player mode...\n• TAKE YOUR CARDS WITH YOU: Your card collection is linked to your Ankama account. Switch at any time from your computer to other supported devices with ease!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ankama Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]