[{"id":23628,"name":"Will Glow the Wisp","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af5/af5fc63cb3be1936a046b4b54c6a8271.jpg","description":"Will Glow the Wisp is the first melee bullet hell platformer without platforms, with a unique particle based visuals and movement mechanics.\nCampaign\nPlay vs. another players recordings\nBeat the Developer\nGlobal Highscore\nLots of Particles and Bullets\nYou are able to play against the Developer in Will Glow the Wisp, but only the best players will be able to handle this challenge. Do you want to give it a try?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PartTimeIndie","platforms":[{"id":0,"name":"PC"}]},{"id":10994,"name":"Scrap Garden","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/755/7557715b92e3db2914e73c4fccfa7fdc.jpg","description":"Scrap Garden is a charming puzzle platformer about the adventures of Canny, a lonely robot, who awakens in a post-apocalyptic world to find all other robots shut down and seized up. What happened to the City? Why did all robots stop moving? Did anyone survive except him? Little rusty Canny has to do all he can to find answers to these questions... and try to fix it all.\nExperience true 3D platformer gameplay inspired by genre masterpieces like Donkey Kong, Spyro the Dragon and Crash Bandicoot.\nEnjoy beautiful award-winning graphics in an adorable post-robocalyptic world with 6 unique locations filled with mysteries and adventures.\nTry out diverse gameplay mechanics, including tricky puzzles and refreshing minigames.\nChallenge mighty bosses and find the right strategy to beat all of them!\nDiscover a truly moving story, narrated by Bobby Beato, that will take you deep inside the conflict between nature and technology.\nDive into the atmosphere of an abandoned world with fascinating music by three composers.\nFind all hidden collectables to learn more about the world and unlock extra content.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alexey Davydov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":10075,"name":"Train Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8a/c8a231fb194a781ef2228505b1c1f0fb.jpg","description":"Train Simulator 2015 is a train simulation game developed by Dovetail Games. It follows Dovetail Games annual game release model.\n\n###Gameplay\nThere is no plot present in the game. The players participate in different singleplayer scenarios that are either preset by the developers or created by the community. The game also features a so-called free roam mode, where the players can choose whichever train they would like to use, attach carts of different types and explore the in-game world. \n\nThe game's train routes resemble the real ones that can be found in the United Kingdom, Ireland, Germany, and the United States. \n\nThe players handle all the aspect of the train on its route by walking in the cabin of the driving cart in a first-person view. The game features a realistic graphics and physics model. It is possible to pull all the levers, push all the buttons in a heavily detailed driving cart of any train. All the cargo and the passengers are detailed and animated by hand resulting in a substantial degree of realism. The game also features a dynamic weather system which drastically affects the gameplay. For example, a heavy storm can drive an old steam locomotive off the tracks.\n\nMultiple train types are present in the game, from the 19th century steam-powered trains to the most advanced modern magnetical levitation locomotives.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Dovetail Games","platforms":[{"id":0,"name":"PC"}]},{"id":28626,"name":"Plants vs Zombies Garden Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9cd/9cddf72caf9ca14267121975270149dd.jpg","description":"REQUIRES XBOX LIVE GOLD, SOLD SEPARATELY.  The Games on Demand version supports English, French, Italian, German, Spanish, Portuguese and Japanese.  Download the manual for this game by going to https://help.ea.com/en/tag/manuals and selecting your title from the Product drop down menu.  \"Plants vs. Zombies Garden Warfare digs into the trenches with an explosive new Co-op and Multiplayer action experience. Blast zombies and plants across a mine-blowing world that delivers the depth of a traditional online shooter blended with the refreshing humor of Plants vs. Zombies.  KEY FEATURES: 24-player multiplayer action: Choose your side, plants or zombies 4-player online co-op: Take on zombie waves and unique new bosses Customization: Personalize your favorite and new plants and zombies\"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":22128,"name":"Interkosmos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b01/b01237b19d38c2ed20f747a23cd7ba48.jpg","description":"Interkosmos is an arcady astronaut adventure in VR.\nEnter Zvezda, a fully interactive re-entry capsule heavily inspired by 1970's space technology where every switch, gauge, and mechanical bit could be relevant to your survival.\nGuide your capsule to a safe landing with assistance from NASA and Roscosmos, and pray nothing unexpected happens to your highly experimental Soviet spacecraft - now the centerpiece of a Cold War conflict rapidly escalating towards catastrophy.\nUltimately it’s you who must adapt on the fly, execute the right sequences and procedures, manage your power and life support systems, stay on course, and land in one piece; or discover all the interesting ways to die during re-entry.\nGood luck pilot!Featuring;\nAccessible, fun & challenging gameplay. Interkosmos is unlike any other VR game to date.  A fully interactive and sort-of-realistic-looking space capsule that reacts to your every interaction. It’s time to become the astronaut you always wanted to be!  A heavy emphasis on story and humor.  A unique aesthetic inspired by 1970s space technology and the Cold War theme. Replayability; Each successful playthrough offers about 30 minutes of gameplay, but how many ways can you find to die during re-entry?  A branching storyline; the fate of the world is in your hands! Great sound effects, super satisfyingly clicky buttons, professional voice acting, & binaural sound design.  Interkosmos is made with Unreal Engine 4About Ovid Works;\nWe're a small team of developers making fun, story rich, and immersive games for PC and VR. Our passion is telling expressive stories through fun moment-to-moment gameplay.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ovid Works","platforms":[{"id":0,"name":"PC"}]},{"id":1258,"name":"CounterSpy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86b/86b4df751b6781cd460b7f784e042e5f.jpeg","description":"CounterSpy is an indie stealth game developed by Dynamighty.\n\nThe game is inspired by the 60s style spy movies such as the James Bond series or The Man from U.N.K.L.E. Set in the Cold War, the player controls a spy that infiltrates the military bases of rival countries. \n\nThe game is a 2.5D side-scroller but the players are able to target their weapons in a three-dimensional space. The main objective is to prevent the enemy from launching nuclear missiles. The players have to be cautious as getting detected affects the DEFCON status of a country in which the player is at the moment. If the player gets detected too often, the country enforces DEFCON 1 and launches uses its nuclear weaponry. The players can abort the launch if they make it in time, which results in completion of the level. \n\nThroughout the levels, the players can collect intelligence, which serves as an in-game currency. Intel is spent to buy ammo, upgrade your weapons or buy new ones.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":914789,"name":"Hi-Fi Rush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/62f/62f71917e64e913f2a893e7373319c60.jpg","description":"Feel the beat as wannabe rockstar Chai and his ragtag team fight against an evil megacorp with raucous rhythm combat! From Tango Gameworks comes Hi-Fi RUSH, an all-new action game where the world syncs to the music.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Tango Gameworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":19645,"name":"Worms Blast","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/33c/33c4f185c9f312cfcf5243d496178b11.jpg","description":"Worms Blast is a puzzle game developed by Team 17, a spin-off to the artillery tactical games series Worms. \n\n###Gameplay \nThe gameplay shares many similarities with Puzzle Bobble. You control one of several characters most of which are animal weapons from the previous Worms games.\nYour character sits in a boat floating on water and has to clean the playfield from multicolored hexagons hanging on the top. To do so, you can use a variety of weapons, including the iconic Worms’ bazooka, grenades, dynamite sticks, shotgun and many more. With every shot, the weapon changes its color. Shooting blocks of the same color make them along with all color matched blocks connected disappear. If the block is a different color from the weapon, the block gets recolored. \n\n### Game modes  \nThere are three single-player modes: Puzzle, Tournament, vs. CPU; and eight multiplayer modes: Deathmatch, Don’t Drop Em, Star Collection, Tide Trial, One Line For Two, Star Race, Survival and Fight. In multiplayer, the playfield is divided into two separate parts for each player.\nThe barrier between them periodically opens, allowing the player to shoot each other. The puzzle mode consists of 60 levels with different challenges. Completing them unlocks new characters. Each character in the game has its unique characteristics.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":19603,"name":"Intrusion 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c0/0c0a2dd166cbeeaba326dc2b2958782f.jpg","description":"Intrusion 2 is a single-player Run and Gun, reminiscent of games like Metal Slug or Contra. It was a finalist of Independent Games Festival 2013 in Technical Excellence category. And for the game that is a direct sequel to 2008 free to play the flash game mostly created by one man, it is a no small feat. \nPlayers will have to lead the nameless protagonist to battle against enemy war corporation on the distant ice-covered planet. Sci-fi style of the setting creates an opportunity to present a lot of unique mecha-enemies, whose behavior is based on physics and procedural animation, which results in ragdoll physics for the 2D sprites. Intrusion 2 is a relatively short game that has only nine levels. And in order to compensate, the stages are scaled and filled with enemies to represent an old-school gauntlet-like experience. Some of the enemies can be mounted, giving the players some extra mobility. At the end of every three levels players will have to go through a multistage boss battle, and with every difficulty level the game will ramp up the number of enemies and threats on the hard mode.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Aleksey Abramenko","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19475,"name":"Velvet Assassin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfb/cfb96f5490b8cf91e9952a8416a71245.jpg","description":"###The hero\nThe game is inspired by the real story of the British spy Violette Szabo. The owner of the St. George Cross, Violetta successfully fulfilled the tasks of the British special services. She was caught and killed in a concentration camp during the war. The player will go on a stealth adventure in the era of World War II and take control of Violette Summer, which runs deep behind enemy lines.\n\n###the story\nThe story tells of a girl from Dorset, Violette Summer, who lived happily with her family. But the war was all the same, and in the darkest times for the country, Violette joins the secret services of Britain. The game consists of secret missions and sabotages in which she took part. The action takes place in war-torn Europe: the agent is operating in Poland, Germany, and France.\n\n###Key features\nFrom gameplay the point of view, the game is practically no different from other representatives of the genre: from the very beginning, Violette will have to hide in the shadows in order to survive and move through levels. The user interface helps the player to navigate in terms of how visible his/her actions are: it shows the silhouette of Violette, which can be in three states - each one representing how well the agent is hidden. The game does not provide a complex combat system, but the ability to detect a rebuff to enemies is available. Also, players can upgrade agent’s skills on three branches: Stealth, Morphine or Strength.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Replay Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":299561,"name":"American Fugitive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c9/9c906326588165ed84e13d7cc9bb0d65.jpg","description":"American Fugitive is a modern take on classic sandbox action offering a new 3D top-down open-world single-player experience. Developed by Fallen Tree Games, the two studio founders have extended AAA backgrounds; including titles such as TimeSplitters, Crysis, Black, and Goldeneye 007: Reloaded.\nWelcome to Redrock County, a sleepy American town with a booming criminal underbelly.\nYou take the role of Will Riley. No angel for sure - but not a killer. Yet the cold-blooded murder of your dad is the crime they locked you up for. Fuelled by grief and a burning desire for vengeance, you’ll bust out of jail intent on finding the real culprit.\nOnce outside, you’ll need to blend with the townsfolk to avoid recapture. Establish contact with the criminal underworld and stay one step ahead of the police dragnet.\nSet in the deep south of the 1980s, American Fugitive is a love-letter to the classic movies and games of old.It’s a race against time, and JUSTICE AIN'T ALWAYS LEGAL.\nKEY FEATURESA modern take on classic sandbox action – Rediscover the joy of top-down carnage with stunning 3D graphics and destructible environments, dramatic storytelling and epic car-chase mayhem.\n\nA mature action game based on an original story – Unravel a plot of mystery, deception and corruption, full of twists and turns, inhabited by a motley cast of law-breakers and law-enforcers.\nA stunning open-world environment - Explore Redrock County on foot on by car - a beautiful and vibrant slice of 80s rural USA.\nChoose the life of a felon - Rob houses, steal cars, arm yourself to the teeth. Just don’t get caught!\nPerfect your driving skills – Put the pedal to the metal and test yourself against time trial challenges and stunt jumps dotted throughout the world, using any of the numerous vehicles.\nA wealth of activities – Whether you’re undertaking jobs for the criminal underworld, uncovering hidden stashes, looting houses, sticking up stores, or fencing fine art, remain vigilant. The crooked cops will stop at nothing to see you back behind bars!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Fallen Tree Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":22794,"name":"Neverwinter Nights Diamond","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37d/37d0128371ed828fea8ba336ed78e181.jpg","description":"Experience one of the most popular role-playing adventures of our time, a journey that has thrilled millions. Inhabit dreamlike worlds of myth and mystery. Boundless lands of deadly creatures, foreboding omens and bold heroism.\nThis game puts you at the center of an epic tale of faith, war and betrayal, all the while staying true to the pen-and-paper role-playing tradition.\nNeverwinter Nights - A world without limits!\nThe Diamond Edition includes the original Neverwinter Nights and three official expansion packs: Shadows of Undrentide, Hordes of the Underdark and Kingmaker.\nA fast-paced RPG with an intuitive interface, suitable for new players and RPG veterans alike.\nA classic RPG experience that will keep you entertained for over one hundred hours!","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"BioWare","platforms":[{"id":0,"name":"PC"}]},{"id":18694,"name":"Painkiller Overdose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f6/5f62252dc22176f33db0e71593935481.jpg","description":"Painkiller Overdose is a first-person shooter, the first stand-alone expansion for 2004 People Can Fly game Painkiller. \n\n###Plot \nUnlike the original game, the main protagonist in Overdose is not Daniel Garner, but half-angel, half-demon Belial who seeks revenge for his imprisonment and rejection by both hell and heaven. \n\n###Gameplay \nThe gameplay is very similar to that of the original game. The game is divided into sixteen levels.\nThe player must get through each of them slaying hordes of enemies. Most of the levels consist of the arena-like room where you have to defeat waves of monsters to progress. Some levels end up with battles against huge Bosses that require player shoot specific parts of their bodies. The game takes place in different areas of purgatory. Some of them resemble specific historical settings like ancient Rome, ancient Egypt or medieval Japan. Completing specific tasks awards player with tarot-cards that give Belial special powers. \nThe Belial’s weaponry is different from that of Daniel through most of the weapons are similar in mechanics to their counterparts from the original game. Every weapon has at least two firing modes. For example, Bonegun can act like a typical shotgun or turn enemies into stone; razor cube can rotate metal projectiles at high speed, draw enemies to Belial or slowly shoot metal projectiles.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Mindware Studios","platforms":[{"id":0,"name":"PC"}]},{"id":11670,"name":"Card Hunter","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/769/769311849b523438fefa8b5e0535e3f5.jpg","description":"It is an online collectible card game which mixes card play, deck building, tactical combat and fantasy role-playing in its own original way. You have your cards, miniatures, dice and snacks, and a possibility to enter a new world of adventure on the tabletop of your Game Master, Gary.\n\n###Single-player campaign\nBuild your party and set forth on a grand adventure. This adventure will test your deck-building skills and tactical prowess - you will fight with Black Oozes, savage War Monkeys and many others.\n\nThe battlefield is based on a grid. Make right turns, playing your cards to defeat your enemies and get the reward - experience and loot. \n\n###Multiplayer Card Hunter - a challenge that never ends\nAre you ready to share casual games, ranked matches or regularly scheduled leagues with the other players? Do you want to conquare the top of this season? Can you became a part of the Graveyard Gambol league together with your undead minions?\n\nIf you just need a help of couple of friends to pass through the dangers of Cardhuntria you may take this challenge cooperatively.\n\n###And more\nAfter finishing the core campaign, you may try out the adventures of Omin, Binwin and Jim from Acquisitions Incorporated with an exclusive story.\n\nThere are also all new Expedition to the Sky Citadel set and the challenge of prehistoric monsters and intelligent weapons in the Attack of the Artifacts.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blue Manchu","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":327269,"name":"eFootball PES 2020","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ed/2ed38a102fe66a0ea98a8e09c660a458.jpg","description":"Pre-order now to receive exclusive myClub content for PES 2020*:\n• Andres Iniesta - 10 match loan\n• 1000 myClub coins\nThe STANDARD EDITION also comes with the following myClub content*:\n• Ronaldinho 2019 - 10 match loan\n• Lionel Messi - 10 match loan\n• Premium Agent (3 Players) x 10 weeks\n• 3 Player Contract Renewals x 10 weeks\nPES 2020 LEGEND EDITION comes with the following myClub content*:\n• PES Legend Player\n• Ronaldinho 2019\n• Lionel Messi 10 match loan\n• Premium Agent (3 Players) x 30 weeks\n• 3 Player Contract Renewals x 30 weeks\n*The above myClub content can only be claimed on the account used to purchase the game\nNew features:\n• GAMEPLAY: New dynamic dribbling skills, new first touch techniques and finely-tuned ball physics, all developed in close consultation with renowned midfielder Andrés Iniesta\n• MATCHDAY: Pick a side and join forces with newcomers and veterans alike in a grand struggle for dominance in this new online competitive mode\n• MASTER LEAGUE: A completely revamped ML experience awaits — featuring a new interactive dialogue system, an overhauled menu design and a more realistic transfer market realized through improved data integration","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":17659,"name":"The Testament of Sherlock Holmes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22e/22e75ceb294e7822f028a3ec2e92eb3e.jpg","description":"The Testament of Sherlock Holmes is a quest game developed by Frogwares. It is the sixth installment in the Sherlock Holmes series.\n\n###Plot\nSherlock Holmes, the famous investigator from Baker Street, falls under the suspicion of committing crimes. The player has to investigate several cases, that do not appear to be linked between each other at first playing as Sherlock Holmes himself and his sidekick Doctor Watson. The player has to decide for himself who Sherlock actually is - a friend, a savior, a genius detective or an unusually witted law offender.\n\n###Characters\nThe main characters in the game are Sherlock Holmes and Doctor Watson. Frogwares continues to follow their tradition of using their own portrayal of the protagonists, however, this time their appearance was reworked, as the protagonists now appear to be much younger.\n\n###Gameplay\nThe gameplay revolves around arriving at the crime scene, examining the scene, finding clues (several items are used to help the players, such as a magnifying glass), talking to different characters, witnesses, interrogating the suspects and interacting with items. The players often have to make assumptions in a mini-game that simulates the deductive method that Holmes uses.\n\nThe game features both the third-person camera, that is used by default and the first-person one. The players are free to choose whichever one they like at any time.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":17379,"name":"Sid Meier’s Ace Patrol","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce7/ce7d6b1018d907d7a1e2addd87079c95.jpeg","description":"The first part of the strategic turn-based game about planes from the famous game designer Sid Meier. The player takes command of one of the game nations and takes part in battles in the skies of Europe. The game has 30 unique aircraft for completion more than 180 missions.\n\nThe game moved from iOS to PC. On mobile devices, it is available free of charge in a reduced version: for additional campaigns, players have to pay separately. On the PC, the buyer receives a full-fledged product. Also, higher resolution textures were added to the PC version of the game.\n\nA simple visual style and attention to detail, which is company Firaxis famous for, will help to master the game. All battles take place in a turn-based manner, the action takes place in the skies of Europe, wrapped in the fire of the First World War. The battlefield is divided into hexagons, through which you can move units. Unlike other turn-based strategies from Sid Meier, in Ace Patrol, the emphasis is on more subtle control of the main units of the game - aircraft. The story missions will have to be held alone, but with friends, you can fight in an accessible multiplayer.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2K","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":404,"name":"Uncanny Valley","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/024/024f0bc84fe5aefc4868aa8fa1db14a4.jpg","description":"Uncanny Valley is an indie horror game about insanity and supernatural.\n\n###Style and atmosphere\nUncanny Valley is made in the simple 2D pixel-art style with no face animations. Despite its limitations, the game recreates the gloomy atmosphere of supernatural thrillers like Silent Hill games and such TV series as Twin Peaks and Stranger Things. It is set in the cold, rainy area during autumn and winter. Uncanny Valley features dark, claustrophobic levels and is set to creepy horror synth / dark ambient music.\n\n###Plot\nThe plot of Uncanny Valley is nonlinear and strongly depends on the player's choices. The game itself recommends the player to replay it several times to discover all possible plotlines and endings.\n\nThe protagonist is Tom, a security guard at a secret facility. His only colleagues are Buck, an obese guard, and Eve, a young caretaker who is Tom's love interest. His mental health is far from perfect, as Tom suffers from narcolepsy. He often falls asleep and loses the edge between reality and fantasy. Some of the events in the game are actually the main character's illusions and dreams.\n\n###Gameplay\nThe player leads Tom as he does his daily watchman's job. By night, he has to patrol the secret research facility, eventually learning its dark secrets. Occasionally, Tom will fall into his nightmares and have to run away from the shadowy enemies. Tom cannot sprint for too long before his stamina runs out. However, in Uncanny Valley, the protagonist cannot die and there are no Game Overs.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":494393,"name":"Monster Hunter Rise","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dbb/dbba6100aae179b5f24052c9141d426d.jpg","description":"Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It’s been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.\r\nHunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying ‘Wire Action’ and your canine companion ‘Palamute’ will add exciting new layers to the already robust combat that Monster Hunter is known for.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":46160,"name":"Dandara","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/839/83924d4b0be37f607d14a5c463dc0e47.jpg","description":"The world of Salt hangs on the brink of collapse. The citizens, once free spirits, now stand oppressed and isolated. But not all is lost, for out of this aether of fear arises a heroine, a ray of hope. Her name is Dandara.\n\nWelcome to a unique 2D metroidvania platformer full of mystical creatures and boundless exploration. Defy gravity as you jump across floors, walls, and ceilings alike. Discover the mysteries and secrets hidden throughout the world of Salt and its diverse array of characters. Empower Dandara for combat and survival against enemies bent on oppression.\n\nAwaken, Dandara, to bring freedom and balance to this directionless world.\n\nKey Features:\n• **INNOVATIVE CONTROLS** - Built natively for both touchscreen and gamepad input, movement and combat interact smoothly and seamlessly.\n• **BOUNDLESS EXPLORATION** - Traverse across the esoteric world of Salt through fast and fluid jumps off any surface, unhindered by gravity, in lovingly crafted environments.\n• **CHALLENGING PROGRESSION** - Use a combination of speed & skill, wits & reflexes, to solve puzzles, earn powerups, and access areas previously unreachable.\n• **BEAUTIFUL AND IMMERSIVE WORLD** - A visual and auditory wonderland comes to life through gorgeous handcrafted pixel art and original soundtrack compositions.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Raw Fury","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":852,"name":"Silence","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/006/006dffebef63ce630ca3cc4f6b979bcf.jpg","description":"Additional DLC Content available!\nAbout the Game\nWar rages on. During an air raid, 16 year old Noah and his little sister Renie seek shelter in a bunker. There, not only are they protected from the deadly bombardment, but are also at the crossroads of a world between life and death: Silence. When Noah’s sister gets lost in Silence, he is forced to venture into this idyllic yet threatening world to find her.\nSilence, however, bears its own scars of war and suffering. Dark creatures haunt towns and cities and ravage this once serene place between worlds. Only a small band of rebels stands against the looming menace. Now it is up to the siblings to save Silence and its fantastic inhabitants from impending doom and thus also save their own lives.\nJoin Noah and Renie on their exciting journey through Silence where an emotionally gripping story of contrasts between serenity and danger unfolds. Meet fascinating and likeable characters like Spot, the magical caterpillar who helps Noah and Renie on their way through Silence. And witness when the siblings discover that the only thing that can save them is their love for each other.\nElaborately designed 3D characters and opulent 2D backgrounds\nThree playable characters\nThere will be exciting new characters, but also a reunion with old friends","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":11018,"name":"STASIS","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a2/8a27d8a797aeb3bda29550b884b39d40_XAbOely.jpg","description":"Linux Beta now available - Check Discussion Forum for details. VOTED BEST ADVENTURE GAME OF 2015!\nSTASIS is a point-and-click, sci-fi - horror adventure game played from a unique isometric perspective. STASIS intertwines a gruesome narrative with retro adventure gameplay. Combine items, interact with computers and solve puzzles while experiencing the gritty atmosphere.\nIn the distant future, aboard a seemingly abandoned spacecraft, John Maracheck awakes from stasis. He must push himself to new physical and emotional limits and unravel the mysteries around him.\nJohn is in tremendous pain, his wife and daughter are missing, and time is running out as the Groomlake plunges further into the swirling blue methane clouds of Neptune.\nKEY FEATURESChallenging and realistic puzzles\nCinematic AAA music composed by Mark Morgan (Fallout)\nHighly detailed 2D isometric graphics\nClassic point-and-click interaction\nMultiple characters to engage and work with\nJohn can (and will) die in the most horrific ways imaginable\nSpecial objects can be used on John himself to end it all\nA holographic stripper\nSTORYA compelling dystopian narrative intertwines this mature adventure tale. Access computer terminals and engage with the environment like never before. A great deal of character backstory and information can also be found on the PDAs littered around the corpses aboard the Groomlake.\nGAMEPLAY Click, read and interact to explore the dark corners of the Groomlake, to gather inventory items and clues to help solve puzzles to progress further.\nGRAPHICS STASIS has an isometric visual aesthetic that brings a new angle to adventure games. Each scene has been individually detailed and created to craft the perfect backdrop for the gloomy adventure. While uniquely isometric, be ready for riveting cut scenes.\nVOICE ACTING The story unfolds with professional voice acting and a rising score - emotive on both accounts. The talented voice artists build up the depth of each the characters that you'll meet.\nMUSIC The legendary Mark Morgan (Wasteland 2, Fallout) has created a moving score, steeped in fear and emotion. Additional music has been penned by Daniel Sadowski (Counter-Strike: Global Offensive, Warhammer) who has given the soundtrack a unique cinematic edge.\nSTASIS has lovingly been crafted by Christopher Bischoff for the past 5 years. In 2013, a successful Kickstarter aided in the further development of the game.\n[BEST ADVENTURE GAME 2015] http://www.adventuregamers.com/articles/view/29966/page17","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"THE BROTHERHOOD","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":450239,"name":"Kingdoms of Amalur: Re-Reckoning","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/31c/31c3bc7e7296ac5ec6cca8407cd992e4.jpg","description":"The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston, comes Kingdoms of Amalur: Re-Reckoning. Remastered with stunning visuals and refined gameplay Re-Reckoning delivers intense, customizable RPG combat inside a sprawling game world.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Kaiko","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":528768,"name":"Persona 5 Strikers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/161/16107bc17254244531927450ad9716a7.jpg","description":"Strike Back!\n\nJoin the Phantom Thieves and strike back against the corruption overtaking cities across Japan. A summer vacation with close friends takes a sudden turn as a distorted reality emerges; reveal the truth and redeem the hearts of those imprisoned at the center of the crisis!\n\nJump into the stylish world of Persona in an all-new story\n\nDynamically control your team during explosive action combat\n\nBattle across Japan in an epic road trip","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Atlus","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":53445,"name":"Need for Speed: Underground","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7dd/7dd30ec2b261fa66c3567ddd845ec649.jpg","description":"Need for Speed: Underground is the seventh installment in the Need for Speed series, and was developed by EA Black Box and published by Electronic Arts in 2003. It is the first game in the series to use the THX technology. Two different games were produced, one for consoles and Windows, and the other for the Game Boy Advance.\nUnderground rebooted the franchise, ignoring the previous Need for Speed games which featured sports cars and exotics. It was the first game in the series to offer a career mode featuring a storyline, and a garage mode that allowed players to fully customize their cars with a large variety of brand-name performance and visual upgrades. All races take place in a generic city at night called Olympic City, though the city bears some resemblance to New York City, San Francisco and Los Angeles. Rather than exotic cars, Underground featured vehicles associated with the import scene. Underground was commercially successful, and inspired a sequel.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Electronic Arts Black Box","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"}]},{"id":22748,"name":"Septerra Core: Legacy of the Creator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/046/046454afa05892fb9f46ca60b422f8b1.jpg","description":"Enter a world where the laws of nature work in strange new ways, allowing continents to orbit at different elevations around the planet. Living battleships float overhead and Junk Pirates roam the darkness. This is a world whose very Core is a living computer, quietly watching over the fruits of its master’s creation.\nOn the Outer Shell Layer above, the ancient society of the Chosen live an extravagant lifestyle, consuming mass amounts of energy and dumping their waste onto the Layers below. They have discovered secrets about the world in which they live, and begin a descent towards the inner Core, caring not who gets in their way.\nFull game title:\nSepterra Core: Legacy of the CreatorA unique mix of Japanese RPG with a steampunk atmosphere\nA whopping 100 hours of gameplay with a very intriguing storyline\nExciting mechanics that mix real-time and turn-based combat system","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Valkyrie Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":51487,"name":"Bad North","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c33/c3316ad8dac378244c48c1d93377e773.jpg","description":"Your home is under attack. The king is dead at the hands of Viking invaders. Hope is a distant glimmer in the fog, fading fast with every passing moment. As you rise to take your father’s place as ruler, it will fall to you to stage your defenses. But make no mistake – this is no fight for victory, but a desperate grasp for survival.\n\nBad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island. Everything is at stake: fail, and watch the blood of your subjects stain the ground red.\n\nIt’s charmingly brutal, with beautiful procedurally-generated islands and adorable soldiers juxtaposed against the blood-stained realities of war. You control the broad strokes of the battle, giving high level commands to your soldiers who try their best to carry them out in the heat of the moment. It’s accessibly deep, with simple player inputs masking a dynamic combat simulation that make it inviting to new players while challenging veterans.\n\nKeep fighting, warriors. Not for power or riches or glory, but for hope of peace to come once again in the harsh lands of the Bad North.\n\nKey Features:\n• REAL-TIME TACTICS ROGUELITE: Position and relocate your troops to fend off the Vikings, who each have their own counters to the threats you pose. Pick your battles and plan your evacuations carefully! Lose a commander and they’re gone forever; lose everything, and it’s game over!\n• INTELLIGENT UNIT CONTROLS: You command the broad strokes of your defenses and monitor positioning — your soldiers do the rest, navigating and engaging intuitively in response to the situation at hand.\n• PROCEDURALLY-GENERATED ISLANDS: Each island is both stylistically charming and unique in its layout. Plan your strategies around every nook and cranny, for you only get one chance to save them from the enemy invasion.\n• UNLOCKABLE UPGRADES: A stronger, smarter defense leads to greater rewards. Use these to develop your subjects from a ragtag militia into seasoned warriors.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Raw Fury","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":25080,"name":"Super Mario Bros.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/154/154fea9689109f26c49c6a2db6263ef9.jpg","description":"Mario and Luigi star in their first ever Mushroom Kingdom adventure! Find out why Super Mario Bros. is instantly recognizable to millions of people across the globe, and what made it the best-selling game in the world for three decades straight. Jump over obstacles, grab coins, kick shells, and throw fireballs through eight action-packed worlds in this iconic NES classic. Only you and the Mario Bros. can rescue Princess Toadstool from the clutches of the evil Bowser. \r\n\r\nFor more than 25 years, the Super Mario series has conquered the charts and won the hearts of fans the world over. Now you can discover - or rediscover - the original game that made Mario a household name.\r\n\r\nRun and jump with Mario or Luigi through caves and castles, down pipes and across platforms, and face off against Bowser to rescue your beloved Princess Peach.\r\n\r\nIt may be more than a quarter of a century old, but Super Mario Bros. is still as enchanting as ever!","review":"","timePlayed":0.0,"releaseYear":1985,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"NES"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"SNES"},{"id":0,"name":"Nintendo 3DS"}]},{"id":12470,"name":"Age of Mythology: Extended Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a19/a19a134966d881e0e038b8d52ed05093.jpg","description":"Age of MythologyThe classic real time strategy game that transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortals.\n\nUse mythological creatures like Minotaurs and Cyclopes to bolster your armies' strength. Call upon the gods for assistance in flattening enemy towns with meteors or scatter opposing troops with lightning storms.\nThe Extended Edition includes:\nAge of Mythology\nAge of Mythology: The Titans\nGolden Gift Campaign\n\nNew in the Extended Edition:\nImproved Visuals\nTime of Day\nImproved water\nShadows\nBump / Specular maps\nGlobal Lighting\nAntialiasing & Ambient OcclusionFull Steamworks Integration\nWorkshop mod manager\nMultiplayer\nAchievements\nTrading Cards\nLeagues / Badges / Events\nCloud saves\tExtended Features\nTwitch Integration\nTreaty Mode\nEnhanced Observer mode","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ensemble Studios","platforms":[{"id":0,"name":"PC"}]},{"id":28547,"name":"Battlefield: Bad Company","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aeb/aeb33772a46dfe88fa9bd2f93068c91c.jpg","description":"Battlefield Bad Company is unique in the series \"Battlefield\" in that it features a full single-player campaign with characters. The previous titles were mostly focused on multiplayer with large numbers of players.\n\nThe game is retaining the vehicular and large-scale warfare but emphasizes squad-based combat.\n\n###The First Russo-American War and the private campaign of Bad Company\nSerdaristan, a small Caucasian country, became a place for a big war between Russia and the United States. First in Serdaristan, then in the Middle East, in the town of Sadiz on the coast of the Caspian Sea, the 222th Battalion, also known as the \"Bad Company\", puts itself under bullets. The name \"Bad Company\" is not accidental - the detachment consists of people who are best able to deliver problems.\n\nOne of the columns of the Bad Company was destroyed when it was sent to the battlefield. In investigating this case, the Bad Company's soldiers find out that they are not opposed by the Russian army, but mercenaries to whom Russia pays gold. Since then, the Bad Company has been fighting not only for the victory and glory of its country, but also for the sake of gold, which can be obtained in the pockets of defeated opponents.\n\n###The Newby and the Team\nPreston Marlowe is the main protagonist of the game. He just came to the Bad Company - just before the Bad Company found a new goal for itself - gold.\n\nSergeant Samuel D. Redford is the commander of the Bad Company and the only one who came there as a volunteer. He just likes to fight.\n\nGeorge Gordon Haggard, Jr. - has an explosive nature. And he knows everything about explosives.\nTerrence Sweetwater - smart ass.\n\n###Gameplay\nThe player acts with one main weapon and another, used in the second turn. In addition to this, there are grenades, a knife and portable explosive devices. The player always has information about the number of remaining ammunition. If vehicles are not completely destroyed, they can be repaired any number of times. \n\nMilitary vehicles in the game are sufficient: infantry fighting vehicles, armored cars, tanks, attack helicopters, patrol boats, mobile anti-aircraft weapon system.\n\nFor the first time in the Battlefield games line, the Frostbite game engine is used - 90% of the environment can be destroyed. Destruction is subject to almost everything: trees, grass and bushes, vehicles, other players and even the ground itself. Lighting is adjusted for changes caused by destruction.\n\n###More and more\nGold Edition\nThe main feature of this edition is that it immediately makes available those types of weapons that are usually unlocked after reaching level 25.\n\nFind All Five\nThis addition allows you to unlock five types of weapons that are not available in the main game - the F2000 machine, the USAS-12 automatic shotgun, the M60 machine gun, the QBU-88 sniper rifle and the Uzi submachine gun with the silencer. For this purpose, special codes are given on the official website of the game.\n\nCommunity Choice Map Pack\nThis is a set of four new maps for the \"Conquest\" mode.\n\nBattlefield: Bad Company 2\nA direct sequel.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":9457,"name":"America's Army: Proving Grounds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c3/1c3bcb76d03f320824ea7638cddddb6c.jpg","description":"America’s Army Proving Grounds is a free military game provided by the U.S. Army. The game is a part of America’s Army series. \n\n###Plot \nThe player performs as an infantryman, a part of a Long Range Combined Arms – Recon unit. The plot is based on the U.S. intervention in the Ostregal Islands as a call for defending the RDO Government which was struck by the Czervenians. The U.S. forces landed on the Islands to engage in police action and reconnaissance operations. \n\n###Gameplay \nThis is a classic first eye tactical shooter. The player is given certain tasks to perform as a part of the unit.\nThe aim is to stay alive in campaigns and fulfill each task. It is possible to change the character’s appearance even though the customization system is quite small. There are a few weapons including M4, M16, standard sniper rifle and shotgun. Maps are not too huge which makes it easier to go through a match. The maps vary in landscapes and size. Each one provides its benefits: it is possible to hide behind the trees in the forest mode or hole upon the earth in the field. The player is free to choose the very own tactics, be it the perfect stealth, merging in the terrain, or be it the classic get-through shooting campaign. The gameplay includes medical help; if the player is injured, it is possible to bandage yourself or wait for help.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"U.S Army","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":414,"name":"Pinball FX2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/793/793f50cc86bce0713d494c5ec5e6563f.jpg","description":"Pinball FX 2 is a traditional pinball game with a lot of adjustable options and an online multiplayer.\n\n###Gameplay\nThe basic rules of the game are exactly the same as for any pinball simulator. The player launches the ball to a diagonal table and watches as it randomly bounces back and forth. The player can only control the flippers in the lower part of the screen and uses them to prevent the ball from falling off the table. The goal is to hit certain elements with the ball to achieve a higher score before the ball falls off. Different tables have different layouts and may introduce additional rules, such as a player losing part of the score every time he or she loses the ball.\n\n###Tables\nThere are more than 70 tables in Pinball FX 2. Some of them are available from the start, and some can be downloaded for free, while others the player has to purchase. Each table has a theme to its design, such as Biolab, Buccaneer, or a popular franchise like Alien or Star Wars.\n\nThere's Operators menu that lets the player customize any table he or she owns. Customization includes allocation of table elements and special rules. For example, the player can adjust certain elements to appear only after a certain amount of points is gained.\n\n###Multiplayer\nPinball FX 2 includes several multiplayer options, both online and local. In the local mode, the players use the split screen. To win in the multiplayer mode, a player has to score a specified amount of points before his or her rival.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Zen Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":389054,"name":"Iris and the Giant","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/75c/75c086892cbf0aed952293f440a935a4.jpg","description":"Iris and the Giant is a fusion of the roguelike, RPG and CCG genres. You play as Iris, and will discover her psyche and anxieties. Build your deck\nWith every encounter, unlock new cards and earn points to boost Iris. Each attempt makes you stronger, and lets you go further!\nA poetic, melancholic story\nThroughout the game, you can uncover fragments of Iris’ memories, giving you new insight into the reasons behind your adventure in her mind.\nFeatures Deckbuilding: build your deck as you progress. Choose the best options for your long-term strategy\nA touching adventure, with a lot of care put into the graphics and visual setting\nCustomisation! The game is packed with choices in how to specialise your character, your deck, and your playstyle.\nA progressive difficulty curve that makes the game accessible to all, but offers a challenge to even the most hardened of players.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":60658,"name":"Monster Prom","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f59/f59e0d74e6d790ab9dacd7276c3e1d42.jpg","description":"Content Caution\nAlthough it hasn’t been rated yet, Monster Prom features mature themes, naughty words and some objectively bawdy scenarios, not suited for the sheepish or the faint of heart. Please bear this in mind before playing.\n--\nThere’s only 3 weeks left before prom and you haven’t got a date yet..and you’re a monster. But that’s okay ‘cause at your high-school everyone else is too! These are the stepping stones into the world of Monster Prom, a one-to-four player competitive dating sim that has you thinking: I never knew I was into that!\nChoose your own adventure and get all the way to your special monster’s heart before anyone else does, take personality quizzes to determine your stats, get into all kinds of funny and absurd situations to seduce your sweetheart and find out more about yourself than you or your friends ever knew.\nPlay to your strengths to earn better rewards, discover and unlock items that boost your chances at your favourite fiend’s fondness and fight the good fight all in the name of the thing high-schoolers dream of: not going to the prom alone.\nGrab up to three friends or play by yourself, enjoy the beautiful art, the witty dialogue and be prepared to make hard choices because at the end of the cruel, cut-throat world of Monster Prom there are only two types of people: lovers and losers. Being a monster is hard, but getting a date for prom is even harder!\nCompetitive dating sim\nNothing makes the heart grow fonder than a little competition. Set your gaze on one of the sweethearts, but if you share your romantic tastes with your friends, be ready for some stiff competition.\nFantastically funny writing\nAll's fair in love and war, except maybe taking yourself too seriously. Through whimsical, postmodern humor, written by Cory O’Brien, Maggie Herskowitz and Julián Quijano, there is no topic Monster Prom won’t make fun of, including itself.\nGorgeous art\nThere’s never a dull moment while exploring the beautifully crafted world and characters drawn by Arthur Tien.\n1000+ funny and absurd situations and hundreds of events\nGet into the groove of the local monster high-school through hundreds of events that will branch into 1000+ possible situations, all with multiple outcomes.\nCouch Multiplayer for one-to-four people\nPlay by yourself, with a significant other or with your favourite group of friends.\nEasy to pick up and play\nNo learning required, just have your heart strings ready for tugging.\nCharacters easy to fall in love with\nWith 6 fully fledged lovable classmates at your fingertips, go ahead and meet, pick and find out just what makes them tick.\nMonstrously post-modern slice of life\nA beautifully developed universe with a diverse cast of characters, all with their own personal fashion, outfits, style and quirks, set in the modern world of love with all the trimmings: selfies, dating apps, d**kpics, raves, emojis and more.\nFreedom of choice\nMonsters don’t like boys or girls, they like monsters. In Monster Prom the game experience is unaffected by gender or sexual orientation, since finding love is already hard enough.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Beautiful Glitch","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":28628,"name":"Gears of War: Judgment","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4c5/4c53a1916628cb0dfd47b812955c194d.jpg","description":"Gears of War: Judgment is a third-person shooter game developed by Epic Games. It is a spin-off to the Gears of War series.\n\n###Plot\nJudgment serves as a spin-off prequel to the original Gears of War. On a distant planet named Sera, humanity suffers from a sudden invasion of the Locust Horde. Nothing is known about the enemy, and the human government is unable to deploy its military forces quickly. The story revolves around a military court process against the four-person Kilo squad. \n\n###Gameplay\nJust like in all previous installments of Gears of War, Judgment is a third-person shooter featuring an over the shoulder perspective with an addition of an advanced cover system.\n\nThe levels of the game are not as open as they used to be in the previous games. Now, the players fight in small and dense urban environments. Missions serve as self-contained story parts with no backtracking present in the gameplay.\n\nThe game features a scoring system that evaluates the player's performance. There are two main criteria that matter: a number of the player kills and the number of headshots made. A harder difficulty is offered before the mission launch. This can activate a special weapon restriction or set a time limit. Completing a level on such difficulty will increase your score.\n\nThe game also features a multiplayer mode that was not changed much since the last game apart from the addition of two new game modes: OverRun and Free-for-All. Eight maps are available to the players.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":19932,"name":"ARMA: Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/741/7415f6f478578831e1fd1329c1c98ee3.jpg","description":"ARMA: Gold Edition is a first-person tactical military shooter simulator developed by Bohemia Interactive Studio. Gold Edition includes the expansion pack named Queen's Gambit. \n\n###Setting\nA fictional island of Sahrani is divided into two parts: a communistic north and a democracy established in the south. The U.S. armed forces that participated in training in the southern part of the island prepare for their leave. This moment is used by the northern communistic dictator for the invasion. The player controls a private that hadn't left the island prior to the conflict. Your squad will assist the local resistance in repelling the attacks while awaiting reinforcements from the mainland.\n\n###Gameplay\nThe players complete linear missions which feature both main and side objectives. There is an illusion that the game is not linear at all and that the player directly affects the outcome of the war.\n\nThe game puts a strong emphasis on realism. The game features realistic weapons, vehicles, ballistics, animations, character damage, and the world's landscapes. There are no health points in the game. The players can get killed with 1-2 shots unless they wear body armor or heal their wounds in time.\n\nThe game came bundled with a level editor which gave birth to a dedicated community and allowed for the creation of countless custom scenarios and levels.\n\nThe game features a multiplayer mode in which other players can drop into your game seamlessly and either play with or against you.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10234,"name":"Jazzpunk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df6/df670a73ae928e05893d1d84af5810a7.jpg","description":"The game genre is described as an “adventure.” The creators of the game claim that the game is a combination of the creators' favorite literature, movies, and cyberpunk, noir genres.\n\n###Plot\nThe game develops on planet Earth, in the ordinary world, in the atmosphere of the 50s, in the fictional location of Japanada.\n\nA top-secret espionage agency operating out of an abandoned subway station. The player controls Polyblank performing several missions given by the head of the organization.\n\nMissions are almost always bizarre and nonsensical. For example, all of them begin by ingesting a dose of prescription medicine. Missions include degaussing and smuggling pigeons, assassinating cowboys, cross dressing, killing a piggybacks, and photocopying.\n\n###Gameplay\nThe main content of the game is exploration and comedy over puzzle-solving.\n\nEach mission has a main goal, but the player can freely explore the world of the game, which is filled with many creatures and objects. There are also many mini-games.\n\nManaging a character is organized quite simply. Player can use the keyboard to move in all directions, jump, cycle through the player's inventory, and interact with highlighted objects. The mouse allows to manipulate the camera and look around.\n\n###Bonus game mode\n\"Wedding Quake» mode allows players try to shoot AI-controlled enemies with wedding-themed weaponry, like wedding cake, roses, champagne corks, in a Quake deathmatch-style contest.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Necrophone Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":370202,"name":"Not For Broadcast","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/31a/31a18b79feb780687e85d61376828c94.jpg","description":"You only came in to clean the studio but now you’ve ended up at the helm of the National Nightly News as a radical government wins in a landslide. What could possibly go wrong?\r\nBut when every decision has dark consequences, will you fall in line and do as you’re told or fight back?\r\nTake control of the shots. Pick the ads. Censor the language. You decide what the public get to see and what’s Not For Broadcast.\r\nVision mix 4 camera feeds in a completely unique gameplay mechanic that puts you in charge of a live news broadcast.\r\nChoose the headlines as the stories spiral in response to your decisions\r\nMake far-reaching choices in a rich, alternate 1980’s dystopian world that has to be seen to be believed...","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"NotGames","platforms":[{"id":0,"name":"PC"}]},{"id":23252,"name":"Ancestors","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b77/b770da7788257a5a437c1921348c0427.jpg","description":"Feature ListNo matter whether you choose a gamepad or a keyboard/mouse combo, Ancestors Legacy will give you the best possible RTS experience on desktops and TVs alike. Both controls and UI have been tailor made for gamepad and Big Picture mode, so you can fully enjoy the state-of-the-art visuals powered by Unreal Engine 4 on the big screen.\nAbout the GameTake command of your army as you storm through medieval Europe in an extensive series of campaigns. Choosing one of the four available nations – Viking, Anglo-Saxon, German, Slav – you will be tasked with more than just conquering, raiding and pillaging enemy camps, villages and towns. Only by utilizing the full range of available tactical options, taking strategic advantage of the environment, and managing your temporary bases and settlements, will you emerge victorious.\n\nAncestors Legacy is a historically accurate real-time strategy game influenced by historical events in the Middle Ages. The game combines resource management and base building with large-scale, squad-based battles across vast battlefields, all rendered in great detail thanks to the Unreal Engine 4 tech. Experience medieval bloodshed like never before, thanks to the cinematic action camera that puts you right in the middle of the battle at the press of a button.Features\n4 playable nations in an extensive single player campaign inspired by historical events\nAdvanced tactical options combining the use of terrain, experience and morale\nCinematic battle camera view puts you right in the center of the action\nOutstanding visual fidelity powered by Unreal Engine 4\nIntense multiplayer battles\nStreamlined resource management and village construction\nPrecise controls with native gamepad support","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Destructive Creations","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":17090,"name":"DLC Quest","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/239/2395df3a388d30d09f5552a203ed8a7d.jpg","description":"###Have we gone too far?\nThe game was born deep down at Steam Greenlight and is ironizing about the DLC theme. The slogan of the game “What happens when the DLC practices go too far?” describes the main concept: there are more than 30 different DLC in the game, which open access to such things as character animation, the ability to move and so on. Each mechanic and every function that is considered a basic in an ordinary game here is hidden by an independent developer under the lock of additional content, which must be bought for the coins collected in the game. Perhaps the industry has gone too far in pursuit of profit and has forgotten what games are in the first place? The developer is trying to answer this question through the monotonous grind for abilities and power-ups.\n\n###Key features\nThe player takes control of the nameless protagonist, who must save the princess. The stereotypical story serves as the glue for a set of levels classics to the genre. The genre was selected suitably for such plot: DLC Quest is a 2D platformer. The game has two full story campaign: the original story of DLC Quest and the addition of Live Freemium or Die. Also, more than twenty achievements are available and an online leaderboard for comparing results with friends.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Going Loud Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]}]