[{"id":1017,"name":"HoPiKo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee2/ee2d4cc324003509591c108b60563c78.jpeg","description":"Download the HoPiKo Demohttp://store.steampowered.com/app/520570\nAbout the Game\nA virus, known as the Nanobyte has infected hardware around the globe rendering all systems useless - gaming is dead. The HoPiKo, who ran the games, have been enslaved... It’s time to hook up your power gloves and save your HoPiKo brothers!\nHoPiKo is an intense speed run platformer where you get to save gaming. Jump from platform to platform avoiding death, exploiting shortcuts and ripping through 100s of hand-crafted levels, each one dropped into a 5-stage mini run designed to break your mind!\nCompete to be the fastest in the world with time based scores, level pars and collectable retro consoles opening unique bonus runs.\nFast and brutal twitch-based gameplay.\nAwesome chiptune soundtrack written and composed on authentic hardware.\nUses every ounce of your muscle memory.\nUnique minimal controls, you’ve never played a platformer like this!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Merge Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":650648,"name":"World War Z: Aftermath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/165/16592cd7d9131ed0af249fd814a5c7e3.jpg","description":"World War Z: Aftermath is the ultimate co-op zombie shooter inspired by Paramount Pictures’ blockbuster film, and the next evolution of the original hit World War Z that has now captivated over 15 million players. Turn the tide of the zombie apocalypse on consoles and PC with full cross-play. Join up to three friends or play on your own with AI teammates against hordes of ravenous zombies in intense story episodes across new zombie-ravaged locations around the world. Take back Vatican City in an epic confrontation in Rome, and join forces with survivors in Russia’s snowbound Kamchatka peninsula.\r\n\r\nNew Stories From a World at War\r\nTake back Vatican City in an epic confrontation in Rome, and join forces with survivors in Russia’s snowbound Kamchatka peninsula in all-new story missions. Play as both new and returning characters as you take the fight to the undead with a brutal new melee system, decimating zekes with unique moves, perks and dual-wield weapon options like the sickle and cleaver. Fend off new undead monstrosities, including swarms of flesh-hungry rats that will unleash total chaos on your team.\r\n\r\nThe Next Generation of the Zombie Swarm\r\nEndure endless waves of increasingly difficult zombies in the new Horde Mode XL game mode, featuring hundreds more zombies on screen than ever before possible. Horde Mode XL will arrive in a free post-launch update on PC.\r\n\r\nDeep Progression and a New Perspective\r\nExperience a heart-pounding new perspective with Aftermath’s immersive new First-Person Mode option. Level up eight unique classes — the Gunslinger, Hellraiser, Slasher, Medic, Fixer, Exterminator, Dronemaster, and all-new Vanguard class — each with their own perks and playstyles. Customize your weapons to survive any challenge, and conquer new daily missions with special modifiers for bonus rewards.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":391401,"name":"Last Stop","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d8/0d8f2dfdc975aa95b4c0e6d0df549a3f.jpg","description":"From Variable State, the award-winning creators of VIRGINIA, comes LAST STOP. A single-player third-person adventure set in present day London, you play as three separate characters whose worlds collide in the midst of a supernatural crisis. \r\n\r\nAn anthology drama, LAST STOP is three stories in one. What connects these three strangers? Where will fate lead them?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Variable State","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":367112,"name":"The White Door","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/51f/51fabb84aaa0937ca6b72bd7e88c80c8.jpg","description":"Robert Hill wakes up in a Mental Health facility and suffers from severe memory loss. Follow the strict daily routine of the facility and help him to recollect his memories by exploring his dreams. The White Door is a point-and-click adventure by Rusty Lake that uses a split-screen for interaction with the environment and protagonist.\nFeatures\nA unique split-screen point-and-click adventure where you follow Robert Hill for seven days in a Mental Health facility\nA new style, but the same absorbing gameplay and atmosphere fans would expect from a Rusty lake title\nThe game will be co-published by Second Maze - a brand new indie game publisher\nImmersive and atmospheric soundtrack by Victor Butzelaar\nSupporting 17 different languages","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rusty Lake","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":52387,"name":"Lumines Remastered","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b13/b13486a5f48389a1708c9c0fe80c7e6f.jpg","description":"LUMINES REMASTERED brings minimalism to the puzzle genre where the fusion of light and sound sets the stage for a two-color falling block experience in HD and 4K. Groove to electronic jams while strategically dropping blocks before the BPM bar sweeps combos clean after each measure.\nGAME FEATURES===============\nFeel the sound: Play over 40 skins with electronic atmospheres from chill to upbeat. Shuffle skins (like a music playlist) as more are unlocked in a new Shuffle mode.\nFeel the challenge: Faster tempos means less time to make combos, but slower songs can mean uncleared stacks. You’ll get hooked.\nFeel the fun: Take the challenge to unlock all skins and avatars, play against friends in local VS 2-player mode, or climb the ranks to the top of the online leaderboards.\nFeel the vibration: Turn on Trance Vibration and sync multiple rumble-enabled controllers to feel the bass across your body.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Enhance Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":49894,"name":"We. The Revolution","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/449/449f5ba548861fe8fd963c1386911018.jpg","description":"Become a judge of a Revolutionary Tribunal during the French Revolution and preside over complicated cases of ordinary citizens, criminals, revolutionaries and their enemies. You will decide whose deeds will go unpunished, and whose head will roll from a swift guillotine cut.\nBeware, however, because the eyes of Paris are upon you – with many factions vying for power and influence over you, you will have to become a political force on your own in order to survive… and to seize the control of Paris for yourself!\nIn We. The Revolution the plot will put you in morally ambiguous situations where are no easy answers. Having power over life and death is both a heavy burden and a force that can turn the tide of the revolution. Every faction in Paris wants it, so you will have to keep that in mind each time when passing sentence in the courtroom, all the while using your agents to control the city, engaging in back-channel dealings, crafting letters, and weaving political intrigue behind the scenes.\nWE. THE REVOLUTION MEANS:\nShaping history and decide who will live and who will die\nExperiencing the oppressive atmosphere of the French Revolution\nPresiding over more than 100 unique court cases\nRunning your own courtroom – questioning witnesses, analyzing clues and evidence, reading reports, and passing sentences\nMaking friends and enemies of different rival factions vying for power\nEngaging in a mix of genres, blending case-building with intrigue-crafting and turn-based tactics","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Klabater","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":40929,"name":"Star Trek (2013)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/64d/64d9e33affb7a9a1df62229576d0bd6b.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish, Russian.  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  Game players will get to play as two of the greatest science-fiction heroes ever -- Kirk and Spock – in the award-winning STAR TREK, a completely original co-op experience that expands the Star Trek universe even further.  Set in the 23rd Century world of the massively popular Star Trek reboot, this cover-based shooter immerses players in a rich, original story and action-packed combat.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Digital Extremes","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22774,"name":"Gabriel Knight: Sins of the Fathers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c9a/c9aafac03b15d29198a7cac52b62e9c5.jpg","description":"He started out writing a book on voodoo. Now he’s fighting for his very soul.\nGabriel Knight is the last in a long line of Shadow Hunters, those fated to fight the dark forces of the supernatural. Haunted by a centuries-old curse, he is tormented by terrifying nightmares.\nNow he must spend every waking moment scouring the side streets and back alleys of New Orleans for the key to his dark past. And when he sleeps - the nightmare begins.\nStylishly designed and richly written - a true neo-Gothic computer novel.\nUnravel an ancient and unnerving supernatural secret as you interrogate everyone in this elaborate psycho-thriller set in modern-day New Orleans.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Sierra","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":13994,"name":"Dino Run DX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ae/8ae04040b033c4e16875b34f7d796ac4.jpg","description":"DINO RUN DX is an ongoing evolution of the classic prehistoric multiplayer racing game. Control your iconic raptor through an endless assortment of procedurally generated landscapes and outrun the ever-approaching WALL OF DOOM.  Will you end up one of the millions of doomsday casualties, or will you ESCAPE EXTINCTION?\nFeaturing:\n-A unique experience every time you play... no two levels are ever the same.\n-3 major single player gameplay modes:  CHALLENGE, PLANET D and SPEEDRUN (currently 24 speedruns with more coming soon).\n-Realtime multiplayer with chat, matchmaking and more unique levels to race in.  Climb the ranks and show your dominance!\n-Choose from a staggering number of hat and color combinations to hone your look... unlock even more hats by completing game milestones.\n-FREERUN MODE: turn off the doom, chat with other players during actual gameplay, spawn boulders and npc dinos, roleplay.... do what you want!\nHow is DX different than previous versions of the game?\nIf you've only played the web version from years ago, you'll find DX is a dramatic improvement with more levels, hats and gameplay options.  If you've played Dino Run SE, the major differences right now are completely redone backgrounds and an extra layer of polish, true fullscreen mode, controller support, steamworks integration, improved multiplayer security, and a few more hats and colors to choose from.  We are also currently working on even more improvements to the game and will continue to roll out new features as long as there is interest and support. This is our pledge to you! More info on upcoming features can be found at http://www.pixeljam.com/dinorun.\nFun Facts:\n-The original web version has been played over 100 million times (source: Mochibot)\n-Pixeljam, the creators of Dino Run, have made over 20 games since 2006.\n-Dino Run helped pioneer the \"runner\" genre of games, before it was popularized on mobile and started to truly suck.\n-Dinosaurs did not actually wear hats, but there are tiny traces of them in the plastic tightening straps on all baseball caps.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pixeljam","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":4946,"name":"Magic: The Gathering - Duels of the Planeswalkers","genre":"Card","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fab/fabd57846a0d62144cdc1393a0cadc13.jpg","description":"Magic: The Gathering® - Duels of the Planeswalkers® brings the world's premier trading card game to your living room! Play single and multiplayer campaign modes, test your skills with unique challenges, and engage online opponents via PlayStation®Network. With multiple game modes, an interactive tutorial, leaderboards, and trophies, Duels of the Planeswalkers® has something for everyone!\nWizards of the Coast, Magic: The Gathering, Duels of the Planeswalkers, and their respective logos are trademarks of Wizards of the Coast LLC in the U.S.A. and other countries. Other trademarks are property of their respective owners. ©2010 Wizards of the Coast LLC.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Stainless Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3141,"name":"DISGAEA 5: ALLIANCE OF VENGEANCE","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/260/26091537c4da31bd3d1c2e8ac57b9b4c.jpg","description":"Form an alliance and get revenge, in the latest SRPG in the Disgaea franchise. Killia, a loner, is drawn into forming a rebel army with a group of Overlords to oppose Demon Emperor Void Dark, and prevent him from taking over all of the Netherworlds.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1 player\n5GB minimum save size\nDUALSHOCK®4\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2015 Nippon Ichi Software, Inc. ©2015 NIS America, Inc. All rights reserved. Disgaea is a registered trademark of Nippon Ichi Software, Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NIS America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":245719,"name":"Magic: The Gathering Arena","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ac/0acd19461e0dec43a60103e7e8346099.jpg","description":"Magic: The Gathering Arena is a free-to-play digital collectible card game allowing players to gain cards through booster packs, in-game achievements or microtransaction purchases, and build their own decks to challenge other players.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wizards of the Coast","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":38703,"name":"FIFA 09","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/88d/88d4a5e7705e3cb1017b4b62b50f269c.jpg","description":"Step onto the pitch and play professional football your way in FIFA 09. Experience the most authentic football simulation EA Sports has delivered as you live the fantasy of playing as a professional player and customise the game to suit your style and ability. Powered by the third generation of the EA Sports football engine, FIFA 09 features more than 250 core gameplay additions and enhancements that deliver the most responsive, intelligent and realistic action ever for the series. Enjoy turning defenders with more controlled dribbling and ball control, snapping off precision shots with improved first-time shooting mechanics and firing beautifully timed passes with greater accuracy, placing the ball exactly where you want it. With new player momentum physics the speed and weight of the player determines everything from the distance of a slide tackle and the power of a header to the severity of player collisions and the height of a player's jump. Plus, players now behave according to their physical attributes with larger, stronger players dominating collisions, battles for control of the ball, and position in challenges for two player headers.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":22803,"name":"Heroes of Might and Magic 4: Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ee/6ee18bcbcacc795ca86fcbde14ee0b08.jpg","description":"Some prophecies of doom do come true. Escape the flames licking at your back and jump quickly through a portal into another world, for only the bold will be allowed to live. Embrace a wondrous new land and uncover its ancient mysteries. Battle its deadly creatures and explore a forgotten past. Here lie gods who have been silent all too long. Here lies a realm that can only be claimed by the strong, the crafty or the wise. Here lies a realm awaiting a bold conqueror!Includes Heroes of Might and Magic 4 and its expansions: The Gathering Storm and Winds of War.\nA lot of innovations in terms of gameplay, such as caravans or heroes participating in battles.\nThe last installment of the HoMM series developed by its original creators - New World Computing.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":12400,"name":"Unbox","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/281/281dfe734cab3e788bdfd94e84b04c06.jpg","description":"The ultimate postal service has arrived... self-delivering cardboard boxes!\nUnbox: Newbie's Adventure is a retro-inspired physics platformer about rolling cardboard boxes; enjoy an epic single player adventure and grab your friends for four-player fun in local multiplayer races and battles!\nGlobal Postal Service is nearing bankruptcy and in an attempt to save themselves, they have created living, self-delivering boxes. Their latest cardboard creation, Newbie is here to save the day. Battle against the dastardly Wild Cards across huge worlds full of challenges, collectibles and boxy boss battles!\nFrom tropical islands to frozen peaks, filled with collectibles and cardboard characters, Unbox takes you around the world to save GPS, defeat Boss Wild and his miniature minions. Find and complete challenges on each world to earn stamps and, once you have enough, it’s time to take on Boss Wild! Using the power of Unreal Engine 4, the world of Unbox: Newbie's Adventure is filled with physics fun: buildings will crumble and boxes will tumble in this explosive adventure!\nOnce you’ve saved the world, grab your friends for classic four player fun! Enter the arena to battle your buddies in a range of game modes:\nBoxing: Shoot fireworks, avoid water!\nCollect: Grab the most tape, where will it appear next?\nThief: Steal coins, ruin friendships!\nOddbox: Become the most wanted, avoid the hunters!\nGotta go fast? Try Delivery, a racing game mode where boxes will plummet down perilous routes as they try to reach the finish box first!  With 11 diverse Local Multiplayer maps and a fully customisable tournament, prepare for endless cardboard carnage!\nMake sure you dress to impress with a massive range of cardboard customisation! Completing challenges, finding hidden stamps and rescuing innocent boxes from the Wild Cards will unlock a range of cuboid clothes and accessories. From formal wear to fancy dress, there are over 40,000 combinations of hats, clothes accessories and funny faces.\nDon’t be a square! Think outside the box and create your very own cool cube!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Prospect Games","platforms":[{"id":0,"name":"PC"}]},{"id":10178,"name":"Tron 2.0","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47e/47ea6ef57ed0a81bcbc4a337b4e0c3e7.jpg","description":"Update Notes10/21/2014 Build (417111)\n•\tTronLauncher.exe now uses .NET 3.5 Client Profile for compatibility with Windows XP.  Added .NET 3.5 Client Profile redistributable.\n10/20/2014 Build (415656)\n•\tAdded TronLauncher.exe to resolve a compatibility issue with the cloud save.\n10/15/2014 Build (411009)\n•\tFixed disc check error appearing when there is no optical drive present.\n•\tThe game no longer resets user preferences each time it is launched.\nAbout the GameAlan Bradley has finally perfected the technology to digitize people, which allows humans to enter the internal world of a computer. His program, \"\"Ma3a,\"\" has AI sophisticated enough to store the entire gene code of a person and the mathematical equations necessary to transfer people back and forth between the physical and digital world.\nHowever, fCon -- Future Control Industries -- has learned of Alan's research and is moving to take over the company. When Alan disappears mysteriously, finding him is up to Jet, his son. Jet uses his father's technology to enter the computer world and, while investigating his father's disappearance, discovers a sinister plot.\nFour \"\"primitive\"\" weapons -- disk, rod, ball, and mesh -- are encountered in the computer world, though the disk is the only weapon that can be used both offensively and defensively. Jet will also ride light-cycles, both the classic cycle from the 1982 film and a new \"\"experimental\"\" update from designer Syd Mead (also responsible for the original light-cycle design).","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Monolith Productions","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":702386,"name":"Rubber Bandits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/146/146b12e9098b450d607a979033eca64d.jpg","description":"Join our discord\nAbout the Game\nEARLY BIRD OFFER! Early birds who buy and play the game before or on December 9th can unlock an exclusive Earl The Bird skin from the Bandit Store. A little something to shake your tailfeathers in!\nRubber Bandits throws players into a wild party brawler to steal, smash, and scavenge as much cash as you can! Prepare for hilarious physics-based combat with wacky weapons and a huge lineup of criminal characters. Dodge deadly traps, bash rival bandits, and race from the cops to commit the perfect heist - but don’t forget to bag the loot!\nCompetitive Criminals: Play with friends or against other bandits online to escape victorious! Join your partners in crime with local co-op gameplay, or create the perfect criminal dream team with two people from one PC.\nLawbreaking Levels: Defy the laws of physics and bust out your bandits from highly destructible levels in classic heist themes like The Bank, The Museum and The Docks. Battle it out in Brawl mode, execute the perfect robbery in Heist mode, or become a criminal mastermind in singleplayer Arcade mode!\nFelonious Fashion: Customise your criminal looks in one of many classic bandit disguises: from cowboy outlaw and cat burglar, to rubber onesie and banana suit.\nWicked Weaponry: Use everything at your disposal to win against your opponents and get the goods! Choose from 20 different weapons, from baguettes to rocket launchers, and dodge your way through the destructible levels to smash and grab the cash.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Flashbulb","platforms":[{"id":0,"name":"PC"}]},{"id":494484,"name":"Against the Storm","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7d/c7df14c2f6efd2bb035aa89f7c7ca30a.jpg","description":"Check out other amazing games featured on our special Digital Dragons partner page\nRebuild to last!\nAgainst the Storm is a roguelite city builder set in a fantasy world tormented by the everlasting rain. Settle the unknown wilds to discover and rebuild the ruins of a long-forgotten civilization. Develop technologies that will help your citizens tackle destructive storms and extend the frontier of your civilization.\nA unique combination of city building and roguelite genres makes each playthrough a unique adventure. Every reclaimed ruin increases your buildings’ collection. Optimize your set and test different strategies with each run to thrive in a world where it never stops to rain!\nMain FeaturesEngage in city building core amped up with roguelite’s replayability\nHarness three rain seasons which dictate constant shifts in your strategy\nManage a city inhabited by three races with different needs and skillsets\nDiscover and incorporate long-forgotten technologies that influence your playstyle\nBuild and grow a city that will endure harsh weather conditionsCity builder...Build and nurture your settlement in the unforgiving wilds. Take control of a growing population of humans, beavers, and lizardfolk - the last sentient races that opposed neverending storms. Manage their living conditions, diverse eating habits, and utilize their unique proficiencies. Gather scarce resources and process them into valuable goods, the most essential of them being hearth-keeping fuel....meets rogueliteStart every playthrough with different conditions and toolsets that guarantee unique experiences on procedurally generated maps. Randomly assigned long-term goals will tempt you with visions of great rewards and motivate you to experiment with new strategies. Expand your meta hub and the collection of buildings by preserving valuable relics of your predecessors.\nReclaim and rebuildThe world is filled with ruins of a long lost civilization that vanished in unknown circumstances. Who were they? Was it the rain that wiped them out or some greater threat that lurks in the uncharted lands? During every settling expedition, you can reclaim and rebuild what was once lost to unlock new technologies that will help you avoid the tragic fate of previous inhabitants.A world tormented by the stormThe rain is your ally and the greatest enemy. It cycles in three seasons requiring you to stay flexible and adapt to changing conditions. In Drizzle, the season of regrowth, natural resources replenish themselves, and it’s time for construction and planting crops. The Clearance is the season of harvest, expansion, and preparations for the last, most unforgiving season of them all. A true test of your city’s strength comes with the Storm when bolts of lightning tear the sky, nothing grows and resources are scarce.Community-driven developmentWe aim to constantly provide you with new opportunities and infrastructure to influence the making of the game. Our goal is to incorporate your feedback into development cycles and spark a genuine belief of contributing to the world of Against the Storm.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Eremite Games","platforms":[{"id":0,"name":"PC"}]},{"id":275629,"name":"Unheard","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/332/33276d598e6e505b374b1a662a67f91c.jpg","description":"Put on your headphones and step back into the past. Use the voices you hear to return to crime scenes, tracking down each individual involved and solving the cases. But where do the voices come from? Can you trust what you hear? And what’s the mysterious thread weaving all of these cases together?\n\nA Unique Case-Solving Experience\nDiscover the truth hidden in the voices from the past.\nStep through time as you use our device to eavesdrop on conversations from past crime scenes. Every clue, every move, and every motive will be presented in the form of audio. Rather than controlling any one character, you only need listen to their conversations, following along as the story evolves. Use the information you hear to match names to voices and determine how everything (and everyone) is related. Can you discover the truth?\n\nOpen-Ended Narrative Mystery Game\nExplore the story and piece together the puzzle in your own way!\nDon’t expect to be “fed” a pile of clues. Rather, take the role of a fly on the wall, observing and listening to the events as they unfold. Anyone could be the culprit; key clues may be revealed at any second; any character's storyline may cross paths with another at any point in time. YOU be the editor—the order of the story is up to you!\n\n——————————————————————————\n\nTributes To:\nDetective Fiction: In Unheard, all the clues in a case will be presented to players. There's no hidden information, nor rooms that require a key to enter. Players will be privy to the same information as everyone present at the crime scenes.\n\nImmersive Theater: All characters in Unheard have their own storylines; however, each of these storylines will become interwoven in the same space, and at the same time, resulting in complicated cases that force you to meticulously search for and track clues. You can choose to follow one character or move around between multiple characters. You can also replay the audio as many times as you want until you reach a conclusion.\nRadio Drama: Unheard is, in a way, an interactive radio drama. By combining aural narrative techniques with the type of exploration elements present in video games, Unheard offers a brand-new, non-linear radio drama experience.\n\nSpecial Thanks:\nSpecial thanks to our voice actors and directors in both China and the U.S. Thank you for your continued hard work and support.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"NEXT Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":28501,"name":"DEAD OR ALIVE 4","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/590/59030a090559161f2c1f4ac7182d3be1.jpg","description":"mighty magnificent stimulating graceful fighting!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Team NINJA","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":20451,"name":"Cat Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/094/094551569e9a5b7d0fdaf108a65987d2.jpg","description":"DisclaimerCat Simulator is a fun game but it is in EARLY ACCESS.\nPLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO SUPPORT DEVELOPMENT OF THE GAME.Cat SimulatorCat Simulator is a fun first person-cat video game. Your goal is to chase rats and mice, break things, eat, and do other things that cats do... You will experience the joy of hunting mice and rats while racking up points by knocking things over. Cause as much destruction as you possibly can!\nKey Features\n-BE a CAT!\n-Rack up points by knocking things over!\n-LOTS of BUGS!Media and Youtubers contact us here:\nsupport@catstudio.xyz-Media and Youtubers contact us here:\nsupport@catstudio.xyzDisclaimerCat Simulator is a fun game but it is in EARLY ACCESS.\nPLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO SUPPORT DEVELOPMENT OF THE GAME.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Swift Apps","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":18448,"name":"Yury","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d42/d422d87aaf430fcde31b7de2c2eef3cf.jpg","description":"Yury is a deliberately retro platform/arcade action game that combines old-school graphics, classic mechanics and challenging gameplay with a sense of sci-fi survival horror atmosphere.\nAccompanied by original EDM/chiptune soundtrack, player will control a cosmonaut on a distant and dangerous planet, helping him to avoid intricate traps and get rid of sinister monsters. In-air dodging, fast paced puzzles and intense shooting will keep on the edge of one's seat.\nWho said spikes and lava should bring immediate death? Yury is a fresh look on classics! Yury's space-suit lets you quickly jump through the hot flow and gives you some time to crawl to the checkpoint after being hit by sharp edges. But keep an eye on the temperature and oxygen level!\nFeatures:\nNostalgic look\nAmazing atmospheric soundtrack\nChallenging platform experience combined with intense shooting\nA special suite with oxygen & temperature indicators","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cubic Pie","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3507,"name":"WWE 2K15","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fe3/fe3ab374b913d3e44cf377e614526111.jpg","description":"WWE 2K15 ushers in a new era of WWE video games!  The first wrestling game to be featured on Next-Gen platforms, WWE 2K15 will introduce the most authentic WWE gameplay to date, closer than ever to what fans see on WWE TV.  With a host of gameplay advancements and to-be-announced features, WWE 2K15 will bring the atmosphere of WWE to your home!  For the first time ever, play as the iconic Sting, this year’s pre-order launch exclusive!\nFeel every blow, hear every impact.  WWE 2K15. Feel It.\nVideo output in Full HD 1080p requires 1080p native display.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-4 players\nNetwork Players 2-6\n25GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2005-2014 Take-Two Interactive Software and its subsidiaries. 2K, the 2K logo, and Take-Two Interactive Software are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. All WWE programming, talent names, images, likenesses, slogans, wrestling moves, trademarks, logos and copyrights are the exclusive property of WWE and its subsidiaries. © 2014 WWE. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":46240,"name":"Guns, Gore and Cannoli 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31d/31dba501a5a6c2ae20f55929f985965b.jpg","description":"Welcome to the 1940’s.  Europe is being torn apart by the war, the USA is preparing for battle and the mob does business as usual.  Only this time they went to far, even for Vinnie’s standards.\nPrepare yourself to go to war after you make a shocking discovery about what actually happened during the end-stage of the Thugtown Massacre from Guns, Gore & Cannoli 1.\n\"Just when you thought you were out, we’re pulling you back in!\"\nStory\n1944, the war in Europe is entering it’s final stage. 15 years have passed since Vinnie survived the Thugtown Massacre. But now, some loose ends start crawling out of the past, dragging Vinnie as far as the European battlefield of World War 2. Find out who is chasing Vinnie around like a dog, turning all his friends into foes.\nKEY FEATURES:\nGuns, Gore & Cannoli 2 continues the rich, engaging gangster story of the first game and includes all the fast paced action you’ve come to love, we made the best even better, with:\nUpgraded character mobility\nVinnie has received a massive upgrade in his mobility features. 360 aiming, double jumping, kicking, jump-kicking, dodge rolls, somersaults, dual guns and a weapon wheel.\nCampaign mode\nGuns, Gore & Cannoli 2 features a full single or multiplayer campaign mode, packed with action, humor and animated cutscenes.\nRich environments\nWe pushed our artists to the limits to produce the best immersive, atmospheric backgrounds, smoothest animations, and coolest special effects, setting a new benchmark for 2D games.  Look for opportunities to bring down walls, explode barrels, drop crates on top of enemies, blow up cars and even kick your enemies through doors. Enjoy watching the corpses of your enemies fly through the air like ragdolls after you blast them away with your rocket launcher.\nImmersive world and period\nWalk around in the European battlefields of World War 2.  Every level of Guns, Gore & Cannoli breathes the 1940’s.  Every inch of the game is like a picture straight from the second World War era. The cars, the furniture, the speakeasy clubs, the music, the propaganda posters, the streets and the weaponry reflect the turbulent time that the 1940’s were.\nOnline and local Co-op mode\nYou don’t want to die alone in the trenches? Well round up a platoon of 4 players and get blasting.  Play as Vinnie in the solo campaign, or have up to three friends jump in at any time to play together while fighting through hordes of Nazis, zombies, monster, gangsters, cops, soldiers, tanks, submarines... in this all-new and incredibly fun arcade-style co-op action game. Teamwork is essential to surviving waves of enemy goons.\nHumor\n‘War is hell’ unless you are Vinnie Cannoli and you turn every problem into a cynical joke, blurting out one-liners and snappy comments after a nice, juicy kill.  Guns, Gore & Cannoli 2 will be a fun experience, not only to play but also to watch.  Funny one-liners, screaming deaths, comical dialogs and hilarious enemies make you play this violent kill-simulator with a smirky grin on your face.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Claeysbrothers","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":40864,"name":"World of Warplanes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c61/c61e62d2fe08ff2e471a37aa329e876e.jpg","description":"World of Warplanes is an aerial combat MMO action game set in the Golden Age of military aviation. Throwing players into a never-ending battle for dominance of the skies, the game allows aircraft enthusiasts to pursue full-scale careers as virtual pilots, earning their wings in intense 12-vs-12 battles where supremacy in the air depends on not only a fast trigger finger, but also coordinated teamwork.\nFive Aircraft types\nLearn air combat skills with five different aircraft types, each of which is unique in its configuration, role, and behavior in battle.\nAircraft of different nations\nChoose any aircraft you like from seven different nations—U.S.S.R., Germany, U.S.A., U.K., France, China, or Japan—and enter a battle.\nAircraft configurations\nUpgrade your aircraft with various weapons, engines, equipment, and consumables.\nMaps and layouts\nIn World of Warplanes, battles unfold at picturesque in-game locations. Although most of them are original, the maps are based on real landscape types that can be found in different corners of the planet.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Wargaming Group","platforms":[{"id":0,"name":"PC"}]},{"id":29501,"name":"American McGee's Alice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2da/2da774b5af375f982c43890a528a16e0.jpg","description":"Shortly after Alice returned from the miraculous trip through the Looking-Glass, her house was burnt down, and her parents died in the fire. Alice was the only survivor of the terrible accident. After repeated attempts at suicide, she gets locked up inside a mental institution and is slowly wasting away there before she is summoned to Wonderland again by the White Rabbit. But this time it's a Wonderland gone seriously bad and gory. The only chance for Alice to restore her peace of mind and find out more about the death of her parents is to fight through Wonderland and free it from the evil powers.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Westlake Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Classic Macintosh"}]},{"id":17577,"name":"UFO: Aftermath","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fcf/fcf387943fc495ed5bac9dce52cf80ef.jpg","description":"UFO: Aftermath is a 3D isometric, tactical strategy game with a rich and compelling sci fi story.\nCombining a global strategy with small squad tactical combat, the challenge offered is to fight against an alien invasion. Featuring run time generated tactical missions with innovative simultaneous combat action; the genre is also enhanced with strong RPG elements, offering a quite unique mix of strategic ideas.\nRPG - Your soldiers will improve as they gain more experience. Their skills are derived from these statistics, and each point that you put into any one of these attributes will have a noticeable effect on that soldierâ€™s skills. These attributes are: Strength, Agility, Dexterity, Willpower, Intelligence, and Perception\nStrategy - You must manage your bases, interceptions, and squads. Territory is equal to power in the game - the more you control, the better your interceptor coverage. Also, the faster you research, the better things could be.\nTactics - Fighting on the ground against aliens and mutants for the control of territories. Once you control a territory, you can decide what type of base you want there: Research, Military, Manufacture or Biomass repulsion.\nCombat - Unique combat system features all of the best elements of both turn-based and real-time combat systems. You give orders while the game is paused to avoid the frantic rush of a real time system. While in pause you can give your troops very detailed orders taking as much time as you like. Once you are finished you simply start the game and continue playing. Once the game is underway you can pause the game at any point to update or change your orders and the game will automatically pause when important events occur, so that you may modify your plans accordingly. This combat is combining the finely grained tactics of a turn-based game with the realism of a real time system.Key features: Randomly generated tactical missions - each playing field will be unique meaning no two games are the same\nIntricate, rich and frightening alien setting displayed in full 3D\nOver 100 varied mission objectives\n70 plus unique weapons","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Altar Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":17050,"name":"YOU DON'T KNOW JACK Vol. 3","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e0/1e09f018c22a8374030122d7e5af0f7c.jpg","description":"Fans of Cookie Masterson rejoice! This is his first volume as full-time host – the game that launched a “career,” if you can call it that!\nThe spawning continues as the award-winning YOU DON’T KNOW JACK series pumps out YOU DON’T KNOW JACK Volume 3. Join your host Cookie as he takes you on a trivia Tilt-a-Whirl that’s a triple-dip of cheeky hip. YDKJ Volume 3 adds a whole slew of question types into a mind-bending mixture of smart-aleckiness and sassitude.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":15927,"name":"Phoenix Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/295/2955d307838622b7290c44bc8d8a209e.jpg","description":"A dragon, a giant eye and the grim reaper confront you using fireballs, lasers and sickles. What do you do?\nA) Say the game is unfair because you die with a single hit and there are no weak enemies and then cry with your mama; or\nB) Dodge all this bullet hell and destroy the enemies in 30 seconds because you are a real gamer!\nPhoenix Force is a shoot 'em up about a group of phoenixes that fight big and strong mythological creatures in over 100 levels. It takes the boss battle as the foundation for every level, creating engaging and challenging fast battles that will require your best strategies and reflexes.\nThe game starts a long time ago, when Earth was hit by meteors and everything burned to ashes. The Phoenix of Fire, Fury, was the first to reborn, and found the world full of monsters, the bosses, and rescued the other Phoenixes: Cryo of Ice, Tupã of Thunder,  Gaia of Earth and Gast of Ghost. Together they are the Phoenix Force and they have to travel all the continents of our world in a journey to eliminate all the bosses in 100 really challenging battles.\nAre you skilled enough to prove yourself the best?\nThis shmup will show you no mercy!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Awoker Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":15121,"name":"Higurashi When They Cry Hou - Ch.2 Watanagashi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0be/0be80b1bab6d826e58328befb0bb66cd.jpg","description":"The 58th year of Shouwa, early summer.\nIt’s June, and the summer heat has arrived earlier than it does most years.\nBy day there are crickets, and by night there are cicadas.\nWe’re in Hinamizawa, a small village in the countryside.\nThere are fewer than two thousand people here. But every year, there is an event.\nThis event is a mysterious death.\nOn a certain day in June, someone dies, and someone else goes missing.\nThe series of deaths is connected to the upheaval surrounding the dam construction project.\nA murder case that was covered up is being reenacted.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there isn’t.\nSomeone who wasn’t supposed to be there is.\nSomeone who was alive last night is dead now.\nAnd someone who is here right now isn’t alive.\nSo, there is no way to avert tragedy. There is no choice but to give up.\nBut don’t give up.\nOnly you can stand up to this.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"07th Expansion","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4107,"name":"Metal Gear Solid: Peace Walker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e3b/e3ba37356de29efec5cc12ed811d4196.jpg","description":"The world-renowned stealth-action series returns in a new chapter hand-crafted by Hideo Kojima himself!  The year is 1974.  Join 'Snake,' (a.k.a. Big Boss), in pursuit of a mysterious armed force that threatens peaceful Costa Rica - 'A Nation without a Military.”  Experience the thrill of cooperative stealth on your handheld system and the legendary gameplay that is METAL GEAR SOLID PEACE WALKER!\n\nTRANSFARRING functionality not available on PS Vita.\n\n  Software subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up 3 portable PlayStation® systems activated by this account.\n\n©2010 Konami Digital Entertainment","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":962011,"name":"Prince of Persia: The Lost Crown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cca/ccaa933775fe1ffcebe40a01f52545db.jpg","description":"UNLEASH YOUR INNER WARRIOR\nUse your Time Powers, combat, and platforming skills to perform deadly combos and defeat time-corrupted enemies and mythological creatures.\n\nLOSE YOURSELF IN THE PRODIGIOUS MOUNT QAF\nDiscover a cursed Persian-inspired world filled with larger-than-life landmarks and explore a variety of highly detailed biomes, each with their own identity, wonder, and danger.\n\nLIVE AN EPIC ADVENTURE\nImmerse yourself in a Persian mythological​ fantasy through an intriguing and original story as you use your wits to solve puzzles, find hidden treasures, and complete quests to learn more about this corrupted place.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Desconocido","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":302825,"name":"Pine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a59/a59701664c02751403bdf24513e628ce.jpg","description":"A Story of HumansPine is an open world action adventure simulation game. Set in the beautiful world of Albamare, you take on the role of Hue, a smart young adult who will have to explore, trade, and fight his way through a vibrant world filled with creatures much smarter than humans.\nTheir Story Becomes YoursAs you're looking for a new home for your tribe to settle in, you'll have to engage with the large-scale ecology of Albamare. Prepare by exploring, bartering, talking, crafting  and fighting in six different biomes, with and against a diverse cast of species that will not simply help you.\nA Struggle for SurvivalIn Pine, things will happen across the open game world even without your involvement. All organisms are alive and will try what they can to survive. You can choose to befriend a species, fight alongside them, or you may also to attack them, steal their food or force them to abandon their current habitat. All of this will make the species move across the ecological spectrum.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Twirlbound","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":25398,"name":"Kung Fu Panda","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec6/ec6eda0d3d08d023793486b253534c27.jpg","description":"In the Kung Fu Panda video game, players embark on an epic,\naction-packed adventure as they master the specialized Kung Fu fighting\nstyles of Po the Panda, the unlikely hero, his teacher Shifu, and the\nlegendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper,\nMantis and Crane. Through 13 legendary levels from the movie and beyond,\nand spanning land, water and air, players must work their way to become\nthe Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they\nbattle a variety of foes, overcome dangerous obstacles, navigate\nmulti-tiered environments and solve challenging puzzles. Featuring a\ndeep variety of gameplay, unique co-op and competitive multiplayer\nmodes, collectibles, and a host of character upgrades, the Kung Fu Panda\nvideo game provides an experience gamers of all ages will enjoy.\n\nHandheld Kung Fu Awesomeness – Maximizing the capabilities of the\nDS, gamers will unleash a combination of awesome kung fu attacks against\nvarious enemies both from the film and unique to the game with a\nmultitude of organic touch screen gestures and motions. As players\nprogress through the game, they will gain new moves and abilities from\nthe Furious Five, among others, allowing them to master each new skill.\n\nBodacious Humor – Kung Fu Panda’s unique brand of humor,\nquick-witted dialogue and hilarious situations bring the game to life\nfor players of all ages to enjoy.\n\nRelive the Movie and Go Beyond with Exclusive Content –\nExperience favorite moments based on the film and discover\nnever-before-seen, game-exclusive content co-created by DreamWorks\nAnimation and Activision.\n\nPlatforming For All – Delivering a wide variety of gameplay\nstyles, Kung Fu Panda on the Nintendo DS features numerous multi-tiered\nenvironments spanning air, water and land that will test player’s\nreflexes as they jump across chasms, avoid traps and leap between walls.\n\nTouching is Good – In addition to the impressive touch screen\ncombat controls, dynamic environments allow players to interact with a\nwide variety of objects using the touch-screen. Activate switches or\npick up boulders by simply touching them with the stylus.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":23742,"name":"The Binding of Isaac: Afterbirth+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e8/1e805a4c98c5461b627eb382cb0e2b9e.jpg","description":"Isaac has discovered a labyrinth beneath his own house, filled with\nmonsters, power-ups and unimaginable treasure. Can he survive the\nphysical challenges and psychological trials of a world he never made?\n\nThe Binding of Isaac: Afterbirth+ is a dungeon-crawling shoot-'em-up\nthat’s literally a different game each and every time you play it! The\nrandomly generated maps are built with over 11,000 unique room\nconfigurations, each populated with a nearly endless variety of enemies,\nitems, challenges and secrets!\n\nThe Binding of Isaac: Afterbirth+ includes:\n\nOver 600 different items to collect\n\n13 unique playable characters\n\nMore than 180 individual enemy types\n\n90+ terrifying, deadly bosses\n\nMultiple difficulty settings and game modes\n\nBestiary to record enemy encounters\n\n20 professionally animated cartoon endings\n\nAND MANY MORE SECRETS!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nicalis","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":19596,"name":"Heroes of Annihilated Empires","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e1/6e1a91d974aaab574e8201fde3187cea.jpg","description":"Check out the high-resolution trailer and see what the game is all about.\nHeroes of Annihilated Empires - is a fantasy-based trilogy game in the genre of RTS vs RPG for PC. A new proprietary 3D-engine is used to power the game. Episode one is set on Atlans island, the historical homeland of elves. The world of the game is living and huge, full of magic, mythical creatures, heroes and powerful forces involved in a large-scale conflict dating back to the past. The gameplay enables the player, controlling one of the heroes, as to lead thousands-strong armies into battle, so as combat with the hero alone, making use of the entire arsenal of possibilities and powerful magical spells. The possibility to upgrade your hero, improve his abilities, find artifacts and get random quests serves to hugely diversify the gameplay.\nInnovative opposing of two genres in one game - RTS vs RPG\nNew 3D engine\nDetailed game world, including support of 5 novels from Europe-renowned writer Ilya Novak\nMass-scale battles of thousands-strong armies\nFour unique races, individual skills, spells and artifacts\n12 heroes, 12 neutral races, 100 units and 150 various buildings\nExcellently developed character types and impressive unit animation\nOver 150 magic items and over 100 spells\nOriginal and involving story of the campaign\nClassic multiplayer over LAN or the Internet, up to 7 players in a game. Mix of two genres in the game: RTS vs RPG with a possibility to blend or choose in between during the play.\nOriginal card system of magic spells, equally interesting to both hardcore gamers and newbies. Over 50 spell cards\nInvolving process of character level-ups throughout the entire game\nStunning intros and cut-scenes. Comics in-between missions to give a deeper story insight","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":14549,"name":"Grotesque Tactics 2 – Dungeons and Donuts","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/801/8016123010d0665895003a5a8d8f2a0f.jpg","description":"Grotesque Tactics 2: Dungeons & Donuts is the successor to the celebrated RPG-parody Grotesque Tactics. Experience an ironic story-driven RPG with humorous dialogue-puzzles in the style of Monkey Island as well as a strategic combat system, where your party members are controlled simultaneously.\n\nOur story starts as the citizens of the Kingdom of Glory celebrate their victory over the Dark Church. While in the catacombs of their former enemies, their revelry is disturbed by a sudden all-encompassing fog. The citizens wrapped by the fog disappear screaming into nothing. Those that remain alive after the strange attack, barricade themselves in the depths of the catacombs.  As time passes, food becomes scarce and the people of the Kingdom of Glory begin to realize that they might all meet their demise.  The ‘heroic’ Knights of Glory, shady mercenaries and the arrogant high elves band together into guilds in order to survive and escape the dank catacombs.   Unfortunately, the guilds are far too concerned with their distaste for each other and are oblivious to the awakening of dark forces in the dungeons below…\nKey features:\t\t\t\t\t\t Experience the thrilling, deadly and sometimes humorous turn-based combat.\nJoin up with comrades-in-arms and create your own guild to help defeat the mighty bosses.\nPlay babysitter as you alleviate conflict amongst your party, so they attack the enemy and not each other.\nEach guild member has a talent tree to improve and specialize their skills after your advancements.\nYou can choose from three different factions; the High Elves, the Mercenary Guild or the Kingdom of Glory.\nEach faction has an alternate ending depending on decisions made in the game.\nThe story pokes fun at the RPG genre and popular games, such as Oblivion, Gothic and LOTR.\nBecome a successful Guild Master by collecting gold and improving your reputation.\nFood is rare and has become the new currency - collect food, learn to cook and woo survivors to your side with delicious meals such as hippie grub, spider salami, or the zombie cocktail!\nDifferent levels of difficulty make sure that both beginners and experts will enjoy the game.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]},{"id":11919,"name":"Atari Vault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40c/40c8e6b2d6d98193500b09f30140b564.jpg","description":"Relive the Golden Age of Gaming with 100 of the most popular iconic games from the 70’s and 80’s. Now with online multiplayer capability, this extensive catalog includes classic Atari® titles like Asteroids®, Centipede®, Missile Command®, and many more, paired with intuitive new controls designed to mimic what Atari fans remember from the glory days! The brand new additions of online and local multiplayer, along with Steam Leaderboards, allows you to challenge friends and compete with players from around the world like never before. And now with Steam Controller support, you’ll have unprecedented levels of precision control.  Atari® Vault is the ultimate collection of classic Atari titles, and is guaranteed to provide hours of fun!\nFEATURES:\n100 Classic Atari 2600 and Arcade Games – Play seminal Atari titles including Asteroids, Centipede, Missile Command, Tempest, Warlords, and so much more.\nOnline and Local Multiplayer and Steam Leaderboards – For the first time ever, battle for arcade supremacy online or at home and compare your high scores with players from around the world.\nSteam Controller Support –Experience a new level of control playing your favorite games with the multi-functional Steam Controller.\nBrand New User-Interface – New User-Interface designed to create the greatest classic arcade experience.\nOriginal Cabinet and Box Art – Relive the glory days with period-accurate cabinet and box art.\nFULL GAME LIST:\n3D Tic Tac Toe - 2600\nAdventure - 2600\nAir Sea Battle - 2600\nAsteroids - 2600\nAsteroids - Arcade\nAsteroids Deluxe - Arcade\nBackgammon - 2600\nBasic Math - 2600\nBasketball - 2600\nBlack Widow - Arcade\nBlackjack - 2600\nBowling - 2600\nBrain Games - 2600\nBreakout - 2600\nCanyon Bomber - 2600\nCasino - 2600\nCentipede - 2600\nCentipede - Arcade\nChampionship Soccer - 2600\nCheckers - 2600\nChess - 2600\nCircus Atari - 2600\nCode Breaker - 2600\nCombat - 2600\nCombat 2 - 2600\nConcentration - 2600\nCrystal Castles - 2600\nCrystal Castles - Arcade\nDemons to Diamonds - 2600\nDesert Falcon - 2600\nDodge-Em 2600\nDouble Dunk - 2600\nFatal Run - 2600\nFlag capture - 2600\nFootball - 2600\nGolf - 2600\nGravitar - 2600\nGravitar - Arcade\nHangman - 2600\nHaunted House - 2600\nHomerun - 2600\nHuman Cannonball - 2600\nLiberator - Arcade\nLunar Lander - Arcade\nMajor Havoc - Arcade\nMaze Craze - 2600\nMillipede - 2600\nMillipede - Arcade\nMiniature Golf - 2600\nMissile Command - 2600\nMissile Command - Arcade\nNight Driver - 2600\nOff the Wall - 2600\nOutlaw - 2600\nPong - Arcade\nQuadrun - 2600\nRace - 2600\nRadar Lock - 2600\nRealSports Baseball - 2600\nRealSports Basketball - 2600\nRealSports Boxing - 2600\nRealSports Football - 2600\nRealSports Soccer - 2600\nRealSports Tennis - 2600\nRealSports Volleyball - 2600\nRed Baron - Arcade\nReturn to Haunted House - 2600\nSave Mary - 2600\nSecret Quest - 2600\nSentinel - 2600\nSky Diver - 2600\nSlot Machine - 2600\nSlot Racers - 2600\nSword Quest Fireworld - 2600\nSpace Duel - Arcade\nSpace War - 2600\nSprint - Arcade\nSprint Master - 2600\nStar Raiders - 2600\nStarship - 2600\nSteeplechase - 2600\nStellar Track - 2600\nStreet Racer - 2600\nStunt Cycle - 2600\nSub Commander - 2600\nSuper Baseball - 2600\nSuper Breakout - Arcade\nSuper Breakout -2600\nSuper Football - 2600\nSurround - 2600\nSword Quest Earthworld - 2600\nSword Quest Waterworld - 2600\nTempest - 2600\nTempest - Arcade\nVideo Cube - 2600\nVideo Olympics - 2600\nVideo Pinball - 2600\nWarlords - 2600\nWarlords - Arcade\nYars Revenge - 2600","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Code Mystics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9166,"name":"VEGA Conflict","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a70/a70615f847e5c3c0baa2f99f6e5bfbbb.jpeg","description":"Stake your claim, command your fleets, and wage epic war in space. Band together with other players in a bloody rebellion to take back the galaxy from the evil VEGA Federation.\nCUSTOMIZE YOUR WAR: Different targets call for different strategy, outfit your fleet for victory.\nREAL-TIME PvP: Real war doesn’t wait its turn - attack enemies at will in real-time.\nBATTLE ANYWHERE: Conflict never ends. Continue your progress on phone, tablet, or in browser.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"KIXEYE","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":502238,"name":"Syberia: The World Before - Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fa/3fa57b7693fa660d549808e330c929e9.jpg","description":"Wishlist Now the Main Gamehttps://store.steampowered.com/app/1410640/Syberia_The_World_Before/\nAbout the GameVaghen, 1937: Dana Roze is a 17-year-old girl, who is beginning a brilliant career as a pianist. However, shadows begin to appear over her future as the fascist threat of the Brown Shadow hangs over Europe, at the dawn of the Second World War.\nTaiga, 2004: Kate Walker survives as best she can in the salt mine where she has been imprisoned, when a tragic event propels her into a new adventure in search of her identity.\nSet off on an adventure across continents and through time. Play as both Kate Walker and Dana Roze as you get to the bottom of mysteries that have remained buried for too long.\nExplore the fantastic and poetic world of Benoît Sokal, with its breathtaking sceneries and iconic characters.\nSolve complicated puzzles and riddles in keeping with the tradition of the saga.\nDiscover a rich and captivating story with unprecedented stakes and gripping dialogue.\nAllow yourself to be transported by the symphonic soundtrack composed by Inon Zur (Syberia 3, Fallout, Dragon Age, Prince of Persia).","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Microids","platforms":[{"id":0,"name":"PC"}]}]