[{"id":19676,"name":"The Yawhg","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5d/a5d9dddc16f7c7cc9e7547adb3326d4a.jpg","description":"The Yawhg is a one-to-four player choose-your-own-adventure game that randomizes a unique story every time you play. The evil Yawhg is returning. How will the town’s locals lead their lives in the meanwhile, and what will they do when the dreaded Yawhg finally arrives? The fate of a community hinges on the characters’ actions, and the decisions of their players.FeaturesStories which can be played alone, or with friends.\nA fully fleshed-out world, where actions can have dire consequences.\nA randomly generated story that's different every time you play.\nGorgeous artwork by the award-winning Emily Carroll.\nOver 50 unique endings that can happen to every character.\nA haunting soundtrack by Ryan Roth, sound designer for Starseed Pilgrim.\nA s͎e̝̬̠̭ͅn̬͉̪͕͇s̜̝̮͔͈e͓͎̻̦̣͔͉͢ ̺̰̫͜o̧͚̹͉̰̬͍̲f̛̟͉͈̥̠́ ̢̙̫̖̙̱͠i̺̰͉̟͎͟͡m̺͈̟͚͜͡ͅp͘͝͏̝̲̲͚̤e̵͈n̸̙̮̺̥̩͖̩̤̙ḓ̤͖̀i̛͇̖̞̺̲͈̲̠͟n̸̡̜͜g̴̛̲͙̙̪̳͚͎̼̹͙̮̲̻͓̀͘͞ͅ ̵̷̢̙͍̣̖̭̪͚̻͎̤̞̙̖̰͕͕͞d͝͏̣̝̫̱̱̥̹͇̹̺̮̤͉ͅó̷̯͕̙͔͚͙̳̳̮̣͈͍͚̟̬̟͎̖̕͘o̵̴҉̢̙̬͇̖͉̜͠m̵͏͉̲̠̱͙͉̳̻̖͉̟̦̩͙͉̯͢͟ͅͅ.̷̸̵̧̬͍̙͕̫̝͖̞̩̥̩̣̙͍̗̱͓͈͚͇̣̤͜","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Damian Sommer","platforms":[{"id":0,"name":"PC"}]},{"id":17251,"name":"Fist Puncher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f50/f506e74f0d2a1becee83dbb51c88f12e.jpg","description":"Return to the glory days of sidescrolling beat-em-ups, courtesy of developers Team2Bit and Adult Swim Games.\nThe sinister Milkman holds the city of San Cruces in his nasty criminal grip, and it’s up to legendary black belt neurosurgeon Dr. Karate and the rest of the Fist Puncher team to deliver old-school justice to the lawless streets.Key Features\t19 playable characters, including the all-new Farooq and Omar the Red\nNew super challenging \"They Live\" mode\nAssign “RPG-lite” skill points to level up your crew as you play\nEach fighter has a unique set of moves and perks to unlock\n50 levels of mayhem\nPacked with collectibles, Easter Eggs, and secrets\n99 achievement trading cards to find, plus Steam Trading Cards support\n2-4 players simultaneous local co-op action","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Team2Bit","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16989,"name":"Dark Scavenger","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/976/976afb4fd2be9ab29651bdf8ea8375fe.jpg","description":"Dark Scavenger is a bizarre point-and-click RPG adventure with a focus on exploration, gaining loot, and meaningful choices.\nFilling the role of a powerful space traveler, you find yourself stranded on a mysterious planet in the company of three eccentric, yet resourceful aliens. As you desperately seek a way to repair your ship, a massive conflict unfolds around you involving warring factions and a sinister force that threatens to destroy them all.\nWill you adopt the problems of this world as your own or will you just save yourself?Key Features\nUnique Dark Comedy Sci-Fi Narrative driven entirely by your choices. Each encounter has multiple outcomes!\nEarn Tons of Loot  and convert it into bizarre equipment!\nDeep Turn Based Combat which utilizes equipment combinations to exploit enemy weaknesses!\nEpic Boss Battles with multiple forms.\nNew Game Plus Mode lets you see what you missed the first time around!\nTons of Secrets that you will probably never find.\nTrading Cards!SoundtrackDark Scavenger OST: https://psydragames.bandcamp.com/Check Out Our New Gamehttp://store.steampowered.com/app/696200/Mike_Dies/Social MediaTwitter: https://twitter.com/PsydraGames\nFacebook: http://www.facebook.com/PsydraGames\nTwitch: http://www.twitch.tv/psydragames","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Psydra Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14599,"name":"Saints Row IV: Game of the Century Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c4/3c4ba87d8ecf73cda15c8d118ac294d4.jpg","description":"The US President must save the Earth from alien overlord Zinyak using superpowers and strange weapons in the wildest open world game ever. Includes all available DLC!\nThe epic conclusion to the game that changed all the rules! The Saints have gone from the crackhouse to the White House—but the Earth has been invaded and it’s up to you to free the world from Overlord Zinyak and his alien empire. With homies new and old, superpowers and strange weapons, you must save the world in the wildest open world game ever! And this edition even includes all available DLC!Key Features\nThe American (Fever) Dream – Play as the President of the United States in a story that spans countries, space, and time.  Saints Row IV is to Saints Row: The Third what Saints Row: The Third is to Do The Right Thing.  You’re not ready.\nSuper Hero-in-Chief – Leap over buildings.  Kill people with your mind.  Run through tanks.  Those are some of the most mundane powers you will wield in your quest to stop an alien menace hell-bent on destroying the Earth.\nAlien Toys of Destruction - Wield an impressive array of alien vehicles and weapons… FOR SCIENCE!\nCustom Weapons, Custom Mayhem – You’ve customized your character.  You’ve customized your clothes.  Now you can complete the look with our all new weapon customization system.  Turn traditional weapons into exotic conversation pieces!\nDynamic Duo - Seamless drop-in, drop-out co-op, a Saints Row standard, improved. The only thing better than one malicious super-powered President is two.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Volition","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":6361,"name":"The Great Jitters: Pudding Panic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/320/3203aab573b87205f3d82e5fc6ef824a.jpeg","description":"Puzzle a shivering jello through 48 levels of a haunted house.\nBut beware! Scary monsters are waiting in the dark! Your only chance of survival is to scare the monsters back before the jello quivers, shivers and faints from fear. Fight evil witches, rattling skeletons and rusty knights with an arsenal of crazy weapons! Collect coins to reload your weapons and valerian for your nerves! Are you clever and skilled enough to escape the labyrinth and to defeat the final enemies?\nTest your courage in 48 suspenseful levels and dive into four beautiful 3D worlds! Many variations in gameplay and lots of challenges will make your pulse rise and your adrenalin flow: Solve puzzles, play against the clock, escape the monsters and win treacherous\nraces!\n48 levels of different gameplay challenges\nhilarious animations and sounds\nbeautiful 3D environments\nsuspense, action and puzzling fun!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Kunst-stoff","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":5721,"name":"EA SPORTS NBA LIVE 15","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e2/2e2e4f165aee54e6df1ba8ac4f386f5e.jpg","description":"Our fans spoke, we listened. NBA LIVE 15 arrives with the most photo-realistic visuals in franchise history and 500+ core gameplay improvements delivering a truly fluid, fun and authentic basketball gaming experience. Reimagined visuals drop you courtside alongside the biggest stars. With all new real-time physics in the paint every drive, post move and collision can be the highlight of the night. Add into the mix best-in-class online game modes and LIVE’s Synergy Sports partnership and you’ll never miss a beat during the NBA season with new content updated daily, all season long.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":3142,"name":"RIDE","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/501/5019c1cb003a8bdda035638a49a609b9.jpg","description":"Bikes from the world's most beloved motorcycle manufacturers, breathtaking races, and a round-the-world trip taking in 15 different locations: all this and more in the new videogame: RIDE.\nChoose from over 100 bikes from the manufacturers that have made motorcycling history, and set off on the World Tour. Challenge rivals at Motorcycle Festivals divided into three different track typologies: from the thrills of the GP Tracks, through the beautiful landscapes of the Country Tracks, and all the way to the challenge of the City Tracks. Race after race, customise and improve your bike in order to work your way up the World Rankings and become the fastest biker in RIDE . As well as the World Tour, players can compete in a variety of different game modes: Quick Race, Time Trial, Split Screen, and online with up to 12 players in the Quick Race and in the Championship.\nWORLD TOUR:\nThe World Tour is RIDE's main game mode, where you can participate in various Festivals around the world, divided into various categories: Superbike 1000, Supersport 600, Historic Championships, and so on. Each Motorcycle Festival features a variety of race modes: single race, championship, time trial, track day, drag race, and endurance. Each race influences your reputation, and therefore your position in the World Ranking of RIDE players.\nMULTIPLAYER:\nUp to 12 players can compete in the online game modes, including quick race and championship; you'll be able to challenge a friend with the split screen feature, and all the results of every race will be recorded on the Leaderboards.\nBIKES:\nChoose from a roster of the most beautiful bikes currently in production, and from the models that have made motorcycling history, with bikes from 14 of the world's leading manufacturers. There are more than 100 bikes in RIDE , with displacements ranging from 250 to 1,299 cc, manufactured between 1987 and 2015. Each bike has its own specific mechanical and dynamic characteristics (power, weight distribution, engine architecture, and so on) that have been integrated with a new game physics specifically developed for Ride that allows players, gamepad in hand, to really appreciate the different dynamic behaviour of each model.\nCUSTOMISATION:\nRIDE lets you choose from a vast range of gear from the leading specialist clothing manufacturers, allowing you to personalise your rider from top to toe: choose from over 100 items and 400 colour schemes!\nYour bike is completely customisable, in accordance with two component categories: appearance and performance. Choose from a variety of models of mirrors and wheel rims, or improve performance on the track by mounting a racing exhaust and remapping the ECU. These are just some of the components that you can customize choosing from a catalogue of more than 100 parts.\nTRACKS:\nRIDE features 15 different circuits in the various locations where the Motorcycle Festivals of the World Tour take place.\nCountry Tracks: mountain passes, countryside, and natural parks, faithfully reproduced from the real world.\nCity Tracks: circuits winding through the city, with long straights and tight corners that really challenge your riding reflexes.\nGP Tracks: actual racetracks, chosen to enhance the sensations of riding in the seat of the bike, and being able to push it right to the edge.\nThe renewed Evolving Track System means that the track evolves lap after lap, guaranteeing improved grip along the rubbered-in ideal trajectory as it gets darker and darker as more bikes pass over it. This really helps push you towards a clean riding style, and helps you learn the braking points and the correct trajectories by studying the behaviour of your rivals.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":15,"name":"Gryphon Knight Epic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8e/f8e506312e2bc8e3ba5cd2c5dd93f81e.jpg","description":"Gryphon Knight Epic is a 2D Medieval Shoot’em up that mixes elements from classical shoot’em ups, exploration and duel-like boss battles, it tells the story of Sir Oliver and Aquila, an accomplished knight and his loyal gryphon that are forced back to adventure once again.\nSir Oliver have already defeated a dragon, married a princess and saved the kingdom. But during his quest he will face adversaries he never imagined he would, because… in reality all of them were once friends. What happened? These heroes would never go rogue… and all at once? Something is rotten in the kingdom and its up to Oliver discover what.\nFight your way through 8 hand-crafted levels\nDuel with challenging bosses and get their weapons\nExplore the stages to find equipment for your character and bits of ancient lore of the world\nEnjoy challenging gameplay and pixel art graphics, just like old times\nWindows, Mac, & Linux versions with Gamepad support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cyber Rhino Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":616762,"name":"Tom Clancy’s Rainbow Six Extraction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/641/6410d62faa02aa2794a323b752dc9084.jpg","description":"Pre-order now for the bonus pack: Orbital Decay Bundle!\nBONUS: Own Tom Clancy’s Rainbow Six® Siege and Tom Clancy’s Rainbow Six® Extraction to unlock the United Front cosmetic bundle in both games + unlock 18 Extraction operators in Rainbow Six Siege.\nSUPPORTS CROSS-PLAY & CROSS-PROGRESSION ACROSS ALL PLATFORMS\nRainbow Six Extraction is a 1- to 3-player co-op tactical FPS. The elite operators of Rainbow Six are now united to face a common enemy: a highly lethal threat known as the Archeans. Assemble your team and risk everything in tense incursions in the containment zone. Knowledge, cooperation, and a tactical approach are your best weapons. Band together and put everything on the line as you take on this unknown enemy.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":471717,"name":"A Little to the Left","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5fb/5fb6cab48577b617b5129dca622e061d.jpg","description":"A Little to the Left (A little more. Keep going. No, too far, back a bit.)\nWe're going to keep on working on this game: clean it up, add some sound, more player feedback, a little more visual punch and a proper ending. Stay tuned for a devlog with more specifics. Thanks for playing our game!\nAbout:\nA Little to the Left reveals the daily household interactions of an individual coping with the feeling of being out of control. Tidy adjustments, sorting, stacking and micro alignments aim to offer relief from a radical possession that holds them with a tight grip.\nInstructions:\nUncover the particular arrangement for the items at hand by clicking, dragging and dropping into place. Correctly placed items are straightened up, and cause much less anxiety.\nCredits:\nConcept: Anne Macmillan, Lukas Steinman\nIllustration: Anne Macmillan\nProgramming: Lukas Steinman","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Max Inferno","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":384488,"name":"Fable (2004)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/686/6861d78c6705ac95094f528e35de3106.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":59193,"name":"Earth Defense Force 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/850/85075373302ff41b93f5471b3c48ee3c.jpg","description":"Become an EDF Soldier and Save Earth\nBecome one of the soldiers of EDF and exterminate the invading aliens. Protect peace on Earth.\nHuman-Looking Aliens Appear for the First Time in The Series\nWhat are the unprecedented and intellectual alien beings from another planet called the 'Primer'? A series-first enemy alien finally appears. The battle with this intelligent enemy produces unprecedented deep despair, while leading the player to the most fun yet as EDF must confront them with courage and wisdom.\nMore Content than Ever, with Online Co-op Mode\nIncludes more than 100 missions in five difficulties and 1000+ usable arms. The two-players co-op mode can also be played on a single screen, and all missions can be played in online co-op mode up to four players. Control four combatants, and join the battle with other EDF members living in the real world.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-2 players\nNetwork Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer\n20GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2018 SANDLOT  ©2018 D3 PUBLISHER","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"D3 Publisher","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":59035,"name":"The World Next Door","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec0/ec0331486659e48d979f244454b4c6c3.jpg","description":"The World Next Door is a narrative-driven, action adventure game that follows Jun, a rebellious teen girl trapped in a parallel world inhabited by magical creatures. Inspired by the emotional storytelling and thrilling action of both anime and indie games, players can expect to meet and develop friendships with an eclectic cast of characters while uncovering the mysteries hidden within this world.\nFeatures\nA supernatural, story driven game with action-heavy puzzle battles\nBranching dialogue and reputation systems that affect your relationships with characters in the game\nFast-paced real-time puzzle battles; activate runes to cast spells and defeat opponents to advance the story\nVS mode available to 2 player local multiplayer\nMore info coming soon!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Rose City Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":44609,"name":"Einar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/874/874e0f670a95cdabc6b917212d75833b.jpg","description":"SummaryEinar is a single-player 3rd person hack and slash based on Norse mythology. The player takes on the role of Einar, who is on a quest to kill the inhabitants of a Norse fishing village who are infected by a mysterious material. Use different weapons such as the bow, hammer and axe to clear the village of the monsters.Features\nIntense combat featuring three different weapon and enemy types.\nBeautiful environments and lighting inspired by real-life landscapes.\nComplex AI which groups and attacks the player from unexpected angles.\nAAA-quality graphics and gameplay.MusicBeautiful Soundtrack and Audio created in collaboration with Moana Production.About\nDreamPunks is game development studio from Breda, The Netherlands.\nEinar was developed by a group of 40 students of the NHTV University of Applied Sciences in Breda, the Netherlands. During the course of one academic year, a group of developing artists, programmers and designers worked on the game with a single vision: making a short but beautiful and engaging game of AAA-quality.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"DreamPunks","platforms":[{"id":0,"name":"PC"}]},{"id":32560,"name":"Quake 2 Mission Pack 2: Ground Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9dd/9ddf529f0db2f522700f1369a3cd0ac5.jpg","description":"Take out the Big Gun sounded simple enough, except the Strogg were waiting. You, and a few marines like you, are the lucky ones. You've made it down in one piece and are still able to contact the fleet. The Gravity Well, the Strogg's newest weapon in its arsenal against mankind, is operational. With the fleet around Stroggos, 5% of ground forces surviving, and that number dwindling by the second, your orders have changed: free your comrades. Destroy the Gravity Well.\nNew Enemies - The Stalker, Turrets, Daedalus, Medic Commander, Carrier, and the Black Widow.\n14 Entirely new levels and 10 new deathmatch levels.\nNew Power-Ups - Deathmatch specific power-ups: Vengeance Sphere, Hunter Sphere, and Anti-matter bomb.\nNew Weapons - The Chainsaw, ETF Rifle and Plasma Beam.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":31454,"name":"Chasm: The Rift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3f/e3fc7474f68ae40d0b29864800787fc1.jpg","description":"ABOUTHaving its roots in 1997 and developed in Ukraine, Chasm: The Rift is one of the most thrilling and innovative FPS from this era and the first Eastern European boomer shooter ever made.THE STORY\nFeeling you are no longer alone, you turn, with just enough time to shoot, killing the mutation charging mercilessly toward you. You begin to sense an eerie feeling of fear in the air, but your skin crawls as you realize it's your own...What was that thing?\nAgain and again you shoot, battling more strange beasts; all grotesque mutations of creatures you once knew. Suddenly the inexplicable becomes clear. Time channels have formed in the Earth's atmosphere, turning once normal life forms into something they were never meant to be. As part of a special commando unit, you must not only ward off and eradicate the beasts, but destroy the time channels to finally rid the Earth of these deadly mutations.GAMEPLAY\nAlong with a heart-pounding adventure through the Corridors of Time and the satisfaction of ripping limbs from hideous monsters with the iconic BladeGun, and an innovative weather system, the player will now be able to enjoy this late 90’s FPS classic with the comfort of modern PCs, now with full 4K support, improved sound design, achievements, and localised into twelve languages.GAME FEATURES\n- Blow off monsters' limbs even as they continue to attack with remaining appendages\n- Different effects including water, rain, snow, wind, smoke, dust, sparks, explosions and distant fades\n- Awesome array of weapons, including unique Blade Gun\n- Enhanced graphics with full 4K support\n- Improved sound designBONUS\nThe original Chasm: The Rift version powered by DOSBox is included as a bonus.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"General Arcade","platforms":[{"id":0,"name":"PC"}]},{"id":21203,"name":"7 Wonders II","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c18/c186896524e8f805620a258e623da703.jpg","description":"Journey back in time with the 7 Wonders series to when magnificent structures were being built in far away lands. Enjoy challenging match-3 gameplay in a newly enhanced interactive environment where you not only learn about marvelous new wonders such as Stonehenge and Taj Mahal, but also watch them come to life piece by piece before your very eyes.\nIncredibly enhanced animation\nNew explosive power-ups such as the Single Cell Bomb, Chameleon and Timer Freeze\nSeven all new locations to explore and Wonders to learn about\nTake part in the construction by choosing what section of the Wonders to build first and visually see the progress on the screen and the game board\nStrategically match, using a limited number, to get critical pieces down the board\nUtilize a new shuffle option to refresh the board and keep the game moving","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"MumboJumbo","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"}]},{"id":20502,"name":"Firefly Online Cortex","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d0/0d04686e5e955fecdeb528e6ebfc9b29.jpg","description":"The Cortex is your ultimate destination for Firefly Online news and information. This companion app is a great way to manage your profile, stay current with the game’s progress, take advantage of special offers and gain access to exclusive content (Big Damn Hero interviews, for example).\nThe Cortex will also be your place to get the Big Damn Hero package. You are not required to make this purchase. If you choose not to, it won’t affect your gameplay in any significant way. However, if you’re hankerin’ for an early taste of the Verse, grab yourself some exclusive loot along the way and help support the development of the game, this’ll be a shiny way to do it.Experience the Cortex:\nThe app is absolutely free. Those of you with a basic account can use the Cortex to:\n•  Log in and manage your profile\n•  Keep up-to-date with news and special offers\n•  View the cast interviews and gameplay videos\n•  Earn points that will convert to in-game currency\n•  If you don’t have an account, the Cortex will make signing up quick and easy.\nFor an enhanced experience, you can spend $4.99 to become a Big Damn Hero. By purchasing this premium package, you’ll receive both instant and long-term rewards.Becoming a Big Damn Hero\nBig Damn Heroes will get The Map of the Verse: a beautiful, highly-detailed, three-dimensional map with every planet and moon in the ‘verse, including planetary details and trivia.\nThe Map of the Verse will be a great addition to your Firefly collection, not to mention an indispensable tool for those of you who play pen-and-paper games. The Map also includes the Trade Route mini-game, a scavenger hunt that earns you rewards, including digital Firefly Cortex Cards.\nCortex Cards can be traded in for even more points. And if you manage to complete a card set you can unlock exclusive digital loot that will be usable when Firefly Online is released. Yes, we thought you’d like to play a game while you’re waiting to play the game.\nAlmost everything you do in the Cortex earns you Brownie Points. If you’re just using the free app, those points will be tradable for in-game currency when Firefly Online ships. However, if you’ve decided to become a Big Damn Hero, those points will earn you digital loot each time you reach preset milestones. You can even get Cortex Card packs (which can also be purchased for cashy money) by collecting Brownie Points, in case you don’t want to take a job from Captain Mal, but still want to collect those shiny Cortex Cards.\nAnother benefit of being a Big Damn Hero is the Crappy Town Where You’re the Hero adventure. When Firefly Online is released, Big Damn Heroes will be invited to accept a job in a little frontier town where folks are in sore need of someone to step up and deliver them from oppression. After completing the job (details of that job will be yours to discover along the way), you’ll earn a statue with your captain’s likeness, placed smack dab in the middle of town square for all to see – including other players.\nBig Damn Hero exclusives include:\n•  The Map of the Verse.\n•  The “Crappy Town Where You’re a Hero” adventure to earn a statue of your captain.\n•  Ability to collect Cortex Cards and earn rare digital items for use in the game.\n•  Your name in the game credits.\n•  Badges to show off your account rank.\n•  Developer Diaries and interviews.\n•  Surveys soliciting your feedback on game features.\n•  A chance to submit ideas during our Big Damn Contests.\n•  Assuming enough folks like being BDHs, this list of shiny exclusives will continue to grow!\nFirefly Online is a self-funded game being created by an independent team of industry veterans who share your love of Firefly. We’re hoping there are Firefly fans out there in the Black who want to support our efforts, and you’ll be doing just that when you become a Big Damn Hero.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spark Plug Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20476,"name":"Who Is Mike - A Visual Novel","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/298/29809f8d32598a3ac0f3ff6c17f59496.jpg","description":"You wake up with an aching head and the world out of focus. In front of you is a man accusing you of being “fake”. He looks exactly like you, down to the last scar and pimple, has the same memories, the same voice and the same personality.\nBut who is lying and who is telling the truth? Who is fake and who is real?\nWith over nine different possibilities, you can either end up as the tragic hero, the sly villain, or an innocent victim. Will you keep your cool or pick a fight? Play through all the endings and take a peek at the truth of your demise.\nWhatever action you take, ultimately, you must answer the question: “Who is Mike?”\nFeatures\nScreensize: 1280 x 800\nEndings: 9 endings\nLength: 10,500 words (approx. 2 hours gameplay)\nCGs: 22 CGs\nGenre: Mystery/Thriller, Supernatural, Comedy\nRating: PG-16+ for Strong Language and Violence","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fervent","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19820,"name":"Bizarre Earthquake","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ea/8ea5f3ab2ca70fc2294f13b3274574e4.jpg","description":"The story is about a seismologist and her assistant who try to uncover the mysteries behind a bizarre earthquake they encounter. Cansu, the seismologist, is very ambitious. She will do anything to discover the truth and share it with the world to further her career. Her assistant, Bora, reluctantly assists her in this mysterious adventure.\nFeatures\n* 2 Playable and Switchable Characters.\n* Each character has their own puzzles to solve. This means the player always has two options to progress through the story (except the beginning).\n* Cinematic cut-scenes.\n* Bonuses await to be unlocked.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Proximity Games","platforms":[{"id":0,"name":"PC"}]},{"id":19492,"name":"The Charnel House Trilogy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebb/ebb63b1c9534fb9ea2469a18442e404c.jpg","description":"A train's whistle sounds in the dead of night. Snow falls on deserted tracks. Somewhere, in the city, a woman prepares to leave on a journey that will change her life. Somewhere, in the country, a man drives to his final destination.\nWitness The Charnel House Trilogy, the chronicle of one fateful night aboard a train bound for Augur Peak. Three thrilling, horrifying adventure games in one, from the depths of the Sepulchre, starring Madeleine Roux, Peter Willington, Jonathan Grier, Jim Sterling, and Ben Chandler as Grub. With art by Ivan Ulyanov and Ben Chandler, and music by Jack de Quidt, nervous_testpilot and Bryan Henderson.\n\nA young woman prepares to depart on a journey that will take her into the very heart of darkness. But before she can leave her apartment, there are just a few loose ends she has to tie up...\n\nJoin Doctor Harold Lang on that fateful train journey that started it all. Who is the man in 2-C? What is the conductor hiding? And just what is the secret behind all the huge bags?\nAlex Davenport wakes up on the train. Her travelling companion, Harold Lang, is nowhere to be found. Don, the conductor, isn't exactly being forthcoming as to what's going on. Why are Alex's friends here? Who's the ballerina? Is this a nightmare, or is Alex's hope of waking up simply a pipe dream?\nFrom the studio that brought you Richard & Alice comes a new journey into terror.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Owl Cave","platforms":[{"id":0,"name":"PC"}]},{"id":18900,"name":"Pirates of Black Cove","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/240/240fd349382041f5853f4b0f010830fc.jpg","description":"Set in the golden age of pirates, this is your chance to become pirate king and conquer the Caribbean.\nJoin, champion, and unite the three pirate factions: Pirates, Corsairs and Buccaneers. You must ultimately leverage this unity in all out war against the evil Pirates of Black Cove.\nManage and develop parts of three strongholds and visit them to pick up faction and storyline missions. Visit the Alchemist to find out what special ingredients are needed for the wacky potions and embark on adventures to find and collect them.\nUnite the three Pirate factions to gain access to their hero units and ultimately take down the Pirates of Black Cove and become King of all the pirates. If you have what it takes that is.\nKey features:\t\t\t\t\t\tRoam the open World with your Pirate crew and pick up missions as you sail the seas.\nNotoriety and fame brings you closer to your ultimate goal: the King of All Pirates\nBattle it out with the forces of Black Cove and other colonial  nations on both land and sea\nSelect  your character from several different Pirate Captains, each with their own unique skills and features\nMake creative use of some of he wackiest land and sea based weapons ever to grace a Pirate world\nVaried units and weapons allows You to carry out the battles as You see fit\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nitro Games","platforms":[{"id":0,"name":"PC"}]},{"id":15885,"name":"FRONTIERS","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b1/7b12d994bc30c05cd492e4bf102f48a1.jpg","description":"FRONTIERS blends the feel of first-person RPG classics like Daggerfall with the relaxing tempo and simplicity of a point-and-click adventure. Discover ancient mysteries, live off the land and fight deadly creatures, all in a beautiful, massive open world.Is FRONTIERS for you?\nI can still remember the first time I played Daggerfall. Yes, it was uglier than a monkey's armpit and controlled worse than a bumper car on a frozen lake. But it also created the feeling of a world that lived on even after I'd stopped playing, and that feeling still sticks with me all these years later. A world where you could spend hours searching every pixelated nook and cranny. A world of potential. A world of exploration...\n...and then a Dragonling would chomp my face because I hadn't spent ten hours grinding in the easy regions. Arg! So frustrating!\nOther games have touched on that elusive feeling, especially Elder Scrolls and early Fallout games, but as fun as they are and as much as I love hardcore RPG mechanics, I've always dreamt of a game that emphasized exploration above all else.\nIf you feel the same way then yes - FRONTIERS is for you!Key Features:Massive open world - go anywhere, any time\nUnique relaxing pace and tone\nAn exploration-focused main quest that spans an entire continent\nSimple gameplay - no stats or skill trees to memorize (It barely qualifies as an RPG, really)\nLive off the land - hunt, trap, fish and cook dozens of varieties of plantlife (including hallucinogens!) and a dozen varieties of animal\nMinecraft-style item crafting system\nDozens of skills to discover and learn, including magic, survival and stealth skills\nHundreds of shops, taverns, homes, caves, castles and other structures to explore\nA haunting soundtrack for every region\nFull mod support\nNEW: Oculus Rift support\nNOTE: I recommend reading reviews & forum posts before purchasing, especially concerning Linux support.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"AAD Productions","platforms":[{"id":0,"name":"PC"}]},{"id":13774,"name":"Strike.is: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b3/8b3963c2ec8e8ea5142ab407593b635c.jpg","description":"Strike enemies or die trying!\nWarning: Incredibly addicting Multiplayer Game!\nLAG: If you experience high latency, please open the Settings Menu and change your server location\nYou are a cell, wandering around looking for smaller cells to absorb and grow.. wait! That is another game! You are a cell and somehow you learnt how to use guns! Embrace your weapon and destroy your enemies. Collect the ammos and fire your enemies down, use the second weapon power smartly to survive!\nStrike.is offers you:\n- Multiple Game Modes: Free for all, Random Team, Guild War, and more coming soon!\n- Private rooms to play with friends\n- Guild system to play with your friends in ranked matches\n- Lot of different weapons each with different powers\n- Incredible chiptune music!\n- Have a lot of fun!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Freakinware","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13747,"name":"Investigator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48e/48e775ace1d71b90a643208de11baaa9.jpg","description":"Trading Cards Available!\nAbout the GameInvestigator is a first-person walking simulator with horror elements, where the events take place in a world of extreme weather cataclysms. The main character used to be a private investigator, but now he is but a mere stranger\nforced to roam from house to house in search of food and an overnight stay.\nWalking simulatorImmersive audio effects guarantee unforgettable game experienceVarious locations starting from mysterious villages to dark basementsIntense atmosphere throughout the gameThe use of CryEngine makes the picture realistic and smooth","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"AdroVGames","platforms":[{"id":0,"name":"PC"}]},{"id":13019,"name":"Disney's Pixar Brave: The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a6c/a6c68aba6208a3b8a26cf2cdc41a5e0c.jpg","description":"Brave: The Video Game is a Third-Person Action-Adventure game that is a companion release to the Disney/Pixar 2012 major animated release of the same name. Brave is Pixar's first fairy tale release and features the adventures of Merida, the studio's first female lead character in a movie. The game features: a family-friendly storyline, bow and arrow as well as a sword combat, agile in-game movement, puzzle play, characters from the movie as well as others unique to the game, and compatibility with both Windows and Mac operating systems.\nInspired by \"Brave\", the Disney/Pixar animated fantasy adventure movie, Brave: The Video Game invites players to run, jump and battle their way through the rugged landscape of mythical and mysterious Scotland. By using their wits and bravery, gamers will also be able to wield a sword and bow and arrow to defeat fierce enemies, break a magical curse and save a kingdom.\nPlay as Merida, Pixar's first female hero and an expert archer, or in the console versions players can also play as other entertaining characters from the film. In addition, they will be able to go on quests through a magical world and solve puzzles to uncover secrets. Gameplay features include an exciting single-player campaign, co-op for family and friends and a special Bear mode, in which players are able to play as a bear.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Behaviour Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":11575,"name":"Grand Pigeon's Duty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da4/da461b85c69f535f2241f48e426e127c.jpg","description":"In the near future people decided to abandon human organs and replace them with innovative petrol implants that allow to prolong life. Almost all food businesses were ruined or converted into refueling.\nDue to lack of organic food pets were on the verge of extinction. Worst of all had birds that were unable to adapt to new conditions of life without human food.\nPigeons organized resistance, which aims to attract people's attention to the problem of hunger and restore bakery companies for their bait.\nPigeon John decides to help urban birds with his unusual disease of the digestive system.Features Short interesting story\nStrange funny pigeons\nThe various game mechanics (yep, a bird defecation - just the beginning)\nMultiple endings\nTrading Cards\nAchievements\nLow price","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"WolfgangIs","platforms":[{"id":0,"name":"PC"}]},{"id":3127,"name":"Goosebumps: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a9/5a96ffecd151fd8c4631a6b21212b1fa.jpg","description":"The walk home from school today is going to be a lot spookier than usual… Your sleepy neighborhood’s been overrun by monsters! Werewolves prowl the woods, Gnomes roam underfoot, and scarecrows walk at midnight. But these aren’t ordinary monsters—they’re R.L. Stine’s famous Goosebumps monsters, released from their books and looking to wreak havoc! You’ll need to use your wits to investigate the surroundings, puzzle out clues, and outsmart the monsters before it’s too late! Survive a trek through your neighborhood, unravel the mysteries of the Dead House, and sneak through the mall after hours; only then can you confront Slappy and stop his plans for revenge! Players beware… you’re in for a scare in the exciting Goosebumps video game, a prequel to the major motion picture in theaters October 16th!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo 3DS"}]},{"id":2459,"name":"MegaTagmension Blanc + Neptune VS Zombies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f8/8f8235335bf1ca11d685436bb72b577d.jpg","description":"The prestigious Gamicademi – a school of fading glory. To put it back in the spotlight, Blanc and friends decide to film a zombie flick on campus. All’s quiet on the set until real zombies start crawling out of the woodworks! Now they’ve got to send these zombies to detention in this hack ‘n’ slash or else be history!\nKey Features\n1.\tRack up crazy combos against zombie hordes with a two-person tag team!\n2.\tTeam up with up to 3 other friends in online Multiplay mode to take on multiplayer quests, with new quests updated daily!\n3.\tMore characters join the battle with their own fighting styles, including Plutia, Peashy, Uzume, and a new playable character – Tamsoft!\n4.\tDress to kill with customizable equipment, and accessories that can be put pretty much anywhere\n1 player(s)\nAd Hoc Mode 2-4 Players\nNetwork Players 2-4\n896KB Minimum\nTouchscreen\nDual Analog Sticks\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\n©2016 IDEA FACTORY / COMPILE HEART / TAMSOFT All rights reserved. MegaTagmension Blanc+Neptune VS Zombies is a trademark of IDEA FACTORY. Licensed to and published by Idea Factory International, Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Idea Factory","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":776273,"name":"Nomad Survival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8a/b8a0362a16e272cd6586229ed6c8fd7f.jpg","description":"Nomad Survival is an auto-attacking, wave clearing, time-based Roguelite, where you can expect to become stronger as you play through each run as you upgrade your stats. The gameplay involves waves of enemies from all angles coming to defeat you, with each minute changing what types of enemies may be coming and how they behave in a predictable fashion. You control the movement of your Character, automatically using abilities available to you to defeat your foes, acquiring new abilities (or leveling up old ones) whenever you acquire enough experience to level up.\nYou can have as many abilities as you want, with each non-passive ability granting bonus effects at levels 5 and 10 (10 being the max level an ability can be).\nEach Character boasts a different style of play through Weapon Skills, which is the special innate ability each Character starts with that is exclusive to them and improves over time naturally. Characters can then be given a Heritage, which further changes how the game is played. The Nomad Heritage, for example, offers the player an additional reroll on level up, whereas the Poxbringer Heritage converts all of your damage into damage-over-time instead.\nWhile there are only two Maps to be played, each Map is wildly different in more than just the difficulty and density of enemies. Each Map also boasts unique events that complicate the run and keep you on your toes, as well as 4 unique Boss encounters which will require you to adapt your strategy to overcome.Here's a brief overview of what you can expect when playing Nomad Survival:\n3 Unique Characters (4 more which can be unlocked!)\n17 Active Abilities and 19 Passive Abilities\n1 Heritage (4 more which can be unlocked!) which change the playstyle of each run.\n2 Maps, each with 4 Boss encounters.\nModifiable Game Speed. Play at 150% or even 200% Game Speed!\n79 Achievements, some of which unlock new features.\n20 Stats to be Upgraded.\nThe game is all about finding builds that you feel are powerful and fun, while also never making the game too easy to play that it becomes boring. The first Map allows for you to enjoy the game and experiment with various stats while taking on unique challenges, whereas the second Map is significantly more difficult and will preset a serious challenge to anyone that wants to test their mettle against more serious opponents, events, and Boss enemies.\nFeel like the game is too slow? Increase the Game Speed at the Level Selection screen. You can make the game 50% or even 100% faster, for a true test of your skill and reflexes!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"The Fox Knocks","platforms":[{"id":0,"name":"PC"}]},{"id":736275,"name":"Disney Speedstorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd1/dd1badc9953c92206f7b5d9ca9e60dfb.jpg","description":"The ultimate Disney and Pixar racing experience\nDrift into the ultimate hero-based combat racing game, set on high-speed circuits inspired by Disney and Pixar worlds. Master each character’s unique skills on the racetrack and claim victory in this thrilling arcade racing experience from the creators of the Asphalt series!\n\n \n\nDISNEY & PIXAR GO FULL BATTLE RACING\n\nAn incredible cast of characters including Captain Jack Sparrow, Mulan, Mickey Mouse, Sulley, the Beast and more are suited and revving up for racing combat. Upgrade each racer’s stats and make the most of their unique skills that can impact the outcome of a single race and dramatically change the way you play the game!\n\n \n\nARCADE RACING REDEFINED\n\nAnyone can pick up and play Disney Speedstorm but mastering skills and techniques like timing your nitro boosts, precisely drifting around corners, and adapting to dynamic track environments are crucial to dominating each race.\n\n \n\nRACING TOGETHER HAS NEVER BEEN EASIER\n\nPick your racer and speed through action-packed tracks solo, or challenge friends in local and remote multiplayer modes. You can even face off with players from around the globe to become an online legend.\n\n \n\nDISNEY & PIXAR INSPIRED RACETRACKS\n\nStart your engine in environments inspired by some of your favorite Disney and Pixar films. From the docks of Pirates of the Caribbean’s Pirates Island track to the wilds of The Jungle Book’s Jungle Ruins map, and even racing on the Great Wall of China itself from Mulan or the Scare Floor from Monsters, Inc., you can experience these worlds from a fresh, exciting perspective geared specifically for racing!\n\n \n\nCUSTOMIZE TO YOUR OWN STYLE\n\nChoose your favorite racer’s suit, a flashy kart livery, and show off stylish wheels and wings -- all of this and more is possible with the extensive customization features in the game!\n\n \n\nNEW CONTENT RACING YOUR WAY\n\nThe action never slows down thanks to fresh seasonal content always around the corner. New Disney and Pixar racers will be added regularly, bringing special skills for you to master (or overcome), and unique tracks will be created often, to pump fresh strategy into the mix. Support characters, environments, customization options, and collectables will also drop in regularly, so there’s always more to experience.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Gameloft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":284755,"name":"Chaos;Child","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/077/0778d994cac6a7ded588a61d9014a0eb.jpg","description":"It's been six years since a massive earthquake leveled the city of Shibuya. Now, in October 2015, while researching a number of recent murders, Takuru Miyashiro realizes a horrible truth. These murders are the return of a series of killings that plunged Shibuya into terror six years ago. And at the same time, people called gigalomaniacs, with the powers to make their delusions real, are beginning to awaken...\nGAME FEATURES\nDiscover A Darker Japan\nExplore Shibuya in 2015, after an earthquake nearly levelled the city six years prior, and try to outsmart the puppet-master behind this New Generation Madness.\nTrack Down A Serial Killer\nPlay as Takuru, an arrogant senior and the newspaper club president, and discover the pattern in a series of bizarre deaths around you that the police can't seem to crack.\nUnravel The Mystery\nInvestigate gruesome, supernatural murders with a team of uniquely talented friends.\nPick Your Delusions\nChoose to explore disturbing nightmares or pleasurable daydreams to affect the different realities that Takuru perceives, and change your story.\nSee The Bigger Picture\nUnlock SIX endings by changing the course of your team's investigations and relationships, and understand the characters and plot in depth.\nOutstanding Artistic Value\nEnjoy beautiful and ethereal art work in this stunning visual novel from the Science Adventure series.\nFrom The Creators Of STEINS;GATE\nA stand-alone story with a brand new cast, extensive replayability and ties to the Steins;Gate universe!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MAGES","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"}]},{"id":241070,"name":"PokerStars VR","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ec/7ec729de517c388dab69ed800227caf2.jpg","description":"PokerStars, the world’s leading poker brand, has combined live and online poker in a truly immersive VR experience.\nStudy your opponents, pick up on their tells, and chat in real time\nHandle your chips and cards, just as you would at a real-world poker table\nKeep the table fun with interactive props and toys, summoned in an instant\nThis is the most exciting poker game on the planet, and there’s a seat open for you right now.- KEY FEATURES -Authentic poker action\nA fully immersive, social experience\nSimple, intuitive, easy to play\nPlay real opponents\nRealistic physics, from cards and chips to balloons, pistols and more\nUnlock free chips every day- EXOTIC LOCALES - Macau 2050: A futuristic re-imagining of Macau by night\nMacau Suite: An opulent yet intimate and relaxing environment\nThe Showdown Saloon: Play in a classic Wild West saloon\nThe Monte-Carlo Yacht: Take to the high seas\nThe Void: Play with no distractions","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lucky VR","platforms":[{"id":0,"name":"PC"}]},{"id":23105,"name":"System Shock Demo","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/398/3980f054165f7b4de8c661bf4d0c0822.jpg","description":"After two decades, Nightdive Studios is rebooting and re-imagining the original System Shock. We will keep the new game true to the classic experience, keeping all the things you loved while giving today's gamers the modern look and feel expected from a AAA title.\nThis Pre-Alpha Demo will give you a brief preview of the game. Please keep in mind this is a very early demo, so performance, content, etc is not final.\nWith the help of members of the original team, including the original Voice Actor of SHODAN, Terri Brosius, Citadel Station has never been more immersive or terrifying!\n“When you’re working on a game, you tend not to think about how people will feel about it 20 years later – or if people will even remember it! The announcement of the System Shock update from Nightdive (and the upcoming System Shock 3 I’m working on) it’s apparent that not only do people remember, they care very deeply about the game. Back when we were working on the original, we wanted to make a simulation-based game that would empower players to tell their own stories through their playstyle choices – an idea that’s still totally relevant today. I’ve long said that if you updated the graphics, sound and UI on System Shock you’d have something that competes directly with any game on the market today. Now the Nightdive folks are doing that update and I’m confident my prediction will be validated. SHODAN demands that you support this so we can all find out.” --Warren Spector, OtherSide Entertainment. Producer on the original System Shock.\nYou're a renowned hacker, the most notorious cyberspace thief in the corporate world. Caught during a risky break-in, you become indentured to a greedy TriOptimum executive. After six months in a healing coma, you awaken to the twisted aftermath of a terrible disaster. Where are the surgeons? Why is the station in such disrepair? Slowly, the chilling realization that something is very wrong creeps over you. Once a prime corporate research facility, Citadel Station now teems with mindless cyborgs, robots and terribly mutated beings, all programmed to serve SHODAN, a ruthless A.I. There's scarcely time to think before it unleashes the first terror...\n“The crew at Nightdive heroically brought the original versions of System Shock and System Shock 2 back into circulation. They have thrived as a new audience has rediscovered these classics. Now Nightdive is remastering the original System Shock to bring it up to date on modern PC’s - with fully updated visuals, audio and a modern interface – making it dramatically more accessible to modern gamers. It’s quite wonderful to see a franchise that Warren and I helped create get such loving care.\" --Paul Neurath, Founder of OtherSide Entertainment. Co-founder of Looking Glass Studios.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Night Dive Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20991,"name":"iPi Recorder 2","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/829/829cf609c02dc7df2674e6d9790b5ca6.jpg","description":"iPi Recorder is a software program provided by iPi Soft for capturing, playing back and processing video records from multiple cameras and depth sensors. Captured records can be used for motion tracking in iPi Mocap Studio.\niPi Recorder supports the following cameras and depth sensors:\nSony Playstation Eye\nMicrosoft Kinect for Windows / Kinect XBOX 360\nASUS Xtion / Xtion Live\nAny DirectShow compatible web cameras\nKey Features\nTechnology: Optical Markerless\nNumber of cameras: 1 or 2 Kinect (or ASUS Xtion) depth sensors or 3 to 6 Sony PlayStation Eye cameras\nOutput Format: *.iPiVideo\nVideo Recording Conditions and Environment:\n- Indoor and Outdoor     - Normal Lighting Conditions      - No Markers Required\nActor Clothing Requirements:\n- actor Can Wear Reasonable Casual clothes.    - Tight-fitting solid-color clothes recommended.   - Jeans and T-shirts are supported.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"iPi Soft","platforms":[{"id":0,"name":"PC"}]},{"id":20916,"name":"TDP4:Team Battle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/623/623cd001bfd67375ccb2a4122fe712db.jpg","description":"TDP4: Team Battle - a Free-To-Play 2D multiplayer flash platformer shooter game with RPG elements!\n* Features various game modes: Deathmatch (DM), Team Deathmatch (TDM), Capture the Flag (CTF), Last Man Standing (LMS), Domination (DOM), Elimination (ELM) and Duel mode!\n* More than 40 different weapons: from pistols to futuristic laser weapons!\n* Powerful skill system. Train your character and make him stronger!\n* Receive medals and in-game currency prizes for completing different achievements. Get high rating to become the best in TDP4 and the most respected!\n* Create you own or join an existing clan. Fight for your clan brothers and gain strategic points!\nTry TDP4: Team Battle right now!\nJoin the game today!Key Features\n2D Shooter\nVarious game types\nRPG skills system\nTournaments system\nClan system\nAchievements","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JAVELIN OÜ","platforms":[{"id":0,"name":"PC"}]},{"id":19406,"name":"Trackmania United Forever Star Edition","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ac/3ace8d21a5d653c775844d591f3f14ef.jpg","description":"TrackMania is the most entertaining car racing game ever. Millions of players play it in single or multiplayer modes. TrackMania United Forever is the ultimate TrackMania edition thanks to the numerous additions and innovations it has to offer. This version brings together all the environments of the series and comes with a huge, enriched single-player campaign including 4 different modes and 420 progressively difficult tracks.\nDrive at mind-blowing speed on today's most spectacular tracks. Soaring jumps, loops, hairpin bends, turbo boosts, track-breakers, rails and ramps...every track delivers a new and intense experience, offering sensational gaming across single and multiplayer modes.\nFeatures:\n4 single player modes (Race, Platform, Stunt and Puzzle) on 420 spectacular progressively challenging tracks.\n7 types of vehicles offering different gameplay and driving experiences in 7 TrackMania environments - of which one, Stadium, is compatible with the free game, TrackMania Nations Forever\nSolo and team based multiplayer modes. Join millions of players online on the TrackMania servers.\nA spectacular graphics update for the three historic environments (Desert, Snow and Rally.\nIntegrated peer-to-peer sharing system to showcase all of your customizations with your opponents (modified vehicles, avatar...).\nEarn \"Coppers\", the virtual currency of TrackMania players, by winning medals in solo mode or by trading your TrackMania creations with other players (cars, skins, tracks, videos...)\nOfficial rankings in solo and multiplayer. In solo play, along with earning medals for great racing, you can participate in official rankings by recording your best times on the game's tracks.\nCreate your own tracks, vehicles and videos with the TrackMania editors, paint shop and movie studio!\nContinue with all your data from TrackMania Nations Forever, including medals, ladder positions, scores, and friends.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Nadeo","platforms":[{"id":0,"name":"PC"}]},{"id":17852,"name":"Deadlings: Rotten Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a8/3a8d5e50f82155be7092098548c68f56.jpg","description":"Death is lonely. He has zero friends on his FaceTome account and no one to hang out with. So, in order to feel better he begins “Project Deadlings”. Death buys a factory where he can build his laboratory and begin training a massive army of zombie minions.\nAs the army of Deadlings grows, the mazes of the laboratory become deadlier, loaded with puzzles and death-defying traps. Different Deadlings have their own unique abilities: Bonesack is agile - he can run and jump, Creep can climb on walls and ceilings, Lazybrain treads slowly but carefully and Stencher... well Stencher has gastric problems so he can use his powerful gas clouds to fly.\nYou will have to combine all of these abilities to find your way in Death's Maze.\nCan you help Death to kill his boredom? Will you be able to navigate all 60+ levels available in Deadlings? Will you complete Project Deadlings, and successfully train all of your zombie minions?\nArcade side-scroller with strategy elements!\nFour different types of zombie minions with unique abilities!\n70 levels of pure zombie gore fun!\nAdditional game mode - Nightmare - only for the hardcore gamers!\nWhat's new in the Rotten Edition?\n10 brand new bonus levels\n15 new levels in Nightmare Mode\nSteam achievements and leaderboards\nFull controller support\nNightmare mode unlocked from the beginning\nSteam Trading Cards and Badges\nHD graphics","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"One More Level","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16783,"name":"BIT.TRIP VOID","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/341/341a5a3d9d79824eff99ec69d6bd95f1.jpg","description":"BIT.TRIP VOID is the third installment in the retro-arcade BIT.TRIP saga.\nBIT.TRIP VOID is a synesthetic exploration of rhythm and music as they pertain to our everyday lives and moods.  In a control scheme brand new to the series, yet wholly familiar to gamers, the player is given complete freedom to move about the screen wherever they desire, interacting with the music in brand new ways.  The classic gameplay aesthetic remains, as color—and the absence of color—are explored to the fullest.\nTrip out and see if you can survive the onslaught of Beats and further your own BIT.TRIP.MIND-BLOWING FEATURES INCLUDE:Brand New Difficulty Modes!\nMid-Level Checkpoints!\nEpic Boss Battles!\nA Rockin' Chiptune-Inspired Soundtrack!\nSpecial Chiptune Guest Star Nullsleep!\nSynesthetic Music/Art/Gameplay Interaction!\nHyper-realistic Retro Cutscenes!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15735,"name":"Total Extreme Wrestling","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/725/725a1769ec2233dfde21034a0a220368.jpg","description":"Step into the world of wrestling in World Total Extreme Wrestling 2010. In this simulation title, you play the role of a wrestling promoter, and it is up to you to steer your company to the top of the industry! You are in control of everything – deal with superstar egos, negotiate through wars and alliances with other wrestling promotions, and deal with the demands of TV networks. Do you have what it takes to lead your wrestling promotion to the top of the industry?Features:\nThe most accurate wrestling simulator ever made, including wrestlers with styles that can change and over time due to injury, age, or skill level changes.\nThe in-depth editor tools allow players to create their own databases, including a Quick Wrestler Creator.\nThe \"Create a Product\" mode allows you to fine tune a promotion's style to your exact specifications, from specifying how long matches are expected to last to how much appeal the promotion has to mainstream audiences.\nUser Characters allow you to enter the game world, and take part in shows, whether you want to be a wrestler, an announcer, or simply stay backstage away from the cameras. Grant specific strengths to your created characters.\nThe new title lineage feature allows you to pre-set histories for any championship in the game, allowing wrestler's old title reigns to be recognized.\nThe Game World Balancer automatically makes sure that there is a good distribution around the world of key staff like announcers and referees.\nAdvance Booking mode allows you to pre-advertise matches of any type for your upcoming shows.\nAll title belts have a prestige value, meaning you can try to raise certain championships in the eyes of the fans.\nIn-depth merchandise settings.\nPromotions can now have up to three different brands within the company.\nFatigue affects wrestlers, meaning careful wrestler management is a key skill.\nDrag and Drop Booking.\nUser Preferences allow you to maximize your ability to customize the gameplay experience.\nNarratives allow for an element of storytelling in the game world. The user can pre-set certain events to happen on specific days, along with the optional ability to create a story explaining the event that will appear on the in-game web site.\nMuch, much more!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grey Dog Software","platforms":[{"id":0,"name":"PC"}]}]