[{"id":10648,"name":"Jackpot Poker by PokerStars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b6/5b6314d9b0dd5a99123820cb331484e5.jpg","description":"Jackpot Poker by PokerStars - the world’s largest online poker brand\nEnjoy non-stop casino poker action. Jackpot Poker offers a huge range of tables from the biggest name in poker, PokerStars. With hundreds of tables and thousands of real poker players, you can experience more gambling excitement, more betting thrills, more poker!\nJackpot Poker is home to fast format Spin and Go Jackpot Poker Tournaments – a rapid 3-Player Poker jackpot tournament in which players can win up to 3,000 times their initial gamble using play-money chips! And best of all its free-to-play, with multiple ways of gaining free chips and a daily allocation to keep you in the action.The Official Spin & Go Poker GameChoose a tournament, spin the bonus wheel and get a Jackpot reward multiplier. Build the strongest poker hand or bluff your way to victory as you beat your opponents and win millions of chips. Our Spin & Go Texas Hold’em Poker tournaments takes you around the world and all have different buy-in levels - so you can start off small and gradually build your Texas poker skills.Win Endless Free Poker ChipsWe give away up to 100 million Free Bonus Poker Chips every week! Get regular chip bonuses every four hours and participate in our free coin giveaways as you play. Better than any Poker Tour, more riveting than any Poker Casino!Want to Mix it with the High Rollers from Day-One? Purchase a Chip Bundle through your Steam Wallet and get to the big action in an instant.\nAdditional Features to Enhance your Poker Experience\nAuthentic: Nothing but real poker players, no machines, no computers.  We never use bots and you always play against the best poker players in the world.\nPoker Quizzes: Solve poker questions and riddles & win free chips\nLiquidity: With over 400,000 PokerStars daily players - a huge range of tournaments and traditional game buy-ins\nProgress: Progress through game levels and edge your way to the top tables as you become a true Texas Hold’em Poker master\nHundreds of thousands of Poker players play Jackpot Poker every day – can you beat them?\nThis product is intended for use by those 18 or older for amusement purposes only. Chips do not represent a real money cash value – this is a play-money poker game and no cash-out is available. Practice or success at social casino gaming does not imply future success at real money gambling.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stars Mobile","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":9765,"name":"DESYNC","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4db/4db6700a1f15bb7f70ae8fe77bc059b2.jpg","description":"//ENTER A DIGITAL OTHERWORLD\nDESYNC is an intense, single-player first person shooter that begs you to play dangerously and creatively. Eliminate your opponents as you perform violent attack sequences using the explosive digital weaponry and lethal side-arms at your disposal.\nSwitch weapons and move masterfully to unleash Attack Sequences –  special moves that deal bonus damage and effects. Launch an enemy into a trap with a well-placed shotgun blast, then destroy another while they’re in the air. Think quickly and discover new combinations to maximize your score and decimate the leaderboards.\n//FEATURESFast, reactive, intense FPS gameplay with a unique combo system\nDetailed leaderboards for each level help players measure their improvement\nSleek poly-neon aesthetics within a foreboding atmosphere\nRuthless enemies armed with a variety of defensive and offensive abilities\nMultiple fire modes on each weapon allow for experimentation and varied playstyles\nAberration Zones that subvert and invert the base game for greater challenges\nHeavy Dark Synth Original Soundtrack by Daniel Deluxe and VolkorX","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Foregone Syndicate","platforms":[{"id":0,"name":"PC"}]},{"id":7518,"name":"Kinect Sports Rivals","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a0/9a0401233596255a0166d0e6557ade00.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"}]},{"id":752086,"name":"American Theft 80s: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/695/695a7cbc2366abd6b4432e884360379e.jpg","description":"More games:https://store.steampowered.com/app/1321450/American_Theft_80s/\nhttps://store.steampowered.com/app/1332720/Thief_Simulator_2/\nhttps://store.steampowered.com/app/1190000/Car_Mechanic_Simulator_2021/\nAbout the Gamehttps://store.steampowered.com/app/704850/Thief_Simulator/\nhttps://store.steampowered.com/app/1442450/Monsters_Domain/\nCheck out some of Jack's first jobs in this prologue before playing the full game.\nFrom the creators of Thief Simulator.\nEvery house can be robbed. Just get the right tools and wait for the right time!\nMeet interesting characters doing shady jobs.\nKEY FEATURES IN THE PROLOGUE:\n- explore the first small town from the American Theft 80s\n- steal from houses, trailers or gas stations\n- finish the first heist\n- use the available tools: hammer and crowbar, to break in\n- finish shady jobs for shady characters\n- disguise yourself as an electrician to fool tenants\nIf you see a house, shop or a gas station, you can get inside, but learn about the tenants first. You don't want to get caught.\nRemember VHS, cassette players, and CRT TVs? No? Well, now you can get to know them! The tenants will surely share them with you, albeit not knowingly.\nEarn cash and reputation in the underground world filled with corruption and crime.\nSometimes the only thing you can do is get in the car and drive as fast as possible. But be careful! The cops are not playing around and will chase after you.\nMake sure to bribe the police to avoid being wanted.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Noble Muffins","platforms":[{"id":0,"name":"PC"}]},{"id":532522,"name":"CRSED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35b/35b8fcbc1ec2eae77b4aa75b48aae2c0.jpg","description":"CRSED: F.O.A.D. – is a brutal MMO last-man-standing shooter with realistic weaponry, elements of lethal mystic forces and incredible superpowers!\nFeatures:\n• Massive and dense PvP battles: dozens of players begin their trip in one of the four picturesque and detailed locations, fighting their way to the centre of the battlefield. All the while, the battlefield itself shrinks constantly, surrounded by the deadly Dark Zone.\n•  Seven different champions to select - each one with a unique superpower.\n• A constantly growing collection of realistically modelled weapons and armor, including anti-materiel guns, sniper rifles, assault rifles, rocket launchers, flamethrowers and mortars. There are few compromises in the game regarding physics or ballistics rules. Different vehicles, military amphibians and speed boats will help to cover distances.\n• There are mystical powers in game! Draw seals with your blood or conduct ancient rituals, throw hex bags at enemies and use your own special power. You can flood the whole map or cause the sun to eclipse, set up traps, summon zombies or teleport yourself or others the hell out of here. But first, one needs to collect sinner souls for killing enemies - to be able to pay for most of that luxury.\n• Stand out from the crowd with different costumes, masks, talismans, hats, gestures, graffiti and even underwear! Unlock new spirit-guardians to get additional tactical abilities in the battles.\n• There are regular special events in the game with new rules and setups of battles and a system of daily tasks and secret missions rewarding players with unique items and powers.\n• Fair play TPV: you can play in first or third person view. In order to mitigate any advantage of the latter, every player has a familiar with a camera that can uncover the position of a player who is peeking around a corner. So if you see a butterfly or a drone - you should know that you are being watched.\n• New content is added frequently!\nOnline multiplayer (2-99 players). Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOptional In-game purchases\nOnline play required\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nYou can download and play this content on the main PS5 console associated with your account (through the “Console Sharing and Offline Play” setting) and on any other PS5 consoles when you login with your same account.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Darkflow Software","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":373602,"name":"Hentai Killer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a41/a41946fb88585cfbd52bee348d7bb4f0.jpg","description":"WISHLIST THE GAME!\nAbout the Game\nHentai Killer - a third-person shooter in which an anime girl fights against an anime zombie for saving own life.\nDestroy anime zombies and do not let them close to you. Try to stay alive and clear the area.\nFeatures Different anime zombies with abilities\nMultiplayer\nLeaderboard\nSteam achievements\nAdvanced AI\n4 different weapons\n1 Beautiful map\nMode without HUD (Press Q Button in game)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"PlatSTUDIO","platforms":[{"id":0,"name":"PC"}]},{"id":312613,"name":"Pathologic","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e8/0e861e17ea34d020ecef9b17f0a25eb3.jpg","description":"A fascinating story is the most valuable component of Mora. Lies, betrayal, intrigues, unexpected well-wishers ... The turns of events follow one after another. The atmosphere is created by a mystical background, a feeling of loss and hopelessness, and not by any means elements of horror brought from typical \"horror films.\" Frankly, there’s nothing much to be afraid of besides, perhaps, a crushing, utopian atmosphere. Walking through the infected quarter, past moldy “crying” houses, poisonous fumes and zombies wrapped in dirty sheets, makes you uneasy.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Ice-Pick Lodge","platforms":[{"id":0,"name":"PC"}]},{"id":63393,"name":"Mars Horizon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c4/2c41461912eeb724f3cf0ef92daa32fa.jpg","description":"In Mars Horizon the player is tasked with leading a major space agency from the dawn of the space age though to humanity's journey to Mars.\r\nPlayers run a government space agency from when the first rockets launched into the atmosphere, right through to the first crewed mission to Mars.\r\nResearch new tech, expand your agency base, build rockets, send satellites into orbit, and launch a variety of missions. As the player, you’re in charge of every element of the journey into space.\r\nYOUR RACE INTO SPACE: All your decision-making and strategic prowess counts. Will you be patient in crafting the most high-tech base or strive to get the first human on Mars?\r\nSCIENTIFIC ACCURACY: Auroch Digital has been developing Mars Horizon in affiliation with the UK Space Agency to ensure absolute detail in space travel, engineering, and the preparation needed for a successful mission into space.\r\nCREW MANAGEMENT: Management is a key aspect of Mars Horizon and you’ll need to hire the right crew to successfully build, launch, and land on Mars.\r\nDIPLOMATIC ALLIANCES: Enter into diplomatic partnerships with other agencies to share the rewards of space exploration, or risk going it alone for even greater benefits.\r\nBUILD & DESIGN: Construct your dream rocket from multiple vehicle parts and store its design for later missions.\r\nCOMPONENT EXPERIENCE: Level up your vehicle parts after repeated missions to increase its reliability, and use upgrade slots for even more improvements.\r\nUNIQUE CONTRACTORS: Agencies have a number of contractors they can call on for construction of vehicles, each with their own selection of unique benefits...","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Auroch Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":61134,"name":"PolyCube","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fb/2fb80042726ee6bb4ce7d1bb4284daf8.jpg","description":"PolyCube is a block-based puzzle game that adds a new twist to the classic formula. Move and spin your block pieces in all directions to place them in the puzzle before time is up and the piece drops. Challenge yourself to beat your high score.KEY FEATURES:\nAddictive, fun gameplay will have you coming back for more\nFinely tuned interaction and controls\nOptional Virtual Reality support for Oculus Rift and SteamVR headsets.\nRobust controller support, including Xbox One/360, PlayStation 4, Nintendo Switch, VR Controllers, and more.\nAll Controllers work in regular or VR mode.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"{COMPANY_NAME_GOES_HERE}","platforms":[{"id":0,"name":"PC"}]},{"id":59931,"name":"Eternity: The Last Unicorn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd7/cd74cb026c3d2a7fee62330cca571210.jpg","description":"Fully featured RPG with classic game mechanics and an extensive lore based on Norse mythology.\nThe Elves were once given four Unicorns by the Holy Goddess and these became part of the elves. But as the unicorns were taken away and cursed by witchcraft, the elves’ sole existence became endangered. Lead Aurehen, a young pure Elf on her quest to free the last Unicorn that has survived. Travel through mesmerizing locations, meet fantasy characters and fight to protect Elven immortality. Pursue Eternity!FeaturesDevelop your character in classic RPG style\nUpgrade your weapons and acquire new skills\nDiscover and use new powerful items as you progress\nTrain to survive in the arena mode\nBroad storyline with strong lore","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"1C Publishing EU","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":58925,"name":"Higurashi When They Cry Hou - Ch.6 Tsumihoroboshi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70c/70c72fd8a081b54b49935d41fe0853a3.jpg","description":"June, 1983.\nThe summer heat has arrived earlier than it does most years.\nBy day there are cicadas, and by night, the higurashi.\nHinamizawa, a small village in the Japanese countryside.\nWhile there are fewer than two thousand people there, every year, 'something' happens.\nFor the past 4 years, someone has died, and someone else has gone missing.\nThis series of deaths and disappearances is connected to the local resistance against a now-abandoned dam construction project.\nA murder during the construction, covered up by the local authorities, is being re-enacted year after year.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there... isn't.\nSomeone who wasn't supposed to be there... is.\nSomeone who was alive last night is now dead, and someone who is here right now isn't alive.\nThere is no way to avert this tragedy. There is no choice but to give up trying.\nBut even so... please don't give up.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"07th Expansion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":58495,"name":"Immortal: Unchained","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/88b/88b04a5d065f0598ee7593f87f2d2edd.jpg","description":"Unleashed and unforgiving. Can you rise to the challenge?\nImmortal: Unchained is the latest addition to the genre of ultra-hardcore action RPGs. Take the role of a living weapon, unleashed to stop the source of a cataclysmic event threatening to end all worlds. Discover the secrets of these worlds, master the unique but lethal gun combat, and defeat legendary bosses.\nBeing an ultimate weapon, you have been locked up for millennia by those who fear your potential. It will require many harsh lessons to unlock this potential in an unforgiving universe full of murderous foes. On your journey, expect no mercy and no assistance: Those that aren’t trying to kill you, will instead try to use you to further their own agenda. Trust no one.Key Features\nExplore futuristic fantasy worlds, and sift through lies to unveil their secrets, in a story written by a narrative team including Anne Toole (The Witcher) and Adrian Vershinin (Killzone: Shadow Fall, Battlefield 1).\nTactical, up-close and personal action with a combination of ruthless gunplay and vicious melee combat.Annihilate legendary bosses in godlike clashes that will be remembered for eternity.Undying but unforgiving: Death is not the end, but the pain is very real as you struggle to redeem your mistakes.Delve into the vast possibilities of builds and weapon choices to find your own playstyle and defeat your opposition your way.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Toadman Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":57540,"name":"Teenage Mutant Ninja Turtles IV: Turtles in Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cf/4cfbd3fc7011fa848e672b14e73e9db9.jpg","description":"Teenage Mutant Ninja Turtles: Turtles in Time, released as Teenage Mutant Hero Turtles: Turtles in Time in Europe, is an arcade video game produced by Konami. A sequel to the original Teenage Mutant Ninja Turtles (TMNT) arcade game, it is a scrolling beat 'em up type game based mainly on the 1987 TMNT animated series. Originally an arcade game, Turtles in Time was ported to the Super Nintendo Entertainment System in 1992 under the title Teenage Mutant Ninja Turtles IV: Turtles in Time, continuing the numbering from the earlier Turtles games released on the original NES. That same year, a game that borrowed many elements, Teenage Mutant Ninja Turtles: The Hyperstone Heist was released for the Mega Drive/Genesis.\n17 years later, the arcade version of Turtles in Time was revisited on newer consoles. A slightly altered version of the arcade game was included as an unlockable bonus in the 2005 game Teenage Mutant Ninja Turtles 3: Mutant Nightmare. On 5 August 2009, Ubisoft released a 3D remake of the game, Teenage Mutant Ninja Turtles: Turtles in Time Re-Shelled, available as a download for Xbox 360 via Xbox Live Arcade. A downloadable PlayStation 3 version was later released via PlayStation Network on September 10, 2009.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"SNES"}]},{"id":51246,"name":"LocoRoco","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/062/062e951a10c30364f68a68f89443d9b9.jpg","description":"LocoRoco is an innovative 2D platform/action game available exclusively for the PSP. Featuring unique controls utilizing the \"L\" and \"R\" shoulder buttons, players are tasked with controlling via \"tilting or bumping\" the landscape of the LocoRoco in order to help them navigate through the level and keep them out of harm's way. With more than 40 stages, players control and guide the LocoRoco through vibrant, thriving and lush worlds filled with slippery slopes, swing ropes , and more. Featuring six different types of LocoRoco that include their own voices and actions, players will be enchanted by captivating music that communicates the joyous world of these LocoRoco. In addition, LocoRoco features the rewarding LocoHouse, three mini-games , and wireless features. The peaceful world of the LocoRoco are under attack by the not-so-nice Moja Corps. These evil outer space creatures want nothing but to capture the blissful LocoRoco and take them from their land of blowing flowers, lively creatures and pastel scenery. As the planet where the LocoRoco inhabit, players must tilt, roll and bounce the LocoRoco to safety.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"SCE Japan Studio","platforms":[{"id":0,"name":"PSP"}]},{"id":46907,"name":"Espire 1: VR Operative","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa4/aa45c248c2fe9b297a967aa7d87d8077.jpg","description":"Espire 1: VR Operative is an ambitious new virtual reality game and IP with its sights firmly set on the single-player ‘stealth’ genre, currently available through Steam's Alpha Release Channel in its prototype phase. We pitch this as \"Goldeneye 007\" meets \"Metal Gear Solid\" in an immersive VR world.\nThe prototype presents players with 6 of the game's 200 Virtual Challenges and a Sandbox Environment to test out the core stealth mechanics.\nWith Espire 1, we're delivering VR's definitive Stealth Experience. Gone are the days of watching a super-spy hero on-screen: by leveraging the head and hand-tracked capabilities of current VR technology, players can physically live out their 007 fantasies as the Espire Model 1 Operative. These stealth mechanics cannot be replicated on another medium.\nPlayers assume the role of an Espire Agent - a drone operator of the future. From the safety of their \"Espire Control Theatre\" (sized to their Oculus Guardian Boundaries) they deploy the Espire Model 1 operative on assignments around the globe. The player then remote-operates Espire 1 from thousands of Kilometres away - the player's movement is translated 1:1 into that of Espire with less than 10ms of latency. The \"Control Theatre\" mechanic is not only a story component; it is used to minimize VR sickness whenever the player performs artificial movement.\nThe full game features 15 objective-based missions and 200 Virtual Challenges.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Espire VR","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":44002,"name":"Original Journey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72c/72c967ed0cde754973d1dcc538313119.jpg","description":"You are a rookie soldier in the army of a space faring race, under the command of a legendary war hero. Your mission is dangerous, but the fate of your people depends on your success. Battle your way across the ever-changing surface of Planet Shadow with an arsenal of sci-fi weapons and mech armor, improve your skills and upgrade your gear.\n\nSomewhere on Planet Shadow lies the Origin Stone, an ancient artifact that can save your homeworld. Overcome the hordes of monstrous enemies that stand in your path and discover harsh truths hidden behind your invasion.Game Features\nDual wield over a dozen alien weapons and upgrade them for maximum carnage\nStrategically place high-powered turrets and shred your enemies\nEquip a wide range of augmented mech armor\nEmbark on racing, sharpshooting, and a variety of other missions\nExperience the rich and harrowing narrative of the Ato people's struggle to survive\nUncover hidden secrets amongst hundreds of procedurally generated levels","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ZPLAY Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":28514,"name":"Frogger","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/733/733e106391a2ffdbd338cfa83bbeec2c.jpg","description":"Full game includes the new Versus Speed, Co-Op, and Versus Head-to-Head multiplayer modes! Earn achievements and post your high scores against other players on Xbox Live™! Hop to it and buy Frogger® now! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Digital Eclipse","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28288,"name":"Mad Tracks","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3db/3db5add3a79b4eb01c631bc00df34c75.jpg","description":"Remember these toy car games we used to play for ever? MAD TRACKS is a fun and frantic racing action game inspired by pull-back-and-go racers. You are in control of the speed and enjoyment that these cars all gave us when we were kids!Quick Facts\n100% party games (fun & frustration free)\nPull back friction vehicles!\nAcrobatic Tracks!\nEasy handling\nRewarding gameplay\n45 crazy Challenges\n15 pick ups and power ups!\n24 Mini Games (Mini Golf, Darts, Bowling, Pool …) and 21 races","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"LOAD","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":21076,"name":"Monument","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/081/0817454cfe8b1f4e5c354beb75b57529.jpg","description":"Oldschool FPS. Hardcore classic gameplay. Huge hordes of monsters. Blood. Fun.\nEach level is unique and not similar to the previous.\nPlay with your best friends: shotgun, machine gun, plasma gun  and a homemade rifle.\nSend to the grave evil chickens, aliens and other evil spirits.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"D-Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19122,"name":"Darklands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24d/24de860ef13dad3b896c9f7973907bf8.jpg","description":"Heroic Adventures in Medieval Germany\nDeep in the twilight of the Black Forest, you and your companions crouch before the robber-knight's tower. Hans, the alchemist, places his mysterious potion by the door. Ebhard the friar implores Saint Dunstan to bless your weapons and armor. And you and Gretchen grip naked long swords, praying your plate mail won't squeak.\nWith a thundery crash, the door explodes into fragments! You charge inside, swords and maces swinging. One guard falls beneath the power of your blade... then two more! You storm upstairs to the second floor, but there to greet you is Erhard the Red Wolf, the infamous robber-knight, surrounded by his henchmen. Hans tosses a choking potion into their faces and you quickly charge into the fray. The room echoes with the clash of steel on steel... it's a battle to the death in the Black Forest!\nPrepare yourself to enter Darklands... the first realistic fantasy role-playing adventure for computers!\nLeading a band of four adventurers across the sinister landscape of 15th Century Germany, you'll face the Middle Ages as people believed it to be! A land seething with mythical beasts, religious power-mongers and blood-thirsty sinister robber-knights!\nWatch savage battles unfold before your eyes! Travel hundreds of miles by land and sea... from the Frisian Coast to Bohemia... from the Alps to Prussia... visiting over ninety cities along the way!\nYour quest for fame and fortune can take you through raucous city streets and dank mine shafts, or from a robber-knight's tower to the terrifying Sabbaths of witches!\nSo prepare yourself for the astonishing wonders of a realistic fantasy adventure... in the mysterious Darklands!\nImprove each character's attributes and skills as the game progresses. No artificial character classes or levels!\nLearn alchemical formulas to make your own potions!\nBrilliant watercolor-style graphics bring to life and myths and mysteries of the Middle Ages!\nEasy-to-use and innovative menu presents you with unprecedented role-playing options.\nCharacter fight in real-time animation! Freeze the actions and give new orders to characters any time you wish!\nBonus content included! Soundtrack in both MP3 and original MIDI formats included! Cluebook, Map and original reference card.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"MPS Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19077,"name":"Rex Nebular and the Cosmic Gender Bender","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/795/795d21b8ddd6c88510b6e44c845dbef4.jpg","description":"A priceless vase is lost on a distant planet that doesn't exist! An irate colonel wants it back! And only one man is experienced enough... skilled enough... and foolish enough to retrieve it! Interstellar adventurer and bungling bachelor Rex Nebular!\nJoin Rex as he pilots the Slippery Pig on a crash course for Terra Androgena, a planet populated entirely by bizarre alien women with big agendas of their own!\nOvercome the dizzying array of obstacles and endless traps preventing Rex from returning the priceless pottery! Feel the grotesque effects of the frightening Gender Bender machine! And revel in the mind-blowing graphics and ultra-realistic animation!\nOnly you can help Rex Nebular complete his mission and escape Terra Androgena alive!\nMIND-EXPANDING state-of-the-art graphics that combine drawn, digitized, 3-D rendered and rotoscoped art!\nA MULTITUDE OF MIND-BENDING PUZZLES\nENTICING skill levels for players from novice to genius!\nIMPOSSIBLE TO PUT DOWN manual written by award-winning game designer Steve Meretzky!\nRoam, Manipulate and Explore Rex's beloved Slippery Pig or any other scenario without typing in one work of text!\nVoyage to mesmerizing 3-D environments all brimming with colossal adventures!\nCoerce vivacious natives into giving you vital information!","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18769,"name":"Dead Secret","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/620/62024492f72fd35a45ad6fec5798890b.jpg","description":"Oculus VR Support!Every purchase of DEAD SECRET comes with a free unlock code for the Oculus Rift version. Solve this mystery on your desktop or in VR!  Check the discussion group for details.\nAbout the GameDEAD SECRET is a first-person horror mystery set in rural Kansas in 1965.\n\"This is a bizarre experience.\" -- SWERY, director of Deadly Premonition and D4: Dark Dreams Don't Die.\nWho killed Harris Bullard?\nA reclusive man with a mysterious past is dead and it's up to you to crack the case. Investigate the crime scene, uncover secret documents, and piece together the puzzle to name his killer. But keep your wits about you: nothing is as it seems and you are not alone. Bullard took his secrets to the grave. Somebody wants them to stay there.\nDEAD SECRET is designed for both traditional and virtual reality play.  This game includes a free unlock code for the Oculus Rift version.Features Uncover the complex and mysterious history of the victim by investigating his highly detailed home for clues.\nFind items, solve puzzles, and collect evidence to name the murderer and make headlines.\nDiscover the late professor's strange devices and use them to explore the deepest recesses of your subconscious.\nBut watch out: a masked murderer is hot on your trail. Don't let him corner you or it's all over.\nFive different endings to unlock!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Robot Invader","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17928,"name":"Celestian Tales: Old North","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a0/0a0a4f7614d15f5f0088b795f2f2235c.jpg","description":"Celestian Tales: Old North is a refreshing take on the classic turn-based Japanese style RPG.  Scrapping away the cliché of a destined person or a boy/girl-saving-the-world, the story is tailored for a mature audience and questions the bare morals of a human being. Will you do anything to survive? Will you be steadfast in defending your faith and beliefs? Or will you let yourself be corrupted, little by little, in the name of greater good?\nThe First of the Celestian Tales 3 Part Series, Old North is full of lush hand-painted environments, emotive portraits, memorable characters and a sprawling engaging moralistic storyline that is told through the eyes of six protagonists. The actions you perform and the decisions you make in Celestian Tales: Old North will carry over to the next installment of the series.\nExperience what it's truly like to bear the responsibilities of a hero in the beautifully hand-drawn Old North. Take on the role of one among six young nobles, learning your way of knighthood and assisting the lords you serve. When an external force threatens the land, you find yourself swept in the tides of war where the deadliest enemies are those among your own ranks.\nFeaturing a turn-based combat system with plenty of character and party customization options, Celestian Tales allows you to play the game at your own pace in your own style. Enter the first decade of this epic three-game series and see for yourself what sets it apart.Features Moral Confrontations - Situations are presented to the player throughout the game that force players to face moral questions and beliefs.\nUnique Story – By avoiding genre cliches, the story brings a fresh approach to RPG storytelling by allowing players feel the weight of their character’s actions.\nMultiple Story Arcs - 6 Selectable Characters allow you to play the game from 6 different perspectives. Play through the game as all 6 characters for a full experience.\nTraditional RPG Gameplay - Inspired by classic JRPGs with a turn-based RPG battle system, players can develop a personal combat style.\nBeautiful Art - Lush hand-painted background visuals and environments with detailed emotive character portraits and animated pixel-art characters create a full and complete world experience.\nEpic Music - A sweeping score that captures the pace and emotion of the story as it unfolds.\nMore to Come - Old North is the First episode  of a planned trilogy of games and your actions in this game will have impact in the next episode of the series.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ekuator Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16996,"name":"Tales Across Time","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b0/9b0afdc41feb4c8cc34eb4ddae3c149b.jpg","description":"Tales Across Time is a linear, story-driven RPG experience from the creator of 8-Bit Adventures: The Forgotten Journey. It uses the classic short-story format to tell the tale of three very different characters; each living centuries apart, but in the same location.\nEach narrative presents a different experience. Explore a haunted, ancient ruin; help a young woman save her town and her love; face off with an unstoppable masked killer. Many tales have been told across time; will yours be able to transcend it?\nFeaturing:\nExperience Three Gripping Tales, each set in a different time period.\nUnique Turn-Based Battle System - built around resource management & one-on-one encounters.\nDiscover Engaging Characters and People with Personality.\nSame Location, Different Environment - explore a familiar land, transformed by the passage of time.\nBattle a Wide Variety of Monsters, which constantly change-up combat.\nA Narrative-Focused Experience - keeps the story going and doesn’t waste your time (no grinding/filler).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Critical Games","platforms":[{"id":0,"name":"PC"}]},{"id":16891,"name":"Meridian: Age of Invention","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb9/eb90a10596c4d726a2a2b0177292d283.jpg","description":"Experience the wonder of discovery as you rebuild a crumbling kingdom in Meridian: Age of Invention, an innovative time and resource management game! To renovate rundown villages, you'll have to hire workers, scour for resources, repair infrastructure, provide food and other services, engage in trade and create machines that will make life easier for the people. To win a gold trophy on each level, you'll have to use your ingenuity to figure out the quickest way to gather resources and complete your other tasks.\nAs you travel through lush grasslands, arid deserts and a village built on the sea, your guide will be Professor Cardano, an eccentric but brilliant inventor. Along the way, you'll meet many other zany characters, all of whom have their own dreams you can make come true. Endlessly imaginative, visually stunning and accessible to players of every skill level, Meridian: Age of Invention will take you to a time and place you'll never want to leave!\nFeatures:\n* 55 levels\n* 10 different tasks\n* 10 unique characters\n* Point-and-click controls\n* Learn-as-you-play tutorial","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mirball Games","platforms":[{"id":0,"name":"PC"}]},{"id":16153,"name":"Massive Cleavage vs Zombies: Awesome Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/253/2531bfa462fdb3101eb0399b3f23cc56.jpg","description":"Controller SupportJust plug in any Xbox One, Xbox 360, or Steam controller.\nAbout the Game\nYour mission is to find BBQ sauce for your people and bring it back to them. Fighting off thousands of zombies with only your massive cleaver and equally massive cleavage.\nThe game is played with simple arcade mechanics (move left, move right, high attack, low attack), and it starts you off with an easy amount of zombies to re-kill. But each level adds more and more zombies, and eventually dogs that will chew your face off in a couple seconds.New in the Awesome EditionFor people who play the whole game in one sitting I wanted to give them a break from the repetitiveness of hacking and slashing 2D zombies. So in the later half of the game I added new levels where you hack and slash (or shoot) 3D zombies!! Pretty brilliant right? I think so.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Awesome Enterprises","platforms":[{"id":0,"name":"PC"}]},{"id":15183,"name":"Azure Striker Gunvolt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13a/13a02c65768a0551408d1c525f2535f2.jpg","description":"Azure Striker Gunvolt is a 2D action game featuring the talents of star creator Keiji Inafune as the Executive Producer and Action Supervisor.\nWith the “septimal” power to create and manipulate lightning, Gunvolt faces off against the massive conglomerate known as the Sumeragi Group. Intense battles\nunfold against Sumeragi's ultra-powerful adepts (those who possess septimal powers) as Gunvolt fights to keep his nation free.Speedrun ModeThis new mode gives speedrunners around the world the chance to compete for the best time,\nwith pre-determined settings put in place by the Gunvolt team to maximize efficiency for this challenging new mode.\nFuture updates which will new add features and settings are already planned,\nso stayed tuned for information about that in the near future.Lightning-Based ActionUse your trusty sidearm to tag enemies, then let loose a burst of electricity for massive damage. You can even tag multiple enemies and zap them all simultaneously.\nYour lightning abilities are not just for defeating enemies, though. Use them to perform various maneuvers such as hovering across hazardous terrain.Do Battle With a Variety of BossesSumeragi's most powerful members, with a wide range of personalities, await you at the end of your missions.\nBattles get heated as bosses unleash their most powerful skills and techniques.Those for Whom the Muse Sings Shall Turn the Tides of BattleEven Gunvolt falls in battle sometimes. When this happens, there is a chance that Lumen,\naka The Muse, will revive you and grant you a massive power boost. Furthermore,\nif you manage to amass at least 1000 Kudos during a stage,\nthe BGM will change and Lumen will sing one of her songs for you for as long as you maintain those Kudos.\nYour Kudos will reset upon taking damage, so keep that no-damage run going for as long as you can!Japanese Voice ModeIn this long-awaited mode, players will be able to play the original Japanese version of the game,\nwhich includes ample mid-stage dialogue, all fully voiced in Japanese with English text.\nThe entire script has been re-translated to coincide with the dialogue of the Japanese version of the game.\nTo play the game in Japanese Voice Mode, select it from the Language Settings before starting the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"8-4","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"}]},{"id":14205,"name":"Watch This!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a8/1a8bc80a9dcd9143a3fb702d068df3a8.jpg","description":"«Watch This!» is a first-person single player platformer with horror elements.\nYou are the star of the newest, most spectacular show. Avoid traps, hide from the monsters, rescues out of the maze ... Or die. The key is to entertain billions of viewers!\nRelease Date: 08 July 2016\nFeatures:\n– setting in a bloody TV show format;\n– in each round player can only use two of more than 15 different bonuses that ensures replayability;\n– partially randomly generation of the maze forces players to seek for new ways to escape;\n– a lot of deadly traps, and 3 unique types of monsters;\n– merciless satire on modern realities.\n«You Must Watch This!»","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CivilSavages","platforms":[{"id":0,"name":"PC"}]},{"id":13635,"name":"Pajama Sam 2: Thunder and Lightning Aren't So Frightening","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db2/db282210c71afeec653ec200093d7010.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameJoin Pajama Sam, the world's youngest superhero!\n...as he journeys to World Wide Weather, the storm-stirring factory in the sky! Sam's spent on to many evenings cowering under the couch, so he sets out to conquest his fear of thunderstorms. Just as our little guy begins to learn that storms aren't as bad as they seem, Sam accidentally send the weather system into a frenzy. Now, there is snow in Saigon, and sunshine in Seattle! He'll need your child's help to explore this wonderful world filled with challenging puzzles, fun games, and fantastic new friends as they help Thunder and Lightning fix the broken machines and return the world's weather to normal before Mother Nature finds out!\nPlay again and again, New puzzles, new friends and new challenges await each time you play!\nClick points reveal hundreds and hundreds of hidden surprises!\nSpecial games and activities encourage creativity, help teach spatial-relations and sharpen problem-solving skills.\nOut of time? Save the game and finish it later.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12823,"name":"Zoop! - Hunter's Grimm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d6/0d62239a4d8413c487bd92d79ea4975c.jpg","description":"Hunter's Grimm is a spooky adventure about hunting down ghosts, monsters, and demons.\nEmbark on a 10 hour adventure as demon-hunters Nicholas and Sarai Grimm(brother and sister) fighting the evils of the world, for a price.\nFor Sarai and Nicholas, life is simple: search for monsters, kill the monsters, accept the award, and get frosty chocolate milkshakes and boring old research books for all.\nBut one night, one favor to a friend has set them on a path neither would have expected.\nAn attempt at a selfless act has them branded outlaws, hunted by an old rival, and left them trying to understand what is happening. What awaits them is the beginning of an adventure neither of them are prepared for.\nDiscover new lands, help those in need, and become the ultimate monster hunter.\n695 AchievementsEmoticons\nAchievement icons provided for free by EmojiOne.com","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Warfare Studios","platforms":[{"id":0,"name":"PC"}]},{"id":12542,"name":"The Pasture","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/208/208356bab08f2fd3f3ef13bdd6575256.jpg","description":"The Pasture gives you a truly innovative gameplay and experimental possibilities that will allow you to experience yourself as a different character – a member of mysterious modern art elite.\nThe Pasture is a product of endless self-reflection of modern games, where all the different genres and control styles are constantly flowing one into another, making it hard sometimes to even tell where exactly is the player, has he finished the game, is he a protagonist or only a hostage of the incorrectly programmed NPC.\nThe Pasture is a simulator of art life and people living it. One of the concepts of this world: “die or have your own exhibit at a big museum” allows a player to experience numerous funny and sometimes weird emotions.\nThe game mechanic in The Pasture is totally nontrivial. It may seem very simple, but yet it gives you a whole range of feelings: from hopelessness before the museum staff and famous artists to a vague understanding that it’s the implicit methods in this game that will allow you to “move forward”.\nThe game includes more than 30 pieces of contemporary Russian art, so you will have a great opportunity to fill out possible gaps in your education.Features:Several playable characters.\nYou can create your own exhibition at a museum.\nA possibility of dying more than once.\nThe real prototypes. The game takes place in the existing Russian galleries.\nThe ability to earn rewards and set records.\nMeet the artists and learn about the most significant works of Russian contemporary art.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mikhail Maksimov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11885,"name":"Predynastic Egypt","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1f/f1f3a9d69fe565c3147423f31e0768b9_KQ1UCnb.jpeg","description":"Get ready to witness evolutionary breakthroughs that enabled early Egyptians to march into faraway lands, fight catastrophes, hardships and ultimately establish first Egyptian state. Will you be able to re-enact the events that unfolded historically or will you doom your fledgling chiefdom into forgotten annals of history? Get an intimate knowledge about events that took place before the Classic Egypt eras through this unique game.Simulation of the ancient worldWars, drought, enemy invasions, epidemics, internal turmoil, migration of the tribes, religious ceremonies, exploration of distant lands, celebrations and more than 100+ other events and trials await you in the game!Technological evolution of mankind48 historically accurate technologies and cultural achievements of Predynastic Egypt with interesting descriptions, will show the technological evolution of mankind on the example of the Egyptian civilization.Mysteries of Egyptian religion and cultureYou will see the birth of the unique religion of the Nile civilization, starting with beliefs in spirits and ending with the gods of Predynastic Egypt and you will learn the secrets known only to archeologists and Egyptologists!Reconstructed map of Ancient EgyptAccurate reconstruction of the geographic map of ancient Egypt 5000-3000 BC, taking into account the climatic changes of that period when the Sahara was a Savannah and not a desert and Wadies were rivers and not roads.Reconstructed city of HierakonpolisAccurate archaeological reconstruction of the Hierakonpolis - the former center of Predynastic Egypt. You will build the real houses, temples and tombs, that were excavated by archeologists in XX-XXI century.\nThe fate of the whole nation is in your hands. Make important decisions in real historical situations, wars, disasters. True story will immerse you into the mysterious atmosphere of the ancient world, you will see through the eyes of the ancient Egyptians.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Clarus Victoria","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":11345,"name":"Sword With Sauce: Alpha","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e4/3e4b97f6beb7b22541e8cc78ec0ab9e1.jpg","description":"Select your weapon, your gadgets and then your play style as you enter ready to take down all the enemies patrolling the level.\nTo help you along your way is a large selection of gadgets and weaponry to assassinate your targets in any way you like. You can either go in guns blazing, with a mad desire to re-colour the walls red or take a more delicate approach as you sneak your way around the level avoiding detection.\nYour main weapon can either be a sword which can deflect bullets, chop down your foes or be thrown for maximum bloodshed. A shield which can be thrown at multiple enemies at once or to reflect their bullets right back at them. A bow for silent long range kills without worrying about ammo. And finally a machine gun because sometimes the best solution is the loudest one. You also have a selection of bad ass gadgetry, starting with ninja stars and gas grenades leading into the more ridiculous pocket sized black holes and self destructive crabs.\nCurrent Features:\n6 weapons (not including the cutlery)\n25 gadgets\n5 levels\n4 enemy types\n3 game modes","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Diatomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":11319,"name":"Smashbox Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e7/4e734905cc242fe8787e213d7f7490a8.jpg","description":"Smashbox Arena is a team-based action game with insane physics-driven power-ups.\n2 modes of play:  Singleplayer Story Mode and Online Multiplayer (AI Characters will join teams if there aren't enough players)!\nEasy to learn, difficult to master -- Fast-paced, multiplayer designed from ground up for VR headset and touch controllers!\nBeat Story Mode in 3 levels of difficulties to unlock new Heads and Mini-Bios.  And match up with friends and competitors from around the world! Work together with players and have fun with friends.  Gesture your tactical plans, do a victory dance, and communicate with competitors using voice chat!\nMaster 6 power-ups like Giant Boulders, Sniperballs and Heat Seeking Missiles.  Creatively combine them to create endless unpredictable and funny situations!\nDodge your opponent's projectiles and use the environment as cover.  Out-maneuvering your opponents in VR never felt so intense!\nZoom, rotate, and watch the action unfold in real time in VR God-View. Learn your opponents' tactics and strike back!\nYes, you can unlock a Pear in the game.  Enough said!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Archiact Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":11253,"name":"Shrouded in Sanity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a17/a17ab5ddc9e6df14aebe7507df265155.jpg","description":"A survival-horror game inspired by Resident Evil 1, Dark Souls, and Eternal Darkness.\nSet in the alternative historical setting of 1897 Angelic Empire of Britannia, your contract will order you to eliminate the source of the unnatural fog enveloping the Berelai Manor.\nDiscover the secrets of the estate, as you look for answers among the violent inhabitants.\nA strange and repelling madness took hold of the servants roaming the halls, and they will attack on sight, for their madness is one rooted in a deeper understanding of cosmic insignificance.\nTo repel the maddening horrors, your Iaito cane, and Waltham A9 hand canon will aid you. To mend your injuries your Vitae concoctions will offer healing.\nBeware, whatever unearthly events have transpired, your sanity will be tested as the truth unfolds in this hungry all-consuming Fog.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Steve Gal","platforms":[{"id":0,"name":"PC"}]},{"id":10312,"name":"Space Pirates And Zombies 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a41/a4110fd9f873138cad54e4279e0d6280.jpg","description":"In SPAZ 2 you must survive in an evolving post apocalyptic Galaxy.  The zombie threat is defeated, infrastructure has collapsed, fuel is scarce, and scavenging means survival.\nInitially the Galaxy contains hundreds of fleets, each trying to survive.  AI captains do everything the player can.  The player is not special and is not the center of the Galaxy.\nAs resource scarcity becomes critical, ships come into conflict just to survive.  Factions may form for protection or split due to starvation.  Old friends must become fodder.\nStronger factions establish and defend territories, set up resource hubs, and establish star bases.  Weaker factions may resort to banditry.  Each captain is unique, persistent, and shapes the Galaxy.\nWhen factions meet, combat is usually the result.  While the strategic side of SPAZ 2 is about exploration, territorial control, and faction building, the action side of SPAZ 2 is about ship construction, tactics, and salvage.\nCombat creates damaged ships and dead crew, but it also provides new salvaged parts.  All the parts in SPAZ 2 are modular and randomly generated.  If you see something you like, break it off an enemy, grab it with your tractor beam, and connect it to your ship.  Ship construction can be done live during battles, though sometimes beating an enemy to death with their broken wing is also fun.\nBack on the star map, battles will attract other captains looking for salvage.  Take your new parts and run.  Upgrade, repair, and prepare to fight another day, for darker threats are about to emerge.\nKey Features:\nTwo hundred persistent Captains that are able to do everything the player can, including forming dynamic factions, building structures, controlling territory, and going to War.\nA true living galaxy that is not player centric.  It will develop differently each game through the interactions of the agents.\nBuild your own faction from nothing.\nRandomly generated modular parts.  Build the mothership that suits your play style, on the fly, in seconds.  Every part has its own unique stats that contribute to the mothership.  Every part has its own hull integrity and damage states.  Every part is a real, working, ship component.\nStrategic ship building.  The mass, location and shape of parts all matter.  If a part blocks a turret, it will not fire.  If a ship is too long, it will turn slowly.  Too many engines will mean too little power for weapons.  Every design choice counts.\nA fully physics based 3d environment where everything is destructible, takes damage from impacts, can be grabbed and even thrown at enemies with the tractor beam.\nNatural movement and controls.  Movement is on a 2d plane and screen relative, much like an FPS.  The combat feels like huge pirate ships battling on an ocean.  Focus on tactical positioning and manage system power to unleash hell at the right moment.\nEpic ship to ship battles.  Tear the enemy apart piece by piece over minutes, instead of seconds.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"MinMax Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":7729,"name":"Maze Lord","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83e/83e3306306f625d8ed499441038e9e90.jpeg","description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other our strategy games:http://store.steampowered.com/app/509600\nhttp://store.steampowered.com/app/411120\nhttp://store.steampowered.com/app/409380\nAbout the Game\nBecome the part of the legend telling the story about an underground kingdom of mazes, which bowels hide the insidious dragon concealing the stolen princess.\nIntricate tangled dungeons tend to change constantly in order to hide an army of monsters and treasures that you can exchange into special artifacts in the local Magic Shop.\nAlso in the depths of the maze is hidden the secret Treasury of the dungeons’ king. The hidden Treasury can be found only by the luckiest and most skillful seekers of adventures.\nTo overcome multiple enemies and other dangers you can use various objects located in the maze dungeons. For example, the shield will save you from snake bites, the magic boots are not “afraid” of pointed spikes in the floor, and the torch will help to get through a giant spider’s web.\nDuring this interesting adventure you will encounter with:\n- Unique puzzles;\n- Intuitive gameplay;\n- A great number of interactive objects;\n- More than a hundred of interesting handmade levels;\n- The hidden Treasury and the Magic Shop;\nP.S.\nFor all game players we'll offer a bunch of adorable collection of collectible items - 15 trading cards, 10 backgrounds and 10 amazing emoticons!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":6665,"name":"Dustoff Heli Rescue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14a/14aa6e1900838d102a2ded7462760f0d.jpeg","description":"\"I need a Dustoff!\" became an all-too-familiar call on the airwaves of jungle wars. Now take off with your rescue helicopter and search and save the life of the wounded soldiers in the field, often under fire. If you can't, nobody else can!\nFind the stolen cargo with your Chinook helicopter and transport them safely to the nearby friendly base, all the while fighting off hostile tanks and other enemy combatants.\nSave hostages being held in Prisoner of War camps. They are desperately waiting for the remarkable sound of the evac helicopters. You are their last hope so save them all!\nFlying Dustoffs take courage on your part as a helicopter pilot, as ground fire is the rule rather than the exception. The rewards, however, are great.\nMAIN FEATURES\n- Up to 25 unique missions\n- 3 rescue helicopters, each with different handling and transport characteristics\n- 3 weapons with different capabilities\n- Various missions like: cargo transportation, saving hostages and stopping enemy convoys\n- Various daytime and weather conditions like stormy heavy rains and beautiful sunset over the jungles\n- Numerous war scenes including jungles, swamps, hidden cave and mine systems and a lot more\n- Real time shadows and lighting\n- Epic action music and cinematic sound effects\n- Dog tag collection\n- Localization up to 10 languages like: English, French, Italian, Spanish, German, Brazilian-Portuguese, Russian, Korean, Simplified Chinese, Japanese\n- Option to control your helicopters in Amateur and Pro mode\n- Manual and automatic aiming\n- Full game-pad support\n100% kid and family safe game, no-one gets killed, enemy soldiers always run away.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Invictus","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5309,"name":"Sudoku","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d96/d960407b992d527af45d6d824f6b528e.jpg","description":"The game is given a playing field of 9x9 cells. You need to fill the empty cells with numbers from 1 to 9. You can put the numbers so that in a row, in a column and in a small 3x3 square the number appears only once. You are allowed to make only 2 mistakes. You can make notes in the cells and erase the contents. The current game is saved. The game has several difficulty levels.Select an empty cell and think about what number you can put on it. Check the row, column and small square so that this number is not there. If you cannot check, then put a note in the cell and move on to the next one.By purchasing the game, you will receive:- an exciting process of a logical game- the ability to solve Sudoku puzzles- development of logical thinking and attention","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4124,"name":"Just Dance 4","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/157/157a572c2c67fbb0cd9c1dc1f2017f7c.jpeg","description":"The world's 1 dance game brand is back with Just Dance® 4 and now available for the PlayStation®Move motion controller!\nThe latest edition of the record-breaking franchise takes the party to a whole new level of fun, with over 40 all-new chart-topping hits, the coolest dances and unique features for every platform.\nJust Dance® 4 is your ticket to the best new music with over 40 tracks from a variety of top artists, popular genres and hot billboard songs such as “What Makes You Beautiful” by One Direction, “Call Me Maybe” by Carly Rae Jepsen, “Good Feeling” by Flo Rida, and “Moves like Jagger“ by Maroon 5 ft. Christina Aguilera. The tracklist also features legendary artists such as Barry White and The B-52’s to get the whole family up and moving.\nJust Dance 4 is the perfect catalyst for the best parties, thanks to innovative new modes like the all-new Battle mode and an upgraded Just Sweat mode. Have a blast dancing, laughing, and breaking a sweat with friends and family all night long.\nPlayStation®Eye camera required\nPlayStation®Move motion controller and PlayStation®Eye camera optional\nA PlayStation®Move navigation controller or Wireless Controller will be required for motion control features.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\n© 2012 Ubisoft Entertainment. All Rights Reserved. Just Dance, Ubisoft, Ubi.com, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries. PlayStation®Move motion controller and PlayStation®Eye (sold separately) required to use this product.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]}]