[{"id":28580,"name":"Dragon Age 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/974/974d08635981db7677630327ce1fe4bb.jpg","description":"Dragon Age II is the second part of the Dragon Age series of dark fantasy games. The series is inspired by the classic Bioware RPGs like Baldur's Gate and Neverwinter Nights, and some of the game’s writers have previously worked on these titles.\n\n###Plot\nDragon Age II is set in the medieval world of Thedas, inhabited by mythological races like elves and dwarves. This high fantasy setting has a definitive \"Dark Ages\" atmosphere. The game continues the plot of Dragon Age: Origins, and the player can choose which ending of the original game to use as a backstory. The player assumes the role of a protagonist named Hawke. He or she is a human who had to flee from an invasion of the monsters called Darkspawns. Over the course of the game, Hawke eventually rises to power and influences the fate of the whole Thedas.\n\n###Gameplay\nThe main protagonist is fully customizable. The player can choose his or her first name, gender, appearance and character class. There are three classes available: mage, warrior, and rogue. The player controls not only Hawke but also his or her party that can include up to three companions at once. You can only control one character at a time, however, switching between them while leaving the rest to AI control. \n\nDragon Age II introduced the dialogue wheel that was borrowed from the Mass Effect series. Dialogue options usually have a tone that defines how other characters perceive each line and, eventually, the protagonist's personality.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BioWare","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":58637,"name":"Code Vein","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/16a/16a81cc458b0acb6ed2bcfd2a10f1527.jpg","description":"Bet on blood and go to the dead land together\n■ CONCEPT\nDramatic search action RPG challenging with \"buddy\" to become a partner in a vast dungeon where numerous enemies and dangers await. Share the trembling heart with the unknown sight that overcomes both fears together in a desperate world.\n■ WORLD\nNever far Future The crust that has been penetrated by the \"thorn of the referee\" is a world that has been torn and broken without survival. There was a closed society called \"Vain\" whose barely survivors called vampires (revenants) survived. Vampires who abandoned being people as opposed to destruction. While they lose most of their memory as compensation for the supreme power, they keep barely maintaining humanity by sucking blood. The lack of blood makes them transform themselves into losers that have lost their hearts. A search world begins searching for blood and truth, with vampire colleagues in closed world where numerous devotees gather.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":2894,"name":"Invisible, Inc.","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/849/849c187c0b5d4cd1ee3283148f7e4cdb.jpg","description":"Developed by the Canadian Klei Entertainment, Invisible Inc. is a turn-based strategy with elements of stealth and roguelike. The game takes place in a dystopian future: in 2074 and the huge multinational corporations seized power from the world government. Invisible Inc. - a private intelligence agency and a corporate contractor, conduct sophisticated undercover operations and use complex AI system called Incognita.\n\nAt the beginning of the game, the security system of the agency was breached and most of the agency was lost. The remaining employee manages only to save AI, but its existence is questionable: the system can exist without connecting to a powerful computer for only 72 hours. Finding the right hardware becomes the main task of surviving agents. The player plays the role of their remote operator.\n\nThe gameplay is similar to the X-COM games: all missions are turn-based. Each agent under player’s control has a limited action point that he can use during the turn. Often the main task on the map is to possess a certain object. During the missions, the player can complete additional quests that allow you to open new agents and equipment.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14364,"name":"Jagged Alliance 1: Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c98/c98c214657f024107f438d0eaa501d9f.jpg","description":"Jagged Alliance is a true legend of tactical turn-based Strategy! The Gold Edition includes Jagged Alliance and Jagged Alliance: Deadly Games.\nThe return of a real classic - for the first time on Steam! 20 years ago, Jagged Alliance made an impact and changed the strategy genre forever. Now you can experience this legend in its glorious original form.\nA desperate call for help from the island Metavira: The scientist Jack Richards and his lovely daughter Brenda are reaching out to you. The Fallow trees and thus the precious, medical sap on which countless of lives depend, are under the control of the evil and traitorous Santino. That’s why Jack and Brenda hire you, the commander of a mercenary force, to put an end to Santino's insane plans.\nYou and your mercenaries have to reclaim the island sector by sector, turn by turn. Cultivate the Fallow Trees and process their juices, as they are the basis for your funding. Hire better mercenaries, train local militias and manage your equipment wisely. Get your troops out there and help the people of Metavira!\nExperience a true classic\n60 mercenaries, 60 attitudes, 60 voices\nLots of authentic weapons and equipment\nIntense turn-based combat\nNon-linear gameplay\nHigh replay value","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Sir-Tech","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10206,"name":"Ashes of the Singularity: Escalation","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/651/651f338d5c03b8c650543629ce486a52.jpg","description":"The human race has expanded into the galaxy thanks to the wonders of the technological singularity.  You have become so powerful that you can manage vast armies across an entire world that provide you with an ever greater galactic empire.\nNow, humanity is under assault by a new enemy. Calling themselves the Substrate, they seek to annihilate the human race from existence.  You, as an up and coming member of the Post-Human Coalition, must deal with both this new menace as well as renegade humans trying to lay claim to their own worlds.\nPlay as the Post Human Coalition or their eternal foes the Substrate and battle for control of the galaxy. Experience maps of unprecedented size and detail with the unparalleled power of the world’s first native 64-bit RTS engine, Nitrous.\nEnjoy the game online with friends in ranked or unranked multiplayer mode or play it by yourself against a powerful non-cheating AI in skirmish or campaign mode. No matter what mode you play, strategy is the key: deciding what technologies to research, where to send your armies, how to manage your economy, and what units to construct are crucial to victory.\nExperience a massive-scale real time strategy game where you wage war across worlds with thousands of units. The conflict has escalated, and it’s time to choose a side.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":1726,"name":"10 Second Ninja X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/085/0851d86b5e8250ee33af5ab56544989b.jpg","description":"10 SECOND NINJA X is a shockingly fast, overwhelmingly intense action/puzzle game. In this thumb blistering sequel, the nefarious Captain Greatbeard has kidnapped you and trapped your forest friends inside of his army of robots like some kind of psychopath. Greatbeard doesn't think you're the fastest ninja who ever lived - he is WRONG. Destroy all of Greatbeard's robots in each level in ten seconds or less. Be fast enough to get the coveted three star rating in each. Fight through 100 levels, explore Greatbeard's airship, discover secrets, climb the leaderboards and show everyone what it means to be THE FASTEST, COOLEST HERO EVER.\n⦁\t100 thumb blistering, mind bending levels over 11 game worlds\n⦁\t11 “Marathon Modes” with back to back ninja madness\n⦁\tPlayer ghosts and unlockable ghost hints for the trickier levels!\n⦁\tExplore the magnificent Greatbeard's ship in the retro styled hub.\n⦁\tOnline leaderboards for every level!\n⦁\tHidden minigames - with a 100% chance of Nun themed mayhem.\n⦁\t8 different character costumes to unlock and play\n\"10 Second Ninja X is slick, quick and compulsive\" - Telegraph, ⅘\n\"Sprinkled with humour, colour, and secrets to uncover, this action platformer is an addictive little time-waster \" - God is a Geek, 9/10\n\"A great sequel... It offers smooth gameplay, great characters, and strong reasons to keep coming back.\" - XboxOne UK, 9/10\n\"The developers get what's important and give it to you in spades\" - NoobGrind, 8.7/10\n\"It's super easy to lose a lot of time replaying levels and not even notice\" - LETSPLAYVIDEOGAMES, 8/10\n10 Second Ninja X has full Steam trading card support - with loads of cards to collect.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":13780,"name":"Sid Meier's Civilization IV","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85c/85c91c5064d2cdd56a949c8008868318.jpg","description":"As with the rest of Sid Meier’s Civilization series, the player controls a real historical civilization and leads it from the stone age to the space era. The goal is to develop its culture, science, and economy and to conquer the neighboring countries if you feel like it. There are eighteen playable civilizations in the game with some of them having multiple leaders to choose from. Each PC-controlled leader is based on an actual historical figure and has his or her unique personality traits, such as being diplomatic or aggressive.\n\nCivilization IV was the first to introduce different religions rather than an abstract \"religion\" as a concept. There are seven available religions that can be founded during the game and spread across the map, increasing their founder's influence and boosting his citizens' happiness. The fourth part also introduced the idea of Great People, such as scientists, artists, and prophets, who are also based on actual persons. Corruption mechanic was removed and replaced with expensive building maintenance. Barbarians, who used to be just random enemy units, now can build cities that, however, will not contact with the player via diplomacy and should only be eliminated.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Firaxis","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10355,"name":"Fractured Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e10/e10258b8e132c269dd2b0faeba0d8057.jpg","description":"This space opera game lets its players assume positions of starship commanders in a distant future, and fight each other as multiplayer teams. Its setting is reminiscent of EVE Online, however, the gameplay has more in common with DOTA or World of Tanks. You are in full control of your ship, which is an enormous, multi-kilometer battlecruiser. However, you are also a part of a larger Starfleet, so you have to complete the mission objectives to win. Each battle is fought on a map that features the player's and enemies' bases on the opposite edges, as well as Forward Bases and Gamma Sector in between. Battleships are able to jump between the sectors of a map using hyperspace tunnels.\n\nBetween the battles, you can purchase and upgrade new spaceships. The game is free-to-play, so the resources can be either earned in the game itself or with microtransactions. Every ship has virtual crew members that you can hire and take five of them with you to the battle. Depending on their specialization, be it Engineering, Navigation, Repair, or something else, they provide your ship with specific bonuses. They will also advise you and overall act as if they were real people.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Edge Case Games","platforms":[{"id":0,"name":"PC"}]},{"id":876,"name":"Legend of Grimrock","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/237/237711d80fbd1658218271e362d85287.jpg","description":"For all your misdeeds, you are sentenced to die at the top of Mount Grimrock. No one ever returned from this gruesome prison alive, but you can try and be the first to escape. On the inside, Mount Grimrock is full of dungeons that can allow the prisoners to slowly descend to the earth level. The dungeons are filled with intricate traps to evade, puzzles to solve, and hungry monsters to fight in real-time mode. \nLegend of Grimrock has a strong old-school dungeon crawler feel to it, and its creators proudly admit that they were inspired by the traditional first-person RPGs like Dungeon Master and Eye of the Beholder. The player assumes control over a party of four customizable characters that are divided into three traditional D&D classes (fighter, rogue, and mage) and four quite non-traditional races (besides Human, there are Minotaur, Lizardman, and Insectoid). \n\nThere's a bit of Portal to Legend of Grimrock, in that the prisoners are instructed by a disembodied and unreliable voice that promises them a cheerful party if they make it through the dungeon. Your party can also stumble upon records left by a previous prisoner, Toorum, which don't really inspire hope. There's an achievement that unlocks Toorum as a playable character.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Almost Human Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":441738,"name":"The Ascent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f4/3f43f03406a5ea087352bf32d60e3a0a.jpg","description":"The Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and without protection, everyone is left to fend for themselves. Stop gangs and hostile corporations from taking over and discover what really happened.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Neon Giant","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":897,"name":"Superbrothers: Sword & Sworcery","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db5/db5ab0d41a2a57274902d32ea8e6f1ec.jpg","description":"Superbrothers: Sword & Sworcery EP is a pixel art point-and-click quest, split into \"sessions.\" During them, you play as a female Scythian warrior who searches for an ancient book and explores the Caucasus. Accidentally she releases the evil and needs to fix the consequences of her actions. Between these sessions, a smoking character suggests you think over the events and your experience.   \nSword & Sworcery features various puzzles you need to solve during the exploration of the world. As a rule, they are somehow connected with music or sounds, so it's better not to play the game in noisy places. Even rare fights with monsters in the game are similar to dances: you need to feel the rhythm of the battle, and attack, defend and dodge predicting the actions of your enemy. The game is soaked with different philosophical ideas, that together with the gameplay, visuals and sound design create something closer to artwork in its core than a classic video game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19635,"name":"Fable: The Lost Chapters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa2/aa25254dbfa5b2073595bf69d8c8bac4.jpg","description":"Fable: The Lost Chapters is a re-release for the personal computers of the Fable game, originally created for the Xbox. This release includes content that is not included in the release of the game for Xbox.\nThe main character is personalized in great detail. Everything that he does affects him. He can get obesity from a plentiful meal, and if he drinks alcohol, he will become poorly oriented and eventually will vomit.\n\nClothing, hairstyles, beards and tattoos of the hero influence how others perceive the hero. For example, light clothing causes benevolence, and dark - fear.\n\nOf course, the attitude towards the hero is influenced by his actions. The proportion of good and evil acts affects his appearance. If he does many good deeds, he has a halo above his head and other signs of holiness. If he is more inclined to evil deeds, he grows horns, smoke comes from under his feet, and his eyes get a red glow.\nThe hero grows old regardless of whether he is good or evil. In his old age, his hair grows gray. If he spends his experience on new skills, he becomes noticeably older. Among the things that you can buy in the city, there is real estate. You can buy a house, rent out and get paid. If you decorate the house with trophies, the rental rate will be greater.\n\nIn addition to the war with the enemies, you can search for treasure and fish or participate in sports fistfights. And even better - try to find the Doors of Demons, who can talk. Doors give tasks, after performing which the hero will pass into hidden locations and acquire rare things. Several Doors need not be looked for, they will necessarily meet on their own.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Lionhead Studios","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17736,"name":"Two Worlds Epic Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e5/6e504144ccbbc5c194c7f6cd6f544aaf.jpg","description":"Two Worlds Epic Edition tells a story about brother and sister who are involved into the conflict between Orcs and the free world. 300 years passed after the banishment of Aziraal. The younger sister named Kyra disappears in strange circumstances. The player gets a role of a bounty hunter and mercenary who has to go back to his roots in search of his sister. At first, you have to do mercenary tasks in the far north only having a few clues about where to search for your sister Kyra. It seems, that your sister’s kidnappers are after the relict of your family.\nTwo Worlds Epic Edition includes the original game also with the add-on called Tainted Blood, over 90 new quests, which takes place in the depths of the world of Antaloor. It also adds eight new multiplayer maps. It’s said that the game also has an amazing soundtrack composed by award winner Winner Harold Faltermayer, amazing landscapes where every living NPC  have his daily routine and dynamic life style. In the Two Worlds the player has to choose and choose a lot between various possibilities, he always has to take one side or the other. There is also dynamic combat system, an alchemy system which lets you to make unique potions and power-ups and also an intelligent magic system.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Reality Pump","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3189,"name":"Grow Home","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4d/b4df87a9b3f9867d0bfd9c1910193008.jpg","description":"Grow Home is a cartoon platformer from one of the subdivisions of the French publisher Ubisoft. The game tells the story of a robot named B.U.D., whose purpose is to grow a plant that can restore the atmosphere of the planet. Players along with the robot explore the open world driving B.U.D. in a whole or just parts of his body to overcome obstacles in his way.\n\nThe game was never meant to leave the Ubisoft, it is an internal development for the company's employees. But the game was so popular that it was decided to release it publicly.\n\nThe robot is controlled from a third-person perspective. Players can freely move around in the game world. The game allows to grow Star Shoots from the Star plant and use it as a platform to reach new areas and gain access to new locations and missions. Also, players can scan objects of flora and fauna, add, the received data are saved in the diary, stash found items in the backpack and use them if necessary.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":12108,"name":"DISTRAINT","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4c/b4c8dd2f639bf2e8b84b2f1c365406e0.jpg","description":"DISTRAINT is a two-dimensional adventure horror indie game developed by Jessee Makkonen.\n\n###Setting\nYou play as a man named Price. Price is a repo man who is tasked with repossessing a house of an old woman in order to save his partnership with a big corporation. Rather than scaring the player using jumpscares, the game uses it's own atmosphere and explores the everyday horrors people encounter. The game explores the themes of greed, regret, and quilt. \n\n###Gameplay\nBeing developed in only 77 days, the game is described as a speed project by its creator. It will take you 2 hours to complete the game's story. DISTRAINT is a pixel art-inspired narrative-driven experience. The players can only move left and right and use their flashlight. Button prompts for different actions appear on-screen. All the graphics in the game is hand drawn and also animated by hand. No asset in the game is used twice, as stated by the game's developer. “No cheap tricks!” as he puts it.\n\nNo HUD is present in the game. This was made to distract the player from the game as less as possible. \n\n###Deluxe edition\nThe Deluxe edition of the game features dynamic coloring, which adds to the game's depressive gray palette. Enhanced environmental lighting and graphical effects were also added to the game with the addition of a refined user interface.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jesse Makkonen","platforms":[{"id":0,"name":"PC"}]},{"id":5524,"name":"Brink","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/55c/55c7e7a972d361db3677c1dd10a5558d.jpg","description":"Brink is an immersive first-person shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character whether playing alone, with your friends, or against others online. You decide the combat role you want to assume in the world of Brink as you fight to save yourself and mankind’s last refuge. Brink offers a compelling mix of dynamic battlefields, extensive customization options, and an innovative control system that will keep you coming back for more.\nBrink takes place on the Ark, a man-made floating city that is on the brink of all-out civil war. Originally built as an experimental, self-sufficient and 100% “green” habitat, the reported rapid rise of the Earth’s oceans has forced the Ark to become home to not only the original founders and their descendants but also to thousands of refugees. With tensions between the two groups growing, Security and Resistance forces are locked in a heated battle for control of the Ark. Which side will you choose?\n\nKEY FEATURES:\t\t\t\t\t\t\t\t\t\t\tNot Just Another Hero – Brink's advanced player customization offers a near-endless combination of looks for your character – allowing for the appearance of your character to be truly unique.  As you progress through the game and acquire more experience, you’ll have even more opportunities for customization.\nTwo Sides to Every Story – Choose to fight through the single player campaign as either a member of the Resistance or the Security and then take your same character online to play cooperatively or competitively against other players.\nBlurring the Lines – Take your unique character online at any time you choose!  Brink allows you to seamlessly move between your single player campaign, co-op with friends, and intense multiplayer action. Multiplayer takes the story online where you can play with up to seven other people (or AI characters) cooperatively as you take on the opposing faction or with up to 16 players competitively.\nPlay SMART – Brink uses the familiar shooter controls that you’re used to, without frustrating, artificial constraints and adds a new feature: the SMART button.  When you press the SMART button, the game dynamically evaluates where you’re trying to get to, and makes it happen. Whether you’re a seasoned FPS veteran or someone just getting started, you’ll be able to make more intelligent decisions during the fast-paced action with SMART.\nContext-Sensitive Goals and Rewards - Objectives, communications, missions, and inventory selection are all dynamically generated based on your role, your condition, your location, your squad-mates, and the overall status of the battle in all gameplay modes.  You’ll always know exactly where to go, what to do when you get there, and what your reward will be for success.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":58385,"name":"Rage 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/662/66261db966238da20c306c4b78ae4603.jpg","description":"RAGE 2 is the second installment in the RAGE series of post-apocalyptic action games. It is inspired by the Mad Max movie series.\r\n\r\n###Plot and setting\r\nThe game is set in 2165, thirty years after the events of the original Rage. More than a century before that, the Apophis asteroid fell on Earth, causing mass destruction and driving humanity to near-extinction. The few remaining people hide in the few safe oases, while the rest of the world is a post-apocalyptic wasteland raided by gangsters and evil mutants. The main protagonist is a man named Walker, who is the last ranger of the wasteland and a wielder of superhuman powers. He fights against the totalitarian organization called The Authority.\r\n\r\n###Gameplay\r\nLike in the original RAGE, the sequel emphasizes its over-the-top action. The player controls Walker from the first person view and uses his huge guns and other weapons to fight monsters. The protagonist can also drive any vehicle that can be found in the game and engage in vehicular battles. When the player is driving, the game switches to the third person view. A new feature introduced in RAGE 2 is its Overdrive system that encourages aggressive playing style. By killing multiple enemies in a short amount of time, the player can enter Overdrive mode, which increases the guns' power and the amount of loot. There is also a multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"id Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":27,"name":"Pyre","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e63/e635b8c7fbe3ffd69ad6c1c586cd250e.jpg","description":"Pyre is an action-adventure game developed by Supergiant games. \n\n###Setting\nThe game is set in some purgatory. After getting banished by the society, the main character finds himself all alone. Three exiles soon approach him and invite the protagonist to party with them and nickname him the Reader. The group sets out to cleanse their souls.\n\n###Gameplay\nThe gameplay of Pyre revolves around some sports game, which is connected with a ritual known as the Rites, which happens in a parallel world. The Protagonist controls his three newly found friends in battles against three opponents on a small arena. Each team has its own pyre. Both pyres oppose each other. The objective of the game is to defend your pyre while attacking the enemy one. The player can only destroy the pyre with the orb, that is spawned in the center of the arena and which has to be grabbed and thrown into the pyre.\n\nDuring a round, the Reader can switch between the character he wants to control and pass the orb from one to another. Each player has their own amount of endurance which is required for moving around the arena. If the players of a team come together, they create a zone that is dangerous for the player that carries the orb. If the player with the orb should get into that zone, they'll be temporarily removed from the game.\n\nWhile free from the Rites, the player can travel through the world of Pyre, train his teammates or try to learn more about the Rites.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Supergiant Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":442857,"name":"Tomb Raider: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08e/08e8d09cd5aae30959c4486649fda3e6.jpg","description":"The cinematic action-adventure that forced Lara Croft to grow from an inexperienced young woman into a hardened survivor has been re-built for next-gen consoles, featuring an obsessively detailed Lara and a stunningly lifelike world. Lara must endure high-octane combat, customize her weapons and gear, and overcome grueling environments to survive her first adventure and uncover the island’s deadly secret. The Definitive Edition of the critically-acclaimed action-adventure includes bonus content and combines all of the downloadable content.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":17818,"name":"Overlord: Raising Hell","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8c/f8c181db845de856e519558451b8e481.jpg","description":"How evil can you get?\nDiscover how corruptible you are in Overlord, the twisted fantasy action adventure where you can be evil (or really evil). In the game's seriously warped fantasy world, players will become the Overlord and get first-hand experience of how absolute power corrupts absolutely. You could be a regular run-of-the-mill Overlord. However, with incredible power at your disposal and a team of evil-minded impish critters, the Minions, on hand to do your bidding, how will you resist the temptation to be wonderfully despotic?!\nGo deeper into the Overlord's twisted world as the single-player expansion content opens a series of hellish new levels, each a supernatural abyss for the game's five kingdoms: Mellow Hills, Evernight, Heaven's Peak, the Golden Halls and the Ruborian Desert. Access to each abyss is via a portal, which opens once a kingdom has been successfully conquered and the previous ruler banished to a personal hell within. However it's not just the fallen heroes that have been dragged into the abyss: the Overlord's newly loyal peasants have also been taken down into hell too.\nWith the undead denizens of each abyss on the attack and threatening the Overlord's reign above ground, there's only one thing for it: assemble your minion army, descend into each abyss and embark on a fresh wave of tyranny in order to return the serfs to their homelands, defeat the fallen heroes once and for all, and claim the throne of each kingdom's underworld.\nINCLUDES THE OVERLORD CHALLENGE PACK:\nCome and have a go if your Overlord's hard enough. All new pillaging fun with seven additional online multiplayer maps, including the competitive ‘Capture the Maiden’ map and ‘Protect Your Power’, where players must defend the Overlord's tower against waves of enemy attack.\nTHINK EVIL, BREED EVIL, CONTROL ALL! Get in the action and become the Overlord, the all powerful dark lord with a horde of minions to command and a land to conquer.\nCONTROL A HORDE OF MINIONS Slavish and loyal they'll smash, destroy, kill and steal anything for you. Your word is law.\nBECOME THE OVERLORD Do you want fear, respect, gold and power? Become the most powerful being in the world by any means necessary.\nCONQUER A TWISTED FANTASY WORLD Show the Seven Heroes, demonic Halflings, and Rabid Unicorns who's boss.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Triumph Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10028,"name":"Space Engineers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac7/ac707457a89f1f7d15ef5934a26ea21a.jpg","description":"Space Engineers is a game about exploring planets, building spaceships and stations, and mining resources from asteroids. It was a precursor of sorts to No Man’s Sky. The player explores worlds and systems that are based on the settings and options selected by the player; for example, the use of procedural generation, the speed of processes, and the hostility of the environment. Space Engineers allows a lot of options for customization, and the game’s code is open source, making it popular among modders.\nThe player assumes control over the human protagonist in a space suit and, at some stages of the game, an exploration ship (with options for both first and third person view). The player can build a variety of structures using different types of blocks and tools. Available structures include ships, planetary outposts, and space stations. \nThe game includes a campaign and a set of standalone scenarios. Each of the scenarios, in turn, can be played in “Creative” or “Survival” mode. The former is an easy sandbox in which the player is not limited in resources and cannot die. The latter requires the player to mine resources and to keep track of the main character’s health and oxygen level. The game’s graphics are based on voxels (3D pixels), though, unlike some other voxel-based games, it doesn’t look like pixel art.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Keen Software House","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":28131,"name":"Fortnite: Save The World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d97/d97f663b752a6484df105993f17abb49.jpg","description":"Fortnite is a survival simulator with an open world.\n\nThe primary goal of the game is to collect resources and then try to survive at day and night directly. Players will gather in teams to collect items that they can use to build a Fort during the day and to defend against zombies at night. Construction will be the main mechanics, a lot of items will be in the game. Players can build and edit each wall of their Fort, build stairs, roof and windows, sculpting them according to a particular need. The terrain and map in the game are randomly generated, and players are given various ranged weapons (like a sniper rifle) as well as edged weapons (like a katana). You can also create weapons, and character skills can be customised through upgrades.\n\nThe game features four different classes: ninja, alien, commando, and builder. Different classes have different abilities. For example, the builder builds faster and cheaper, and also strengthens the buildings themselves. And the ability to melee is much better in the ninja class than in other classes. Players can also destroy environment objects and scenery to get resources.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":12130,"name":"RimWorld","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d8/4d85fbe90066fdbef295a618640c4a82.jpg","description":"RimWorld is a sci-fi colony sim driven by an intelligent AI storyteller. Inspired by Dwarf Fortress, Firefly, and Dune.\nYou begin with three survivors of a shipwreck on a distant world.\nManage colonists' moods, needs, wounds, and illnesses.\nFashion structures, weapons, and apparel from metal, wood, stone, cloth, or futuristic materials.\nTame and train cute pets, productive farm animals, and deadly attack beasts.\nWatch colonists develop and break relationships with family members, lovers, and spouses.\nFight pirate raiders, hostile tribes, rampaging animals, giant tunnelling insects and ancient killing machines.\nTrade with passing ships and trade caravans.\nDecorate your colony to make it into a pleasurable space.\nDig through snow, weather storms, and fight fires.\nCapture refugees or prisoners and turn them to your side or sell them into slavery.\nDiscover a new generated world each time you play.\nBuild colonies in the desert, jungle, tundra, and more.\nLearn to play easily with the help of an intelligent and unobtrusive AI tutor.\nRimWorld is a story generator. It’s designed to co-author tragic, twisted, and triumphant stories about imprisoned pirates, desperate colonists, starvation and survival. It works by controlling the “random” events that the world throws at you. Every thunderstorm, pirate raid, and traveling salesman is a card dealt into your story by the AI Storyteller. There are several storytellers to choose from. Randy Random does crazy stuff, Cassandra Classic goes for rising tension, and Phoebe Chillax likes to relax.\nYour colonists are not professional settlers – they’re crash-landed survivors from a passenger liner destroyed in orbit. You can end up with a nobleman, an accountant, and a housewife. You’ll acquire more colonists by capturing them in combat and turning them to your side, buying them from slave traders, or taking in refugees. So your colony will always be a motley crew.\nEach person’s background is tracked and affects how they play. A nobleman will be great at social skills (recruiting prisoners, negotiating trade prices), but refuse to do physical work. A farm oaf knows how to grow food by long experience, but cannot do research. A nerdy scientist is great at research, but cannot do social tasks at all. A genetically engineered assassin can do nothing but kill – but he does that very well.\nColonists develop - and destroy - relationships. Each has an opinion of the others, which determines whether they'll become lovers, marry, cheat, or fight. Perhaps your two best colonists are happily married - until one of them falls for the dashing surgeon who saved her from a gunshot wound.\nThe game generates a whole planet from pole to equator. You choose whether to land your crash pods in a cold northern tundra, a parched desert plain, a temperate forest, or a steaming equatorial jungle. Different areas have different animals, plants, diseases, temperatures, rainfall, mineral resources, and terrain. These challenges of surviving in a disease-infested, choking jungle are very different from those in a parched desert wasteland or a frozen tundra with a two-month growing season.\nYou can tame and train animals. Lovable pets will cheer up sad colonists. Farm animals can be worked, milked, and sheared. Attack beasts can be released upon your enemies. There are many animals - cats, labrador retrievers, grizzly bears, camels, cougars, chinchillas, chickens, and exotic alien-like lifeforms.\nPeople in RimWorld constantly observe their situation and surroundings in order to decide how to feel at any given moment. They respond to hunger and fatigue, witnessing death, disrespectfully unburied corpses, being wounded, being left in darkness, getting packed into cramped environments, sleeping outside or in the same room as others, and many other situations. If they're too stressed, they might lash out or break down.\nWounds, infections, prosthetics, and chronic conditions are tracked on each body part and affect characters' capacities. Eye injuries make it hard to shoot or do surgery. Wounded legs slow people down. Hands, brain, mouth, heart, liver, kidneys, stomach, feet, fingers, toes, and more can all be wounded, diseased, or missing, and all have logical in-game effects. And other species have their own body layouts - take off a deer's leg, and it can still hobble on the other three. Take off a rhino's horn, and it's much less dangerous.\nYou can repair body parts with prosthetics ranging from primitive to transcendent. A peg leg will get Joe Colonist walking after an unfortunate incident with a rhinoceros, but he'll still be quite slow. Buy an expensive bionic leg from a trader the next year, and Joe becomes a superhuman runner. You can even extract, sell, buy, and transplant internal organs.\nAnd there's much more than that! The game is easy to mod and has an active mod community. Read more at http://rimworldgame.com.\n(All non-English translations are made by fans.)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ludeon Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":46301,"name":"Raft","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6b2/6b253d2d39fc05b2368e5e78bb4abffc.jpg","description":"By yourself or with friends, your mission is to survive an epic oceanic adventure across\na perilous sea! Gather debris to survive, expand your raft and be wary of the dangers of\nthe ocean!\nTrapped on a small raft with nothing but a hook made of old plastic, players awake on a vast,\nblue ocean totally alone and with no land in sight! With a dry throat and an empty stomach,\nsurvival will not be easy!\nRaft throws you and your friends into an epic adventure out on the big open sea, with the\nobjective to stay alive, gather resources and build yourself a floating home worthy of\nsurvival.\nResources are tough to come at sea: Players will have to make sure to catch whatever debris\nfloats by using their trusty hook and when possible, scavenge the reefs beneath the waves.\nHowever, thirst and hunger is not the only danger in the ocean… watch out for the man-\neating shark determined to end your voyage!\nFeatures:\n● Multiplayer! Survive by yourself or with friends in online co-op!\n● Hook! Use your hook to catch debris floating by.\n● Craft! Build survival equipment, weapons, crop plots and more to help you stay alive!\n● Build! Expand your raft from a simple wreckage to a buoyant mansion.\n● Dive! Drop anchor and explore the depths for more resources.\n● Fight! Defend your raft from the dangers of the ocean.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Redbeet Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":366885,"name":"Dragon Age: Origins - Ultimate Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/add/add07a75a3f1e479b55dbe920d9fb13d.jpg","description":"Get the ultimate Dragon Age™ experience! Dragon Age™: Origins – Ultimate Edition includes:\n\n~ Dragon Age™: Origins\nDiscover the groundbreaking RPG, winner of more than 50 awards including more than 30 'Game of the Year' awards! You are a Grey Warden, one of the last of a legendary order of guardians. With the return of mankind's ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all. Explore a stunning world, make complex moral choices, and engage in bone-crushing visceral combat against massive and terrifying creatures.\n\n~ Dragon Age™: Origins – Awakening Expansion Pack\nThe story of the Grey Wardens continues as you are named Commander of the order. As your first duties you have been entrusted with rebuilding the order as well as uncovering the secrets of the darkspawn and how they managed to endure. Fight new enemies, learn new skills and spells, and explore an all-new area of the world, Amaranthine.\n\n~ All Nine Content Packs\nExtend your adventure, collect new rewards, gain new party members, and more as you delve deeper into the Dragon Age™ saga.\n\nThe Stone Prisoner\n- Warden's Keep\n- Return to Ostagar\n- The Darkspawn Chronicles\n- Leliana's Song\n- The Golems of Amgarrak\n- Witch Hunt\n- Feastday Gifts\n- Feastday Pranks\n\n~ Key Features\n- A limited-time offer of the 2009 'RPG of the Year' Dragon Age: Origins, the Dragon Age: Origins – Awakening expansion pack, and all nine additional content packs\n- Critically acclaimed winner of more than 50 awards including more than 30 'Game of the Year' awards","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"BioWare","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3751,"name":"Dark Souls II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/651/6512783a214618584d144d5d852ba595.jpg","description":"Dark Souls II is the third installment in the well-known Souls series. It’s a different game from all the others because of its directors. With Dark Souls II the main director and founder of Souls-like genre Hidetaka Miyazaki took place only as a supervisor of the project, leaving a place of the director of the game for two young video game designers Tomohiro Shibuya and Yui Tanimura. One could ask if the game is as good and beautiful as other past games in the Series and the answer would be that Dark Souls II is different yet deep and unforgiving as all the other titles in the series. The famous difficulty of previous games is still there but the world is much simpler yet connected and dangerous. Enemies still respond after death of a player but only about 15 times. After that they disappear forever. Boss battles are much simpler, this time focuses on many simpler bosses at a time instead of one powerful boss. \nDark Souls II is one of those games which were painfully downgraded in a favor of hardware of consoles, that means that players got less graphically advanced version than promised. Yet the game is interesting and deep and it’s definitely a must play for every Souls fan.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":10039,"name":"Tyranny","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c81/c8120bf5faed7309c9812553da54da80.jpg","description":"Tyranny is a plot-driven dark fantasy game. The player assumes the role of a minion at the dark lord's service. Tyranny is a spiritual successor to Pillars of Eternity and uses the same graphics engine and gameplay model.\n\n###Plot\nThe game is set in a medieval world called Terratus that was almost completely conquered by Kyros, an immortal evil overlord. No one has ever seen Kyros, but he spent four centuries uniting all the realms under his reign. Kyros rules through his powerful viceroys, the Archons, who, in turn, command their minions called Fatebinders. The protagonist is one of Fatebinders at Kyros' service. He or she is sent to the Tiers province that is torn by the conflict. Two of the Kyros' armies fight each other, and it slows down the conquest. The protagonist has to stop the conflict or to be executed.\n\n###Gameplay\nThe player has to create the main character from scratch and define his or her abilities. The game has no character classes, and the character skills are individual. The process of customization also includes several questions about the character's background. The answers define how the character is perceived by the others and which factions he or she may join. The factions also influence the main character's abilities and the companions the player can recruit. \n\nLike in Pillars of Eternity, the player has to make difficult decisions that strongly influence the plot and the lives of NPCs. Every dialogue option may lead to a dramatically different outcome.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17473,"name":"Quake Live","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb7/bb71799efe642c69f28c92c835a1257d.jpg","description":"Previously free-to-play, Quake Live is an updated version of the classic multiplayer first-person-shooter Quake III from id Software. In 2015, developers abandoned the free-to-play model and now users must pay for the full version of the game. It is available on Steam and players can log in using it. After the release on the site, the developers refused to pay a subscription. Previously, it cost $ 10.\n\nThe gameplay is as simple as possible - players compete for the number of frags in each match. There are scattered weapons, armour, first-aid kits and other power-ups on the map. As the user plays he discovers new tactics and movements, like rocket jumping and strafe. In total there are 12 modes in the game.\n\nThere is no single campaign, the whole game is full-throttle multiplayer experience with fast-paced matches. The developers are betting on turning Quake Live into a major cybersport discipline and hold one of the biggest Quake tournaments at QuakeCon.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"id Software","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":486,"name":"Tales of Berseria","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/158/15880530ce424311f264671e4b0611ee.jpg","description":"A tale of emotion versus reason…\nIn Tales of Berseria, players embark on a journey of self-discovery as they assume the role of Velvet, a young woman whose once kind demeanor has been replaced and overcome with a festering anger and hatred after a traumatic experience three years prior to the events within Tales of Berseria. Velvet will join a crew of pirates as they sail across the sea and visit the many islands that make up the sacred kingdom of Midgand in an all-new adventure developed by the celebrated team behind the Tales of series. Veteran Tales of character designer Mutsumi Inomata has personally designed Velvet and famous Japanese animation studio, ufotable, returns to animate the game’s breathtaking cutscenes; delivering truly epic and emotional storytelling in their unique style.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":5995,"name":"Little Inferno","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d79/d794c9198ec994cc12ede5ebd4672623.jpg","description":"Congratulations on your new Little Inferno Entertainment Fireplace! Throw your toys into your fire, and play with them as they burn. Stay warm in there. It's getting cold outside!\nBurn flaming logs, screaming robots, credit cards, batteries, exploding fish, unstable nuclear devices, and tiny galaxies. An adventure that takes place almost entirely in front of a fireplace - about looking up up up out of the chimney, and the cold world just on the other side of the wall.\nKey Features:Nominated for three awards at the Independent Games Festival including the Seumas McNally grand prize, Technical Excellence Award, and Nuovo Award, with Honorable Mentions in Design and Audio.\nFrom the creators of World of Goo and Henry Hatsworth in the Puzzling Adventure\n100% indie - made by 3 guys, no office, no publishers, no funding\nIAP Free - no spam, upselling, ads, of any sort. Just the game.\nZero Waste - short, polished, perfeccct as possible","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Tomorrow","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":45763,"name":"Bomber Crew","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d1/9d12fe709e4bc87166b1cdb2101fa91b.jpg","description":"Prepare your crew for their most dangerous mission yet and go chocks away for a sky-bound expedition in this strategic survival sim, Bomber Crew.\nChoose your Crew!\nTrain and personalise your own Bomber Crew. Procedurally-generated names, skills and back stories means a unique experience for everyone, but be careful, as death is permanent.\nImmersive flight simulation!\nCarefully manage everything from fuel, ammo, hydraulics and more in your very own physics-based Bomber. Make it yours with a wide array of nose art and liveries, or design your own with the simple to use in-game tool.\nFast paced strategy!\nEach mission is a high-risk expedition where danger comes from every angle. Enemy fighters, flak guns, poor weather, low oxygen and an array of other perilous dangers await when the wheels are up.\nBe prepared!\nPreparation is key for a successful mission. Tag enemy fighters before they reach you, make sure your destination is marked but most importantly, make sure you have the right team for the job. On a WW2 bomber, every role is essential for victory!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3277,"name":"Quiplash","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/680/6805c301d72c53ee9f4e8b8ed2d4558a.jpg","description":"For 3-8 Players and an Audience of thousands!\nThe team behind the hit party games YOU DON’T KNOW JACK, Fibbage, and Drawful presents Quiplash, the laugh-a-minute battle of wits and wittiness! Use your phone or tablet to answer simple prompts like “Something you’d be surprised to see a donkey do” or “The worst soup flavor: Cream of _____.”\nNo rules, no correct answers! Say whatever you want!\nYour answer is pitted against another player’s answer in a head-to-head clash of cleverness and comedy (or just “Which answer is least stupid?”). Other players – and even an Audience of people waiting to get in the next game – then vote for their favorite answer.\nQuiplash is a go-to party game that everyone can play and enjoy!\nNOTE: This game is a same-room multiplayer party game.\nNOTE: This game is in English only.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12850,"name":"Cave Story+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f2/4f2246a85225b7a91d63990fe540b7c4.jpg","description":"Cave Story is a game in the Metroidvania platform-adventure genre, first released on PC in 2004. The game is set in deep dark caves on a floating island. The island is inhabited by a race of intelligent rabbit-like creatures called Mimigas.\n\nControlling the main character with a gamepad or a keyboard, the player explores an amazing and mysterious world, simultaneously solving platformer-puzzles and defeating enemies. In the world of the game, several types of weapons are available, and a victory in a duel with a foe will bring experience points. In the rest - Cave Story is a classic 2D platformer with polished controls and an interesting setting.\n\nThe unnamed main character wakes up in a dark cave without remembering who he is and where he came from. After reaching the settlement, he learns that the world of Mimigas is in danger and decides to help. In the + version of the game released on Steam in 2011, an alternative scenario that does not coincide with the original English localization of the game is featured, as well as an additional “Wind Fortress” level.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Nicalis","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":28126,"name":"FIFA 18","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb4/cb487ab3c54b81cb685388bab42ec848.jpeg","description":"FIFA 18 is the 25th instalment in the FIFA series and this one has Real Madrid player Cristiano Ronaldo on the cover of regular game edition. Ronaldo Nazario appears on the Icon edition of the game. FIFA 18 is the second game in FIFA series that uses Frostbite 3 engine yet some versions of FIFA 18 uses different game engine. Versions for PlayStation 4, Microsoft Windows and Xbox One include a single-player story driven mode called The Journey which is the continuation of the mod The Journey: Hunter Returns from the FIFA 17. Version for PlayStation 3 and Xbox 360 called FIFA 18: Legacy Edition do not include any new gameplay features yet it has updated kits and squads. \nFIFA 18 features 52 licensed stadiums from 12 countries, plus 30 generic fields. FIFA 18 has a new version of Ultimate Team Icons which includes legends like Diego Maradona, Pele, Ronaldo, Lev Yashin, Thierry Henry and other well-known players retired like Ronaldinho and Roberto Carlos.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":10037,"name":"Europa Universalis IV","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eff/eff7b309ae98c32b48f22a10e7523106.jpg","description":"Europa Universalis IV is a global strategy game developed by Paradox Interactive. It is the fifth game in the series, not counting the add-ons.\n\n###Gameplay\nThe game can take place at any time starting from the late Middle Age to the Napolean Wars era. The player can control any country there is in the game. It is possible to choose any starting date from November 11th, 1444 to January 1st, 1821.\n\nThe player controls every aspect of life in his country. Diplomacy, religion (with each religion having its own development system), trading, science, and exploring the new lands (such as the Americas, Africa, and Australia). The player also has the country's military under their control. Every aspect of that time's society falls totally under the control of the player. You can build a new colonial superpower, become a dictator, establish a total dictatorship, or create a prosperous, democratic trade empire. \n\nThere is no clear objective in the game. Instead, it is set by the player. However, the developers try to guide the player into playing certain scenarios by using the in-game achievement system. For example, one of the game's achievements is to unite Italy.\n\nIt is also possible to transfer the progress from another game made by Paradox Interactive, Crusader Kings 2, to Europa Universalis IV.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11975,"name":"STAR WARS Jedi Knight: Dark Forces II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/841/841b827812b7e2bf8b00cd200f35406d.jpg","description":"Dark Forces™ set the industry standard for first person action in the Star Wars® universe. Now Jedi Knight: Dark Forces II picks up where the award-winning game left off...with even more features and firepower in dazzling 3D graphics. As Kyle Katarn, you must acquire the lightsaber and learn the ways of the Force to become a Jedi Knight. Confront old foes... Greedo, Boosk, stormtroopers. And new enemies... seven dark Jedi who plan to harness the power of an ancient burial ground for unsurpassed evil. But take heart, your 10 weapon arsenal and over 12 Force powers make you a force to be reckoned with.\nSingle or multiplayer gameplay over modem, network or Internet. 9 multiplayer levels\nAll new realistic 3D environments with animated 3D characters in 21 heart-stopping levels\nEncounter seven dark jedi, each possessing unique powers\nCompatible with many 3D graphics cards\nIntense Star Wars action in an all-new story fraught with danger and adventure - do you take the quick and easy path as Darth Vader did or do you take the patient route to Jedi Knighthood?\nIf you choose the light side:\nTrain to become a Jedi Knight - master the elegant Lightsaber and learn four special apprentice abilities\nUse exclusive light side powers: healing, persuasion (for the weak-minded), blinding and absorption\nOr be tempted by the dark side:\nUse your Jedi Knight training and apprentice abilities to become an agent of evil\nUse exclusive dark side powers: the grip (used if there's a disturbing lack of faith), Force throw, energy bolts and destruction","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":397473,"name":"Back 4 Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4fe/4feffcec6315c5f5a96442a8444431ca.jpg","description":"Back 4 Blood is a thrilling cooperative first-person shooter from the creators of the critically acclaimed Left 4 Dead franchise. You are at the center of a war against the Ridden. These once-human hosts of a deadly parasite have turned into terrifying creatures bent on devouring what remains of civilization. With humanity’s extinction on the line, it’s up to you and your friends to take the fight to the enemy, eradicate the Ridden, and reclaim the world.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Turtle Rock Studios","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":3513,"name":"LEGO Batman 3: Beyond Gotham","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8c/a8cd58ee985ab6d509370bddada91dbd.jpeg","description":"The best-selling LEGO Batman videogame franchise returns in an out-of-this-world, action-packed adventure!  In LEGO Batman™ 3: Beyond Gotham, the Caped Crusader joins forces with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth.  Using the power of the Lantern Rings, Brainiac shrinks worlds to add to his twisted collection of miniature cities from across the universe.  Now the greatest super heroes and the most cunning villains must unite and journey to different Lantern Worlds to collect the Lantern Rings and stop Brainiac before it’s too late.\n• Exciting space combat - For the first time ever, battle with Batman and his allies in outer space and the various Lantern worlds including Zamaron and Odym.\n• Robust roster of DC Comics heroes and villains - Play and unlock more than 150 unique characters with amazing powers and abilities, including members of the Justice League, and BIG LEGO Figures such as Cyborg, Solomon Grundy and more.\n• Unique storyline with new plots and twists –Surprising disguises, Brainiac’s mind control ability, and the power of the Lantern rings bring a whole new twist to characters you thought you knew.\n• Hack computer terminals - Enter a virtual world to escape mazes, battle in arenas, and race to find the code.\n• Bat-tastic Gadget Wheel - With a simple press of a button, choose and upgrade select character’s suits and abilities.\n• Variety of iconic locales - Visit the Hall of Justice, the Batcave, and the Justice League Watchtower to access shops, trophy rooms, and the hero and vehicle customizers.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"}]},{"id":3848,"name":"Killzone Shadow Fall","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dfa/dfa0906773ebb8a50d15548ac5b8ee5e.jpg","description":"The sixth game of the Killzone series exclusive to Sony PlayStation consoles. \n\nThe story begins several years after the construction of “The Wall”. The year is 2370, planetary colonization sparks a conflict between two factions on the remote planet. Michael Kellan and his son Lucas attempt to sneak to it. Like it predecessors Shadow Fall features faction packed the first-person shooter in the sci-fi game world. But if previous games portrayed large-scale warzones with many allies and foes Shadow Fall favour more stealthy gameplay with the semi-open level design with main protagonists being alone for half of the singleplayer campaign. Also a coop mode available with up to 4 players in a session.\n\nMultiplayer rocks 10 maps and 3 classes, but the number of the playable variants can vary: users are granted the ability to create custom map presets called “Warzones”. All classes from are available the start but you can upgrade skills and items.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":12045,"name":"Two Worlds II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/db7/db7ede330a09ddeb5c899900f70b1896.jpg","description":"Updated HD Version 2.03 (July 2017)\nA breathtaking journey into Antaloor's past.\nAfter the downfall of Aziraal, God of Fire, the Dark Lord Gandohar has nearly achieved his objective to disrupt the balance between the elements. Dark magic surges into the land to fill the void. Recognizing the potential for complete control over the dark powers, Gandohar starts to use the power of Aziraal trap within Kyra, the descendant of the Orphans. Despite her ancestry, Kyra cannot endure the strain. With Antaloor already in his clutches, Gandohar concocts a new plan from his stronghold in Oswaroth. There are still those who struggle against the tyrant, hoping to shift the balance of forces in their favor. The fight for Antaloor continues...\nFive years have passed since dramatic events brought the whole world to the edge of the abyss. The hero is a prisoner in the dungeons of Gandohar's castle. His hopes of saving his sister vanished with his freedom. Just as despair threatens to overcome him, hope comes from where he would have least expected. The Orcs, a race the hero had always hated, have put together a rescue squad that frees the hero from his bonds. He emerges into a land desecrated by evil. He embarks on a journey to shed light on Gandohar's dark past, hoping to discover a weak point in his enemy's defense. If he fails, he will lose his sister forever.\nGameplay\t\t\t\t\tA perfect mix of flexibility, creativity and state-of-the-art technology \"Two Worlds II\" is a perfect blend of classic and innovated RPG features, atmosphere, and technology. A complex quest system and an exciting main story draw you into the world of Antaloor, made richer by secondary quest scenarios. Rich gameplay and engaging atmosphere propel the story and captures attention, promising danger and exploration throughout the many quests and video sequences. Enhanced AI, balancing standards, experienced authors, an active combat system, the innovative DEMONS™ magic management, and the PAPAK™ alchemy system guarantee enjoyment for new and experienced gamers. An artistic system of attack and defense moves has been integrated into the game. Parries and changing hit results creates a real opportunity for tactics and excitement, as the AI engage in combat and employ strategy of their own. The game also offers extreme flexibility in the weapon and armament design possibilities. The cornerstone at the heart of this feature is the newly created 'CRAFT'™ tool. Players can break down items into their basic materials and create new unique items. \"Two Worlds II\" is also graphically superb. The powerful GRACE™ engine offers technological highlights such as an unlimited number of dynamic light sources, 24 bit HDR post-processing, and Real Eye Adaptation. It will drastically reduce loading times, improve general game performance, and enable full gameplay with only moderate hardware requirements.\nKey features:A flexible combat system with variable attack moves, parrying and special tricks\nState-of-the-art technology, thanks to a powerful GRACE™ engine and special tools\nLots of mini-games for breaking up gameplay\nIntuitive user interface for the DEMONS™ Magic system and the PAPAC™ Alchemy system\nMercenaries and magically-created beings accompany the player\nComplex object management with movable and usable items\nSpecial CRAFT™ tool enables the individual configuration of armor and weapons\nMany Boss opponents, including special combat strategies and unique rewards\nFlexible MoSens system guarantees realistic every day and combat movements\nVarious ways of moving, like walking, running, sprinting, riding, swimming, sailing and teleporting\nCaptivating background story with numerous cutscenes\nExtensive Multiplayer part including building/setup simulation","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Reality Pump","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]