[{"id":17664,"name":"Primal Fears","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/521/52109b23b674620954d9092478d760e6.jpg","description":"Due to a chemical known as pharGONe, the world has been turned upside down. Battle your way through multiple levels, earning upgrades, competing against your friends and more, and find the truth about what has happened to the world.\nUse a variety of weapons to stop the mutated population, and save yourself from being another victim.\nNot sure exactly what you are facing, Primal Fears harkens to the depths of the human psyche as you fight monstrous foes alone or with friends. Nothing is more scary than the unknown and it is your goal to reveal the truth...Key Features:Co-op game play with you and your friends up to four players.\nA plethora of weapons including primary, secondary and other items of use like RC-cars, turrets, drones...\nBuy and upgrade over 15 weapons to make each play through of a level unique.\nPlay the story missions or arenas that are both re-playable to challenge your skill.\nA variety of enemy types, ranging from small to hulking.\nSteam leaderboards, achievements, and cloud saving enabled.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"DnS Development","platforms":[{"id":0,"name":"PC"}]},{"id":15096,"name":"Clicker Guild","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57b/57b5c3900f93bec346099d501b1d6f71.jpg","description":"Clicker Guild is a beautifully animated free to play clicker, with a special take on the genre by adding randomly generated loot for the characters.\nSpecial Features of Clicker Guild\nMany unlockable heroes\nDifferent areas to explore\nA special take on the clicker genre by randomly generating loot\nAnimated monsters and recruitable heroes\nRebirth and Artifacts\nAchievements\nFree to Play","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fox Dawn","platforms":[{"id":0,"name":"PC"}]},{"id":10500,"name":"Fable Fortune","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59b/59b567ac38a6f16cc927c53be4f4b570.jpg","description":"EARLY ACCESS FOUNDERS PACKReceive Exclusive Founders rewards, plus 10 bonus Card Packs (making 30 total)!\nAbout the Game\nFable Fortune is a game of Choice and Consequence. Play as one of six unique Heroes in a card game with fast-paced and thrilling tactical gameplay.\nJoin our Early Access to receive Exclusive rewards including the Fabled Card - Giant Egg, Exclusive Trophy Card - Chicken Vengeant, and 20 Card Packs (Plus an extra 10 as a bonus when you start playing)\n\n\nAt the start of a match, you must choose your quest. Completing quests earns unique rewards which can help turn the tide of battle.\n\nOn completing a Quest, you must choose, Good or Evil?\n\nTurning to Good or Evil changes the abilities your hero can use, but also the powers and properties of your cards.\n\nThis means you can react to your opponent, changing your strategy and the cards in your hand based on the choices you make.\n\n\nFable Fortune has been designed from the ground up around 2 player co-op.\n\nTeam up with a friend or stranger to learn the game, working together to take down challenging Raid Bosses.\n\nIn Co-op mode, you take turns to fight, but you share each others units. For the hardest challenges, you’ll need to work closely with an ally, designing decks and picking heroes which synergize with each other.\n\nBeat bosses to earn exclusive prizes and rewards.\n\n\n\nDifferent Arenas have different Quests and Rewards, changing the battlefield.\n\nEvery week, you’ll see special events with entirely different rules.\n\nOnly moustaches allowed? Max power mode? Hatch an Egg each time you use your hero power?\n\nWe aim to have an ever changing, evolving meta which rewards experimentation and puts a focus on strategy and skill.\n\n\n\nMatches in Fable Fortune start with 3 Gold, meaning it’s straight into the action quickly.\n\nFor each deck you create, you can pick a special ‘Trophy’ card which you’ll receive if you’re playing second, to get things off to a strong start.\n\nFable Fortune allows you to defend any unit on the battlefield with the ‘Guard’ feature. Because any unit can protect your Hero, this open up a huge range of deck-building strategy and possibilities.\n\nChoose to protect yourself, or your most powerful units. Some units have special abilities which will trigger when they’re placed into Guard.\n\nWe’ve focused on minimizing randomness in the game; emphasizing skill and strategy.\n\n\nOn top of any purchases you make, you’ll start the game with 10 Card Packs.\n\nThis includes a Guaranteed Fabled Card.\n\nThe first time you play a hero, you’ll get two packs, and can gain more than 50 just for levelling heroes. We’ll regularly be rewarding new and interesting cards for taking part in Events, Co-op or PvP.\n\nWhether you choose to spend money or not; we want the game to be enjoyable and competitive.\n\n\nWe’re a small, passionate development team.\n\nWe’ve chosen to go into Early Access as we want to get the community involved in the development of the game. We need your support, advice and help to make this the best card game around.\n\nInvolving you, the community, in the design process is really important to us and we’ll be running community designed and driven events and competitions in the game as we move forward.\n\nWe hope to see you on the battlefield!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mediatonic","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10377,"name":"Fear Effect Sedna","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f9/6f9bf1251496f71e962ec6e2d542e393.jpg","description":"FeaturesNew environments in isometric view: Explore the deep caves of Greenland, abandoned scientific complexes, underwater stations and ethereal realms based on Inuit mythology.\nA real-time tactical action game: Exploit your heroes' special abilities and combine them to maximize your team's effectiveness in attacks.\nA deep and mature story: Learn more about Fear Effect's iconic characters' past as they delve into this new mystery.\nExplore a whole new culture: Myths from the Inuit people are imbued with power of the elements and the cold sea. Meet and fight unexpected creatures from the spirit realm!\nAbout the GameBe part of a new Fear Effect adventure with Fear Effect Sedna, a new game in the classic series made popular on the original PlayStation console. With a whole new story, and shifting to a pausable real-time tactical action style, players will be able to control the team strategically and tackle enemies and puzzles alike.\n\nFear Effect Sedna is set four years after the events of the original Fear Effect game, and things have changed for the team. Hana, freed from the Triad, lives with Rain in Hong Kong and works as an occasional mercenary, while Deke has grown apart from them since Glas returned to the US.\n\nHana accepts a small mission for a shadowy organization asking for her services. Her target: a mysterious ancient statuette held by the Chinese ambassador in France. She sees it as a good opportunity to visit her birthplace... But this 'easy' mission is about to lead Hana to something way bigger than she expected.\n\nMeanwhile Glas is approached by a client who catches his attention enough that he soon sets out for Greenland.\n\nHow will these events bring the old team back together?\n\nFear Effect Sedna is dedicated to recreating the atmosphere and characters from the original Fear Effect. However, while there are familiar aspects of the game to previous incarnations of the franchise, you'll find yourself immersed in a completely unique and new world with Fear Effect Sedna - one that will appeal to fans both old and new.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":5378,"name":"7 Wonders of the Ancient World","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/599/5997ad7d61da2bb43d794d77488a5480.jpg","description":"Embark on a journey no one has taken before! Your quest begins at the foot of The Great Pyramid of Giza and continues through the Egyptian sands to the mysterious Hanging Gardens of Babylon.  Travel through the enchanting Mediterranean islands to the glory of ancient Greece as your voyage continues.  If you’re successful, you will behold the amazing Seven Wonders of the World.  Let the journey begin!\nKey Game Features:\n•\tSupply building stones to your workers by matching three same-colored runes\n•\tTime is limited!  If you don’t make enough progress, your workers will strike\n•\t49 original levels as you journey through the 7 Wonders of the Ancient World\n•\tEarn exciting power ups that will aid in your journey","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PSP"}]},{"id":4061,"name":"Army of Two: The Devil’s Cartel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/581/581d68d62e2371d5683ce89cec906a13.jpg","description":"Pure co-op is back! Army of TWO™ The Devil’s Cartel delivers a fun, over-the-top co-op experience. Activate the new Overkill mode to unleash explosive destruction on a lethal Mexican drug cartel. Take on dangerous missions and earn money to upgrade your gear with extensive weapon customization and the all-new in-game mask creator for unlimited possibilities. Experience the full action-blockbuster campaign in local split-screen or online co-op!\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\n© 2013 Electronic Arts Inc. EA, the EA logo and Army of TWO are trademarks of Electronic Arts Inc.  All other trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":1115,"name":"Red Dead Revolver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7e/f7e2d60d8e813593c831a07d28bba5c3.jpg","description":"Vast, rugged, and lawless. As a young man, you were helpless to prevent the slaughter of your family at the hands of bandits. Many years later, you live as a bounty hunter bringing criminals to justice, while struggling to unravel the mystery of your past. You must find those who murdered your family. Then, you will take your revenge.\nA blazing arcade-style third person game fueled by precision gunplay, Red Dead Revolver is a classic tale of vengeance on the untamed frontier.\nExperience Red Dead Revolver for PS2™ with full 1080p up-rendering and enhanced features such as Trophies, Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita or PS App.\n1 player\nNetwork Players 2-4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2002-2004 Rockstar Games, Inc. Rockstar Games, Red Dead Revolver, Red Dead, Take-Two marks/logos are Take-Two Interactive Software trademarks. All Rights Reserved. This videogame is fictional doesn’t depict any actual event/person/entity & any similarities are coincidental. Take-Two doesn’t endorse or encourage engaging in any conduct depicted in game. Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is strictly prohibited. Use of software is subject to license in the game manual & online at rockstargames.com/eula. Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee and/or account registration (13+).This title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not supportPlayStation®2 peripherals, therefore some functionality may not be available.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Rockstar Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":987039,"name":"Supermarket Together","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/722/722956391926ea2f39e7b23e028f9574.jpg","description":"Up to 16 players or go soloSplit the action with your friends: the more players in your supermarket, the more demanding customers will become. You can also choose to go solo and inflate the difficulty artificially if you are feeling hard-working.\nUnlock franchises and perks in the skills blackboardOwning a successful supermarket grants Franchise Points: use these to advance in the skills blackboard and add more advantages to your business like unlocking products or improving your employees performance.\nAcquire shop space, storage or extra facilitiesExpanding public space allows player to offer more and better merchandises. A fully improved store can harbor up to 49,000 products in its shelves.\nDo not neglect secondary duties.Extra activities like cleaning make customers happier. Careful with shoplifters, catching them red handed will prevent finances leaking at the end of the working day.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"DeadDevsTellNoLies","platforms":[{"id":0,"name":"PC"}]},{"id":966910,"name":"MY HERO ULTRA RUMBLE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5b/c5b8a21069486a495a336ae358cc0ccf.jpg","description":"Leap into the fray with your fellow heroes...and villains! Use communication, tactics, and synergize Quirks with your team of 3 to be the last ones standing in this 24-player Battle Royale!\nPick up your favorite characters from a quirky roster divided into 5 archetypes: Strike, Assault, Rapid, Technical, and Support. The strengths of each character are completely different depending on their unique Quirk.\nFind items, interact with civilians, and defeat opponents to improve your abilities and get the upper hand over other teams!\nUnlock new characters and customization options by gaining experience and completing missions. Participate in seasonal events and try your luck with tickets to glam up with exclusive items!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Byking","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":450231,"name":"Danger Scavenger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f14/f14364824a51b97e5a363f3642fa4e4f.jpg","description":"Deadly efficient. Highly skillful. Invisible to indifferent citizens. They fight the greedy corporations that have entire nations under their thumb. Suits scornfully called them Scavengers.\n\nIt was they who first noticed that the situation turned around. And it's the artificial intelligence A.I.O.N.E., who took over the control causing the machines to revolt against their masters.\n\nThe time has come. Step out of the shadow to face this new enemy in open battle.\nSoon A.I. will have to learn how dangerous the Scavengers are.\n\nEvil corporations together with dystopian cyberpunk setting bring doom upon the world. A group of outcasts - Scavengers - once rejected by fate, now glorified and admired decide to overcome the status quo... and of course, loot some great treasures on their way and return to their hideout with a bag full of great treasures... or broken scrap.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Star Drifters","platforms":[{"id":0,"name":"PC"}]},{"id":378580,"name":"Antimatter Dimensions","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f05/f058b6acee584db74cd990f88c56a82e.jpg","description":"Antimatter Dimensions is an Idle Incremental game with multiple layers of unlocks, prestige, and achievements. The basic goal is to reach Infinity and receive an Infinity point, which can be spent on various upgrades to increase your overall production.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hevipelle","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Web"}]},{"id":244877,"name":"The Uncertain: Episode 2 - Light At The End","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ae/8aee9dedeed2ef4c8a7357c0c1f8d2af.jpg","description":"You are afraid. You are forced to constantly hide. Those who just recently served you, turned against you, started hunting you. Your friends and family have been kidnapped. You do not know where they are or what has become of them. And there is nothing you can do about it. You can only hide and survive, without hope, not understanding why this is happening. You are outcasted, outlawed. You are human.\nThe Uncertain is an episodic story-driven adventure game by ComonGames studio set in a post-apocalyptic world. Humanity disappeared from the face of the Earth and has been replaced by robots. In the first episode of the game the main protagonist was an inventor robot RT, who finds himself among a small group of robots, trying to help surviving humans. In Episode 2 we will see this post apocalyptic world through the eyes of one of the survivors: a girl named Emily. Together with her, the player has to find out the cause for humanity’s disappearance: was it a rogue AI or something else entirely?\nKey features:\nClassic third-person sci-fi 3D adventure about robots that have taken over our planet\nSome of your decisions will affect certain events in the game\nPuzzles form an important part of our game. Each one of them is unique. Puzzles won’t drive you mad, but you’ll have to concentrate\nThe main character has a holographic watch that he can scan items, take photos and find Easter eggs with\nOriginal indie soundtrack\nBeautiful and unusual post-apocalyptic atmosphere","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ComonGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58939,"name":"Golf Club: Wasteland","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a08/a087039ca58bc984dc05b793fbf1877a.jpg","description":"After the Great Ecological catastrophe the ultra rich move to Tesla City on Mars. The rest of us died. Now, citizens of Mars take flights to Earth and play golf in the ruins of civilization. However, one of the Mars mission pilots cannot fit in the new Martian society. The homesick pilot uses his connections at Golf Club: Wasteland for one last solo trip to Earth.\nORIGINAL SOUNDTRACK: Radio Nostalgia from Mars. Citizens of Mars, now nostalgic for Earth, listen to music from the 2020s and share memories from their past life on Earth. 7 original songs and 5 personal stories from citizens of Mars.\nThis award-winning game is an atmospheric visual narrative with walking, jet-pack flying, and golfing in post-apocalyptic landscapes.\n————\nBEAUTIFUL\nA lush, calm, and funny experience. Each level has neons referring to current social events, destroyed monuments, Silicon Valley, graffiti, alternative pathways, and one unexpected character.\nMUSIC\nWhile revisiting Earth, the Pilot listens to Radio Nostalgia from Mars, a unique concept album. The OST is also available as an album for purchase.\nSTORY\nThree storytelling perspectives: text between levels, the Pilot’s diary, and stories in the radio program.\nSATIRE\nReferences are planted throughout the game world. If you’re passionate about current affairs, appreciate great design and have a healthy skepticism toward our collective future - this game is made for you.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Demagog Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":51323,"name":"Kirby: Star Allies","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d5/7d5ad1326497d1533461a4541afb32f3.jpg","description":"Kirby™ is back—and he's finally on the Nintendo Switch console in HD! But this time, he's not alone. Recruit enemies by hitting them with hearts and gather helpers for a party of up to four characters. On top of that, you can join with up to three friends for a different kind of team-up action!\n\nFeatures:\n\nThe newest Kirby title comes to the Nintendo Switch console in HD\nRecruit up to three enemies as helpers by hitting them with hearts\nReturning copy abilities include, Sword, Fire, Water, Bomb, Broom and many more!\nImbue copy abilities with different elements, such as wind, water, fire and electricity, by borrowing or giving them to helpers to add more attack power, unleash powerful attacks, or solve puzzles\nUp to 4 players can join in with the horizontal Joy-Con™ controller configuration, or 8 Joy-Con with 4 Joy-Con Grips","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":44175,"name":"All You Can Eat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cce/cce7653ca56ae86fb123c646d794e081.jpg","description":"Story\nTake control of a modern hero of our times, a man so lazy he decided to quit his job and just spend his life inside an All-you-can-eat diner.\nAs years go by, his freeloading nature becomes legend, but then a tragedy occurs - the diner is about to close down! Will our hero finally settle down and get a regular job? Never!!!\nEmbark on an epic quest filled with humor, puns and controversy as you traverse the city in search of a solution to your life's problems.\nMemorable characters include yourself, your dad who is also your only friend, a very foxy secretary love interest (but that just doesn't work out... at all), and half a dozen more\nThe plot takes a dark turn when the CEO of a Megaslimy corporation and the Mayor of whatever team up to do some evil.\nCan you stop them and more importantly - do you even care?Gameplay\nAll You Can Eat is a unique interactive comic that blends the mechanics of playing a game seamlessly with the experience of reading a comic:\nevery interaction in the game world (such as talking, picking up items, using objects etc.) creates a new comic panel, furthering the story\nat any time during the game you can scroll up and down to read what you've created among hundreds of unique hand-drawn (and hand-scanned!) content rich panels\nthe in-game conversations mimic the “3 panel structure” of daily comics with context, setup and delivery\nwhen the player ends the game, he is given the option to print out his gameplay in a comic book format\na new game+ option with a developer commentary track when you finish the game","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Gamechuck","platforms":[{"id":0,"name":"PC"}]},{"id":32029,"name":"Stronghold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cb/6cb8560e101eebb2c0abf6340be577e8.jpg","description":"The original castle sim, Stronghold HD allows you to design, build and destroy historical castles. Engage in medieval warfare against the AI in one of two single player campaigns or online with up to 8 players.\nWith 21 missions to test your mettle and four renegade lords to defeat, it is up to you to reunite medieval England and take back your lands from the treacherous Rat, Pig, Snake and Wolf. Missions range from breaking sieges and capturing enemy castles to raising gold and holding off enemy attacks. Also featured is a full economic campaign, tasking players to gather resources and build weapons within the time limit.\nWield greater control over your army than ever before with new high resolution graphics! The new HD battlefield view allows you to zoom out and play in real-time, with the whole map on one screen. Advance on the castle gates while flanking the enemy from behind, feign retreat and lead your foe into a deadly trap or just sit back and watch the destruction unfold.\nDesign and build your very own castle, complete with a working economy and brutal killing zones.\nBattle through 21 story-based missions as you drive back the villainous Wolf and reclaim medieval England.\nBuild your dream castle in the combat-free economic campaign or besiege historical castles in Siege That!.\nView the entire battlefield on a single screen with support for new HD resolutions.\nTake your castle wherever you go with Steam Cloud support for saved games.\nPlay the original game on Windows XP, Vista, 7, 8 and 10 with added compatibility.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":28390,"name":"Marlow Briggs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50c/50c936c3e640dc0265fb69f9909ba592.jpg","description":"A new breed of WARRIOR returns, committed to destroying the enemies of FREEDOM! No-nonsense hero Marlow never shied away from danger or trouble. But now he faces his ULTIMATE challenge. Blasting into Central America, he has an industrial evil to defeat whilst bound to an ancient Mayan Death Mask who’s had no-one to talk to for 2000 years. With cliffhanger over the top action and cinematic gameplay, Marlow Briggs takes inspiration from the best of blockbuster films, comic book heroes, and action games with its focus on relentless high-octane combat, exotic and danger filled environments and epic set pieces.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zootfly","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":23572,"name":"Strikey Sisters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b65/b659845160be178fdab9f95c40663f00.jpg","description":"More Games!http://store.steampowered.com/app/491040/Bot_Vice/\nhttp://store.steampowered.com/app/375120/Super_Star_Path/\nAbout the GameIMPORTANT!\n- You need at least one gamepad in order to play the local 2 player co-op mode!THE GAME\nSay hello to a fantasy themed action arcade brick breaker! Featuring cute characters, silly humor, powerful magic, crazy bosses, and even local 2 player co-op mode!FEATURES\nAction focused brick breaker game!\nLocal 2 player co-op mode (one gamepad needed).\nThree difficulty modes.\nTravel the world map in the order you want.\nUseful player and ball power-ups... Oh, and several magic attacks!\nHighly replayable! Uncover all the map, collect gems, unlock secret stages and complete the bestiary!\nPolished and colorful pixel art visuals.\nCatchy 90's synth-fantasy soundtrack.CREDITS\nA game by DYA Games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"DYA Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20625,"name":"SquareCells","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/469/4692c14b6d02a1a544a3293b28b8f275.jpg","description":"SquareCells is an ambient logic puzzle game.\nReveal the pattern in the grid using the surrounding clues.\nIncludes 36 brain teasing puzzles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Matthew Brown","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17553,"name":"Void Invaders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69a/69a02a720f8138ed00ccb1356b656c4b.jpg","description":"Jump back to the good old days of arcade machines with Void Invaders: a colourful, chaotic and explosive arcade shoot-em-up game inspired by classics such as Galaga and Space Invaders! Blast your way through more than 40 levels filled with dozens of enemies, intense boss fights and destructive powerups! Explosive visuals and a frantic light show included.FeaturesColourful and explosive retro graphics!\nOver 40 levels to beat!\nMore than 70 different enemies!\nInsane boss battles!\nMultiple challenging game modes!\nFull controller support!\nAchievements!\nOnline leaderboards!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"VoidDev","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17484,"name":"Daily Chthonicle: Editor's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/465/4652ec2350e05beefcd57053c71f12c1.jpg","description":"This game lets you try on the role of a Supernatural Newspaper Agency boss and editor. The world it takes place in is a dark and haunted one, with ghosts, zombies, monsters and even shapeshifting murderers, pretending to be human after they have stolen their victims' bodies or infiltrated the humanity. It was inspired heavily by the works of H.P.Lovecraft and it builds on the atmosphere of uncertainty and noir of the 1940s.\nSend your sextet of weathered journalists, detectives and occult specialists to investigate murder, affair, and horror in the Town.\nEach time, the story will be different. Sometimes, a werewolf is shredding innocent (and less innocent) victims to pieces and it is your task to unmask the creature. Other times, it will be a body stealing alien from outer space, a mummy that some misfortunate archeologist has excavated and is now haunting them. Perhaps it will be Jack the Ripper, still mysteriously alive and lurking in the streets at night.\nOr maybe there is a really bad big tentacled monster hidden in the cellar of the University?\nIt is for you to find out and entertain your readers while bravely standing up against ancient evil.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sinister Systems","platforms":[{"id":0,"name":"PC"}]},{"id":15810,"name":"Take Thy Throne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b2/2b22041592c5f097d3dfbf19d3a6ba9a.jpg","description":"Take Thy Throne is an online sidescrolling tower defense game.\nCurrently we allow up to 6 players per match to enter a variety of gamemodes, with more gamemodes coming after release as free DLC.\nThe main gamemode consists of taking down towers and barricades to make your way towards the enemy team's King which lies in the Throne room of the enemy's castle. You can pick up to 4 classes currently to play with, with more being added after the game's release.\nYou can use a variety of strategies to make your way towards the enemy Castle such as taking different routes, collecting gold and buying different items suitable for your class, or crafting buildables to help maintain your strongholds and barricades to ensure the enemy stays out of your Castle. The game is over once someone's King has been slain, and thus the Throne has been taken.\nThe game currently includes 3 gamemodes: Take Thy Throne, Capture The Flag, and Dragon Slayer, the latter being a single player/co-op mode. We're adding more gamemodes such as Deathmatch and a Village mode which consists of riding a Dragon and scorching down a Village, and more.\nWe currently support the Steam network, allowing you to easily host matches without port forwarding and to also join matches through both an in-game browser and through your Steam friends list. Right now the game is fully compatible with Windows Operating Systems, but we're working to put it on Linux as well, and quite possibly Mac in the future. We also would like to release another version of the game to support mobile devices at some point in the future.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Charyb Games","platforms":[{"id":0,"name":"PC"}]},{"id":15265,"name":"Gone In November","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd2/dd2aebf3840992f381a2f6f97807c76d.jpg","description":"Gone In November is a video game which deals with the theme of depression.\nGo through the mind and thoughts of a patient who was diagnosed with a deadly disease during his last days of living. A short experience where your choices and your actions don't matter. Texting messages to a social network account that has been inactive for 121 days, have the habit of watering the cacti without any clear reason, fencing your apartment to isolate yourself from the outside world - what else someone can possibly do when they are at their bottom?\n\"Aren't we all puppets and the modern world is what pulling the strings?\nIt is tearing us apart.\nThe closer we are to each other, the more lonely we feel.\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Florastamine","platforms":[{"id":0,"name":"PC"}]},{"id":14474,"name":"One Tower","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/abf/abfda69e084764fff3390d9980ed9ab9.jpg","description":"One Tower is a fast-paced head-to-head MOBA. Players will unleash customized minion waves, command powerful Heroes, and cast potent spells to defend their stronghold against enemy marauders or invade new lands to take down their opponent's tower.\nSummon your minions, pick your Hero, and enter the arena in One Tower – the first micro MOBA that’s quick to play, easy to learn and insanely fun to play against one another.\nOne Tower combines popular design elements from the RTS and RPG genres in this all-new, free-to-play micro MOBA set in the fantastical world of Eternal Flame.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SkyReacher Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":10305,"name":"The Sandbox Evolution - Craft a 2D Pixel Universe!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3fa/3fa5de72b96350c7b3599082a143963d.jpg","description":"Buzz\nAbout the Game\nUse your godly powers to craft amazing pixel worlds or destroy the universe! Welcome to The Sandbox Evolution, the #1 pixel art world creation game.\nPlay with physics, over 200 elements and controllable heroes. Make your own games or levels, and then share your creations online. There are no limits to your creativity and imagination!\n- Click to drop elements, use your keyboard and mouse to zoom and scroll, control heroes with your gaming controller or keyboard.\n- Create or destroy with your mouse!\n- Amazing HD pixel art graphics featuring multiple visual effects, parallax scrolling and more\n- Build worlds up to 10x bigger than in the previous Sandbox game\n- Draw original art or fanboy tributes to your favorite retro characters with over 100 colors\n- Create your own levels using Blocks and other Platforming elements\n- Compose chiptune melodies and become a retro maestro\n- Share your creations in the Online Gallery\n- Save and Sync your progress online with Steam or Email\n- Follow your favorite Players and Top Creators via the Social Menu\n- Full support for the Steam Controller to create worlds and control the heroes characters inside levels made by others playersCREATE YOUR WORLD PIXEL AFTER PIXEL!- Build a 2D pixel world by mixing and matching over 200 elements to discover their interactions\n- Use predefined templates or start from scratch: Music, Pixel Art, Sandbox, Caveman or Avatar\n- Manipulate Natural elements: Mud, Water, Sand, Fire, Metal, Electricity, Acid, Lava and more\n- Many Heroes with different skillsets: Shoot with Arnold, fly with Fujin or play with Hamster, the cutest of allOR UNLEASH THE WRATH OF GOD WITH THESE ELEMENTS- NUKE: Arguably mankind's worst invention, this mega-bomb has devastating effects.\n- TORNADO: A super whirlwind makes everything fly away as you guide it through your worlds!\n- EARTHQUAKE: Drop an epicenter generator over your worlds to unleash chaos throughout the landscape.\n- LIGHTNING: Godlike power at your fingertips! Spawn lightning bolts by tapping anywhere.A MAJOR EVOLUTION OVER ITS PREDECESSOR: THE SANDBOX!- even more freedom and creativity, through improved physics and side-scrolling worlds 10x bigger than its predecessor.\n- much-improved beautiful pixel art graphics featuring multiple visual effects, parallax scrolling and more\n- 5 dedicated Creators modes to embrace every maker player: Create Sandbox, Make Game, Make Laser, Make Chiptunes, Draw Pixel Art\n- 9 exclusive campaigns levels themed around several aspects of the gameplay: Genesis, Disasters, Machines, Lasers, Pixel Art as well as the story of some of the new heroes controllable characters: Ninja or Caveman\n- easy-to-use game maker that enables players to create a retro-style platformer level in just a matter of seconds!!\n- over 200 elements (many of them are new and not present in its predecessor) for players to choose from when designing their worlds, to pick between various entities, game-making blocks, platforms, enemies, portals and characters, pixel art drawing colors, and more.\n- innovative “Daily Quests” mode to play some of the most challenging levels made by other players\n- full support for the Steam Controller for players to create worlds and control the heroes characters inside levels made by others players.\n- new Friends social menu where players can follow their favorite Players and Top Creators\nTHE GAME MAKER YOU WANTED- Begin with ready-to-use 4x4 pixel blocks, then add platforms, traps and enemies to spice things up\n- Create your own levels using Game Design elements: Controllable Heroes, Platforms, Portals, various Blocks or Spikes\n- Place a controllable hero character in your level to instantly add intuitive, direct control\n- Congratulations! You just made your very own 8bit pixel platformer level in less than a minute :)ADD LIFE & BUILD YOUR WORLD- Bring Life to your worlds with Dogs, Wolves, Bears, Cows, Deer or Sabertooth Tigers\n- Spread foliage and numerous tree varieties to bring beauty to your new world\n- Decorate with Houses, Castles and Igloos, and create life on your world with AI HumansINTRODUCE TECHNOLOGY... OR DESTROY IT ALL- Utilize tech like Batteries, Crosswires, Resistance, Bulbs, Heaters, Coolers, LEDs and multiple Sensors\n- Play with Lasers: click to rotate the angle of the light beam and start creating exciting new pixel universes and puzzles!\n- Destroy everything you can with C4, Meteorites, Nitro, TNT or even a NukeCAMPAIGNS & DAILY QUESTS- Experience the creation of the universe through a full campaign of 15 levels\n- Explore a prehistoric world with the Caveman, and fight Bears and Wolves to recover his child in the Caveman Campaign\n- Learn how to draw pixel art like a real artist in the zen drawing Pixel Art Campaign\n- Help Fujin, the Ninja of the Wind, collect the Jade Jars and keep them away from evil beings\n- New Daily Quests, pulled from the best player creations. Challenge the best in the world, or build your levels for a chance to be featured\nBROWSE THE GALLERY AND SHARE ONLINE- Share your worlds with other players\n- Search worlds by keyword or by tags (pixel art, music, arcade, technology or landscape)\n- Filter worlds based on the Newest or Hottest creations\n- Play the most inspiring worlds and interact with them in various ways\n- Rate the creations on 5 stars\nJOIN OUR COMMUNITY OF 745,000 FANS!\nEach new Update of The Sandbox Evolution will bring even more elements, heroes and campaigns!\nYou’ll see… no one could ever dream a better world than yours!\nDownload The Sandbox Evolution and build your world today!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pixowl","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":2340,"name":"Anima: Gate of memories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7c/f7cc1efebf6d093c555164111a02f284.jpeg","description":"Anima Gate of Memories is a third person action RPG. The game is mostly focused on combat and exploration, but it will also have a huge roleplaying elements. While it is story driven, it doesnt force you to ride along rails to complete it. The game gives players freedom to explore a rich world and tackle only the obstacles that they want. This way, each player can visit many diverse places and reach very different endings depending on their choices.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":323093,"name":"Automobilista 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ff/3ff24cc8b9c8baca3b61f82d171362b6.jpg","description":"Automobilista 2 is the culmination of a project developed over the course of nearly a decade. At its core, it is a comprehensive simulation of the brazilian motorsports scene, featuring all major brazilian racing series, race tracks and manufacturers.\nAutomobilista 2 will also celebrate Brazilian motorsports heritage by featuring some of the country´s most iconic heroes and achievements through its rich history in the sport.\nPacking an even larger roster of diverse cars and tracks than its predecessor, Automobilista 2 will venture further into the best of international motorsports, including prestigious brands such as Mclaren and BMW along with iconic venues such as Brands Hatch and Imola, at the same time continuing to explore the more exotic and exciting forms of motorsports from around the world.\nBoosted by a new technical partnership with the developers of the award-winning Project CARS series, Automobilista 2 is built on the MADNESS engine, providing incredible graphical quality, the most advanced dynamic weather and track condition systems in a racing simulator and superior VR support, to deliver a substantial realism upgrade and a fully immersive visual experience.\nWith Automobilista 2 we aim to combine the strengths that made its predecessor unique with major evolutions in all areas. The sim will offer some exclusive features for both single player and multiplayer, which we look forward to sharing over the remaining months of development!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Reiza Studios","platforms":[{"id":0,"name":"PC"}]},{"id":295014,"name":"Darkest Dungeon 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aea/aeaab29c551ea9919e571c44e75a5106.jpg","description":"The eagerly awaited follow-up to Red Hook's smash hit gothic horror RPG! DDII will test your mettle and drive you to the brink of madness. Armor yourself with purpose and provision your party for the journey ahead. It will be arduous.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Red Hook Studios","platforms":[{"id":0,"name":"PC"}]},{"id":59923,"name":"Achievements printer part 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/33f/33f142d5502c72a6e82dd605e604c6f2.jpg","description":"Achievement printer is simple basketball game. You need swipe the ball towards the hoop to score\nHere some game features\n- 2999 Achievements\n- Nice sound and graphics\n- Simple gameplay\n- 3 kind of modes ( endless, time challenge and sliding)\n- 11 Types of balls\n- Custom achievements\nHOW TO PLAY\nSwipe the ball towards the hoop to score.\nCollect stars to unlock new balls. Improve your skills and become the master of the hoop.\nVery Fun! Game for everybody!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Easy game","platforms":[{"id":0,"name":"PC"}]},{"id":52142,"name":"The Persistence","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d7/5d7caf092879132f2a366e477b35afc7.jpg","description":"The Persistence challenges you, a clone of security officer Zimri Elder, to survive aboard a doomed deep space colony starship, overrun with horrific and murderous aberrations. You are the last survivor.  Your mission? Restore functionality to the ship and somehow make your way back to Earth.\nDeath is just the beginning\nThe only thing that stands in the way of saving the starship is an array of clone printed monstrosities, constantly replenished by the ship’s malfunctioning clone printer. If any encounter with these foes proves fatal, Zimri’s consciousness is uploaded into a new host body, ready for the next attempt.\nAn ever-changing labyrinth\nThe colony starship has a self-configuring macrostructure which can alter its internal architecture – and due to the catastrophic malfunction, that’s exactly what will happen. Upon awakening in a new cloned body or on teleporting between decks, the layout of the starship will change each time. Each and every expedition into The Persistence will be unique, with different items and gear to collect & upgrade.\nEnhance, upgrade and augment\nThe technology of the 26th century allows for genetic augmentation and manipulation of dark matter technology. Resequence Zimri’s DNA to improve health, toughness and defensive abilities or even harvest crew DNA to create cloned bodies of crewmembers to inhabit, each with their own unique abilities.\nExplore, evade, fight and gather resources\nThe mutated horde won’t think twice about tearing Zimri limb from limb. Use the environment to scope out, stalk and gain the tactical advantage in either evading or attempting to take them down.  Explore the decks of the ship and gather resources, weapons and suit customizations to aid survival in the journey deeper into the dark and terrifying depths.\nAsymmetric Multiplayer\nConnect a phone or tablet running IOS or Android to the game for up to 2 players to take control of ‘Solex’ – the ship’s engineering system. Once connected, they will be able to take control of the ship’s systems in realtime, including abilities to lure creatures, open doors and disable any of the ship’s internal security defenses.\nIOS or Android compatible device and \"The Persistence\"  application required for Asymmetric Multiplayer to work. Data charges may apply.\nVR Headset support\nCompatible with Oculus Rift, HTC Vive and WMR headsets. Features tailored control settings and comfort options for VR and non-VR play. (Motion controls are not supported).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Firesprite","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":52048,"name":"PixARK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61f/61fc1a77f243d5cb4b20e6a7d6697ca3.jpg","description":"Welcome to PixARK, a vast, wild world filled with vicious dinosaurs, magical creatures and endless adventure! To survive in this mysterious land, you must tame creatures both ferocious and cuddly, craft high tech and magical tools, and build your own base out of cubes.\nWith a robust character creator, an infinite number of voxel based maps and procedurally generated quests, your PixARK adventure will be completely unique. Team up with friends to form a tribe, or play on your own. Spend your time building a towering fortress or go on a quest in a sprawling cavern. Fly on the back of a dragon and smite your enemies with a magic wand, or ride a mighty T-Rex and blast your foes with a rocket launcher. In the world of PixARK, how you play is up to you – as long as you survive!\nFEATURESOver 100 creatures to tame, train and ride\nVoxel block building system\nProcedurally generated maps\nProcedurally generated quests\nCreative Mode, where you can build anything you can imagine\nExtensive character creation tools, and character progression systems with skill trees and customizable stats","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Snail Games USA","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":46533,"name":"Feudal Alloy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/853/8539b5e4e27d767a4838a55a88621255.jpg","description":"Feudal Alloy is a metroidvania-style action RPG with fishbowl-powered medieval robots!\nExplore a huge medieval world, improve your combat techniques and skills by smashing many kinds of mechanic creatures and talk to other robots using unique animated branching dialogues.\nAttu is an ordinary farmer robot who lives in a small cottage in sunflower fields. He had been living a simple but pleasant life until a bunch of outlaws attacked the village, stole their oil supplies and burnt his house.\nFortunately he managed to grab his old sword and fled into the woods.\nGet lost and discover a huge interconnected world, filled with wide range of enemies, bosses, skills, equipments and side quests. Choose which paths you take and which enemies you face. Try to defeat the evil and find your way back home.\nfeatures\nfishbowl-powered Medieval Robots!\nDynamic action-combat system with swords, grenades, dodges and other special attack moves\nA lot of different equipment that change both player appearance and attributes\nA unique dialogue system - branching animated bubbles\nA huge, interconnected world to explore, filled with wide range of enemies, bosses and side quests\nVaried hand-drawn environments\nLoot, a lot of loot!\nHidden collectibles\nSecret areas\nAchievements\nTrading Cards","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Lukas Navratil","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":40984,"name":"Ace of Spades","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ead/eadc282eeae7570e09a716f5ca4cd84b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Jagex Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":30142,"name":"Heroes of Might and Magic 3: Armageddon's Blade","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/134/13454d1947031ffd05eb30736568d91d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":21511,"name":"Stranded In Time","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9f/e9fa6b4f5231aa0f53395c35325853d8.jpg","description":"Stranded In Time takes you on a fun and exciting adventure to explore a mystery out of this world!\nWhat seems to be a little weekend adventure with your old eccentric uncle turns into a fantastic journey through space and time.\nPlay as Olivia - a young woman from a big city - who joins her uncle Peter and writer Nick exploring an old abandoned church in the woods that hides a secret beyond any wild dream! And only you can find the key to an enigma that is older than history itself!\nClassic adventure game\nExciting sci-fi story\nFun gameplay for all ages\nTricky puzzles and interactions\nCute graphics\nStranded In Time takes you back to the good old days of graphic point-and-click adventure games, where the game’s story takes the driver’s seat. Delivered in a vibrant atmosphere of a graphic novel, this game offers you a relaxed experience and a fascinating sci-fi story that you can pick through at a pace you personally choose. Solve puzzles, explore locations, hunt for various items and see how Olivia gets to the bottom of an unexpected mystery.  It’s simple, fun and very entertaining!\nSo don’t hesitate and jump on an adventure of a lifetime with Stranded In Time!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DQ Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17542,"name":"Paranormal State: Poison Spring","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb0/bb0de23f74ec85bd16bdd58618e4370d.jpg","description":"The Paranormal Research team from the hit A&E TV show \"Paranormal State\" is called in to investigate a terrifying supernatural event at Poison Spring State Park, historical site to a grisly Civil War battle. Join the team as their newest member, solve this ghostly case, and reunite two wayward spirits in this eerie Adventure game!\nScour over 40 locations and 20+ Hidden Object scenes of hauntingly beautiful Poison Spring State Park!Enjoy detailed, hand-painted artwork, full voice-acting, and a story inspired by true events!Detect spiritual occurrences with special gadgets, such as the EMF Meter, the Thermal Cam, and more!Solve 30 spooky puzzles and save the state park in Paranormal State: Poison Spring!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Teyon","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17225,"name":"Cockroach Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e47/e47fa36379227fbb92e292a9ebfe6798.jpg","description":"This game is about the hard life in the kitchen. In this unusual place many interests intertwine.\nBut the only war between humans and cockroaches is truly epic and destructive.\nYou can choose any of the sides and try your hand.\n- Multiplayer up to 10 players\n- Many different weapons for confrontation against cockroaches","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"HFM Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17046,"name":"Supreme League of Patriots","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02a/02acaeddec6c26f08c8fcc9ebe5cd51c.jpg","description":"Don your cape and mask and join the Supreme League of Patriots in this hilarious and irreverent superhero comedy adventure!\nPoking fun at pop culture, politics, reality TV and more, join Kyle Keever in his politically incorrect quest to win a spot on the newest hit reality TV show, America's Got Superpowers. But when a freak accident turns Kyle's alter-ego, the Purple Patriot, into his main ego and triggers real superpowers at the cost of his sanity (and good taste), Kyle's got a new mission to become the hero New York deserves, and definitely not the one it wants.\nNavigating a twisted world of vigilantes and villains with his cheeky and sarcastic sidekick Mel, Kyle's got a lot to learn about the world of superheroes!\nFeatures:\nClassic point and click gameplay with a hilarious modern sense of humor\nUpgrade and buy the season pass for three episodes of fully-voiced satirical superhero antics--all episodes available at once, and includes the soundtrack!\nTwo playable characters of Kyle Keever aka The Purple Patriot and his sarcastic sidekick Mel\nTiered hint system to make the game as challenging as you want it to be\nDiscover, befriend and declare your enemies from the city’s zany and colorful cast of superheroes and archenemies\nFantastic original soundtrack composed by Jake \"Virt\" Kaufman!\nFight for something resembling justice from the sewers of New York to the theatres of Broadway!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"No Bull Intentions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16631,"name":"Melody's Escape","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14c/14c0128c9febf87c1a867f9eaa119718.jpg","description":"Key FeaturesUse your own music library: The gameplay of Melody's Escape is completely powered by your music of choice (MP3, OGG, WMA, FLAC, iTunes® (AAC) and more!*)\nWorks with all music genres and styles: Whether you're a big fan of EDM, K-Pop, alternative, acoustic sessions or classical music, the game will always adapt to the song's energy and rhythm to provide you with a dynamic experience, and will keep you engaged even when your music is calm.\nWorkshop support: Customize the appearance of the game to your liking with custom skins, dynamic hair-styles and color palettes!\nEach action is synced to your music: Every required input is synchronized to your music, allowing you to completely immerse and focus on the experience!\nVery accurate and fast music analysis: Melody's Escape features extremely accurate beat-matching algorithms and is optimized to analyse a song in its entirety within a few seconds.\nSlide on vocals and long notes: There is a strong focus on long vocals and held notes in the game, giving you the opportunity to slide alongside them, intensifying the experience of the most powerful parts of your music.\n* iTunes® (AAC) support requires Windows 7 or above (or the manual installation of the \"BASS_AAC\" plugin), WMA is only available on Windows.\n* MP3 support on Linux requires the third-party \"libmpg123(i386)\" library.\nAbout the GameRun, jump and slide to the rhythm of your own music library!\nIn Melody's Escape, advanced audio detection algorithms transcribe the energy that you feel when listening to music into a synchronized gameplay experience, with a captivating and dynamic obstacle course. The game will adapt in real-time to the intensity of your music and change the movement mode accordingly, from walking during very calm parts up to all-out flying when your music explodes!\nYour goal is the help Melody avoid obstacles and collect floating light orbs, all of which are synced to the beats of your music of choice thanks to very accurate beat detection. With the 4 available difficulty modes, you can choose whether to have a relaxing experience or a very intense one.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Icetesy SPRL","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16570,"name":"BitMaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc2/bc21fa8f07e3619dd07af423d28380ea.jpg","description":"The Challenge - one more game powered by UE4http://store.steampowered.com/app/496440/\nAbout the Game\nBitMaster is a dynamic and colorful twin-stick shooter which design was inspired by such games as Geometry Wars, Crimson Land and Satellite Reign. Game powered by Unreal Engine 4!\nYou need to destroy the enemies and collect power-ups to improve weapons. Game balance changes periodically, which makes the game unpredictable and difficult to get a high score.\nBitMaster is suitable for all ages. Average game session is half an hour long.Features:100 waves of enemies\n8 guns\n13 perks\n5 heroes to unlock\n20 types of enemies\n5 wicked bosses\nOnly 1 way to escape\nLot of factors that may cause troubles... or make the game easier!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vladimir Shlapak","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]}]