[{"id":60837,"name":"Fear The Wolves","genre":"Action","price":0.0,"description":"Early Access current content\nThe game: A 100 player battle royale experience that supports solo and squad modes.\nThe basics: 20+ guns, 25+ attachments, 15+ armours, air drops, consumables, and much more\nPvE: Wolf packs stalk players and are a deadly threat, while anomalies from the disaster must also be avoided to survive.\nOne Map: 25km2 map in the ruins surrounding Chernobyl, with rivers, forests, destroyed towns, hidden army camps, and much more.\nDynamic, vote-based weather system: The weather of Chernobyl is constantly changing – you’ll face clear days, harsh winds, thunderous storms, and more, all voted for by the players spectating a match.\nTime passes: As a match continues, morning will turn to noon and finally dusk as you make your extraction.\nVehicles: Dilapidated but functional jeeps dot the landscape of Fear the Wolves, a loud and obvious but speedy way to escape dangerous areas.\nRadiation: Radiation infects the battlefield at random, spreading unevenly, and offering different threats depending on intensity.\nThe Extraction: Escape each map in a dramatic finale as you fight the other last players standing to extract via helicopter\nSpectator mode: Dead players can continue to spectate a match, and vote for weather.\nComing Next\nRIGHT AFTER RELEASE\nWe plan to add localization for more languages as we head towards release. This is currently aimed at 16 languages, including French, German, Russian and Chinese.\nCOMING IN PATCH #1\nNew locations: providing new landmark buildings, oddities and curious elements to the map.\nA new two-person vehicle for travelling Chernobyl\nWeapon Customization:  a brand new customization system so you may make your armoury your own\nThe ability to automatically matchmake into a new match immediately after death\nNvidia Highlights: Record and replay your best extractions, kills, as well as learn from any unfortunate mistakes you make that leads to your death.\nCOMING IN PATCH #2\nA new, throwable, melee weapon - a military shovel.\nContextual backstabbing using a new melee weapon, the machete.\nVaulting: Climb and vault over obstacles to quickly navigate the dangerous world of Chernobyl\nSecret Caches: Discovered throughout The Zone, players can now use their axes to uncover vaults of precious loot.\nAn in-game event system\nSpectator Mode UI Update\nCustomization: additional customization sets\nFuture updates\nAnomalous Storm: A new weather type that unleashes hell across the battlefield.\nDedicated wounded player animations.\nMore customization items: Cosmetics will continue to be added, letting you create your perfect character, including a progression system with unlockable items.\nNight gameplay: Currently in a prototype stage, we intend to bring the terrors of the pitch black to Fear The Wolves. Don’t forget, wolves are nocturnal hunters.\nAdditional mutants: Wolves aren’t the only creatures to be affected by the radiation still present in The Zone.\nAdditional mutant mechanics. The Zone is ever evolving, and with it, the creatures within.\nAdditional anomaly mechanics. Anomalies are dangerous, but brave them, and you may uncover something worth the risk.\nLivestream integration: The spectator weather-voting system will be available to Twitch and Mixer viewers.\nA better Chernobyl: The map will be polished to add additional biomes and village diversity.\nMore weapons and items: New guns, melee weapons, attachments.\nAbout the Game\nFear the Wolves is a competitive Battle Royale FPS by Vostok Games, bringing a nuclear aftermath to the brutal 100-player arena. The game drops players, in squads or as lone wolves, into the oppressive environments of a radiation-ravaged Chernobyl spread across a 25km2 map. The classic Battle Royale mode forces them to fight to be the last man standing out of 100 fighters. while another, to-be-unveiled mode brings an exciting twist to the genre.\nTo secure the top spot, players will need to worry about more than just other survivors. Across the hostile wastes, everyone is threatened by deadly anomalies and the dynamically-changing weather – voted for by players and spectators, both in-game and on streaming platforms. As time wares on and day turns to dusk, survivors must stay on their toes and constantly adapting to new situations.\nProtective gear allows players to explore dangerous off-limit radioactive zones inaccessible to less-equipped opponents - but filled with powerful loot. All the while, the howls of mutated creatures echo through the wasteland. Wolves and much worse lay in wait for foolish players who don’t keep their wits about them.\nFurther breaking the mold of the genre, every game is made truly unique by the irregular and unpredictable spread of deadly radiation, which organically closes in on players with different stages of toxicity, all of which can be battled and avoided in different ways. Safety is rarely certain, and adept players will need to read the environment to determine when it is no longer wise to remain in an area.\nFinally, every match ends with a dramatic race to the extraction helicopter, with only one of the handful of survivors able to make it. Will you pick off stragglers from a rooftop until you are the only one alive? Or would you rather make a mad dash for freedom, leaving your pursuers behind and escaping under the cover of night? Each extraction is unique, with the final area layout and your skills deciding the winner. Cosmetic customization options and a deep progression system reward you for your victories and close-calls.\nAll this, rival players, tight shooting mechanics, and an arsenal of guns, attachments, armour, and melee weapons mean no two matches are the same.\nBrutal FPS battle royale in the irradiated remains of Chernobyl\n20+ weapons with dozens of attachments, across a wide variety of effective ranges and situations, including melee\nRadiation spreads dynamically from area to area, and can be survived with the right gear\nPvE elements keep each match different, with wolves, mutants, and other hazards a constant danger\nFinish matches in style with the final battle around the extraction helicopter\nMore maps and modes to be revealed.","imageUrl":"https://media.rawg.io/media/games/df0/df0155599a22f8731bf5490570bc22dc.jpg","releaseYear":2018,"developer":"Vostok Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53467,"name":"Paperboy","genre":"Action","price":0.0,"description":"Paperboy is a 1985 arcade game developed and published by Atari Games. The player takes the role of a paperboy who delivers a fictional newspaper called \"The Daily Sun\" along a suburban street on his bicycle. The game was ported to a wide range of video game consoles and personal computers. The Nintendo Entertainment System version is the first NES game developed in the United States, and the Sega Master System version represented the first SMS game developed in the United Kingdom. Paperboy is notable for its unusual theme, which extends to using bike handlebars as the controller.\nA sequel for home computers and consoles, Paperboy 2, was released in 1991.","imageUrl":"https://media.rawg.io/media/screenshots/3d2/3d2bb57b39e2efa39d1c385585b2ea8b.jpg","releaseYear":1985,"developer":"Atari Games","libraryGames":null,"platforms":[{"id":0,"name":"Atari ST"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Apple II"},{"id":0,"name":"Genesis"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Atari Lynx"},{"id":0,"name":"NES"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Commodore / Amiga"}]},{"id":51492,"name":"Tiger Knight","genre":"Action","price":0.0,"description":"Tiger Knight is an epic Action Strategy PVP game that brings vivid, historically accurate detail to large-scale warfare set circa 200 BC. Featuring meticulously researched battle equipment and weaponry, music from renowned Final Fantasy Composer Hitoshi Sakimoto, and delivering high-octane strategic combat - Tiger Knight: Empire War delivers a thrilling gameplay experience that will keep you coming back for more!\nIn the Early Access phase of the game, players can take control of three of the most powerful armies in Chinese history - the Three Kingdoms. Each army boasts its own strengths and weaknesses, allowing players to choose the forces that best represent their battle strategies. Tiger Knight brings the archers, infantry, cavalry and generals of the Wei, Shu and Wu armies to life using an optimized Unreal3 engine, as well as the PhysX physical engine, Hair Works and advanced action motion capturing. The developers at NetDragon have spared nothing in their attention to historical accuracy, researching existing ancient artifacts to design each weapon and piece of armor available in the game, while using real-life battle equipment to record in-game sound effects.\nThe game features three distinct modes of play, and will soon expand the selection of armies to include the Romans, as well as many of histories other greatest forces! Join the battlefield today to see why so many players have already fallen in love with Tiger Knight: Empire War!Game ModesCommand Mode: PVP Mode (with soldiers)\n10-14 players from all camps can respectively command 1 adjutant and up to 40 soldiers. Command Mode consists of battles comprising hundreds of units and includes two sub-modes: Conquest and Siege.\nDuel Mode: PK between generals (without soldiers)\nThis mode features battle without soldiers. It supports a 16V16 battle and contains six sub-modes. Players can fight individually or in teams. Each bout lasts for about 15 minutes.\nEpic War: Cooperation between teams (PVE Mode)\nPlayers must cooperate as a team to fight with the AI in realistic simulations of famous battles from the Three Kingdoms period. This mode features three difficulty levels: easy, normal and hard.Game FeaturesControls\nUtilizing a classic keyboard & mouse control scheme by default, players attack/parry with their mouse and move/issue orders with the keyboard. Players have access to a vast amount of combo attacks, charge attacks, and charge and penetration techniques to defeat opposing forces in battle.\nRestraint on Weapons and Armors\nTiger Knight employs a unique method for calculating damage and defense. Damage is classified into several types according to weapons and attack methods (chop, crush and pierce). Armors are offered in cloth, leather, iron and composite materials, and weapons will have different effects when paired with distinct armors. Damage will also vary based on the location of each battle.\nReal-Life Battlefields\nTiger Knight features numerous iconic real-life battlefields, each requiring a tailored combat strategy. Players’ success will hinge on how well they adapt their strategy for each location.\nVarious Collection Modes\nTiger Knight features 10 upgrade modes, each containing 5-10 troops. Players unlock and upgrade new modes by obtaining experience, prestige and copper, recruiting adjutants from famous heroes in the Three Kingdom Period and training them in different skills and formations.\nVast Equipment Supply\nTiger Knight offers players more than 1000 historically accurate pieces of armor and weaponry, as well as 50 horses and accompanying gear. Each weapon and piece of armor is useful under certain circumstances, enabling players to outfit their generals to their preferred style of play.\nUnique Adjutant System\nIn addition to unlocking new soldiers, Tiger Knight players can also recruit famous adjutants throughout the game. These adjutants each have unique capabilities and skills, special formations, and different levels of loyalty.","imageUrl":"https://media.rawg.io/media/screenshots/837/83796c14fdb6181a579ceb012d731ec1.jpg","releaseYear":2018,"developer":"NetDragon Websoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":49122,"name":"Umineko When They Cry - Answer Arcs","genre":"Adventure","price":0.0,"description":"Umineko When They Cry - Answer Arcs\nThis is the 2nd half of the \"Umineko When They Cry\" sound novel series, featuring episodes five through eight. The answer arcs will teach you many things, but solving the mystery of the epitaph is still up to you.\nWelcome back to the world of \"Umineko When They Cry.\" (When Seagulls Cry)\nWelcome back to the Rokkenjima of October 4, 1986.\nYou have once again been given a chance to catch a glimpse of the family conference held annually by the Ushiromiya family. The remaining life in the old family head who has built up a vast fortune is very slim.\nTo his children, the greatest point of contention at this family conference is the distribution of his inheritance.\nEveryone desires all that money, no one relents, and no one believes.\nWho will gain the old head's vast inheritance? Where is the 10 tons of gold that the old head is said to have hidden? Can the unnerving riddle of the epitaph which is said to point to the location of that gold be solved?\nIn the midst of this, a suspicious letter is sent from one claiming to be a witch. The presence of a 19th person on this island, which should only have 18, begins to hang in the air.\nBrutal murders repeat, and unsolvable riddles are left at the scene. How many will die? How many will live? Or will everyone die?\nIs the culprit one of the 18, or not?\nIs the culprit a \"human\", or a \"witch\"?\nPlease, enjoy this isolated island, western mansion, mystery-suspense gadget of the good old days to the fullest.","imageUrl":"https://media.rawg.io/media/screenshots/3cd/3cd549abb6508528b1c8e34d4dbd0bb8.jpg","releaseYear":2017,"developer":"07th Expansion","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42151,"name":"Sniper: Ghost Warrior 3","genre":"Action","price":0.0,"description":"Update Notes\nSniper Ghost Warrior 3 multiplayer is now available. Thank you for your continued support and patience!\nThe complete list of patch notes can be found on our Community Hub.\nSteam Exclusive OfferHello Snipers!\nWe have heard many compliments about the in-game music we created. For this reason we decided to give you the possibility to get the soundtracks on your own devices and listen to them more often than while sniping in Georgia.\nListen to the short previews of some of the songs and get the whole playlists:\n\nComposed and produced by Mikolai Stroinski (The Witcher 3: Wild Hunt – Blood and Wine, The Vanishing of Ethan Carter, Detached, Kursk), mixed by Steve Kempster and recorded by Tony Phillips at Beautiful Noise Studios in Los Angeles, each artist was invited to the studio to provide his or her own element to the overall score. Some instruments used that may be familiar to a Western audience include drum, bass, synthesizer, guitar and vocals; but, there’s also the use of mandolin, balalaika and bandura.\nArtists involved include:\n●\tVocals - Aurelia Shrenker\n●\tGuitars, Balalaika, Bandura, Mandolin - George Bernhardt\n●\tSynthesizers - Mikolai Stroinski\n●\tBass - Paul Bushnell\n●\tDrum Set - Joel Taylor\nSome songs on the soundtrack have a noticeable Georgian touch to them, and a fair amount of Sniper Ghost Warrior 3’s score is inspired by various folk and pop music researched prior to the pre-production of the game score. The goal in mind for the Georgian-influenced songs are to enhance the player’s emotions and to emphasize the location in Georgia while also leaving the location to be painted by other elements in the game such as the graphics and dialogue.\nAbout the GameSniper Ghost Warrior 3 tells the story of brotherhood, faith and betrayal in the most complete sniper experience ever. Take the role of an American sniper named Jonathan North, who is dropped into enemy territory in northern Georgia, nearby Russian borders. Explore large open-world maps with dynamic weather and a day and night cycle that actually impacts play and decisions. Customize weapon equipment, accessories, vehicles and a drone, and utilize the three pillars of gameplay to your liking: Sniper, Ghost and Warrior.\nGo behind enemy lines with the ultimate modern military shooter. Play as an American sniper dropped in Georgia, near Russian border. Choose your own path to accomplish your missions across an unforgiving open world.\nBe a Sniper: Engage your targets from the long range. Factor in scope elevation, wind speed and direction, breath control and stance along with weapon and bullet choice.\nBe a Ghost: Stalk your enemies and eliminate them silently with a broad variety of takedowns. The advanced stealth gameplay includes drone recon and vertical navigation.\nBe a Warrior: Wield a wide variety of advanced weapons and modify them to suit the needs of your mission and your own personal style. Choose from assault rifles, shotguns, machine guns and even explosives.\nBe All Three: You are an American sniper dropped behind enemy lines in Georgia, near the Russian border. Ruthless warlords have taken over part of the area and it falls on you to prevent the entire country from collapsing into chaos.","imageUrl":"https://media.rawg.io/media/screenshots/aaf/aaf1f1968d7197819d4199bcbc8747ba.jpg","releaseYear":2017,"developer":"CI Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":35137,"name":"Battlefield Vietnam","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/39c/39c23a4b8b0308966987b4802667e878.jpg","releaseYear":2004,"developer":"Digital Illusions Canada","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":29063,"name":"NHL 13","genre":"Sports","price":0.0,"description":"The Games on Demand version supports English, French, German, Czech, Finnish, Russian, Swedish.  Featuring the biggest innovation for the franchise in six years, NHL® 13 will deliver a revamped gameplay experience that accurately captures the speed, creativity and strategy of today’s NHL headlined by all-new True Performance Skating, and supported by EA SPORTS™ Hockey I.Q. NHL 13 will also deliver new experiences that connect hockey fans to their friends and the real world of hockey with the all-new GM Connected and NHL Moments Live game modes. With core gameplay innovation, connected experiences, and the deepest feature set ever in an EA SPORTS NHL title, NHL 13 is truly the definitive hockey experience.","imageUrl":"https://media.rawg.io/media/games/5c0/5c01f94a799956e5263f502b18ff4f22.jpg","releaseYear":2012,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":28215,"name":"Puzzle Fighter HD","genre":"Puzzle","price":0.0,"description":"Single Player, Live Multiplayer 1-4, Local Multiplayer 1-2, HD (High Definition). One of the most popular puzzle games of all time is back with HD graphics, dazzling elemental effects and a new re-balanced X' mode! Super Puzzle Fighter II Turbo HD Remix brings together the worlds of Street Fighter, Darkstalkers and other Capcom characters to provide extremely addictive puzzle mayhem. Enjoy single player, local & online versus modes or just watch other players duke it out. Upgrade to the full game! Unlock your ability to earn achievements and track your high scores on the Xbox LIVE Leaderboards. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/8ab/8ab6b9619986ad9fede97317d4f73b4d.jpg","releaseYear":2009,"developer":"Backbone Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":27150,"name":"Wario Land: Super Mario Land 3","genre":"Desconocido","price":0.0,"description":"The “8-bit Summer” series continues with this video game classic. Things\nare really cookin’ on Kitchen Island. Wario™ has heard that the pirates\nhave a giant golden statue of Princess Toadstool. After being kicked out\nof the last castle by his rival, Mario™, he’s scheming to steal the\nstatue. Help Wario collect treasure by smashing into objects and foes.\nPower-ups like the Bull Hat, Jet Hat and Dragon Hat will grant Wario new\npowers that he can use to his advantage. Find special keys to unlock\ntreasure chests that are hidden in various levels. The more treasure you\ncollect, the bigger the castle at the end of the game will be.\n\nWario’s greed knows no bounds. Help him reach the ultimate prize.\nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","imageUrl":"https://media.rawg.io/media/screenshots/497/497c61d332ad52995c00d027bc9bea72.jpg","releaseYear":1994,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"Nintendo 3DS"}]},{"id":19593,"name":"Xpand Rally","genre":"Racing","price":0.0,"description":"Xpand Rally is a breathtaking game that gives you the true to life experience of driving powerful rally cars amidst photorealistic sceneries. Realistic weather effects, rolling hills, and animated scenery all add to game's visual perfection. Xpand Rally also features highly detailed models of modern rally cars and handling physics developed with the help of rally sport professionals which further enhance the realism of driving experience.\nXpand Rally combines the best elements of Rally and Rally Cross racing in one unique gaming experience.\nThe game offers a career mode based on time trials during both individual races and World Championship Series which will satisfy traditional Rally fans. The Rally Cross fans won't be disappointed either - they can challenge several opponents in head to head racing during competitions based on real and fictitious race events.\nXpand Rally, as the only title on the market, brings the economy factor into a rally game. The player starts with a junk car and competes in races to earn money and acquire upgrades, repair damage, tweak performance and pay the race entry fees.\nAlong with the tuning-up, the car's condition affects its handling. Due to accurate damage system, it is highly dependent on the player's driving skills. The physical handling model is also influenced by car parts configuration and provides both authentic feel and joy of driving.\nThe interactive race track surroundings with enhanced game physics and the innovative approach to changing daytime and weather conditions, both influencing the car handling, are other hallmarks of Xpand Rally that distinguish it from other racing games.\nFor the first time among rally games Xpand Rally includes a complete set of easy-to-use editing tools enabling to create new tracks, cars or even game mods.","imageUrl":"https://media.rawg.io/media/games/bba/bbab165c1f4a690c0d87cbcd14e09cf5.jpg","releaseYear":2006,"developer":"Techland","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18170,"name":"Space Incident","genre":"Action","price":0.0,"description":"Space Incident is an interactive story about the two astronauts and one unexpected fellow traveler. The game takes place on a spaceship, who’s been lost somewhere between Earth and Mars. Your main task is to help the crew understand what is going on and finish the journey with a favorable outcome. In the game you will need to communicate with team members, maintain their moral status and learn about the key points which will help to bring the spaceship to the Earth safe and without casualties. Good luck, commander!\nFeatures:\nIndirect interaction with the ship's crew. You can influence the mood of the crew members by offering them different ways to solve problems through dialogue.\nSubtle psychological organization! You can not imagine what can do a nervous man in space.\nIt's important to keep track of who and what is doing and you know the whole story of journey!\nTen different endings, which cause your actions.","imageUrl":"https://media.rawg.io/media/screenshots/fb9/fb92e2cb7fb1f9ec244460645efc9ab5.jpg","releaseYear":2016,"developer":"Vogd3","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17646,"name":"Hotel Giant 2","genre":"Simulation","price":0.0,"description":"Following its international success, Hotel Giant is back and bigger than ever.  In Hotel Giant 2 you will create the hotel of your dreams and manage prestigious locations around the world.  Your goal is to attract as many guests as possible and make sure they are satisfied throughout their stay.\nIn order to meet your objective, you must develop a high standard of service, hire an excellent staff, decorate every room to your liking and never forget that the customer is always right. Exceed your guests’ expectations by improving their stay, earning more money and becoming the most successful hotel chain in the world!\nImpressive realism: observe and influence the lives of your guests, meet their needs, face their wrath…\nGreat scope: 26 unique hotels in various locations such as Paris, Rome, Los Angeles, and Munich… and more than 1,400 objects and furniture items to decorate and adorn your hotels\nFull customization: create multiple services (bars, specialty shops, conference rooms…) and amenities such as pool halls, arcades, executive lounges… configure their layout, choose the contents of the menu for your restaurant and even employ live performers to entertain your guest\nHundreds of customers to observe, analyze and understand, each client is different… ascertain their personalities, earn their satisfaction and win their tourist dollars\nIntuitive interface, high performance 3D graphic engine which provides day and night features, self illuminating objects and more realistic animations than ever before for the ultimate life simulation gaming experience","imageUrl":"https://media.rawg.io/media/screenshots/1f4/1f4f153fb24483fcaaaf13274bb4ae95.jpg","releaseYear":2008,"developer":"Enlight Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17311,"name":"Squeezone","genre":"Action","price":0.0,"description":"Squeezone - it's pretty fabulous tower defence with shoot 'em up elements.\nPrepare to protect the main tower: build structures, make sure to take a stand for yourself! In Squeezone you must directly support your protective buildings, conquer enemies as your character with complete freedom of action! Don’t forget to collect coins that falling from the mobs and upgrade defensive structures!\nFeatures:\nA bright graphic design. Pleasant pixel art\nTower defence with shoot 'em up elements\n6 types of weapons\n7 Towers buildings with the ability to upgrade","imageUrl":"https://media.rawg.io/media/screenshots/784/78418b62f4bc4d527c9a14496a3b2637.jpg","releaseYear":2016,"developer":"Versus System","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17113,"name":"Vapour","genre":"Action","price":0.0,"description":"WARNING! This game has an Age Restriction of 18.\nVapour is an experimental horror game, that fuses elements of both old school and modern horror titles with the frantic game play of classic First Person Shooter titles. Blending horror, shooter, action, puzzle and platformer in a dynamic yet cohesive combination.\nIn Vapour you take on the role of a psychotic warlock known only as \"Charles\", who has been held captive and brutally tortured his entire life by a sadistic cult. After being executed for his crimes, Charles used his last ounce of strength to avoid total damnation.\nNow, trapped between the borders of Purgatory and Hell and with his powers diminished, Charles must battle through hordes of demons, face his haunting past and ultimately make it back to earth to exact his revenge on those who have wronged him.\nFEATURES:\n-Spell-based combat\n-Interactive puzzles\n-Non-linear level design\n-Plenty of exploration\n-Tricky platforming\n-Terrifying demons\n-Deadly scares\n-Sneaky secrets\n-One gory and twisted plot","imageUrl":"https://media.rawg.io/media/screenshots/36e/36e33f6e15b27d26dbd510e0bdac2d5b.jpg","releaseYear":2015,"developer":"Skobbejak Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15370,"name":"Echo of the Wilds","genre":"Adventure","price":0.0,"description":"Echo of the Wilds is a puzzly narrativy adventure, featuring randomised wilderness survival.\nFinding yourself in mysterious forests you must unfurl a spiritual tale of solace before the unending winter consumes all. There a spirit guide will help you learn the skills of survival and the secrets of the wilds: why you awakened there, their purpose, and how to finally be free from its clutches and malevolent apparitions.\nThe gameplay focuses on exploration and survival of the randomised wilds. Gathering resources to build gear and sustain yourself, learning new skills and the intertwining interactions between the various areas, seasons, and weather. The game includes 40+ areas to discover and 225+ items, including food, resources, tools, clothes, gear and furniture.","imageUrl":"https://media.rawg.io/media/screenshots/23e/23e5193d53caafa0e80be985eeb9e1f1.jpg","releaseYear":2014,"developer":"Anthony Case","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12753,"name":"The guard of dungeon","genre":"Action","price":0.0,"description":"The Guard of Dungeon\n- This is the mad first-person shooter. The Unknown Alien Force (UAF) wants to enslave Our World. Only the Hero can save the Planet from UAF invaders.\nThe Evil has come! Are you ready?\nMeet old-school hardcore with:\n- lots of traps, which will smash, slash, saw and slice you in many other ways,\n- 3 paths of ability progression,\n- 2 hours of gameplay,\n- intro and outro videos,\n- achievements/cards\n- and of course Hard Rock included!\nAll models/music/code are unique and are made especially for this game!\nShow the Universe who's the boss!","imageUrl":"https://media.rawg.io/media/screenshots/06e/06eaa62f7ed5d6497e9531b67998feb5.jpg","releaseYear":2017,"developer":"HeX","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12377,"name":"Amigdala","genre":"Action","price":0.0,"description":"Gherman Driven, a middle-aged man, fanatical conspiracy theorist, who has abandoned all joy of his life.\nFamily, friends, work. Gherman remained without anything because of his obsession with the \"Philadelphia experiment\", which led him to neglect every other aspect of his life.\n11 years after the events of the alleged experiment, Gherman found a document that marked the coordinates of the military establishment in which all involved in the project were taken.\nAfter spending all the savings of a lifetime for trip to Greenland, certainly he did not expect to find so much...\nA story-driven horror where the goal is to find out what lies behind the experiment.\nAll that you have is a flashlight, a lighter, and your intelligence to solve various environmental puzzles, escape from unpleasant situations and hide from what you find.\nThis game was developed to be played perfectly in virtual reality.\nEach menu, object, or text, will be implemented in the game to allow who will use the Head Mounted Display to have a realistic effect.\nAll you have to do to activate this mode, it's open the game menu and activate \"VRMode\" in the \"Graphic Settings\".\nI'll hope you enjoy it.\nI'm 20 years old, this is my first game and it's a one-man-project.\nI learned to use the engine, techniques and everything related to the development of a video game with this project.\nI hope you like, and leave feedback if you want :)","imageUrl":"https://media.rawg.io/media/screenshots/1a4/1a4463658bef42335da770ffc1e5c088.jpg","releaseYear":2016,"developer":"GuidiGermano","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10944,"name":"Homebrew - Vehicle Sandbox","genre":"Action","price":0.0,"description":"This game has a steep learning curve and will challenge your building and problem solving skills. Please do not purchase is unless you love experimenting, learning new stuff and want to support development of the game.\nHomebrew is a vehicle sandbox where creativity is key.The game is developed with a passion for science, input of the community and a belief that your imagination should be the only limit when it comes to what you can build.\nIf you're looking for a game where you lose track of time perfecting your creations, testing them in a vast world and searching for new approaches/solutions this is the game for you. Now let's look at what you can expect:\nSANDBOX BUILDING\nYou are the creator and you have the power. You can set up controls for all kinds of input devices, there’s no size or part limit and all parts are highly tweakable. In addition the builder includes a plating system and a dynamic vehicle tuner with debugging capabilities.\nMULTIPLAYER + WORKSHOP\nPlay online and battle with your friends in the multiplayer. Search through the workshop and try out one of the many vehicles that other players have created.\nWEAPONS\nA wide range of weapons at your disposal that take real balistics into account.\nWORLD\nExplore the world of Homebrew and test your creations on one of the many islands. The world has a dynamic day and night cycle and is large enough to test any type of vehicle including boats, supersonic planes, cars and more.\nPHYSICS\nIn addition to land vehicle behaviour the game has aerodynamics and water dynamics with waves in place so that you can test your creations to the extreme.\nPARTS\nWhether you’re working on a car, a plane, a boat, a spaceship or anything else, Homebrew has a ton of parts including engines, motors, wheels, lights, wings, pontoons, detachers, transmissions, … More information about the individual parts can be found in our PARTS WIKI .\nLOGIC PARTS\nTake building to the next level and combine usual parts with logic components to build autopilot vehicles, stabilizing systems, transforming vehicles, robotic arms, … Your imagination is the limit. More information on how to use these parts can be found on our PARTS WIKI\nAN AWESOME COMMUNITY\nWhether you’re looking for help, someone to play with or simply want to chat you’re always welcome to join us on Steam or our DISCORD CHANNEL.\nPARTS\nThat’s right, we’ve got a series of new parts planned including water parts, tank tracks, wings, hulls, wheels, more logic components and community suggestions.\nBUILDER\nWe want to continue improving builder and implement things like symmetry, coloring system and tools for user generated content.\nCHALLENGE SYSTEM\nTo add more gameplay and possibilities we will implement the necessary tools to create custom challenges in Homebrew.\nWORLD\nWe want to expand the current world even more and add more variation to the environment.\nOTHER FEATURES\nOur team is always looking out for great community suggestions and based on the feedback that we receive we’ll continue optimization and fixing bugs. In addition we’re also thinking about implementing tools for character customization.","imageUrl":"https://media.rawg.io/media/screenshots/16e/16e9c3882eef0532a8ee8e545dddade8.jpg","releaseYear":2014,"developer":"Copybugpaste","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10939,"name":"Pixel Fodder","genre":"Action","price":0.0,"description":"Pixel Fodder is a old school platformer with a fully destructible world, a large choise of characters, incredible dynamics and gigaliters of  8-bit meat. Use all power of the pixels to defeat the bad guys and restore justice in this world! Fight for infantry, scientists, movie stars, knights, zombies, internet memes!\nCreate your own adventures in the map editor, find out the whole story of Pixel Fodder Heroes campaign mode.","imageUrl":"https://media.rawg.io/media/screenshots/903/903e10ac3dcb2de9eb4d8f4d4dea1b66.jpg","releaseYear":2015,"developer":"Wacha","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10759,"name":"Marmoset Hexels 2","genre":"Desconocido","price":0.0,"description":"Marmoset Hexels™ is a grid-based painting tool that enables you to effortlessly create brilliant works of art. Whether you’re a pint-sized pierogi, a professional cuddler, or my imaginary friend, Hexels’ shape-shifting personality will captivate you. Hexels 2 is ready for its big debut! Check out the video features to get familiar with all of the exciting new features, or grab a copy today and experience for yourself the joy of the grid.Shape it Up!Explore a world of infinite possibilities with our fine selection of polygonal-shaped grids (Classic, Pixel, Trixel + Sub-grids, Voronoi), or impress your dog by creating your very own fully-customized grids.Trick or Trixel?Our most powerful shape mode gives you total control with multifaceted sub-grids. Create utopian isometric worlds, complex geometric patterns, and explore abstract art styles. Subdivide your canvas to add another layer of depth and detail to your painting.Push it, Pull it, Drag it, Drop itBreak down the barrier between idea and execution by rearranging our sharp, customizable user interface to your heart's content.Pile it OnNew in Hexels 2, layers provide the power and flexibility to keep the creative juices flowing. Fearlessly create in a non-destructive manner, make local adjustments at any time, duplicate layers to quickly add variation or test out new ideas.Geometry in MotionBreathing life into your artwork is easier than ever with Hexels' brand new animation system. Create the edgiest GIFs the internet will ever see with our streamlined key-frame editor.Refine Your PaletteSay hello to your new best friend, the palette window. Auto-fill swatches as you paint, drag and drop to organize and create gradient bridges to find the perfect color.New in Hexels 2:Animation Editor!\nLayers!\nLayered PSD export\nAnimated GIF export\nFancy Palette\nImproved Outline Tool\nGradient & Noise Tools\nSuper GridAdditional Support For:Drawing Tablet Input\nExport to .SVG, .XML, .CSV\nWrapped (Tileable) Canvas\nImport Background Images\nConvert Photos to Hexels\nHalftone Mode\nTextures\nGlow Effect\nFeatured artwork by Mira Karouta (http://www.artstation.com/artist/mirasedge), Mark Knight (http://markknight78.tumblr.com/), and Niall Taylor (http://enteagd.tumblr.com/).","imageUrl":"https://media.rawg.io/media/screenshots/1b1/1b14a20f0b7c412eb2dd7da3abea388e.jpg","releaseYear":2016,"developer":"Marmoset","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2079,"name":"RollerCoaster Tycoon Classic","genre":"Strategy","price":0.0,"description":"RollerCoaster Tycoon® Classic™ is a new RCT experience, remastered in 2017 by franchise creator Chris Sawyer to combine the best features from two of the most successful and beloved RCT games in the series’ history – RollerCoaster Tycoon® and RollerCoaster Tycoon® 2. Roller Coaster Tycoon Classic also comes complete with the Toolkit, Wacky Worlds, and Time Twister expansion packs!  Create and run amazing parks filled with the most outrageous rides imaginable.  RCT Classic includes a mixture of authentic playability, depth of gameplay and unique graphical style of Chris Sawyer’s original best-selling RollerCoaster Tycoon® PC Games. Packed with content, players can enjoy designing and building roller coasters and rides, landscaping parks and managing the staff and finances to keep their guests happy and the money flowing in. Can you become the next RollerCoaster Tycoon?\nKey Features:\nThe Original RollerCoaster Sim: Experience all the fun from the original RollerCoaster Tycoon® and RollerCoaster Tycoon® 2 games, with a new sim that combines the best elements of both classic titles.\nCoaster Construction: Create incredible roller coasters – Quickly build a pre-made design or use the intuitive piece-by-piece building tools to design and theme your own unique rides.\nPark Designer: Keep your guests happy by building gentle or wild rides, food and drink stalls, water rides, and even transport rides to take them around the park; Customize your park by building scenery, fine-tuning the landscape, and routing the footpaths.\nPark Management: Run your park’s marketing and finances to make a profit while attracting more guests; Organize your staff to keep the park running well and looking its best.\nExciting Environments: Build the ultimate theme park in a variety of challenging environments, from the tranquility of Forest Frontiers to the bustling commerce of Megaworld Park.\nPark Scenarios: Progress through 95 classic park scenarios from RollerCoaster Tycoon® and RollerCoaster Tycoon® 2.\nAuthentic Gameplay: Classic-style isometric graphics and original amusement park music and sound effects.\nPacked with Content: Includes hundreds of types of roller coasters and rides, and dozens of different shops, stalls, and facilities.\nExpansion Packs:\nWacky Worlds Expansion Pack: Find your passport and pack your bags!  Wacky Worlds takes players on the ultimate trip around the globe in 17 new park scenarios!  Includes exotic rides, profitable concessions and the most famous landmarks known to man including the Eiffel Tower, Big Ben, Statue of Liberty, Great Wall of China and more!  Each location is packed with opportunities for success, fun and unique challenges.\nTime Twister Expansion Pack: Travel through time with 14 new park scenarios based on historical and fantasy time-themes and build a park that is truly a blast from the past (or future if you like).  Play in a Prehistoric amusement park decorated with huge animated T-Rex’s and coasters such as the Raptor Ride, or choose from Mythological times, the Dark Ages, the Rock & Roll crazed ‘50s, the Future or the Roaring Twenties.\nToolkit:\nPark Scenario Editor: Design and build your own amazing parks – Make them as easy or as challenging as you want, using your choice of scenery and rides!  Includes a number of Six Flags parks to get you started.\nRide Designer: Build, test, fine-tune and theme your own awesome roller coaster designs in the Ride Designer before saving them for use while playing!\nImport and Export: Share your saved parks, park scenarios and ride designs with friends, and try out their creations too!  (Includes the ability to import most saved parks and scenarios created with the original RollerCoaster Tycoon 2 PC game).","imageUrl":"https://media.rawg.io/media/screenshots/fdc/fdc474dec73b5413fcf32e077142bd7a.jpeg","releaseYear":2016,"developer":"Atari","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":63,"name":"Has-Been Heroes","genre":"Action","price":0.0,"description":"Has-Been Heroes is a challenging, lane-based roguelike game of strategy and action, featuring a band of heroes on a quest to escort the King's twin princesses to school!\nPlayers control three characters during the journey and must focus on coordinating melee attacks, managing cooldowns and combining hundreds of different spells to create devastating combo effects, all in order to defeat an endless army of undead, summoned in their path by the Great Ghoul!\nThe rewarding strategy game features irreverent humor, expanding world maps and increasing levels of difficulty, compounded by the specter of permadeath. The massive quantity and randomness of spells and items, as well as additional unlockable heroes allow for thousands of new experiences, forcing players to change their playstyle each time they start a new game.STORYLINE\nThe teeth of time chew on even the bravest of champions, and there comes a time when wizened old mages and warriors are just one last adventure away from retirement. Thankfully, a young rogue joins the heroic Has-Been Heroes, for who else can read the tiny text on those potion bottles and assist the “rusty” crew? The rogue comes along not a moment too soon, for King Fortinbrax has summoned his oldest, most trusted heroes for a final, epic quest. The heroes must escort the twin Princesses Avaline and Beatrix to a faraway Academy (to school!)- but the road is long and fraught with peril.FEATURES\nControl three characters across three lanes, coordinate their attacks and spells to defeat an incoming horde of enemies!\nPlan your route carefully on the randomly generated maps filled with surprises! Travel through merchants, spell vendors, treasure chests and other crossroad locations to boost your character’s powers… but be vary not to succumb to the darkness!\nA combination of turn-based and RTS game mechanics featuring easy-to-learn basics that are tough to master and evolve into frantic complexity. Discover new tricks and hidden features after hours of gameplay!\nMeet the epic band of heroes as the young and eager Rogue, joining the company of the wise monk Metacles and the giant-wrestling warrior Crux… and discover a band of long lost friends, such as the Anthropologist turned Mexican Wrestler, the ever-vigilant and paranoid Bodyguard, and many more!\nUnlock and collect hundreds of game-changing items and spells, boosting the heroes' powers and making each run unique!  300+ spells, 200+ items, 13 regions, and 12 playable heroes!\nIn roguelike fashion, die and try again! Each run is different due to randomized maps, spells, items, and enemies. With each level the length of gameplay increases, compounded by the peril of instant death, which forces the player to start over from the beginning.","imageUrl":"https://media.rawg.io/media/screenshots/026/026864a9cbb1265d3cde489ea38503dd.jpg","releaseYear":2017,"developer":"Frozenbyte","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":894601,"name":"Summoners War: Chronicles","genre":"Action","price":0.0,"description":"New Raid boss [Naraka]\n- Challenge [Naraka], the strongest boss in Chronicles, and get the first ever 6-star equipment!\nNew 5-star Monster [Raven]\n- 'Raven', the blade assassin is coming to Chronicles!\n[Battlefield: Moon Shadow Forest] open\n- Exhilarating cooperation and competition in a 9vs9 battlefield!\n- Seize victory and Sky Stones with your teammates.\n[Brawl Arena] open\n- Intense Pick&Ban and real-time battle!\n- Outplay your opponent strategically to win.\n《 Game Overview 》\n■ 350 types of Monsters and 5 attributes\nSummon hundreds of Monsters, each with their own dynamic ultimate skills.\nForm a diverse team and join them on the battlefield for the first time!\n■ Stronger together! ‘Fight alongside Monsters’\nChoose between three Summoners, Orbia, Kina and Cleaf.\nEach Summoner is equiped with a unique role and skillset.\n■ Summoners War Reimagined\nExperience the expanded universe of Summoners War!\nImmerse yourself in the untold story of the Rahil Kingdom taking place before Sky Arena and Lost Centuria!\n■ Game Modes\nDelve into loot-filled Dungeons, climb the many-floored Ascensions, and take on Raids with friends!\nThen head to the Arena to compete against other players!\n■ Gathering, mining, and fishing!\nTake a break from battle.\nEnjoy the natural beauty that the world has to offer.\n■ Take on other players in PvP!\nOnly the strongest survive on the challenging PvP Battlefield.\nYou best come prepared.\n■ Team up with friends in ‘Party Play’ Co-op!\nGrab your friends to participate in public events and take on raids.\n‘Summon Your Best’ together!\n***\n[App Permissions]\nWe require permission to provide the following services while using the app.\n1. (Optional) Storage (Photos/Media/Files): Access to external storage required for additional downloads and saving in-game screenshots.\n2. (Optional) Microphone/Recording audio: Required for using voice chat\n※ Services excluding the functions related to the corresponding permissions can be used without allowing optional permissions.\n[How to Remove Permissions]\nYou can reset or remove permissions after allowing them as shown below.\n1. Removing permissions: Device Settings > Privacy > Select Permission > Agree or Remove Permission\n2. Removing permissions per app: Device Settings > Select App > Agree or Remove Permission\n[Supported Languages]\n한국어, English\n• This app is free-to-play and offers in-app purchases. Purchasing paid items may incur additional fees, and payment cancelation may not be available depending on the type of the item.\n• Conditions regarding the usage of this game (contract termination/payment cancelation, etc.) can be viewed in the game or the Com2uS mobile game Terms of Service (available on the website, http://terms.withhive.com/terms/mobile/policy.html).\n• Inquiries regarding the game can be submitted via Com2uS Customer Support 1:1 Inquiry (http://m.withhive.com > Customer Support > 1:1 Inquiry).\n• Minimum specifications: 3GB RAM\n***\n- Summoners War: Chronicles Brand Site: https://www.summonerswar.com/chronicles","imageUrl":"https://media.rawg.io/media/screenshots/2ed/2ed9c1a16f3f1972ae7ac1f65312cd6f_f1QwrHn.jpg","releaseYear":2022,"developer":"Com2uS","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":816474,"name":"Chimeraland","genre":"Action","price":0.0,"description":"ChimeraLand is an open-world sandbox RPG in a prehistoric, mythical world.\nYou need to gather resources, craft items, grow crops, and research technologies. Start from building a survival shelter, to making a megabase in the Outerspace!\nYou will find hundreds of bizarre mythical beasts while exploring this seamless world. Do you want a new pet? Catch and Tame them!\nOr maybe you want to have a pair of wings on your horse? Let your pets devour them, and see what kind of Chimera you can create! The possibility is endless!\nYou can be a close-quarter fighter when wielding blades, a cunning gunslinger with X-bows, or both! You can be a Werewolf, a Dragonborn, or a Jellyfish girl! Choose your own way, and create your own style!\nThere are no limitations to restrict what you can and cannot be!\nAnd there are thousands of other creative travelers, with their unique tastes and styles, living and thriving together...\n•\tExpansive Open World: Players can roam wild in the 1000 square kilometer world\n\n•\tTransform a Mystical Wilderness: Build a dream world anywhere, be it land, sky or sea\n\n•\tCustomizable Experience: With countless different looks, a player can be whoever they want to be\n\n•\tOne-of-A-Kind Beasts: Any beast can become a player’s pet, using an unique system of “devouring” or “evolving” which gives pets characteristics, shapes and abilities\n\n•\tVersatile Weapons for Better Combat: Charge fearlessly into battle with a host of weapons that can be switched at will\nChimeraland an open world game with a high degree of freedom. Players can explore and build freely, interact with rich exotic animals, fight, cultivate pets, and survive in a dynamic ancient world. To find out more, visit the official social media channels on Facebook, Instagram, YouTube, TikTok, Twitter and Discord.","imageUrl":"https://media.rawg.io/media/screenshots/f1f/f1ff71a88aeae59c4673215cff40b9a0.jpg","releaseYear":2022,"developer":"Level Infinite","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":761451,"name":"McPixel 3","genre":"Adventure","price":0.0,"description":"Is it a bird? Is it a plane? It's falling too fast to be either of those. It's McPixel! A wanna-be hero who keeps getting mixed up in the most unbelievable situations you can imagine.Levels\nOne moment you're stuck in a speeding train headed towards the cliff; the other, you're in a falling plane. Sometimes you need to win an impossible-to-win soccer match, and the other, you're a dinosaur trying to hide from a meteorite. Stuck in a flaming house? Sandwiched between two battling armies? Certainly not a problem for McPixel! 100 levels of fast-paced action are waiting for you!\nMinigames\nSometimes, the usual adventure style will get interrupted by genre-bending minigames. Ranging from racing, shooting, fighting, and sports to even platforming or FPS! The game offers over 20 minigames scattered around the world of McPixel!\nCoins and stamps\nMcPixel is not all about just saving the day but having fun trying to come up with the craziest possible solutions. And for every solution, you will be rewarded with coins! Find all solutions in a level to get the gold prize and some extra coins! You can use them to unlock new levels! Also, everyone loves coins, right? They're shiny and golden and spinning! No reason not to have some more!\nMcBurg\nThe game takes place in the city of McBurg. Explore the city and find different adventures! Some of the paths in the city are blocked and will require you to spend coins to move forward and access new levels! The city will get populated with characters and items from the levels you already visited as you play. You will also be able to don some of the costumes you found while playing.\nOn the edge of the city upon a grassy hill, you can see a Devolver vault, full of gold, looming over McBurg. So, if you ever need a lot of coins, maybe it's time to pay Fork Parker a visit?\nSteveSometimes, during your adventures, you will find Steve. Steve can be in the weirdest and most unexpected of places, and finding him will transport you to the Steve level.\nSteve is not like McPixel and doesn't specialize in saving the day. He's just some guy, doing stuff. Like fishing, cooking, driving a car, or summoning demons. You know, just the average guy kind of stuff.\nMcPixel Engine\nMcPixel 3 runs on 100% software-rendered McPixel Engine, so in the age of unaffordable graphics cards, you can be sure you will be able to run McPixel 3 just fine!\nThe engine has been written from scratch just for the purpose of running McPixel. That makes the game run smoothly even on the oldest computer, so make sure you install McPixel on your grandma's PC next time you visit! Additionally, that makes the game environment-friendly! McPixel 3 saves the planet (and battery life)!Key Features:100 mind-blowing levels\nNearly 1000 hilarious gags to discover\nOver 1500 interactive items\nOver 20 minigames in all imaginable genres\nOver 300,000,000 pixels\nWorks on your mom's computer\nSteve\nA water level","imageUrl":"https://media.rawg.io/media/screenshots/ef1/ef15835878f91ad59cbb069697da1e2c.jpg","releaseYear":2022,"developer":"Devolver","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":727318,"name":"Patrick's Parabox","genre":"Strategy","price":0.0,"description":"Patrick's Parabox is an award-winning puzzle game that explores a unique recursive system of boxes within boxes within boxes within boxes. Learn to manipulate the world's structure by pushing boxes into and out of each other. Wrap your head around what happens when a box contains itself, and learn to use infinity to your advantage. Explore many more mechanics and recursive twists as you delve deeper and deeper into the system. It's boxes all the way down.\n\n\n\nThe game has over 350 hand-crafted puzzles, which are designed to make you think, but also to guide you and showcase the beauty of the system. Each puzzle contains a new idea; there is no filler.\n\n\n\nA soothing, inquisitive soundtrack and sound design by Priscilla Snow mirrors new mechanics as they are introduced. (Note: the June 2021 demo includes this new music and sound!)\n\nPatrick's Parabox won the Excellence in Design award in the Independent Games Festival 2020. The game was also an IndieCade 2019 festival selection and received the IndieCade Developers Choice award.","imageUrl":"https://media.rawg.io/media/screenshots/737/737028350ce7f1b2e555f3f757ff01dc.jpg","releaseYear":2022,"developer":"Patrick Traynor","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":622493,"name":"Super Monkey Ball: Banana Mania","genre":"Action","price":0.0,"description":"Roll through wondrous worlds with AiAi and friends as you race to stop monkey mad scientist Dr. Bad-Boon from blowing up Jungle Island! Join the all-star monkey team of AiAi, MeeMee, GonGon, Baby, YanYan and Doctor as you bounce, tilt, and roll your way across hundreds of delightfully crafted levels and mazes. It’s monkey business for the gang as you take down Dr. Bad-Boon and steal back your beloved bananas!\n\nFeatures:\nThe ultimate Super Monkey Ball Experience – More than 300 stages from Super Monkey Ball, Super Monkey Ball 2 and Super Monkey Ball Deluxe.\nGo Bananas with 12 fun minigames including Monkey Racing, Monkey Soccer, Monkey Bowling, Monkey Baseball and much more!\nChallenge your friends as you compete for the top banana on the online leaderboards!\nImmerse yourself in the Super Monkey Ball world with creative comic-book-style storytelling in Story Mode.\nWant to be the coolest monkey on the block? Customize your character and Super Monkey Ball to make it your own!","imageUrl":"https://media.rawg.io/media/games/5a4/5a447ceb56af54944c5a09fc42ba6595.jpg","releaseYear":2021,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"}]},{"id":581137,"name":"Across the Obelisk","genre":"RPG","price":0.0,"description":"Wishlist and follow\nJoin our DISCORD\nAbout the Game\nDynamic Deckbuilding Roguelite RPG\nPlay solo or co-op with up to three friends\nSixteen unlockable characters to create your party\n+500 cards and items to choose, craft and upgrade\nProcedural generated system intended to be highly replayable\nEvents and quests where your decisions affect how the story unfolds\nFace powerful bosses in tactical combat\n... would you dare to go across the obelisk?\nYou can play solo or with up to three other players. Each one of you will control a hero in combat but all of you will have to work together and decide what's best for the group... will you help the farmers against a group of small fiery demons or will you search among the ashes for nice loot?\nChoose among 16 unlockable characters and form your party. Each one of them have his own cards, items, mechanics, stats and strengths... it's not the same to play with a fire wizard than a shadow mage, would you play with two healers or rather play with a damage oriented group?\nMore than 500 upgradeable cards and 200 items to choose, will let you customize your heroes with different builds: poisons, bleeds, defensive skills... there are a lot of combinations that you can apply to each hero.\nEach game will be different. Take a path, fight your way through it, complete quests and the world will evolve in front of you. Lots of hidden places and mysteries to be solved await you in Across the Obelisk.","imageUrl":"https://media.rawg.io/media/screenshots/1af/1afb0a3716972aecdb7c8066d84256c0.jpg","releaseYear":2021,"developer":"Dreamsite Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":513604,"name":"Friday Night Funkin' (ninjamuffin99, PhantomArcade)","genre":"Action","price":0.0,"description":"FRIDAY NIGHT FUNKIN'\n\"PRETTY DOPE ASS GAME\"\nPLAYSTATION MAGAZINE MAY 2003 ISSUE\nUh oh! Your tryin to kiss ur hot girlfriend, but her MEAN and EVIL dad is trying to KILL you! He's an ex-rockstar, the only way to get to his heart? The power of music...\nWASD/ARROW KEYS IS CONTROLS\n- and + are volume control\n0 to Mute\nIt's basically like DDR, press arrow when arrow over other arrow. And uhhh don't die.\nCREDITS\n@ninja_muffin99 - PROGRAMMING\n@PhantomArcade3k and @evilsk8r - ARTISTS\n@kawaisprite - TASTY ASS MUSIC\nTOSS THE SONGS SOME COIN ON BANDCAMP\nhttps://drugpop.bandcamp.com/album/fresh\nSPECIAL THANKS TO\nKiddbrute, Wandaboy, IvanAlmighty, Fizzd, HENRYEYES and TOM FULP AND EVERYONE ON  NEWGROUNDS\nSOURCE CODE ON GITHUB\nhttps://github.com/ninjamuffin99/ld47","imageUrl":"https://media.rawg.io/media/screenshots/08f/08fe06662512e0b4936f20a1596528c0.jpg","releaseYear":2020,"developer":"PhantomArcade","libraryGames":null,"platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":484505,"name":"Puyo Puyo Tetris 2","genre":"Action","price":0.0,"description":"Two Puzzle Legends Reunite for the Ultimate Crossover\nJapan’s beloved puzzle game series Puyo Puyo and the world-renowned Tetris® game franchise have teamed up again to deliver even more Puyo-popping and Tetrimino-clearing fun in Puyo Puyo Tetris 2. Playing is easy: match 4 or more same-colored Puyos or complete a line of blocks to clear them from your board and dump Garbage into your opponent’s game. But keep an eye on what’s coming your way too.\n\nPlay traditional Puyo Puyo and Tetris…or mix them together to level up your game. Offline or online, you’ll have loads of modes that let you play the way you want from single-player Adventure to couch-competition Versus to ranked Online matches, and more.\nBrand-new Skill Battle introduces character-based skills that can quickly turn the tables on a match, plus item cards to power up your team\nVibrant characters and an all-new story adventure add dimension to addictive arcade puzzle play\nImproved Online mode offers competition in game-specific leagues and Free Play for up to 4","imageUrl":"https://media.rawg.io/media/screenshots/5bd/5bda059430f96cf5098fdd29b88c500f.jpg","releaseYear":2020,"developer":"Sonic Team","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":480743,"name":"Little Orpheus","genre":"Adventure","price":0.0,"description":"Little Orpheus™ is a technicolour side-scrolling adventure game inspired by classic movies like Flash Gordon, Sinbad and The Land that Time Forgot. Delivered in eight bite-size, commute-friendly episodes, Little Orpheus™ is simple enough for casual players, but rich enough for seasoned adventure fans.","imageUrl":"https://media.rawg.io/media/screenshots/116/116e9899edd03b05b69b8041f3711daf.jpg","releaseYear":2020,"developer":"The Chinese Room","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":479677,"name":"Doom Eternal: The Ancient Gods - Part One","genre":"Action","price":0.0,"description":"Your war is not over… slaying the Khan Maykr left an imbalance of power that threatens all of creation. The legions of Hell have razed the heavens, threatening to expand their control across dimensions. With the aid of an old ally, battle your way back to Urdak and decide the fate of the cosmos. Your mission is now your own.","imageUrl":"https://media.rawg.io/media/games/ce9/ce95a8eca174f32f58df28074c4ef7e7.jpg","releaseYear":2020,"developer":"id Software","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":63739,"name":"Suicide Guy: Sleepin' Deeply","genre":"Action","price":0.0,"description":"\"Suicide Guy: Sleepin' Deeply\" is a new Chapter from the original Suicide Guy game series.\nThe game is a first person action-puzzle game set in a world of dreams.\nYou'll assume the role of a nice big guy unable to wake up from his dreams. Your task is to help him to step out of them.Features3 to 4 hours of pure gameplay set inside Suicide Guy's subconscious\nA whole new story with an unexpected plot twist\nPhysics based levels\nUltimate moves: able to pick up items, throw them, activate mechanisms and even burp.\nFunny creatures to annoy\nVehicles to drive\nNew Collectible items to find\nGamers will have to use different items in every kind of situation by solving original brain teasers.\nDespite the title, the game is NOT at all about suicide or depression.","imageUrl":"https://media.rawg.io/media/screenshots/12a/12ab118ffa7ea25375c16e01365ecc06.jpg","releaseYear":2018,"developer":"Fabio Ferrara","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":61738,"name":"MINImax Tinyverse","genre":"Action","price":0.0,"description":"Real-time, tower-rush brawler!\nWatch and assist your favorite champions\nas they battle for the realms of tinyverse.\n​Outwit opponents by using your miracles with tiny mighty champs and minion troopers!\nThe realms of Tinyverse await you!INVITATION into Tiny World for Curious People\nAt a small town medieval-like antique shop ‘MINImax,' you can find the tinyverse if you get so lucky on a day. It's a tiny world of two realms against each other for eternity. Creaea vs. Aillai. Aillai vs. Creaea. You can choose a realm to help win over the other.\nIn an amazingly tiny but detailed battlefield, you can not do so much control thingy so. Since your champion and his troopers have their own minds, they will do whatever they feel right to do like any child or pet. And their simple minds of not so much high standard from your point of view might make you feel some frustration at first.\nBUT! at the moment of the frustration, Thank God!!! You will find your tiny mighty champion can feel the direct existence of you and interact. So from then, you can pick the champ with your fingers to hold high in the air safe from harm's way or to move into a different spot, activate his/ her skills.​​​ And also you can do mighty tiny miracles like creating a stairway out of thin air guiding your champ and troopers to overcome a high ground or obstacle, creating a wall to block opponents or your team with your own will and also giving opponents your pounding firm fist. And much more miracles to be with you.\n​\nAs for the troopers... well, never mind. You just need to assemble them well right before entering the brawl. They can only feel you in a veeerrryy distant way. So it's the only way that you pick them well that suit your champ and your miracles or the other way around. That's it.\nAnd it's enough now.\nSo hurry to join and feel the tinyverse at your fingertips at a shop 'MINImax' that I feel pretty sure you are the curious kind of person into the tiny world.\nThe Realms of Tinyverse await you for such a long time.Tiny is Mighty!\nfrom the shopkeeper of MINImax\n​​","imageUrl":"https://media.rawg.io/media/screenshots/26a/26a60ac50159473996bfff151a42ea42.jpg","releaseYear":2018,"developer":"O'olBlue","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":60796,"name":"Double Cross","genre":"Action","price":0.0,"description":"Developed by 13AM Games, the studio behind award-winning Runbow, Double Cross is an exciting action adventure game that has players take on the role of Zahra, an agent of R.I.F.T. (Regulators of Interdimensional Frontiers and Technology) whose job it is to maintain peace and order between all dimensions. A recent attack on R.I.F.T. headquarters thrusts players into a thrilling new case where they must use their R.I.F.T. developed gear to sling, swing, fight and investigate across distinct dimensions. During their travels players will gather clues to bring themselves one step closer to finding the identity of R.I.F.T.’s attacker and save every variation of the universe.\nFEATURES\n•\tPlayers can custom tailor their play style by collecting Upgradium and using it to level up and unlock RIFT agent gear.\n•\tAn adventure-game style gameplay and upgrade system that allows players to choose how and in what order they play levels\n•\tA unique “Proton Slinger” mechanic that allows diversity of movement throughout levels and the ability to grab and throw objects and enemies\n•\tVaried and upgradeable attacks and combos\n•\tAn intricate story engages players as they solve an interdimensional mystery with a diverse cast of interdimensional characters\n•\tSlick 2D HD art that draws upon traditional gaming and anime style","imageUrl":"https://media.rawg.io/media/screenshots/102/102cdce0edc66ea0afd721b6faa4ae16.jpg","releaseYear":2019,"developer":"13AM Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":57048,"name":"Golden Axe II (1991)","genre":"Action","price":0.0,"description":"Golden Axe II is a side-scrolling beat 'em up video game developed and published by Sega, first released on the Sega Genesis in December 1991. It is the home console sequel to the popular game Golden Axe, marking the second game in the series, though the arcade did see a sequel of its own in 1992, titled Golden Axe: The Revenge of Death Adder. Golden Axe II was only released on the Mega Drive, while the original was released on many other platforms. The game later appeared in Sonic's Ultimate Genesis Collection for Xbox 360 and PlayStation 3, and as an iOS port on iTunes.","imageUrl":"https://media.rawg.io/media/screenshots/759/759941a0ae155a5cfb34fe2dc15d9dea.jpg","releaseYear":1991,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Genesis"}]},{"id":53380,"name":"The Lord of the Rings: The Two Towers","genre":"Action","price":0.0,"description":"The Lord of the Rings: The Two Towers is an action hack and slash video game developed by Stormfront Studios for the PlayStation 2 and Xbox. It was ported to the Game Boy Advance by Griptonite Games, to the GameCube by Hypnos Entertainment, and to mobile by JAMDAT. A version for Microsoft Windows developed by Ritual Entertainment was cancelled during development. The game was published on all platforms by Electronic Arts. Originally released in North America for the PlayStation 2 in October 2002, it was released in November for the Game Boy Advance, in December for the Xbox and GameCube, and in May 2003 for mobile. In November 2003, EA released a sequel, The Lord of the Rings: The Return of the King.\nThe game is an adaptation of Peter Jackson's 2001 film The Lord of the Rings: The Fellowship of the Ring and his 2002 film The Lord of the Rings: The Two Towers, which was released shortly after the game. As it is not an adaptation of J. R. R. Tolkien's 1954 novel The Two Towers, the second volume in his Lord of the Rings trilogy, anything from the novel not specifically mentioned or depicted in the films could not be represented in the game. This is because, at the time, Vivendi Universal Games, in partnership with Tolkien Enterprises, held the rights to the video game adaptations of Tolkien's literary works, whilst Electronic Arts held the rights to the video game adaptations of the New Line Cinema films. EA chose not to publish a game based on Jackson's The Fellowship of the Ring film, instead incorporating some of the plot and footage into their The Two Towers game, which was released a few weeks after Vivendi's The Fellowship of the Ring game, a licensed adaptation of Tolkien's novel The Fellowship of the Ring.\nThe Two Towers received a generally positive response, with critics praising the re-creation of sets and scenes from the films, and the epic scope of some of the battles. Some, however, criticized the game for being too short and the combat overly repetitive. The game was a financial success, selling almost four million units, and outselling Vivendi's The Fellowship of the Ring game, which sold just over one million.","imageUrl":"https://media.rawg.io/media/screenshots/6ff/6ffcee226f5370e3a175c93d2d869181.jpg","releaseYear":2002,"developer":"Stormfront Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Xbox"}]},{"id":34818,"name":"Teenage Mutant Ninja Turtles (2003)","genre":"Action","price":0.0,"description":"Be your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world. Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas. Find scrolls to unlock special attack moves and effects. Interact with characters from the animated television series, such as Splinter and Casey Jones. Don't hide in your shell-be a hero.","imageUrl":"https://media.rawg.io/media/games/f78/f78d9b7b59eb1f2db4bc0c1f721d142f.jpg","releaseYear":2003,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":28039,"name":"Minecraft: Story Mode — Season Two","genre":"Action","price":0.0,"description":"Now that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more...complicated. With more responsibilities and less time for adventure, old friendships have started to fade -- at least until Jesse’s hand gets stuck in a creepy gauntlet that belongs to an ancient underwater temple. Together with old pals and new comrades alike, Jesse embarks on a brand new journey filled with tough choices, good times, and at least one temperamental llama.\nIncludes access to all 5 episodes (Episode 1-2 available now, Episodes 3-5 as they release) in this brand new season from the award-winning studio, Telltale Games.","imageUrl":"https://media.rawg.io/media/games/5eb/5ebb2eff31f782b5ca986353dbfb8694.jpg","releaseYear":2017,"developer":"Telltale Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"}]},{"id":26492,"name":"Professor Layton and the Unwound Future","genre":"Desconocido","price":0.0,"description":"Professor Layton and the Unwound Future™ is the third game in the\nbeloved Professor Layton series of brainteaser puzzles for Nintendo. It\nplaces the Professor and his trusted apprentice at the center of a\nspellbinding adventure after they receive a strange letter sent from 10\nyears in the future. Wind your way through more than 165 mind-bending\npuzzles as you decipher clues and strive to unlock a time-twisting\nmystery that threatens to plunge London into chaos. The story is\ndelivered both through game play and through beautifully rendered\nhand-drawn cinematics. Layton fans and puzzle fans alike will find the\ngame remarkably addictive.\n\nWith over 165 in-game puzzles and 30 downloadable puzzles, Professor\nLayton and the Unwound Future will challenge your wit at every turn.\nUsing your wireless Broadband Internet Connection, cConnect to\nNintendo® Wi-Fi Connection to download a new puzzle each week for 30\nweeks after the game launches. Solve the puzzles to uncover clues and\nfollow the clues to solve the mysteries that confront Professor Layton.\n\nThe rich story, colorful characters and hand-drawn art style come to\nlife with lush animated and fully-voiced cut-scenes. For the first\ntime ever find out more about Professor Layton’s past as he strives to\nsave the future.\n\nQuick and easy Touch Screen control makes exploring the game and\ninputting answers as easy as can be. Use the pumped up Memo Pad to\nmake notes and solve difficult puzzles with multiple colored pens and\ndifferent pen thicknesses to choose from in addition to an eraser\nfunction. Solving math problems, tracing paths, and making notes is\nnow easier than before.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.\n","imageUrl":"https://media.rawg.io/media/screenshots/c44/c4429b5add3a2dc4ad442994eb053ad2.jpg","releaseYear":2010,"developer":"Level 5","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]}]