[{"id":308132,"name":"Unrailed!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c02/c028c08838e981be9add1ef29c34cfaf.jpg","description":"Unrailed! is a co-op multiplayer railroad construction game where you have to work together with your friends to build a train track across endless procedurally generated worlds. Master encounters with its inhabitants, upgrade your train and keep it from derailing!BUILD A TRACK FURTHER THAN EVER BEFORE\nGather resources and craft tracks to extend your current track to prevent your train from reaching its end. But watch out - there is only one tool of each type, cooperation is of the essence.\nPLOUGH YOUR WAY THROUGH THE WORLD\nEvery world is unique, you'll have to master ever new challenges to stay on track!\nATTACH NEW WAGONS TO MASTER THE UNKNOWN\nUpgrade your train to be prepared for whatever is about to come. Get an atomic engine, upgrade your crafting wagon, attach a supercharger or just choose from a vast range of other options.\nOVERVIEW\nIntense railroad construction co-op experience\nOnline and local multiplayer\nProcedurally generated worlds with different difficulty levels\nGame modes: Endless, Quick and Versus\nDifferent biomes (5+)\nDifferent upgradable wagons (10+) to modify your train in Endless mode\nUnlockable characters\nReplay system\nBlocky, voxel style inspired look","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Indoor Astronaut","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":52884,"name":"DOOM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47b/47b50d880be8453bf9cda6e5c007bc26.jpg","description":"Doom (typeset as DOOM in official documents) is a 1993 science fiction horror-themed first-person shooter (FPS) video game by id Software. It is considered one of the most significant and influential titles in video game history, for having helped to pioneer the now-ubiquitous first-person shooter. The original game was divided into three nine-level episodes and was distributed via shareware and mail order. The Ultimate Doom, an updated release of the original game featuring a fourth episode, was released in 1995 and sold at retail.\n\nIn Doom, players assume the role of an unnamed space marine, who became popularly known as \"Doomguy\", fighting his way through hordes of invading demons from Hell. With one-third of the game (nine levels) distributed as shareware, Doom was played by an estimated 15–20 million people within two years of its release, popularizing both the business model of online distribution and the mode of gameplay, and spawning a gaming subculture. In addition to popularizing the first-person shooter genre, it pioneered immersive 3D graphics, networked multiplayer gaming, and support for customized additions and modifications via packaged files in a data archive known as \"WADs\". As a sign of its effect on the industry, first-person shooter games from the genre's boom in the 1990s, helped in no small part by the game's release, became known simply as \"Doom clones\". Its graphic violence, as well as satanic imagery, made Doom the subject of considerable controversy.\n\nThe Doom franchise was later continued with the follow-up Doom II: Hell on Earth (1994) and numerous expansion packs, including Master Levels for Doom II (1995), and Final Doom (1996). Originally released for MS-DOS, the games have been ported to numerous other platforms. Once the game's source code was released in 1997, it spawned even more adaptations, as fans further ported the code to countless devices. The series started to lose mainstream appeal as the technology of the Doom game engine was surpassed in the mid-1990s, although fans have continued making Wads, speedruns, and modifications to the original. The franchise again received popular attention in 2004 with the release of Doom 3, a retelling of the original game using id Tech 4, with an associated 2005 Doom motion picture. Another release, simply titled Doom and powered by id Tech 6, was released in 2016 and focused on returning to the fast-paced action of the first two games.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"SEGA","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"SNES"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"3DO"},{"id":0,"name":"Jaguar"},{"id":0,"name":"SEGA 32X"}]},{"id":9894,"name":"Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/822/822af73f10e03d493d427ddb26982633.jpg","description":"Squad is a 50 vs 50 multiplayer first-person shooter that aims to capture combat realism through communication and teamplay, emphasizing both strong squad cohesion mechanics as well as larger scale coordination, tactics and planning. It features large open maps, vehicle-based combined arms gameplay, and player-constructed bases to create a heart-thumping, visceral gaming experience which mixes organized tactical multi-squad planning with split second decision-making in real-world scale firefights.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Offworld Industries","platforms":[{"id":0,"name":"PC"}]},{"id":23734,"name":"Tower of Time","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/997/99739f37c098a1dee511d2501e41204e.jpg","description":"Tower of Time is a new take on classic RPGs.  It has hand-crafted levels filled with various enemies, challenging puzzles, and engaging story-lines. Its dynamic real-time combat with slow mode requires tactical awareness and careful preparation of the party.\nAt the moment the content is for approximately 15 hours of game-play time on normal or lower difficulty, excluding optional battle challenges.Before you buy:If you are looking for a game that is trying to bring something new to RPG genre - Tower of Time is an attempt at just that. If you are not sure if you like the combat we implemented - before you buy - please check some YT clips or visit our YT channel, where we uploaded the combat gameplay recorded and commented by an actual player. This is not a turn-based combat, rather a combination of RPG and RTS on a small scale, where you have the ability to slow time at will.\nOn Hard  difficulty the game is meant to be hard, requiring your undivided attention throughout the entire combat encounter.\nOn Epic difficulty - there is only one party/skill/item composition for each enemy/boss type that we know of - one mistake will likely wipe your party. You must be in full control of the battle every second. Experimentation and thinking outside-of-the-box will ensure your success here.Features: Engaging story – set in a world where technology met magic with devastating consequences. Hundreds of lore books and scattered pieces of information slowly reveal the history of Artara as the protagonist approaches his fate.\nNovel combat system – unique real-time action with a slow-time feature, where each match is played on one of many separate tactical maps. Plan ahead and position your party accordingly. Use slow-time to react to new threats or negate enemy skills. No two encounters are ever the same.\nFive difficulty levels: You can choose whether you want only to enjoy the story or test your tactical thinking and skills.\nBuild your party around typical tank/dps/support composition or try something entirely new.\nDifferent combat scenarios - e.g. Swarm or Only Elite - will ensure that combat is not repetitive.\nFind secret locations, cleverly hidden in the environment. Travel through hand-crafted levels where every single place is carefully designed.\nSeven classes to choose from, and your party can be adjusted at will and anytime, depending on the challenges you face. Each champion has unique skills that can be upgraded and re-trained at will. (In Early Access six champions are available, as the seventh joins your party at lower levels).\nNew character progression system: there is no experience to gain. Instead, discover ancient knowledge to unlock new skills and carefully design your characters. Each character could be turned into a powerful and durable attacker or a skill-based champion.\nDefeat powerful elite enemies (bosses) wielding diverse skills and spells. Assess their strengths and weaknesses carefully to succeed.\nComplete combat challenges for item rewards and unique enchanting recipes, or just to test your new party setup.\nRandom loot system. Craft item of your choice and power, using crafting crystals of various types. Discover ancient enchanting recipes that can change the nature of the combat, granting regeneration aura or immunity to special effects.\nUpgrade your city as the main training/equipment hub and repository of all the lore you find.Story:For long ages past, Artara was a place of great peace and beauty. Then, a mysterious event took place. Within a few generations, the land was broken and the skies darkened. More than a thousand years of decline has passed since then.\nAs a young boy, you came upon the base of an immense Tower, uncovered by yet another violent earthquake. Deep below sleeps an ancient power. Since that day, you have been drawn inexorably to this place. Your task is to lead a group of champions and reach whatever resides in the depths of the Tower. There you will face the ultimate choice…","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Event Horizon","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17607,"name":"The Showdown Effect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10d/10d449b3065e298b2fd337ecd90e52fa.jpg","description":"The atmosphere of the game is a collection of easily recognizable settings of action-movies of the eighties. Similarly, in the guise of the eight heroes of the game there are attributes of the heroes of these films. The action takes place on several levels, instantly recalling in memory such films as \"Alien\", \"Bladerunner\", \"Terminator\" and many films about martial arts.\n\nThe gameplay can also be considered one big quote from the mentioned films. Characters simply fight with each other, using a variety of weapons and interior features.\n\nThe appearance of characters, their skills, weapons and their characteristics - all this can be adjusted in many ways. You can even set up rules for fighting.\nIn the game there is no single-player mode, there is only multiplayer. There are no campaigns in the game, there are only different kinds of fights - for example, \"One against all\" or \"Each for yourself\". At the end of the battle, the player receives points that can be spent on new equipment, weapons or on the discovery of new characters.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arrowhead Game Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11852,"name":"WAKFU","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a2/0a290bb05ca0d2d0621e70f231a86335.jpg","description":"Wakfu is a turn-based MMORPG developed by Ankama games. This is an indirect sequel to 2004 game Dofus. \n\n###Setting \nThe game takes places in the same universe as Dofus but in 1000 years after the events of the previous game. The player must defeat an ogre named “Ogrest” which presumably made the world flood. \n\n###Gameplay \nThe game follows a player-created avatar, which can choose one of eighteen classes available in the game. Each one has several unique abilities not available to other classes. Unlike other MMO RPGs, the player gets all of the classes’ abilities from the start and can only strengthen them as they progress. After completing early sections of the game, the player can also join one of many in-game nations. The nations control parts of the world and are ruled by the real-player governor. The governor can appoint up to seven other players to run his administration. Each nation has its laws that can be changed by the governor. Players that break the law become outlaws and can be killed by other players without any penalty. \nLike in other MMORPG, character progression depends on the experience they get. To get new levels, players can complete the quest, fight mobs and explore the dungeons. The combat in Wakfu is turn-based and incorporates some elements of tactical role-playing games.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ankama Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4128,"name":"Ni no Kuni: Wrath of the White Witch","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/95e/95ee6bf3accffaf3dc886a8e3ecc24d8.jpg","description":"Ni no Kuni: Wrath of the White is a Japanese role-playing game with anime visuals. In addition to the visual style in the game, there are animated sequences from Studio Ghibli, where famous animator Hayao Miyazaki works. The player takes control of Oliver the young boy, who goes on a journey to save his mother.\n\nThe player controls the main character using the third person perspective. The main task is to complete the linear quests for further development of the plot. During a collision with enemies, combat mode is activated, and the gameplay slightly changes. To win it is necessary to use magical abilities and so-called Familiars. Familiars can be tamed and upgraded. After defeating monsters, Oliver gets experience points, a local analog of money and loot. The whole world of the game is available for research right after the game starts, the completion of game’s quests and task further on the story opens up new game mechanics and makes the gameplay more interesting and elaborated.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"}]},{"id":3456,"name":"Joe Danger 2: The Movie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fef/fefee32869b3e8c909f9ec68aa99f78d.jpg","description":"Continuation of the game \"Joe Danger\". The protagonist is the world's most determined stuntman, moved to Hollywood to take part in the making of the greatest action film ever made.\n\n\"Joe Danger 2 The Movie\" allows the player to become the protagonist of the most intense moments of the action movie, to perform many stunts - in fact, the whole game and there is a continuum of stunts, from skiing to flying jetpack and destroying bad guys armed with lasers. There are water skiing, extreme cycling, sky-diving and even adventures in the jungle with dinosaurs and in deep mines.\n\nThe execution of stunts is a deadly profession, and this fully applies to the hero of the game. He risks his life every second.\n\nThe game has a hundred levels, you can also create your own levels and play with your friends in multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hello Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14501,"name":"SHENZHEN I/O","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab9/ab9dd7bc8d6011793cb871193c2185e1.jpg","description":"Build circuits using a variety of components from different manufacturers, like microcontrollers, memory, logic gates, and LCD screens.\nWrite code in a compact and powerful assembly language where every instruction can be conditionally executed.\nRead the included manual, which includes over 30 pages of original datasheets, reference guides, and technical diagrams.\nGet to know the colorful cast of characters at your new employer, 深圳龙腾科技有限公司 (Shenzhen Longteng Electronics Co., Ltd.), located in the electronics capital of the world.\nGet creative! Design and test your own games and devices in the sandbox.\nEngineering is hard! Take a break and play a brand-new twist on solitaire.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Zachtronics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":37337,"name":"Alone in the Dark (2008)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/068/0686934f91304843c9ad37ec55c3ac1d.jpg","description":"Alone in the Dark is a survival horror game developed by Eden Games and Hydravision Entertainment. It is the fifth installment in the series.\n\n###Plot\nThe paranormal activity investigator named Edward is escorted to the roof to be executed, but Edward's guard gets killed by an unknown force, and he escapes. The protagonist has amnesia and has no idea about what is going on. He roams through New York to find answers while it is invaded by a demonic force.\n\n###Gameplay\nThis installment's gameplay drastically differs from the previous games of the series. The whole game is divided into episodes with the player deciding which one of them to play. At the beginning of each episode, the main events of all previous ones are told to the player. \n\nIn Alone In The Dark, the players are free to choose from both first-person and third-person camera at any point during gameplay. The environment of the game plays a big part in the gameplay as the player can pick up any object and use it as a melee weapon. Such objects can also be used to break doors or get unreachable items.\n\nThe game also features a realistic fire model, so some items can be lit up in the fire. A crafting system is also present in the game. For example, the medical spray can be used to treat wounds, but if combined with a lighter, it becomes a flamethrower.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Atari","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"}]},{"id":17794,"name":"Betrayer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/830/8308df0cd9b070e63c13b4392b57d8a8.jpg","description":"Betrayer is a first-person horror game developed by Blackpowder Games. \n\n###Plot\nThe game is set in the 17th-century state of Virginia. The protagonist awakes on a shore with no memory of the events leading him here. He goes to Fort Henry which appears to be completely abandoned. The whole colony is actually abandoned, yet there are hostile beings whose bodies consist of burning embers. The protagonist goes on to seek answers about what actually happened in the colony.\n\n###Gameplay\nBetrayer heavily relies on stealth in its gameplay. There are no clear paths or objective for the players to follow. This was made specifically to deprive the players of any sense of direction and encourage exploration of a monochrome game world. It is essential to listen to specific sounds in the game, as some of them will guide the players towards a clue or an important item. The clues are documented and put in your inventory upon picking them up. \n\nUpon encountering the enemies, the best strategy for the player is to hide in the high grass, spectate the enemy movement and pick the right moment to execute a stealth kill. Sound plays an important role here too, as any sound the players make in the grass will attract some unwanted attention, so it is essential to time your movement with the wind gusts. The players have access to a wide variety of weapons, such as pistols, muskets, tomahawks, and bows. Upon death, the players leave all their items at the place of death and can retrieve them.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Blackpowder Games","platforms":[{"id":0,"name":"PC"}]},{"id":14968,"name":"AI War: Fleet Command","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a02/a0237f1c389317a94d876f6df9c20da0.jpg","description":"###Impulse\nA real-time strategy developed by independent developers from Arcen Games. The game first appeared on the public in 2009 on the developer's site and the Impulse site, and later appeared on Steam in version 2.0.\n\n###Interesting mix\nThe developers tried to combine in the game at once three genres: real-time strategy, tower defense, and 4X-strategy. Players and critics celebrated the unique gameplay but at the same time a fairly long process of learning the basics of the game. The main rivals of the players are two AI, the main goal - to destroy their planets. AI at the start has unfair advantages over the player, controlling the huge fleets of spacecraft. The game map usually consists of 10 to 120 star systems, its size greatly affects the game strategy necessary for victory.\n\n###Key features\nThe main feature of the game is the confrontation of players with artificial intelligence. According to the developers in AI War, this problem was solved: the local computer can think on three levels, adapt to the player's style of the opponent's game and surprise with illogical moves and attacks for the robot. DLC for the game, in addition to new units, maps and soundtrack, brought new types of artificial intelligence, victory over which becomes for players a kind of puzzle.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16702,"name":"Universe Sandbox","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18c/18c0bf89ecef8170cdd97075dbbadded.jpg","description":"Educational games came a long way, from solving simple math equations or spelling quizzes. Universe sandbox allows players to observe effects of gravity on a large scale. Players will be able to change the properties of any objects at any time, which is explained with built-in tutorials and step-by-step activities. All simulations are based on the real scientific data, physics, and units.\nPlayers are invited to experiment and see for themselves, to observe the slightest theoretical changes across 70+ different pre-made simulations, real or fictional. Universe Sandbox is designed and formed not only as an educational tool, where players can use all editing and creation tools to form their own simulations but as a demonstrative showcase. The game supports anaglyphic 3D glasses and 3D DLP televisions.\nIt invites imagination in the astrophysics, where players can add planets, moons, stars and even black holes to already existing systems, or player created ones.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Giant Army","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10898,"name":"Stories Untold","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/64a/64a7789943fe9f9d9c93f3a286ee7b20.jpg","description":"“Stories Untold” is a narrative-driven experimental adventure game, that bends the genre into something completely unique. Combining a mix of classic text-adventure, point-and-click and more, 4 short stories are packaged together into a single mysterious anthology that has been described as “a fantastic, fascinating example of interactive visual storytelling”  (Telegraph 5/5) and earning widespread critical acclaim since release.\nThe game pulls together 80s retro nostalgia, innovative and experimental genre-defying gameplay, and tense, phycological horror to create “one of the most fascinating and unique tales you can play this year” (GameSpew 9/10).\nThe first Episode “The House Abandon” is now available for free via a demo, to give you a glimpse of what is in store in the full game.\n“Stories Untold” was developed by No Code, a Glasgow based ex-AAA development team headed up by Jon McKellan (Alien: Isolation) and Omar Khan.\nFeatures:\n-\tFour unique stories, with their own settings, gameplay and mechanics.\n-\tPlay mind-bending text adventures, process radio transmissions and conduct experiments on bizarre artifacts\n-\tGorgeous retro-aesthetic brings back vivid memories, or a glimpse into what was.\n-\tSublime synth-wave horror soundtrack, inspired by 80s horror soundtracks.\n-\tAchievements to unlock, and narrative secrets to discover\n-\tGenre-hopping: from psychological horror, to tense mystery and terrifying sci-fi; Stories Untold is truly “4 stories, 1 nightmare”.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"No Code","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":51331,"name":"Valkyria Chronicles 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/549/5493ebb0e6002c765d2dc07e9488951a.jpg","description":"A Continent Engulfed in the Bitter Flames of War! Valkyria Chronicles 4 takes place in the same timeframe as the original Valkyria Chronicles, but focuses on Squad E of the Federation. Commander Claude Wallace and his childhood friends set out to fight for freedom in this desperate war, but bone-chilling blizzards, waves of imperial soldiers, and the godlike powers of the Valkyria stand between them and victory. The return of the BLiTZ Battle System and the CANVAS Graphic Engine! The Next Generation of the BLiTZ Battle System - The part overhead turn-based strategy, part RPG, and part real-time 3rd person shooter the “BLiTZ” battle system storms onto the battlefield. Fight the imperial threat with more units on bigger maps than ever before. An explosive new unit called the Grenadier and numerous options for both offensive and defensive battle support make their debut in Valkyria Chronicles 4. A Lush Watercolor World - The series’ signature hand-drawn visual style is back! Inspired by watercolor compositions, the CANVAS Graphics Engine blends visual elements of reality and imagination to create an expressive world filled with colorful emotions. Watch the journey of Squad E unfold like an interactive painting.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":19359,"name":"Heroes of Might and Magic V","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/518/5188c0493f5bddab33a1b1a54e36e608.jpg","description":"Heroes of Might & Magic V is a tactical turn-based strategy and a fifth part of the series and the first installment to utilize the 3D graphics.\r\n\r\n###Gameplay\r\nThe gameplay centers around The Heroes who are powerful leaders helping different fractions, forming guilds and fighting alongside with weaker characters against The Heroes of the opposing division.\r\nThe player controls the growth of his character — he may distribute the experience points between the abilities on the skill tree thus gaining new ultimate powers or racial skills. The core feature to the skills in the game is that every walkthrough forms a unique mix of race, skills and development issues embodied in The Hero. \r\nThere are six fractions to the game: Haven, Inferno, Necropolis, Dungeon, Sylvan, and Academy. The title feature one DLC and one standalone add-on content. They add two more fractions to the game: Fortress and Stronghold.\r\n\r\n###Plot\r\nThe gameplay depicted in the fifth part of the IP continues the line set in the third and the fourth chapters, the narrative, however, does not share such succession. None of The Heroes were transported into the new title with the adventures set in Ashan — the world created by Asha. \r\nThe story follows a line of tragic events during the battle between Asha and Urgash in which the former suffered collisions and merged with The Moon.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":16121,"name":"Waveform","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e9/5e996586e4fe42611462193cafbaa75e.jpg","description":"Waveform is a simple puzzle game in which the player controls the length and amplitude of a wave. The game is inspired by the particle physics and the wave-particle duality.\n\n###Style\nWaveform is set to the background of space, filled with stars and nebulas. Occasionally, a familiar planet such as Earth will appear in the background, indicating that we are traveling through the Solar system. The game is accompanied by the electronic ambient music score.\n\n###Gameplay\nThe wave of light under player's control has a shape of a sinus curve. It serves as a route for a particle that flies forward through space. On its way, it will encounter other photons of varying colors that the player has to collect to set a higher score. \n\nThe game has around 100 levels of varying difficulty. The player will encounter a number of level features that increase the complexity of the game as he or she progresses. The dark matter is an obstacle to avoid. Mirrors reflect the particle, making it bounce back on its way. Some obstacles may even eliminate the particle.\n\n###Controls\nThe player controls the wave with his or her mouse. Moving the mouse left or right changes the wavelength, while up and down movements influence the amplitude. The player has to adjust the wave to navigate the particle along the route. Increasing the amplitude will also speed up the particle as it moves up and down on the screen. Meanwhile, its horizontal speed stays the same, in full accordance with the Theory of relativity.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Eden Industries","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5196,"name":"Trine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c8b/c8b432deac2cf7934edd1f09467ae52e.jpg","description":"Trine is a puzzle game in the genre of platforming. The gameplay of this game is based on a full interaction of three characters, and without the unique ability of one or another, you will not be able to pass a specific level. \n\nThe action takes place in a fictional Kingdom, where three main characters will try to restore the balance after their great ruler passed away. Long battles ravaged the entire state, frightening and horrific times came for all the people.\n\nThroughout the game, you ought to solve puzzles and riddles of varying difficulty, using the unique skills of each of the three characters (Pontius the knight, Zoya the thief and Amadeus the wizard). The primary focus is made on their interaction with each other to surmount difficulties and obstacles.\n\nThe game has a unique cooperative mode. It means that players can join the game at any time they like. To overcome the obstructions that arise as the plot develops, players can combine their strengths and abilities, what significantly facilitates the passage of the game.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Frozenbyte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":2254,"name":"Icewind Dale: Enhanced Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/035/035a1358d597032b5c04c666c9247759.jpeg","description":"Evil stirs beneath the Spine of the World.\nIn the northernmost reaches of the Forgotten Realms lies the region of icy tundra known as Icewind Dale. Journey deep into the Spine of the World mountains, a harsh and unforgiving territory settled by only the hardiest folk. Encounter fearsome beasts that have learned the cunning and ferocity needed to survive among the snow-shrouded peaks. Confront an evil that schemes beneath the carven glaciers and mountainsides to wreak destruction upon the face of Faerûn. This is the world of Icewind Dale: Enhanced Edition.\nOriginally released in 2000, Icewind Dale is a Dungeons & Dragons game set in Wizards of The Coast's legendary Forgotten Realms. This Enhanced Edition allows players to experience the epic adventure on PC, Mac and Linux, and includes a host of new features:\nSwords and Sorcery: Discover dozens of new spells and items, including new magic armor and weapons.\nBlackguards and Wizard Slayers: Select from more than 30 new kits and classes to create the perfect adventuring party.\nA New Look: Experience the Enhanced Edition's all new interface, including the new Quickloot bar.\nBring A Friend: Join your fellow adventurers in cooperative, cross-platform multiplayer games.\nSee The Unseen: Explore quest content cut from the original game, now finished and restored.\nMore to Experience: Enjoy the countless bug fixes and improvements that await you in Icewind Dale: Enhanced Edition!\nIcewind Dale: Enhanced Edition includes both Heart of Winter and Trials of the Luremaster expansions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Black Isle Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":20315,"name":"Evoland 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f4/3f4b6c1605dd8a9ce0e5978240451ef0.jpg","description":"Evoland 2 is an indie role-playing game developed by Shiro Games. It is the second installment in the Evoland series.\n\n###Setting\nThe players travel through four time periods which differ in their historical setting. The art style of each period matches 8-bit graphics, Nintendo's Game Boy graphics, 16-bit graphics, and finally 3D graphics. You play as Kuro, who sets out to the past to change the fate of humanity and the outcome of a war between the powerful demons. Players change the past in order to affect the present.\n\n###Gameplay\nThe game is fairly linear, but it opens up at some point of the story. The fighting system of the game consists of both real-time fights and turn-based battles. The players are free to explore the in-game world from a bird's view perspective. It is possible to search for collectibles that are placed in secret areas around the game's levels. \n\nThe game pays tribute to numerous games. Most of these tributes are made during the game. While the main part of the game closely resembles the Legend of Zelda game series, the players will participate in a Street Fighter parody game or a sidequest mini-game that was inspired by Final Fantasy. \n\nThere is a lot of humor present in the game. Sometimes the main characters will make remarks on the events happening around them and comment on the gameplay saying that it reminds them of some game they know about.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":119,"name":"Kona","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ab/9ab4630464e41947a2cef77b2b6263dc.jpg","description":"Northern Canada, 1970. A strange blizzard ravages Atamipek Lake. Step into the shoes of a detective to explore the eerie village, investigate surreal events, and battle the elements to survive. Kona is a chilly, narrative-driven interactive tale you won't soon forget.\n\"Parabole has created a stunning game of duality, effortlessly blending survivalism with detective work and well-researched history with dying folklore.\"\n- Stephen Turner, Destructoid\n\"It’s tremendous at creating its distinct atmosphere and then drawing you deeper in. It’s witty, spooky, and achieves an ideal sense of urgency. Weird, clamant and intriguing, this is well worth a look.\"\n- John Walker, Rock, Paper, ShotgunSettingOctober 1970. W. Hamilton, a rich industrialist who owns a hunting manor in Northern Canada, reports several cases of vandalism perpetrated against his property. Unable to find out who dared to commit these acts, Hamilton calls Carl Faubert, a renowned private detective to handle the affair.\nIn Kona, Carl becomes trapped up in the deep north, engulfed in an unexpected snowstorm, and is unable to find his client —or any other living inhabitant for that matter. The player incarnated detective Faubert, who must shed light on the mysterious events befalling the area.Key Features Step into a surreal interactive tale of mystery and investigate the perplexing quietness in the entire town\nExplore a vast, frigid Northern environment and battle the elements to survive\nEnjoy the atmospheric soundtrack featuring music by Quebec folk band CuréLabel\nExperience the tale through the omniscient, third-person storyteller\nGo back in time with a vintage look and feel reminiscent of 1970s rural communities","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Deep Silver","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":13513,"name":"STEINS;GATE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c60/c60be8ddf91ede65c65b13eff2e06c37.jpg","description":"A new story in the critically-acclaimed STEINS;GATE series. From the depths of despair--explore a whole new world line. Your favorite characters return alongside a brand new cast!\r\n\r\nKey Features\r\nSTEINS;GATE 0 continues the time travelling theme - but adds artificial intelligence as its central hook \r\nHelp a group of young students bend time to their will and prevent the onset of World War 3 \r\nBeautiful artwork and engaging story for an unforgettable experience \r\nTells the story of an 'Alternate Worldline' - what happens if players failed the original story \r\nInteract with the story using your smart phone - answering (or not!) your phone, and your responses, will determine the outcome to the story","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"MAGES","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":12965,"name":"LISA","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ce/8cebeed933d324407ee4544c14a64ebf.jpg","description":"A game about survival, sacrifice, and perverts...\nLisa is a quirky side-scrolling RPG set in a post-apocalyptic wasteland. Beneath the charming and funny exterior is a world full of disgust and moral destruction. Players will learn what kind of person they are by being FORCED to make choices. These choices permanently effect the game play. If you want to save a party member from death, you will have to sacrifice the strength of your character. Whether it's taking a beating for them, or chopping off limbs, or some other inhuman way. You will learn that in this world being selfish and heartless is the only way to survive...\nFEATURES:\n- Visible character sacrifices that effect your stats (removing arms, eyes, scratches)\n- Recruiting 30+ new party members in towns and camps.\n- Ruthless choices that permanently effect towns, characters, life...\n- White knuckle shopping cart races.\n- Expending party members in Russian Roulette for huge profit, but perma-death if they lose.\n- Countless hidden secrets in the world for you to explore.\n- A life ruining gaming experience.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dingaling","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":683,"name":"Sonic & SEGA All-Stars Racing","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d5/4d558909512d99baeca227b50ff34595.jpg","description":"SONIC AND SEGA ALL-STARS RACE FOR VICTORY IN A HIGH SPEED HIGH SKILL RACETRACK SHOWDOWN!\nTAKE TO THE TRACK BY CAR, MONSTER TRUCK, BIKE AND EVEN AEROPLANE IN SONIC & SEGA ALL-STARS RACING.\nExplore stunning new circuits including Sonic Seaside Hill, Curien Mansion and Blizzard Castle as you zip around medieval castle ramparts, hurtle under lush rain forest canopies and tear through bustling city scapes in a frantic race to the finish line. Jostle against a selection of 20 challengers including Super Monkey Ball’s Ai Ai, Amigo from Samba and the evil Dr. Eggman in your unique character vehicle. Stay ahead of the pack by dodging traps and launching outrageous character moves such as the invincible Super Sonic, Banana Blitz assault of monkey balls or Tails wild Tornado - set to throw any vehicle clean in the air! But if you’ve been battered, beaten and broken, it’s not over yet! Super-charge your vehicle with power-ups to get back in the race and be sure to stay alert for the secret short-cuts that will give you the edge to victory.\nParty Racing Fun - Battle it out in single player, challenge your friends in 4 player split-screen for the ultimate track racing showdown!\nAll Your Favorite Racers - Choose from 20 different characters from the Sonic & SEGA universe including Sonic, Tails, Aiai and Amigo.\nHigh Velocity Vehicles - Every character drives their own unique vehicle including sports cars, bikes, planes and even a giant banana to perform bespoke special man-oeuvres!\nAll-Star Moves - Need to get by a competitor? Can’t overtake a racer? Then take them out with a pick-up weapon (missiles, mines and other obstacles) or one of the 20 unique character moves that allows the recipient to know who just hit them!\nStunning Visuals - Race over medieval castle ramparts, under lush rain forest canopies and through bustling city scapes as you battle through 27 challenging tracks from the Sonic and SEGA Universe.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sumo Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"}]},{"id":22900,"name":"John Romero's Daikatana","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c1f/c1fd8b15793743563367688b3dd5faa6.jpg","description":"Daikatana is a first-person shooter directed by id Software’s co-founder John Romero.  \n\n###Plot and setting \nThe game is divided into four episodes each of which takes place in a different location: 25th century Japan, Norway in early Medieval, ancient Greece and San Francisco in 2030. The story revolves around Daikatana, a mysterious sword crafted in medieval Japan that lets its wielder travel through the time. The plot follows Hiro Miyamoto, famed swordmaster from Japan of the future. He finds out that the current ruler of the world used Daikatana to alter the history and conquer the world by controlling the cure from a fatal disease that struck humanity in 2030. The hero now must go back in time to fix the story and take Daikatana from the hands of evil.  \n\n###Gameplay \nThe game consists of 24 levels. The gameplay shares many similarities with other first-person shooters in that era.\nYou have to complete a series of levels killing hordes of enemies and solving puzzles. In each of four episodes, you get new sets of weapons and new monsters to fight with. One of the most notable gameplay mechanics of Daikatana is that on the most level you have two sidekicks. The help you in battles, can wield different weapons and their health meter. If they die in a battle, the game is over. The player can issue seven commands to your companions such as attack, stay, get, come, back off, yes, no. \n\n###Game versions \nThe game got its Game Boy Color version the same year. It had drastically different gameplay more reminiscent of dungeon crawler and was only released in Europe.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Ion Storm","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"}]},{"id":20180,"name":"Assassin’s Creed Chronicles: China","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c5a/c5a362394197a5aa0cb8371a62154c8b.jpg","description":"Assassin’s Creed Chronicles: China is the part of the Chronicles series. It is the first installment out of three in total with the other games being dedicated to India and Russia.\n\n###Gameplay\nThe game is the two-dimensional platformer with the agile camera which can be tilted. Such titles are also called 2,5D platformers. The protagonist encounters waves of enemies, and the player chooses between the various weaponry to deal with them. There are also parkour elements: one climbs ledges, jumps onto wooden beams and uses ropes to travel around the levels.\nSubstantial attention is paid to the stealth mechanics. The protagonist can crawl behind the obstacles and take enemies down from a distance.  The Chronicles are in the way reminiscent to the original Prince of Persia series.\nThe game is composed of twelve episodes and takes place in China provinces like Na'an and Macau. \n\n###Plot\nThe game is the straight sequel of Assassin's Creed: Embers — the short film about Shao Jun — the disciple of Ezio Auditore who is the protagonist of the three previous Assassin's Creed chapters.  The setting is the XVI century China during the Ming Dynasty rule. After the training under the guidance of Ezio ended, Shao returned to China to fight the local Templar clan called  Eight Tigers.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":10313,"name":"Lost Castle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad9/ad9fe262d9379adbb3d65d6c2fd61c9f.jpg","description":"Lost Castle is a super cute, super hard action RPG with roguelike elements and randomized dungeons. Brimming with a host of hand drawn, humorous characters and environments that embrace retro action with modern twists.\nPrologue:\nIn its glory days, Castle Harwood was the heart of a happy land governed by wise and virtuous nobles. But those days are long gone now. Calamity has befallen these lands, and wicked magics corrupt the castle and all that surrounds it. Demons have claimed this rotten place for their domain and even the might of the empire is thwarted by their dark army... and slowly, the corruption is spreading. Castle Harwood is lost.\nYet at the heart of this nightmare, something bright glimmers and fills the hearts of the mighty with the courage needed to invade the castle. The Lost Castle is filled with the treasure of the defeated Earl and it is the promise of riches that calls you. And maybe you can do some good, too.\nKey Features:\nRandomly generated dungeons, items, enemies and bosses.\nHardcore retro action inspired by classic beat ‘em ups.\nGorgeous hand drawn characters and environments.\n80+ items and 50+ potions with useful, dangerous or hilarious effects.\n150+ weapons and more than 50+ sets of armor.\nMassive variety of skills and special attacks.\nSacrifice dead heroes to gain new abilities. .\nTwo players co-op.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hunter Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":2798,"name":"Pixel Piracy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4fa/4fa488b87616202e9c335b78c12b3aeb.jpg","description":"Pixel Piracy offers the player a role of a pirate captain. The game is designed in a very simplistic pixel-art style. Pixel Piracy plays with all sorts of jokes and comical stereotypes about pirates.\n\n###Setup\nBefore the game starts, the player has to choose the difficulty level and other options by answering questions about the game's world and its main character. Initially, the player only controls a single pirate, the would-be captain. The protagonist is partially customizable: the player can choose the character's look from several presets. As the game begins, the character has to build a ship and recruit a crew before they can set off to the sea. \n\n###Gameplay\nThe goal is to lead your crew to fame by defeating enemy pirates. Other than that, the player is free to explore the map, fight enemies to gain prestige points and upgrade the ship and the crew with new equipment. The pirates belong to various classes. A crew needs fighters to attack enemies, sailors to control the ship, a carpenter to fix it, and a cook to make food. \n\n###Genre\nWhile Pixel Piracy is more of a strategy, there are some features of the roguelike genre. The world is procedurally generated, and the crew will randomly encounter feral beasts and hostile pirates from other gangs. The player has to keep track of the ship's resources, otherwise, the crew might die of starvation or lose its morale. As in the most roguelike games, the death of the main character is permanent, and he will not respawn if killed.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"505 Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":1452,"name":"Phoenix Wright: Ace Attorney Trilogy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e5/3e55a40ff233aacf63f96ea80fcc7234.jpg","description":"Defend the innocent and save the day! Experience the original trilogy in clear, retina-quality HD graphics, and choose to play horizontally for larger backgrounds or vertically for one-handed ease!\n\"Phoenix Wright: Ace Attorney Trilogy HD\" includes \"Phoenix Wright: Ace Attorney\", Phoenix Wright: Ace Attorney - Justice For All\", and \"Phoenix Wright: Ace Attorney - Trials and Tribulations\". Each of these three games can be purchased separately or all together in one bundle.\nYou can even play the first two episodes of \"Phoenix Wright: Ace Attorney\" for free!\n◆Game Overview\nJoin rookie lawyer Phoenix Wright in his quest to defend the innocent and find the truth behind 14 exciting cases!\n・Investigation Sections\nPrepare for your epic courtroom showdowns by investigating crime scenes, collecting evidence, and questioning witnesses.\n・Courtroom Sections\nUse evidence and witness testimonies to your advantage as you battle to declare your clients innocent. Nothing less than a full acquittal will do in this court of law! Find the contradictions in witnesses' testimonies to expose the truth!\n*You can fast-forward through sections of dialogue by holding your finger on the \"Next Message\" button.\n*The games contained within are based on the critically acclaimed games for the Nintendo DS.\n◆Supported Devices and iOS\nRequires iOS 6.0 or later.\nCompatible devices:\niPhone 4S and later devices\niPad 2 and later devices\niPad mini 2 and later devices\niPod touch 4th generation and later devices\n*We cannot guarantee functionality on devices other than those listed above.\n◆Important Information\n*You cannot purchase individual episodes separately.\n◆More Games\nBe sure to check out what other games are available by searching for \"Capcom\" or your favorite game's title in the App Store. Follow us on twitter @Capcom_Unity for the inside info on upcoming iOS titles!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":5192,"name":"Oddworld: Abe's Exoddus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba5/ba5f0dd05f44cc48c918683764e3a125.jpg","description":"Oddworld: Abe's Exoddus is a spin-off installment of the Oddworld game series. It is a direct sequel to the Oddworld: Abe's Oddysee.\n\n###Setting\nThe game is set in the Oddworld, a planet in another dimension, ten times larger than our Earth. Among its inhabitants, there's the race of Mudokons, a species of spiritual humanoids who can control others' minds. Many Mudokons serve as the slaves to their more technically advanced enemies, Glukons. The protagonist is Abe, a blue-skinned Mudokon who escaped slavery and freed many of his compatriots.\n\n###Plot\nThe game begins right after the ending of Oddworld: Abe's Oddysee. Abe learns that the evil Glukons use Mudokons as slaves in the Necrum Mines. The protagonist sets off on a quest to liberate the slaves. There, he discovers that Glukons' popular drink called Soulstorm Brew is brewed from the bones and tears of the enslaved Mudokons. Abe's goal is to destroy the Soulstorm Brewery and to set his people free. The ending depends on the number of Mudokons the player saved.\n\n###Gameplay\nOddworld combines platforming with puzzles. Its levels consist of sections that occupy one screen each and require the player to overcome puzzles to move on. Abe cannot fight his enemies, but he can use his spiritual powers to defeat them, save Mudokons and advance through the levels. Abe's abilities include mind control, interacting with fellow Mudokons and limited telekinesis. To save Mudokons, Abe has to comfort them if they're angry or depressed. If he doesn't, they can harm others or themselves.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":295018,"name":"Spellbreak","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/737/73727793e477ebf228ecd389f1301fee.jpg","description":"Spellbreak is a new battle royale RPG featuring epic magic combat. Weave spectacular spell combinations and craft strategic builds in your quest for survival.\n\nSpellbreak is in Closed Alpha! That means we're actively developing it. New content, balancing, bug fixes, and more are rolled out often and we want your help to make it the best game it can be!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Proletariat","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":9986,"name":"HELLION","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/075/075821dd94d00f221128bc04851a304f.jpg","description":"Hellion is a first person multiplayer space survival game.\nIt is a fusion of survival and space simulation genres that pits players against the deadly environment and one another. Survive in the harsh conditions of space and scavenge for air, fuel and other items necessary for survival. But keep in mind, you are not the only one out there. There are others, but will they help, or will they throw you to the void without a second thought? Remember, no matter how brutal space may seem, it cannot hold a candle to man.\nHellion is a solar system several thousand lightyears from Earth. Despite its distance, it is the target of the first interstellar colonization mission during the 23rd century. Almost a million colonists, suspended in cryogenic hibernation, leave Sol on a journey that would take many decades.\nHowever, when they wake up, almost a century later, they find themselves trapped inside a nightmare. Instead of living in a manmade paradise, they are forced to fight for survival surrounded by deserted stations, incomplete orbital habitats and derelict warships.\nWith the closest rescue operation decades away, orbital economy in disarray and no authorities in sight, many turn to scavenging, stealing and outright violence. Few others try to live more civilized and begin uncovering the truth behind the largest disaster in human history.\nHellion is an ambitious project. It is an immersive world set in a solar system many lightyears from the comforts of Earth and is entirely based on the laws of Newtonian physics.\nHellion will make its debut as an Early Access game. EA version represents the basics of the vision behind this dark world. As our community grows and the player base expands, the game will evolve beyond these confines and become a true space survival that we can all enjoy. Open and honest communication between developers and community is the cornerstone of this idea. We are always open for discussion with our players as we believe that each and every one of us can add something to this project. Join us in the dystopian future that is Hellion and let’s build this world together!\nBelow is a comprehensive list of features planned for Hellion’s early access. Most of these are already in the game, some of them will undergo modification and improvement while others will be implemented during the course of Early Access (features marked as completed are the ones that will be present from the start and possibly modified and improved upon, based on community feedback)…\nSpace based on real physics\nExplore a persistent solar system where all in-game objects from planets and moons to ships and stations abide by Newtonian Physics and full Orbital Mechanics. A seamless world you can immerse yourself in without interruptions. No instances or loading screens.\nRealistic scale solar system (completed)Newtonian Physics (completed)Orbital mechanics (completed)Seamless transitions (completed)Persistent universe (completed)Immersive sound (completed)\nExperience sound that changes according to your environment, from the deathly silence of hard vacuum to the deafening roar of the ship’s engine room.\nFind a way to survive in the most hostile environment known to man and learn how to protect yourself from vacuum, decompression, extreme temperatures and radiation.\nVacuum and decompression (completed)Temperature (work in progress)Radiation (work in progress)Salvaging\nFind and repurpose abandoned station modules and ships for personal use, or strip them for parts to fix and upgrade your existing equipment.\nParts (completed)Resources (completed)Station modules (completed)Ships (work in progress)Resource gathering\nGrab a suit and your mining gear and EVA over to the nearby asteroid or fly your ship into the upper layers of a gas giant in order to harvest raw resources that can be refined into fuel, air and crafting components.\nAsteroid EVA mining (completed)Refining (completed)Asteroid Ship mining (work in progress)Gas giant harvesting (work in progress)Detailed crafting system\nStop relying on salvage and set up your own crafting facility. Create custom parts, weapons and other equipment to help you better survive in the hostile world of Hellion.\nParts (work in progress)Weapons (work in progress)Equipment (work in progress)\nPiloting\nTake command of your ship and explore the deserted system of Hellion using realistic navigation and scanning mechanics. Learn how to exploit orbital mechanics and balance using RCS, main thrusters and warp.\nPiloting and Navigation (completed)Scanning (completed)Different propulsion systems (completed)EVA (completed)\nExchange the safety of your ship for a thrilling EVA experience as you explore the ruins of mankind’s first interstellar colony in search of intel, resources and equipment. Experience the unique feel of zero gravity movement without restrictions and master the use of inertia for maximum benefits.\nModular ships, stations and gear\nFully modular and customizable ships, stations and equipment. Build a base from salvaged modules and customize it to your liking. Refit a salvaged vessel with additional modules and equipment according to your playstyle.\nBase building (completed)Ship modification (work in progress)Equipment (work in progress)Complex ship to ship combat\nDetailed space combat with subsystem targeting, complex damage propagation and last second repairs.\nShip to ship combat (work in progress)Subsystem targeting and destruction (work in progress)Damage propagation (work in progress)Damage control mechanics (work in progress)Electronic warfare (work in progress)Complex maintenance\nLearn to maintain and resupply your ship, station and equipment or watch as everything you’ve worked hard to build falls apart around you.\nComplex resource management (completed)Stations (completed)Ships (completed)Equipment (work in progress)\nPvP\nEngage in a thrilling close quarters combat with other survivors and use environment to your advantage. Team up with other players for protection or build a crew of cutthroats and lead a boarding party to raid others.\nClose quarters combat (completed)Boarding (completed)Hacking and security (work in progress)Realistic wound mechanics (work in progress)Suite damage and degradation (work in progress)Unrestricted multiplayer interaction (completed)\nPlay as a lone wolf, team up with others or stab them in the back for personal gain. The choice is yours.Multi-crew ships (completed)\nBring your friends along for the ride, divide roles and form a competent crew.Realistic communications\nProximity chat, short and long range radio transmissions and FTL communication mechanics. Hail other ships, broadcast distress calls and eavesdrop on unsecure channels.\nVoice chat (work in progress)Radio mechanics (work in progress)FTL communications (work in progress)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zero Gravity","platforms":[{"id":0,"name":"PC"}]},{"id":58975,"name":"Lovecraft's Untold Stories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19a/19a4c2d394a80b423e84900d982df420.jpg","description":"TIMELINE\nAbout the GameLovecraft’s Untold Stories is an action RPG with rogue-like elements. You explore randomly generated levels based in H.P. Lovecraft stories, fighting cultists and all kinds of monsters from the Mythos, improving your skills, weapons, and gear, looking for clues and information about the Old Ones and the Outer Gods, and solving puzzles and challenges.\nA HORROR ADVENTURE\nYou have to find a way to foil the Old Ones’ plans—but the path is yours to choose, and brute force may not be the best solution. Will you search for clues and information to stop the cultists before they summon the Outer Gods, or will you just kill everything in your way, until there’s no one left to invoke the cosmic horrors to our world?\nLIVE H.P. LOVECRAFT’S STORIES\nLevels are randomly generated: It will be a different experience every time you play. Lovecraft’s Untold Stories is based on H.P. Lovecraft’s stories: You will experience first-hand the cosmic horror created by the genius of Providence. Look for items and clues to unlock secrets and new stories!\n5 DIFFERENT CHARACTERS\nYou can play as 5 different characters, each with a different playstyle. A private detective, a witch, a thief, a professor, and even a ghoul—each with different stats, weapons, and combat moves, creating five entirely different gameplay experiences.\nMADNESS AND DEATH\nThe truth of the dark horrors that inhabit the universe is unbearable for any human mind. As you learn more of the Mythos, you become more powerful—but also brings you closer to the brink of madness. You will need to find a balance to keep your sanity—but in the end, you can’t win against the Old Ones. Madness or death await you. But maybe you can delay the inevitable…\nKEY FEATURES\nFight more than 50 different monsters from the Cthulhu Mythos in this intense action RPG\nExplore Lovecraft’s stories in 12 different randomly generated levels and face the Great Old Ones in 5 special levels\nChoose your own path: Will you look for clues and information to uncover the truth, or just fight your way out?\nPick your hero: Choose between 5 different characters, detective, the thief, the professor, the witch, and the ghoul, each with their own stats and skills.\nImprove your skills to become more powerful, but be careful: Madness awaits those who learn too much!\nCollect and improve more than 30 weapons and hundreds of items and artifacts\nLook for clues and special items to unlock secrets and new stories\nNOTE: The Early Access version currently includes the following:\n5 levels\n2 characters (1 of them unlockable)\n1 big boss","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Blini Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":16776,"name":"Dungeonland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/604/604da4b50bbbcb569c1267c73d421dc2.jpg","description":"The game was released in 2013 in a free-to-play format. Developed by the Brazilian Critical Studio. Dungeonland is a multiplayer hack/slash game with an isometric camera and a bet on co-passing. The game is missing the plot, the only thing that connects the levels is a typical visual style, setting, and characters. The game is set in a theme park.\n\nYou can play the game solo, and with friends. Competitive multiplayer is not here, but there is the opportunity to play the role of Dungeon Maestro and build obstacles for other players, creating obstacles from the vast exploding frogs and killer rabbits.\n\nThe publisher of the game was the Swedish Paradox Interactive, which had plans to turn IP into a franchise. In April 2018, the developers announced on Steam, that the contract on the server hosting for the multiplayer matches would not be renewed. The game was also removed from the store, leaving the opportunity to play alone or using the capabilities of the LAN for all users that had already bought the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Critical Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11815,"name":"Crawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d6/2d6d0078f12398f40c059be58ab3e300.jpg","description":"Crawl is 2D rogue-like game with beat em’ up elements and heavy emphasis on local multiplayer.\n\n###Gameplay \nIn Crawl, up to four players or bots explore randomly generated dungeons. One player controls the hero while the other three are spirits.\nThe goal of each run is to reach the exit, slay the final boss and escape from the dungeon. However, the only hero can do that. Killing hero as a spirit swaps roles and makes you hero giving you a chance to win.\nThe spirits cannot attack directly but can possess monsters in traps scattered throughout the dungeon. The monsters differ in strength, health, speed, attacks, and abilities. Each player can advance by leveling up and getting new gear. Leveling up increases your stats and unlock new attacks and abilities. Spirits can also level up unlocking new monsters and objects to possess. The weapons and magical items can be found in the dungeon or bought from merchants. There are 25 types of weapons in the game that vary in stats and attack types.\nAdditionally, each weapon can have one of 27 properties that can affect weapons damage, attack speed, give a chance to perform an elemental strike, or shot projectile. The maximum level in the game is ten after which the hero can face the dungeon boss. Other players must kill the hero by cooperatively controlling parts of the boss.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Powerhoof","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11264,"name":"NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 Full Burst","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0df/0df4aff421976b2a84d840faefb04124.jpg","description":"The 4th Great Ninja War continues.\nNARUTO SHIPPUDEN Ultimate Ninja STORM 3 has been given a thorough overhaul for its FULL BURST comeback! Not least among the wealth of enhancements is the addition of the feverishly anticipated chapter in which Sasuke and Itachi take on Kabuto in a nail-biting confrontation. Ultimate Ninja STORM 3 has been remastered in HD.Key FeaturesAbsolutely Epic storyline: Wage the 4th Great Ninja War in the most epic NARUTO game ever\nExtreme Immersion: Confront overpowering bosses including the gargantuan Tailed Beasts in memorable battles defying time and death\nGameplay Excellence:  Discover NARUTO Storm ultra dynamic ninja confrontations with the series most extensive roster including the highly anticipated Naruto (Tailed Beast mode), Madara or the Jinchurikis.\n…and Beyond! (Full Burst New Content)\nAdditional Chapter: Finally free of Kabuto’s control, Itachi intends to crack the Reanimation forbidden technique. Will an unprecedented Uchiha alliance with Sasuke be enough to handle it?\nNew playable character: Kabuto reaches the almighty Sage mode and is now playable in versus mode. Unleash his power and defeat your opponents both offline and online.\nDirector’s Cut:  Discover completely revamped Storm 3 cinematics and experience the epic conflict consuming the entire ninja world more intensely that ever.\n100 New Missions: Embark on a whole new series of missions, many with their own uniquely challenging objectives.\n38 Additional Costumes: Outfit characters in a selection of 38 costumes from the NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 DLC packs.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":12890,"name":"Stronghold Crusader 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21a/21a0dacefc6b20dc81c8aad0625eb9a8.jpg","description":"Stronghold Crusader II is the fifth game in Stronghold series of medieval strategies. It is the direct sequel to the 2002 spin-off of the series, Stronghold: Crusader. \n\n###Background\nStronghold Crusader II is set in the Middle East in the era of Crusades. The game's two campaign modes follow the two sides in the Crusades: the Crusaders and the Muslims. The game features historical figures like Saladin and Richard of England, as well as the characters from earlier games in the series, such as Rat and Wolf.\n\n###Gameplay\nThe game is similar to all Stronghold games. The player assumes the role of a medieval lord who controls his castle. The player has to build the walls and towers, hire the knights and archers, and establish a productive medieval economy to support the war effort. Most missions involve a siege of a castle, with the player as the attacker, the defender, or both.\n\n###Economy\nEverything in Stronghold, from the food to the war, requires the player to establish a chain of production, such as a mill and a bakery to make bread. The player has to produce armor and weapons before hiring most types of units. There's also a reputation meter that tracks what the people think of their lord. The player can increase his or her reputation by offering the people more food, lowering taxes, or building pubs and churches.\n\n###Multiplayer\nStronghold Crusader II has several multiplayer modes. It was the first game in the series to introduce a cooperative mode that allows two players to control the same castle.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":3955,"name":"Zeno Clash 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fa/3fa41498f81741b063b5e8c653090186.jpg","description":"Zeno Clash II is a fantasy action game that combines multiple genres. Like its predecessor, Zeno Clash (2009), it uses the first-person view.\n\n###Plot\nThe setting of Zeno Clash II is a weird fantasy world called Zenozoik. The main protagonist of the original game, Ghat, makes a return. His companion Deadra, however, is replaced by Ghat's sister Rimat, who was one of his opponents in the previous game. The two siblings put their differences aside to team up against a new villain: a golem called Kax-Teh. Years ago, Ghat brought this creature with him to Zenozoik, and now the golem became too powerful for Ghat to tolerate.\n\n###Gameplay\nThe game features an unusual combination of role-playing, fighting and beat 'em up elements. The player controls Ghat, accompanied by AI-controlled Rimat, and leads him through a series of battles. The gameplay mostly consists of hand-to-hand fights, though the player can occasionally use weapons. Zeno Clash II has a unique combat system in which the amount of damage depends on which body part was hit. All battle movements cost stamina that has to be replenished. The RPG element allows the characters to improve their skills and abilities as they progress through the game. They can also find and equip new items. \n\n###Modes\nZeno Clash II introduced a new cooperative multiplayer mode, in which the second player assumes the role of Rimat. There are also the Arena modes, which allow the players to fight each other or a series of AI-controlled opponents.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"ACE Team","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":47351,"name":"Batman: The Enemy Within","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/34e/34ecf9a17fbd9344b0bd8f044ca3f277.jpg","description":"In this latest chapter from the award-winning studio behind Batman - The Telltale Series, both Bruce Wayne and Batman will be forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigate uneasy alliances while Bruce Wayne undertakes a perilous series of deceptions. Which of Batman’s new allies will you choose to trust? And how deep into the darkness will you let Bruce descend?\r\nIncludes Episode 1 of a 5 part series in this brand new season from the award-winning studio, Telltale Games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"}]},{"id":18703,"name":"The Guild II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa4/fa48cb5604f319e7ca2c8fe00ed92a1d_eYGbcOJ.jpg","description":"This is a historical real-time strategy in which the player will create their dynasty of merchants in medieval Europe. This is the second game in the series.\n\nGerman developers tried to mix the economic strategy with a life simulation. The game begins in 1400, in the same era as the previous game. The game uses the historical regions of Swabia, at the River Neckar and in the valley near the Odenwald in modern Germany. The player creates a character, which becomes the founder of the dynasty. Also, the player chooses a profession that determines the further gameplay. There are four such professions: Patron, Craftsman, Scholar, and Rogue. In addition to singleplayer in the game, there is also a multiplayer that is not available in the Steam version.\n\nThe game has four modes: Extinction, Dynasty, Mission and Time Limit. All of them can be fine-tuned with difficulty settings and other variables. Also in the game has a simulation of the economy, based on the models of supply and demand.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"4Head Studios","platforms":[{"id":0,"name":"PC"}]}]