[{"id":15173,"name":"Fall of Civilization","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/021/021b74aa0dd1df4d09868195340cd912.jpg","description":"Control a faction of people that survived the world ending events which left most the world scarred and barren.Features\nResources are scarce and must be used wisely if you want to stay one step ahead of other factions.\nUsing Provisions, Building Supplies and Ammo as the currency of the new world.\nDesign your base of operations for your faction and develop it how you want.\nWith random personalities, factions can treat you or eachother differently from game to game.*\nCustomize your units to suit different tasks in your society and become unstoppable.StoryThe world is shaken and ravaged over wars for resources.\nLeaving the surviving inhabitants left to pick up the pieces and try to rebuild their world.\nMost of the worlds resources are now scattered or gone, so its up to you to find, make or steal some.\nMore of the story can be found through journal entries, discovered by your units in their explorations.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Luke Dodds","platforms":[{"id":0,"name":"PC"}]},{"id":12592,"name":"Haydee","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c60/c60705b791a1cf8c1160246b3cf10a9f.jpg","description":"\"Haydee\" is a hardcore old-style metroidvania mixed with modern-day third person shooter and platformer mechanics. You will controll Haydee - half-human, half-robot character in search of her way out of strange artificial complex full of traps, pain and depression. No casual stuff awaits you. There is no \"X to win\". Your gun, your instincts and your logic are your only friends. Don't drop your guard, conserve ammo and collect items on this long journey. Be vigilant, be sharp, be ready.\nBe good.\nBe Haydee.Key featuresSix gameplay sections. 160 rooms.\nNo regeneration. Use medkits.\nNo checkpoints. Use save stations and diskettes.\nAll items are hidden. Explore.\nLimited inventory. Manage.\nChallenging gameplay. You will fail. A lot.\nNo handholding. Act on your own.\nThis game won’t tire to kill you. Be persistent.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Haydee Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":12034,"name":"Street Warriors Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc0/cc0ec8cb990362d85cd52e1ed31af1d6.jpg","description":"This is the first, realistic PvP brawling game for up to 8 vs 8 players with original, dynamic combat system and fast, round based battles.\nCreate and develop Your character while earning new skills and items that helps You beat Your opponents.\nGather Your friends and fight together in a clan.\nCompete with players from around the world using hand-to-hand combat.\nNo shooting or magic but a hail of swift blows of kicks and punches !\nEasy, one-click matchmaking finds the best suitable battle for Your character.\nUse dynamic combat system with intuitive action keys.\nIn Street Warriors Online You can dynamically attack or block incoming attacks as opposed to mmo games.\nYou can provide standard, special or sprint attacks that causes different hit reactions of Your enemies.\nTake part in battles up to 8 vs 8 participants in 3 different game modes.\nFight on many battle arenas of different player capacities ( 2v2, 4v4, 8v8 )\nSelect one of 3 game modes:\n- Skirmish: Beat up all enemies to win a round. Win three rounds to win the battle !\n- Conquest: Capture bases by spraying over Your team's graffiti. Captured base generates points. Reach points limit to win.\n- Capture The Bag: Capture the bag and deliver it to Your van. Reach bags limit to win the battle.\nGain experience and respect to develop Your characters.\nEach finished battle gives You Experience as well as Respect Points reward.\nThe reward is proportional to Your involvement in the battle.\nRespect points is Your primary currency. Buy different items such as clothes, power cards or new attacks.\nLevel Up to obtain attribute points and develop character to match Your play style.\nHigher levels unlocks new items and attacks !\nConfigure appearance and combat style to make Your characters become unique !\nCompose Your appearance from over 150 clothing parts of 7 categories per character class.\nPrepare preferable attack sequence ( rotation ) that suits Your combat tactics.\nSpend Your attribute points to achieve best fighting results.\nBuy and socket different Power Cards that alters Your combat skills.\nOwn up to 8 characters with different class and attributes build.\nGet new characters for golden currency or from the golden premium bundle.\nThere are 3 different character classes to choose from: Swarmer, Slugger and Bruiser\nSwarmer is a female class with extended speed and energy regeneration\nBruiser is a slow heavy fighter with increased damage and health\nSlugger is the most balanced class\nUse elements of the environment as weapons to gain temporary advantage.\nOn almost every arena You can find different items that can be used as weapons.\nYou can throw heavy objects like garbage bins or tires to hit many enemies at once and make them fall.\nThere are also objects like baseball bats, pipes and planks that You can use as one handed weapons.\nThrow bricks, stones and bottles at Your enemies to stun them and make vulnerable to Your attacks.\nUse energy drinks to scramble out from critical situations or get temporary power-up.\nThere are 8 different energy drinks so far.\nYou can take 2 different drinks on a battle and trigger them when desired.\nIf You have more drinks of a kind - drink will be available again after You re-spawn.\nTeam up with Your friends and play together !\nPlay together with Your friends in up to 8-person group on free for all battles.\nYou can create and customize Your unique clan of warriors and fight against others to climb up in the global rankings !\nHigher clan ranking enables all members to buy special, unique rewards.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crazy Rocks Studios","platforms":[{"id":0,"name":"PC"}]},{"id":8665,"name":"Gabriel Knight: Sins of the Fathers 20th Anniversary Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc9/cc9b4345e5675485a8b0190e0bbea699.jpeg","description":"Experience one of adventure gaming’s most stunning masterpieces all over again in this blockbuster retelling of the award-winning 1993 murder-mystery, which adds all-new puzzles, scenes, and HD graphics!\nBlending the best of yesterday and today, it re-imagines the 1993 original, voted one of the greatest games of all time, for an entirely new generation of fans. As struggling author and bookstore owner Gabriel Knight, players will investigate a series of savage ritual killings in New Orleans and their connection to voodoo’s sinister mysteries.\nThe deeper you dive into master storyteller Jane Jensen’s tale of terror and suspense, the closer you’ll come to discovering the secrets of Gabriel’s family history–and unfolding his destiny.Key Features:Relive one of gaming’s greatest adventures of all-time: Adventure Gamers' 20 Best Adventure Games, Computer Gaming World's Adventure Game of the Year 1994, and Honorable Mention in The A.V. Club's Top 100 Games of All-Time\nExperience the award-winning voodoo murder-mystery in stunning high-res 3D\nAdds new puzzles and scenes to familiar challenges\nIncludes remastered soundtrack by original composer Robert Holmes\nEnjoy special extras and bonus edition content, including original concept art, behind-the-scenes extras, exclusive new interviews and more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phoenix Online Studios","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":5160,"name":"Assassin's Creed: Bloodlines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/071/0711f22aeaf7927ccd071b186743ca5e.jpg","description":"For the first time, become a Master Assassin on the PSP® (PlayStation®Portable) system with Assassin's Creed: Bloodlines™. Follow the story of Altair immediately following the events of Assassin’s Creed® and track down the last of the Templars who have fled the Holy Land and retreated to the Island of Cyprus.\n-\tUse Altair's signature moves against intuitive enemies\n-\tFree-run and climb everywhere in a stunning open-world environment\n-\tUnlock and share exclusive content when you connect your PSP® system to Assassin's Creed™ II on PS3™\n© 2009 Ubisoft Entertainment. All Rights Reserved. Assassin's Creed, Ubisoft, Ubi.com, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2013 Ubisoft Entertainment. All Rights Reserved. Assassin’s Creed, and Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ubisoft","platforms":[{"id":0,"name":"PSP"}]},{"id":5145,"name":"Fortix","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1cf/1cf4bc00dc468b94b323d8a11a4860de.jpg","description":"Can you reclaim your ancestors’ land? Evil forces have taken over the once fertile land of Fortiana. You are the only one who can storm the castles and claw it back from the hordes of dragons.\nExperience a new type of strategy and arcade game. Fence off parts of the battlefield to corner your enemies. Collect catapults and power-ups to besiege the fortresses and take on dragons. But beware! As you progress through the levels it gets harder and harder. The fortresses become much larger and the monsters more vicious. Can you emerge victorious and reclaim the land of your ancestors? You are knight Fortix, the sole hope for the desolate and tortured land of Fortiana to become the fertile land that it was before.\n\nKey features:\nNew, yet familiar gameplay\nFantasy setting\n22 levels of increasing difficulty\nFamily-friendly / no violence\nSimple controls suitable for all ages\nEasy-to-learn, hard-to-master\nLikeable, cartoon-like characters\nOn-line high score chart","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nemesys Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":3593,"name":"NHL 15","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47e/47e6da4bda689e3acdf78b481c215d82.jpg","description":"Built to harness the power of the next generation console – NHL® 15 brings to life the sights, sounds and feel of real NHL action like never before. Every player is affected by real-world physics leading to multiplayer collisions and pileups through 12 Player NHL Collision Physics. NHL 15 welcomes Mike ‘Doc’ Emrick, Eddie Olczyk and analyst Ray Ferraro providing insight through revolutionary real life visuals all presented in an authentic NBC Sports Broadcast Package. This is the next generation of Hockey.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-4 players\nNetwork Players 2-2\nDUALSHOCK®4\n720p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2014 Electronic Arts Inc. All Rights Reserved.  All trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":231,"name":"Loot Rascals","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a5/1a5f176f373dd716541ed2a0e6de778a.jpg","description":"Only you can rescue Big Barry - your huge robot head pal - from a space theme park that’s been invaded by a tentacled pan-dimensional godbeast.\nExplore an alien planet, beat a menagerie of strange baddies and win Loot Cards which give you special abilities. Choosing which to equip requires strategic thinking - the way you lay them out is crucial, and some must be sacrificed because cards are also the precious resources you need to heal and use powerful abilities.\nCareful though because baddies can loot you! The cards they steal drop into other players’ games. When you defeat an Elite Baddie you’ll get another player’s card: will you return it or keep it for yourself?\nEither way, prepare for a visit from that player's Holographic Helper to shower you with thanks or terrible vengeance - Loot Rascals is a tale of friendship, loss, and redemption!\nEvery game is different in this procedurally generated roguelike: gather Loot Cards, show the Thing Below who’s boss, and fly Big Barry to victory!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hollow Ponds","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":802455,"name":"Monster Hunter Rise: Sunbreak Demo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8af/8af41c8288bd582c18644801064541fc.jpg","description":"Monster Hunter Rise & Sunbreakhttps://store.steampowered.com/app/1880360/Monster_Hunter_Rise_Sunbreak/\nhttps://store.steampowered.com/app/1446780/MONSTER_HUNTER_RISE/\nAbout the GameGet a taste of the single-player and multiplayer action of Monster Hunter Rise and its massive expansion Monster Hunter Rise: Sunbreak in this demo, which includes seven quests, from training quests where you can learn how to use each weapon to a series of monster hunting quests at different difficulty levels.\nExperience new Sunbreak features as you taken on Great Izuchi, Tetranadon, Astalos and Malzeno!\nNote: The content of this demo may differ in some respects from the full game.\n- About Monster Hunter Rise\nHunt a variety of never-before-seen monsters and enjoy new gameplay features like the Wirebug and new Palamute buddy.\n- About Monster Hunter Rise: Sunbreak (expansion)\nThe world of Monster Hunter Rise gets bigger and deeper with this massive expansion where brand-new monsters and locales await.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Capcom","platforms":[{"id":0,"name":"PC"}]},{"id":647625,"name":"Car Mechanic Simulator 2021","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74a/74ae7748e2d93fc5f9ac68f5d5fef282.jpg","description":"Check out more gameshttps://store.steampowered.com/app/1078760/Motorcycle_Mechanic_Simulator_2021/\nhttps://store.steampowered.com/app/1088770/Car_Mechanic_Simulator_VR/\nhttps://store.steampowered.com/app/407130/Tank_Mechanic_Simulator/\nMore VR simulatorshttps://store.steampowered.com/app/1019550/Thief_Simulator_VR/\nhttps://store.steampowered.com/app/1358140/Cooking_Simulator_VR/\nAbout the Gamehttps://store.steampowered.com/app/1433570/Car_Detailing_Simulator/\nCar Mechanic Simulator 2021 is new production with a well-established player base. Start as a fresh owner of a car garage and work your way to a service empire. Get your hands dirty in a super-realistic simulation game that has incredibly realistic detail. Get ready to work on 4000+ unique parts and over 72 cars. Roll up your sleeves and immerse yourself in a crazy-real garage environment.\nExpand your range of services by investing in a new work space and equipment. Repair, fix, test, paint, tune and rebuild cars. Pay a visit to a new Auction house and buy cars in various conditions. If you feel lucky you can give it a crack in the barn. Some of them might have hidden gems – if you can find them.\nAn infinitely generated number of orders will keep you busy for a while. If you’re up for a  bigger challenger – try putting yourself to the test in specially-crafted story missions. Each mission offers a unique set of requirements and challenges that you’ll have to face.\nWhen you are done upgrading your workshop it’s time for a project car. Save up some money and buy your own ride and make it pristine. From the rusty shell of a car to a top vehicle in perfect condition. Time to get those hands dirty with lots of engine grease!\nProduct features\n72 Cars to fix\nOver 4000 unique parts\nAn infinite number of randomly-generated orders\nCar Auctions\nBarn finds\nJunkyard hunts\nHandcrafted story missions\nSkills and garage upgrade system\nCar tuning\nEndless gameplay\nRace track with time trial\nNew to Car Mechanic Simulator 2021\nCar Fluids\nCar Wash with new grime-removing machines\nSpacious open plan garage\nNew damage type for body parts - dent\nPaintable mechanical car parts\nNew engine sounds\nMinigames\nBrake lathe tool\nQuality upgrade system\nFuseboxes\nNew Parking System\nSalvage Auctions\nRevised part-examine mode\nVisual customization body parts\nCar Configurator\nRusted bolts","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Red Dot Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":377842,"name":"Rebel Inc: Escalation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed9/ed96010d79926c967c79d9f0eb832e79.jpg","description":"From the creator of 'Plague Inc: Evolved' comes a unique and deeply engaging political/military strategic simulation.\nIn Rebel Inc: Escalation, the war is ‘over’ - but we all know that doesn't mean anything. To stabilise the country, you need to balance military and civilian priorities to win the hearts and minds of the people, whilst also stopping insurgents from seizing power!\nFollowing on from the global mega hit  'Plague Inc.' with over 130 million players, Rebel Inc: Escalation offers a deeply engaging, strategic challenge inspired by the complexities and consequences of modern counter insurgency. It has received acclaim from international development experts and was even featured at a major international peace conference!\nRebel Inc: Escalation combines the original critically acclaimed gameplay with significant, all-new features and improved 3D graphics for PC, with loads more still to come, including a campaign, multiplayer and Steam workshop support,\n5 regions to stabilise - Deploy to wildly different strategic environments, from the gentle farms of ‘Saffron Fields’, to the impenetrable forests of ‘Distant Steppe’.\n6 unique governors - Each one with radical new abilities to master. Choose the ‘Economist’ to receive an entire year’s income in one go or the ‘Warlord’ to train a personal militia.\nHyper-realistic - Inspired by Afghanistan, the simulation is highly detailed, containing real world development initiatives and an innovative representation of counter insurgency tactics. It has been praised by the World Bank and was even featured at a major international peace conference\nAdvanced civilian and military AI - Sophisticated narrative algorithms model the needs of local populations, while deadly insurgent attacks put constant pressure on your operation.\nGorgeous Graphics - Stabilise a beautifully rendered 3D world that responds to your actions and thrives as you provide jobs and services. Drone cams and civilian TV channels bring your operation to life and show you what's happening on the ground.\nClear Intelligence - Plan priorities with Intelligence Reports and Combat SITREPs, geek out with loads of new stats and graphs, and analyse your best strategies with end-of-game replays.\nComing during Early Access\nMore Regions and Governors -  Rebuild a vast dam to prevent catastrophic floods in Azure Dam, deploy heavy tanks with the Tank Commander and more...\nCampaign Mode - Conduct large-scale operations across multiple regions. Carefully manage resources and choose unique upgrades in a persistent world with all new conditions and threats.\nCo-Op and VS Multiplayer - team up to efficiently stabilise the region with friends or compete in the shadows to promote your own cause.\nCustom Scenario Creator - Develop your own custom scenarios and share them with other players via Steam Workshop. Who said Nation Building was hard?\nAnd much more - including daily challenges, speed runs and Mega-Brutal difficulty. Plus loads of new maps, governors and scenarios in future (free!) updatesAn important note:Although a fictional game, Rebel Inc. looks at important real world issues and we have made every effort to deal with them sensitively. The game has been extensively researched and has been developed in cooperation with leading regional politicians, business people and journalists as well as international charities, experts and governments.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Ndemic Creations","platforms":[{"id":0,"name":"PC"}]},{"id":62657,"name":"Bloodroots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31d/31d35d576b224dffa49d5a903e8b87ca.jpg","description":"Betrayed by his partners and left for dead, Mr.Wolf is hell-bent on enacting his revenge - alone, and vastly outnumbered.\nThankfully for Mr.Wolf, in Bloodroots the world is your weapon. In this relentless action game, you’ll choreograph spectacular, ultra-violent combos by making use of everything around you, from hatchets, to ladders, to...carrots? It’s improvise or die, as Mr.Wolf fights his way to the center of the mystery: why was he betrayed?\nA world overflowing with tons of unique tools that not only change the way you fight, but how you get around\nImprovise the most deadly combos and compete for fame on worldwide leaderboards\nFight your way through a variety of hand-crafted levels, from forests to mountaintops\nExperience a twisted Western revenge tale with a deranged cast of characters","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Paper Cult","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":62351,"name":"A Fisherman's Tale","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66f/66f03973d5ac448828faf69e83ec5604.jpg","description":"A Fisherman's Tale\nBend and twist reality in A Fisherman's Tale, the mind-bending VR puzzle adventure game in which being turned upside down and inside out is not merely a play on words.\nPlaying as Bob, a tiny fisherman puppet, you live alone in your tiny cabin, oblivious to the world outside. When your radio broadcasts a storm alert, you have to get to the top of the lighthouse and turn on the light! But as you try to leave your cabin with the help of some uncanny sidekicks, you realize what's waiting outside is not at all what you expected...\nBreak more than a couple laws of physics in mind-bending VR puzzles!\nMake it to the top of the lighthouse before The Big Storm, with the help of some uncanny sidekicks!\nUse your hands to pick up, throw, combine, and use all kinds of things in glorious fully immersive virtual reality!\nToy around with your tiny little model lighthouse, inside a lighthouse, inside a... is that another lighthouse?\nUncover the truth at the core of an unusually tall Fisherman's Tale, exclusively in VR.\nBrought to you by Vertigo Games, the team behind Arizona Sunshine and Skyworld, A Fisherman's Tale is developed by INNERSPACE VR in co-production with ARTE France with the support of CNC, Ville de Paris New Media Fund and BPI France.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Vertigo Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":42302,"name":"BioShock Infinite: Burial at Sea - Episode One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/275/2750f588e6f2dfb6b7df8900dad74365.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Irrational Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":26042,"name":"Guitar Hero 5","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df4/df432fc88f85c10526b3f2c53ef7cc9a.jpg","description":"Jump In/Jump Out of songs like you have never been able to do before in\nany Guitar Hero game with Party Play Mode. Shred with 4 guitars or any\ncombination of instruments, you choose. New RockFest mode tests your\nskills with 4 players locally, or up to 8 players online in games like\nMomentum, Do-or-Die,\n\nPerfectionist, Elimination, and Streakers. Import your Guitar Hero World\nTour Downloadable Content straight into Guitar Hero 5. Mii Freestyle\nmakes it easy to create songs on the fly and record, edit, and share\nyour own videos showing off your Mii.\n\nPlay Roadie Battle with your Nintendo DS - connect one or two DS systems\nto your Wii to play as a ‘roadie.’ Sabotage your opponents’ equipment\nand fix your own band’s gear to save the show.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":18547,"name":"Dragon's Prophet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fd/7fd74567ac02a20a07880c2b4d6acead.jpg","description":"From the creators of Runes of Magic, Dragon's Prophet is a free to play fantasy MMO that transports you to the breathtaking world of Auratia, a realm where dragons fill the sky. For thousands of years, the epic wars between ancient dragons have threatened to plunge Auratia into chaos. Now, an even greater danger has emerged that threatens the very existence of the realm. Explore the vast land as you attempt to CAPTURE, TRAIN, RIDE, AND FIGHT hundreds of unique dragons!\nIn a world shaped by dragon-kind, hundreds of unique dragons roam the lands. CAPTURE, TRAIN, RIDE, and FIGHT them in order to unlock their unique skills and abilities.\nDragon’s Prophet uses a unique auto-target and combo system that immerses players in visceral battles and action gameplay. This system gives players a higher degree of control, and a wider range of tactical options than traditional MMOs.\nPlayers are transported to the breathtaking world of Auratia, which is filled with amazingly detailed landscapes. Mysteries, challenges and monsters await players as they fight not just for their own survival, but for the survival of the entire realm.\nPlayers will choose from four distinct player classes to begin their journey into Auratia. Whether they prefer to get in close, shoot an arrow into a dragon’s eye, or blast an entire group of goblins with ranged DPS, there is a class for every player.\nThe dragons a player captures will shape their character and, ultimately, their fate. Will you be a legendary fighter? Can you capture and train a dragon that will stand alongside you in the heat of battle? Capturing the right dragons is the difference between life and death!\nEnter the world of Auratia for free and immerse yourself in the world where Dragons abound. Obtain loot through gameplay or enter the marketplace to make purchases with Diamonds.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Runewaker","platforms":[{"id":0,"name":"PC"}]},{"id":16900,"name":"It came from space, and ate our brains","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05e/05eaf7572fd7b33cc5019e1bc1641c59.jpg","description":"‘It came from space, and ate our brains’ is an Arcade top down shooter with horde survival gameplay in a unique atmospheric setting with addicting gameplay elements, which all can be played cooperatively.\nYou are a no-nonsense kind of guy equipped with a flashlight and a weapon. You somehow managed to survive the invasion of a merciless alien species, the kind that feeds on human brains. Things look bad when you wander the city and other locations, there is chaos everywhere! You are looking for gear and weapons to survive, as pink light emitting aliens try to corner you and eat your brain. You realize there is only one thing left to do: set a new high score and die like a badass.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Triangle Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15303,"name":"Heaven Forest - VR MMO","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/322/32228d15c82a02a899654331ec4770d9.jpg","description":"What is the meaning of life?\nWhere are we heading for and why?\nIt seems like an absurd and pretentious notion. Yet deep inside us these are the questions we ask.\nThis game aims to give the player a series of hidden clues in its world in order to lead him to ponder.\nYou're not alone in your journey, in fact the spirits you see in the forest are real players exploring the game with you.\nThe VR device is not required in order to play the game.\nVIVE and Oculus are the supported devices you can use._______\nYou will discover that the answer to many of life's most profound questions is right within you.\nAre we just complicated collections of matter moving in patterns\nand obeying to impersonal laws of physics? Or are we part of a great and significant plan?\nWe ofter feel connected to the universe in some way that trascends the merely physical, whether it's the sense of awe when\nwe contemplate the sea or the sky, or the love we feel when we're close to someone we care about.\nYou might feel insignificant in the vastness of the cosmos, and perhaps you become alienated by thinking that your atoms\nobey to impersonal laws of physics, but all in all you are personally creating the world at every moment, just by looking at it.\nIs there a plan designed by a superior being? Or is it all casual?\nWe don't know exactly how the universe began, or if it's the only universe.\nWe don't know the ultimate laws of physics. We don't know how life began or how consciousness arose.\nSince our mind is limited and conditioned, our eyes see only a fraction of reality.\nKnowledge, like most other things in life, is never perfect.\nThe problem is that our observations could well be mistaken.\nSo, are we sure that the world we perceive with our senses is all there is? Or is there something else?\nIs there something beyond the physical?\nOur most direct and tangible connection to the world around us is through our senses. Though sight and touch we come to understand.\nBut there are times when we experience reality at a deeper level, without the intermediation of our senses. How are we to account for such experiences?\nEveryone has his own story and his own vision about life and it changes over time,\nbut we are all connected to the whole universe.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4774,"name":"Hard Corps: Uprising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80c/80c7173a1731e4eeac88510eee50ead0.jpg","description":"Thrilling retro run-and-gun action is back with a vengeance in Hard Corps: Uprising, a new 2D side scroller developed by ARC System Works that pays homage to classic Konami action series. Play as the soldier Bahamut as he begins to write his legend. Battle in the grueling trenches of Arcade mode or the all-new RISING mode, where a life bar and point system allow you to purchase items and upgrades to build your soldier up and achieve ultimate victory. Need help? Partner with a friend to lay down some serious carnage.\n2010 Konami Digital Entertainment KONAMI is a registered trademark of KONAMI CORPORATION.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3227,"name":"TorqueL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f63/f63fd91b3ff6d49304e8e8a3d6f2d033.jpg","description":"TorqueL is a unique 2D \"rolling\" & \"extend\" platformer/action/puzzle game.\nIncluding total 50 chambers, 7 basic routes, and 1 secret route.\nInteractive music of product version composed by sanodg(Nobuyoshi Sano).\nRecommended playing with Xbox 360 gamepad.\n*Win10 + Xbox One Controller problems was fixed on Anniversary Update by pre-install driver renewed.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ACTIVE GAMING MEDIA","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":804768,"name":"The Looker","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2d/a2d8e8e0bbcdf4da11b524c849657d1e.jpg","description":"Explore several charmed locations on a mysterious island replete with over 55 creative puzzles. Over an approximately two-hour playing duration, you will face unique challenges, ponderous ideas, and feebly amusing in-jokes.\n\nThe Looker is a single-player game that respects you as an intelligent player, and it treats your time as... reasonably valuable (I mean, don't let me pull you off solving the Riemann hypothesis or anything). As such, I will level with you here—not every joke will be a hit, but there is no filler material, the puzzles are fun, and, if you really think about it, aren't the real solutions the, uhh... friends we make along the way?","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Subcreation Studio","platforms":[{"id":0,"name":"PC"}]},{"id":409543,"name":"Mýrdalssandur, Iceland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7f/f7f120cb62c7bdc27c5b4fc78bef3731.jpg","description":"( DLC is required for VR compatibility )\nhttps://store.steampowered.com/app/1098490/Explore_Fushimi_Inari/\nInspired by Iceland's unique landscape and colours I sought out to make a realistically inspired exploration experience set on iceland's southern coast. The game is a short immersive walk though an expansive section of land with moss, glacial rivers, foggy grasslands, waterfalls and scenic vistas. Use the game's camera to observe and interact with the world around you while listening to an immersive curated soundtrack. Your attentiveness and eagerness to explore will be rewarded with access to hidden areas, areas that will be easily missed by a rushed player.\nI've been able to utilise some great new technology in Unreal Engine 4 and some high-fidelity photoscanned models from Quixel to try and push the visuals in this game as much as I could. I hope you are able to dive into this game without much context and just enjoy being immersed in the world. Thanks for playing and for your support !","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"caves rd","platforms":[{"id":0,"name":"PC"}]},{"id":269354,"name":"Cell to Singularity - Evolution Never Ends","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d1/2d172942e69e92c5e0cc58dbdd189e6e.jpg","description":"Tap into the extraordinary tale of evolution in this cosmic clicker game.\nOnce upon a time, over 4.5 billion years ago, there was no life in the Solar System. And then, almost in the blink of an eye on the geologic time scale, everything changed. Deep in the primordial soup of Earth lay the organic compounds that would give rise to life’s humble origins. All it takes for this epic evolution game to unfold is you.\nTurn to the next page of evolution with every click. Gain entropy to unlock the next chapter of the evolution of life. Uncover the twists and turns that led to the great milestones of evolution: the extinction of the dinosaurs, the discovery of fire, the Industrial Revolution, and more. See chapters that have yet to be written -- a future evolution beyond the modern day.\nThe epic story of evolution, technology, and humanity is yours to tap. It’s a breathtaking evolution game!\nThe most accurate human evolution game on Earth!\n- Countless hours of addictive--but very informative--clicker gameplay\n- With every tap, earn Entropy--the evolutionary currency for life in the universe\n- Simple, intuitive controls--click anywhere to gather Entropy for new animal Evolutions!\n- Climb civilizations' Tech Tree by spending Ideas on countless scientific and technology upgrades\n- It’s a science game about the development of life on Earth. View the fruits of evolution in beautiful 3D habitats. Unlock animals like Fish, Lizards, Mammals, Monkeys.\n- Unlock the future of evolution and the mystery of the technological singularity.\n- Discover and learn scientific facts about evolution of life and natural history as you play\n- Enter a space odyssey into speculative science fiction as you click past modern civilization\n- Get into a life creation mood thanks to an epic soundtrack of classical music\n- Upgrade the evolution of a single cell organism into a civilization on the brink of a technological singularity\n- Simulate the science of life on earth.\n- Upgrade tech to Survive on Mars and Terraform Mars\nA science evolution game where you upgrade life, from a Single-Cell organism, to multi-celled organisms, fish, reptiles, mammals, monkeys, humans and beyond. Play the evolution of Life on Earth, all its past, present and future. Will humanity survive the next phase of evolution?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"AwesomeGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":34772,"name":"Painkiller","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/371/371b7450bc7c31307474372939198866.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"People Can Fly","platforms":[{"id":0,"name":"PC"}]},{"id":23522,"name":"UBERMOSH Vol.5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f3/4f3a6b1d7231374df515de436fb492c4.jpg","description":"UBERMOSH is a fast-paced arcade series that started in 2015 and was shaped by the amazing community's feedback each new volume. The 5th volume shows the Blade Saint 1200 years after the events of the first game with a set of new powers and more aggressive antagonists.\nDouble your physical strikes, combo the Melter/Shield with the Brainclap and Manastrike of the previous volumes, fight smarter versions of the classic foes and go Hardboiled for a visceral reflex polish.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Walter Machado","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20467,"name":"Foreign Legion: Multi Massacre","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/554/55464879bb76b8529e4b16fa08fed21e.jpg","description":"Now With Zombie Mode:After having a fun and merry undescribed time in the woods, the legionnaires need a Helicopter ride home. They discover a creepy cabin in the woods(TM) and decide to call a helicopter. Whilst summoning the helicopter, they accidentally summoned the evil forces of hell as well! Fend of hordes of zombies while keeping the generator running, powering the lights and the signal to the helicopter. It wouldn't be a FL map without our signature humour so expect some unusual zombies, crazy environments, a ton of destructables, easter eggs and buckets of GORE. Who can get the highest body count?\nAbout the GameForeign Legion: Multi Massacre is the (far too) long awaited follow up to Buckets of Blood. Now you can continue the cartoon-style third person battle online and battle your friends, enemies or even frenemies across 6 maps and various modes. Reduce the never-ending army of a non-descriptive country to a bloody, meaty pulp (with extra zest!) as legionnaires of an even less described country.\nSo what are you waiting for, get ready to make mince meat of other players, battle endless forces, determine the biologic equation, host a nice pick nick or swim in the ocean.\nKey Features:\nBattle waves of enemy AI with the 4 player co-op or go head to head up to 8 players in the team deathmatch or domination mode.\n6 map mix of classic BoB action and brand new environments.\nSteam achievements like the assclown where all your friends can see that you spent time honking your clown nose 500 frigging times.\nOwn Foreign LegionBuckets of Blood? Sync your steam cloud save and import your progression into the game!\nUsing the steam friends system, you can easily invite your friends to a not so friendly game or use the open lobby system to insult and play with other players you will never meet.\nDJ TRILT soundtrack featuring new and remixed songs of the original game.\nPC and Mac can play together or fight to determine which is the better OS\n18+ game and we made sure to get that rating. So expect everything you might expect with a rating like that ;)","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sakari Indie & GriN","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20095,"name":"eXceed 2nd - Vampire REX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53c/53c67ce7390b98cbebe1b14bb9fec305.jpg","description":"The human powers-that-be called for the purification of mankind and the eradication of vampires and ‘deviants bloodlines’ - those born of a mix of human and vampire. And so began massive purges of the deviants that were reminiscent of the 'witch hunts' of centuries earlier. Leading the genocide was the exorcist corps the 'Gun Bullet Children'.\nAs the overwhelmingly large human armies began to obliterate every vampire and deviant community across the world, the opposing deviant armies sought to gather allies and rally back.  Ria File is a half-human, half-vampire girl fighting on the side of the deviants as they embark upon a turnaround strategy, the 'Siege on the Holy Land'. Their plan: to lay siege upon the humans’ 'Holy Land' and to destroy the Holy Lady Anhel who was the source of the human military power. This is a battle in which defeat is an option for neither army.\nFeaturing an addictive dual-polarity gameplay system, this amazing vertical shmup is sure to please any shooter fan. The polarity and color of your character can be changed to absorb enemy bullets of the same polarity while charging the special weapon in the process and doing double damage to enemies of the opposite polarity. Every bullet absorbed charges your special weapon for total destruction. With awesome music, beautiful art, and challenging stages, this game that put the eXceed series on the map and has everything you would want from a shmup.Key Features:Dual-polarity gameplay system\n8 frenetic stages\nDynamic difficult balancing, depending on the player’s skill\nChain bonus scoring system\nCutscene-driven story-telling","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Tennen-sozai","platforms":[{"id":0,"name":"PC"}]},{"id":15665,"name":"Master of Orion 1","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58d/58dfa058d855130408e1a3a4b7419fa7.jpg","description":"Forge an empire in a universe where population growth is stripping away planetary resources. Colonize unknown planets and trade with other races for their knowledge.\nThe need for galactic expansion is critical. You must conquer alien star systems to secure the resources that will guarantee your supremacy. The ultimate goal is to defeat the evil Antarans. They lurk in the coldest reaches of space, warmed by one all-consuming passion... Revenge!\nOne of the best 4X games ever created\nAbsolutely addictive gameplay with a powerful \"just one more turn\" factor\nTactical ship combat, galaxy-spanning strategy, 60 technology fields, advanced diplomacy and much more","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"SimTex","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3034,"name":"WARRIORS OROCHI 3 Ultimate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c93/c93b6722c7dcf1ac6d237c1fd3ae3847.jpg","description":"The WARRIORS OROCHI series is a series of tactical action games in which heroes from the DYNASTY WARRIORS and SAMURAI WARRIORS franchises work together in an effort to defeat Orochi, the Serpent King. The latest title in the series, WARRIORS OROCHI 3, features over 120 playable characters, who can be played freely in three-character teams. Themes of loyalty, betrayal, friendship and love are explored in the human drama created as these heroes clash on the field of battle.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"KOEI TECMO America","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":776267,"name":"Viewfinder","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bee/beeefcd4af46510aec135d098d03bf72.jpg","description":"Viewfinder is a game developed by Robot Turtle where you can reshape the world around you by taking photos with an instant camera.\n\nIt’s a first person adventure game where you can bring pictures to life, incorporating them into the environment. You can find photos, paintings, drawings and other images around the game world, or create them yourself using the camera.\n\nThe game is set within a virtual environment inspired by brutalism, solarpunk and retrofuturism, creating surreal and dreamlike landscapes.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Sad Owl Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":618732,"name":"Shredders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/33a/33ae2d5494b41bd5703dee6bd185b270.jpg","description":"You and your pal are making goofball snowboarding videos at the Frozen Wood resort when brand ambassador Lisa makes an offer for a couple of sponsored videos. She gives you a glimpse of a whole new world of snowboarding, professional riders, snowmobiles, and epic features to shred. An invitational has attracted a whole bunch of pro-riders to the area, and with Lisa’s help you have a chance to meet some of them, learn a bunch of their moves, and possibly even get a chance to join them in the kick ass invitational!\n\n\n\nA love letter to snowboarding, Shredders takes inspiration from a whole bunch of awesome snowboarding films, the Amped games from back in the day, and the snowboarding heroes on Instagram.\n\n\nFeatures\nHuge unlockable OPEN WORLD: The horizon is full of amazing lines, features, and gorgeous scenery, and the snow is always fresh!\nShred with a top selection of PRO RIDERS: With their real voices and stories, this is as real snowboarding as it gets.\nMaster DIVERSE LOCATIONS: Shredders is for powder fanatics and park rats, for urban street snowboarders and backcountry explorers. All areas are inspired by snowboarding movies and optimized for maximum fun.\nRide with your unique STYLE: No snowboarding game has ever been created with this level of control. Every move feels amazing from gorgeous spins with Jamie Anderson, to lawn darts with Sebbe De Buck, and knuckle huck tricks with Marcus Kleveland.\nSTORY MODE: With the help of your pal Scotty you’ll meet pros, learn their moves and shine!\nPlay online and SHRED TOGETHER with friends: With multiplayer built into its core, you’ll be hitting the top spots with your buddies. Let’s drop!\nLIFELIKE ANIMATIONS inspired by pro boarders: Snowboarding has never been this fluid. Feel the flow!\nStacks of snowboarding brands and REAL EQUIPMENT: Fresh real-world gear has been carefully digitized and prepped for you in Shredders. You’re guaranteed to look good.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Foam Punch","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":60247,"name":"Devil's Hunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b44/b44a123bf79b08f73aea2d64dff57407.jpg","description":"Based on original novel by Paweł Leśniak “Equilibrium”, this third-person action game resurrects the everlasting fight between light and darkness, good and evil, as full-fledged war between Angels and Demons seems imminent and our world is the proposed battleground. You are Desmond, the sole factor that can tilt the scales in favor of one of the opposing party, be it demons or angels. One man now has the power to decide the fate of humanity and the world as we know it.\nOnce a bon vivant son of a rich entrepreneur, Desmond’s life has been steered into a sequence of unfortunate events that led him to lose most of his humanity. Gaining demonic powers and becoming the hell’s executor, he struggles to find a place for himself in the ongoing war. He is both the destroyer and the savior, as his human part is gradually stepping out of the shade of his hunger for vengeance. He fights fiercely with his fists and claws, making use of the skills both his demonic and human sides offer. Passing through the gates of hell and back, he will eventually have to decide where his place is.Features\nDive into the story – captivating storyline based on an original novel\nEnjoy the narrative – almost 100 high-quality cutscenes of up to 2 hours’ duration\nChange forms – humans and demons both have useful skills\nFight like a demon – TPP melee combat with large variety of attacks, combos and enemies\nExplore – rich, context sensitive environment interactions","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Layopi Games","platforms":[{"id":0,"name":"PC"}]},{"id":24138,"name":"Metroid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5fe/5fe62882f1af83e36480ded84c49b984.jpg","description":"The first installment of the immensely successful Metroid series\nintroduces us to the hideous title creatures and the slick, cybernetic\nbounty hunter Samus Aran. As Samus™, your mission is to penetrate the\nspace pirates' home planet, Zebes, and keep them from destroying the\ngalaxy with the dangerous life forms known as Metroids. Metroid has all\nthe high-tech weaponry, creepy tunnels and crawly alien creatures that\nanyone could ask for. With its deep and complex game play, excellent\nmusic and a rare sense of setting, it establishes a frightening ambience\nthat will haunt and entertain you for a very long time.\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1986,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"NES"}]},{"id":21727,"name":"Glowfish","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c8/1c885f0a21af9b14803413b6c09cb62f.jpg","description":"The evil Dr. Urchin has kidnapped Coralline!  It’s up to Glowfish to free his lady friend and sea pals everywhere from his clutches in this underwater platform adventure.\nBeware—while you scour the ocean floor in search of lost friends waiting for rescue, a host of enemies is lurking!  Each level takes you deeper in the unique ocean world with new challenges and enemies at every turn.  Gather your friends to make Glowfish bigger and better at challenging the boss on each level.  Set the captive friends free by surrounding Glowfish with a powerful circle of friends, or circle the enemy to fire your blasting bubbles and win the battle.\nAdd to your team by collecting powerful Super Chums to help you along the way, and upgrade them by collecting coins to give you even more of an edge in each boss battle!  Dive in and be prepared to be dazzled in Glowfish.\nKey Features:\t\t\t\t\t\t50 A-Maze-ing platform adventure levels\nUnlock all 8 Super Chums\nCollect coins to upgrade your Super Chums to prepare for each Boss Battle!\n25 Steam Achievements","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"MumboJumbo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19589,"name":"Railroad Tycoon II Platinum","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a94/a944b515db10ac6427c4180c92d6dbe9.jpg","description":"Includes Railroad Tycoon II and the expansion The Second Century\nIt can take you from New York to South Africa. It can take you from the year 1804 to the year 2000. It can take you from penniless manual laborer to powerful multi-millionaire.\nIt can take you from a normal, well-adjusted, well-rounded person to an obsessed, singled-minded, one-tracked train head. This is a real railroad game, not just a strategy game that happens to involve railroads. If you want to hop on a plane, car or ship, hop on another game.\nThis game is about trains for people who love trains. Everything about the game is centered around an authentic look and feeling of the railways. Period video and pictures are interlaced with the game. The design and interface are true to the character of the fabled late 1800's railroads. A.I. opponents are based on real people. And all maps are real (based on satellite photography from US Geological Service and other sources).","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"PopTop","platforms":[{"id":0,"name":"PC"}]},{"id":19571,"name":"RoboBlitz","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c63/c63e1c2e51086dcf4ada688e5b639445.jpg","description":"RoboBlitz™ is a humorous, physics-based action game full of inventive gizmos, weapons, characters, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates.\n19 levels of puzzle-solving and high-intensity action, set in 7 unique environments\nHumorous characters and unique weapons\nGameplay entirely driven by physics\nAdvanced robot simulation and control theory\nPowered by Unreal® Engine 3","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Naked Sky Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":19282,"name":"American Conquest: Fight Back","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a19/a197e07085c516793bdd8113b1a8fd3b.jpg","description":"Three centuries of war continue - with even more frantic combat and more desperate power struggles raging across the American continent. The Spanish sound the attack on Yucatan amidst fierce Maya and Aztec resistance. The Germans put all their efforts into finding the legendary Eldorado. The Pontiac Uprising ends in a terrifying bloodbath between Native Americans and the British. And the Russians will do anything to conquer Alaska at the cost of the Haida.\n\nThere is a fantastic bonus for shrewd strategists: the great new \"battlefield\" mode in single-player and multiplayer modes! Tactical skill alone will determine victory or defeat in single-player and multiplayer games. So, plunge into battle!\nKey features:\n\nEpic real-time strategy covering the era between 1517 and 1804\nNew mode of gameplay: 10 battlefield missions in single and multiplayer modes for hard-core strategists\n5 new nations: Germany, Russia, Haida (coastal Alaskan natives), Netherlands, Portugal\nStand alone, original American Conquest not required to play\n26 new missions in 8 thrilling campaigns, including the Search for El Dorado, Pontiac's War and the Conquest of Alaska\nNew single player missions\nCaptivating real-time battles with up to 16,000 units\nTactical formations for infantry, cavalry and artillery\nMorale influenced by victories, defeats, food supplies, equipment and mercenary pay\nMore than 50 new units\nSeveral multiplayer modes for up to 7 players via LAN or the Internet","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":17497,"name":"Epic Clicker Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a19/a19fdbeedd6efe5f107eb619dd157ddc.jpg","description":"Experience your epic journey. Discover 20 mysterious lands and face the monsters living out there. Gather items and go through training that will allow you to develop your character and increase effectiveness in battle. Force defeated monsters to help you during the mission. Meet the bravest warriors and together conquer the most dangerous lands. Show that you are persistent traveler and held your adventure, even in the toughest conditions.\nMysterious lands\n20 lands are ready to be discovered, each of them has its own unique rules. Expect inexplicable phenomena on a daily basis.  It is not everything! Specific environment, weather conditions and exceptionally mild pH of the soil is truly made to promote evil -  that is why traversing across the lands is so dangerous. Be careful, scary monsters are to be found at every step. But…what cannot be done to save the world!\nHorrifying Monsters\nIn each of the lands you will encounter powerful opponents. Do not hesitate to use all available means. Fight bravely to get the treasure that is closely guarded by enemies.\nMarvelous Equipment\nBecome the gallant warrior. Collect gold and buy awesome upgrades to your weapons, armor or shield and build your frightening appearance among your enemies.\nEpic Loot\nDo not miss out on the chance to find legendary items and use it against your enemies. Some of them are magical, others more mundane, but surely all worth checking out.\nMultiplayer\nCountless legends came to exist in fog-shrouded lands.  They have origin in the bloodiest and most terrifying monsters. Before embarking on your journey, be sure to gather your team.  Remember, united we stand, divided we fall!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PlayWay","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":16632,"name":"Two Digits","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e6/8e61419c9fdba15f8ed5c35e7a7c423b.jpg","description":"Simple, minimalist and difficult. Two Digits is a perfect blend between insanity and happiness.\nThe objective is simple. You are given 9 numbers less than 100, and all you have to do is to choose two subsets with the same sum.\nJust try it. See how difficult it is!\nFeatures\n250 puzzles, 11 level sets\nRandom mode, generate your own levels\nBeautiful, calm UI\nSteam Achievements","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cleverweek","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16574,"name":"Stellar Impact","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13f/13fca533d9e054d9b4d8b99c94e651fa.jpg","description":"In space, war rages between allies and axis forces.\nIn Stellar Impact you command a space battleship in intense tactical multi-player battles! You can choose between several ship classes--from the fast corvette to the heavy dreadnought. Make your own skills template according to your preferences: attack, defense, speed, maneuverability or reconnaissance. Upgrade your spaceship, its crew and the weapons system to get stronger and crush your enemies in various game modes.\nJoin the fight now!Key featuresInnovative gameplay based on maneuvers and positioning\nA deep tactical and strategic content\nUp to 12 players in a single battle\n2 factions with a strong graphical identity\n5 unique spaceship classes\nFind the best combinations of skills for your ship to eliminate your opponents and support your allies\n13 battle maps and various game modes\nTons of equipment and weapons to loot\nManage the experience of your crew members to acquire new talents\nAuto-matching will send you into battle with other players of the same skill level","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]}]