[{"id":51333,"name":"Yoshi's Crafted World","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/56d/56df082b7182fef977d22482b5dfd648.jpg","description":"Yoshi's Crafted World is the eleventh game in the Yoshi franchise and the eighth installment of the main series. It follows Yoshi, a cartoonish green dinosaur that first appeared in the Mario games. This is the first Yoshi game to be made for Nintendo Switch. The game is the sequel to Yoshi's Woolly World that was developed by the same team. It features the similar “hand-crafted” visual style that makes Yoshi look like he's made of plush.\n\n###Gameplay\nThe player controls Yoshi in a pseudo-3D environment, side-scrolling forward. The available path is highlighted by a yellow line. Yoshi walks through several stages that include African forest with giraffe platforms, a desert full of dinosaur skulls, a night town, a factory, and a food level. The protagonist can defeat enemies by eating them or throwing them away. Traditional Yoshi enemies like Shy Guys, Koopa Troopas and Piranha Plants appear in Crafted World.\n\nWhile all objects in the game are 3D, the player cannot explore the third dimension. However, the game offers an innovative mechanic that allows the player to flip the camera around. This helps the player to see the game from the opposite perspective so that the objects wouldn't cover the view.\n\n###Multiplayer\nYoshi's Crafted World includes a multiplayer option that allows two players to control two Yoshis.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Good-Feel","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":50796,"name":"Dreams","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ba/9ba104d61c6a70a73352fcbee3b4a9b5.jpg","description":"Dream anything, play everything\r\n\r\nCreate, play and share your own games and experiences, in the incredible new title from the LittleBigPlanet and Tearaway team.\r\n\r\nDreams is an extraordinary open-ended experience where you can make anything, from interactive adventures and platformers, to shoot ‘em ups, puzzlers and more. The possibilities are endless.\r\n\r\nWhatever you create you can then share with a massive online community, where you can also browse other players' creations, remix them, or use their items, environments and characters in your own games.\r\n\r\nNot sure where to start? Explore the action and adventure of Dreams’ story mode, where you play through three engaging tales, in a dazzling showcase of what is possible with the game's powerful creation tools.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Media Molecule","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":49909,"name":"Hellbound","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a1/1a11917f2d5d0dea21918aaf13598495.jpg","description":"GAMEPLAY\nHellbound is a First Person Shooter game in the vein of the classics DOOM, Quake, Duke Nukem 3D, Blood and many others.\nIt's GROTESQUE! Focused in action, speed and gore.\nIn the current version Survival Mode you fight against hordes of enemies in a small island until you're done.\nSTORY\nYou're a huge-ass mother-f*cker killing demons in Hell.\nThat's it...\nActually, there's a story. But we're not revealing it yet.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Saibot Studios","platforms":[{"id":0,"name":"PC"}]},{"id":46153,"name":"Super Meat Boy Forever","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfd/cfd1a22d99761c68ff40fa3484b5d72c.jpg","description":"Meat Boy and Bandage Girl have grown as a couple since 2010. It seems like only yesterday the two love birds were escaping from an exploding laboratory in the sky. Now it’s the current year, and they’ve welcomed their daughter Nugget into the world. Their peaceful days enjoying life as a family came to an abrupt end when Dr. Fetus beat the snot out of them with a rusty shovel, and kidnapped Nugget! Now it’s up to Meat Boy and Bandage Girl to rescue their daughter from a lunatic fetus in a jar that can only be described as an incel version of Tony Stark.\nSuper Meat Boy Forever is the sequel to Super Meat Boy! This is a new experience that eclipses the original. Don’t stare directly at it unless you still have your eclipse glasses.\n7200 individually handcrafted levels combine dynamically to give you a new challenge every single time you play. Seven thousand two hundred levels. They said we couldn’t do it, but we did. Who’s they? Don’t ask. They don’t like it when you ask.\nIt’s hard, but fair. Nothing in life worth having comes easy. Just ask Dark Soulman.\nMeat Boy and Bandage Girl can fight back. It’s time to unleash the raw fury of parenthood on their foes just like Liam Neeson in that documentary about his family vacation in Paris.\nBigger boss battles than before. Your mind will be blown. Your socks will be blown off. Team Meat is not liable for any of this.\nBrand new art with stunning detail and resolution. There are a lot of pixels in here. Grab the biggest display you have and watch those dots change color rapidly with gumption. Don’t sit too close though. (If your parents aren’t home you can sit as close as you want we won’t tell, but Team Meat is still not liable for any of this.)\nA soundtrack composed by Ridiculon so intense that the state of Wyoming has issued a ban on all audio devices capable of playing it out of fear that just a single note will cause the dormant super volcano beneath Yellowstone to erupt ushering in a new age of darkness.\nFrame by frame artisan crafted in game animations, and animated cutscenes that will make you experience procedurally generated emotions.\nA story so rich and moving that it makes Citizen Kane look like an unboxing video for a dehumidifier.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Headup Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":45868,"name":"Monster Boy and the Cursed Kingdom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3cd/3cd488dcccb38d73dc8d881e6c83701d.jpg","description":"A legendary series returns with a grand new adventure!\nEnjoy a colorful action-adventure game made alongside Ryuichi Nishizawa, creator of the original Wonder Boy in Monster World series.\nMonster Boy and the Cursed Kingdom borrows the best from the classic series to deliver a fresh, modern adventure with fun gameplay, memorable music and gorgeous hand drawn animations.\nCan Jin save Monster World Kingdom? Help our young hero defeat challenging enemies, discover hidden locations, upgrade powerful equipment, and more! You'll also unlock special forms with unique skills used to open new paths where mighty bosses and secret treasures await.\nFeature Overview:\nSix awesome forms with unique combat and platforming abilities to make your adventure exciting from start to finish.\nUnlock new paths and secrets with special equipment: look for magic weapons and items that gradually open up the world.\nOver 15 hours of epic adventure: explore the new Monster World in a vast interconnected environment.\nHand Drawn animations: characters and enemies come to life with detailed animations and fun facial expressions.\nSoundtrack from iconic Japanese composers: Yuzo Koshiro, Motoi Sakuraba, Michiru Yamane, Keiki Kobayashi and Takeshi Yanagawa.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"FDG Entertainment GmbH & Co.KG","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":30373,"name":"Medal of Honor: Allied Assault","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8eb/8ebcb680e97bf8172a0b758f60e1e53d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"2015","platforms":[{"id":0,"name":"PC"}]},{"id":29373,"name":"Space Rangers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/833/83397b3d76f34b80a255736db77e8d1d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Elemental Games","platforms":[{"id":0,"name":"PC"}]},{"id":22910,"name":"Clive Barker's Undying","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/707/7073efa8fba0f55ac9539f1e664b9181.jpg","description":"What a horrible night to have a curse!\nSomeone should have warned the Covenant children: “Never read aloud strange rituals.” Little did they know that their childish game would unleash unspeakable horrors upon the unsuspecting world. Now, many years later, Jeremiah Covenant, the last sane sibling, lies on his deathbed knowing his fragile existence is the only thing restraining the curse. His only hope is Patrick Galloway, a fellow soldier from the Great War and a specialist in abolishing evil abominations.\nWelcome to Clive Barker’s Undying, a horrifying FPS romp of curses, strange, mad creatures, and family dysfunction gone terribly wrong. Step into the shoes of Patrick Galloway as you attempt to banish the evil using your arcane magic and the ever-dependable six shooter of metal grace. Pray to whatever god you believe in because this journey may end up costing your soul. First person shooter meets the contemporary master of horror fiction, don't miss it!\nWage a holy war against things that should not be: relentless Jemaas Warriors, pack-hunting prowlers, and the mind-twisting Inhabitants of Oneiros.\nRichly detailed environments that truly showcase the Covenant estate and its two parallel universes.\nCollect an explosive arsenal, including the Tibetan War Cannon, the always dependable double barrel shotgun, and the Scythe of the Celt.\nPowerful black magic at your fingertips! Blast your foes with spells such as Skull Storm, Lightning, and Ectoplasm.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Westlake Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":19853,"name":"SC2VN - The eSports Visual Novel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2a/a2a99bb5d9c2498d99c7725656199e25.jpg","description":"About\nSC2VN is a visual novel about the South Korean StarCraft 2 scene. You play as Mach, a foreign semi-pro trying to make it in eSports who soon learns that success in StarCraft takes more than in-game strategy. Meet fellow pros and build a team that can compete with the best.\nThis game is written for all players who want to live the dream. No previous knowledge of StarCraft and eSports required.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team Eleven Eleven","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19737,"name":"Roll'd","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d6/8d603d9366b26fe5ac319d68a22f5c4e.jpg","description":"Enter the world of Roll'd where rolling comes in at a new degree.\nIn this arcade, multiplayer-focused endless runner you will be fine as long as you remember the twist: you do not control the hero...you control the track.\nChallenge yourself and your reflexes to keep the track level for as long as possible. Sounds easy? Why not give it a try to see for yourself?\nNow introducing: MULTIPLAYER!\nInvite some friends over for a local game or catch up for a match online...it's time to get rolling! Single player is available as well, so hit the road best your previous record and unlock all the goodies: new runners, locations, themes and difficulties.\nRun through the varying settings all specifically stylized with references and inspirations ranging from the CGA era, through 8-16bit NES/SNES to the golden ages of the Amiga and more. But at the same time they are all up to date with modern lighting effects, dynamic weather and some other cool visual treats.\nBut be wary though, Roll'd can and will be unforgiving and reaching that extra point with each game will prove to be a demanding yet exciting task.\nFeatures:\n- A unique twist on a classic genre\n- Addictive, easy to grasp, hard to master gameplay\n- Highly addicitive multiplayer mode! Both Local and Online. 2-4 players.\n- Leaderboards & Achievements\n- 5 diverse and varied graphical themes, 4 difficulty settings each\n- 25 unlockable runners\n- Pleasing to the ear original soundtrack\n- and a cool set of varying retro inspired post effects","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"MGP Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19193,"name":"SENGOKU Anthology","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cad/cada22df9a1a0fa7a9129c2837ede68e.jpg","description":"Sengoku is a deep character driven strategy game set in 16th century Japan. Play as a Japanese nobleman and unite the land of the Rising Sun under your iron fist. Use your military might, your smooth talking tongue, and your guile to increase your power. Watch your enemies fall like cherry blossoms in the early dawn of spring. Doublecross your enemies in an honorable and auspicious manner. Always make sure you have competent heir, if you should die before your destiny has been reached.\nKey features\t\t\t\t\t\tPlay as a Feudal Japanese Lord and manage your relations with family, friends, and enemies\nRise in influence and power inside your clan and then move on to claim the ultimate prize, the control of Japan\nConquer and grow while rewarding your most valued retainers as you make a bid to become Shogun\nDetailed historical map of Japan, divided into over 350 different provinces, during the Warring States era\nManage your relations with three different religious factions, the Shinto, the Christians and the Buddhists\nEmploy the aid of powerful Ninja clans when your Samurai armies are not enough","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 2"}]},{"id":18023,"name":"Grimind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ffa/ffa6710cecc25b4965f6e139cfc5228e.jpg","description":"Grimind is a 2D, physics based, adventure, platform game in horror/creepy theme. Grimind casts you into forgotten caves and ancient crypts, without memories. While being there you have to demonstrate great manual skills to pass obstacles and solve non trivial puzzles to get out of scary environment and additionally discover what are you doing there alone – but is it certain... that you are there... alone?Features:\nDynamic gameplay combined with a frightening experience\nPhysics based gameplay - It gives you the possibility to do whatever you want. Every single dynamic object can be dragged, carried or thrown which gives you enormous freedom.\nNarration - While playing, the character is talking, telling the player what he feels, if he's scared, or what he thinks about the current situation.\nChallenge! - Grimind isn't an easy game, so you can forget about holding just one key and passing through the levels. Besides dexterity and input skills, there is also a large number of logic puzzles to solve. Your brain will be tested and you'll not get bored.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Paweł Mogiła","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15472,"name":"Regency Solitaire","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c01/c016d70627cdd46ed20a501b56f2c3b1.jpg","description":"Experience the romance of Regency England in this sumptuous solitaire game. Help Bella take charge of her destiny and create the ballroom of her dreams.\nPlay your cards right as you tour historic locations, from stately homes and lavish gardens to the fashionable towns of London, Brighton and Bath. Decorate the family ballroom to unlock gameplay features and improve Bella’s chances of finding true love!\nAvoid the clutches of the odious Mr. Bleakley, and reclaim a lost fortune. Cupid’s arrow can’t fail to find his target - in Regency Solitaire, love is always just around the corner.\nFeatures:\nSmooth, satisfying solitaire gameplay.\nMakeover Bella's ballroom and costume.\nSumptuous art and romantic storyline.\n180 unique levels spread over 20 chapters.\nUnlock 31 exciting gameplay upgrades.\nNormal and Hard modes.\nSpecially-composed, classical music.\nCan set backgrounds as Desktop Wallpaper (PC only.)\nMore Glowing Reviews:\n\"It's a really nice game. Expertly made, wonderful art, animation, and well-written characters.\"\n- PC Gamer: http://www.pcgamer.com/pc-solitaire-games/\n\"I started it thinking it would just be a bit of throwaway fun. I’ve now played it more than StarCraft 2.\"\n- Kotaku: http://www.kotaku.co.uk/2015/12/18/23-games-you-might-have-missed-in-2015\n\"A hypnotic plaything which takes the pastime of patience in a radically different direction.\"\n- Eurogamer: http://www.eurogamer.net/articles/2015-12-22-unsung-games-of-2015-regency-solitaire\n\"Playing Regency Solitaire for 26 hours was an honour and a delight.\"\n- Giant Bomb/Felix Kramer: http://www.giantbomb.com/articles/felix-kramers-top-10-games-of-2015/1100-5346/\n\"I love every minute, every second, every word of this game.\"\n- Wardfire (youtuber): https://www.youtube.com/watch?v=SPKaWY6CQdE\n\"I am so in love with this little game, I find that no superlatives will do.\"\n- Jenn Frank (The Frisky): http://www.thefrisky.com/2015-06-12/regency-solitaire-is-this-years-casual-gaming-addiction/\n\"Regency Solitaire, with its attention to detail in story, gameplay, and artistry, stands as an example of how a standard game can be reinvented with creativity\"\n- Game Rant (4.5/5): http://gamerant.com/regency-solitaire-reviews-229/\n\"Regency Solitaire is as beautiful, clean, and elegant as the time period it represents.\"\n- jayisgames (4.2/5): http://jayisgames.com/review/regency-solitaire.php\n\"It had me hooked from start to finish and is definitely one of the most addictive examples of the genre\"\n- GameRamble (8.3/10): http://gameramble.com/Regency-Solitaire-PC-Review\n\"A wonderfully addicting, deceptively simple solitaire game. Get it!\"\n- Nerdy But Flirty (A): http://nerdybutflirty.com/2015/06/09/review-regency-solitaire-win-a-hand-by-playing-hands/\n\"The next eleven hours of my life were a blur.\"\n- Smart Bitches Trashy Books (A-): http://smartbitchestrashybooks.com/reviews/game-review-regency-solitaire/\n\"Regency Solitaire is one of this year's most surprising games.\"\n- DefunctGames (B+): http://www.defunctgames.com/courant/896/regency-solitaire\n\"Regency Solitaire is a fantastic game in an underappreciated genre.\"\n- Gamestyle (8/10): http://gamestyle.com/review/regency-solitaire-review/\n\"The game is wonderfully endearing and I think a lot of people will be surprised if they give it a chance.\"\n- Indie Games: http://indiegames.com/2015/07/a_debutantes_hand_regency_soli.html\n\"Challenging, relaxing and satisfying in equal measure, the game managed to keep my attention for long periods of time\"\n- Go Play That: http://www.goplaythat.com/article/regency-solitaire\n\"Regency Solitaire manages to engage the player while using game mechanics that are easy to pick up, but can require a lot of strategy to master.\"\n- Infinite Indie: http://infiniteindie.com/81115/regency-solitaire-card-game-all-decked-out\n\"This is a game that you could play and enjoy even if you have no interest in the historical period or the story.\"\n- Emily Short: https://emshort.wordpress.com/2015/09/23/regency-love-tea-for-three-studios-marrying-mr-darcy/\n\"The solitaire genre might be quite traditional in nature, but it’s far from old fashioned under the watchful eye of Grey Alien Games.\"\n- Remeshed: http://remeshed.com/2015/regency-solitaire-took-casual-gamers-storm/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grey Alien Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13844,"name":"Press X to Not Die","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53c/53c7f535bc3972bd67e71f37d987c0cd.jpg","description":"Try the Demo!Press X to Not Die is amazing but don't just take our word for it!  Try the free demo by clicking on \"Download Demo\" up there on the top of the right sidebar somewhere!\nAbout the Game\nYou wake up to find your town in chaos.  Everyone has gone crazy and is just attacking each other!  A cryptic message is the secret to survival-- Press X to not die!\nSurvive the streets, find your girlfriend, find out what happened, and get the hell out of town in this ridiculous live-action interactive movie adventure!\nKey Features\nPress buttons like your life depends on it!  Because it does!\nOver 35 minutes of HD footage!\nGraphics so amazing, they look like real life!\n25 unique ways to die!\nUncover the secrets behind the madness in a branching storyline that reflects your choices!\nA Dynamic Dialogue system that constructs key spoken sentences on the fly to reflect your actions and performance, providing for an unprecedentedly dynamic experience in an interactive movie.\n“1994 Mode” re-renders the game as it would have looked during the golden age of interactive movies!\nSteam Leaderboards to share your high score and the choices you made, with the world!\nFight a clown!\nLinks:\nhttp://www.facebook.com/pressxtonotdie1\nhttp://www.twitter.com/pressxtonotdie1\nhttp://www.pressxtonotdie.com","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"All Seeing Eye Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11424,"name":"Gumboy Tournament","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f06/f0683129b82596e05d05cb0e4a2a5912.jpg","description":"Test your reflexes, judgment and tactics while facing up to eight other players in this follow-up to the critically acclaimed and popular arcade game Gumboy: Crazy Adventures, winner of numerous accolades including Gametunnel's GAME OF THE YEAR 2006.\nFeaturing the same graphically rich, fantasy style that made the original Gumboy so captivating, Gumboy Tournament adds new levels, bonuses, and four new multiplayer modes. Players can now compete in the furious capture the flag mode, fight to control valuable territories, frantically collect diamonds or race through control points. All this is played out in highly complex levels full of spiral chutes, fountains, waterways and even outer spacecomplete with planets and sudden gravity changes.\nMultiplayer for up to 9 players on LAN, Internet, or split screen\n20 stages with varied environments\n4 different game modes, playable on any level\nPhysical simulation and new space levels based on the principle of gravity\n80-level single player campaign","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"CINEMAX","platforms":[{"id":0,"name":"PC"}]},{"id":5836,"name":"DARKSTONE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db2/db2b5fd2cfa960141fee2ab95e1134e5.jpeg","description":"The Evil Draak has joined forces with Death and is destroying everything in his path! Explore huge keeps to find the 7 Legendary Crystals to put an end to his vile acts. It is highly unlikely that you'll be able to survive in the hostile regions of this desolate land. Be warned, the fighting will be fierce, but the adventure will be epic!\nJoin the best warriors now and pool your skills to ensure that Good triumphs over Evil!Key Features:\nReplay as much as you like thanks to the 4 difficulty levels and the randomly generated dungeons, quests and items.\nPlay in cooperative mode with up to three of your friends for highly intense fights.\nChoose from 8 characters from 4 different classes (warrior, wizard, thief and monk) with their own unique features, combat styles and defeat your fire breathing nemesis.\nUpgrade your skills, choose among more than 30 sorts of weapons, 32 magic spells and progress through an epic adventure in 32 different environments.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Microids","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":351,"name":"Battle Islands: Commanders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f56/f56b093ad045cd511ced173d22329ec3.jpg","description":"Dominate the battlefield! From the creators of the popular WWII strategy game, Battle Islands, comes an explosive head to head combat game!\nTake part in major WWII battles in Battle Islands: Commanders, from the sandy dunes of North Africa to the bitter cold of the Eastern Front! Master the art of war against real opponents from around the world and reap the spoils of war.\nBuild your army and launch an offensive now!\n• Lead troops into real-time combat against players from around the world\n• Build the ultimate Battalion and destroy the enemy’s defense\n• Earn Supply Crates and unlock new Units to open up new tactics and strategies\n• Battle across vast deserts and frozen landscapes. Unlock new Theaters of War as you conquer enemies\n• Form an Alliance to exchange Units and spar with your friends\nIT’S TIME FOR BATTLE, COMMANDER!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"505 Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":959953,"name":"Farlight 84","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/142/142097fa3b3fbf162d0425557f332a89.jpg","description":"Farlight 84, a mega-intense Battle Royale!\nSet in 2084, Farlight 84 takes players to an apocalyptic near-future world, where they'll get to commandeer vehicles with deadly offensive capabilities; fly and dash around the battlefield with a one-of-a-kind Jetpack; and discover a roster of heroes bursting with personality and ultimate skills!\n\nSmash it all down!Smash with ultimate skills - Ace Your Battles!14 Heroes, all with ultimate skills you've never seen before! Turn the tides of battle and witness their prowess. You never know who will survive ‘til the very end!\nSmash with armored vehicles - Blow' em Up!Our armored vehicles will blow your enemies away! Rule the battlefield with bullets, extreme firepower and lightning speed!\nSmash with ingenious weapons - Unleash Your Energy!Various weapons from four manufacturers, each with different styles! These bad boys will never fail you in combat!Smash with unique heroes - Be Who You Want to Be!Introducing Capsulers with distinctive personalities! Rally your Clan and take the win!Smash with jetpacks - Fly and Dash!Jetpacks bring you a fantastic and never-before-seen shooting experience! Propel forward or upward in the thick of battle and dodge projectiles in style!\nSmash with stylish looks - Turn Heads and Roll with the Times!Drama queen or low-key gentleman? Suit yourself up with a unique Skin from your Warehouse! Enjoy smashing under the spotlight!Smashing in multi-modes - Fun Beyond Battle Royale No matter how you wanna play it, there's always something new. HUNT, Team Deathmatch, Bayfront Rally and more....\n\nOops! Was that too much info? Stay tuned for more updates!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Farlight Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":484913,"name":"Mass Effect 3 N7 Digital Deluxe Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b11/b114fa405326222b9986da82f6aa682d.jpg","description":"EA Play\nAbout the GameEarth is burning. The Reapers have taken over and other civilizations are falling like dominoes. Lead the final fight to save humanity and take back Earth from these terrifying machines, Commander Shepard. You'll need backup for these battles. Fortunately, the galaxy has a habit of sending unexpected species your way. Recruit team members and forge new alliances, but be prepared to say goodbye at any time as partners make the ultimate sacrifice. It's time for Commander Shepard to fight for the fate of the human race and save the galaxy. No pressure, Commander.\nFight smarter. Take advantage of new powers and combat moves. Shepard can now blind fire at enemies and build tougher melee attacks. Plus, when you fight as a team you can combine new biotic and tech powers to unleash devastating Power Combos.\nBuild the final force. Build a team from a variety of races and classes and combine their skills to overcome impossible odds. You'll be joined by newcomers like James Vega, a tough-as-nails soldier, as well as EDI, a trusted AI in a newly acquired physical form. Keep an eye out for beloved characters from your past, but beware. Some may not survive the final battle...\nFace off against friends. Enjoy an integrated co-op multiplayer mode and team up with friends online to liberate key conflict zones from increasingly tough opponents. Customize your warrior and earn new weapons, armor, and abilities to build war preparedness stats in your single player campaign.\nThe N7 Digital Deluxe Edition contains:\nMass Effect 3\nN7 Arsenal pack and in-game items (N7 Crusader shotgun, N7 Hurricane submachine gun, N7 Valiant Sniper, N7 Eagle handgun, N7 hoodie)\nDownloadable Art book and lithograph\nMass Effect Digital Comic by Dark Horse Comics\nFrom Ashes DLC","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"BioWare","platforms":[{"id":0,"name":"PC"}]},{"id":304273,"name":"Sin Slayers: The First Sin","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f43/f43eb8dd631ade10441252793a28ed7b.jpg","description":"ADD FULL GAME TO WISHLISThttps://store.steampowered.com/app/783190/Sin_Slayers/\nAbout the Game\nSin Slayers: The First Sin is a free demo of Sin Slayers, an isometric RPG with roguelike elements, where your choices determine how challenging the fights and enemies will be.\nThis version contains 2-3 hours of gameplay, all major game elements, first story act and one procedurally generated map, that you can clear multiple times.\nCreate, equip and lead a team of heroes. Each unit will have its own abilities and weaknesses, so plan your combat strategy accordingly. You’ll journey through stinking primeval forests, boneyards riddled with crypts and the graves of fallen warriors, and other places even the bravest adventurer would fear to tread.\nBattles, traps, and bizarre enemies... Everything and everyone wishes to take your life, but don't succumb to despair. Between fights your party can take their rest at a fountain, or while on the road in an old church which leaves its doors open to the weary and wounded.\nTravel every path and byway of the Valley, obtain new weapons on the field of battle or by fulfilling quests, gather ingredients for magical elixirs and resources to craft armor and amulets. If a certain item is beyond your crafting ability, ask the blacksmith in the Old Church for help. The best gear will allow you to challenge the deadliest monsters.\nThe souls of many heroes were cursed upon death, leaving them to wander a dark and uncharted world, an afterlife reserved for sinners. Is this the end, or..?\nGather your team. Equip them with weapons, armor, and amulets. Level up your abilities as you move forward. The Sin Lords must be slain.\nSin Slayers features a classic turn-based combat system in the tradition of the best JRPGs, giving you free rein to pit your tactical skills against the wretched inhabitants of the Valley of Fallen Sinners.\nSteel yourself. Enemies are everywhere and you will need to make difficult decisions and face dire peril to prevail.\nDepending on your choices, the sinfulness of your team will go up or down. If it's high — expect tougher enemies. Whatever might be buried there, is it wise to desecrate those graves? Every decision you make matters, and on the road to the next Sin Lord you will have many opportunities to choose poorly.\nEvery crusade against a Sin Lord will be unique as every location is randomly generated. Think you know everything there is to know about a fetid swamp? We promise there are new lessons to learn, though they may not be to your liking!\nLegends tell of a place betwixt worlds, a region outside time and space called the Valley of Fallen Sinners.\nA dense, preternatural fog lays like stinking breath over black woods. What cursed hordes await? Vicious beasts, damned warriors, the undead, and worse chthonian horrors, all with an unslakable craving for new souls to perpetuate their own unnatural life.\nThis region is for the most contemptible cowards, those who died because of their sins and the darkness weighing down their souls. At one time, they lived as brave heroes across a multitude of worlds, and bards composed ballads to their noble deeds. Until the day darkness flooded their hearts and killed them.\nNow regret consumes them, but their souls will find no rest. They are doomed to wander the Valley endlessly, searching for rest, respite, an end to their torture. But they will know no peace until someone destroys the seven seals of the Portal of the Worlds. Only then will the gates open and the damned finally escape their prison...\nTruth be told, no one has attempted this before.\nhttps://store.steampowered.com/app/760080/Hazardous_Space/\nhttps://store.steampowered.com/app/921800/Encased_A_SciFi_PostApocalyptic_RPG/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"goonswarm","platforms":[{"id":0,"name":"PC"}]},{"id":52335,"name":"Guitar Hero II","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/459/459cabfce77a504a7ae995d8318381bb.jpg","description":"Rock the Rhythm, Lead, and Bass Guitar tracks in the follow-up sequel to \"Guitar Hero.\" Form your guitar duo and shred riffs cooperatively or go head to head in all new multiplayer modes. With over 55 tracks to rock out to, you'll go from Guitar Hero to Guitar god in one press of a fret button. Choose from multiple rock characters and jam at concert venues that grow in size as your rock career progresses. You'll start your rock career playing small clubs and bars, but if you play well you'll work your way up to stadiums and arenas. Guitar Hero II takes the guitar rock experience to new volumes by allowing players to play 3 different guitar tracks: Rhythm, Bass, and Lead. Guitar Hero II introduces all new multiplayer modes like: cooperative, pro-face off, and face off, letting 2 Guitar Heroes conduct their own symphonies of destruction. Shred School: Guitar Hero II features an all new practice mode, allowing Guitar Zeroes to become Guitar Heroes with enough practice.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"}]},{"id":29091,"name":"UFC 2009 Undisputed","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/789/789e763a3c9776b812a628c8f7e9490a.jpg","description":"(Online Interactions Not Rated by the ESRB) This game supports English, French, Italian, German, and Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". UFC 2009 Undisputed is an explosive fighting game detailing the action, intensity and attitude of the Ultimate Fighting Championship®  (UFC).   Featuring an authentic and comprehensive UFC atmosphere, including an extensive roster of the best mixed martial arts fighters in the world, players will push the envelope with a powerful new game engine and put their best fighting disciplines to the test in the world famous Octagon.  Take your best shot - UFC 2009 Undisputed is as real as it gets! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Yuke's Co","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":18719,"name":"Full Spectrum Warrior: Ten Hammers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61f/61fbae2618f448128714bc1f38881ec8.jpg","description":"Sequel to the critically acclaimed, squad-based/real-time tactical combat game, Full Spectrum Warrior: Ten Hammers delivers the most authentic and realistic infantry combat experience ever. As Squad Leader, coordinate the actions of multiple infantry squads, leading them through over 12 levels of intense action. Utilize authentic combat tactics to command your squad as you battle enemies with an explosive arsenal of weapons, high-tech military equipment and new controllable mechanized units. New advanced squad controls give you more in-depth tactical command over your squad as you lead them through a variety of realistic combat missions. With all new multiplayer modes, go online and team up with a friend in two player co-op or go head-to-head with up to eight players through a variety of new adversarial and team-based objective missions.\nInnovative gaming experience - Combines intense squad based combat and real-time tactical action, delivering the most authentic and realistic infantry combat experience ever.\nNew Squad Controls - Independently controllable scout & buddy teams, ability to give orders to one team while controlling another, and ability to enter buildings and position sniper teams.\nAdvanced reactive enemy AI that reacts realistically to combat situations.\nExpansive, non-linear level design  with multiple pathways to accomplish objectives.\nNew Multiplayer Experience - Full Spectrum Warrior style gameplay with both Co-op and Adversarial (Coalition vs. Opfor) online multiplayer modes.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Pandemic Studios","platforms":[{"id":0,"name":"PC"}]},{"id":13889,"name":"DYNASTY WARRIORS 8: Xtreme Legends Complete Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/637/6370d17534183a7cbcff7bb1878188a6.jpg","description":"NOTICEFor text displayed within the game, you can select any of the following languages:\n- English\n- French\n- German\n- Chinese (Traditional)\n- Chinese (Simplified)\n- Japanese\nHow to select the display language\n1. From your game library, right-click the game title, and then select Properties.\n2. After selecting the LANGUAGE tab, select the language you want to use from the menu.\n* Select \"ENGLISH\" here if you want to play in \"GERMAN\" or \"FRENCH\"\n3. After selecting the PLAY button, from Configuration, launch the configuration tool.\n4. If a language configuration item exists within the tool, select the language you want play in.\nConcerning save data, note that data is separated into the following 3 groups:\n- English, French, German\n- Chinese (Traditional), Chinese (Simplified)\n- Japanese\nAbout the Game\"Dynasty Warriors 8: Xtreme Legends\" introduces entirely new levels of fun to the refreshing gameplay vanquishing swarms of enemies with mighty warriors found in \"Dynasty Warriors 8.\" In story mode, where you can immerse yourself in the vivid tales of the Romance of the Three Kingdoms, it is now possible to play as the mighty warrior \"Lu Bu,\" and embark on a journey that depicts his way of life. Additionally, many new hypothetical scenarios to existing Romance of the Three Kingdoms battles have been added, as well as new playable characters, weapons types, growth/speedrun elements, and more! What's more, a revamped Ambition Mode and completely new Challenge Mode offer whole new ways to enjoy the \"Dynasty Warriors 8\" universe.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":2474,"name":"Bleach: Brave Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/081/081a4ed8d38ae678cf79b60491d2da2b.jpg","description":"Tite Kubo's hit manga and TV anime series Bleach comes to life in this 3D hack-and-slash action game! The game faithfully reproduces the story of the Bleach anime, Shonen Jump manga, and novels in loving detail with fantastic graphics and all-action gameplay.\n\nFrom the human-populated world of the living to the Soul Society, home of Soul Reapers and the spirits of the dead, the bleak realm of Hueco Mundo, where evil spirits known as Hollows reside, and the depths of Hell, final resting place of sinners, the endlessly imaginative Bleach universe is recreated in high-quality 3D graphics. Relive all your favorite scenes and special techniques from the hit anime!\n\nGo online and take part in epic 3-on-3 battles with players from all over the world in real time!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"KLab","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":1486,"name":"Dungeon Rushers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b9/1b93d44305c6800d4cfd3c55f5185f81.jpeg","description":"Dungeon Rushers is a 2D tactical RPG combining dungeon crawler’s gameplay and turn based fights. Manage your team, loot dusty dungeons, crush armies of monsters and craft mighty equipment. Be part of an epic adventure with a colorful cast of characters in an off-beat universe. Build your own dungeon and challenge other players!The Game:\nOver the course of an epic quest, explore many dungeons and loot their guarded treasures. Build your own team by choosing the best hero combination to overcome traps and monsters lurking in the shadows.\nUpgrade the skills of your heroes to make them even more fearsome and place them strategically to achieve victory.\nCraft your equipment on your own with components gathered during your journey thanks to an advanced system consisting of six different craftsmen.\nComplete dungeons and their bonus challenges to unlock the Heroic difficulty, where only the best can make their way to the treasure!\nBuild your own dungeon in which you can spread traps and monsters to prevent other adventurers from looting your chest! Hire your « dream team » by exploring a world where dungeons and manors have been abandoned by men in favor of the worst creatures, then attack other players' dungeons to plunder their treasure!Heroes:  Features:\nCampaign mode full of humor with various sound and graphic environments\nInteractive exploration system\nRevised turn based fights with a hint of nostalgia\nAdvanced team management (equipment, skills upgrade, in-fight position, ...)\nWide range of skills to use (scout, heals, dodge, trap deactivation, monsters stalking)\nCrafting system featuring many recipes to unlock\nHigh replay value with a Heroic difficulty for each dungeon\nOnline arena system with matchmaking and ranking\nBattles among friends, to die against people you love\nEpic custom-made soundtrack","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":200,"name":"2Dark","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47d/47d74c9b88068a72ce3f5c492b954480.jpg","description":"From Frédérick Raynal, the creator of Alone in the Dark® and pioneer of survival-horror, 2Dark is a grim journey of stealth and courage into the heart of corruption. Use your cunning to infiltrate Gloomywood’s bastions of cruelty. Investigate to uncover the secrets of the deranged psychopaths within, seek retribution for their crimes, and bring the children to safety.\nPlagued by a string of child abductions, darkness hangs over the once-picturesque city of Gloomywood like a curse, smothering hope and paralyzing its citizens with fear. Having seen his own wife slain and his children taken, former detective Mr. Smith vows to find justice and bring an end to the misery. But, if only it were so simple. From dubious streets and suspicious dwellers, to the pack of smokes in your pocket and the betrayal of your own footsteps, danger infests every corner and crevice. Doubt everything in this trap of a city where death is the only certainty.A NEW STEALTH-HORROR ADVENTURE A nerve-wracking experience of ruthless consequences with only your wits to guide you.\nPerfect your plan to infiltrate intricately handcrafted levels and escape with the children.\nStick to the shadows and step carefully. Light and sound can be your allies, and your undoing.\nSupplies are limited. From flashlight batteries to bullets, make every item count.\nInvestigate every nook and cranny to expose the sinister secrets behind the abductions, uncover new areas, and find every child.\nKids will be kids. Stop for too long and they'll fidget and cry, putting both of you in harm's way.\nBreak for a smoke to save your progress, but be wary of noisy coughing fits, and remember, smoking really does kill.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Gloomywood","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":364807,"name":"King's Bounty II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a12/a12baacbf2430b2f6d8a25ea125ab543.jpg","description":"Offering a fresh take on the acclaimed fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with local townsfolk. Experience a rich world that blends realism and fantasy, filled with compelling stories, memorable characters and moral choices aplenty!\n\nTaking on the mantle of one of three heroes – each with their own unique story – players embark on a non-linear, open-world adventure across a detailed and densely-packed fantasy landscape. Split into two distinct phases, players traverse the realm from a third-person perspective, picking up quests, exploring the wilderness, and getting to know the people they meet. When conflict arises, however, the perspective shifts to tactical, turn-based combat. Players must then make smart use of their units as they fight to win.\n\nSet in the vast realms of Antara, a great danger has arisen. A mysterious blight has descended upon its furthest reaches, corrupting the land and all who live there. Refugees from the affected regions have begun arriving in the kingdom of Nostria, putting food and resources in short supply. Once living souls, blight-distorted creatures now roam the countryside leaving chaos and destruction in their wake. The land itself fights for survival, giving your decisions greater weight than ever before. How will you forge Antara’s future?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"1C Company","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":39284,"name":"Killzone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/555/555bed7bfd4274774dab46c0ecf78eea.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":25449,"name":"Okami","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/922/92244532ff3c3f277824c0cf8941f187.jpg","description":"The Multiple Award Winner is Now Available for the Wii!\n\nPlay as the wolf incarnation of the Japanese sun goddess Amaterasu and channel your divine powers through the mighty Celestial Paintbrush to restore beauty and order to a bleak world overrun by evil!\n\nUse the Wii Remote to create images with the Celestial Brush to attack enemies!\n\nBreath-taking traditional Japanese art comes alive in vivid 3D.\n\nSolve puzzles by painting images that become real.\n\nArm yourself with 13 devastating techniques.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ready At Dawn","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":20137,"name":"Glorkian Warrior: The Trials Of Glork","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5d/a5d2487c9d20b7642529396b14bfc696.jpeg","description":"BECOME A GLORKIAN WARRIOR! Visit awesome asteroids! Blast strange invaders!\nGlorkian Warrior: The Trials of Glork is a collaboration between Eisner Award winning cartoonist James Kochalka and indie game studio Pixeljam, makers of DINO RUN and POTATOMAN SEEKS THE TROOF.\nIt's a goofy mashup of Galaga-style shoot-em-up, simple platforming action, and Saturday morning cartoon.\nHelp Glorkian Warrior and his trusty Super Backpack fight against an endless onslaught of alien creatures, and be prepared for anything... the Magic Robot appears when you least expect it, and might shower you with exploding basketballs... or kittens... or cakes!\nCollect energy crackers and power up an awesome arsenal of double lasers, triple lasers, rockets, fireballs, tennis balls & more while the invaders hypnotize you with their mesmerizing attack patterns. Perhaps you may even uncover the legendary Flarf Gun and save the world.\nYou will have so much fun trying and dying, again and again.... but no matter how miserable your performance, each play session will add to your progress and unlock new features to keep your fingers and fun zone fully engaged!\nFEATURING:\n◊ Art & story by James Kochalka, First Cartoonist Laureate for the state of Vermont!\n◊ Procedurally generated invader flight patterns and formations, with many landscapes to explore\n◊ Endearing characters and all-ages humor\n◊ Based on Kochalka's graphic novel “The Glorkian Warrior Delivers a Pizza\"\n◊ YES!\nCan you reach the rank of Glorkian General or will you forever stay a Soft-Boned Space Cadet?\nGLORK!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pixeljam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":15494,"name":"Worms World Party Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f9/5f91bb379e1d249702f9538ec2ed5a5b.jpg","description":"Imagine taking the perfect online gaming experience and one of the most popular Worms games ever made, adding a touch of Steam achievements, leaderboards, cloud saves, full controller support; a little sprinkle of 1080p / 60FPS, all rounded off with enhanced weapon sounds effects and an improved frontend.  And you have Worms World Party Remastered.\nWith both single player and up to 6 players leading their worms into manic multiplayer mayhem, this unique, wacky, outrageous, addictive and deadly (to Worms anyway) combat game is remastered and ready for action.\nFEATURES:\nAccess the fantastic \"Wormpot\" which gives you over 1000 different game styles. All modes are available offline, online, or a mixture of both!\nOver 20 Multiplayer missions: players can now team up with a buddy to tackle cooperative missions where working together is the only way to twin. Alternatively, check out the competitive missions and fight in specially prepared scenarios.\nSingle player and multiplayer, 2-6 players either local or online.\nIt’s a veritable feast with nearly 60 weapons, ranging from the relatively calorie-free bazooka to the full fat concrete Donkey. Oh man!\nIf you’re late to the party scene, don’t worry. Our friendly training section will soon have you dancing with the rest of us.\nShiny 1080p graphics with 60 fps\nEnhanced weapon sound effects\nCloud Saves\nFull Controller Support\nSteam Leaderboards\nSteam Achievements\nMODES:\nQuickstart Game - get to play quickly with predefined team and weapon set against AI (Wormbots).\nTraining - host different disciplines in which to train. You work against the clock.\nMissions - ranged between easy and hard. Custom terrains for won missions unlock for normal games.\nTime Attack - Missions but with different ways to complete them. The player must figure out which one is the fastest.\nDeathmatch challenge – similar to normal games. Player take on a number of computer teams in an ever-increasing spiral of difficulty. Rewards given to high ranked teams.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"}]},{"id":13324,"name":"CPU Invaders","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b75/b75cb678d1573eb8485b4c14ba33455d.jpg","description":"Invaders are living inside your computer. You shouldn't let that happen! Interact with your desktop while playing, watch Youtube videos, chat with your friends and more! CPU Invaders overlaps the game itself with your computer screen.\nScore system, bosses and draggable interface;\nEnemies with unique set of skills to destroy your CPU;\nOriginal 8-bit soundtrack, produced by Frost Orb.(Windows feature aero must be enabled or the game background will be solid black)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Microblast Games","platforms":[{"id":0,"name":"PC"}]},{"id":12482,"name":"INVASION!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b24/b24c6016ba6d93ad662ef6df5580c8da.jpg","description":"Narrated by Ethan Hawke and created by the director of Madagascar, INVASION! is a colorful VR animated short about a duo of aliens with grand ambitions to take over our world and destroy anyone who tries to stop them. Instead, they are greeted by the cutest and cuddliest animals on the planet - two adorable, white bunnies….and you are one of them! Come experience what happens! Be sure to look down to see your bunny body!\nOfficial selection of Cannes Le Marché du Film, Toronto International Film Festival and Tribeca Film Festival. Free for limited time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Baobab Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9818,"name":"Osiris: New Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea7/ea7406bdeccdfa2d95fe8fa7a3828996.jpg","description":"“The oldest and strongest emotion of mankind is fear and the oldest and strongest kind of fear is fear of the unknown.” – H.P. Lovecraft\nThe year is 2046 and mankind’s discovery of near-lightspeed \"fold engine\" propulsion has empowered mankind's Osiris expeditionary missions to the Gliese 581 system. You are the second colonization team sent by the U.N.E.  (United Nations of Earth) to study potential habitable planets when your spacecraft malfunctions braking from light speed, forcing an emergency landing on the planet’s surface.\nOvercome the dangers of an environment with unpredictable weather conditions by building a central base, expanding the structure further with modular units to grow food, create research centers, manufacturing bays and more. To further advance technologies and thrive on the planet, traverse into a world filled equally with breathtaking landscapes and alien terrors that will freeze your blood.  Osiris is a beautiful game that uniquely combines inventive crafting, curious exploration, and skillful combat. Explore an alien system and colonize worlds of incredible wonders and unforgiving dangers.KEY FEATURESMultiplayer Colonization: Work together with online players to build a prospering colony and together defend against threatening alien species, survive environmental phenomenon including meteor showers, and attacks from other online player colonies.\nSurvive, Craft, Research and Thrive: Gather resources and materials to adapt to the alien system, build modular structures to grow food and create manufacturing bays, research new technologies to upgrade gear and build new vehicles and droids, and explore the environment to discover new resources and secrets to expand and thrive in this brave alien world.\nExplore The Planet And Beyond: Learn what wonders and horrors lie on the alien planet and explore underground dungeons for unique potential discoveries. In time, build spacecraft to launch into space and travel to other planets in the solar system.\nPrepare for a Fight: Choose first or third person controls as you hunt intelligent alien species with predatory instincts.  Equip a variety of weapons to ensure you are prepared for any situation.\nLight-Year Visual Difference: Experience the high graphic quality typically only found in AAA games.  Osiris: New Dawn offers high attention to texture detail and High Dynamic Range lighting creating a frightening gorgeous world.  An advanced IK (inverse kinematics) system powers over 200 amazing fluid player movements and a diverse range of terrifying alien creature animations.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fenix Fire Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":1872,"name":"Gemini: Heroes Reborn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4c/b4c2390883116ec64596ba75c1b880fc.jpg","description":"Gemini: Heroes Reborn is a first person action-adventure that allows users to enter into the role of Cassandra, age 20.  She is a young woman on a journey of discovery in which she will unlock incredible powers - unique in the Heroes Universe - and solve a mystery in her past.  She will be reunited with her long missing family, but not in the way she ever expected.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Phosphor Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":144,"name":"Angry Birds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc8/fc839beb76bd63c2a5b176c46bdb7681.jpg","description":"Use the unique powers of the Angry Birds to destroy the greedy pigs' defenses!\nThe survival of the Angry Birds is at stake. Dish out revenge on the greedy pigs who stole their eggs. Use the unique powers of each bird to destroy the pigs’ defenses. Angry Birds features challenging physics-based gameplay and hours of replay value. Each level requires logic, skill and force to solve.\nIf you get stuck in the game, you can purchase the Mighty Eagle! Mighty Eagle is a one-time in-app purchase in Angry Birds that gives unlimited use. This phenomenal creature will soar from the skies to wreak havoc and smash the pesky pigs into oblivion. There’s just one catch: you can only use the aid of Mighty Eagle to pass a level once per hour. Mighty Eagle also includes all new gameplay goals and achievements!\nIn addition to the Mighty Eagle, Angry Birds now has power-ups! Boost your birds’ abilities and three-star levels to unlock secret content! Angry Birds now has the following amazing power-ups: Sling Scope for laser targeting, King Sling for maximum flinging power, Super Seeds to supersize your birds, and Birdquake to shake pigs’ defenses to the ground!\nHAVING TROUBLE? Head over to https://support.rovio.com where you can browse FAQs or submit a request to our support flock!\n#1 IPHONE PAID APP in US, UK, Canada, Italy, Germany, Russia, Sweden, Denmark, Finland, Singapore, Poland, France, Netherlands, Malta, Greece, Austria, Australia, Turkey, UAE, Saudi Arabia, Israel, Belgium, Norway, Hungary, Malaysia, Luxembourg, Portugal, Czech Republic, Spain, Ireland, Romania, New Zealand, Latvia, Lithuania, Estonia, Nicaragua, Kazakhstan, Argentina, Bulgaria, Slovakia, Slovenia, Mauritius, Chile, Hong Kong, Pakistan, Taiwan, Colombia, Indonesia, Thailand, India, Kenya, Macedonia, Croatia, Macau, Paraguay, Peru, Armenia, Philippines, Vietnam, Jordan and Kuwait.\n#1 IPHONE PAID GAME in more countries than we can count!\nTerms of Use: http://www.rovio.com/eula\nPrivacy Policy: http://www.rovio.com/privacy\nThis application may require internet connectivity and subsequent data transfer charges may apply.\nImportant Message for Parents\nThis game may include:\n- Direct links to social networking websites that are intended for an audience over the age of 13.\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.\n- Advertising of Rovio products and also products from select partners.\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rovio Mobile","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":974482,"name":"BUCKSHOT ROULETTE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db7/db7ae9631980d614fac8d9ff51902df1.jpg","description":"BUCKSHOT ROULETTE is a tabletop horror game that attempts to re-design the infamous game of Russian Roulette, replacing the traditional revolver with a proper 12-gauge pump-action shotgun. This extra firepower, and more importantly the different mechanics in handling a shotgun compared to a revolver, offers a fresh take on the classic and deadly game of chance.\n\nThe game takes place at the top of an underground nightclub, where the metal railings tremble to the pulse of long lost drum machines. A crooked AI dealer is waiting for you. Will you meet them?\n\nFEATURES:\n\n- 15 to 20 minute playthrough.\n- Immersive & grounded tabletop gameplay, featuring diegetic systems and minimal UI.\n- Unscripted rounds that offer unpredictable yet controllable outcomes, with a fair amount of replay value.\n- A ruthless yet fair AI, that makes decisions based on what's on the table, rather than under it.\n\nSYSTEM REQUIREMENTS:\n\n- Relatively modern dedicated graphics card (Vulkan support required)","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Mike Klubnika","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":806954,"name":"The Case of the Golden Idol","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0b/a0bccdd3b0bf8f6a18757f46e74c214a.jpg","description":"A new kind of detective game that allows you to think and investigate freely. Discover clues surrounding 12 strange and gruesome deaths and build your own theory. Pick your suspect, deduce the motive, unmask the awful truth.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Color Gray Games","platforms":[{"id":0,"name":"PC"}]},{"id":553075,"name":"Neurodeck: Psychological Deckbuilder","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1d/a1d5376a4a1eb5acb5acc14a8a281f14.jpg","description":"Neurodeck : Psychological Deckbuilder Demo is available here\n\nFeatures\nDeckbuilding as you progress through the game (Slay The Spire like)\nMeditate and choose personality traits that alter your gameplay profoundly\nExplore a subconscious maze, full of cards and improvements that will help you defeat the monsters in your mind\nLight RPG mechanics that allow you to customize your character stats & skills\nCharacters & places from your past that will tell facts & stories about mental health\nDeep gameplay mechanics that put focus on replayability and gameplay diversity\nHorrific monsters inspired by real-life phobias","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"TavroxGames","platforms":[{"id":0,"name":"PC"}]}]