[{"id":407566,"name":"MY HERO ONE'S JUSTICE 2","genre":"Action","price":0.0,"description":"Bonus for purchasing the previous game, MY HERO ONE'S JUSTICE:\n- Special customization item set for Izuku Midoriya\nThe special customization item set for Izuku Midoriya bonus may be released at a later date.\nTo receive the bonus for purchasing the previous game, you must have save data from MY HERO ONE'S JUSTICE.\nMY HERO ONE'S JUSTICE 2, the over-the-top follow-up to the smash hit 3D arena fighter MY HERO ONE'S JUSTICE, makes its heroic debut! Make full use of characters' Quirks as you clash head-to-head in epic battles across huge arenas!\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\n1-4 players\nNetwork Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer\n9GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©KH/S, MP\n©BNEI","imageUrl":"https://media.rawg.io/media/games/147/147c031f3b6b15d0d762d23e883973d4.jpg","releaseYear":2020,"developer":"Byking","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":60632,"name":"Arcade Spirits","genre":"Adventure","price":0.0,"description":"Arcade Spirits, a romantic visual novel, follows an alternate timeline set in the year 20XX where the 1983 video game crash never occurred. After a turbulent work history, you are granted employment at the Funplex, a popular arcade, home to a host of unique personalities and customers. Where will this new-found employment take you? Who will you meet along the way? Will you find the romance you're seeking?\nDesign your own character from the ground up - pronoun, hairstyle, skin tone, hair color, eye color and more are completely customizable and are reflected throughout the game in both gameplay and artwork!\nWith roleplaying-based choices, you will be able to grow your personality and relationships in any way you desire; Friendship, Platonic or something more intimate! Work hard and build the relationship you desire with a total of seven romanceable characters!\nThe Identity Identifier System, or IRIS, can track your relationship statuses with all characters throughout Arcade Spirits as well as your personality traits, from Quirky, Steady, and Kindly, to Gutsy and Basically.\nEverything you choose in Arcade Spirits, from your relationships to your personality, your crisis management moments, and a myriad other decision will have an effect on the future of your arcade!","imageUrl":"https://media.rawg.io/media/screenshots/306/306ad3fd46e3b77d8444802f05d40346.jpg","releaseYear":2018,"developer":"Fiction Factory Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":49240,"name":"Megaquarium","genre":"Strategy","price":0.0,"description":"From the creator of Big Pharma comes a brand new economic simulation game. Megaquarium follows in the footsteps of classic theme park management tycoon games and adds an aquatic spin!Meet your new tenantsFrom the cutest of clown fish to the deadliest of sharks. Megaquarium will include a wide range of aquatic life: Fish, Crustaceans, Jellyfish, Live Corals and more!\nWatch them growYou’ll have your work cut out to keep their wide-ranging requirements met, but if you do they’ll grow and their stats will increase.Plan your aquarium layoutA doubly-difficult task. You need to arrange your tanks for optimum visitor flow and easy access for your staff.\nHire and manage staffWill you train up an energetic amateur or buy in expertise? Your staff’s skills will grow over time, but beware, your livestock are not the only things with feelings. If staff disapprove of your management methods they might leave!Unlock an ocean of contentA successful aquarium will earn you plenty of points which you'll spend unlocking new livestock, tank, equipment, decorations and more.Advanced interactionsWatch out for interactions between fish. If you’re not careful, you might find your prize fish becomes another’s meal!Breed your ownExplored all of the fish available from the livestock merchant? Now it’s time to start breeding your best specimens to create brand new species!\nThe game is currently in development aiming for a release date in 2018. Add it to your wishlist if you want to be notified when it is released.","imageUrl":"https://media.rawg.io/media/screenshots/668/6680b10e0662af94f3d062b9f0730faf.jpg","releaseYear":2018,"developer":"Auroch Digital","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":49076,"name":"The Rare Nine","genre":"Action","price":0.0,"description":"The Rare Nine - ultrafast and explosive action platformer, in which you should break through the darkness and hordes of undead in a endless skyscraper. Also you can enjoy a lot of great chiptune music.\nYou can fight with a lot of different bosses, and then buy some unique upgrades for your character by spending cash, which drops from the dead enemies.\nWe are giving you a chance to choose an unique hero. Every character has its pros n' cons. If you can fully take control your hero, you will become godlike destroyer in this hell. Buddy I think you got the wrong door, the paradise club's two blocks down.Key features:\nUltrafast and dynamic gameplay, where reaction are not most important thing, also you can buy some upgrades for your character, after boss fights.\nVarious effects, which you can get with damage. Here's temporary effects, like: bleeding, poisoning, slowing movement. As permament effect - breaking bones, that type will downgrade your character.\nEvery choosed character is unusual by his abilities and absolutely different parameters.\nTotally different and unlike each other, bosses, which are chosen randomly.\nA huge variety of rooms filled with different objects, consisting of a pure pixel.\nThe style and appearance of the locals really impressive\nGame music are completely consists from chiptune tracks\nStrict palette, gives a special atmosphere to the gameplay\nFor people with photosensitive epilepsy is strictly not recommended, at the moment there is no option in the game that disables all provoking factors.","imageUrl":"https://media.rawg.io/media/screenshots/a09/a095f0a10a726b9eef9b2d52c9e430d8.jpg","releaseYear":2017,"developer":"Black Rail","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":38511,"name":"ShellShock 2: Blood Trails","genre":"Action","price":0.0,"description":"Shellshock 2: Blood Trails is an ultra-violent, survival horror FPS game set against the backdrop of the Vietnam War. Gameplay is centered on the use of psychological horror and fear, relying on the power of suggestion, mood, tension and foreshadowing to immerse players in a war that is worse than hell.","imageUrl":"https://media.rawg.io/media/games/a2d/a2d2720071a92e46db10a095d7c68236.jpg","releaseYear":2009,"developer":"Rebellion","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":28333,"name":"Viva Piñata Party Animals","genre":"Family","price":0.0,"description":"This game supports English, French, Italian, German, Japanese, Portuguese or Norwegian. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". Play as your favorite character from the Viva Piñata television series. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/b3d/b3df2785664d312af3d7e33ca728a833.jpg","releaseYear":2010,"developer":"Krome Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":24239,"name":"Pikmin 2","genre":"Strategy","price":0.0,"description":"The second game in the fan-favorite Pikmin franchise originally launched\nfor the Nintendo GameCube console in 2004. Now Wii users can enjoy the\nimaginative fun of this classic and colorful mass action strategy game,\nnow available at a suggested retail price of just $19.99 as part of the\nvalue-minded, family-friendly Nintendo Selects series. The brave Captain\nOlimar has returned to marshal new types of Pikmin in a wild, open-ended\nadventure. On a mission to pay back his employer’s debt, Olimar and his\nsidekick Louie must command squads of tiny Pikmin to help locate\nvaluable treasures, exploring mysterious environments and battling pesky\nenemies along the way. Players of any experience level can use the Wii\nRemote and Nunchuk controllers to command these curious creatures and\ncomplete their mission. The game also invites friends to deviously pit\ntheir Pikmin squads against one another in a rough and ruthless\ntwo-player mode*.\nFeatures:\n\nPikmin 2 is simple to pick up and play using the intuitive Wii Remote\nand Nunchuk controllers. Players can alternate between controlling\nCaptain Olimar and Louie as they point the Wii Remote controller at\nthe screen to select Pikmin and put them to work. A swarm of up to 100\nPikmin can be commanded simultaneously to explore new areas, locate\ntreasures, fend off enemies and solve puzzles.\n\nPikmin 2 marks the debut of two additional Pikmin types: white and\npurple. Purple Pikmin boast 10 times the strength and weight of other\ncolors, while white Pikmin are fast, resistant to poison and skilled\nat locating hidden treasure. Returning Pikmin types such as red,\nyellow and blue all have their own unique traits and abilities, too.\n\nStrategy is key as players choose which Pikmin to deploy for a given\ntask. With more than 60 different species of enemy characters and\nrandomly generated dungeons that span the planet, the game offers a\nfun array of challenges.\n\nPlayers can go head to head in frantic two-player battles or team up\nin a cooperative challenge mode.\n\nThere are no time limits in Pikmin 2, so players of any experience\nlevel can progress through the game at their own pace, heading\nstraight for the action or taking time to explore the beautiful\nhabitats.\n\n* Additional accessories are required for multiplayer mode and are sold\nseparately.","imageUrl":"https://media.rawg.io/media/screenshots/4ad/4ad9f6dedf9764d885d3e3071ebd963b.jpg","releaseYear":2004,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"GameCube"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"}]},{"id":22805,"name":"Rayman Forever","genre":"Action","price":0.0,"description":"In Rayman’s world, nature and people live together in peace. One day, the evil Mr. Dark defeats Betilla, the Fairy, and steals the Great Protoon, the provider of harmony and balance. The Electoons who used to gravitate towards it lose their natural stability and scatter all over the world. Strange phenomena begin to occur: freaks and hostile characters appear, capturing every Electoon they can find! The disappearance of the Great Protoon also neutralized all of Betilla’s powers, and she needs time to regenerate before she can help in any way. They definitely need a hero to save them, and it looks like you’re it. It’s now up to Rayman and you to rescue the world.A truly classic platformer that started the famous Rayman series!\nRayman was awarded both \"Best Music in a CD-ROM Game\" and \"Best Animation\" in Electronic Gaming Monthly's 1995 Video Game Awards\nColorful graphics, addictive gameplay and a memorable main character made this title one of best selling games of all time","imageUrl":"https://media.rawg.io/media/screenshots/1ca/1ca4dd8d59a77cb8d5891865d56213c2.jpg","releaseYear":1999,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22319,"name":"Andarilho","genre":"Action","price":0.0,"description":"Featured DLChttps://store.steampowered.com/app/1085400/Andarilho__Supporters_Pack\nAbout the Game\nAndarilho is a game about a guy trying to survive in a small city where you can drive the cars, scavenge for food, water and also build, craft, hunt and much more.Features:Drive\nHunt\nCraft\nBuild","imageUrl":"https://media.rawg.io/media/screenshots/c9a/c9acb48a5493f0d4bfccafd0593a6886.jpg","releaseYear":2017,"developer":"SC Jogos","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20983,"name":"Ford Racing 3","genre":"Racing","price":0.0,"description":"Ford is without doubt one of the biggest brands in the world, with one of the most famous product ranges ever. Ford Racing 3 takes this amazing range of vehicles, from the\nModel T Ford through to the latest concepts, and pits them against a huge variety of courses, cars and challenges.\nFeatures:\n• Compete in Ford vehicles past, present and future. Race 46 beautifully modeled vehicles from the Ford line-up, including a ’49 Ford, the F150 and the latest 2005 Mustang GT!\n• 26 detailed and diverse environments with animated and interactive scenery including road tracks, off-road and raceways.\n• A wide range of car themes – including concept, movie star, living legends, low rider and space age.\n• New modes to augment your Ford experiences, including relay, overtake, boost and a host of updated game modes.\n• A vast array of extras and unlockables including the latest Ford movies and pictures. A must-see for all Ford fans!","imageUrl":"https://media.rawg.io/media/screenshots/4ab/4ab042fa540b4b6acf1abd492b433a4f.jpg","releaseYear":2005,"developer":"Visual Impact","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"}]},{"id":20290,"name":"Parcel","genre":"Adventure","price":0.0,"description":"Parcel is a multi-character cyberpunk puzzle game where your goal is to solve interlocking laser puzzles by using the unique abilities of different characters. The game can be played alone or cooperatively with friends. The game features over 120 unique puzzles and a level editor which enables the amount of playable content to grow to unpredictable numbers. A puzzling future awaits!\nProviding an intellectual challenge like no other, Parcel will make players think and leave them thinking afterwards. The game follows a 22nd century postage company, touching on subjects such as post-humanism (pun very much intended) and virtual reality, with the full intent of boggling your minds with questions about the future that we, as humans and as gamers, are heading into.Features:Over 120 levels of a puzzling adventure divided into numerous distinct sectors\nSingle-player and local co-op - play the entire adventure alone or with up to 4 friends!\nSeveral unique characters with their own interesting personalities and special powers to help you solve even the hardest challenges - or to complicate things further\nA thought-provoking story about a not-so-unlikely future and its peculiar inhabitants - and a box\nGorgeous environments with moody, colorful visuals\nAn extensive level editor with endless creation possibilities – make your own puzzles and challenge the world!\nWe firmly believe that harnessing the creative spirit of the community is essential for Parcel, as there are literally millions of different mind-boggling puzzles that can be created with the character and level object combinations. We will continue to listen to community feedback and create the best possible way for players get puzzled and to puzzle each other!\nFor more information on Parcel, visit the official website at http://www.parcelthegame.com.","imageUrl":"https://media.rawg.io/media/screenshots/af1/af171a05097b85cd6b36e91409e23fef.jpg","releaseYear":2015,"developer":"Polar Bunny","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19856,"name":"OddPlanet","genre":"Adventure","price":0.0,"description":"OddPlanet is a side-scrolling adventure game inspired by Limbo and Oddworld. You will guide a lone little girl through the hostile environments of an alien planet and help her survive. She will share her feelings and thoughts. Prepare to experience atmospheric sounds, music in stereo and meet fascinating creatures in this beautiful, hand-painted world.\nGame is available in 5 different languages:\n- English\n- German\n- French\n- Polish\n- Russian","imageUrl":"https://media.rawg.io/media/screenshots/af7/af7353c7442c8eb3eafb027898ff8253.jpg","releaseYear":2016,"developer":"Indievision","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19696,"name":"Retrovirus","genre":"Action","price":0.0,"description":"Retrovirus is a   six degrees of freedom   shooter which sends players into the depths of a computer on a search and destroy mission against an invasive virus.  Retrovirus is being created by Cadenza Interactive, the indie studio behind the popular tower defense game   Sol Survivor.\nPlayers take command of an antivirus program, armed with the tools necessary to erase the virus’ very existence from the system.  Movement and exploration are core to the gameplay, and players are encouraged to adapt to the demands of a world where free flight is the norm.  Of course, the virus is armed to fight back, and first person shooter combat features heavily as players test their level of comfort with movement within the machine environment.  Each player is able to customize their antivirus program with different plugins, allowing for a variety of approaches to a given situation.\nThe Retrovirus single player campaign focuses on the core story of the game, with the player’s goal being the eradication of the virus and the discovery of its origins.  To defeat the virus, the player must solve puzzles, engage in dogfight-style combat, and explore the depths of the virtual world.\nRetrovirus also features multi-player modes, designed to engage players’ social and competitive sides.  Co-operative multi-player allows players to complete the campaign of the game with a friend, teaming up to restore the system to working order.  Competitive multi-player will focus on the core of the six degrees of freedom shooter, hearkening back to the action-oriented shooters of the late 90’s and early 00’s.Features Discover movement within a six degrees of freedom environment, free from the limits of traditional gravity-based environments.\nDelve into a two-layered story, exploring the real-world origins of a malicious computer virus and cleansing the inner workings of the infected system.\nFight battles, complete puzzles and explore an environment built for the free-flying citizens of the computer system.\nCustomize an antivirus program, focusing on strength, speed or cunning, with weapons and utilities to suit a variety of play styles.\nJoin with a friend to remove the virus from the infected computer by playing the campaign in co-operative mode.\nCompete against other players in a variety of multi-player modes, testing the limits of combat with six degrees of freedom.","imageUrl":"https://media.rawg.io/media/screenshots/87c/87cfe0185bf891696a1de329a709d8f0.jpg","releaseYear":2013,"developer":"Cadenza Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19029,"name":"Big Thinkers 1st Grade","genre":"Casual","price":0.0,"description":"Humongous Entertainment presents Big Thinkers!, the first educational products with personality – well, actually, two personalities. Ben and Becky Brightly, the superstar twins of learning and laughter, guarantee fun as they create ways for your child to master the lessons essential to success in first grade. The tumbling, twisting twins don't just host the curriculum-based activities, they are the activities as Ben and Becky flex and form into animals, airplanes, globes and other amazing shapes to help your children collect SmartStars, fill their Brain Banks, and demonstrate that your kids can do amazing things when they think big.\n16 fun activities to help your first grader learn amazing things.\nYour kids just may be ready for the circuit in Light Bulb Math.\nEveryone wins when they play First, Middle, or Last, the fun phonics game show.\nEven Ben and Becky's garage is full of fun things to do!\nAddition and subtraction are the games as kids buy Ben's Bargains.\nRewards are in store once kids have collected enough SmartStars to take on the SuperStar of Smarts Challenge.\nAll the animals get in the act when Ben and Becky become the Barnyard Band.\nSmartCharts allow you to track each child's progress.\nKids always feel successful as all of their efforts are rewarded with SmartStars\nThe pantry's the place as kids arrange the jars in Shelf Shuffle.\nBen plunges into the art world as your children create their own Murals.\nKids help pickup the pieces of the customizable jigsaw puzzles.\nThink 'n' Go ensures that your child's favorite activities are never more than a couple of clicks away.\nKids can use the simple interface to print out their favorite screens and activities.\nAdjustable difficulty levels allow many activities to grow with your child.\nBig Thinkers 1st Grade is the perfect learning supplement to your child's classroom experience. Ben and Becky Brightly's contagious wonder and ability to transform themselves into a variety of shapes and forms engage kids in a fun world of learning and discovery unlike any they have experienced before.\nYour little learners always feel successful as they collect oodles of SmartStars. All of their efforts and successes are rewarded on their way to the Superstar of Smarts Challenge. Your children are in control as they laugh along while the Brightly twins bend and stretch to provide activities that help kids learn all the skills necessary for success in first grade.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/cad/cada86bb06813953a8ee389ed245de65.jpg","releaseYear":2015,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17485,"name":"The Haunting of Billy","genre":"Action","price":0.0,"description":"Play as Billy, fighting through the haunted halls of an old, abandoned mansion. Battle zombies, skeletons, undead Vikings, mobster rats, and more on your way to defeating Death and saving your girlfriend. But that's not all, along your way pick up weapons and costume pieces from your fallen enemies to wear and acquire unique upgrades and abilities to aid you in your adventure.Features Over 1 million costume combinations to discover and wear to give Billy special abilities and upgrades\nMore than 60 unique weapons, spanning over several classes including swords, guns, magical staffs, and more\nProcedurally generated levels, enemies, bosses, and loot to ensure that every playthrough is a unique experience\nEarn points by beating bosses and progressing through the story to unlock new hallways, weapons, costumes, enemies, and more\nMake friends with just about any enemy along the way to help you fight through the haunted halls\nOriginal art, audio, and music","imageUrl":"https://media.rawg.io/media/screenshots/d4a/d4ad724d1e321ae554b13c2814279d45.jpg","releaseYear":2016,"developer":"Targon Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12184,"name":"Save the Ninja Clan","genre":"Action","price":0.0,"description":"SummarySave the Ninja Clan is a platformer for casual players as well as speed runners.  There are two ways to play this game: play through the normal story mode or find secrets/\"bugs\" in the game to annoy the Game Manager watching.\nStoryAn evil ninja kidnapped your friends. You must collect scrolls in order to find your friends and save them. You will play as different ninjas as the journey progresses. Each ninja has a different ability: Green ninja has a double jump, Purple Ninja has a sprint, and the Grey Ninja has a dash (with temporary invincibility).\nAlternate StoryYou can annoy the \"Game Manager\" by finding secrets/\"bugs\" in the game. Eventually he will get tired of you breaking the current level and send you off to the next one.\n-Gamepad/Controller Highly Recommended-Features30 Unique Levels.\nSecrets/Bugs in all non boss levels.\n3 Ninja types with different abilities.\n3 Boss Fights.\nGame too hard or too easy? Adjust the game speed.\nYou can unlock knife modifications.\nMany stats are tracked.\nReplays that show previous attempts.\nSecret ending which unlocks something secret.","imageUrl":"https://media.rawg.io/media/screenshots/0ca/0ca003d668203284fd6a593dd9925ff4.jpg","releaseYear":2017,"developer":"Sometimes You","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":11581,"name":"Lion Quest","genre":"Action","price":0.0,"description":"Take Jethro the Lion on a magical journey, traversing space and time to prevent the imminent collapse of the universe. Oh and your friend Ronald the Bear is missing, maybe you can find him whilst you’re out exploring? Discover a huge world and enjoy an adventure that blends together retro platforming fun with a mix of 2D + 3D mechanics and a modern design aesthetic.\nLion Quest includes the following cool features\nA 3D world navigated in 2D – Interact with the environment in new and unexpected ways, with huge collapsing structures adding an additional dimension to navigational puzzles\nZen and the Art of Mind Control – Use the power of your mind to control falling objects, or stop them dead in their tracks to create pathways and access new areas\nNew friends to discover – Solve puzzles and make friends as you meet other animals, controlling several at a time to progress through levels\nNine animals to play as – Unlock new characters by completing goals or spending coins (collected in-game) at the Lion Quest gift shop. Each character has its own stats and special abilities, which can dramatically change the way the game is played\nPlay with or against friends in local multiplayer – Take on the Lion Quest adventure with a friend in 2 player co-op, or play competitively with up to four players across fifteen maps in Lion Quest VS.\nPure platforming – Enjoy exploring with precise controls, plenty of challenge, and handcrafted levels with branching paths\nLion Quest Arcade – Play through 50 arcade stages that combine all-new levels with remixed content from the main game\nZen sounds – Enjoy an ambient soundtrack designed to increase concentration and relaxation","imageUrl":"https://media.rawg.io/media/screenshots/76b/76b95b6fc4c8804b3b99cc4dd11b1139.jpg","releaseYear":2016,"developer":"Dracula's Cave","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9927,"name":"The Last Weekend","genre":"Adventure","price":0.0,"description":"«The Last Weekend» - This weekend you'll never forget.\nThere are four characters for the player to choose from:\nRita – journalist\nAlice – model\nPaul – programer\nAnthony – athlete\nThey all have different abilities. Important thing is that the game shows individual scenario for each character.\nAs a quest game it requires a player to collect a number of items and set them together to move forward, carry out some tasks and communicate to other characters. By the way, dialogues are pretty plain and legible for users.\nThe best for last: you should have noticed it's AO rated product (18+) and there're really some fruity moments. Young boys and girls in a lake hotel, miles from nowhere – all these already feels erotic. Guys don't mind getting a peep of girls in the shower or watch some sexy pictures of their girlfriends on the Internet. What else the developers may put in the game is anyone's guess.","imageUrl":"https://media.rawg.io/media/screenshots/ab5/ab5ae4b0ff90d2755c380f1733f78c43.jpg","releaseYear":2017,"developer":"KEXBOY","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":5394,"name":"Mega Man 9(2008)","genre":"Action","price":0.0,"description":"Mega Man fans, your wait is over! The classic Blue Bomber that debuted in 1987 is back with the ninth installment in the classic series. It's a new adventure for Mega Man all done in an 8-bit style -- graphics, music, and gameplay are all like you remember them!\n©CAPCOM CO., LTD. 2008 ALL RIGHTS RESERVED.\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©CAPCOM CO., LTD. 2008 ALL RIGHTS RESERVED.","imageUrl":"https://media.rawg.io/media/screenshots/0a0/0a0cba48a75ae2abcbad67d132d7b5da.jpg","releaseYear":2008,"developer":"Capcom U.S.A","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":5362,"name":"Puzzle Quest: Galactrix","genre":"RPG","price":0.0,"description":"The puzzle game of the future has arrived! The original best-selling new Puzzle franchise is back in an all new dimension with its signature Match-3, turn based battles in an insanely addictive and masterful hybrid of RPG and Puzzle genres. Take on the role of a rogue pilot scouring the galaxy to uncover clues in an intergalactic mystery that affects the fate of the entire universe. Build up a fleet of ships, discover hundreds of different weapons, and master the new puzzle board!\nKey features:\nOver 30 hours of gameplay!\nAll new redesigned Puzzle board\nOver 150 different weapons to use to control the board\nCustomize and build a fleet of ships to master the galaxy\nHundreds of missions within single player game","imageUrl":"https://media.rawg.io/media/screenshots/70c/70c56dffb3dc3fd59cc5f08358157064.jpg","releaseYear":2009,"developer":"D3 Publisher","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"}]},{"id":5343,"name":"Syphon Filter 2","genre":"Action","price":0.0,"description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nDeadly Espionage in a World Held Hostage!\nGabe Logan is back and it’s your job to stop a deadly virus from spreading.  Armed with a whole arsenal of deadly weapons, take control of sniper rifles, nightvision rifles, flamethrowers or sneak up behind your enemies to take them out directly. Experience the 2 player mode, play as Lian Xing or mix things up with your friends in deathmatch!\nDownload this PS one® Classic today!\n\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 899 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\nSyphon Filter®2 ©2009 Sony Computer Entertainment America All Rights Reserved.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","imageUrl":"https://media.rawg.io/media/games/ddb/ddbbb508187fb6b37a51d58e148ef90e.jpg","releaseYear":2000,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 4"}]},{"id":797955,"name":"Endlanders: First Encounter","genre":"Action","price":0.0,"description":"Wishlist The Full Versionhttps://store.steampowered.com/app/1905960/Endlanders/\nAbout the Game\nOur Kickstarter Campaign is now LIVE !\nSupport us here and earn exclusive rewards!\nhttps://www.kickstarter.com/projects/endlanders/endlanders\nBuild your deck, glitch through enemies, translate unknown languages and decipher the mysteries of this universe, in this grid-based real time combat indie game.\nEndlanders features two main characters with diverging storylines in the same universe, fighting and exploring their way through vastly different planes with anachroninstic themes.\nThe game features :\nA grid-based real time combat, where our two characters have distinct gameplay styles :\nFast-paced tension, with multiple spells and a huge variety of enemies :\nA deck-building system, where cards are instant spells :\nAnd a translation system, where by collecting runes the player will be able to advance the story further :\nGlitching through terrain and objects to find hidden areas :\nThe game takes place across many planes, and each character visits a few of them, exploring, researching and trying to understand a strange substance called Source, which appears on all living (and some times not) lifeforms. Players will keep their thoughts on their log which is updated throughout the game through interactions.\nEach character analyzes the mysteries of this substance in their own manner, offering different insights.\nOur two playable characters are :\nCosmos, who has a more combo-oriented fast combat style, and their attacks emphasize by building combo points using \"Tempo\" cards, and using \"Finisher\" cards that deal more damage based on the amount of combo points. However if some time passes and they haven't landed a hit, the combo points reset to zero, and since finisher cards deal most of the damage, starting a combo but letting it fall flat will decrease the damage output.\nCosmos is more concerned with the \"why\" questions regarding this substance, and their log has entries that explore themes of purpose, faith and existentialism.\nand Quls, who has a more reactive calculated combat style, and their attacks fill the tank with gas by using \"Combiner\" cards, or deplete it by using \"Diffusant\" cards. However being at the edges (full tank or empty tank) might cause unexpected outcomes, such as explosions or debuffs, so the player need to be careful. Being at edges however has its own rewards, since Quls's attacks deal more damage if their chemtank is empty or full.\nQuls is more concerned with the \"how\" questions regarding this substance, and their log has entries that revolve around how to use this substance, how to create it, and it's interactions.\nOur characters could be conceived as binary opposites on their thoughts and actions, however the more players indulge on the story the more they will understand that things are more complicated.\nThe prologue only features the first plane and only 1 playable character, Cosmos.","imageUrl":"https://media.rawg.io/media/screenshots/2c6/2c6637dae7243724154d73c1dffaeb45.jpg","releaseYear":2022,"developer":"Eteros Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":640196,"name":"The Plane Effect Prologue","genre":"Adventure","price":0.0,"description":"https://store.steampowered.com/app/1448760/The_Plane_Effect/\nA time-and-mind bending adventure game...\nIt's your final day at the office, it is time to clock out and return home - loomed over by a cosmic anomaly with an oppressive, otherworldly force. Helpless over the cosmos, all you know is that you must return to your family, as soon as you can.\nFind your way home by any means...\nAs you progress through the dystopic cityscape, you quickly you realise all is not as it should be. Did it always take this long? Were the streets always a labyrinth? Where even is \"home\"? All you know is that you must keep pushing ever onwards, you must keep going.\nNavigate through a dystopian society\nNavigate beautifully and elaborately designed, otherworldly environments and solve unusual puzzles to keep Solo moving through each area. Players have the option to figure out puzzles step-by-step with no hints, or activate a little guidance on your impossible journey through 'Assisted-Mode'.\nA sinister presence follows\nKeep Solo moving. Onwards, to his family, back home. Do not stop, do not turn back.","imageUrl":"https://media.rawg.io/media/screenshots/f95/f95cef7efbd63864d09f3446ccd2241f.jpg","releaseYear":2021,"developer":"Innovina/StudioKiku","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":635274,"name":"Reverie Knights Tactics: Prologue","genre":"Adventure","price":0.0,"description":"WISHLIST THE FULL GAME!https://store.steampowered.com/app/1399690/\nCHECK OUT MORE GAMES FROM 1C ENTERTAINMENThttps://store.steampowered.com/app/1543430/\nhttps://store.steampowered.com/app/1371690/\nhttps://store.steampowered.com/app/1406780/\nJOIN OUR NEWSLETTER!\nCHECK OUT EVEN MORE GAMES FROM 1C ENTERTAINMENThttps://store.steampowered.com/app/699170/\nhttps://store.steampowered.com/app/1287530/\nhttps://store.steampowered.com/app/1182420/\nAbout the Game\nReverie Knights Tactics: Prologue takes you on a journey to a hand-drawn fantasy world, where you guide your heroes through the first hour of the upcoming tactical RPG. The Prologue version introduces you to the game’s story and includes three battles, as well as item crafting and character customization.\nEmbark on an expedition to find Lennorien, the long lost elvian city to save your loved ones, while fighting the goblin menace that spread terror across the continent!\nLead your party of heroes, each one with distinct, special abilities and skills, allowing you to use multiple battle strategies to defeat your enemies.\nDiscover a fantasy world featuring deep map and scenario exploration in an epic adventure, visual novel style!\nCraft new items and accessories from the treasures you collect and use them as tactical advantage every time you configure your characters.\n\nKey Features of the Prologue:Beautiful Hand Drawn Art: Meticulous multilayer artwork from pencil sketch to full detail color.\nDecision-driven Storyline: Make decisions through your quest, affecting the story and other characters` reactions.\nCharacter Customization: Customize character`s performance attributes, skills, and accessories for heightened abilities!\nItem Crafting: Collect powerful items as you explore the world and discover combinations to create new items.\nBattle Phases: React to your opponent's strategy and come up with the perfect tactic every turn, challenging you to think ahead.\nInteractive Battle Scenarios: Manipulate parts of the battle environments, and use scenario effects to your advantage!\nMultiple Battle Grids: Each battle contains a different isometric grid, making every battle an unique experience.","imageUrl":"https://media.rawg.io/media/screenshots/171/17134fbef63f045fa425750c784151ca.jpg","releaseYear":2021,"developer":"40 Giants Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":542592,"name":"Farm Manager 2021: Prologue","genre":"Strategy","price":0.0,"description":"Check out more games from our publisherhttps://store.steampowered.com/app/1123830/Farm_Manager_2021/\nhttps://store.steampowered.com/app/495560/Farm_Manager_2018/\nAbout the Game\nGet ready for a logistic challenge in the next part of the best-selling series, which has been sold in over 70,000 copies! In Farm Manager 2021: Prologue, as a farm manager, you have to ensure the right level of harvest, employee satisfaction, animal health, equipment efficiency and proper crop processing. Thanks to the new, more intuitive interface, employee management is even simpler. The layer mechanic will allow you to spot the most important events on the farm faster.\nIn Farm Manager 2021: Prologue you will find even more plant species to grow. Now also organic ones! Grow fodder beets, grass, oats and tomatoes. Observe plant growth. The new mechanics allow automatic field management using available employees and machines.\nEnjoy a variety of machines that you can use when working in the field. Buy and sell them on the stock market. Look for bargains among used machines.\nIn Farm Manager 2021: Prologue you will find cows, sheep, goats. For the first time, you will be able to set up a deer farm.\nLogistics building, mechanic’s garage, veterinary clinic and much more! The logistics center will allow you to transport larger quantities of resources and products easier and faster. In the mechanic’s garage, they will take care of your agricultural machinery. Employees from the veterinary center will ensure the health of your farm animals.\nPrepare fields in spring, care for plants in summer, harvest crops in autumn and grow plants in greenhouses in winter. The weather can be dangerous for your farm - a thunderstorm can cause a fire that will damage your buildings.\nA satisfied employee is a good employee! Hire permanent and seasonal employees. Keep employees satisfied, control payroll and overtime. Increase their qualifications through trainings. Remember that everyone deserves a rest. Angry employees can leave at any time, so it’s really worth taking care of them.\"","imageUrl":"https://media.rawg.io/media/screenshots/ff5/ff58c2d4171f415b768a0ecfd4b70ef9.jpg","releaseYear":2021,"developer":"Cleversan Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":493455,"name":"El Hijo - A Wild West Tale","genre":"Strategy","price":0.0,"description":"El Hijo - A Wild West Tale is an exciting spaghetti-western stealth game, in which you guide a 6-year-old boy on his quest to find his mother.\nAs a six-year-old, \"El Hijo\" must always sneak past the dangers of his world. As he overcomes his challenges, he gains self-confidence and cunning and with it more schemes to get past his foes. On his journey, he will find himself in a remote monastery, a harsh and unforgiving stretch of desert and a frontier town rife with crime and villainy.\nThe journey begins when a farmer and her son El Hijo are attacked by bandits who raze their farm to the ground. The mother decides to leave \"El Hijo\" at a secluded monastery in order to protect him. However, El Hijo decides that the monastic life is not for him and decides to escape. \"El Hijo - A Wild West Tale\" is a non-violent stealth game. Violence is instead exchanged with the mischievous, playfulness of a young child. Shadowplay is in the core of the game and \"El Hijo\" will often have to hide. Without needlessly adding new mechanics, the gameplay is extended naturally, as variations of existing mechanics are gradually introduced and then combined with each other to increase the challenge. These twists on familiar mechanics are often a product of the varied, increasingly dangerous environments that \"El Hijo\" must traverse to reach his ultimate goal.\nFeatures:Survive the Wild West with the cleverness of a young hero\nExplore dark monasteries, deserts and boomtowns in a spaghetti-western world\nMerge with the shadows to hide from the lawless\nSolve playfully tricky environmental puzzles\nUse a playful arsenal of tactical toys to bypass and distract diverse desperadoes\nInspire other children towards the path to freedom\nEnjoy the gripping storyline of a brave son searching for his mother","imageUrl":"https://media.rawg.io/media/screenshots/fbe/fbe0636ae090cdf40ef074896466bd8b.jpg","releaseYear":2021,"developer":"Honig Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":419890,"name":"I Am Dead","genre":"Adventure","price":0.0,"description":"I Am Dead is a charming puzzle adventure game from the creators of Hohokum and Wilmot’s Warehouse about exploring the afterlife.\nI am Dead is a charming puzzle adventure game from the creators of Hohokum and Wilmot’s Warehouse about exploring the afterlife.\n\nMorris Lupton is the recently-deceased museum curator of the tiny island of Shelmerston who is reunited with the ghost of his dog Sparky, only to discover that a disaster is about to destroy his beloved island.\n\nTogether, they must uncover Shelmerston’s ancient mysteries, prevent the island’s volcano from erupting, and save the place they call home.\n\nMorris and Sparky must unearth a number of Shelmerston's lost and scattered ghosts. To find them, the duo must visit the places they spent time in, dive inside the memories of the people who knew them best, and learn the stories of their lives. \n\nTo help with their mission, Morris uses his newfound power that allows him to peer inside objects and people to reveal their contents and memories, like a supernatural X-Ray!\n\nAlong the way you will discover many stories about the history and folklore of Shelmerston, and its cast of curious inhabitants and visitors: tourist finches, the fishfolk, morlos, and the Legend of Aggi - the one who originally silenced the volcano...","imageUrl":"https://media.rawg.io/media/screenshots/862/8627284a16e62fd5b36aee25ce041bd0.jpg","releaseYear":2020,"developer":"Richard Hogg","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":385427,"name":"When The Past Was Around - Prologue","genre":"Adventure","price":0.0,"description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1164050/\nAbout the Game\nFrom Brigitta Rena, the creator of A Raven Monologue and She & The Light Bearer.\nWhen the Past was Around is a story about love, moving on, letting go, and the joy and pain of everything in between.\nThis is the story of Edda, a girl in her early 20s. Just like any other people in her age, she’s lost. She lost her way to achieve her dreams, she lost her way in the journey to find love. That until she met The Owl. The man that would help her burn her passion, the man that would help her find the spark in a relationship, and also the man that would teach her about heartbreak.\nThe game tells a bittersweet tale between a girl and her lover in a surreal world consisting of disjointed rooms from memories and time. With each gathered clue, solved puzzles, and unlocked door, the girl will find her way, unraveling the secrets between her and her lover, the secrets which she used to know.Features:Personal and ubiquitous. It's a game about overcoming the past and finding the self\nOpen the treasure chest, drink tea, doing laundry. Various puzzles to solve and many mysteries to uncover in everyday familiar objects and activities\nA sweet and whimsical journey set in a series of hand-drawn, down-to-earth settings\nAtmospheric violin music will accompany you from the peaceful days to the angstiest moments\nThis game was part of #MojikenCamp, an internal upgrading program by Mojiken Studio to experiment with how to tell stories or to communicate an experience within the constraint of interactive art medium.","imageUrl":"https://media.rawg.io/media/screenshots/daf/daf4b6886e6dc5eb50a00f3a30bec6c3.jpg","releaseYear":-1,"developer":"Mojiken","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":307191,"name":"Survivalist: Invisible Strain","genre":"Action","price":0.0,"description":"This is the sequel to Survivalist, currently still a work in progress so watch this space for more details!\nSurvivalist: Invisible Strain is an open-ended game about building a community after the collapse of civilisation.  You can recruit survivors by making them like you, or respect you, or fear you.  You'll need to keep them warm, keep them fed, and build a settlement to keep them safe from zombies, looters, and whatever else is out there.  Use stealth, weapons, or words to achieve your objectives.  Initially it will use a randomly generated world, with a story mode to follow later.","imageUrl":"https://media.rawg.io/media/screenshots/fce/fce32d5676d2f6b7c0cd6586def00e4a.jpg","releaseYear":-1,"developer":"Bob","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":266217,"name":"Abandoned","genre":"Action","price":0.0,"description":"Abandoned is a survival horror game set in an abandoned building with authentic abandoned building exploration. To survive you must find all the keys in order to escape while avoiding the creatures that lurk within.","imageUrl":"https://media.rawg.io/media/screenshots/605/6059a513427a690f469d57f0821cd4fe.jpg","releaseYear":2018,"developer":"Devious Minds","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61907,"name":"Mars or Die!","genre":"Action","price":0.0,"description":"TOUCHDOWN IS IMMINENT: MARS WILL BE OURS!\nThe Interplanetary Spacecraft FORTITVDO VIII carries our Intrepid Explorers who are tasked with Scouting the Martian soil, Fighting the disgusting Martian natives, and Building Defensible Outposts spearheading our inevitable conquest. Our Supremely Illuminated Leader has bestowed upon YOU the honor of commanding them: survive, gather, and build our way to victory!\nScout B. Bean, Engineering CorpsTop of his class, the fastest runner of our Glorious Army. Equipped with a personal Energy Repulsion Shield, capable of deflecting the most devastating of blows! Scout Bean loves flowers, and beans.\nMajor B. Bob, VI Assault DivisionImplacable marksman with a fervent passion for our cause, chocolate, and ballet! Major Bob may move slower, but no Martian will be quick enough to run away and tell the tale.\nBase BuildingOur Explorers hold all the necessary blueprints for efficient on-site mining operations and base building including Automatic Extractors, O2 Generators, Armories, Single-Barrel and Double-Barrel Automatic Defence Turrets, and the most important of them all, our Glorious Flag!\nA Campaign to RememberThe Masterful Invasion Plan we envisioned is divided in 9 Missions. Our conquest will be swift, sure, and certain! But, in case the pitiful Martians manage to put up a fight due to their sheer number, we are also prepared to entrench and endure an Endless warfare.\nIt will be glorious! Mars, or Die!","imageUrl":"https://media.rawg.io/media/screenshots/afe/afe1bfe474808cdfed1181c9cdd35691.jpg","releaseYear":2018,"developer":"34BigThings","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":59674,"name":"Eximius: Seize the Frontline","genre":"Action","price":0.0,"description":"Eximius is a Strategic Action Shooter (FPS/RTS Hybrid) that focuses on squad-based combat.\nEximius combines tactical First Person Shooter gameplay with high level strategic decision-making of a Real-time Strategy(RTS) game. The game features a competitive 5v5 team battles where players square off in a post apocalyptic urban environment.\n\nPlay as a Commander ( RTS ) ; build base, train an army and call down support abilities to help   your allies on the ground to gain territory.\nPlay as an Officer ( FPS ) ; lead your infantry squad into combat and crush your enemies with your agile tactics or brute force. Capture resources for your team, upgrade weapons and equip your squad with suitable weapons.\nEximius provides a multi-role gameplay experience where each player could choose to play a diversely different role and fight not only with brawns but also with their brains. An expert shooter could be outnumbered, ambushed and overwhelmed if caught in a wrong position. While a scheming officer could be assassinated in the right moment at the frontline.ObjectivesThe objective of the gameplay is to win by holding down the most victory points. Alternatively , if your forces are powerful enough , you can completely destroy your enemy’s base and win the match immediately. The command headquarters cannot be rebuilt and the game will be instantly over.\nAxeron Corporation ( AXR )\nAXR is private research organisation that turned into a security contractor out of  global needs. Being at the forefront of science, many believes that this wealthy organisation holds key technologies that could bring about global peace. With limited manpower , the Axeron industrial complex produces highly advanced drones for their workforce , both for military and nonmilitary use. This elusive organisation operates in an extremely organised and stealthy manner. Nations that choose to fund AXR do so for their advanced scientific capability and confidence that they will be the solution to the growing mutant threat.\nGlobal Security Force ( GSF )\nA peacekeeping organisation set up after the first initial great war; the GSF foundation is built upon the principles of securing the walls, recovering human survivors and rebuilding the civilized world. They command the largest military force in the world and operates on a near limitless budget. Nations that choose to fund GSF do so for their vast armies and their global presence.\nSeamless Transition\nAs a commander , you are also an officer. But you have the extra capability to switch to top down RTS interface to build bases and command units. An aggressive commander can also join the battle in the frontline but they are normally expected to stay in relative safety and manage base development. Commander needs to be nominated by the team.\nBase Building\nAs the gameplay of Eximius revolves around Team vs Team battles, each team shares a base, resource and technology tree. RTS Commander to support the battle operations by training infantry units and vehicles,building bases and call in airstrikes or support abilities.\nTrain Armies\nCommander can train AI infantry and assign them to players. Leading them as a frontline officer; your squad will fight with you sensibly , taking cover and help you both offensively and defensively.\nTactical Battles\nDecide your combat roles and purchase weapons suitable to your play style and tactics. Your weapon and equipment determine your roles in the team. Respond to enemy strategy with appropriate firepower and equipments; be it vehicles , massive amount of infantry or sneaky players.\nUnlock Technologies\nAs your resources and technology grow, you can construct increasingly powerful units such as armored vehicles, gunships and elite soldiers. Your team can also gain powerful team abilities when you tech up to new tiers. Call down artillery, deploy quick-response force or launch EMP strikes.\nBattleSuits\nThe pinnacle of each team’s firepower is the legendary battle-suit. Equipping battlesuits allow players to use powerful abilities, have increased stats and is able to push the frontline much faster. Officers will have choice of several choice of battlesuits, each with their own play style and set of abilities.","imageUrl":"https://media.rawg.io/media/screenshots/cb4/cb470ae3d3e157168da4a30242eb0c26.jpg","releaseYear":2021,"developer":"Ammobox Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51545,"name":"Slay.one","genre":"Action","price":0.0,"description":"Slay.one is a fast-paced top-down multiplayer shooter with many exciting PVP and Co-op game modes. Select from a range of different weapons and abilities and customize your look with different skins for your own unique battle setup, fight with other players online, and no pay to win.\nFeatures:\nFast-paced online action and NO pay to win!\nSecure dedicated server\nMany game modes such as Infection, Team CTF, Team Deathmatch, Deathmatch and more!\nCreate your own map using map editor\nConstantly adding new weapons with new game mechanics, such as machine guns, shotguns, rifles, many types of laser weapons, heal guns,  shotguns, rifles, sniper rifles, and many other weapons.\nLots of active players around the world. Super easy to find a fun match.","imageUrl":"https://media.rawg.io/media/screenshots/2c4/2c4fa5c8366dd3d5110403c76ef818d5.jpg","releaseYear":2018,"developer":"Slay.one","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51225,"name":"Post Scriptum","genre":"Action","price":0.0,"description":"Feature List- 50 vs 50 multiplayer PvP battles\n- Parachuting into action\n- Photo scanned 3D Uniforms\n- Artillery and Airstrike support\n- Vehicles using realistic values, such as turret speed, armor thickness etc..\n- Authentic level at a 1:1 scale based on military archives and historical maps\n- Faithfully recreated historical weapons, vehicles and famous landmarks\n- Base building, fortification and barricades\n- Logistic and supply runs to help fortify your position and rearm friendlies\n- Towing system for supplies\n- In game Voice Over IP with proximity fade\n- Player driven objectives in Sandbox game mode\n- Full access to PS SDK to add or modify content\n- Steam Workshop support\nContent:\n- 5 maps for a total of 140 km² of authentic playable area\n- 3 game modes, such as “Offensive”, “Stratagem” and “Sandbox”\n- More than 40 faithfully recreated vehicles and 50 authentic weapons\n- British & German factions, including the 1st Airborne Division, XXXth Corp, Waffen SS and the Wehrmacht\n- The entire western vicinity of Arnhem in 1944 and Arnhem city center with its famous bridge too far\n- Source Development Kit for you to add or modify content.\nAbout the Game\nPost Scriptum is a WW2 simulation game, focusing on historical accuracy, large scale battle, difficult learning curve and an intense need for cohesion, communication and teamwork. Players will relive the events of ‘Operation Market Garden’ across the fields and towns of Holland. This massive Allied assault consisted of a coordination of the British and American Airborne to capture key bridges while the British XXXth Corps moved to reinforce them through Highway 69. However, consecutive delays in consolidating ground from the north of Belgium through Nijmegen forced the 1st British Airborne Division in Arnhem to make a stand much longer than anticipated. With no successful link between the XXXth Corps and the Airborne in sight, the seventh and final bridge in Arnhem was considered lost.\n‘The Bloody Seventh’ is our name for the initial focus of the project as we feel it succinctly details the struggle that the British paratroopers had to endure while waiting for their army counterpart to establish a link through the lower Rhine.\nPlayers will be given the option to fight with the British Airborne Division, British XXX Corps or several branches of the German Army, such as the Wehrmacht or the Waffen SS. It’s a rare opportunity to experience the intense battlefield that was the Battle of Arnhem, which stretched across farms, woods, villages and city areas. Each area is being accurately recreated from archival references that range from street level to aerial images. Whether you’re jumping out of a plane, resupplying friendlies or operating a tank you will find multiple reasons to drop back into the battlefield in this grand scaled representation of a WW2 setting never explored in a large multiplayer environment.","imageUrl":"https://media.rawg.io/media/screenshots/cee/cee4ce1e29dfdebdacfa76eed78ecc9b.jpg","releaseYear":2018,"developer":"Periscope Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46521,"name":"Caligo","genre":"Adventure","price":0.0,"description":"Caligo is a small atmospheric walking simulator. It's an interactive story where you mainly have to look and listen.\nCaligo is the darkness everyone descends into one way or another, and to each of us it's something different. For some it's a short but exciting adventure, some will see it as a place to relax. Yet others will be reminded of their worst nightmare, while for a few, it might come as a revelation. One thing is certain however: everyone will have to answer one big question.\nWhat you'll find there:\n- Various characters - each will have their own connection to the story\n- Unusual settings, each with its own unique atmosphere\n- 100% voiced dialogs which actually make sense and which will eventually form the full story of the protagonist\n- A choice that'll help understand yourself better","imageUrl":"https://media.rawg.io/media/screenshots/118/118f00b54465579baf2e3f245ca5980b.jpg","releaseYear":2017,"developer":"Krealit","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":31442,"name":"X-Tension","genre":"Simulation","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/906/9066a0217b72156998f9133fdb4d175f.jpg","releaseYear":2000,"developer":"Egosoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28923,"name":"Naruto The Broken Bond","genre":"Action","price":0.0,"description":"Building on the success of NARUTO™: Rise of a Ninja, this new adventure takes the story to a deeper level within the Naruto Universe.  Now a respected ninja, Naruto evolves into a mature and strong hero.  However he will soon find himself surrounded by conflict.  Forced to relive bitter memories, Naruto's best friend Sasuke strikes out on a self-destructive quest for power.  Now with the help of his friends, Naruto must confront Sasuke and save him before it's too late.","imageUrl":"https://media.rawg.io/media/games/df9/df99e30c60086b2c630baa08be38c897.jpg","releaseYear":2008,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28845,"name":"3 on 3 NHL Arcade","genre":"Sports","price":0.0,"description":"(Online Interactions Not Rated by the ESRB) EA SPORTS Freestyle™ welcomes you to the fast paced world of arcade hockey. From the same team that brought you NHL® 09 comes a 3 on 3 experience that throws conventional hockey, and its rules, out the window. Choose from the NHL’s top players and bring them into this no rules hockey game where big hits rule the day. The Trial Mode gives you a taste of the greatness that is 3 on 3 NHL® Arcade, to get a full bite, download the full version today. The full version offers 8 Powerups, Online Game modes, Leaderboards and Achievements. Download the Full Version today!©2009 EA Inc. All rights reserved. Trademarks are property of their respective owners.13+ TO REGISTER WITH EA ONLINE. EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON www.ea.com OR 30 DAYS AFTER THE LAST DAY OF THE 2008- 2009 NHL SEASON. There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/74e/74e79cbdefe91bd99fbc71fad577a141.jpg","releaseYear":2009,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":26563,"name":"Sonic Colors","genre":"Platformer","price":0.0,"description":"Sonic the Hedgehog races through incredible theme park inspired worlds\nto rescue a colorful alien race from the clutches of Dr. Eggman. With\nunique power-ups fueled by the alien’s energy, Sonic is able to access\nhidden areas like never before!\n\nThe diabolical Dr. Eggman has hatched another plan for world domination!\nHe has built an amazing interstellar amusement park, floating in space\naround Sonic’s home planet, bursting with incredible rides and\nattractions. However, all is not as it seems as Dr. Eggman has abducted\nan alien race called Wisps, and is harnessing their colorful energy to\nfuel a sinister plot. However, before Dr. Eggman completes his evil\nplans, Sonic discovers his mysterious theme park in space. When he\narrives, Sonic finds he is also able to use these alien powers and is\nready to help! Sonic will need all his speed and skill as he faces this\ntest, but, empowered by the alien energy, it’s a test he’ll pass with\nflying colors!\n\nSonic Colors accelerates Sonic to adrenaline-pumping super speeds and\nblasts him through obstacles in ways never before seen in a Sonic game.\nThe alien Wisp’s featured in the game each have a unique “Color Power”\nthat, once freed, Sonic is able to absorb while speeding through the\nvarious theme park inspired planets. The Wisp energy enables Sonic to\ncreate new paths through the stages by drilling through the ground\n(Yellow Drill) for example, or speeding through the stage as a laser\n(Cyan Laser). Stringing the Wisp power-ups together creates a combo that\nincreases Sonic’s boost gauge even more quickly and exclusive Wisp\npower-ups will be available for both Wii and Nintendo DS versions,\nensuring a unique and super speedy gameplay experience for Sonic fans\neverywhere.\n\nFeatures\n\n• Non-stop high-speed action\n• Collect and engage the new\npower-ups derived from the colored energy of the Wisps!\n• Unique\nColor Power for the Wii and Nintendo DS\n• Perfect blend of 3D and\nclassic 2D perspectives on Wii and solid 2D dual-screen gameplay on\nNintendo DS!\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","imageUrl":"https://media.rawg.io/media/screenshots/301/301794daf083099e2d31086ae475aac5.jpg","releaseYear":2010,"developer":"Sonic Team","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"}]},{"id":23106,"name":"SimCity 3000 Unlimited","genre":"Simulation","price":0.0,"description":"Create and control your urban empire with more power than ever before. With SimCity 3000 Unlimited, you get all the great features of the original SimCity 3000 plus much more. Expand your SimCities with two new building sets from Asia and Europe. Take on 13 challenging scenarios or create your own. Unleash four new disasters including an unforgiving whirlpool and plummeting space junk. This is truly SimCity without limits!Re-create cities from around the globe with hundreds of new buildings.\nReunify East and West Berlin in one of 13 scenarios.\nSpruce up your city with over 95 world landmarks.\nProtect your citizens from four new disasters.\nSelect hundreds of buildings from SimCity 3000 and all-new Asian and European buildings.\nCreate unique masterpieces for your metropolis with the Building Architect Plus tool.\nInflict 9 disasters-including toxic clouds, plague of locusts, space junk, and a whirlpool.\nPlay 13 challenging scenarios or make your own with the SimCity Scenario Creator.","imageUrl":"https://media.rawg.io/media/screenshots/5a0/5a08b73f7fe6f1e8dc956ab5b4667c2b.jpg","releaseYear":2000,"developer":"Maxis","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]