[{"id":16131,"name":"Dragon Nest Europe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63c/63c70582b76e5708dcdb3f3f13223967.jpg","description":"Dive into blazingly fast combat action with visually stunning skills in a world caught in the wake of ancient dragons and waiting for the ancient Prophet to discover her powers. Immerse in an epic story with classic MMORPG and role-playing elements paired with a unique, console-like third-person perspective.\nKey Features\nDynamic Combat:\nNo monotone “click and wait” or “turn-based” combat! Experience blazingly fast console quality action and thrilling combos for intense, non-stop action in a magical world.\nClass and Specialization System:\nNine main classes with their own unique fighting style. Develop your character by individually specializing in more and more detailed combat skill trees.\nIntuitive and Engaging Game Play:\nClear goals paired with intuitive, convenient controls encouraging a wide range of players to become fully engaged in the action and dive into the game.\nPlayer vs. Player (PvP):\nA unique and balanced PvP system, harmonizing each challenger's gear with the enemy's one. Only the most skilled players will endure the fierce combats across many different modes and maps.\nDungeon-heavy Game Play:\nVenture through dozens of dungeons and challenging Nests with hundreds of quests.\nPlay for free:\nNo payments necessary, Dragon Nest is completely free to play.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Eyedentity Games","platforms":[{"id":0,"name":"PC"}]},{"id":10403,"name":"Lakeview Cabin Collection","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef6/ef62869a2214861b8e83ceda6846c2fa.jpg","description":"Relive the horror movies of the 70's and 80's by answering the question: What would you do if you found yourself in a slasher film?\nThe Lakeview Cabin Collection is an exploration of the world of cult horror movies through four episodes, each with their unique themes and features.\nPlay as four companions as they use anything they can find to survive in a horror experience unlike any other.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Roope Tamminen","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10366,"name":"Gloria Victis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf3/cf3e36b3c8df46feca1829c1c29c91a6.jpg","description":"Gloria Victis is a MMORPG with an emphasis on realism, set in a low-fantasy medieval open world. Enjoy skill-based non-target combat, open PVP with territory control, deep, expanded crafting system, player-driven economy and a mature, extensive storyline – all that served with beautiful, realistic graphics and immersive atmosphere.\n\nChoose one of two nations: proud Midlanders inhabiting vast green lands or vengeful Ismirs from the frosty North and join the conflict!\nFEATURES:\nNon-Target Combat – Engage in action-based, non-target combat where your skills and tactics matter! Prove your skills and earn fame as an undefeatable duelist, eagle-eyed archer or respected commander inspiring your allies in battle!\nOpen PVP – Fight to the death in tournaments, towns and castles sieges and epic wars where entire armies collide!\nTerritory Control – Conquer the lands, siege non-instantiated towns and castles and develop fortifications to earn an advantage in the everlasting conflict of the realms!\nInnovative Partial Loot System – Defeated your enemy? Take your reward, selecting which specific items you would like to loot – but hurry, the clock is ticking!\nFame and Disgrace – Be a part of a living feudal society, establish your reputation and move up the feudal hierarchy, leading your allies to victory under your guild’s banner – or run and hide as an outlaw!\nComplex Crafting System – Look for the best resources and materials, use crafting workstations and co-operate with others to increase your efficiency and achieve mastery in one of 8 different realistic crafts. The economy is in your hands – swords don’t drop from wolves but are forged by the blacksmiths!\nClass-less Progression – Become who you want to be, shaping your character without artificial classes and fully customizing your equipment using hundreds of available items!\nOpen Living World – Seamless, breathtaking, challenging, dynamically reacting to your actions – the diversified and overwhelming world of Gloria Victis awaits you!\nLow-fantasy Setting – Explore the lands based upon medieval Europe and Middle-East, discover ancient secrets, seek for forgotten treasures and face creatures designed after medieval tales!\nDISCLAIMER\nPlease remember that the game is currently in alpha stage and you may experience some issues or some of the features may not be implemented yet. Read the \"Early Access\" section above for details!\nWe are continuously improving and expanding all the described features according to the Community voice, while the others are under development or on our to-do list.\nFeatures which will come with the future updates:\nMounts – Tired of walking? Get on a horse, take your lance and charge the enemy – or prove your incomparable skills in mounted archery!\nFull-scale Sieges – Rams, ballistae, trebuchets and catapults – medieval warfare in all its beauty and glory!\nSailing and Naval Combat – Build a cog to deliver goods to distant realms, lead your fleet in naval warfare or make your mark as a world-known corsair!\nHousing – Build your own house, develop and decorate it – home sweet home!\nFreedom and Immersion – Want to rest for a while? Enjoy numerous side-activities, such as fishing, gambling and the beer drinking contest!\nMature storyline – Choose one of three playable nations based upon the old powers from medieval Europe and the Middle-East – Midlanders, Ismirs and Azebs – and enjoy an epic adventure to discover their rich culture, history and an own beliefs system!\nWe are currently hosting servers for following regions:\n- West Europe\n- East Europe/Russia\n- North America\n- South America\n- Australia\n- South East Asia","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Black Eye Games","platforms":[{"id":0,"name":"PC"}]},{"id":3446,"name":"Citizens of Earth","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e5/8e5bba6cdb69d1b0fe7b28050f680f05.jpg","description":"Just because you’ve been elected as the Vice President of the World doesn’t mean you have time to relax!  Things are going mad around town, and only YOU have the charisma it takes to... delegate all the dirty work and convince your constituents to save the world in this retro-RPG!\nRecruit everyone in sight -- 40 to be exact -- to join your party and fight against uncanny enemies like bees, hippies, fat pharmacists, angry toasters, and more!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":244721,"name":"MapleStory 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f5/0f52ac2e4efab5bb94f8f3926c41a32d.jpg","description":"MapleStory 2 is a 3D isometric adventure MMORPG where players create their own character and select one out of several jobs to explore the new Maple World. Players will encounter various NPCs with various Quests, Monsters, and Bosses from the previous version as well as completely new ones to fight against. The game also features Dungeons and Raids for players to team up with each other to complete.\r\n\r\nOutside of combat, there are also an assortment of activities for players to engage in, such as buying and building personal houses, crafting with Life Skills, fishing, composing music, creating custom user content such as custom clothes and much more.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"N-square","platforms":[{"id":0,"name":"PC"}]},{"id":49355,"name":"Deadly Days","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d6/6d6bde8fc6ccb173d853c75a54fa3298.jpg","description":"... the unique zombie apocalypse survival management game.\nBeing a leader during the apocalypse is hard. Your survivors go out every day looking for parts and scrap to upgrade your base. Help them survive. For example, send a bomber to launch a devastating attack on enemies. Or unlock a variety of weapons for your survivors and support the wounded with medical care. Can you survive? If nothing helps anymore, just start a nuclear strike.\n‣ Build a home for your survivors\n‣ Fight the zombies and support your survivors\n‣ Fight many different zombie types, each with their own unique abilities.\n‣ Complete a multitude of random objectives and earn rewards\n‣ Random events force you to adapt different strategies\n‣ Use a variety of helpful abilities to increase your chance of survival\n‣ Break open valuable crates to find powerful items\n‣ Discover many powerful special abilities to boost your arsenal\n‣ Collect different survivor costumes\n‣ Climb the leaderboard and prove that you are the best commander\nShortly before the start of the apocalypse, the fast food chain MKing launched a new burger product on the market. Addictive additives were secretly added to the meat in order to boost sales. The plan worked out. However, the addictive drug meant that all brain areas were shut down over time, except for the area which is responsible for the basic need for fresh meat. Lots of meat! As if that were not bad enough, this disease also leads to the fact that the people affected cannot die naturally. A high level of force is necessary.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pixelsplit","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":28620,"name":"Banjo Kazooie: N n B","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe9/fe9e851aa9576411b6349cf74c254fb6.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish, Czech, Norwegian, Polish, Russian, Swedish, Japanese, Korean and Chinese. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   The heroic bear and bird return at last to defend Spiral Mountain from their nemesis Gruntilda. Groundbreaking vehicular platforming awaits in wild new worlds packed with features and faces old and new. Build awe-inspiring vehicles and tackle the Jiggy challenges in any way you see fit! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":1731,"name":"Maldita Castilla EX - Cursed Castile","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee4/ee45c49e1507ef9f8ec85219d655aa00.jpg","description":"The tears of a young witch have been turned by a demon into a key that opens up a gateway for the evil in this world. The King Alfonso VI of León has gathered his loyal knights to get to Tolomera del Rey and finish the nightmare using the power of the Witch’s tears.\nBanish the zombies and demons that entered the Kingdom of Castile with Don Ramiro, the loyal King’s Knight, and his friends. For that, you will use a different range of weapons to defeat your enemies through the cursed lands of Tolomera, in a pure classic arcade action style.\nFeatures\n---------\nThis new instalment features:\n- 8 Stages\n- 19 Bosses\n- 48+ types of enemies\n- 4 different endings\n- 15 unlockable achievements\n- New music tracks\n- Remixed and remastered audio\n- Illustrated Bestiary – with unlockable information about the myths behind each creature included in the game\n- 8 screen view modes\n- Navigation menu\n- Specific content adaptation for the end platform to improve the gamer experience","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Abylight Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":330427,"name":"OpenTTD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c35/c35d245b6052a107cda6deb047256ba1.jpg","description":"Build the ultimate transport company in this open-source reimplementation of Transport Tycoon Deluxe.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"ZodTTD","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":301518,"name":"Himno","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/831/8317c1ed931bd92f1a1bcbf8d809c819.jpg","description":"A quick note from the developer:Himno was created long time ago as a private project which I played to de-stress myself. Little by little I was getting in love and that's why I decided to share it. If you enjoy simple games about platforming and parkour, this will chatch you! The controls are super intuitive and easy to learn, and there is an endless amount of procedurally generated maps for you to explore and overcome in many different ways like the old 8-bit platformers.An endless experience about jumping and watching the world created featuring:Non-violent, no death\nYour actions in the world trigger emotional soundtracks and vibrant visuals\nWall-jumps, slides, dashes, moving platforms, lifts\nPlay at your own pace without pressure\nWatch bright things dance around you\nGreat for playing for a little while every now and then to discover some new maps\nEnjoyable by a wide variety of player skill","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"David Moralejo Sánchez","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":59200,"name":"PRO EVOLUTION SOCCER 2019","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/17a/17a05c3b047263ed0cd9b39396986b61.jpg","description":"Also get these bonus PES 2019 myClub items below:\nStandard Edition\n• David Beckham 2018 - 10 match loan\n• Philippe Coutinho - 10 match loan\n• Premium Agent (3 Players) x 10 weeks\n• 3 Player Contracts x 10 weeks\nDavid Beckham Edition\n• David Beckham 2018\n• Philippe Coutinho 10 match loan\n• Premium Agent (3 Players) x 20 weeks\n• 3 Player Contracts x 20 weeks\nLegend Edition\n• PES Legend Player\n• David Beckham 2018\n• Philippe Coutinho 10 match loan\n• Premium Agent (3 Players) x 30 weeks\n• 3 Player Contracts x 30 weeks\nPES 2019  new features:\n•• AUTHENTIC LEAGUES – Huge addition of licensed leagues\n• MAGIC MOMENTS – Player individuality has been taken to the next level with 11 new skill traits. Score great goals with improved shooting motion & animation, and see stamina have an impact with Visible Fatigue\n• NEW MYCLUB - Every element has been redone, from how you sign players, to special versions of players released throughout the year\n• THE BEAUTIFUL GAME – Experience photo-realism with stunning animation flow, supporting 4K HDR\n• ML REAL SEASON – Experience life as a real manager with 3 significant changes: ICC pre-season, in-depth transfer system and new league licenses\nThe Legend Edition includes a special 3D scanned version of David Beckham from 2018, and PES Legend Player for myClub!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"PES Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":39759,"name":"Killzone 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8e8/8e8569356f3a5f7f59ba72c4bc27148d.jpg","description":"Despite the name, the game is the fourth in the series and the first in the franchise, which uses stereoscopic 3D technology and PlayStation Move controllers. The plot of the game is a direct continuation of the second part: the action unfolds right after its ending.\n\nI.S.A. forces took the palace of Visari. The emperor had perished, and the main characters face danger again: the enemies regrouped and are preparing to strike back. The the main character squad is forced to fight through the enemy lines only to get to the evacuation point. One of the narrative features is that the story also unfolds from the main antagonists’ point of view.\n\nThe gameplay is still cinematic and has not changed much compared to the last part. Jetpacks were added to the game, and the hand-to-hand combat system was reworked, adding new brutal melee attacks and combo attacks. In addition to the ability to go through a story campaign together with a friend on one console, the game has a full-fledged multiplayer with three modes: Guerilla Warfare, Warzone, and Operations.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":18541,"name":"Hexcells Infinite","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d74/d7415b5c54d8be76bd9ca684d4365746.jpg","description":"Hexcells Infinite is the third game in the series of ambient logic puzzle games.\nIt includes a new set of 36 puzzles as well as a random puzzle generator and now supports mid-level saving and cross platform cloud saves.\nThe level generator uses an 8 digit seed number to generate each puzzle so they can easily be shared.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Matthew Brown","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16952,"name":"A Valley Without Wind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a07/a07f409a223ac084b83d5d6e5dccc245.jpg","description":"A 2D sidescroller without a linear path. An action game with tactical combat and citybuilding. An adventure game that lets you free-roam a vast, procedurally-generated world. A Valley Without Wind defies genre stereotypes. Unlike other procedurally-generated games, you also get a logical progression in difficulty, plus helpful tips and checklists to guide your travels (should you need them).\nChoose for yourself how to prepare to face the vastly stronger Overlord. Complete a variety of missions to earn new spells, and/or roam the wilds to uncover secret missions and stashes of magical crafting loot. Customize your characters with unique combinations of enchants and spells that change how you move, jump, and fight. Or rescue people and bring them back to your settlement so that they can then be sent on dispatch missions; you don't have to carry the burden of your fledgling civilization alone!\nYou choose how to play, and the world adapts around you.Key features:Travel alone or with friends across an ever-expanding world of dangerous creatures, powerful magic, high technology, and mysteries.\nYou have choice. The world of Environ is a procedurally generated sandbox, and lets you go anywhere you see -- including right into the overlord's keep at any time. (Good luck with that.)\nEnviron is endless. When you save one continent from an overlord, a larger and more complex continent appears.\nThe game adapts to how you play: as you demonstrate your proficiency, monsters and missions upgrade accordingly. Killed 100 bats? Okay, time for... bats on fire!\nCrazy amounts of character customization. Combine a multitude of spells, enchants, and equipment to create specialized character builds.\nPlay as a long line of brave adventurers. It's not a question of IF your character is going to die, but WHEN. Any character that dies is permanently lost, but you keep all your inventory, enchants, and general progress in the game.\nBecome a community leader. Rescue NPCs for your settlement, construct buildings for them, and improve their skill and mood -- then send them on dispatch missions to help you in return!\nBe a clever problem-solver. Challenges have more than one solution, each with its own pros and cons. You get to figure things out rather than just jumping through a set of hoops.\nDifficulty levels give exactly the challenge you want, from casual to hardcore on platforming, combat, and citybuilding independently.\nAll owners of Valley 1 also get the much-improved sequel absolutely free!  Valley 2 is out now, and features a different style of more-focused, non-sandbox play.  Both games are quite distinct from one another, but you don’t have to choose between them -- both are yours for the price of one!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14115,"name":"Lifeless Planet Premier Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee9/ee98dedd3426c4237383acbd612692ed.jpg","description":"PREMIER EDITION\nWhile seeking life on a distant planet, an astronaut discovers an abandoned Russian town. He suspects his mission is a hoax until a mysterious young woman saves him from a strange and deadly phenomenon... Lifeless Planet is a third-person action-adventure that features an old-school sci-fi story and spectacular environments in the spirit of classic action-adventures.\nAfter a hard landing on the planet, the astronaut discovers the planet that was reported to be rich with life is instead a barren wasteland. When he goes searching for his crew, he makes a more startling discovery: evidence that humans have already been to this planet years ago! When he comes upon a deserted Soviet-era Russian town, he struggles to make sense of his mission. Did his light-speed travel to the planet send him back in time? Or is this all some strange Cold War hoax?\nAlong the way, the astronaut meets a Russian woman, Aelita, who is somehow able to survive the hostile atmosphere of the planet. Through an unusual natural phenomenon, her skin causes the soil to glow green under her feet. The player must use these glowing tracks as a guide across the planet past treacherous and deadly threats. Is she leading him to safety... or an untimely death?\nLifeless Planet was inspired by Cold War era science fiction stories, posing questions about humankind's desire for space travel. What if you journeyed across the galaxy to another planet, only to find humans had already been there? What kind of person would sign up for a one-way mission, leaving behind planet Earth and everyone they've ever known and love... to go in search of an Earth-like planet?\nEquipped with a limited-use jet-pack and a mobile robotic arm, the player must use wits and skill to solve puzzles, unravel the mystery, and survive the Lifeless Planet!\nKey Features:\nExplore 20 unique and atmospheric environments on a vast and treacherous planet.\nFollow a mysterious young woman as she guides you past dangerous terrain and deadly life-forms.\nInvestigate the startling discovery of an abandoned Russian town.\nExperience an exciting and intriguing story through rich graphics and cinematic cut-scenes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stage 2 Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":366891,"name":"Remothered: Broken Porcelain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c36/c367a9d7253a0a883a346a018e33f1a3.jpg","description":"Remothered: Broken Porcelain brings an abundance of welcome changes to the series, introducing new gameplay and storytelling elements that breathe new life into the characters of the mysterious Ashmann Inn!\r\n\r\nThe truths buried in the Ashmann Inn will not be discovered easily - its many mysteries are intertwined and guarded by the looming threat of the stalkers, powerful hunters trapped in time and the confines of its walls. Survival will take more than just quick reactions as a strategic and resourceful approach will quickly become critical in this haunting adventure. Be smart - knowing the best time to sneak, flee or fight imminent dangers can quickly make the hunters become the hunted.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Stormind Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":59602,"name":"NBA 2K19","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/442/442792baf387bad3b99041be74276ba2.jpg","description":"NBA 2K celebrates 20 years of redefining what sports gaming can be, from best in class graphics & gameplay to groundbreaking game modes and an immersive open-world “Neighborhood.” NBA 2K19 continues to push limits as it brings gaming one step closer to real-life basketball excitement and culture.\nTAKE CONTROL WITH TAKEOVER\nHarness your MyPLAYER’s full basketball potential with the new Takeover feature. Unlock special moves and abilities never before seen on the court, or activate Team Takeover and unleash the power of your full squad.\nRUN THE NEIGHBORHOOD\nYou won’t want to miss a single day in the updated Neighborhood. Make a name for yourself on the court, at the Under Armour Cages, and during live events on the block. Ball until dawn with new day to night transitions, walk on at the Jordan Rec Center, or get the old Crew back together for exciting 3 on 3 streetball action.\nMyTEAM\nCreate your very first MyPLAYER card, and ball with LeBron, Kobe, and the rest of your collection in a variety of competitive modes. Introducing the new Unlimited mode, allowing you to pick any five cards from your deck without restrictions and battle against other players online.\nMyCAREER\nFrom neighborhood legend to global phenomenon. The original career story mode returns with an all-new, immersive narrative charting your journey from China to the G League and eventually the NBA. Featuring an all-star cast, endorsements tied to your popularity, and new team chemistry elements that allow you to dominate the hardwood.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"2K","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":18001,"name":"X2: The Threat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d7/0d749b669f8b97b576deb2cd109dc00c_hRr8ZwH.jpg","description":"X²: The Threat is of a new generation of space simulator games, you play the role of Julian Gardna who continues the story set by X: Beyond The Frontier. The updated graphics engine gives the universe a fresher feel with newly designed ships and stations adding to the complexity of the universe.\nExplore: You can explore over 130 beautifully designed sectors occupied by nebulas that affect your ships and stations, asteroids you can mine for materials you can later sell on for profit.\nNew Ships: Explore in over 60 ships of varying sizes from scout class ships to the much larger carrier class battleships.\nNew Upgrades:  Upgrade your ships systems with many more upgrades, and download new upgrades that make use of the new scripting engine designed specially for X².\nNew Weapons: Add new weapons to your ship including the Ion Disruptor and Mass Driver, but also build factories that will develop these weapons and sell them to make a profit, expanding your own empire among the universe.\nNew Missions:  Take part in missions offered to you on each stations bulletin board, make money by defending convoys and destroy incoming Xenon fleets intent on destroying everything in their path.\nBut above all else, help to defend the universe from the Khaak, before they kill everyone and everything they come across.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Egosoft","platforms":[{"id":0,"name":"PC"}]},{"id":16954,"name":"A Valley Without Wind 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3e/f3e6bf18e20684019358932e7e0c032e.jpg","description":"A modern take on the 16-bit era, A Valley Without Wind 2 blends a variety of mechanics across multiple genres, seamlessly bringing together the best qualities of old-school platform-shooters and turn-based strategy games.  You choose how and where to explore via the world map, how to upgrade your character via mage classes, feats, and perks that you unlock, and how to battle the forces of evil every step of the way.\nYour character is a mage who has infiltrated the inner circle of the evil Demonaica, and you now share the power of immortality that he uses to terrorize the land. Using this power against him, it's time to lead an uprising and ultimately bring him and his henchmen back to mortality so that they can be dispatched.\nGameplay alternates between two modes that complement each other: brief, tightly-designed platforming segments where your character customization and equipment can be tuned to meet the tactical needs of the current stage; and quick strategic turns on the world map where you order your troops to fight, scavenge, build, recruit, farm, and use special powers.  Demonaica and his armies pursue your forces directly on the world map, while his five henchmen have been sent to recapture you in the platforming segments.\nYour immortality came at great personal cost, but it makes you the one last hope of saving the world from darkness.Key Features:Platforming and Turn-Based Strategy Coupled Together:\nFlip back and forth between your own adventure, and the progress of the resistance you're in charge of.  Freely adjust difficulty levels for both to tailor the experience to your own personal playstyle.  Both sides of the game can be quite easy or incredibly hard.\nMore Tactile Combat:\nThe physics of movement and attacks have been completely redone from the first title, with more traditional gamepad and keyboard support. Spells have mass and can block each other, leading to many interesting tactical situations in the platforming segments.\nVastly Improved Visuals:\nFully redone artwork by Heavy Cat Studios, including 125 all-new monsters, 200 spells, and lots more.\nFocused Gameplay Arc:\nUnlike the endless sandbox-style first game, this complete re-imagining has a distinct beginning, middle, and end.\nProcedurally Generated Worlds:\nEach world is a unique challenge, leading to excellent replay value once you do beat the game!\nCo-Op Multiplayer:\nBring along as many friends as you like on your journey, depending on your connection speed. 2-8 players recommended on most Internet connections; many more on LAN.\nSee Just How Deep An Arcen-style Rabbit-Hole Goes:\nAfter dozens of hours you still haven't seen it all: 50 mage classes in 5 tiers, 200 spells, 125 enemies, 14 biomes, 100+ types of world map tiles, 64 character customization perks, 100ks of procedural equipment possibilities.\nExtra Challenges For Expert Players:\nString together flawless kills to earn \"concentration\" and become even stronger.  Beat the game on harder difficulties to earn rare achievements.\nGet The Original Game For Free!\nThe original game was unique and experimental, and it comes included absolutely free when you buy the sequel.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arcen Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10847,"name":"Scrap Mechanic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd5/cd5f527884bd49cf4de47987428bf848.jpg","description":"PLEASE NOTE: We’re still at work on Scrap Mechanic! Get started right away in Creative Mode, and get ready for Survival Mode coming in a later update.Welcome to the machine-filled creative paradise of Scrap Mechanic, a multiplayer\nsandbox game with imagination and ingenuity at its core.\nScrap Mechanic is an all-new creative multiplayer sandbox game which drops you right into a world where you quite literally engineer your own adventures! Choose from the 100+ building parts you have at your disposal and create anything from crazy transforming vehicles to a house that moves. You’re even able to team up with your friends to create amazing things together: in Scrap Mechanic, you’re the master creator of anything you can imagine!\nHere’s the deal: you’re a robot maintenance mechanic en route to your posting on a fully-automated agriculture planet. Your job is to take care of the worker robots as they work the land, sending the food they produce to the metropolitan planets. Thing is, close to touchdown your spacecraft loses control and crashes, but since you’ve got luck on your side (erm…), you survive! You’re stranded though, and at first glance you find that not everything’s quite as it should be. The Farmbots working the fields have gone crazy, and now there’s only one way to stay alive: using your quick thinking, your creativity and your wily knack of turning your surroundings to your advantage.\nLet’s pop the hood and see what’s on offer right now:\nCreative Mode!\nAn unlimited amount of parts are yours to play with! Build free on your choice of terrain without limitations or the threat of death.\nGender!\nChoose between playing as a male or female mechanic.\nParts ‘n’ Blocks!\nScrap Mechanic comes loaded with over 100 parts. Some with unique shapes and sizes, but all giving you the power to basically create anything you want.\nInteractive Parts!\nThe interactive parts that let you put your creations in motion represent the very best and most exciting parts of Scrap Mechanic! With a wide range of parts and an array of functions from gas and electric engines to thrusters, sensors and buttons, you’ll never be bored with the tools at your disposal!\nHandbook!\nYour Mechanics’ Handbook is your trusty educational friend, with you from the start and dying to be read! Flip trough its pages at your leisure to learn the basics of building in a easy way.\nConnect Tool!\nThe tool that brings everything together and makes it all happen. A must for any true mechanic!\nLift!\nLightens the load when building creations with physics in mind. Let it lift you – and your creations – higher!\n\nSledgehammer!\nWhack loose parts and watch them fly. Smacking physics around with the hammer is great fun.\nFor all the latest news, follow us on:\nFacebook\nTwitter\nFor more info: http://www.scrapmechanic.com/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Axolot Games","platforms":[{"id":0,"name":"PC"}]},{"id":25829,"name":"Gauntlet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82a/82ade332e1cfabb9782ec64477a05da3.jpg","description":"\"Gauntlet for the Nintendo DS is a feature rich game that stays true to\nthe retro gameplay of the original arcade coin-op while boasting an\nupdated look, additional attacks and powers, and a new Experience-based\ncombat system. Players will encounter punishing onslaughts of 32\ndifferent enemy types, including a cadre of completely original monsters\nas well as fan favorites such as Skeletons, Thief and even Death.\nScattered throughout the maps players acquire amazing pickups to assist\non their journey – from Bait that attracts nearby monsters to the\nGlacier Freeze potion that temporarily freezes the hordes of enemies\naround them. With local and Wi-Fi support for four-player cooperative\nplay, as well as three ranked competitive multiplayer modes, Gauntlet on\nthe Nintendo DS is a revitalized tribute to an all time classic game.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Arrowhead Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"}]},{"id":18064,"name":"Little Racers STREET","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c52/c52af9e979bba47f4ee006ae6f8a2576.jpg","description":"Top-down racing evolution has arrived!\nLittle Racers STREET fuses the fun-oriented simplicity of top-down racing games with the excitement of street racing, and the results couldn't be better!\nExperience thrilling high speed races, and drift like never before along more than 200 different events. With varied weather conditions affecting handling, you'll need precise driving to reach the first places, and success!\nTwo cities featuring over 60 different tracks will put your skills to test in the career mode. Start from scratch, and purchase or improve your cars as you keep winning racings and climbing the driver rankings. Complete the challenges to earn special rewards and unlock the high tier cars!\nPick the right car for each race, from an impressive selection of 40+ cars divided in 6 performance tiers. From the slow and steady Panzer to the allmighty Fetuccini Langostino, you'll really feel the difference!\nThe online multiplayer mode for up to 12 players is fully integrated with the career mode: Race with your friends and earn credits you can spend on new cars and upgrades!\nYou also can try the time trial mode and try to improve your best laps or compete against your friends, and check your position in the world leaderboards.FeaturesApprox. 200 events on 60 different tracks.\nSpectacular drifting physics and handling.\nWeather effects (Rain,Snow,Night...) that greatly affect handling.\n40+ cars available for purchase and customization, with 6 performance tiers.\n50+ additional challenges with specific rewards.\nTime trial mode with ghost car features and leaderboards\nExtensive career mode offering hours of content\nSmooth online multiplayer experience for up to 12 players, integrated with career mode and supporting AI racers.\n2 Huge cities to drive on","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Milkstone Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":430498,"name":"UnMetal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e8a/e8a2a4be92cca270d820cfd68c1f5d21.jpg","description":"In 1972 a crack commando unit threw you in prison for a crime you didn't commit. You promptly escaped from a maxumum-security stockade to the underground trying to survive from these soldiers of fortune.\nUnMetal is a 2D stealth/action game (with a bit of humor) where the goal is to escape from an enemy military base. But what started as a simple break out ended up being an inside operation to prevent a massive attack against the NATO.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"@unepic_fran","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"}]},{"id":62849,"name":"Bee Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/22d/22d403bb990198e28d02cace4581c688.jpg","description":"When the first rays of sunlight rise above the horizon, the beehive slowly wakes up. Hierarchy and diligence are vital for the wellbeing of the whole swarm. So you check your wings, measure the antennae degree of deviation, take orders from the Queen, and bee-gin your first independent mission. And that's just the beginning of your adventures. Suddenly, you learn that people want to cut down the tree that holds your hive. Now your fate – and the fate of your whole family – lies in your small, agile legs and fast wings!\nREADY, STEADY, FLY!\nTake part in a race and show your sisters who has the fastest wings in the swarm!\nI HAVE A STING AND I'M NOT AFRAID TO USE IT!\nThe world of bees is not as carefree as one may think. Wasps and some of the less friendly people will take any chance to ruin your plans. Don't hesitate to use your sting to save your swarm from enemies.\nDANCING WITH THE BEES\nYou are the master of air acrobatics. Your sisters are eager to mirror your smooth dance moves. So perform your famous waggle dance and show them the way back to the hive.\nPOLLEN PICKER\nExplore the park thoroughly – visit even the deepest corners to look for rare plants and special flowers in order to collect the best pollen.\nMAIN FEATURES OF THE GAME\n•\tA unique chance to see the macro scale world from the micro perspective of a honeybee;\n•\tA realistic representation of a place inspired by Central Park;\n•\tThree diverse modes enriched with educational elements:\na)\tOne-player story mode presents you with a family of bees. Will you save the hive from the threat of human beings?\nb)\tExploration mode allows you to freely discover a world inspired by Central Park in New York\nc)\tSplit-screen mode can be either used for cooperation or competition. It includes an additional map that makes the game even more fascinating\n•\tA possibility to interact with the surroundings: people, animals, plants, and other insects;\n•\tLack of violence – it's a perfect choice for parents seeking a game to safely play with their children;\n•\tRelaxing music composed by Mikołaj Stroiński, who was responsible for the soundtrack of such games as The Witcher 3 and The Vanishing of Ethan Carter.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Varsav Game Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":62069,"name":"Train Station Renovation","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/36d/36d6d855e88b6afce42699b1dc41ce42.jpg","description":"Train Station Renovation is a game in which you play the role of a self-proclaimed conservator of historic railway stations. Nice hobby, huh? You will have a chance to use a number of specialized tools such as your own hands, a brush and maybe a hammer? You will have to do some hard work to obtain more of them. However, you can always find forgotten artifacts, which can sometimes be worth something.\r\nA lot of work awaits you: your to-do-list includes replacing railroad ties by plucking weeds, replacing windows, filling in cavities in walls and doing interior renovations. Stations have not been used for many years and practically everything is eligible for a thorough renovation.\r\nHave you ever been sad by looking at an old and abandoned place thinking that it deserves a better fate? Here you have the chance to save a lot of such places from total oblivion. You can start them off again and give the station a second life. Discover a number of different stations around the world. They all have their own story and many secrets which you may reveal if you are an attentive observer.\r\nAbandoned old trains also deserve some attention. Renovate the interior, clean and paint the car bodies, repair damaged and worn parts. Maybe you can start them off.\r\nRenovate railway stations\r\nRepair old trains\r\nDiscover new places\r\nUnravel their story\r\nMake a grand... reopening?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Live Motion Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":13051,"name":"The Dig","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b73/b73a769a03f0f9eefe99bbdfeef71afa.jpg","description":"A DEEP SPACE ADVENTURE BY SEAN CLARK IN COLLABORATION WITH FILMMAKER STEVEN SPIELBERG\nAn asteroid the size of a small moon is on a crash course toward Earth, and only NASA veteran Boston Low has the expertise to stop it. Along for the ride are award-winning journalist Maggie Robbins and internationally renowned geologist Ludger Brink.\nOnce the wayward asteroid is nuked into a safe orbit, the trio conducts a routine examination of the rocky surface.\nWhat they uncover is anything but routine.\nLow, Brink and Robbins unwittingly trigger a mechanism that transforms the asteroid into a crystal-like spacecraft. The team is hurtled across the galaxy to a planet so desolate, Brink is moved to name it Cocytus, after the 9th circle of Hell in Dante’s inferno. The bleak landscape was obviously once home to a highly evolved civilization, with remnants of sophisticated architecture, advanced technology and an intricate network of underground tunnels.\nBut no Cocytans.\nWho were the original inhabitants of this once rich empire-turned-wasteland? What are those apparitions that mysteriously appear from time to time? Why have Low, Robbins, and Brink been brought to this place? And how can Low keep his team from unraveling in the face of such uncertainty?  To return to Earth, they must dig for answers, both on the planet’s surface and deep within themselves.\nFrom the combined talents of LucasArts and legendary Steven Spielberg comes an epic adventure that plunges headlong into the very core of the unknown. And takes you with it.\nNearly 200 locations and hundreds of puzzles\nRobert Patrick of T2 as the voice of Boston Low\nSpecial effects contributed by Industrial Light & Magic\nDialogue contributed by award-winning sci-fi writer Orson Scott Card\nAlluring Wagnerian musical score sets the epic tone","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9837,"name":"We Need to Go Deeper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08b/08b872812922721194d39867f7a71c6c.jpg","description":"WARNING: THIS GAME IS CO-OP ONLY. BRING FRIENDS.\nWe Need to Go Deeper is a 2-4-player cooperative submarine roguelike set in a Verne-inspired undersea universe. In the game, you and your crew must embark on many voyages into a mysterious undersea trench known as The Living Infinite.\nTo be successful in your mission, you and your crew will have to work together to pilot a submarine, as only with your submersible in-tact will you be able to live to see the bottom of The Living Infinite.\n2-4-Player Co-op\nDesigned with human interaction in mind, We Need to Go Deeper was created to encourage friends to shout at each other. The current version features 2-4 player cooperative multiplayer- either through a Local Area Network or Online.Procedural Generation\nThe Early Access version currently features a fully fledged procedural generation system that creates a new trench layout every time you take a dive, diversifying things further with 6 unique biomes and a work-in-progress \"AI Dungeon Master\" who alters difficulty on the fly.Pilot and Maintain Your Submarine Repair leaks, load torpedoes and route power to Shields, Lights, Weapons, and the Engine as you and your friends dash around the submarine on its voyage into the deep.Deep Sea Expeditions\nLeave the safety of your submarine to explore procedurally generated undersea caves, where you may come across treasure and danger in equal measure.Customize Your Adventurer\nChoose from a variety of era-specific outfits from the 19th century to spruce up your adventurer! Non-gender-specific mustaches included.Unlock a Variety of Tools\nFrom repair wrenches to guns, to fish-mincing meat cleavers, a variety of tools and weapons for helping your teammates is waiting to be discovered!\nMore Biomes and EnemiesA total of 10 unique biomes are planned for the full release. Each biome will come chock full of unique enemies such as alien jellyfish, volcanic tortoises, burrowing worms, and many others to better flesh out The Living Infinite's dangerous underwater world.Big Bad BossesA variety of large-scale boss battles are planned for each biome, each individually suited to the region they live in. These will serve as the climactic transition between biome zones.Bigger, Better SubmarinesWe're hoping to include a few Submarines to choose from in the final game, including a larger-scale sub better suited for 4-man voyages, complete with new consoles such as beds for healing, upgrade stations, leak-fixing drones, etc.Underwater CivilizationsDiscover mysterious undersea civilizations on your voyages who may either help or hinder you and your crew. One unique civilization is planned to inhabit each biome, along with a translator item to help players understand each civilization's colorful languages.New Items GaloreWe plan to continuously add interesting Tools and Weapons throughout development as we come up with new and unique items to take advantage of various play-styles and to better give players a depth of strategic options to choose from, in addition to supplying our players with plenty of items for annoying their friends with.What's At the Bottom?Find out what lies at the bottom of The Living Infinite, with an end-game we hope will be both exciting and memorable!\nPlayer of the MonthWe know that buying into Early Access can often be a thankless contribution, so every month we'll be highlighting one outstanding player as Player of the Month - where they will receive 4 free copies of We Need to Go Deeper to send to their friends, in addition to being recognized on the title screen for that month's update. This way, we hope that those in our community who really strive to help us transform We Need to Go Deeper into the great game we want it to be will get the proper recognition - and reward - that they deserve.Active ForumsWhile we won't always have time to respond to every suggestion or request, we will try and keep the Steam forums an active place for discussion, and promise to keep an active eye on what topics the community is most passionate about.LIVE Bi-Monthly Developer ChatTwice a month, we'll also be hosting a live hang-out stream, where anyone can pop in and chat with us developers about, well, whatever you wanna talk about! In the interest of narrowing the divide between Gamers and Developers, we're gonna try and just have some good old fashioned social time with our fans. We'll try to host these on weekends so everyone can come by and play games, watch movies, and generally shoot the breeze with us, in addition to talking about We Need to Go Deeper's development if ya'll fancy it.\n\"It's rare to find something genuinely fresh in a roguelike... but We Need to Go Deeper is the rare example of a RL that grabbed my attention out of left-field.\" - PC Gamer\n\"Sounds fun!..The game sports a really unique look.\" - Kotaku\n\"Gosh, I think I love it already.\" - PCGamesN\n\"We Need To Go Deeper’s style, personality, and goals are admirable.\" - Rock Paper Shotgun\n\"It boasts a lovely, unique art style that looks something like big-headed Edward Gorey drawings, and the game’s concept is just plain cool.\" - Indie Statik\n\"It's easy to tell they truly care about providing a new type of experience with We Need to go Deeper.\" - Go! Indie Beat","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Deli Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9543,"name":"Oh...Sir!! The Insult Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/585/58523929abeb7fbfd9084884782a1284.jpg","description":"The parrot is back from the dead bringing countless new insults for your disposal, Sir! Remember that silly game that parted lovers, destroyed families and turned friends into enemies? Here’s its successor that does even more, certainly with more style and more variety. And I have proof! This time you can spread affront to everyone in the world that has Internet access or - if you’re not the most sociable - you can sit alone and play with yourself. Nudge nudge.\nSo don’t let the parrot die for nothing and tell that grumpy old lady that her husband donated organs for a strange woman lying in a pond and that her sister poses nude for some dog. Then meet a retired hipster who admires pictures of a grunting sow, and a fake Russian who borrowed a dead body to put his teacup and crumpets on. It’s also the only game that lets you learn what’s The Meaning of Life, and that’s scientifically proven!Game Features:\nLoner’s Insult Tournament Mode: Battle your way through numerous unique situations and verbally assault your CPU\nReal-Life Friends Mode: Belliger your actual friends on a couch, ottoman, or whatever else you like to rest your fanny on\nImaginary-Friends Mode: Verbally take down strangers from all over the world online, and bring the witty pain across any device using the game's Cross-Platform Multiplayer\n5 Hilarious Playable Characters: Each with their own unique voices, quirky traits and hilarious “insult bits”\nLegendary Potty Mouthed Unlockable Heroes: Lay down some verbal carnage and unlock renowned potty mouthed special guest fighters, including Shadow Warrior's Lo Wang, Serious Sam, the infamous Postal Dude, with more additions to follow soon.\n4 Conflict Scenarios: Lay down some verbal jujitsu across 4 different testy situations and dynamic environments\nContentious Battle System: Employ combos, criticals, continuations and other new mechanics to outwit your argumentative opponents!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":452636,"name":"Forspoken","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a0/3a074a80d9a45e82aff7532f0162628e.jpg","description":"Project Athia is the culmination of Luminous Productions’ philosophy to create a completely new and fresh gaming experiences that fuses together the latest technologies with art. With the PlayStation 5, their vision truly comes to life, and with Project Athia you can look forward to being transported to a vast and detailed world filled with beauty and dismay.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Luminous Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":327202,"name":"Evil Genius 2 World Domination","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8f/e8fcbe767c12d0790e9ce4c6239ba8e2.jpg","description":"The World Is JUST Enough!\r\nEvil Genius 2 is a satirical spy-fi lair builder, where players take control of an Evil Genius and set their plans for world domination in motion. When it feels this good to be bad, the Forces of Justice don’t stand a chance!\r\nBuild your own unique evil lair and cover operation, Train a force of criminal minions, Defend your Lair from the Forces of Justice, and Dominate the world with a Doomsday Device in this direct sequel to the 2004 cult classic!Cruel Constructions!Every villain needs an island lair, so pick your paradise and put your own sinister stamp on it! Shape the internal structure of your hazardous hideaway to fit your play-style, and construct wonderfully wicked devices for your minions to put to use.Atrocious Anti-Heroes!Competence isn’t going to cut it when you’re running an evil operation. As you expand and train your minion workforce, you can create new specialists to help further your evil plans! Need something a little more…intimidating? Recruit powerful Henchmen that complement your play style; every mastermind needs a right hand…or several, in fact!Dastardly Devices!The Forces of Justice are annoyingly punctual, so supplement your brute force by researching and developing a series of trap networks! Send those do-gooders spinning with a Pinball Bumper, or put the chomp on them with the Venus Spy-Trap. While one trap is good, more is…evil-er. Combo your traps to banish intruders for good!Nefarious Plots!Carry out evil schemes to further your plot to build a Doomsday Device and dominate the world! Sell the British Royal Family, Kidnap the Governor of Maine, and literally BAKE ALASKA. With hundreds of potential objectives, variety is the spice of strife.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Rebellion","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":264828,"name":"Blazing Chrome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/650/650a77b1ea5632a4b99194ac7f082191.jpg","description":"In Blazing Chrome, machines rule the world and the few humans left are on the edge of total extermination, lacking power, prestige or status among their metal and circuits overlords. Bring your best pal and kick some metal butts to free the humankind while enjoying a classic run’n’gun, fully loaded with action and exciting fights!\nHumans are expendable after an AI controlled robot army take over the world. They survive in hiding while their hunters rule the surface. When a small rebel group gets an intel about a big AI's power plant, the machines strike their camp before they can organize an attack. A small group of rebels escape and go in a suicide mission to destroy this power plant. Choose to play as Mavra, a super badass human resistance soldier, or Doyle, the equally groovy and deadly insurgent robot. This suicide mission will result in heavy casualties and a ton of lock-and-load fast-paced action where scraping robots and blazing chrome with your powerful weapons is the only thing standing between you and your freedom.\nDash through 5 apocalyptic environments with hundred of robots-enemies to blow to pieces. Blast your way through the enemy lines and and try to defeat a bunch of mechanical bosses with using hoverbikes, huge armors and a whole arsenal of kick-ass weapons.\nBlazing Chrome offers a lot of features in the legacy of classic run’n’gun games:\n● Local Co-op Gameplay\n● 16-bits post-apocalyptic environments\n● Classic fast-paced run-and-gun experience\n● Epic boss battles and crazy lot minibosses fights\n● Genuine arcade feel\n● Motorcycle and jetpack action\n● Rad pixel art","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"JoyMasher","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":5093,"name":"Hustle Kings","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8abe21e59968c9e81b29f6cf41cdda79.jpg","description":"Hustle Kings is a pool game released exclusively for PlayStation consoles. \n\n###Gameplay\nThe video game represents a classic kind of pool games, the eight-ball type, which is played on a table with six pockets along the rails, a full rack of fifteen balls and the cue ball. The goal is to claim a suit, pocket all of the balls, then pocket them, while denying one's opponent opportunities to do the same with their suit, and without sinking the balls early accidentally. The player wins if he pockets eight balls into a selected pocket, if the opposing player illegally pockets the eight balls, or if the opposing player knocks the eight balls off the table. \n\n###Key features\nIn Hustle Kings, the player can have a face-to-face or a team match, switch four career levels, do daily tasks for additional points, and upgrade the cue and the balls. The game features a career mode as well as various trick shot and tournament modes. It also features online play which allows the player to compete against other players. Hustle Kings lets the user play their external music from the PlayStation 3 hard drive during matches. It also lets them implement the YouTube API to record video of their gameplay and upload it on the platform. The developers add rudimentary virtual reality support and Move control support so that the player could feel as if the game is performed for real. It is possible to use VR; the functions don't change much, but the player can look at balls closer than ever before.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":295090,"name":"Struggling","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac6/ac662ae439dfa894da4abbc5e707b6b1.jpg","description":"Struggling is a physics-based coop game where each player controls one of the arms of a strange creature (kind word to describe the thing). By grabbing unto any surface, the monstrosity will need to painfully drag itself in different environments and overcome all kinds of obstacles while staying classy by wearing hats discovered along the way.\nIn Struggling, your partner is more than just another character, he is part of yours. Ready yourselves to operate a makeshift boat, escape a wildfire, ride a motocross and explore the world while sharing the body of a “charming” abomination with your friend. You will be struggling!\nUnorthodox and unique way to play and move the character with your friend by controlling one arm each in a physics based environment.\nA handcrafted and wild coop adventure starring the weirdest protagonist you'll ever have the chance (or bad luck) to look at and play as.\nGo on a pilgrimage to find the abomination gods and earn new powers to become a supreme/less mediocre being.\nTons of exotic gameplay sequences using the coordination of both player controlled arms, ranging from wiring up explosives to operating a tank in a suburb.\nLocal multiplayer games modes where you can face another abomination controlled by some of your friends in which you compete in various trials.\nSolo mode where you control both arms for a radically different experience.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Chasing Rats Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":263587,"name":"Legend of Keepers: Career of a Dungeon Master","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8e/b8ee8e55442eed567b04e7b2687ab31f.jpg","description":"In this original mix of a Dungeon Defender and a Roguelite designed by Goblinz Studio (author of  Dungeon Rushers), you will manage your career as a Dungeon Master!Features\nJoin the Dungeons Company and try to climb the ladder\nTry to stop heroes and protect the treasures of the company\nHire monsters, manage your employees and your stock of traps\nDeal with employees strikes and other fun eventsRogueDefender\nEach run will be different but players will keep some bonuses for their master between runs. Our game is a mix between a Roguelite and a Dungeon Defender. How did we achieve that? We've run many tests to find the perfect mix between a management and a dungeon phase!\nDungeon Phase\nFirst, you will have to plan your defense against a group of adventurers. Check their stats and resistances, then place the best traps and monsters to defeat them! When you think your dungeon is ready, let the crawl begin!\nYou will then be able to watch those heroes die! It's a reversed dungeon crawler, heroes will move through your dungeon and will trigger the traps you've placed. When a group of adventurers meets a group of monsters you've positioned in your dungeon, a turn-based fight will happen!Masters Classes\nPut yourself in the shoes of a Dungeon Master! You will be able to choose between our 3 original classes!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Goblinz Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21170,"name":"Humanity Asset","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f5/5f53adb958350eedb11a492482fdeffe.jpg","description":"Humanity Asset is a Metroid-style 3D platformer that pays homage to the traditional retro classic shoot ‘em up genre.\nAliens have invaded Earth to strip the planet of its resources, to save their own dying planet. As in all classic shoot 'em ups, only you can save the day - now there’s a surprise!\nWith 16 levels, over 400 stages and a multitude of awesome weapons, you must hack, slash and shoot your way to survival and victory.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Browny Application","platforms":[{"id":0,"name":"PC"}]},{"id":18337,"name":"Post Apocalyptic Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b5/8b50ad4087d94625fa9237f2a9c1b978.jpg","description":"Steam Big Picture\nAbout the GamePost Apocalyptic Mayhem lets you race and battle heavily-modified vehicles through numerous breathtaking tracks and lay waste to other racers in over-the-top vehicular mayhem. You can use special vehicle abilities to cause spectacular destruction to enemy cars as you fight and speed to victory. You’ll experience remarkable speeds, hilarious and violent weapons, reinforced vehicles and various exhilarating tracks.\nThe game offers various intense race modes to allow you to showcase both your driving and battling skills. PAM features an accessible physics-based driving model that allows you to sense the immense speed of all the post apocalyptic vehicles as well as feel every bone-jarring impact from both weapons and the tracks. Play single-player or battle up to five friends in online multiplayer mode.\nKey Features:\t\t\t\t\t\tVehicles – PAM offers numerous post apocalyptic vehicles.  All the Vehicles are heavily-modified and extremely menacing. All Vehicles are heavy-duty, reinforced and are able to take and give a lot abuse. The vehicles all look like they can quickly and easily travel over the newly scorched wasteland while effortlessly smashing other vehicle along the way.\nWeapons – All of the vehicles have three unique and powerful abilities that they can use to severely damage opposition vehicles: one front attack, a side attack and a rear attack. A Player can receive these special abilities by picking up Special Ability Barrels that are placed throughout all of the tracks. When a vehicle runs over a Special Ability Barrel, the vehicle will gain that specific ability and the Player will be able to use it whenever they prefer.\nMultiplayer – Intense Online Multiplayer racing for up to 6 players.\nEnvironments – The PAM tracks will be able to give players numerous options while racing as well as create intense areas for the all important collisions. All Tracks will contain:\nAwe-inspiring apocalyptic environments.\nVarious paths around certain areas of the tracks.\nFunnel areas were players are forced to drive in close quarters with other vehicles.\nHuge Jumps.\nNumerous compelling and completely unique tracks.\nAchievements – 35 Steam achievements to be earned and displayed proudly.\nOnline Leader Boards – Every kill, every race and every result will be recorded and uploaded to online leader boards for bragging rights and fueled competition.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Steel Monkeys","platforms":[{"id":0,"name":"PC"}]},{"id":10276,"name":"ToeJam & Earl: Back in the Groove","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b1b/b1b5f5a3c5705c3a322911551db0a42f.jpg","description":"ToeJam and Earl: Back in the Groove is an all-new adventure developed by the co-creator of the OG ToeJam and Earl games, which famously infused hip-hop stylings with rogue-like game play.\nCrash land on Earth and protect yourself with funky power-ups against dangerous Earthlings on an adventure to find all the lost pieces of the Rapmaster Rocketship. Play with up to three of your friends online or couch co-op and discover all the secret locations and powerful tools. ToeJam and Earl probably shouldn't have taken the Rapmaster on an intergalactic joyride, but at least they'll find all the pieces of it before Lamont notices that it's missing ... right? Right.\nBack in the Groove is a mash-up of the very best features of the classic console games with a ton of fresh features. Get a blast of funky nostalgia or play ToeJam and Earl for the very first time.FEATURES:\nNine playable characters including: ToeJam and Earl, Latisha, Lewanda, GeekJam, Peabo, and Earl’s mom, Flo\nRandomly-generated stacked levels to make every play through feel different in advanced mode\nDiscover new secret locations and terrain types\nJam to 15 re-makes of old favorite songs and 15 new songs in the same funky style\nDynamic split-screen for couch co-op play, as well as online play -- supports up to 4 players\nEnter the Hyperfunk Zone in multi-player co-op, too\nA huge number of new presents, Earthlings, player character stats, character-specific dialogue, permanent power-hats, and many features that enhance cooperative play and make this the best Toejam & Earl yet","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"22nd Century Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":219972,"name":"Old School RuneScape","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aca/aca80d402fcf64ea31d63cafe14cc6d2.jpg","description":"Greetings, adventurer! Rooted in the origin of MMOs, Old School RuneScape is the only ever-lasting, ever-evolving adventure that is shaped by you.\nReleased way back in 2013, Old School RuneScape is RuneScape as you *used* to know it! Based on the 2007 build of the globally popular open world fantasy MMORPG, Old School is constantly updated with improvements and new content voted on by you, the fans! The close relationship between developers and players is central to what makes Old School so magical.\nSo, you want to be a master cook? Or a powerful mage? Whether you’re here for the rich story and lore, the challenging combat, to fight alongside others or against them, to journey alone or simply to experience the magical world of Gielinor, Old School can be any adventure you want.\nMaster 23 diverse skills across a huge array of play styles\nTake on over 140 quests spanning the fascinating and varied game world\nConfront dozens and dozens of bosses\nRisk everything in an assortment of PvP encounters\nProfit from a thriving and dynamic in-game economy\nSome people just want to hang out with friends. And you’ll find plenty of folk to do that with in Gielinor. But those who want seek a different kind of adventure have plenty of choices, too.\nNo matter what you’re specializing in, the quest for the best loot will have skillers and perfectionists obsessing over their character builds. The strongest wand, the mightiest bow, the most *fabulous* hat – there’s always something to aim for.\nAnd if you’re among the most ardent adventurers, be sure to let people know by donning one of the many Capes of Accomplishment. Who knows, maybe one day the fabled Max Cape can be yours?\nA rich story and deep well of lore await those whose interests are more cerebral, too. From the dastardly dealings of corrupt rulers to the day-to-day musings of the village baker, tales of both... world-shattering urgency and casual procrastination abound.\nOver two dozen major quest-lines allow players to delve into Gielinor’s past and future, and the pages are still being written, waiting for you to witness their unfolding. With major game updates every week, the experience never stops evolving and improving.\nThis world goes where you go, too, with full cross-compatibility across PC and mobile versions!\nThe key to Old School’s success is both special and unique – it’s you! From the day Old School was born, we recognized that building on the game’s foundations while staying loyal to its very essence was essential. That’s why players have the deciding vote on every improvement that is or is not introduced to the game.\nIn-game polling isn’t the only interaction, either. Join developers on their regular behind-the-scenes live-streams, or chat with them directly across our many social channels. Old School is owned just as much by its players as it is its makers.\nOld School is a free-to-play game that anyone can enjoy, and many of our players have been with us for almost two decades without ever paying for membership. But Membership unlocks even more thrilling content to get stuck into. Members enjoy access to:\n8 additional skills, including Farming, Thieving and Slayer.\nAccess to the entire game world map\nOver 120 additional quests\nAccess to powerful, exclusive items\nDozens of exclusive mini games\nAdditional navigation options\nFurthermore, players can pay for Membership with Bonds that are either purchased or earned in-game! Membership is shared across both Old School RuneScape and RuneScape.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Jagex","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":43004,"name":"Space Crew","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b77/b77a93a91e7c0bcdc87e116d366d12c9.jpg","description":"Space Crew is the brand new sequel to acclaimed strategic survival simulation game Bomber Crew.\nYour Space Crew Needs You! Enlist today and blast off to new heights!\nThe United Defense Force will allow you to set across the galaxy on a campaign to defend Earth.\nIt will be your responsibility to help stop all of humankind being wiped off the intergalactic stage by the mysterious extraterrestrial threat known as the Phasmids.\nThe U.D.F. is doing their part, are you?\nJoin the Space Crew today!Strategic Space Survival Simulation:Ship-to-ship combat is strategic and deadly; manage your resources and crew abilities to stop ship invasions, repair systems, tackle fires and take evasive action.\nRecruit YOUR Space Crew:From captain to comms officer, weapons officer, engineer and more - you will create your own unique crew with customisable equipment, loadouts, appearances and names.\nFastest Hunk of Junk in the Galaxy:Personalisation doesn't end at your crew, customise your spaceship from weapons, armour, engines, escape pods, liveries, and more to make your ship your very own.\nClose Encounters of the Space Kind:Precarious asteroid fields, harmful radiation, the freezing vacuum of space and black holes all pose a danger to even the most experienced space crew.\nGuardians of the Earth:Travel throughout the Galaxy and defeat the threat to humankind through a range of single player missions from reconnaissance to bounty hunts, reclamation and more.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Runner Duck","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":41054,"name":"Q.U.B.E.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b0/9b0814a634a54001aefa0ec6bbddd79e.jpg","description":"Q.U.B.E. is a puzzle game developed by Toxic games. Initially, the game was developed as a student project but was later expanded with the help from Indie Fund. \n\nThe players find themselves in a sterile environment aboard a mysterious space cube-like ship that is on a collision course with Earth. The player is contacted with by another astronaut that warns the player that they have to find a way to find a way off the ship which will cause it to self-destruct. You set out on your mission.\n\nUpon coming to, you find yourself in a suit and with a pair of gloves that manipulate the in-game objects. The environment around you is made out of blocks that can be moved in a specific way based on their colors. Some blocks are made to be extended or retracted, some are used as a trampoline, while others can rotate some parts of the walls upon interaction. \n\nAs the game progresses, the puzzles get harder and harder. In some cases, the players have to remember the setup of the blocks in the room as the only visible blocks in the room are the colored ones.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Toxic Games","platforms":[{"id":0,"name":"PC"}]}]