[{"id":667649,"name":"Indika","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/adf/adf16f490ed67a7b01586b8ef37e827e.jpg","description":"- The game is set in alternative Russia of the 19th century. Gloomy and sinister, at the same time enchanting world.\n\n- Gameplay focuses on the story unusual for the genre. The tedious and confusing \"Russian-style\" tale, presented in an unexpected arthouse style.\n\n- Controlling two characters, you go on a difficult journey, solving either puzzles or psychological problems of the heroes.\n\nSTORY\n\nA young nun, full of doubts and seditious thoughts, is expelled from the monastery, accused of obsession. She goes to the city, watching as a terrible shaggy creature walks on her heels. On the way, she meets a surprisingly devout fugitive convict, who convinces her to go with him to the holy elder, who is hiding a miraculous artifact, which should solve all her problems.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Odd Meter","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":618663,"name":"Party Animals","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b66/b6601abafd9fa58ff7453808ca3581c2.jpg","description":"Fight with or against your friends in Party Animals! Choose your character from a diverse cast of adorable animals as you battle it out across multiple game modes to be the last one left standing in the ultimate competitive brawler.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Recreate Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":481904,"name":"Card Shark","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c92/c92dfd4ae234a19f7c010020c28e4ffb.jpg","description":"A tale of deception throughout 18th Century Europe or the comprehensive catalogue of card tricks and other deceptions employed by the Comte de Saint Germain as described in “Mémoires Sans Parole.” \n\nReal card manipulation techniques and mini-games, with a roguelike progression. \nUnlock new locations when techniques are mastered\nManage your winnings to buy your way into high stake games","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Nerial","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":403795,"name":"Tainted Grail","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c78/c78cec012cadcb5fc13d4cbe861d2085.jpg","description":"Avalon is dying. King Arthur is long gone, and Knights of the Round Table are in disarray. Guardian Menhirs, the only thing that makes it possible for humans to survive in this remote land, are going dark. Your village chose its best and brightest and sent them on an epic quest to reach Kamelot, find the Grail, and save the land.\n\nYou were not among them.\n\nThey’ve never returned, and now it’s your turn to lead a band of unlikely heroes, the only ones this land can still provide. These ordinary people set off far too late, under-equipped for the task ahead, and with little hope of success.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Awaken Realms Digital","platforms":[{"id":0,"name":"PC"}]},{"id":313805,"name":"Russian Life Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b65/b6595583c96f335a79c5cb918cc4ed03.jpg","description":"The most realistic simulator of the life of a Russian person. Collect pension from birth, collect bottles to survive and become part of an exciting life-long story.Distinctive Features:Funded pension system, but be careful, you can lose it\nHuge selection of character enhancements, from your favorite vodka to the tame bear\nCarefully thought-out economic system, in which the main currency is the bottle\nMany costumes  allowing you to be fashionable and attractive, and therefore increasing income\nA rich selection of locations,  reflecting the entire path of the Russian Man\nMusic  reflecting the Russian soul\nVoice acting  from cult Russian personalities  Fascinating events, among which:\nChoice  of the President of the Russian Federation\nInvasion  of foreign invaders\nHardbass  in the front door\nAnd other  secret events\nTry to avoid the jail!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"GosDev Production","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":62529,"name":"Epic Roller Coasters","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e92/e92449702dbfe08c6969d916a9f4c801.jpg","description":"In Epic Roller Coasters you'll get the same feeling of a real roller coaster with a high level graphics, physics-based simulation. You'll go up and down seeing everything around you with our long range vision capabilities!\nAvailable for Arcades on SpringboardVR","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"B4T Games","platforms":[{"id":0,"name":"PC"}]},{"id":60833,"name":"Gibbous - A Cthulhu Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/078/078c4c985fbe53c65143730a445c77f6.jpg","description":"A comedy cosmic horrror adventure made in Transylvania.\nDarkham, with its crooked gambrel roofs, dark alleys, and a past shrouded in secrecy, never really was a welcoming place, but nowadays?  Kooky cults are popping up everywhere, and that most evil book, the Necronomicon, is spoken of in trembling whispers once more.\nDetective Don R. Ketype is on the case to retrieve the mysterious evil tome, but unsuspecting librarian Buzz Kerwan stumbles upon it and accidentally transforms his cat, Kitteh, into a walking, talking abomination. Being humanized? Quite a downgrade.\nGibbous is a comedy cosmic horror game - a modern adventure that is classically inspired, features gorgeous HD art, detailed traditional animation, and a lengthy story that will see the three protagonists travel around the world and deal with abominations both cosmic and human-made, voodoo, and Things That Should Not Be. From Lovecraft Country to Transylvania, set off on a quest to  get a very cynical cat to stop talking.\n• Over 60 hand-painted, detailed environments inspired by Transylvanian architecture and nature;\n• Fluid traditional 2d animation with a Disney-esque look and feel;\n• Two protagonists and a talking ca--- Okay, three. Three protagonists;\n• Upwards of 70 fully voiced, crazy characters;\n• Special guest appearance by Doug Cockle, voice of the Witcher;\n• Contains most genuine Transylvanian accent in games and media, like, ever;\n• Over 4 hours of lush original soundtrack featuring live instruments;\n• A lengthy cinematic story that spans continents and more;\n• Moment to moment humor, darker arching plot;\n• Dynamic lighting, real time reflections and weather system;\n• Integrated hint system to help you when you’re stuck;\n• Fully animated cartoon cutscenes that punctuate important story beats;\n• Over 12,000 voiced dialogue lines;\n• Custom voiced responses for all the crazy combinations you can think of;\n• Lovingly made near Vlad the Impaler’s birthplace;\n• No cutesifying or making fun of the Old Ones, praise their Dark Names;\n• Did we mention the talking cat?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Stuck In Attic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":28541,"name":"Crimson Alliance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d10/d104bb0183564cfbd6b8b167b6850726.jpg","description":"Explore the mystical world of the Crimson Empire in this action-RPG adventure. Choose to play as the powerful wizard, Direwolf; the battle-hardened mercenary, Gnox; or the mysterious assassin, Moonshade.  Play Crimson Alliance co-operatively with up to 4 players on the same console or over Xbox LIVE. Work together combining your unique abilities against the nefarious Cult of the Soul Siren and the fearsome beasts they control. Can you stop them before their dark plans are complete?","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Certain Affinity","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":24101,"name":"The Walking Dead: Survival Instinct","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c0/1c05bb38dcf4247824e53a7490d05e39.jpg","description":"The Walking Dead: Survival Instinct is a first-person action survival\r\ngame that brings to life the authentic, heart-stopping horrors of the\r\nAMC hit TV series The Walking Dead. In the game, players assume the role\r\nof the mysterious, crossbow-wielding survivor Daryl Dixon, brought to\r\nlife by TV series star Norman Reedus, alongside his overbearing brother\r\nMerle, voiced by series star Michael Rooker.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Terminal Reality","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":20368,"name":"Dead Horde","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b52/b523b1873d13248a16524f2141d8aead.jpg","description":"As a survivor of the mutant virus together with a comrade or alone, you must make your way\nthrough the city levels, every new area uncovering new challenges to overcome and mutants to\ndestroy. With a large variety of weapons at your disposal, together you must wipe out the hordes\nof flesh eating mutants. Teamwork is the key to survive the DEAD HORDE...Key features:Dead Horde is an action packed, co-op top down, survival-horror shooter\nPlay the campaign in single-player, local co-op or online co-op with a friend\nMake your way through the levels with a huge variety of weapons. Use assault rifles, shotguns, grenades, mini-guns and a lot more to unlock during the game\nFast paced action with seemingly never ending hordes of mutants.\nMutants evolve and become bigger, faster and stronger throughout the game.\nUse vehicles solo or with a teammate to fight the mutants\nEarn money by killing mutants and buy and upgrade weapons\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"DnS Development","platforms":[{"id":0,"name":"PC"}]},{"id":19641,"name":"Pacific Storm Allies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b7/1b7d92f4810cef245b63ddd864b473d6.jpg","description":"Darkestville Castle Coming Soon\nAbout the Game\nThe long-awaited sequel to Pacific Storm; Pacific Storm: Allies expands upon the success of the internationally acclaimed original to deliver an unforgettable mix of real-time strategy and blistering arcade combat, recreating World War II's most heated battles.\nExperience large-scale naval and air operations of the Pacific as either the United States, Imperial Japan, or new playable nation - the UK. Marvel at the enhanced 3D visual engine complete with detailed damage modeling. Settle disputes via diplomacy or battle. Or assume direct control over stunningly-rendered ships and planes to personally annihilate your adversaries. From the US to USSR, Germany to Japan, new missions, tactical maneuvers and multiplayer modes offer armchair admirals greater excitement than ever.\nWhether you chart the conflict's progress from a strategic level or man a deck gun or get behind the controls of a fighter or bomber and personally take the fight to your foes, seize the day and rewrite history of some the most intense battles of World War II!\n\nENGROSSING WORLD WAR II ACTION AND STRATEGY - Diplomats, strategists and fighter jocks will all have a place in the game; seize the day from behind a deck gun, in a plane's cockpit, or as an admiral in the fleet's strategic planning room.\nNEW NATIONS - Play as the United States, Japan, and now as Great Britain. Ally with the AI-controlled Soviet Union, Holland or Germany, using updated diplomacy features.\nA MASSIVE ASSORTMENT OF HISTORICALLY-BASED UNITS - Employ bombers, fighters, submarines, battleships, aircraft carriers and other power hitters of the Second World War. Go beyond the Pacific Theater and even command the Bismarck or HMS Hood.\nENHANCED GRAPHICS - An updated 3D graphics engine beautifully renders units, including detailed damage modeling and persistent combat effects.\nREVAMPED CONTROLS - Master grand strategy, new technology development or in-your-face combat with a newly updated control scheme that streamlines everything from resource management to dog-fighting.\nMULTIPLAYER MAYHEM: Play head-to-head in action-oriented dogfights, join in cooperative mode with friends, or play competitively against the AI and online opponents to succeed in historical missions or massive theater-wide campaigns.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Lesta Studio","platforms":[{"id":0,"name":"PC"}]},{"id":14554,"name":"Safety First!","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76e/76e99d6486da23f81db959326ec0d548.jpg","description":"Safety First!\nSafety First! is a twin stick physics puzzler in which you have to fix broken electric wires using your Magical Yellow Repair Liquid (MYRL). Get ready for a challenging journey through a variety of gameplay mechanics and hilarious sound design. Can you beat all 69 levels?\nYour grandma turned her vintage radio up too much and caused lots of cables to break in the nearby power plant. With your awesome electrician skills you embark on a mission to fix all those broken wires employing your Magical Yellow Repair Liquid. Get ready for a challenging and physically totally accurate journey!\nControl your characters feet using the thumb sticks of your gamepad. Be warned though, he's quite fragile. Deploy Magical Yellow Repair Liquid where necessary so your grandma can enjoy her favorite tune again*.\n*For your convenience we included \"Grandmas favorite tune\" in the credits scroller\nTotally awesome features in 69(!) levels throughout 3 campaigns\nClassic campaign with 30 levels\nAdvanced campaign with another even weirder 32 levels. Looking for some gameplay variation? Try this mode: You can only lift one foot at a time. One foot stays on the ground.\nSpace (yes, Space!) campaign: A couple of more levels with zero gravity\nTons of (well, three) play modes\nNRML: default\nPEP: everything is faster, flashing light, faster music\nDRNK: world rocks back and forth, rock music, alternate voice audio (\"German Sch**sse Mode!\"), brown Myrlballs\nFun to fail, quick to retry!And for Heaven's sake, please play with a dual analog stick gamepad!\nWhat else?\nInteract with various physics driven objects\nImmersive sound effects and voice acting\nInteractive soundtrack that constantly changes\nLots of achievements\nEntertaining to watch and listen to. You will tell your grandkids about it someday.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"JCO","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":962135,"name":"Islands of Insight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b01/b01709cd3183a1a7a4871378b3802dff.jpg","description":"Islands of Insight is an epic shared-world puzzle adventure game set in a peaceful fantasy realm of ancient wonders and natural beauty. Brimming with mysterious puzzles to solve, secrets to uncover, and sublime landscapes to explore, this awe-inspiring world of floating islands is yours to discover at your own pace—alone or with other players.\n\nThe game offers an inviting experience for newcomers, and a fresh spin for masters of the puzzle genre.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Lunarch Studios","platforms":[{"id":0,"name":"PC"}]},{"id":633425,"name":"Swords of Legends Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/703/7032a4367174f1d04d667579a5791197.jpg","description":"Editions Overview\r\nAbout the Game\r\nSwords of Legends Online is an action MMORPG set in a breathtaking fantasy world with sophisticated combat mechanics and a unique storyline based on Chinese mythology. Explore the world with 6 different classes, engage in epic PvP encounters, take on challenging dungeons and reach the fascinating endgame.\r\nThe action combat system places a panoply of mystical skills at your disposal for you to continually hone and improve in adrenaline-pumping encounters. Skilfully dodge enemy attacks, combo your skills, and switch between action and tab-targeted combat as you choose.\r\nEach of the six available classes has two roles for you to gear up and switch between depending on the needs of your mission. Visit your class’ unique heartlands on your adventures to unlock new quest lines and further improve your character’s skill set.\r\nSwords of Legends Online tells its extraordinary saga through beautifully voiced cutscenes. The story weaves together belligerent gods, an ancient war between peoples, and the eponymous legendary swords that were once wielded by celebrated heroes of a bygone era, and which now inspire the quest for peace.\r\nGain access to your very own floating island on which to build a magnificent temple and garden as your own residence. Sculpt the landscape with the huge range of modification options, and gain inspiration as you visit the islands of your friends and neighbours on the back of a flying mount.\r\nVisually stunning MMORPG\r\nSix available classes, each with two different roles\r\nFast-paced action combat system\r\nExciting story-driven gameplay with voiced cutscenes\r\nTons of dungeons with different difficulty levels\r\nGripping endgame content and epic PvP battles\r\nHuge selection of flying mounts\r\nExtensive housing system","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Wangyuan Shengtang Entertainment Technology CO.","platforms":[{"id":0,"name":"PC"}]},{"id":573126,"name":"Life is Strange: Before the Storm Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb9/eb961e6867ef44ec96493d032e8e8fba.jpg","description":"Life is Strange: Before the Storm returns with remastered visuals across characters & environments.\n\nSet three years before ‘Life is Strange’, you play as sixteen-year old Chloe Price who forms an unlikely friendship with Rachel Amber, a beautiful and popular girl destined for success.\n\nWhen Rachel learns a secret about her family that threatens to destroy her world, it is her newfound friendship with Chloe that gives her the strength to carry on.\nNo longer alone the girls must confront each other's demons and together, find a way to overcome them.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":484814,"name":"FOBIA - St. Dinfna Hotel","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ecd/ecd56f199e07adc72e6a5b6a26ec8a2a.jpg","description":"Fobia - St.Dinfna Hotel is a first-person psychological horror game focused on environment exploration, survival, and puzzles solving.\nControl Roberto, a young journalist, who seeks to boost his career investigating supernatural events in Santa Dinfna Hotel, in the city of Treze Trilhas. An imponent and old construction that hides many secrets and mysteries.\nExplore scary environments and solve challenging puzzles, at the same time you try to survive from unknown dangers. Feel the Fobia!\n- First-person\n- Random puzzles\n- Investigation and clue note system\n- Combine items to improve them\n- Release new mechanics during the gameplay\n- Survive the Fobia apocalypse\nIn a small town in Santa Catarina, called Treze Trilhas, there's the Santa Dinfna Hotel, an imponent and old construction, known to be the center of many supernatural and unexplainable events.\nRoberto, a young journalist, along with Stephanie, a supernatural stories fanatic, investigates and researches the cases reported in the town. Getting to Treze Trilhas, Roberto faces a very different reality he was expecting, an old, but an apparently average hotel. But after a few days of investigation, collecting statements and documents, he finds himself lost in the middle of a series of unexplainable events, where the survival is as important as the truth.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Pulsatrix Studios","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":50686,"name":"Star Wars: Droid Repair Bay","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f62/f62af7f69a022d39311c194321b62893.jpg","description":"The Resistance Needs You!Star Wars™: Droid Repair Bay – Astro-Mechanic for the Resistance will be available for free download starting December 6 for the HTC Vive on Steam and Viveport and Samsung Gear on the Oculus store.\nIn Star Wars: Droid Repair Bay, Poe Dameron's sidekick needs your help. Repair BB-8 and his astromech droid friends, each with their own unique personalities, so they can roll back into the fight against the First Order. Aboard General Leia’s ship in the depths of space, you’ll need to work quickly before battle breaks loose just outside the droid repair bay.\nStar Wars: Droid Repair Bay, created by ILMxLAB, is the official virtual reality story connected to Star Wars: The Last Jedi.\nPowered by Nissan. See the VR experience now at select dealerships now: http://NissanUSA.com/StarWars\n\nStar Wars: The Last Jedi tickets are on sale now http://fandango.com/lastjedi. See it in theaters December 15th.\nPowered by Nissan.\nThis software is offered for noncommercial, personal use only.\nPrivacy Policy – http://disneyprivacycenter.com\nTerms of Use – http://disneytermsofuse.com","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ILMxLAB","platforms":[{"id":0,"name":"PC"}]},{"id":41534,"name":"StarForge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30d/30d8c4f8758c01724b143cd0555ecc63.jpg","description":"StarForge is a port of the strategy board game where you will take the role of a race in growth: the Terrans, but in the depths of the galaxy, an old enemy emerges from oblivion: the Goo! They are back and seeks dominance over the entire galaxy. Through the choice of tactics, building ships with gradual improvements and conquering worlds to obtain resources, you must stop the spread of the Goo, protect your home planet and the entire galaxy in the process. Help them, you're their only hope!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Unboxed Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":40522,"name":"ArmA II: Private Military Company","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/705/705d99621f0fdb9be4400473c5cfdf87.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":21982,"name":"Zup! Zero","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f6/9f6d93bff9061a8cca228a6408cb8f6d.jpg","description":"Minimal physical puzzle with explosions\n▪ 60+ Levels\n▪ 1040+ AchievementsTrading Cards\nEmoticons\nCredits\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nExtended panels of Steam's backgrounds were invented by Aevoa","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":21522,"name":"Numen: Contest of Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32f/32f65aa76b959941bda70ce90f59fc38.jpg","description":"Nine deities. Nine heroes. And only one champion. Mythical Greece. The land of gods, poets, heroes, but also of terrible monsters and creatures.\nNumen is a fully three-dimensional action RPG set in mythical Greece. The player controls one of nine heroes, who in the name of the gods they follow compete in a grand test of their capabilities. Heroes who undertake a pilgrimage over the highest mountains, through valleys and deep forests, underground vaults and the scorched sand of deserts.\nNumen however is no mere hack-and-slash game. It offers the player the possibility of tactical decision making, searching for enemies’ weak spots, selection of adequate weapons. It rewards those who are able to adapt to the changing situation on the battlefield. In this the player is helped by the unique powers and abilities invested in him or her by the god he or she follows, provided that the god is happy with him or her. The Olympian gods, after all, are renowned for their wanton and unpredictable nature…\nAction RPG with strong and intriguing storyline and surprising plot turns.\nDetailed 3D design with state-of-the-art visual effects.\nThe game world based on the Greek mythology comprises of tens of locations situated on 12 islands with both exteriors and underground labyrinths.\nMany extensive main story and side quests.\nSelect your hero‘s gender, his or her specialization out of three possibilities and one of nine deities for him or her to worship.\nPlenty of unique weapons, armors and items, more than 80 spells and abilities.\nArena duels, training combats and tournaments.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"CINEMAX","platforms":[{"id":0,"name":"PC"}]},{"id":20245,"name":"Rhythm Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/965/965383c0af3b1efdea9e1f4bbf087115.jpg","description":"Rhythm Destruction is a rhythm & shoot'em up that aims to combine the best of both genres. Blast and maneuver your way through perilous stages filled with numerous enemies, obstacles and unique boss encounters. Stay on beat to rack up the highest score possible and compete against others on the global leaderboards!\nEnemies and objects in Rhythm Destruction are destroyed via timed key presses that go along with the beat of the music. The hand crafted stages are filled with many obstacles, traps, and plenty of bullets that make for unrelenting action. Each stage also includes a unique boss encounter that will put all of your skills to the test.\nRhythm Destruction tracks high scores across all game types and stages. It also features a scrolling feed to update you on whats happening around the community in real time in regards to new records, high scores and game news.\n10 challenging and diverse stages\nPumping soundtrack provided by 'Oscillator X' and others\nLeaderboards for all game modes\nReceive live updates on high scores, community news and more with the 'RD Feed'\nOver 40 achievements and full Trading Card support\nXbox & Playstation Controller Support\nFirst DLC Pack available now!\nChallenging Gameplay, with a Casual Mode toggle for beginners","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Curious Panda Games","platforms":[{"id":0,"name":"PC"}]},{"id":16326,"name":"Puzzles At Mystery Manor","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/422/4224e71f328e7d270213925b16e8e06a.jpg","description":"Puzzles At Mystery Manor is a jigsaw puzzle game, in which your task is to unravel the puzzles in the haunted manor of Jack Jasper, a madman, genius and murderer, who killed 40 people and captured their tortured souls in 40 paintings and hid them throughout the house.\nIn this exhilarating combination of terror and jigsaw puzzles, you travel throughout the manor helping solve puzzles related to the grisly murders he committed. Each broken picture unveils where the lunatic laid each of his victims to rest... Can you make it through the manor and survive to tell the tale?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16102,"name":"Breach & Clear: Deadline Rebirth (2016)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7aa/7aab0dfb87f00d1dc55f8b346b6ac750.jpg","description":"A deadly new breed of human monster is on the rise, and it’s up to players to stop the infestation before it spreads. Breach & Clear: DEADline Rebirth is a new and greatly improved version of B&C: Deadline. the follow-up to Breach & Clear, the critically acclaimed hybrid tactical strategy game. The game gives players real-time control over a squad of four elite Special Forces tasked with tracking down information on the source of the infestation.\nEnthralling Action: Adds real-time strategy to a franchise already acclaimed for its tactical combat.\nNew Modes: An all-new Command Mode gives total control over the entire squad for on-the-fly tactical planning.\nDeep, strategic gameplay: Plan and execute detailed strategies as players encounter a wide assortment of enemy types and combat scenarios.\nDetailed open world: Explore the secrets hidden deep within Harbor City via several districts, each with dynamically generated areas.\nRPG Elements: Countless side quests where players can grab experience and level up their squad’s core and tactical abilities, grab rare ammo, weapons and gear.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mighty Rabbit Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":15093,"name":"The Black Watchmen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec7/ec7f9346553b85cbb970295bd2db7cdd.jpg","description":"Just Updated\nAbout the GameA PARG (Permanent Alternate Reality Game), like The Black Watchmen, uses the real world as its game world, blurring the lines between fiction and reality. You'll find yourself investigating in-game & online, using the web and interacting with websites, companies and NPCs we have created.Warning:\nIf this is your first Alternate Reality Game, please take the time to try the demo. The Black Watchmen is unlike any other game on Steam. You will have the opportunity to complete tasks unique to PARGs. You must be prepared: There is no virtual world, and you have no in-game avatar. You have an agent name, and the whole web to investigate for NPCs, fake websites and stories that blend the real word with our fiction. Several times during missions, you will be interacting with real world entities (players, businesses, organizations, etc.).\nYou will not be able to complete this game alone. Only with the help of the community will you be able to rise through the ranks, and become a veteran agent of The Black Watchmen.PricingYou are buying Season 1, which gives you access to:\n25 in-game missions\n65 puzzles to solve\n5 hidden missions (unlocked by obtaining “puzzle pieces” or secret answers in-game)\nCommunity sandbox missions\nSeason 2 is an optional DLC and includes:\n30 in-game missions featuring an expanded narrative\n82 puzzles to solve\n5 new hidden missionsThe World of The Black Watchmen\nThe Black Watchmen are a paramilitary group dedicated to protecting the public from dangerous phenomena beyond human understanding: ritualistic murder, occult secret societies, and paranormal activity, to name but a few.\nAs a global organization, The Black Watchmen offer a wide range of skills and services for covert missions anywhere in the world, on behalf of any group, corporation or government that can afford them. Often called in as a last resort, The Black Watchmen pride themselves on their discretion, strength and efficiency.\nTo maintain objectivity in the field, you, as an agent, are never informed of the identity of the client. You are given only mission parameters and told how to distinguish friend from foe, but the lines are often blurred…Gameplay FeaturesGameplay: Different missions require different skill-sets.\nCrack ancient codes and investigate bizarre occurrences\nJoin a squadron of soldiers raiding a rupture site\nHack through the virtual defenses of your enemies\nResearch an occult group and uncover hidden connectionsAll Around You: The game is played using coded websites, wikis and real world references.\nMission Hub: An interface that acts as a hub for information, mission briefings, puzzles, and more.\nAgent Map: See the locations of your fellow agents around the world, and keep an eye out for potential location-based missions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alice & Smith","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13365,"name":"Subspace Continuum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdf/cdfad9e3171de689568f7c203060d6e0.jpg","description":"Subspace Continuum is one of the longest-running multiplayer action games in the world. Entirely player-managed and supported, its dedicated community continues to play this game year after year for its responsive, nuanced controls and instantly-addictive combat.\nWhat makes this game so special?\nCustomized zones each with their own unique ship settings\nAutomated leagues with detailed stat tracking\nWide array of weapons and tools, including: bullets, bombs, mines, repels, bursts, decoys, temporary walls, and more\nA variety of play modes: CTF, turf, deathmatch, ball games, team deathmatch, base assault, and hundreds of special events\nOldschool ambiance, a nice contrast to new games with all style and no substance\nA community glad to welcome newcomers, and with real personality\nNetcode so optimized that you can run smoothly from almost any connection or location\nIt's hard to describe why people love this game so much. Like any classic, even today, it still feels fresh. But it's not without its faults; it has an older interface that can be confusing at first. New players have to first set up a profile by clicking the Profile button, and then typing in a Player Name and Password at the top right. This name must be unique to the network. The only way to check is by pressing OK, choosing a zone from the list, and then pressing Play to see if your name is already in use. (Hint: it probably is, so try something unusual!)\nOnce you're in the game, you can access the menu by pressing Escape. Change to a new ship by pressing 1-8, or choose S to spectate. By default, Ctrl fires your guns, Tab will Bomb, and Shift is your afterburner. To talk to other players, just start typing.\nIf you can handle a few quirks, you might discover why Subspace Continuum has such incredible lasting appeal. Come on in, try a few different zones, and see for yourself! You might just find it's your new favorite game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Virgin Interactive Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":10335,"name":"Tales Runner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5af/5aff8173c59a7cca0bf0b80f9ef83355.jpg","description":"Tales Runner is a wonderfully bright and cheerful racing game that you can play with your friends! Set in a world where your favorite fairy tales come to life, challenge your friends and take some friendly competition to the next level. With multiple game modes, quests, and social features such as the community Plaza, Farm and chat, there is never a dull moment! Race through your favorite fairy tales from all over the world!Key FeaturesCo-Op Mode: Join with your guild members and friends and face terrifying boss monsters together! There are puzzles that you must work together and solve in order to advance to the next area. You must learn to work together!8-man or 20-man Modes: Play Tales Runner maps with up to 8 or 20 players at once! With item mode and crush mode enabled, it's sure to be one crazy time!Relay Mode: Race against other teams in this relay mode! Important thing is to work together with your teammates and pass the baton at just the right time.Animal Racing: Ride your pets and race against other players! Learn to drift your way through steep curves and emerge victorious!Item or No Item Mode: Want to race purely based on skills? Go for No Item mode! Want chaotic fun where you can use items to boost yourself and mess up other players? Go for the Item mode!Farm System: Decorate and build up your farm! Invite your friends over for a party or even an Animal racing or two at your farm. Help grow your friends' farms and receive farm points that you can spend to buy special items. Plaza: Meet your friends in the plaza and relax. Play mini-games in the minigame arcade, visit the Oracle for your fortunes and more!Customization: Hundreds of items are available for your characters! Customize the way your characters look and increase their stats to give you an edge in racing!Meeting System: Meet new players from all over the world with the built-in meeting system! Regular Updates: Tales Runner is updated once every 2 weeks! The game never gets old with new items, events, maps, and contents added constantly!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rhaon Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":223,"name":"Warhammer Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63f/63fec5955ee862b85d0c8c747b53fdbb.jpeg","description":"Based on the classic tabletop game, Warhammer Quest is an addictive mix of role-playing and strategy.\nLead your group of brave adventurers through the perilous dungeons of the Warhammer World in the search for wealth and glory!\nLevel up your party of heroes. Loot weapons, armour and mysterious artefacts from fallen enemies. Crush Orcs, Goblins, Trolls and more ferocious enemies!\nWhat perils lurk in the darkness? Only the mightiest warriors will survive.\nThe standard edition includes 4 heroes, 3 game areas and a special Vampires and Zombies tileset & enemies pack. There are additional in game options to buy up to 7 more heroes, 5 extra weapons and a Skeletons & Necromancers enemy pack. The Warhammer Quest Deluxe pack includes all of these extras.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Twistplay","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":752182,"name":"WWE 2K22","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d4b/d4b1fdea321085ab1193398cd916cc63.jpg","description":"Get ripped out of the stands and hit with complete control of the WWE Universe.\nTHE GAME THAT MAY HIT TOO REAL\nHitting this hard has never been so easy. Everything from the controls to the stunning graphics has been redesigned, and feels as real as being ringside at WrestleMania.\nCONTROL WWE SUPERSTARS AND CLASSIC LEGENDS\nUnleash dives, kickouts, and finishers with the biggest and most realistic-looking WWE Superstars and Legends: The Rock, Sasha Banks, Goldberg, “Stone Cold” Steve Austin, Brock Lesnar, and more.619 \nYOUR WAY TO SUPERSTARDOM\nCelebrate pivotal moments in Rey Mysterio’s iconic career in 2K Showcase. Booyaka!\nINTRODUCING \nMyGMIt’s your turn to call the shots as a WWE General Manager. Take the reins of Raw, Smackdown, NXT or NXT UK and draft your ultimate roster of WWE Superstars and Legends, then compete against rival GM’s to build the biggest brand in the WWE Universe. Become the top-rated show by setting up intense rivalries, over-the-top match types, championship showdowns, pay-per-view events, and an ever-escalating arms race of arenas and audiences. Once you’ve set the stage, play as a Superstar, interfere as a GM, or call the shots from behind the scenes —the choice is yours!\nRISE UP THE RANKS THROUGH WWE\nTake on not one, but two MyRISE adventures, featuring unique male and female storylines that let you choose your journey like never before.\nBUILD FOR YOURSELF, SHARE WITH THE WORLD\nThe Creation Suite is back and better than ever. Be yourself or someone else. Then step in the ring anytime, anywhere in the world.\nASSEMBLE YOUR OWN FACTION\nIn a franchise-first, the all-new MyFACTION lets you build a faction that rivals the nWo. Collect, manage and upgrade WWE Superstars, with weekly events and regular updates!WWE 2K22: IT HITS DIFFERENT","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Visual Concepts","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":619776,"name":"IXION","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b00/b00d5e2c66018666f758ac5e06c8e94c.jpg","description":"IXION combines city building, survival elements and exploration, into a thrilling space opera as you explore the stars. Propelled onwards into a perilous journey, you are the Administrator of the Tiqqun space station, charged with the task to find a new home for humanity after the Earth can no longer provide.\n\nKeeping the station sound and flying will require a deft hand and strategic thinking, as you are constantly pulled between maintaining the hull integrity, bringing in new resources and managing power consumption.\n\nWhat choices will you make when confronted with impending disaster? What will you discover out there in the dark?\nIN DOLOS WE TRUST\nA population to manage, not all willing crew, not all from the initial launch, some fresh out of cryo… Maintain trust in the corporation that started this venture or face failure and mutiny. Six sectors can be unlocked within the station, each able to house more population, support new jobs, provide opportunities to monitor the crew with the Data Listening Service. Will you bring hope to the people?\nCHOICES IN THE DARK\nWho said you were the only ones to escape the fate of the Earth? Brush up against other pockets of survivors, navigate on from the failures and wrecks of others… IXION will lead the player through gripping chapters of story, where new threats and opportunities are presented, all in aid of reaching the final destination, a new home.\nFRONTIER ACADEMIA\nDOLOS are famed for their innovative technology, their scientists, but the Tiqqun now finds itself cut off. Find what resources you can, research what you do not have. Find new ways to provide for your settlement, construct new buildings to create what’s needed. Modify the Tiqqun station, improve it, forge ahead in this odyssey.\nOCCUPATIONAL HAZARDS\nSpace is a dangerous place. Hull breaches, overloaded power supplies, electrical fires... It is up to you to manage these risks, deal with emergencies, create backup power solutions, and enable Extra Vehicular Activity…\nSTELLAR EXPLORATION\nThere are whole new stellar maps to explore. Send out probes to reveal what’s hidden, create mining and cargo ships to find resources and trade, commission science expeditions to discover the secrets and threats you’ll find out there in space. Encounter other survivors and bring them into the fold of your mission, objective - survive.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Bulwark Studios","platforms":[{"id":0,"name":"PC"}]},{"id":388371,"name":"Warhammer: Chaos And Conquest","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/36c/36cf1f6f85217619900e8101e62bf07f.jpg","description":"Spread Chaos across the Old World! Command a horde as you build a fortress capable of conquering the Empire of Man – and any other Chaos warbands that stand in your way. With enough power, you will prove your worth to the Chaos Gods by conquering Altdorf and becoming the Everchosen!\nSet in the Warhammer Fantasy universe, Warhammer: Chaos & Conquest is real-time massively multiplayer strategy game where players compete for the resources of the Old World and battle for control of the Old World.\nCollect Warlords to be your most powerful soldiers in the war against the Empire\nOver 20 Daemons of Chaos & 10 Warriors of Chaos to collect\nUse your strategy to assemble a diverse warband capable of smashing the defenses of your foes\nDaily challenges to complete with guaranteed rewards & bonuses based on leaderboards!\nRaise a Champion worthy of the title of Everchosen\nResearch Skills to expand your military, battle, & unholy might\nIncrease your power by building structures including the Chaos Temple, Sorcerer’s Citadel, Fortress Walls, Watchtower, Warlord Conclave, Workshop, Daemonic Forge, Hell Cannons, Dungeons, Training Grounds, & more.\nCollect more resources by upgrading your Lumber Mill, Slaughter Pens, Blast Furnace, & Quarry\nVanquish roaming beasts to send them to their final resting place\nSend your warriors on marches throughout the realm to pillage goods from the land\nSiege other players fortresses to muck up their plans of conquest in favour of your own\nWorld chat for discussing the battle results with your enemies!\nJoin an alliance to coordinate the conquest of landmarks important to the Empire\nShare the spoils with your alliance! As your alliance collects resources, your allies automatically earn additional spoils\nAssist your allies by speeding up their construction of their Chaos Fortress\nSend your troops to assist your alliance in defense, or receive warriors from your allies to make your fortress unbeatable\nComplete Trials, both solo & with your alliance, to make your army more powerful\nGather with your Alliance to take over the major landmarks of the Old World\nPledge your alliance to the Chaos Gods – Khorne, Nurgle, Tzeentch, & Slaanesh! Bring the chaos they desire to the Old World!\nBuild a temple to Nurgle, the Plague Lord and god of disease, decay, and death!\nBuild a Temple to the Dark Prince Slaanesh, the God of lust, pride, and decadence!\nBuild a temple to the changer of Ways, Tzeentch, the god of magic, change, and sorcery!\nConstruct a temple to the blood God Khorne! The god of violence, carnage, and anger is eager for the spill of blood.\nSpecial events to conquer roaming warbands of other Warhammer Fantasy factions, including greenskins, beastmen, & dwarfs!\nIconic Warhammer Fantasy locations, including: Chaos Wastes, Norsca, Troll Country, & the Empire of Man\nIconic Warhammer creatures to housing in your dungeons, including Chaos Spawn, Slaughter Brutes, mutalith vortex beasts, & dragon ogres!\nIconic Warhammer infantry available for training, including Marauders, Forsaken, Chaos Warriors, & Chaos Chosen\nIconic Warhammer beasts to corral, including: Warhounds, Chimera, Gorebeasts\nCollect warpstone through daily quests\nCarve your own legend in the Warhammer Fantasy Old World. The legions of the Empire of Man stand in your way – march your warband right through them & cement your legacy as the Everchosen of Chaos that brought down the Empire of Man!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hunted Cow Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":49158,"name":"Night of the Full Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/993/993f9ecf7dc5613fb73c42df39360510.jpg","description":"\"Night of the Full Moon\" is a deck-building game based on the tale of Little Red Riding Hood. You play as Red herself, battle against monsters with cards to save your beloved grandma. You can build your own deck with the cards you collect through the adventure.\nIn order to find her missing grandma, Little Red Riding Hood go alone into the Black Forest - a place that was always dark and night. She is about to face the guardian of the forest elves, the ferocious werewolf, the sedentary witch, the strange villagers and the truth that slowly surfaced...\nOn the night of the full moon, the mysterious veil of the Black Forest will be unveiled layer by layer...\n* Mild strategic turn-based card battle\n* 7 classes, more than 600 cards to collect\n* 131 mysterious opponents await your challenge\n* Random events\n* Story options that affect your reputation and courage","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Giant Network","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":44573,"name":"Suicide Guy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e17/e170de3472df15971d7b8834633c0ad5.jpg","description":"Suicide Guy is a first person action-puzzle game set in a world of dreams.\nYou'll assume the role of a nice big guy unable to wake up from his dreams. Your task is to help him to step out of them.Features25 levels set inside Suicide Guy's mind\nStory-driven game\nPhysics based levels\nUltimate moves: be able to pick up items, throw them, activate mechanisms and even burp.\nFunny creatures to annoy\nVehicles to drive\nAn important mission to accomplish\nCollectible items to find\nGamers will have to use different items in every kind of situation by solving original brain teasers.\nDespite the title, the game is NOT at all about suicide or depression.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19582,"name":"Haunted","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee0/ee0f760de8086ebc0c2824c5a80e8011.jpg","description":"Embark on a spectral treasure hunt to find your long-lost sibling and save the spirit world!\nSince losing her little sister Emily in a fateful train crash, Mary's nights are haunted by visions of her long-lost sister. Is it possible that Emily is still alive? The thought won't let Mary rest so she sets out in search of the truth following the signs she has seen in her nightmarish visions...\nIn the darkness, you are never really alone...As Mary's search plunges her ever deeper into an eerie world of the supernatural – she encounters fiendish opponents that would do her harm. Along the way, meet up with an obscure professor, an ax-wielding henchman, and a variety of ghostly friends and foes as you journey through 19th century London, Scotland, Transylvania and other locations!\nReveal dark secrets from Mary's past, as you embark on a furious chase to solve all the spooky puzzles and creepy challenges before it's too late!\nIn this comedy of terrors, the fate of the spirit world is in your hands!\nExperience a spine-chilling comic story, like something right out of a Dickensian novel\nVisit gloomily beautiful settings in London, Scotland, Transylvania … and a goldfish bowl\nEncounter more than 30 scurrilous characters, with sparkling animation including sophisticated facial expressions\nRediscover the adventure genre anew, with cooperative ghost team-play and the optional solution assistance","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"dtp Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":18335,"name":"Fabulous Food Truck","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/515/51557a5ef12fd30bc0ffc98be5db7ae8.jpg","description":"Fabulous Food Truck is an exciting time-management arcade game testing your skills and talent as Cook, Server and Manager of a busy food truck with a steady stream of demanding customers. Your job is to take orders, prepare food and serve as many people as possible within a two-minute serving drill. Food categories include Chinese food, hamburgers, hotdogs and pizza, and each group offers 10 challenging levels. Customers will ask for condiments, soft drinks and other items as you play, and serve quickly, or they will get angry. Be careful not to burn the food, and watch out for customers trying to bail from their bill… Coins and gold that you earn can be used to upgrade and improve your truck to include faster cooking equipment, charming décor and fun specialty items such as a radio, bells, whistles, and even handcuff to catch bad people. Fulfill your dream of becoming the proud owner of a busy food truck by downloading today.\nKEY FEATURES\n• Serve Pizza, Hotdogs, Hamburgers and Chinese Food all day long!\n• 40 levels of food-serving fun\n• 15 equipment upgrades\n• 7 types of multiple-choice interior décor\n• 25 achievements to unlock\n• Endless line of hungry customers to serve!\nNOTE: The games built-in virtual goods store featuring upgrades and enhancements does not require real-life currency. There are no embedded micro-transactions in Fabulous Food Truck.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16446,"name":"The Egyptian Prophecy: The Fate of Ramses","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec2/ec21c7d66c86785aacb77fd854c40e6f.jpg","description":"Plunge into ancient Egypt and follow Maya, a young magician, who has been ordered by Pharaoh to investigate the strange accidents that have recently occurred at the great obelisk’s worksite. Find out what is standing in the way of your sovereign’s mission. Evade curses and spells, and allow your people to construct one of the great architectural splendors of antiquity to the god Amon-Ra.\nA point-and-click adventure game using 360° views, similar to Jules Verne’s Return to Mysterious Island and Dracula: The Path of the Dragon.\nCan you solve the Fate of Ramses?\nHigh-definition graphics and animations\nUser-friendly inventory system\nLarge number of riddles to solve\nVaried sound environments and bewitching music","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MC2","platforms":[{"id":0,"name":"PC"}]},{"id":15708,"name":"Haven (2016)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55a/55a4422cd2b1af87eb278c62f8f9e0a8.jpg","description":"<strong>Journey inside an Insane Poet's Mind!</strong><br/><br/>Haeven takes place entirely inside the mind of Cleril the insane Poet! Explore fantastical interpretations of different parts of the mind including the Hippocampus, Ego, and more! Battle against your oppressive Subconscious as you struggle for control of your mind. Can you break the bonds of determinism or is your notion of free will ultimately just an ideal?<br/><br/> <br/><br/><strong>Features</strong><br/><br/><ul><li>Custom art, animations, sprites, and faces. All hand-drawn!<br/></li><li>Custom soundtrack ranging from light piano melodies to hard rock! With some wub-wub for good measure.<br/></li><li>Five hours of exploration, puzzling, and turn based RPG combat to satisfy your palate.<br/></li><li>Skill Trees for the protagonist, each party member has unique aspects to them to diversify available strategies! </li></ul>","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cleril Calamity Studios","platforms":[{"id":0,"name":"PC"}]},{"id":15415,"name":"Dungeon of Elements","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca8/ca82565acc1068d4c15af1f1ff8c69e6.jpg","description":"Dungeon of Elements is an RPG dungeon crawler with combat inspired by some of our favorite classic puzzle games like Dr. Mario or Tetris. In Dungeon of Elements (DoE), core meets casual as we combine many different styles of gameplay in a fun, immersive experience.\nThe fledgling Alchemy Guild of Primordiax needs you to help restore its former glory. To that end, you will:\nExplore 3 continents and 45 different dungeons.\nDefeat 56 different enemy types and 12 bosses.\nEnjoy a combat system inspired by classic puzzle games like Dr. Mario and Tetris.\nDiscover hundreds of crafting recipes through experimentation.\nCraft legendary weapons and armor.\nCustomize your character with a tremendous variety of equipment options.\nFind and befriend pets.\nUnlock Achievements.\nCollect scrolls to fill your Bestiary and study your foes.\nProgress through the story and choose your own path.\nCompete with your friends and other players to clear dungeons or the entire game fastest.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Frogdice","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12909,"name":"TrackMania² Valley","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d21/d212cd995fc288cdec81fee0c6005780.jpg","description":"TrackMania² Valley is the third environment of TrackMania², the sequel to Nadeo Studio’s online racing phenomenon TrackMania, already enjoyed by millions of players.\n\nValley is a new take on the classic arcade rally racing genre. Flirting between arcade and simulation, Valley marks a new checkpoint in the history of racing games.\nAs with all TrackMania² games, Valley comes with a solo campaign, deep multiplayer experience and a world of possibilities in user-generated content thanks to the upgraded ManiaPlanet system.Key FeaturesINCREDIBLE NEW GRAPHICS: Race in a stunning Valley environment with infinite possibilities and optimized to run on most PC’s\nUNIQUE THRILLING RACING EXPERIENCE: The car feels more realistic and the handling is more precise than ever.\nINTUITIVE AND ACCESSIBLE GAMEPLAY in both solo and multiplayer modes. TrackMania² Valley brings back the ease in gameplay that was seen in the TrackMania series and intuitive creative instruments.\nENHANCED CREATIVE FREEDOM on tracks, cars and scripts. More design elements and programmable parameters than ever before.\nEMBEDDED COMMUNITY INSTRUMENTS: Share amazing creations and video highlights with people from all over the world.\nIN-GAME VIDEO STUDIO: Edit TV-quality highlights of your best races.\nA VERY ACTIVE COMMUNITY which provides incredibly numerous and diverse user generated activities.  TrackMania 2 Valley offers in-depth customization and distribution system.\nFUN AND CRAZY MULTIPLAYER: 100+ players can challenge each other at once on the same track!\nOFFICIAL RANKINGS in both solo and multiplayer modes.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nadeo","platforms":[{"id":0,"name":"PC"}]},{"id":11336,"name":"Destinations","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fa/5fab18591dbc546d710ab179868638f4.jpg","description":"Destinations lets you explore both real and imaginary places in virtual reality with friends. Visit and learn about different countries, explore your favorite game environment, or play games with other players – invite your friends and go explore!Destinations Features:\nSubscribe to and explore community-created virtual Destinations, from photogrammetric captures, to 3D modeled environments and games\nCreate and join public lobbies with other players from around the world\nInvite friends to join you in your Destinations\nVoice chat with any players in the same Destination\nSelect an avatar and customize it\nComplete quests and unlock wearables and avatars\nBring physics props into the world, scale them, and toss them around (only available for users with motion controllers)\nUse tools to interact with the world and other playersDestinations Compatibility\nDestinations works with all headsets supported by OpenVR, including the HTC Vive and Oculus Rift.\nDestinations supports both motion-tracked controllers and x-input controllers.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]