[{"id":50575,"name":"The Occupation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9db/9db4eeb53c38611bfc94ff39bfc0feff.jpg","description":"The Occupation is a first-person, fixed time, investigative thriller sim set in North-West England on 24th October, 1987. The game begins at 3:27pm.\n\nAn attack has left 23 dead & has become a catalyst for the creation of The Union Act. A controversial act which threatens the civil liberties of the British population.\n\nThe next 4 hours will determine the outcome of the act and the future of the country. Events happen in real-time and you must make decisions based on the evidence surrounding you.\n\nIs the cost of an extreme action outweighed by the cause of the greater good?\n\nYou are the reporter. You decide the narrative.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Humble Bundle","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17327,"name":"SYMMETRY","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/112/112d51f3112243bf00b052460d00e808.jpg","description":"A research spaceship reaches an abandoned planet. Nothing is what it seems here and the situation quickly slips out of control. Can the crew manage to survive and get back home?\nSYMMETRY is a micro-management survival game set in a retro- futuristic, sci-fi universe. Your main goal is to manage the crash survivors and help them withstand the desolate, extremely cold environment in order to fix their spacecraft and escape. The non- obvious plot is accompanied by an atmospheric musical score and graphic design that sustains the harsh and mysterious ambience.\nSurvivors’ life functions crucial to their existence, such as eating, resting and mental health need to be taken care of. Extreme circumstances may force crew members to develop new skills like botanics or power plant operations, that weren't necessary in their Earthly life. Gathering all the parts required to repair the spaceship becomes a race against time, as extreme weather conditions and life-threatening supernatural activities become more and more present.\nVector graphics give the game a feeling of mystery and severity of the deserted world. Using dimmed and pastel colors throughout the scenery creates a sense of remoteness from reality and builds an unreal atmosphere of the landscape.\nBase micro-management in extremely hostile conditions\nAdditional 'Survival' endless gameplay mode\nRandomly assigned crew members with different skills and stories in each gameplay\nDifferent needs to satisfy: nutrition, physical condition and mental health\nNon-obvious sci-fi plot\nOminous presence of the Symmetrical World\nMoral choices – collectivism vs individualism\nUnique vector graphics and ambient sound setting\nHigh replay-ability and various strategies to beat the game\nSurvival game mode unlocked once the main mission is accomplished","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"IMGN.PRO","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":9731,"name":"8-Bit Bayonetta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9c6/9c655cc2d558d308c54b9f85601e0bd6.jpg","description":"SEGA’s favourite Umbran Witch climaxes her way onto PC in pixelated retro glory – for free!\nFeatures:\nJumping!\nDouble jumping!\nShooting!\nScoring!\nAchievements!\nWicked chip-tune Bayonetta theme song!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Platinum Games","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":4666,"name":"Beyond Good & Evil HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef7/ef7bba3e29e62812de74da19f4ff2621.jpg","description":"Beyond Good & Evil HD is a High Definition remastered version of the original Beyond Good & Evil released eight years after the original story-driven action-adventure. There is no series for it to be a part of, but the trailer for the prequel was shown at E3 2017.\n\n###Gameplay\nThe player follows a quest of Jade guiding her through the multiple levels which one can explore to their liking, but cannot change the order of the levels to come.\nOne of the core elements of the game is puzzles the main point of those in search of the required evidence and photographing them.\nThere are also fights — Jade possesses melee and ranged weapon and can also engage other, AI-controlled characters to aid her in battles either weakening or finishing off the enemies. \n\n###Story\nThe setting is 2344, the planet Hillys which is populated by an anthropomorphic mix of humans and animals. Jade is a freelance photographer whose goal is to capture the investigations within one of the Hillys prefectures. Pey'j is the uncle of Jade who is constantly defending her and aiding her in the battles.\n\n###Remaster features\nAmong the changes made into the HD version one may spot the FullHD resolution, thus the naming, and higher-polygon textures as well as improved sound. There is no any additional content added to the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3662,"name":"EA SPORTS UFC","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b9/1b9b1b82d204e9656019f73c577cb804.jpg","description":"FEEL THE FIGHT\nThe creators of the critically-acclaimed Fight Night franchise bring you into the next-generation of fighting. Step into the Octagon™ with EA SPORTS UFC and make your opponent feel every strike, takedown and submission.\nVideo output in Full HD 1080p requires 1080p native display.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2014 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc. EA MAY PROVIDE CERTAIN INCREMENTAL CONTENT AND/OR UPDATES FOR NO ADDITIONAL CHARGE, IF AND WHEN AVAILABLE. © 2014 Zuffa, LLC. Ultimate Fighting Championship®, Ultimate Fighting®, UFC®, The Ultimate Fighter®, Octagon Girls®, Submission®, As Real As It Gets®, Zuffa®,The Octagon® and the eight-sided competition mat and cage design are registeredtrademarks, trademarks, trade dress or service marks owned exclusively by Zuffa, LLC and affiliated entities in the United States and other jurisdictions. All other marks referenced herein may be the property of Zuffa, LLC or other respective owners. Any use of the preceding copyrighted program,trademarks, trade dress, or other intellectual property owned by Zuffa, LLC is strictly prohibited without the express written consent of Zuffa. All rights are hereby expressly reserved.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":839,"name":"Assassin’s Creed The Ezio Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/efd/efd50d3cf0ebe96aa77b81e29ea3540f.jpg","description":"Make history as the legendary Master Assassin, Ezio Auditore da Firenze, in Assassin’s Creed® The Ezio Collection, which includes the acclaimed single-player campaigns and single-player add-on content* from three games: Assassin’s Creed® II, Assassin’s Creed® Brotherhood, and Assassin’s Creed® Revelations with enhanced graphics for PlayStation®4 system.\nPlay as Ezio, the most iconic Assassin in the franchise, and follow his  journey from a young man learning the ways of the Assassins in 15th-century Renaissance Italy, then into Rome where he takes leadership of the entire Brotherhood of Assassins. Finally embark on Ezio’s final adventure in 16th-century Constantinople, as he walks in the footsteps of his great mentor, Altaïr, on a journey of discovery and revelation .\nAlso included are the short films Assassin’s Creed Lineage® and Assassin’s Creed Embers™.\n* Does not include multiplayer content.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 Ubisoft Entertainment. All Rights Reserved. Assassin’s Creed, Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":292844,"name":"Hollow Knight: Silksong","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27c/27cd8b7dead05a870f8a514a9a1915ad.jpg","description":"Hollow Knight: Silksong is the epic sequel to Hollow Knight, the epic action-adventure of bugs and heroes. As the lethal hunter Hornet, journey to all-new lands, discover new powers, battle vast hordes of bugs and beasts and uncover ancient secrets tied to your nature and your past.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Team Cherry","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":75030,"name":"Retrowave","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/230/230ce214ed287b628b5b5a59d5bd37b7.jpg","description":"Neon lights, palm trees, synthwave, 80's supercars speeding down an endless highway... Welcome to the world of Retrowave!\nListening to Synthwave / Retrowave most people have had this feeling of nostalgia for an era they didn't know or that never existed.\nThe Retrowave is very much inspired by the 80's, but is mostly an idealized futuristic version of the 80's.\nThis game offers the player the unique experience of being immersed in this wonderful world for at least a few moments...\nIn Retrowave you will first start with one car, then you will be able to upgrade it or buy other cars with the money earned at the end of each run.\nRace your car through different unique worlds!\nWatch out for other vehicles on the road (yes, even in the future there will be traffic).\nRetrowave offers above all a visual and sound experience that will delight fans of the genre and will surely make those who don't know it yet discover this wonderful universe...\nFeatures:\n■ No less than 10 cars!\n■ More than 5 different universes!\n■ 4 different game modes!\n■ A unique retro-futuristic atmosphere!\n■ More than 45 different synthwave musics!\n■ Purchase system of car performance upgrades!\n■ Purchase system of new colors and wheels !\n■ Addictive gameplay!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rewindapp","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":57596,"name":"MediEvil I","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a8/1a870c422546de20efd4b0477aed1846.jpg","description":"MediEvil is an action-adventure hack and slash video game developed by SCE Cambridge Studio and published by Sony Computer Entertainment for the PlayStation. The game is set in the medieval Kingdom of Gallowmere and centres around the charlatan protagonist, Sir Daniel Fortesque, as he makes an attempt to stop antagonist Zarok's invasion of the kingdom whilst simultaneously redeeming himself.\nDevelopment began in 1995 at Millenium Interactive in Cambridge under the working title of Dead Man Dan. The visuals are heavily influenced by Tim Burton's The Nightmare Before Christmas. Originally conceived as an arcade-style shooter for platforms such as Windows and the Sega Saturn, Sony's purchase of SCE Cambridge Studio evolved the game into a PlayStation title. The game received mostly positive praise from critics upon release, with praise including its blend of Halloween themed visuals, but was criticised for its controls and cumbersome camera work.\nIt was released in Europe and North America in 1998, and in Japan in 1999. It was also re-released on the PlayStation Network in 2007. It was followed by a sequel, MediEvil 2, in 2000, and a PlayStation Portable remake in 2005 titled MediEvil: Resurrection. At PlayStation Experience 2017, a remaster for PlayStation 4 was announced.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"SCE Cambridge Studio","platforms":[{"id":0,"name":"PlayStation"}]},{"id":37873,"name":"Sam & Max: 103 - The Mole, the Mob and the Meatball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a08/a088fa3ad0e4e0eefd276b587c68e135.jpg","description":"Sam & Max 103: The Mole, the Mob, and the Meatball is an episodic adventure by TellTale studios, and also the third episode of the first season of Sam & Max Save the World franchise which consists of 7 episodes in total.\r\n\r\n###Gameplay\r\nWe play as Sam — an anthropomorphic creature who looks more like a dog, than a human who is accompanied by Max — rabbit-like extraterrestrial. The gameplay is tied to the limits of every point-and-click adventure with the only difference of inability to combine the objects. Other than that player can examine things in the location, interact with them, move around the scene and chat with non-playable characters. The title features multiple locations and the protagonists can fast travel between them using  1960 DeSoto Adventurer — a special device also used as a navigator. During multiple driving and actions scenes. \r\nTypical for TellTale, there is also a branching dialogue — the player is allowed to choose between the given options in the conversations. The following playthrough depends on the choices.\r\n\r\n###Key features and plot\r\nThe universe of the game impersonates the USA pop-culture thus the multiple in-game references for various situations. The plot in the title centers around The Mole, who has gone absent after infiltrating the local Mafia gang. Sam and Max are set to find out where is he hiding.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":37791,"name":"Sam & Max: 102 - Situation: Comedy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6a/a6a0e20501343d1277bec454db575e4c.jpg","description":"Sam & Max 102: Situation: Comedy is the adventure game by TellTale studios, and second episode of the first season Sam & Max Save the World series consisting of 7 episodes overall.\r\n\r\n###Gameplay\r\nIn every show's episode, the player controls Sam and navigates him through the 3D environment. As in many point-and-click adventures, the only interactions with the outside world include walking and examining objects to craft a new one and talking with non-playable characters.\r\nThe protagonist's gun also helps in solving some of the sophisticated riddles. There are many sections within the game, and one can travel through them using the navigator. In spite of the game features action scenes, it is impossible to die while playing — even if the player makes a lot of mistakes, the car collisions, for example, during the chases, would be cosmetic. There is a variation in dialogues — while presented with a options tree, one may choose the best suitable one. The choices affect subsequent playthrough.\r\n\r\n###Key features and plot\r\nThe game is set in a parodу universe where everything mimics pop-culture of a Western world. We play as Sam, who is a dog but walks and acts like a human. During the season, Sam and Max who looks much like a rabbit, solve the various riddles as a detective couple. The seconds part's story takes place a month after the first one and investigates the famous TV presenter holding her spectators as hostages.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":4345,"name":"Tom Clancy's Ghost Recon: Future Soldier","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/361/361521dd66118f68e642aa095e3493c1.jpg","description":"There is nothing fair, honorable, or just about combat. There is only winning and losing—the dead and the living.  The Ghosts don’t worry about even odds. They do everything in their power to overwhelm and obliterate the enemy.  Future technology is the key to winning an asymmetric battle. \n\nIn Ghost Recon Future Soldier join an elite team of highly trained, cut-throat special-ops soldiers.  Armed to the teeth with unrivalled combat technology and cutting-edge military hardware, Ghost Recon takes you to the globe’s most deadly warzones to hunt down the highest value targets.\n\nWhen you’re outnumbered…Only the dead fight fair.Key Features:In Ghost Recon Future Soldier you will be equipped with the most advanced combat technology designed to overwhelm and obliterate the enemy.\nCross Com:\n\nStay one step ahead of the enemy: Cross Com gives you real time intel projected directly on your goggles. The HUD allows you to control drones on the fly, as well as locate key enemy targets.\n\nOptical Camouflage:\n\nBe invisible: Use optical camouflage to move undetected through hot spots and gain the upper hand on your enemies.\n\nSync Shot:\n\nTag ‘em and bag ‘em: Use the tagging feature on the ground or by drone to coordinate synchronized attacks on enemy targets.\n\nCover Swap:\n\nStay out of enemy sight: Exploit unique cover system and swap through dynamic covers to surprise, flank and eliminate the enemies.\n\nHand-to-Hand Combat:\n \nBecome the ultimate “quiet professional”: hand-to-hand combat will give you brutal close-combat moves.\n\nOver the Shoulder\n\nRelish in over 2500 animations: Your Ghost Recon character will roll, cover, slide, climb and disappear to stalk and take down your prey.\n\nSingle-Player Campaign:\n\nAn all-new, epic Ghost Recon experience\n12 missions\n 8 spectacular locales - Fight across diverse terrains from the dust of Africa, the suburbs of Moscow, to the icy territory of the ArcticCo-op Campaign:\n\nTeam up with friends to take down the enemy\nPlay through the 12 campaign missions cooperatively online with up to 3 friends.\n Perform highly coordinated takedowns and devastating large-scale strikes utilizing multiple viewpoints. Your “5th man” UAV drone can draw fire and target enemies.\n Lock onto enemy positions from the air or from the ground. Deploy sonic blasts to incapacitate your targets.\n Unleash the firepower of mounted weapons systems from jeeps to helicopters, and eliminate enemies with your shooting skill.Guerrilla Mode:\n\nDominate hundreds in this brand-new combat mode\nYou and your fellow Ghosts will face waves of enemies and utilize real-life techniques inspired by U.S. Army counter-insurgency experts.\n Enter, capture and secure a designated area, then prepare for up to 50 waves of enemies with increasing difficulty.\n Compete against friends in online leaderboards.\n Multiplayer Mode:\n\nUp to 12 players in 6Vs6 matches for a fast-paced, intense online experience\nSelect from 3 classes (Rifleman, Engineer and Scout) and unlock new gear to battle online across 10 maps.\n Gain experience and levels, make decisive choices to customize and develop your character.\n Gather Intel on your enemies’ positions and share it with your teammates.\n Use the new suppression system to pin your enemies down while your teammates flank them.\n 4 game modes focused on objectives and cooperation, including new exclusives and GR’s classic Siege.\n Created by Red Storm, the studio behind the critically acclaimed Ghost Recon Advanced Warfighter multiplayer modes.Gunsmith Mode:\n\nWith over 20MM weapons at your disposal you’ll have the perfect weapon for any combat situation\nCustomize your weapon in the Gunsmith mode to gain the unfair advantage on your enemies.\n Choose from dozens of attachments and components.\n Replace triggers, barrels, stocks and much more to trick out your weapon and make it your own.\n Test your weapon in the firing range before taking it into battle for ultimate accuracy and performance.\n Compatible with Single-Player, Multi-Player and Co-Op.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":29109,"name":"Clive Barker's Jericho","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbe/bbe65d8d1e6cc08b79756ad475d5308f.jpg","description":"Clive Barker's Jericho is a supernatural horror concept with story by the master mythmaker, novelist and filmmaker Clive Barker. Jericho deals with the mysterious reappearance of a lost city in a remote desert. When a form of evil that goes right back to the dawn of days resurfaces from there, a Special Forces squad, trained in both conventional warfare and the arcane arts, is sent in. Their mission: Hunt down and destroy the evil that lurks at the heart of the city before it destroys humanity. Jericho is designed as an action horror title that ups the stakes in visuals and phantasmagorical special effects. Mingling the darkest elements of Barker’s horror fiction and films with an ambitious, age-spanning story, aimed at mature gamers, fans of Clive Barker and horror fiction enthusiasts.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Codemasters","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":16361,"name":"Battlestations Pacific","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f7/6f7b879018f4944be1881c1c9d893a5c.jpg","description":"Experience one war through two epic sagas where you will be a part of history or change it. Feel the power of the historically authentic and decisive battles of the Pacific War. Relive some of the grandest and most critical naval battles of recent history and for the first time, choose to lead your fleet to a completely different ending to the war. You will need intelligence and expertise to plan your moves and constantly remain one step ahead of the enemy. With both strategy and action at your command truly anticipate your opponent’s every move and turn the tide of war.Features:\nTWICE THE SIZE\nLead the US and Japanese forces in two massive campaigns to relive or rewrite history with up to 28 missions to play through!\nMASTER YOUR FLEET\nCommand and take direct control of over 100 authentic and prototype air, sea and undersea units including fighters, bombers, kamikaze planes, cruisers, destroyers, aircraft carriers, submarines and lots more!!\nNEW LEVEL OF REALISM\nExperience a new level of visual realism where the Pacific Ocean and its chains of islands truly come to life. Immerse yourself in the action with the all new cockpit view.\nTAKE THE BATTLE ONLINE\nChallenge your friends in 5 completely new and engaging multiplayer modes and take part in large online battles featuring up to 100 units!!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":447815,"name":"Industria","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b56/b56a60b8dd77653636ff313bcafb251e.jpg","description":"INDUSTRIA is a first-person shooter that takes you from East Berlin into a parallel reality, shortly before the end of the Cold War. On the search for a missing work colleague, you decypher a dark past in a mysterious and surreal steampunk world.\n\nTHE STORY\nBerlin, 9th November 1989: The streets are full of people. After four decades of division, thousands of cars are rolling across the inner-German border. The Wall is finally open!\n\nAt the same time a man disappears in a secret research facility near East Berlin. His goodbye message reaches you too late. You drive back to the office, where the State Security has already destroyed all records of the research project. The complex is deserted and empty.\n\nThe search for Walter takes you deep into the center of the facility – right into the heart of the universe, where time seems to stand still. The dark secret lurks – well hidden – behind the curtain. In the end, it is horrible insights and the questions of responsibility that make you dive deeper and deeper into a strange, surreal yet familiar world.\n\nFEATURES\nProfound story: Experience a classic story-driven first-person shooter with about 4 hours of gameplay\nTight atmosphere: Dive into a lovingly designed world full of mystery and lynchesque surreality\nDeadly danger: Enemies lurk around every corner – defend yourself with 4 different weapons\nUnique setting: Berlin at the time of the fall of the wall meets a surreal world of steampunk\nExperimental soundtrack: Synthesizer, acoustic instruments and melancholic vocals","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Bleakmill","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":58736,"name":"Sea of Solitude","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22a/22a3b2ddb5b344b1081cc28768f8ac84.jpg","description":"When humans get too lonely, they turn into monsters.\nThis adventure is about Kay, who has turned into a monster and her journey to find out what happened to her.\nOn her search to change, she soon finds out that her biggest enemies are not the huge monsters that she meets on her way through the Sea of Solitude, but something way more dangerous.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":28850,"name":"Game Room","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee5/ee5478b7045545c20586b209535a6226.jpg","description":"Game Room allowed players to download classic hits and compete with each other in the virtual world.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Krome Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":134,"name":"Freedom Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d7/4d7b129dea538ca905d03e942451b44f.jpg","description":"Freedom Planet is a combat-based platform adventure that pits a spunky dragon girl and her friends against an alien attack force. There's trouble around every turn, from insects to giant robots to sheer explosive destruction, but you'll have a variety of special fighting abilities to blast your way through each stage.\nAs Lilac, you can use Dragon powers to whip enemies with your hair, spin like a cyclone, or fly through the air at high speed like a comet.\nAs Carol, you can bust through foes with a flurry of punches and kicks or summon motorcycles that let you ride up walls and ceilings.\nDo you have what it takes save Avalice? Try the demo and see for yourself!\nDash across the celestial world of Avalice with boosts, bikes and other high-speed gimmicks to achieve the fastest time\nExplore at your own pace to find hidden paths and treasures and collect as many crystals as possible\nHelp Lilac and friends save their world from war in an engaging Adventure mode with fully voiced cutscenes\nZoom through the stages without interruption or dialog with Classic mode\nBattle tons of quirky boss enemies including giant robots, towering alien creatures and aggressive rivals\nDiscover five elemental shields that reflect specific attacks and provide cool benefits\nUnlock special bonuses, including mini-games, achievements, artwork and music","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"GalaxyTrail","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":391400,"name":"Drake Hollow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/466/46610ce32e69a7b3711ee8717c6d17eb.jpg","description":"Welcome to The Hollow, a blighted and dying place, and home to the Drakes.\n\nDrakes are the vegetable folk native to these parts, and they need your help. They’re hungry, thirsty, and need a place to sleep. They can literally die of boredom. It’s on you to save them. Build gardens to provide them with food, wells for water, and yoga balls and puppet shows to keep them entertained. Even treadmills and solar panels to generate power for Tesla coils and electric fences, as you will quickly see they need some protecting...\n\nThe Drakes aren’t the only residents of The Hollow - The Feral have overrun the land, looking to shred anything happy or good. Battle them one-on-one with a wide array of weapons ranging from tennis rackets to nail guns, bring your friends to lend a hand, and build your defenses so you can take them out without lifting a finger.\n\nTravel from region to region, season to season, taking the Drakes and their village with you. Each region is over a square mile of territory to explore, dynamically generated and populated with each passing season.\n\nYou must balance your time carefully. What supplies are most crucial at any given moment? What does your village need? Metal from the supply caches to build your defenses, or crystals from the blighted regions to grow your Drakes? Prove that you’ve got what it takes to help the Drakes and take back The Hollow.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"The Molasses Flood","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":21610,"name":"Peggle Deluxe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc0/cc05d70f70ace38b43502742e41e6932.jpg","description":"Take your best shot with energizing arcade fun! Aim, shoot, clear the orange pegs, then sit back and cheer as 10 whimsical teachers guide you to Peggle greatness. Conquer 55 fanciful levels with 10 mystical Magic Powers, racking up bonus points and shots you'll smile about for weeks. Face off against your friends in Duel Mode, or tackle 75 extra-tricky challenges. It's luck and skill and joyous thrills, and amidst all this fevered action only one question remains: Can you become a Peggle Master?\nWield 10 miraculous Magic Powers!\nMaster 55 levels of bouncy delight!\nConquer 75 Master challenges!\nPlay friends or the computer in Duel Mode!\nRevel in breathtaking artwork and music!\nReplay and save your best shots!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"PopCap Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16791,"name":"Midnight Club 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1c/d1c676bd2b8b9d909ccaefb15b8554f5.jpg","description":"Midnight Club 2 is an arcade open-world racing game developed by Rockstar San Diego. It is the direct continuation of Midnight Club: Street Racing and is the second game of the series.\n\n###Plot\nThere is little story present in the game. The unnamed main protagonist sets out to defeat all the racers from the Midnight Club street racing team to make his way to the top. \n\n###Gameplay\nLike the first game of the series, Midnight Club 2 focuses on street racing. The players can free roam in Los-Angeles, Paris, and Tokyo. The game features a dynamic day-night cycle and a sophisticated real-time weather system. \n\nThe main game mode is the Career Mode. The goal of the Career Mode is to defeat all the members of the Midnight Club racing team. To do so, the players have to win a certain amount of races to get noticed by a member of the team and defeat them to move to the next one. To win a race, the players have to pass all the checkpoints first either in a specific way or as they see fit. Some races are time-limited, with several seconds added to the timer for passing a checkpoint.\n\nPolice are present in the game and can be encountered during both races and free-roaming. They can call in reinforcements if the player does not comply, set up roadblocks, and use a helicopter projector to blind the players.\n\nIn the Arcade game mode, the players are free to choose whichever race they had already completed and set up their own set of rules.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":2136,"name":"Headlander","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/918/918fa277de4fb8fc220df2f87c878a08.jpg","description":"You are the last known human in the universe, and all that's left of you is a disembodied head. Seeking clues to your fractured past, you must travel through a hostile world of machines using a special helmet that allows you to dock into and take control of any robotic host body. As you launch from one body to the next, you'll start to discover that things are not quite what they appear to be, and the fate of humanity has yet to be decided...\nFresh from Double Fine Productions, Headlander is a a retro-futuristic, side-scrolling, action-adventure game set in a world inspired by 70’s science fiction. It is a world of automation, a utopia gone wrong in which all of humanity have transferred their minds into robotic imposter bodies and are ruled by a deranged computer. Brought to you by Double Fine Productions (Psychonauts, Broken Age) and Adult Swim Games (Duck Game, Jazzpunk), Headlander is guaranteed to be the ultimate head trip.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14675,"name":"Anodyne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d17/d17649b35d59b3986a681038ded4b621.jpeg","description":"In this unique Zelda-lite game, explore and fight your way through surreal and creepy, nature, urban and abstract themed areas in the human Young's subconscious, evoked by a 16-bit-era visual style and a moody, dream-like soundtrack. Created by Sean Han Tani and Joni Kittaka.\nAnodyne is available in Spanish, Brazilian Portuguese, Japanese and Korean.\nThey also made Even The Ocean, a new narrative adventure platformer. Buy it today!\nhttp://store.steampowered.com/app/265470\nBecause this game was made by a small team, please note there is no customer support for Anodyne available at this time. We recommend the stable Mac and Windows versions. The Linux version is available but is not updated with localizations, which is why it is not officially listed on the store page.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Joni Kittaka","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":398412,"name":"Naraka Bladepoint","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/75e/75e95dc8d5b290f6875062af6b35fb59.jpg","description":"NARAKA: BLADEPOINT offers close-range action set on the mysterious Eastern region called Morus. The game features a boundless movement system that allows players to climb, hang, and even parkour. With an aim-at-whatever-you-want grappling hook and a sophisticated yet beginner-friendly combat system involving accessible block & parry mechanics, NARAKA: BLADEPOINT is designed to provide a brand-new experience of melee combat and world exploration. Integrating Eastern aesthetics and philosophy, NARAKA: BLADEPOINT presents a forsaken realm of splendid landscapes as well as inexplicable enigmas.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"24 ENTERTAINMENT","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":37972,"name":"Sam & Max: 105 - Reality 2.0","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59e/59eb564fb578e1a3bcc6f9613aa0af84.jpg","description":"Sam & Max 105: Reality 2.0 is a graphic adventure video game developed by TellTale studios, and the fifth chapter of the first season of Sam & Max Save the World intellectual property composed out of 7 episodes.\r\n\r\n###Gameplay\r\nThe player takes a role of Sam who is the anthropomorphic dog accompanied by a hare-like animal called Max. Our characters are detectives, so the primary goal of the game is to solve criminal cases. While the usual point-and-click adventure scheme utilizes the usual pattern: the player can talk to NPC's, combine the elements to gain a new one and explore the landscape, Sam & Max throws the combining element out — now it is only possible to match the element together with a piece of environment to gain something new. Contrary to many games of the genre, Sam & Max feature a prototype of a non-linear structure, allowing one to travel between the crime scenes to investigate them thanks to 1960 DeSoto Adventurer — a navigator-like device.\r\nAs observed by numerous point-and-click titles, Reality 2.0 also allows the player to choose a line in conversation and it does not go unnoticed — the subsequent playthrough would be affected by one's choice.\r\n\r\n###Key features and plot\r\nThe fifth chapter of the game tells a story of interchanging between the Real and the Virtual worlds to find the culprit accused of turning every planet's dweller into a zombie by a new online game.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":11163,"name":"MechWarrior Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4d/f4dfbaaa2c33178e9af184a6c89172f8.jpg","description":"MechWarrior Online™\nMechWarrior Online™ is a tactical, 'Mech-based online shooter set in the rich BattleTech Universe. The battlefields of the 31st century are dominated by immense and powerful mechanized units known as BattleMechs. Piloting these war machines are the most elite soldiers that the galaxy has ever known. To most, they are known simply as MechWarriors.\nYou will assume the role of an elite MechWarrior, fighting for supremacy over the galaxy against other players.\nQuick Play is where you'll find fast action, fielding a single 'Mech in team-based game modes and maps. Unlike Faction Play, Quick Play matches do not influence the layout of Inner Sphere territories; these battles are fought purely for rewards and glory.\nIn Faction Play you will field 4 ‘Mechs per match, lending your skills and allegiance to the Faction of your choosing in prolonged team-based engagements, conquering and defending planets in their name to earn rewards and expand your Faction's territory across the Inner Sphere.\nGameplay\nPiloting a 'Mech to victory requires a mastery of tactical positioning, teamwork, and firing discipline. Strike out as a Lone Wolf or seek out one of the many player-controlled Units and fight under the banners of powerful galactic empires for prestige, wealth, or nothing more than the sheer thrill of battle.\nNext Gen Mobility - By the 31st century, tanks have evolved to take on humanoid shape, their treads replaced with nimble legs. Like modern tanks, 'Mechs move their upper torso and weapons independently of their legs offering unparalleled mobility while exchanging fire. Depending on their size, BattleMechs travel at vastly different speeds and offer different systems like jump jets to aid in their locomotion.\nMake Every Shot Count - Pilots must balance mobility and damage output against the amount of heat generated from their weapons fire and 'Mech operation, lest they risk the temporary loss of power that comes when a 'Mech overheats. Firing all weapons simultaneously (known as an Alpha Strike) can be the quickest way to devastate an opponent, but may leave a 'Mech helpless against its enemies if the heat sinks can't handle the stress.\nFight Smart - 'Mechs possess both external armor and strong internal structural elements to help minimize the chance of a 'quick kill'. As a result, pilots must treat each encounter with the utmost attention and awareness, prioritizing weaker or more critical components before delivering the killing blow. Communication among teammates and the effective use of targeting systems can help to identify vulnerable 'Mechs and components.\nTeamwork is the Difference - Targeting a 'Mech will automatically allow your teammates to achieve their own lock, allowing them to ascertain vital location data, armor status, and loadout details for the targeted enemy. Information Warfare can be a vital component for victory, providing attack-focused allies with the necessary information to tear their opponents to pieces.\nInformation Warfare - While fast-moving scouts feed target and tactical information back to the main battle group and the team commander, long-range Support and heavy-hitting Brawler and Assault ‘Mechs will use this information to position themselves for the perfect strike. Pilots can also shield themselves and allies from enemy sensors and weapons fire using various counter measures. It is up to each pilot to customize their BattleMech loadout to fulfill their desired role.\nFind the perfect 'Mech - Hundreds of unique 'Mechs are available, offering a wide range of strengths and weaknesses. Smaller 'Mechs should never stop moving, and can rely on their sheer speed to overwhelm heavier opponents. Larger 'Mechs move slow and deliberate but can stand toe-to-toe with other large opponents. Acquire and test different 'Mechs to find those that best suit your play style.\nChoose Your Allegiance - Work for the powerful empires of the galaxy to earn their loyalty and spread their influence across the stars. Band together with other pilots using the Looking For Group feature, or use the Faction Chat feature to coordinate offensive and defensive strategies to capture or defend worlds and shift the balance of power.\nGet Rewarded - Pilots earn ComStar Bills (C-Bills) from playing matches and completing faction contracts, which can be used to purchase new 'Mechs and equipment.\nCertain items can only be purchased using premium 'Mech Credits (MC). MC can either be purchased directly via real world money or acquired in smaller increments in-game by earning reputation with a Faction in Faction Play, or as rewards from participating in special Events.\n'Mech Experience (XP) gained during combat is applied to the 'Mech used during that match, and can be used to unlock improvements to various BattleMech systems.\nMechWarrior Online™ also includes a host of achievements to unlock that will challenge even the most skilled players.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Piranha Games","platforms":[{"id":0,"name":"PC"}]},{"id":59601,"name":"Genesis Alpha One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/959/95968a38d35fad4b9269382f337a7392.jpg","description":"In a near future ravaged by wars, corrupt regimes and devastating pollution, influential corporations have created the Genesis program in a last-ditch attempt to save humanity.\nAs the Captain of a Genesis starship, you journey into uncharted space on the ultimate mission. Build and manage a space vessel, farm resources, deal with terrifying alien infestations, clone creatures and explore a vast, randomly generated universe.\nYour goal: Find new homes for humanity’s DNA and save the species from extinction.A ROGUELIKE ON AN EPIC SCALE\nEvery journey in Genesis Alpha One begins with a huge, randomised galaxy filled with adventure and peril. Discover new planets, encounter asteroid fields, survive hostile encounters as you explore the vastness of space.\nDeath is permanent so every crew members life matters, and every decision must be carefully considered.BUILD AND MANAGE YOUR UNIQUE STARSHIP\nStarting with a small vessel, you’ll have to build and maintain an intergalactic ark by combining dozens of upgradable spaceship modules including crew quarters, workshops, hangars, clone labs and greenhouses.\nUsing an intuitive building menu, easily snap together the pieces of your ship to tailor it to your playstyle. Develop your vessel and then explore your creation in first person.BATTLE ALIEN INFESTATIONS\nAlien infestations can spread quickly, contaminating the ship and crew. It’s imperative to wipe them out before you become overwhelmed and your ship is destroyed!\nAn arsenal of weapons and defences can be researched to help you fight the alien threat. Unleash Turrets, Force Fields, Laser Blasters, Shotguns, Rifles, Grenade Launchers, Rocket Launchers, Flamethrowers or alien weapons to devastate hostile lifeforms.CLONE YOUR CREW AND CREATE NEW LIFEFORMS\nAs your ship grows, so must your crew. Using ground-breaking cloning technology, your crew will expand to meet the needs of the ship.\nLoot DNA samples from the aliens you encounter across the galaxy and splice them with members of your crew to give humanity a chance to prosper with abilities far beyond what was previously imagined.HARVEST RESOURCES FROM THE VASTNESS OF SPACE\nRoaming the immense universe won’t be possible without gathering resources. Elements such as Iron, Copper, Uranium and Plutonium must be mined from planets and then refined on-board your ship. These will be utilised to build new modules, weapons, clones and tools.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":44890,"name":"Lust for Darkness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed7/ed755bdf4d3ebb1aebb0b783017e3226.jpg","description":"Jonathan Moon receives a letter from his wife who has gone missing a year before. Following information from the message he heads for a secluded mansion where an eldritch, occult ceremony takes place.\nGates to another world - the profane, perverse land of Lusst’ghaa are opened.\nTWO WORLDS:\nMove in both a victorian mansion and Lusst’ghaa - an alien dimension filled with otherworldly creatures. Lusst’ghaa used to be similar to our earth until the local beings decided to undergo total degeneration at their own wish. Through experiments they transformed their bodies so that they could never cease to experience carnal delights. Hundreds of years have passed since that metamorphosis and Lusst’ghaa is now a land overgrown with alien vegetation and full of monstrosities squirming in a never ending ecstasy.\nFEATURES:\n- Using portals to traverse between two alternative realities\n- Exploring a victorian mansion and the world of Lusst’ghaa\n- Searching for hidden items to unlock side stories find out more about the game’s backstory\n- Escaping the creatures of Lusst’ghaa\n- World design inspired with paintings of Zdzisław Beksiński\n- BDSM and occult themes\n- Original soundtrack by a known composer (Draco Nared)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Movie Games Lunarium","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15030,"name":"Hearts of Iron III","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/470/47045a9e50c7f2a75f05b9d341526e0c.jpeg","description":"Hearts of Iron III is a global wargame strategy centered around controlling units on a large scale —nations, countries and so on. This is the third title of the four-installment-long series.\n \n###Plot \nThe narrative builds around the international geopolitics during 1936-1948 years. The events, however, may deviate from the original course of history because the player is the one that makes decisions which alter the progression of the history. The title is marked as very high-to-enter — the tutorials are long in it, and the variety of intersection is hard to measure. So, the high level of immersion is noted while following the historical events from behind the screen. There are, however, some maps problem with the states' territories as they are depicted not as exactly historically accurate.\n\n###Gameplay \nThe player is set with the goal to overcome the World War II and given any nation to get over it. The further choice is yours: playing for the neutral states is also allowed so one may not engage in military actions whatsoever. However, the game features joining forces with one of three fractions: Axis, Comintern, and Allies. The chances to join one of the groups increase with similarities in ideologies and actions toward the international alliances.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13688,"name":"Tactical Intervention","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5bc/5bc765d08f8cfeea06342c6f93499ab9.jpg","description":"Tactical Intervention is a Free to Play tactical FPS with unique mechanics. Drive, bomb, rappel and shoot your way through eleven high octane levels.\nCommand attack dogs, deploy breaching charges, perform drive-bys and control hostage situations!\nFrom the brilliant mind of Minh “Gooseman” Le, the co-creator of the seminal team-based FPS Counter-Strike, comes its spiritual successor, Tactical Intervention. Take your role as either terrorist or counter-terrorist and confront opponents in fierce and frantic combat over a variety of high energy maps wielding authentic real world weapons, from the classic P90 to the terrorist favourite, the AK47.\nFeaturing unique games modes and mechanics not seen in other shooters, Tactical Intervention allows you to experience first person combat from an entirely new perspective. Hijack a car to take part in an intense highway chase; unload your high-powered Gabard shotgun at the VIP while leaning out the window, as your opponents scramble to protect him. Take out the covering helicopter with a well-placed shot from an RPG while you handbrake turn to broadside your target.\nExperience the thrill of rappelling down a building, kicking in the plexiglass, hurling a flash bang, grabbing a hostage as a human shield, and dealing some rapid fire death with your Uzi. Use riot shields to defend yourself against enemy forces and then command your vicious German Shepard attack dog to savage terrorists out of line of sight. Dive to cover and lay down suppressing fire with your Aug assault rifle so your teammates can liberate the terrified hostages.\nCombining the strategic elements of modern team-based shooters with the pure thrill of the original Counter Strike series, Tactical Intervention brings a whole new level of gaming to the battlefield and lets players feel the true intensity of battle. With a huge variety of weapons, special equips, authentic combat uniforms and paths to victory, Tactical Intervention truly is the next evolution in team-based combat. So grab your P90, slap on a red-dot, twist in a silencer and dive into TI!\nA New Era in Tactical Combat\nCreated by Minh ‘Gooseman’ Le, co-creator of the original Counter-Strike.\nDozens of authentic weapons with true-to-life statistics including the P90, AK47, Uzi and M4.\nNew items for new tactics including attack dogs, riot shields, breaching charges and night vision.\nUnique combat situations – Use hostages as shields, rappel down buildings, engage in a high speed chase, and many more.\nFully customizable load-outs with hundreds of options allow you to be ready for any situation.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"FIX Korea, Co.LTD","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11800,"name":"WildStar","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d4/0d4de62912fbe2a683f57dbfdd606d5a.jpg","description":"WildStar is a fantasy and science fiction themed massively multiplayer online role-playing game. It was initially released as with paid subscription but in 2015 became free-to-play. \n\n###Setting \nThe game takes place on a planet Nexus. It used to be a home planet for powerful and technologically advanced ancient race Eldan. After an unsuccessful experiment to create an ultimate being, the whole race vanished. Centuries later, the planet became a point of interest for two rival fractions – huge space empire known as The Dominion and rebels Exiles. As a player, you have to join one of the factions and explore the planet of Nexus. \n\n###Gameplay \nIn WildStar you can choose between eight races, four for each faction, six classes and four paths. None of the races has any bonuses; however, some races cannot choose certain classes. Your playstyle depends on your class and path combination. The classes affect character’s stats and abilities; however, each class has its set of offensive abilities and can serve the role of a damage dealer. The paths effect on types of quests you can accept, give you special rewards and several unique abilities.  \nThe combat system in WildStar is more action-based than in classic MMORPGs. Most of the attacks in the game have a certain range and can be evaded. Some of the game’s quests incorporate puzzles and platforming sequences.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Carbine Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10511,"name":"Rocksmith 2014 Edition - Remastered","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/266/26607d71c1a72d16fb1a9470fe46b730.jpg","description":"The fastest way to learn guitar is now better than ever. Join over three million people who have learned to play guitar with the award-winning Rocksmith® method. Plug any real guitar or bass with a 1/4 inch jack directly into your PC or Mac and you’ll learn to play in just 60 days.\nWith Rocksmith you can learn everything from single notes to chords and advanced techniques, all at your own pace. You’ll learn fast because it adapts to your skill level as you play, whether you’re a beginner or an experienced player.\nRocksmith® 2014 Edition – Remastered includes a free downloadable update with a customizable learning curve, expanded practice tools, stat tracking, improved menus, and more. If you already own the original game, you can download the remastered updates for free at launch on October 4; there’s no need to repurchase.\nThis remastered version also includes six free bonus songs.\n“Three Little Birds” by Bob Marley & The Wailers\n“Suspicious Minds” by Elvis Presley\n“Some Nights” by FUN.\n“I Want You Back” by Jackson 5\n“Hey Ya!” by Outkast\n“Drops of Jupiter” by Train","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft San Francisco","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":46870,"name":"The Norwood Suite","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79e/79eafcdb3d359f92feec346b991e2926.jpg","description":"From Cosmo D, the creator of the freeware hit \"Off-Peak\", comes a game that is both its spiritual and direct sequel.\nThe Norwood Suite is a first-person adventure game that takes players to the secluded Hotel Norwood on a simple friendly errand that quickly unfolds into something much more involved. Filled with bizarre characters and objects, this mysterious resort is a dense, open-ended world teeming with hidden passages and secrets to discover.\nPeer into the lives of the hotel’s guests and staff, explore and interact with surprises behind every door, and piece together a non-linear narrative that rewards your curiosity. The Norwood Suite features surreal art design, as well as an original atmospheric musical score, composed by Cosmo D, that integrates itself directly into the game world.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cosmo D","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":620,"name":"FINAL FANTASY III (3D REMAKE)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/813/81343372bb9d84cda2d9f0fec2ef9661.jpg","description":"When darkness falls and the land is robbed of light, four youths are chosen by the crystals to set forth on a journey to save the world.                                                                                                                                                                                                                                                                      Now available on Steam, FINAL FANTASY III has been optimised for PC gaming with new and improved 3D visuals and story sequences, and will include Steam Trading Cards and Achievements and new visual designs for the Job Mastery Cards.\nNew and improved 3D visuals and story sequences\nQuicker browsing through the monster bestiary and other game record\nNew visual designs for the Job Mastery Cards\nUpgraded graphics for PC\nIncludes Steam Trading Cards & Achievements","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PSP"},{"id":0,"name":"Android"}]},{"id":14892,"name":"BARRIER X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b14/b14a4b04dab77ca8e1e169f0ad411463.jpg","description":"Now on Steam\nAbout the GameFast-paced is not even close to describing the speed of this game! This will be an ultimate test to your reaction and ability to perceive everything around you!\nJust follow these simple rules: Don’t stay on Red; Shoot your Enemies; Harness the speed! Key features:\nInsanely fast gameplay! – Speed up every 15 seconds! Test your human limits and dodge the barriers!\n7 Endless Levels – New features on each level, unlock the next one by reaching 30 seconds!\nLet the Music carry you! – Enjoy your flight with best beats of electronic music!\nCompetitive Leaderboards! – Fly your way to the top of the leaderboard among your friends and then the whole World in each level!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":428198,"name":"Gang of Four","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/790/79000406c1177ff49911f08022fc40b9.jpg","description":"SHOW RUTHLESSNESS AND BLUFF YOUR WAY TO DOMINATION AND SNATCH THE VICTORY!\nGang of Four is an exciting game of cunning and strategy. Be the first to get rid of your cards and ascend to supreme power!\nDescended from Choh Dai Di, the most infamous of backstreet Hong-Kong games, Gang of Four is the most popular card game to emerge from Asia in decades. Prepare yourself to struggle for power against the greatest gangsters of China!\nTransmitting the mystery, intrigue and intense struggle for influence that embodied the Mafia world, Gang of four is filled with an endless variety of strategies. Exciting, entertaining and full of surprises, it is still simple to learn and play.\nPlay strong classic card combinations (Pairs, Full House, Straight Flush,...) with tactics to gain the advantage! But be careful of the Gang of Four, the greatest of all combinations! Discard all your cards before the others and snatch the victory!\nCharacteristics:\n- Round-based card game with combinations.\n- The digital adaptation of the most renown Chinese card game!\n- One to four players online & local\n- Play in solo against AI, face your friends in local pass & play or worldwide players with the online mode!\nAvailable Langages : English, French.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Days of Wonder","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5076,"name":"Greed Corp","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/793/7933fec6385f898777b7ad44a2b84efd.jpg","description":"Greed Corp is a strategy game developed by W!Games.\n\n###Plot\nThere is not much story present in the game, however, it tells the players about four opposing factions. These factions are eager to take over the world and represent multiple nations joined up into one.\n\n###Factions\nThe game's factions are the same in gameplay, yet every one of them features a distinct visual style. \n\nThe Freemen are much like the ancient tribal societies and respect the environment they live in. All their units are built up using wood and other natural materials. Their territories look like farms with many windmills.\n\nThe Pirates make a living by robbing others. They also resort to trading with other factions. The units of this faction appear to be made out of scrap metal. Their territories look like deserts with occasional buildings.\n\nThe Cartel resembles a group of corporations which profit from mining natural resources. They heavily use materials to build their units and their territories look to be urbanistic.\n\nThe Empire is the only sustained government in the game. It is highly industrialized and militarized. Their units and territories feature a lot of steel.\n\n###Gameplay\nGreed Corp is a turn-based game that takes place on a field of collapsing tiles. Credits are gained by harvesting resources on the tiles. If the players harvest too fast, the tile begins to collapse. The players have to completely annihilate their opponent to win a game using troops, harvesters, and transporters.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Vanguard Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"}]},{"id":16435,"name":"Still Life 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/106/106883879b824bd4614986aa02d2e397.jpg","description":"Who is hiding behind Mr. X? Still Life 2 reveals the long-awaited ending of Still Life and spells a new investigation for Agent Victoria McPherson.\nIn Fall 2008, Victoria is sent to Maine where Ellen Dunnigan's body has just been found. The modus operandi and the video sent to the police and press leave them in no doubt as to the killer's identity: the East Coast Torturer has struck again! No clues are picked up during the autopsy, as the serial killer painstakingly washed the body. Once again, the killer has not committed any errors.\nFrom her motel room, Victoria comes across a report by Paloma Hernandez, the journalist covering all the crimes bearing the East Coast Torturer's signature. Hernandez has been highly critical of the FBI's and Victoria's lack of progress. That does not stop Hernandez from phoning and asking Victoria to meet her later that evening. Hernandez claims to have some so-called clues on the killer in her possession. Victoria flatly refuses. Just moments later, Paloma is kidnapped by the Torturer…\nStill Life 2 remains true to the spirit of its first installment, but now allows you to play and manage two characters bound by the same fate. This time, the aim is to control two heroines, see the game from two complementary viewpoints and experience two different gameplays. Depending on whether you are playing Paloma Hernandez, the victim being hunted by the killer or Victoria McPherson, the FBI agent tracking him down, you can alternate between survival and investigation.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Microids","platforms":[{"id":0,"name":"PC"}]},{"id":5574,"name":"God of War: Chains of Olympus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43d/43d96923f98c75727bd55b676fb3b6d3.jpg","description":"Before he waged war on the gods... he was forced to serve them.\nThe ancient world speaks of a mortal that slayed a God. But long before his battle with Ares, Kratos sought absolution from his past sins by pledging himself as a champion to the Gods. These brutal crusades in the name of Olympus became legendary. The Ghost of Sparta is now ordered by the Gods to journey the underworld, after the world plunges into darkness. There he must face the most feared creatures of Greek Mythology and is forced to choose between his own personal redemption and saving the ancient world from certain destruction.\n\"God of War is a registered trademark of Sony Computer Entertainment America Inc. © Sony Computer Entertainment America Inc. \"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc. Developed by Ready At Dawn Studios, LLC.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and this item’s use restrictions.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ready at Dawn Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"}]},{"id":3137,"name":"UNCHARTED The Nathan Drake Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/696/69626956eaf787f5c1b664984279060f.jpg","description":"From the groundbreaking storytellers at Naughty Dog, comes the genre-defining epic that revolutionized adventure storytelling, rebuilt by Bluepoint Games with the power of the PS4 system. Experience one of the most revered game series of all time as you follow the perilous journey of Nathan Drake across the globe, from humble beginnings to extraordinary discoveries. Meet an unforgettable cast of characters as Drake puts life and friendship on the line in a race against ruthless enemies to uncover unimaginable treasure.\nUNCHARTED The Nathan Drake Collection™ includes the single-player campaigns only for UNCHARTED: Drake’s Fortune, UNCHARTED 2: Among Thieves, and UNCHARTED 3: Drake’s Deception.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2007-2015 Sony Computer Entertainment America LLC.  UNCHARTED The Nathan Drake Collection, UNCHARTED Drake’s Fortune, UNCHARTED 2 Among Thieves, and UNCHARTED 3 Drake’s Deception are trademarks of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bluepoint Games","platforms":[{"id":0,"name":"PlayStation 4"}]}]