[{"id":20238,"name":"Red Stone Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80f/80f53e02ca8fa664453556a7d4f280a2.jpg","description":"Red Stone is an online 2.5D Transformation MMORPG which commenced in May 2003\nand the most important title of L&K Logic Korea that received great attention\nwith its remarkable success in both Korea and Japan.\nOfficial Facebook : https://www.facebook.com/LnKREDSTONE\nThe story of Red Stone begins in the fantasy world of Prandel as players go on\nan adventurous quest to search for a mystical red stone that fell from the Celestial World.\nDuring the search, players are able to experience the magical transformation of their character’s class and role.\nFor example, a wizard, who specializes in long-range magic attacks,\ntransforms into a fearless werewolf who specializes in short-range claw attacks.\nRed Stone’s game system focuses on the dynamic and liveliness of the battle as it enhances excitement and fun, allowing players to emerge themselves into the game.\nThe system also incorporated a unique CP (Charge Point) feature\nwhich players may strategically utilize to increase the fun in their game play.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"L&K Logic Korea","platforms":[{"id":0,"name":"PC"}]},{"id":19066,"name":"Puzzle Galaxies","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44c/44c4c1ec00248f56b83d310921ac3180.jpg","description":"Puzzle Galaxies is a groundbreaking puzzle video game similar to games like Bejeweled and Candy Crush. You must match jewels stored in a space station in a manner similar to Bejeweled, but there's a twist - there are enemies that will come by and try to take matching jewels on you! Racing against the clock, and against the enemies, you must match the jewels in each of the pods of the space station before time runs out.\nAlong the way, the player comes across many different bonuses, and obstacles, including:\n- 5 different enemy ships\n- 'bonus' pods\n- a locked 'safe' that must be unlocked in order to beat the level\n- 68 levels of fun!\nAlso note that Puzzle Galaxies also features an unlimited time mode as well.\nTry and see if you can get a high score by making as few moves as possible!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Evermore Game Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18152,"name":"Galaxy Admirals","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4fd/4fdc53d77d8f1dd7df5c1f87894dc294.jpg","description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other our strategy games:http://store.steampowered.com/app/409380/\nhttp://store.steampowered.com/app/450190/\nhttp://store.steampowered.com/app/509600\nAbout the GameGALAXY ADMIRALS\nis a multiplayer turn-based cosmic strategy. Improve your command skills with AI and conquer the whole universe by fighting with real players.\nMULTIPLAYER\nWhen you learn to run the game and learn all the types of the spaceships as well as their features, you can measure swords with other players. Only by playing against real adversaries, you can show all your talents and skills far and wide.\nGAMEPLAY\nOn a hexagonal field there are two military bases – one of yours and another of your adversary. By consuming a special kind of game resource in the base there are produces combat spaceships. The resource is renewable and being renewed along with each player’s move.\nAfter each move the field of play is rotated around the central cell. This fact influences the gameplay very much: the situation changes continuously and it is very difficult to foresee what will be the next.\nYour short-term goal is to destroy the enemy base.\nThat’s a real challenge for your brain training your ability for tactics and combinatorics.\nFEATURES\n- Specific gameplay. The situation changes constantly because of rotating the field of play. You have to adapt yourself to new circumstances permanently. Only he that can adapt himself to the ever-changing cosmos, will survive and come off victorious.\n- Unusual system of skills gives free scope to your imagination. By combining various skills and forming different combinations, you will get a wide range of tricks and tactical maneuvers.\n- Each mission has a plot. It’s very fascinating to replay them again and again. The initial whereabouts of objects on the playing field is generated randomly. You always get into a new battle situation which is unique.\n- The strong AI will not let you be bored during the whole game. It can be joyful, angry and get surprised showing this in its messages to you.\n- 1 race, each one have 10+ ships to build and even more special abilities to use.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14716,"name":"Super Blue Boy Planet","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/042/0423b62ea11722f3eeddfddf308c1de1.jpg","description":"Super Blue Boy Planet is an unusual little platform game with some quirky graphics.\nYou have navigate the levels avoiding obstacles and creepy crawlies. You can jump gaps and also jump on monsters, both destroying them and getting you further in the same move.\nJumping also lets you activate bridges and other objects, something you need to do in order to progress.\n- Gamepad supported and recommended\n- Different enemies\n- Level Bosses\n- Puzzle elements\n- Easy to play","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tuwi Michael Nannings","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":13835,"name":"Tcheco in the Castle of Lucio","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/423/423897e00551b468d0da3a6fef47d12d.jpg","description":"Tcheco in the Castle of Lucio is an exciting, fast-paced action game.\nHelp Tcheco the Adventure Boy to leave a mysterious castle full of deadly creatures!\nBe ready for a big challenge, full of nonsense humor and retro goodness.\nFEATURES:\n2D platform game, perfect for classic Famicom/NES game fans!\nGraphics and sounds inspired by 8-bit aesthetics.\nCompatible with Xbox gamepad and keyboard.\n65 rooms of progressive difficulty.\nEasy to learn, simple gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Marcelo Barbosa","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":9822,"name":"Deformers Open Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdf/cdfc441b3c5b806182f0a1ee2720f14a.jpg","description":"Play the Deformers Open BetaThe Deformers Open Beta starts April 1st at 18:00 UTC and ends April 3rd at 00:00 UTC.\nPre-Purchase Offerhttp://store.steampowered.com/app/491770\nPre-purchase Deformers to receive the Founders Pack, which unlocks 4 Forms for free!\nAbout the GameFrom the award-winning independent developer Ready at Dawn Studios, Deformers is a brand new, third-person smash ‘em arena combat game featuring fast and frantic gameplay. With a focus on multiplayer and online connectivity, players control “Forms” as they battle each other in fast-paced melee combat for supremacy.\nPrepare for an epic battle!  Deformers is a fast and frantic multiplayer combat arena game.  Smash up your friends in couch co-op, or team up and fight against others online!\n•\tNo Guts, No Glory!\nCompete in a variety of game modes and dominate the competition!\n•\tFriend or Foe?\nTeam up to take down your enemies with online couch co-op or battle your buds in a free-for-all death match!\n•\tAliens and Animals and Blobs, Oh My!\nChose from dozens of Forms that range from cute to crazy.\n•\tForms on Fleek!\nCustomize your Form with new styles, tags, and emotes!\n•\tRoll Around the World!\nBattle across deserts, decrepit ruins, and even under the big top!\n•\tA FORMidable Arsenal\nRam, throw, and shoot your way to victory!\n•\tThis Isn’t Even My Final Form!\nPower-ups help Forms get the extra edge – not approved by the FDA.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ready At Dawn","platforms":[{"id":0,"name":"PC"}]},{"id":8438,"name":"Castle Crashers Remastered","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67c/67c1e4f77798d42078f78a3479539862.jpg","description":"Hack, slash, and smash your way to victory in this Remastered edition of the popular 2D arcade adventure from The Behemoth!\nIf you fancy co-op games, why don't you try our new favorite fancy co-op game:  Lovers In A Dangerous Spacetime - available now!\nAt 60FPS, Castle Crashers Remastered delivers hi-res visuals like nothing you've ever seen before. Up to four friends can play locally or online and save your princess, defend your kingdom, and crash some castles!\nFeaturing:\n•Unlock more than 25 characters and over 40 weapons!\n•Intuitive combo and magic system: Unlock an arsenal of new attacks as your character progresses through the game.\n•Level up your character and adjust Strength, Magic, Defense, and Agility.\n•Adorable animal orbs are your companions. Each adds different abilities to aid you on your journey.\n•Arena mode: Battle other players in free-for-all or team matches!\n•Back Off Barbarian mini game: Jump and hop across the level to avoid the enemies!\n•Insane Mode: Test your skills in the ultimate campaign challenge\n","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Behemoth","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":4175,"name":"Ratchet & Clank: Full Frontal Assault","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d98/d988519c04c40968dc96c54b07ae8d6b.jpg","description":"Ratchet & Clank: Full Frontal Assault™ delivers a concentrated blast of pure fun to the PlayStation®3 system!  The game blends the series' classic comedy, camera, and controls with an innovative new way to play.  Drop into the middle of an intergalactic conflict, choose your weapons, and experience Ratchet & Clank: Full Frontal Assault™ solo, or together with a friend online.\nPurchase of the PS3™ version of this game entitles you to the downloadable PS Vita version of this game and the downloadable PS3™ version of Ratchet: Deadlocked™ at no extra cost.\nSome features such as cross save require the PS Vita and PS3™ system versions of the software (may be sold separately). This item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.This item may be used with up to 2 activated PlayStation® devices associated with this Sony Entertainment Network Account.  Please see software description for device compatibility. Ratchet & Clank: Full Frontal Assault ©2012 Sony Computer Entertainment America LLC. Ratchet and Clank and Ratchet & Clank: Full Frontal Assault are trademarks of Sony Computer Entertainment America LLC.  Developed by Insomniac Games.Ratchet: Deadlocked ©2005, 2013 Sony Computer Entertainment America LLC. Ratchet: Deadlocked is a trademark of Sony Computer Entertainment America LLC. Developed by Insomniac Games.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":3113,"name":"Adventure Time: Finn and Jake Investigations","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bd1/bd1d0f7591492aa7ae15f819bbb0736b.jpg","description":"What time is it?  It’s time to crack a case!\nAdventure Time: Finn and Jake Investigations is an all-new, story-driven graphic adventure game. Strange stuff is happening in the Land of Ooo (stranger than usual anyway). Luckily, Finn and Jake are on the case. This mysterious adventure will put their detective skills to the test as they search for clues, interrogate witnesses and piece together the evidence to save the day. They might even have to bust up a few goons along the way, but it’s nothing that Finn and Jake Investigations can’t handle!\nGame Features:\n• Sleuth your way through five cases set in the Land of Ooo, each of which plays out a separate chapter (like your own personal episode of the show).\n• See the Adventure Time characters and familiar locations for the first time in 3D.\n• Tackle puzzles by creatively using inventory objects and Jake’s shape-shifting abilities.\n• Combat evildoers as Finn using a variety of unique swords and Jake’s awesome attack forms.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vicious Cycle Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":1025,"name":"Superdimension Neptune VS Sega Hard Girls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/622/622bc56e5e63b336bcb95836dc3e239d.jpg","description":"A collaboration project between ASCII Media Works’ Dengeki Bunko and SEGA, the Sega Hard Girls are made up of various Sega consoles, including the Dreamcast, Sega Saturn, and Mega Drive! These anthropomorphized consoles are girls with an array of personalities and spunk, and this time they are teaming up with Neptune and IF for an all-new adventure!\nSuper Dimension War Neptune VS Sega Hard Girls: Dream Combination Special is a crossover game between the Hyperdimension Neptunia and Sega Hard Girls franchises developed by Felistella for the Playstation Vita. IF and new character Hatsumi Sega are the co-protagonists of this game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Idea Factory","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":952122,"name":"Shogun Showdown","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a2/7a23a81875145336576e24b682d3ede7.jpg","description":"⬇️ WISHLIST OUR UPCOMING STRATEGY GAMEhttps://store.steampowered.com/app/1639080?utm_source=steam&utm_campaign=crosspromo&utm_content=shogun\nAbout the Game\nTurn-based combat where every action counts. Carefully position yourself, build up and unleash your attacks at the right time!\nUpgrade your attack tiles and combo them!\nGain new skills and build the best deck you can before facing the Shogun.\nRogue-like: death is not the end, but the beginning of your journey towards mastery. As you play, you will unlock new characters, attacks, skills and more!\nEnjoy a Japanese-inspired setting with pixel art graphics.\nInspired by great games like Into the Breach, Darkest Dungeon, Crypt of the Necrodancer, Slay the Spire and so much more","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Roboatino","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":842463,"name":"Soulstone Survivors: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca4/ca49ec5967a46864ea8ec94cc2b551f8.jpg","description":"Wishlist the full game!New characters, weapons, skills, bosses and so much more!\nhttps://store.steampowered.com/app/2066020/Soulstone_Survivors/\nAbout the GameThis is the free version of Soulstone Survivors, an action roguelite where you slay hordes of foes and face titanic bosses while learning powerful skills to enhance your character.Unique characters and skillsIn this version, you get to experience playing with 3 never seen before characters!\nCraft powerful weapons to customize your charactersGather materials from your foes and the environment, and in the blacksmith combine them into powerful arms that can drastically change how you play.\nChallenging bossesThe Lords of the Void are powerful beings, each with a unique set of powers and truly challenging mechanics, where only the most capable Void Hunters will survive.\nFeatures in the prologue:Dozens of skills to discover, such as Fire Walk, Bombardment, Whirlwind, etc.\nHundreds of power-ups to empower your character and skills;\nA cast of 3 unique characters never seen before in the game;\nNew weapons to craft, greatly changing the playstyle of your characters;\nDeep skill tree to increase your base power;\nProgress made in the Prologue is carried over to the main game!Coming to the full version:Hundreds of new skills to discover, including unique skills per Weapon, per Character, per Class and General skills;\nLoads of new power-ups to further customise your characters during a match;\nMany new characters and weapons to unlock and craft, with more being constantly added to the game;\nNew boss encounters that will challenge you and your build! Get ready to face ALL the Lords of the Void;\nDozens of runes to unlock and equip, giving you unique powers but also unique challenges;\nTons of achievements and unlocks to collect;\nSelect modifiers to face the real challenges of the game and earn unique materials and rewards;","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Game Smithing","platforms":[{"id":0,"name":"PC"}]},{"id":674259,"name":"Terraformers: First Steps on Mars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc8/dc86f678ff3177de13ed07d40dfd4263.jpg","description":"Terraformers: First Steps on Mars is a free standalone version of Terraformers.\n\nLead the first human settlement on Mars! Earth is sending its first expedition to assess the viability of human settlement on Mars, with the long term objective of terraforming the planet and spreading life across its surface. You will have to explore the planet, exploit local resources and develop your colonies into large cities. But make sure to provide a decent living standard for your people to retain their support! Are you ready to lead mankind's first steps on Mars?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Asteroid Lab","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":631947,"name":"Rogue Lords","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/169/1693b9b1654442c33483183f53b63c6a.jpg","description":"The first roguelike in which you play as the devil, which means you can change some of the game's rules to your advantage! Run after run, manage your team of famous evil geniuses as they encounter unforeseen events and turn-based combat. Unlock new skills, create powerful synergies and use your powers to turn the situation in your favour at critical moments. Only by collecting ancient artefacts can you finally take your revenge on the Demon Hunters.\nA DARK TALE\n\nWeakened from defeat to the forces of good, you fled the world and sought refuge in hell to survive. Decades later, you have returned with your most faithful Disciples to exact revenge on those wretched Demon Hunters. But the world has changed in your absence. Your enemies have become all-powerful, and a new religion – the Sanctua Lumen – has become very influential. It mercilessly hunts down all those who serve you. To reinstate your hold over the world of humans, you must first regain the strength you previously wielded by taking possession of artefacts with legendary power.\nCONTROL FAMOUS EVIL GENIUSES\n\nCreate your team of 3 Disciples from Dracula, the Headless Horsemen, Bloody Mary, the White Lady, Lilith, Hecate, Baron Samedi, and Frankenstein and his Creature.\nEach Disciple has their own unique story, abilities and gameplay: combine their skills to create devastating synergies, and deal with the mortals that dare stand in your way.\nCollect souls and exchange them for new skills, upgrades and powerful relics that can strengthen your Disciples.\nTHE DEVIL PLAYS BY HIS OWN RULES\n\nSacrifice some of your health to control the game interface: nothing will stop you – and certainly not the rules imposed on mortals.\nManipulate the health bars of your Disciples and enemies, optimise status effects to suit your fight tactics, open portals on the map, tip the odds in your favour during events… there are many occasions to use your diabolical powers throughout your run.\nTAKE BACK YOUR RIGHTFUL PLACE\n\nIncrease the terror gauge by winning fights and completing interactive events to earn valuable bonuses for your Disciples.\nComplete each event to your liking to reduce the influence of the Sanctua Lumen, give mortals good reason to fear you, and decide the fate of traitors who have allied themselves with your enemies.\nTake revenge on the Demon Hunters in epic turn-based fights.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":43968,"name":"The Crown of Leaves","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db4/db49c6a91ffc7c83c8097a0bef3dbd62.jpg","description":"Crown of Leaves is a visual, non-linear fantasy novel about mysticism, riddles, constellations, anthro beings, beasts, and ghosts!PlotRoui, a resilient city dandy, a decipherer, a half-educated jeweler and the author of scientific magic articles, was met with a colossal failure and must return to his gypsy homeland: Latori. Ciphers aren't a thing here, and local shoddy mystical beliefs are really irritating and dejecting to Roui. He dreams to return to his old life... But how can it be possible if you have no money? In search of quick earnings, Roui has picked up his old jewelry tools once more and seeks out customers himself. Roui’s latest customer has charged him with a task to make a bracelet from a special wood for his bride – due within a month! But, as soon as Roui gets to work, strange and unpleasant things start to appear. Which, due to the superstitions of the local people, became much more horrific and absurd than they actually are. Roui apparently isn't meant to finish the work on the bracelet... because it was stolen! An unexpected helper says that the bracelet was taken by the legendary Latorian spirit - the Mad Rook. Is the Rook real or is it just her sick imagination? Roui has no time to figure out the details - he has to believe the helper and start looking for the bracelet as soon as possible, all while incidentally deciphering the mysterious cryptograms he'll be facing along the way.\nWill Roui succeed and get the bracelet back? And what's waiting for him at the end of his long and full of mystical riddles journey?SettingWhere is it set?\nThe setting is a fictional world called Shang-La, a world of mixed cultures and eras, and home to various strange creatures. This is a place of old magic and new ideas, where science works together with mysticism. You can find glasses and phones, electricity and radio here, but no guns or television. The inhabitants of this world still fight with swords. The continent they live in is surrounded by the boundless ocean. The Sun and the Moon take turns alternating in the sky, and the stars are made of metal and hiding tons of secrets in them.\nWho are the Sahash?\nSahash are the second intelligent race in Shang-La, alongside humans. They are divided into five nations, differing from each other by their physicality, shape of their horns, and muzzles. Every nation has its own unique traditions and culture: ranging from habits, religion, law, and even tastes in fashion and food.\nDespite the complicated relationships between these ethnic groups of Sahash, as a whole they get along with humankind, and even try to emulate them in spite of their more animalistic nature.Key featuresPlaying our game, you will be able to:\nCommunicate with multiple characters, forge friendships, and make bitter enemies. Your words carry meaning and every piece of dialogue you speak will affect the story. Choose your words carefully! As the saying goes, \"A word once spoken is past recalling\".\nDecode ciphers!\nCollect strange items and use them to get yourself out of tight situations. Those items could be given as gifts for the characters you like, or used in magical stuff!\nExplore the world of Shang-La and meet unusual creatures, animals, spirits, and ghosts.\nChoose who you wish to become - the hero or the villain. But be prepared for the consequences, as neither choice comes without them. In our game you will find: A mix of a visual novel and a point-and-click genre!\nAnimated sprites\nAn original, richly-crafted world with intriguing concepts\nAtmospheric OST\nA few episodes of the game\nPlot twists!\nA few different endings of the each episode","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Natalie De Corsair","platforms":[{"id":0,"name":"PC"}]},{"id":37384,"name":"Xenus II: White Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8b/d8b0cfa535b6260d6b0cc93041951349.jpg","description":"Caribbean islands; islands full of secrets, mystery and the spirit of romance. These islands are both beautiful and lethally dangerous. Centuries ago the waters of this region were teeming with pirates and adventurers... and frankly, not much has changed since then.\nMany books have been written about the Caribbean basin and many films have depicted it.\nNow you have a unique chance to visit these places yourself and personally witness the everyday life of drug-dealers, bandits and the Mafioso. You'll be able to take part in various mysterious events and get involved in fights between various hostile forces, or just admire the luscious tropical environment while drinking the traditional pirate's liquor - rum. The Caribs are waiting for you!\nThe main hero arrives on the islands in order to investigate a series of mysterious events, but he instantly ends up in troubles that only you can help him with.\nGame Features\nAn unique mix of RPG and an action shooter in a modern setting.\nTotal freeplay: visit all the island resorts of Caribbean turned into no-one’s ground.\nHundreds of destructible buildings and objects to blast into oblivion.\nMore than 25 different military gadgets, including trucks, tanks, choppers and gunboats.\nGripping non-linear storyline.\nMore than 30 types of weapons.\n8 independent parties with complex relations between each other and the main hero.\nAn original RPG system.\nReal-time weather effects, day/night and atmosphere changes.\nInteraction with hundreds of unusual NPCs.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Deep Shadows","platforms":[{"id":0,"name":"PC"}]},{"id":26002,"name":"Wii Sports Resort","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/472/472c6954864d52a7681e7c8ef3d3a94b.jpg","description":"Wii Sports Resort is an immersive, expansive active-play game that includes a dozen fun resort-themed activities. It maintains the wide-ranging appeal that attracted millions to the original Wii Sports.\n\nWii Sports Resort is easy to pick up and play, but comes coupled with deeper levels of play that are sure to challenge even the most experienced gamers. Wii Sports Resort whisks players away to a resort that's full of action, while introducing an unprecedented experience in physical reality. From the moment players skydive onto Wuhu Island,they're presented with a huge selection of fun activities that everyone can play.\n\nWuhu Island has so many things to do, there's never a dull moment. A dozen activities await visitors: Archery, Frisbee®, Basketball, Cycling, Canoeing, Power Cruising, Table Tennis, Air Sports, Bowling, Swordplay, Golf and Wakeboarding.\n\nThe activities use the precision controls of the Wii MotionPlus accessory to help players come much closer to the physical reality of engaging in the actual sports. Every real-world action, whether it's a perfect drive on the fairway or a slice off the course, is meant to be faithfully replicated.\n\nEach activity has multiple fun challenges designed to keep visitors coming back for more. Basketball players might compete in a three-point shootout or jump into a three-on-three pickup game. Archery enthusiasts must aim for the bull's-eye across ever-increasing distances and obstacles.\n\nDifferent activities use the Wii Remote and Nunchuk controllers in different ways. For example, players hold the Wii Remote like a paddle in Canoeing, while in Cycling they use both arms to “pedal” with the two controllers. The Wii MotionPlus accessory picks up every nuance of motion and translates it onto the TV screen.\n\nDepending on the activity, players can compete solo or against other players. Some activities even let players team up to work cooperatively.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"}]},{"id":23034,"name":"Final Liberation: Warhammer Epic 40,000","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55c/55cd1c62d524e51467185c94839b08c4.jpg","description":"Set in the turbulent universe of Game Workshop’s Warhammer 40,000 EPIC, Final Liberation allows you to lead the Imperial campaign in Volistad as Lord Commander Militant. Having eaten five Astropaths en-route to their new stations, Ork Warboss Skroll of the Evil Sunz clan is visited with (demented?) dreams of grandeur and conquest and launches a full-scale WAAAGH! on the Imperial colony of Volistad. With the might of the Bad Moons, the rapacious Evil Sunz and the Orkiest of all clans, the Goffs, at his disposal, Skroll quickly swept aside the defences of Volistad and took control of the planet. Leading an army of Ultramarines and Imperial guard, you must retake the system and cleanse it of the foul alien by completing missions and annihilating the Ork forces. Though the Emperor protects you, you must remain vigilant, for like all Orks, Skroll loves fitin’, so he and his forces will take you to the last man and space marine. Only supreme tactics and precise execution will allow you to reclaim Volistad in the name of the Emperor.\nSSI, the masterminds behind the Five Star General Series’, bring their Midas touch to the Warhammer 40,000 world in the first ever video-game adaption of the EPIC table-top game. With over 85 unit types, this addition to the 40k franchise brings the vastness and depth of an EPIC-style battle to your PC, allowing you greater selection and customisation over your army. This, along with the multiple scenarios and battlefronts to fight from, will keep your strategic mind on edge for hours on end.Turn-based strategy with full army customisation and mission deployment\nLead your army into battle and co-ordinate attacks and stratagem against the Skroll and his forces\nComprehensive encyclopedia covers the forces of the Warhammer Epic 40,000 universe -- which includes over 85 unit types to select and control!\nCampaign play featuring over 30 scenarios","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Holistic Design","platforms":[{"id":0,"name":"PC"}]},{"id":21698,"name":"Truffle Saga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d59/d59ade58e7a71dedb8654601aad10653.jpg","description":"From the makers of Commando Jack, comes Truffle Saga!\nTake Truffle on a cool adventure to rid the forest of angry Mushrooms in a fun addicting physics puzzler!\nTruffle needs your help, and has acorns ready to throw at the pesky Mushrooms to destroy them! You have to do it in one shot, I bet you can't, though Truffle will be happy if you do!\nStop the Mushrooms taking over the forest now in this addictive saga!\n- 60 levels to complete\n- Complete each level 4 different ways to Crown it!\n- Achievements!\nFor more info, visit www.colossalgames.eu","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Colossal Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19034,"name":"Chicken Assassin - Master of Humiliation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/025/0251e2ed33f3d462926b590d2d2369db.jpg","description":"Chicken Assassin - Master of Humiliation - Epic Action RPG! Full of sarcastic and hilarious characters, rich artwork and beautifully structured class/inventory/wardrobe/upgrade/achievement systems to make it a joy to play.\nFeatures:\n*Epic missions and boss raids (Follow the story of Mean McAllister through various missions, plus jump in some of the dangerous boss raids while on the path)\n\n*Large inventory system (Over 450+ unique items & 9 combat stances)\n*Combat and resource upgrades (Are you all out berserker who only cares about fights? or you also like to upgrade your resources? -it's your choice)\n*Wardrobe (dress Mean McAllister the you want! Various possibilities for different builds)\n*Achievements (Get rewarded with souls by performing various actions)\n*Black Market (Don't feel like selling your junk items straight away? Then keep them for black market!)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Oneshark","platforms":[{"id":0,"name":"PC"}]},{"id":18354,"name":"Klabi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4db/4dbc80b4cc653ddbbbd4298255009ca7.jpg","description":"Welcome Kids and sweet-guzzlers! Let me introduce you Klabi, the sweet cat, who has a sweet tooth. This little rascal loves sweets and big, very big - no - HUGE SWEET CAKES!\nThis game is all about sweets as you might have realized and you can make Klabi's sweet dream(s) come true. In this simple platformer, you play Klabi in his dream through levels of raining sugar, dropping calorie bombs and sticky sticks of rocks called candy sticks, meow!\nAttention Kids! Klabi's dream can turn into a sour nightmare before he reaches his goal to collect all the sweets to build his enormous pie. Because other little sweet-guzzlers appear and want to have a piece of the cake before Klabi even has all the ingredients.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mystic Games","platforms":[{"id":0,"name":"PC"}]},{"id":17815,"name":"Antisquad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc1/bc1f7eecdd47ab83c7c05bb6e019c9f8.jpg","description":"Special Edition\nBy purchasing a special edition of the game, in addition to the game itself, you will also receive:\nA set of materials on the game and its creation. Sketches and drawings of artists, video art, dedicated to characters, comics, etc.\nAll of the additions that came out for the game at the moment, and is scheduled for release in the future.We wish you a good time in our game!\nJust Updated\nWe are pleased to announce the release version of the game for Linux and Steam OS. It’s finally happened!!!\nWe have made significant efforts to give all players the opportunity to play our game, regardless of the operating system they use.\nWe hope that everyone will be able to enjoy the gameplay, however, we will always try to resolve your problems, if necessary.\nFeature List• Turn-based tactics... The game is yours to command\n• Stunning visuals... It pleases the eyes\n• Fascinating story... To tell before bedtime\n• Memorable characters... It's hard to pass by without noticing them\n• Character specialization... Choose your path\n• A wide variety of gears and weapons... For each taste and colour\n• Challenges and Achievements... Making it hard for you\n• Atmospheric soundtrack... Hear the sound of awesomeness?\nAbout the GameWidely known in small circles as AntiSquad, they are a military tactical response unit. These hardened military professionals, tired of bureaucracy, politics and serving the armed forces, have established a private paramilitary formation located in south United States. Being true military professionals, they periodically execute contracts for jobs that may not be considered “clean”.\nThe Team consists of many complex individuals with their own back story, but they do not shun mercenary applicants. Members of the team are idealists; they dwell on moral issues, as well as question blind nationalism, etc. AntiSquad strongly differ from military units. They truly are a bunch of contradictions put together - heartfelt cynics, gregarious egoists, aggressive pacifists, and phlegmatic rebels all under one banner.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"InsGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16865,"name":"Rescue Love Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c4/4c4007c1ad8e1897a4bbd0faa2ba857e.jpg","description":"Rescue Love Revenge is an exciting new action-adventure game with an epic story that will unfold as we release future and frequent updates.\nRLR features an energetic style with addictive gameplay and challenging levels!\nUnrequited Rescue\nIn Act 1 Chapter 1, we find our hero crossing treacherous terrain to Rescue girls in the high Alpine mountains, guarded by a band of bandana'd bandits. A second character known as The Grizzle makes his entrance in Chapter 2's desert environment. Chapter 3 will mark the beginning of episodic releases in a semi-regular fashion.\nRLR's first chapters are a wild ride with unexpected storytelling, fun twitch gameplay, cutegore retro graphics, and addictive music. It's a funny style mixed with a twisted story surrounding timed jumps in a hardcore twitch runner full of secrets in each level. With chaotic combat reduced to simple gameplay, this mode that feels like racing can be challenging and at times a bit unforgiving.\nFortune's Fool\nAt its core, Rescue Love Revenge is a sandbox game set in The Old West with the first levels focused on having a retro style with auto-attacking and auto-running singleplayer gameplay where only jumping is key. That is only one realization of the game's components for creating experiences. The game will gradually expand and transition beyond the retro style to realistic and other styles, to full platformer and shooter controls, to couch multiplayer and scalable online play, to level editing and game modifications with extensive Steamworks integration.\nDuring Early Access the default retro mode will receive updates adding new chapters beyond one and two with new custscenes and levels, upgrades to the level selection world map, the RLR runtime level editor, multiplayer and other new modes, and the slow build of the nextgen realistic open world sandbox sequel of sorts, almost like two games in one plus mods and episodes for tons of hours of overall gameplay.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hatchlight","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15339,"name":"BalanCity","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e03/e0384b583b2aeccd98ae7cb4692270bb.jpg","description":"BalanCity is a city building / balance physics game. It's a mixture between old school SimCity and Jenga. You must build the tallest towering city over a balancing platform while keeping your citizens happy.\nYou can build residences, offices, power plants, train stations, airports, landmarks and more.\nBeware of disasters, as your city will eventually face doom in the form of fires, earthquakes, meteor strikes, UFO attacks, monsters and more!\nWill your city survive the test of balance? See it for yourself!\nGame modes:\nFree Build: A sandbox where your only limit is gravity.\nMissions: Levels that have a goal to achieve and limited resources.\nScenarios: Based on real life cities, you must build all the landmarks before the city collapses.\nMobile version will be released mid 2017.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fernando Cordoba","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11803,"name":"Hive Jump","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbf/bbf0136039177a524f8f1d16274fe747.jpg","description":"In the 24th century, humanity is at war with a hostile alien race. Outnumbered a million to one, mankind’s only hope of survival is the J.U.M.P. Corps. Its mission is to fight the alien menace hive by hive and planet by planet.\nYou and your friends assume the role of JUMPERS, and blast your way through procedurally generated alien hives in chaotic run and gun platforming action. Up to 4 Players band together in Local or Online Co-op to kill aliens, avoid traps, collect treasures and discover lost relics. Defeat fierce alien bosses to complete your mission and save the galaxy.Key Features\nAction Platforming: Engage swarms of aliens in frenetic combat. Avoid traps, withstand ambushes, discover treasures, rescue survivors, and more.\nCo-op Multiplayer: Among the best local multiplayer games on PC play with up to 4 buddies!\nProcedural Levels: Jump into procedurally generated alien hives. Level modifiers like dark levels keep you on your toes and offer new challenges to overcome.\nUnique Permadeath: Keep the transponder backpack in one piece! It is your mobile respawn point and if it is destroyed your team has no more lives.\nChallenging AI: Intelligent and fierce enemies will hunt you throughout the hive.\nSci-Fi Arsenal: Pulverize aliens with pulse rifles, flamethrowers, and a variety of unlockable and upgradable weapons that persist between missions.\nHand-Designed Challenges: Plunder challenge rooms and uncover lost relics to boost the power of your jumpers for that mission.\nDynamic Lighting: Experience pixel-perfect dynamic lighting using Sprite Lamp.\nDaily/Weekly Challenges: Compete with friends and strangers to see who is the greatest jumper in the galaxy with Daily and Weekly Challenge missions with Leaderboards coming soon.\nStrategic Campaigns: The results of your jumps directly impact the ongoing galactic war against the aliens. Manage your planetary campaign between jumps in a turn-based strategy mode. Invite your friends and random Jumpers into your Campaign Missions for jolly cooperation!\nGamepad Support: Play Hive Jump using your favorite console controller.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Graphite Lab","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10411,"name":"Codex of Victory","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96c/96c02bb89cb8f438143b5b60d48d16f2.jpeg","description":"Special Offer\nAs a thank you to everyone who supported the game, we're adding a massive 60+ page artbook to every copy of the game. You will find the artbook full of renders and concept art in the game's main installation directory.\nAbout the GameHuman society has been divided. On one side, the natural course of human evolution has been disrupted. What started as an attempt to adapt to the harsh conditions of outer space and hostile planets, led to the creation of a weird race of transhuman cyborgs – the Augments. Driven by a desire to ‘liberate’ ordinary humans from the limitations of their wholly organic bodies, the Augments have launched a full-scale attack. Now we must defend our territory and fight back, to save our Kingdoms and all of humanity as we know it!\nCodex of Victory features an extensive story-driven, single-player campaign that tasks you with building and commanding a hi-tech army of drone vehicles, tanks and robots. The campaign offers an exciting mix of real-time base building, global strategic planning and turn-based combat. Travelling between planets and territories, your sole task is to stop the Augments.\nInspired by classics of the strategy genre, the base building element involves expanding your underground HQ in real-time. Collect room blueprints, build factories, research centers, workshops, laboratories and other facilities, to prepare for battles ahead. Global tactical oversight comes from your Planetary map, on which you’ll instantly see where your armies need to be deployed.\nEngage in tactical turn-based combat on hex-mapped battlefields. Select your units and upgrades, deploy them to the battlefield using the terrain to your advantage and test your tactical skills in each mission. As you progress through the battles of the main storyline and the various randomly-generated side missions, you’ll gain access to over 25 units. Each type of unit comes in countless variations, thanks to a diverse range of upgrades and add-on modules. Build your best and put them to the test against the incoming Augments!Features:\nExciting combination of turn-based combat and real-time base building\n20+ hours of story-based singleplayer campaign\nOnline multiplayer battles with detailed army customization options\n25+ unique units, each with countless variations\nHigh replay value ensured by randomly generated campaign missions\nNeo-feudal sci-fi environment with vivid, cel-shaded graphics","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ino-Co Plus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":9565,"name":"Wanderland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a9/8a9bca1f57f92fb3dcf77e3e58fa61eb.jpg","description":"Join our Steam group!Join our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nAbout the Game\nWe're proud to present Wanderland, the latest game from Artogon, the world-famous creator of great casual adventures series such as Shiver, Treasure Seekers and Depths of Betrayal. In this mystery adventure, Sleeping Beauty has been kidnapped! Explore a world full of temples, crypts, and more as you help the Prince rescue her.\n– Locations. Adventure locations appear on the map as glowing portals, where the main plot gets twisted like a Gordian knot. Each portal can lead to several different locations, determined by the story; in turn, each location consists of three to four screens with several NPCs and many tasks to complete…\n– Map. Move your character across the map. Select an object your character will automatically to move towards it.\n– HOS. Hidden Object Scenes (HOS) are the main part of the gameplay. Search each scene for one or more objects listed below the scene. Each object you find will help you fulfill your quest and move forward in the story. There are lots of HOS in the game, all carefully drawn and beautifully animated.\n– Special Objects. The map contains several special upgradable objects that you can visit. Each object may reward you with a special item or ability. Each reward is only available once in a specified period of time; you can also spend resources to upgrade the special objects for better ones or more powerful abilities\n– NPC. Looking for NPCs (Non-Player Characters)? There are many—both friends and enemies of your player character. Some can move around the map. Others live in fixed locations.\n– Quests. Quests move the game forward—and they’re everywhere! Defeat a drudge of wandering skeletons… Explore an abandoned cave… Rescue a kitten from the tree… All are quests! Anything you must accomplish in an Adventure location is a quest. But there are also many things you can do on the map without searching for an NPC or undertaking a real quest.\nBut who needs a quest to kill an evil ogre anyway? Why wait until an ogre triggers a quest by robbing or killing someone? You can be proactive and go after that ogre first!\nWanderland: your journey to the land of fairy tales now begins!\nP.S.\nFor all game players we'll offer a bunch of adorable collection of collectible items - 7 trading cards, 4 backgrounds and 5 amazing emoticons!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artogon","platforms":[{"id":0,"name":"PC"}]},{"id":5616,"name":"Madden NFL 10","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b3/8b3e67e2eaeaa6e0d790abd245f3713b.jpg","description":"Madden NFL 10","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"}]},{"id":3680,"name":"ACE COMBAT INFINITY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/03d/03d6d1177edec24d02d7bffb78e69d06.jpg","description":"Unleashing the latest entry in the 'ACE COMBAT' flight shooting game series!\nDownload it for free and start playing!\n- Experience The Freedom Of A True Ace\nHigh quality flight shooting action that you can play for free!\nPut yourself into the pilot seat of real aircraft and tear across realistic skies!\nFly around freely and shoot down all the enemies you see!\n- The Story of a World Class Hero\nIncludes a single player story mode (Campaign).\nExperience the thrilling drama when aces clash in the skies.\n- Online Co-op & Multiplayer\nCooperate with players from around the world to take down powerful enemies,\nor have two teams of players go head-to-head in 'Online Co-Op Missions'!\n1 player\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-8\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\nAll trademarks and copyrights associated with the manufacturers, aircraft, models, trade names, brands and visual images depicted in this game are the property of their respective owners, and used with such permissions.\n©JAPAN SPACE IMAGING CORPORATION\n©DigitalGlobe, Inc., All Rights Reserved.\nACE COMBAT® INFINITY & ©2014 BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":418,"name":"Nimble Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57e/57e3da77e341ebd019489804e6fbbaca.jpeg","description":"Nimble Quest! Lead a conga line of heroes to glory against hordes of enemies across an endless number of stages. How many enemies can you defeat? Steer your unstoppable (seriously, you can’t stop) party as they cut a path of destruction through levels filled with different enemies and power-ups. Unlock and level up heroes to increase the size of your party and make them more powerful. Can your party make it from the tranquility of the Forest to the fire and brimstone of the Depths?\nTired of competing alone? Join a guild and compete with other players in special time-limited Guild Quests. Is your guild skilled enough to top the global leaderboards?","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"NimbleBit","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":129,"name":"Sky Force Reloaded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84b/84b1de83b06f22c267c5c7604ff41d44.jpeg","description":"The shoot ‘em up you were looking for!\nSky Force Reloaded is the spirit of the classic arcade shoot ‘em ups, captured with modern visuals and design. New entry in the series will keep you entertained with all the things you’ve came to love in scrolling shooters. Meaty explosions, incinerating lasers, collosal bosses and diverse aircrafts to pilot.\nSky Force Reloaded is not your average scrolling shooter. It will draw you in with its beautiful environments and intense effects. It will keep you with its superb gameplay mechanics, progression system and in-game collectibles. It will leave you wishing for more, once it’s over. Fortunately, there’s a lot to do before that happens.\nMaster 15 beautiful and immersive stages with challenging missions to complete.\nBattle enormous and intimidating bosses, laugh when they explode and cry when you explode.\nUnlock new difficulty modes, all the way from Normal to Nightmare.\nPut yourself in danger to rescue missing operatives from the battlefield.\nAssemble and test 9 different aircrafts. Pick your favorite, with its unique features and play style.\nHunt down 30 elusive bonus cards to add even more depth to the gameplay. Some of them will grant permanent benefits, while others will boost your abilities only temporarily.\nInstall hundreds of upgrades to your weapons, shields and other equipment. Turn your plane into a flying tank.\nComplete in-game objectives to unlock 8 assisting technicians. Choose one of them to help you with their special skill.\nSpot the wrecks of your fallen friends and get rewards for picking them up.\nEnter the Weekend Tournaments to challenge your friends on one of 5 specially crafted infinite stages.\nAppreciate highly polished gameplay and well balanced difficulty curve, whether you consider yourself a casual gamer or a die-hard shmup fanatic.\nEnjoy professional voiceover and incredible electronic soundtrack.\nSet the fun level to eleven by inviting your friends to play with you in local cooperative mode! Find the planes that best suit you both and challenge the hardest bosses, too fearsome to be faced alone.\nWelcome to your new favorite shoot ‘em up. Welcome to Sky Force Reloaded!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Infinite Dreams","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":12,"name":"Ironcast","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14e/14e7221cce4949fd9ea8a5e9ea047851.jpg","description":"Inspired by Victorian era science fiction writers such as H.G. Wells and Jules Verne,  Ironcast is set in an exciting alternative history; a time when refined men and women in top hats and bonnets commanded gigantic walking war machines, laying waste to the enemies of the British Empire! Take control of a 7 meter tall walking vehicle called an Ironcast and face off against an invading force of enemy Ironcast in order to defend 1880's Victorian England.\nBattles are fought by generating resource nodes which in turn drive the Ironcast's various weapons and systems. You must choose how to spend these nodes wisely, either offensively in order to cripple and destroy your opponents, or defensively, if they suspect a barrage of incoming weapons fire is due.Features:Turn based strategy combat set against a rich and interesting alternate 1880's history.\nRoguelite campaign mode where death is permanent but with persistent rewards from one game session to the next. Drive back the invading forces and press forth for victory!\nHand painted art style.\nInspired by the steampunk genre and Victorian science fiction.\nLoot new technology and upgrade abilities from the wrecks of fallen enemies.\nCustomise your Ironcast with a range of unique weapons and defensive systems. Over 50 different unlockable items will ensure an almost limitless number of combinations.\nPassive Augmentations allow players to modify their Ironcast's weapons and abilities.\nFor PC, Mac and Linux.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dreadbit","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":428859,"name":"SuchArt!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e4/3e4821676cd1432f5e5df5752bcb743d.jpg","description":"SuchArt! is a game featuring you being such an amazing artist. Really you rock, your latest DNA test is very positive about it.\nNow please pick a brush or a flamethrower and express your boundless creativity across your brand new studio, up board the International Space City. And don’t forget: the only limit is the size of your brush.\nAs down on Earth the robots are revolting and the ugly (yet somehow cute) Crabuxes covet the planet’s salt water, only you can decide what to paint on your next canvas…Key features:Paint everywhere. Wait, how did you mess up your studio that much that fast?\nWaw! Did those red and blue pigments really mix into this elegant yet powerful purple?\nHey, this elegant yet powerful purple subtly dried over the last minutes. How exciting!\nSell your art! Sell your paintings at the marketplace, or fulfill all your clients desires through hopefully well paid commissions. Or the promise of a gift. Or some exposure, the best of all currencies out there.\nExpose your art! Expose your delicately crafted paintings inside your virtual gallery.\nGet more tools! Don’t let this boring bland brush get in the way of your creativity. You want a flamethrower? Buy a flameth… wait, this thing is expansive!\nGet famous! Singing is overrated. In 2130, painting is the way to go.\nThey say down on Earth the robots are revolting and the Crabuxes covet the planet’s salt water. But surely that’s none of your business. Or, is it?","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Voolgi","platforms":[{"id":0,"name":"PC"}]},{"id":350584,"name":"Dinkum","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6f/f6f78fd14d016f11d0efa74968d4eb30.jpg","description":"G’Day there! Get ready to start a new fair Dinkum life and build a home on an Island inspired by the wild Australian outback. Explore tropical eucalyptus forests, survive scorching deserts, relax at cool billabongs and discover scrubland filled with adorable Aussie inspired wildlife. Collect valuable resources by hunting, mining, fishing and foraging to expand and customise your town and attract new townsfolk and businesses. Share your new home with friends and protect each other as you explore beautiful landscapes filled with dangerous predators.\nGo from starting out sleeping in a swag under the stars, to a sprawling town with farms, businesses and attractions. Eventually, you’ll draw in visitors, who might decide to stay and make it their home too.\nKeep your neighbours happy by customising your town with fences, flower beds, street lamps, beehives, windmills, hedges, fountains and more. The happier your townsfolk are the more likely they are to settle down, bring their families and set up stores with unique items.\n\nInvite your friends to visit your town where they can help you construct buildings, shop at your stores, go fishing, race Emus, fight crocodiles much more!\n\nThe island is Choc-A-Bloc with insects, fish and minerals. So grab your thongs and go track down and collect them all for your personal museum collection, or sell them for a tidy profit!\n\nCare for and breed chickens, cows and sheep as well as Dinkum’s iconic Giant Wombats! The Wombats might seem intimidating at first, but really they are sweethearts.\nCultivate crops for your town across the whole island, choosing the best spots for each type. Not only do the seasons change, but the temperature shifts depending on where you are on the island\n\nHunt animals for food and defend yourself from deadly predators who are just as hungry as you. Those Roos might seem friendly but they pack a punch!\nAttack creatures head on or capture them with traps, it’s up to you how to survive.\nCustomise your character in Dinkum to be the True Blue version of you. Buy that shiny pair of sunnies or wide Akubra hat in the shop, or seek out rare items through exploring the great outdoors and through chinwags with fellow townsfolk.\nMake your house your own cosy abode. Craft a huge range of furniture and decorations, choose where everything goes and invite friends over to show off your interior designer creds.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"James Bendon","platforms":[{"id":0,"name":"PC"}]},{"id":292902,"name":"The Lord of the Rings: Journeys in Middle-earth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1aa/1aa96a25de7e5d3898df669f7ab89b87.jpg","description":"The Lord of the Rings: Journeys in Middle-earth™ is a cooperative game for one to five players. During a game, a group of heroes embarks on perilous adventures, working together to explore and survive the vast and epic fantasy world of J.R.R. Tolkien's The Lord of the Rings™. Throughout their journeys, heroes battle powerful foes, discover lost treasures, uncover forgotten lore, and customize their skills according to their role within their Fellowship. As darkness is rising, unifying evil, shadow, and corruption, it is the time for the heroes to take a stand and begin their journey in Middle-earth.\nTo play The Lord of the Rings: Journeys in Middle-earth™, one player must download the free Journeys in Middle-earth app on a compatible device. The app determines the challenges and content that the heroes encounter during the game, from tile and token placement to enemy behavior. The app also lets the heroes save their campaign, allowing them to complete it over the course of several gaming sessions.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Fantasy Flight Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":54311,"name":"Medal of Honor (1999)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/adb/adbbb53b574aae53145f9909d050a722.jpg","description":"Tomorrow is D-Day. Tonight you land behind enemy lines. The tide of the way is in your hands. You are an elite Special Forces agent sent to execute covert operations, search and rescue missions, and commando raids. Fight to win the medal of Honor in the only game that lets you take on Nazis in WWII.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Danger Close Games","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"}]},{"id":53804,"name":"Disney's DuckTales","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/51d/51dd08ed8b15011366c3393dbefb64c5.jpg","description":"DuckTales is an action platformer video game developed and published by Capcom and based on the Disney animated TV series of the same name. It was first released in North America for the Nintendo Entertainment System in 1989 and was later ported to the Game Boy in 1990. The story involves Scrooge McDuck traveling around the globe collecting treasure and outwitting his rival Flintheart Glomgold to become the world's richest duck.\nProduced by key personnel from the Mega Man series, DuckTales would go on to sell over a million copies worldwide on each system, becoming Capcom's best-selling title for both platforms. The game was praised for its tight control, unique and non-linear gameplay and bright presentation, and is often regarded as one of the best titles for the NES, appearing on numerous \"Best of\" lists.\nDuckTales was followed by a sequel, DuckTales 2, in 1993. A Remastered version of DuckTales developed by WayForward Technologies, featuring high resolution graphics and most of the original voice cast from the show, was released in 2013 for PC, Xbox 360, PlayStation 3, and Wii U. The original 8-bit version of the game was also included in The Disney Afternoon Collection compilation for PC, PlayStation 4, and Xbox One.","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Capcom","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Game Boy"}]},{"id":42144,"name":"Infinite Crisis","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de9/de9c6ba98b5509eb367d9a1c4fe12e89.jpg","description":"Infinite Crisis was a MOBA with DC Comics superheroes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Turbine","platforms":[{"id":0,"name":"PC"}]},{"id":23154,"name":"Hidden & Dangerous 2: Courage Under Fire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b18/b1807f1c2a081824b0df64001bbe7ccc.jpg","description":"Hidden & Dangerous 2Hidden & Dangerous 2 is a first and third person tactical shooter that builds upon the tremendous success of Hidden & Dangerous. You lead a small squad of Allied soldiers deep behind enemy lines, to carry out secret missions during World War II. The gripping story line takes you to Europe, Africa, Burma, and other locations scattered across the globe. Each critical decision impacts you, your men, and your country. This unique blend of action, strategy, and tactics forces you to use your brain just as much as your trigger finger.Hidden & Dangerous 2: Sabre SquadronReprise your role as commander of the elite Special Air Services (SAS) in World War II as you take on the Axis Powers in nine new missions set in France, Africa and Sicily. Fight through these campaigns alone or play co-operatively with friends. Sneak past enemy lines, infiltrate heavily guarded bases and outposts, and utilize superior tactics to eliminate the opposition.\nSupply your squad with a number of weapons including pistols, sniper rifles, grenades, and bazookas!\nA Fully Interactive Environment depicts the ineptness of drowsy guards, the shocking quickness of an elite German battalion spotting your movements, and the terrified look of the enemy as you shove the barrel of your rifle under his nose!\nComplete over 20 missions in 9 campaigns from the lush jungles of Southeast Asia to the harsh deserts in Africa. Commandeer a variety of vehicles including trucks, tanks, motorcycles, and planes.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Illusion Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":21672,"name":"Steam Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/159/159cdd4b9a335685b407277f5e4b8ffd.jpg","description":"Help three brave adventurers on their quest to stop the diabolical Baron Von Smog’s plot to conquer Steam Land. However, there is an army of evil minions that stand in your way. Challenge yourself in this new puzzle strategy game; includes 12 action-packed stages, a full soundtrack, competitive online play, all in stunning 720p HD Graphics. It's up to you to save Steam Land!\nUsing classic Match-3 gameplay, use your skill and cunning to give power to your 3 heroes and their unique abilities. Matching colours generates steam of that type; your character then utilise the Steam to heal, attack and defend your party. Unlike many other Match-3 games, not every match is a good one. Think ahead carefully and ensure that your character use their special combo attacks to defeat the bosses!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ProjectorGames","platforms":[{"id":0,"name":"PC"}]}]