[{"id":586208,"name":"F1 2021","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/882/8820b0bc5ec9c135aca22389d105b566.jpg","description":"• The entire F1® 2021 game\n• Braking Point Content Pack\n• Celebrate the release of F1® 2021 with exclusive in-game items inspired by the fictional stars of the new ‘Braking Point’ story experience. Equip them to race as Devon Butler, Aiden Jackson, and Casper Akkerman: Character avatar | Car livery | Suit | Gloves | Helmet | Victory radio voices\n• 5,000 PitCoin virtual currency to spend in-game\nEvery story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-player Career, and get even closer to the grid with ‘Real-Season Start’. Take your team to the top in the acclaimed ten-year ‘My Team’ Career mode, or race head-to-head in split-screen and multiplayer. Immerse yourself in the greatest racing spectacle on the planet and race with the authentic lineup of twenty heroic drivers and ten iconic teams from the 2021 season:\n- ‘Braking Point’ – the thrilling new story experience\n- New ways to play: two-player Career and ‘Real-Season Start’\n- Acclaimed ‘My Team’, split-screen and multiplayer\n* Online connection required to download the final F1® teams’ 2021 cars, full-season circuit selection, content (as applicable) and F2™ 2021 season update.\nONLINE CONNECTION REQUIRED TO DOWNLOAD THE FINAL F1® TEAMS’ 2021 CARS, FULL SEASON CIRCUIT SELECTION, CONTENT (AS APPLICABLE) AND F2™ 2021 SEASON UPDATE. ACCEPTANCE OF EA USER AGREEMENT (terms.ea.com) REQUIRED TO PLAY. EA'S PRIVACY & COOKIE POLICY APPLIES (privacy.ea.com). YOU CONSENT TO ANY PERSONAL DATA COLLECTED THROUGH YOUR USE OF EA’S SERVICES BEING TRANSFERRED TO THE UNITED STATES, AS FURTHER EXPLAINED IN THE PRIVACY & COOKIE POLICY. EA MAY PROVIDE CERTAIN FREE INCREMENTAL CONTENT &/OR UPDATES. MANDATORY CONTENT UPDATES MAY BE DOWNLOADED AUTOMATICALLY, REQUIRE ADDITIONAL STORAGE, INCUR BANDWIDTH USAGE FEES, & REQUIRE AN ADDITIONAL PURCHASE TO ACCESS. EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON ea.com/service-updates.\nF1® 2021 Game - an official product of the FIA FORMULA ONE WORLD CHAMPIONSHIP. © 2021 Electronic Arts Inc. The F1 logo, F1, FORMULA 1 and related marks are trademarks of Formula One Licensing BV, a Formula 1 company. Licensed by Formula One World Championship Limited. The F2 FIA FORMULA 2 CHAMPIONSHIP logo, FORMULA 2, F2 and related marks are trademarks of the Federation Internationale de l’Automobile and used exclusively under licence.  All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":18045,"name":"Elements: Soul of Fire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15d/15d02e4286601157421c4a711aa6b63a.jpg","description":"The light of the world fades. Evil hearts seek the Power of the Elements - the forces which bind the universe together - thus threatening all of existence.\nJoin an eclectic cast of characters and embark on a fantastic journey in the vast archipelago of Adamaria, evoking the gods of the land, sea, and sky in your quest to rekindle the fire of hope! Restore the light to the mystical Runes by earning the favor of the mighty Elemental Guardians and stand up to the oppressive forces of darkness.\nFrom the depths of the ocean to the highest skies and far, far beyond, your journey will take you to unimaginable places. Breathtaking action, mind-bending puzzles, and perilous traps await you in this epic 70-hour adventure.\nCome, awaken the power within YOU! Lose yourself in \"Elements: Soul of Fire!\"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"New Reality Games Int.","platforms":[{"id":0,"name":"PC"}]},{"id":14019,"name":"DARK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/818/8183a2e3f4d82cfb317acea22e865307.jpg","description":"DARK is a unique stealth-action game with RPG elements in which you take on the role of the ultimate hunter: a vampire.  Ambush your enemies from the shadows, roam the darkness and use powerful vampire skills to dispatch your opponents.\nThe intricate story of DARK will take you into the midst of a world of blood and darkness, where the hunter can easily become prey.  Strike down other vampires, improve your character and develop formidable skills such as instantly disappearing from view to take your enemies by surprise.Key Features:Stealth and action meet role-playing: earn experience, pick your dialogue choices and develop your skills to become the ultimate hunter\nUse impressive vampire skills and powerful melee attacks to eliminate your foes from the cover of darkness – go invisible, stalk your prey unnoticed and devastate them with up-close attacks\nA variety of enemies await your fangs – from mortal human police and security guards to fellow creatures of the night\nMake your way through lavishly appointed environments, from the city museum to the hidden fortress of a vampire lord hidden within a towering skyscraper\nImpressive 3D cel-shaded graphics","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Realmforge Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":7452,"name":"Battle for Wesnoth","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f05/f05b83b3e490b32f0e207359251c4b66.jpeg","description":"The Battle for Wesnoth is an open source, turn-based strategy game with a high fantasy theme. From the plains of Weldyn to the forests of Wesmere, from the mines of Knalga to the soaring peaks of the Heart Mountains, take part in over a dozen adventures spanning centuries! Play as a young prince as he flees the encroaching forces of the Lich Lords to a new home across the sea... Delve into the blackest depths of the earth to craft a jewel of fire itself... Travel the continent in a daring quest to reclaim your rightful throne from a usurping queen... Step into the shoes of a young mage, his village beset by orcish invasion, as he seeks vengeance and immortality... Battle the undead hordes of a foul necromancer as he marches upon your capital... Lead a daring group of survivors across the blazing sands to a final confrontation with an unseen evil... The choice is up to you.\nThen take the battle online! Choose from seven fully-balanced factions and duke it out with your friends in over 50 multiplayer maps for parties of all sizes!\nExplore hundreds of creative community-made campaigns, maps, and factions for both single and multiplayer, and try your hand at crafting your own! Wesnoth features a built-in map editor, a highly moddable engine, a simple and intuitive scripting language, and a friendly and dedicated modding community. There's no telling what adventures you'll bring to life!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Wesnoth","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":2476,"name":"Neverending Nightmares","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fda/fda79a24e7668f09cfa09b30b2f3d605.jpg","description":"Neverending Nightmares is a psychological horror game inspired by the developer's actual battle with mental illness. In the game, you take on the role of Thomas who awakens from a terrible nightmare only to find that he is still dreaming. As he descends deeper through the layers of hellish dreamscapes, he must hide from horrifying apparitions and outrun his inner demons. He must discover which of the horrors he encounters are a manifestation of his own psychological state and figure out what reality will be when he finally wakes up.\nTerrifying nightmare worlds inspired by real life struggles with OCD and depression.\nBlack and white artwork creates a distinctive moody and dark atmosphere.\nBranching narrative features 3 completely different endings.\nA dynamic lighting system gives the ever present darkness a character of its own.\nIGF nominated composer Skyler McGlothlin delivers a haunting and oppressive dark ambient score.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Infinitap Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":301573,"name":"Deleveled","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8a/a8a223c0bbd0e73d6934c171246847e5.jpg","description":"Find creative ways to use gravity to your advantage as you navigate the mind-bending world of Deleveled.\nIn Deleveled, you simultaneously control two characters: one who falls down and one who falls up. Neither of them can jump but they can exchange momentum through solid surfaces. That'll have to suffice as you help them make their way through dozens of puzzle-platforming challenges.\nEach level contains several pairs of switches that must all be turned on before you're allowed to exit. You're only allowed to flip two switches at a time so you'll have to think strategically to solve each puzzle.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"ToasterFuel","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":17765,"name":"Expeditions: Conquistador","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f48/f48bea57f65b8e3fa777f05d0d57d5c6.jpg","description":"Conquer the New world: In the 16th Century, Spanish explorers and soldiers reached the shores of America. The search for gold, fame, and adventure drove these travelers into a treacherous wilderness where they faced hunger, disease, and dangerous predators. In their wake, the Aztec Empires lay in ruins.\nRe-write the history of the Conquistadors: Forge diplomatic alliances with the natives... or crush the savages and bring civilization to the pagan tribes! Create an expedition of individual characters: Choose your followers wisely from over 30 characters, but be careful - they each have their own traits, opinions and moral standards.\nHunt for unimaginable riches and fight intense battles in the unforgiving jungle. In this turn based strategy RPG, a cunning plan is as vital as thoughtful resource management. Expeditions: Conquistador offers a rich storyline separated into two campaigns, challenging players throughout 25+ hours of gameplay. Strategy veterans as well as newbies will find their turn-based El Dorado!\nFeaturesDiscover the New World! Travel to legendary locations in America, roam the jungle on the hunt for mystical temples as well as ancient ruins.\nCreate your own party of followers! Choose from more than 30 characters, train your recruits and lead them to battle. Coach them as they will develop from untrained recruits to fierce battlefield veterans.\nFour highly customisable difficulty levels will challenge pros and newbies alike. But be warned: The Iron Man mode is a real beast!\nChoice & Consequence: Use your skills to avoid hostility or, when diplomacy breaks down, adapt your tactics to highly varied terrains across more than 70 battlefields.\nChallenge your friends to tactical PvP combat in either Hot Seat mode or via TCP/ICP.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Logic Artists","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10791,"name":"Black Mirror I","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a7b/a7be0ee5ac6fc97f42a59cddc0fa684a.jpg","description":"Black Mirror is a dark adventure game that details the aftermath of the tragic death of William Gordon. Playing as his grandson Samuel players must unveil the truth behind the events of that fateful, stormy night. The Gordon family has accepted William's death as suicide; however, Samuel is not so sure. And through further investigation some terrifying family secrets are revealed. Through the course of the game players will discover the tragedy that has decimated the Gordons since the Middle Ages - and eventually fight to escape a fate that will not stop until it has claimed every member of the family.Key FeaturesA rich and interesting storyline to capture the imagination\nThird-person graphical adventure\nSix comprehensive chapters\nFeatures 23 individual characters\nMore than 100 different locations, including: a medieval underground temple, a mental hospital, and a cemetery\nAtmospheric effects such as rain, fog, and storms\nHundreds of realistic animations\nMany logical, inventory, environmental, and tactile puzzles","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"KING Art","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2309,"name":"Grand Kingdom","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f18/f18361fe0b65604ed7032a76f71fd3f2.jpg","description":"After the fall of the once-prosperous Uldein Empire over one hundred years ago, the Four Great Nations now wage war to claim dominion over the Resonail continent. Battles are no longer fought by honorable knights loyal to a nation, but by mercenaries who sell their services to the highest bidder.\n\nAs the leader of a mercenary squad, the player will lead their troops across a battle-scarred continent, overcoming obstacles and adversaries as they complete quests doled out by each nation. In doing so, they will unravel the mystery behind the downfall of a mighty empire.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":484828,"name":"There Is No Game: Wrong Dimension","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c32/c3214fdd63f48b9ad2b5d87bfdec0885.jpg","description":"\"There is no game: Wrong dimension\" is a Point&Click comedy adventure (and Point&Click only!) that will take you on a journey you never asked to go on, through silly and unexpected video game universes.\r\nWill you be able to play along with the \"Game\" to find your way home?\r\nWe sincerely think NOT.\r\nA Point&Click comedy adventure. You can go ahead and put your controller back up on the shelf.\r\nIncredible 3D graphics that are flat. Completely flat. And very pixelated.\r\nAlmost fully voiced. (May contain traces of foreign accents here and there.)\r\nSolve riddles that require you to think \"Outside the box\".\r\nHint system included because you can't think \"Outside the box\"...\r\nShorter than an MMORPG, which leaves you plenty of time to finish some REAL good games.\r\nDiscover the Top 10 best walls. The fourth one will surprise you!\r\nMotion sickness free, which is pretty remarkable for a non-VR experience.\r\nContains tons of bugs... but it’s supposed to be like that.\r\nAnd lots of other surprises!\r\nYou haven't heard of “There is no game”, winner of the 2015 Construct Jam?\r\nThat's perfect! Go play Battle of Duty instead of clicking on the image below to try this weird, totally pointless video game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Draw Me A Pixel","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":22416,"name":"Space Trader: Merchant Marine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/64a/64a7870e16c1e90e254592baa8edba5e.jpg","description":"In the far future, humanity is ruled by The Ministry of Accounts, an oppressive bureaucracy that tracks, records and taxes every transaction of daily life. From the depths of Red Tape, a new breed of marketeer arises to challenge the authority and make a profit: the Space Trader is born!\nAs a Trader, you will attempt to amass a fortune beyond your wildest imagination, buying and selling commodities and taking up arms against the oppressors or even accepting bounty missions, hunting down crime bosses and their thugs.\nTrader Campaign: Start as a rookie trader and earn your way to Master Trader using shrewd trades, back alley deals, bribes, a well placed bullet and more through a challenging 5-level single-player campaign.\nThree Ways to Challenge: Master your trading skills in three unique challenge missions; Moon Madness, Free Trade and Red Eye Trader.\nFrom Iron Ore to Organs: Turn misfortune to profit. Buy low, sell high. Over 40 different commodities to supply the demand.\nHave Ship, Will Travel: Visit seven planetary locations, their moons and stops along the way and interact with over 100 characters.\nConflict Builds Character: Using an assortment of unique weapons, bring dozens of crime bosses to justice and turn a tidy profit.\nCompetitive Cooperative: Challenge your friends and family, not just your peers. Working together has never been so competitive!\nSteam Achievements: Unlock all 40 Steam Achievements","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Meridian4","platforms":[{"id":0,"name":"PC"}]},{"id":20660,"name":"The Forgotten Ones","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b0/7b08198af2d7fe16ae62b58784085e27.jpg","description":"Through the eyes of Grobuskna Vladinov, you'll be taken through a ride that has stained itself to Grobuskna's memory.\nLosing his parents during the holocaust left Grobuskna with many questions, he couldn't accept to let the villain be forgotten.\nHaving a father that worked close with the resistance during world war two was a big risk in itself.\nBut as Grobuskna once said, to let good die and bad live is something no man can accept.\nGrobuskna is a detective, as a side thing he's been trying to keep track of remaining Nazi officers spread around the world.\nDespite the fact that he knows who took his parents, he still doesn't know where he's hiding.\nUntil an unknown call reaches Grobuskna's office, an unknown call but an expected call that'll change everything...Key FeaturesFull Modding Support\nComplex inventory system\nFlexible Dialogue system\n18 different and unique weapons\nTerrifying atmosphere and soundtracks\nMultiple endings and 12 achievements\nDrivable Vehicle(s)\nCross-platform support","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bernt Andreas Eide","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":6588,"name":"Dynamite Jack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bda/bda4791d55bf16c52ce34db047c0c8ef.jpeg","description":"Dynamite Jack must blast his way to freedom!  Jack, a brave space marine, armed with only bombs and a flashlight, must escape the Anathema Mines!  Use stealth to sneak past guards and bombs to obliterate enemies in this intense top-down action-adventure.Key Feature:28 Thrilling Levels Each level brings you closer to the surface of the Anathema Mines. Battle your way through guards, scientists, cave trolls, lasers, and robotic spiders!\nMap Editor Have you destroyed and crushed the game?  It's time to make MORE GAME!  The super simple level editor will empower you to create levels in just minutes!  You can share them with your friends and the world!\nPlay More Maps Ready for more?  Every map that is shared will be available for you to play!  Skim through the most popular levels and have a blast escaping all the user created maps.\nSpeedrun Leaderboards Each level in the game has its own speedrun leaderboard for competing with your friends and everyone else!  Each community created map also gets its own leaderboard, so you can compete with your friends on the map you just created!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hassey Enterprises","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":1425,"name":"ROCKETSROCKETSROCKETS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/494/494db33158a149ea0ac90b3bf9088a37.jpg","description":"ROCKETSROCKETSROCKETS is a game where you fly ROCKETS that rocket ROCKETS at other ROCKETS! The ultimate rush of arcade arena action, with the fluidity and amazing feel of soaring through space.SHOW ME THE FEATURES ROCKETS.  We feature only the finest interstellar vehicles.\nLOCAL VERSUS MULTIPLAYER.  Get your fellow rocketeers together, we're going to BLOW THINGS UP!\nUNDERDOG MODE. A flock of rockets versus the lone rebel. Amongst all the friendly fire, will you rocket to the top?\nTEAM PLAY. Every rocket needs a partner!\nSTANLEY. This is a story of a rocket named Stanley.  Meet the AI Rocket that thinks he has free will, and meet the rockets he will relentlessly fire at your rocket.\nCOOL LIGHT TRAILS. These are some classy rockets that are a lot of fun to fly.\nALL THE CONTROLLERS. In addition to full keyboard support, we currently support dozens of different controllers, and are always adding more!\nMAKE IT YOUR OWN. We've got a glorious settings menu where you can turn on different game modes, tweak weapon behaviours, alter gravity, and even adjust sprite sizes!\nMODDING. Dig into our data files and edit yourself up a new game mode!\nReally, though, the game is about intimacy. Check out Zen mode, it's wonderful with a loved-one!DELUXE PACK\nThe deluxe pack includes the full game, the soundtrack, and two exclusive bonus MP3s!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Radial Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":398402,"name":"Godfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cbe/cbe1fc409c01b14365d13937d3490aa0.jpg","description":"Godfall is a brand new, next-gen looter-slasher, set in a bright fantasy universe filled with heroic knights and arcane magic. Godfall is a fantasy action RPG that utilizes high-impact third-person melee combat to engage players as they hunt for loot, don legendary armor sets, and defeat vicious enemies. As players face challenging missions in the world of Godfall, enemies and bosses will reward fans with head-turning loot as they are vanquished. Godfall can be played entirely in solo, duo or three-player coop, providing fun for all.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Counterplay Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":38482,"name":"Syndicate (2012)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fa/0fa2ea78b337afaa4b216bc368d9312c.jpg","description":"Business is war in Syndicate, where you are the latest chip-enhanced prototype agent for the largest mega-corporation in the world, in an all-out war to control the American marketplace.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":22918,"name":"Deathtrap Dungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/91b/91bd28ff21189e0b8a838d1412a392c1.jpg","description":"Hear ye, hear ye! The Honorable Baron Sukumvit has offered a prize worth 10,000 gold pieces to the first to survive his dungeon. As an added bonus the Baron has agreed to graciously step down from his position of absolute power and leave the town of Fang to rule itself as it sees fit. Many have attempted “The Walk”, as it has come to be known but for some odd reason not a single one has emerged victorious. Who amongst you shall attempt The Walk? Who will be the hero or heroine that survives the Deathtrap Dungeon?\nDive headfirst into the macabre and devilish labyrinth of Deathtrap Dungeon. Fight for your life against a bewildering rogue’s gallery of fiends and foes ranging from fire-belching dragons to insidious serpent women. Take up and master a cornucopia of weapons ranging from swords and warhammers to blunderbusses and infernal devices, just to name a few. Based on the multi-million selling Fighting Fantasy book series by Ian Livingstone, Deathtrap Dungeon is the ultimate dungeon hack and slasher!\nFight against 50+ monsters ranging from fire-breathing dragons and exploding pigs to demonic dungeon dwellers and the undead!\nGive it everything you got as you master a variety of weapons including swords , hammers, muskets, flamethrowers, magic spells, and your own bloodied fists!\nPlay as either the heroic Bandog or the deadly and sexy heroine Red Lotus.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Branching Narrative","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":20813,"name":"BloodRayne Betrayal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7da/7daa833a17d881e2802acb742b3c239c.jpg","description":"The original video game femme fatale, Rayne, has returned to battle and feed in a brand new hack ‘n slash adventure. Slay ghastly enemies as Rayne, the sexy dhampir with superhuman strength, speed, and agility, recruited by the vampire hunting Brimstone Society for one last mission. The target is a lavish, yet sinister ball in a secluded castle with plenty of dark and gruesome surprises. With the help of a mysterious friend, and members of Brimstone, Rayne must infiltrate the manor, take out the fiendish horde, and stop an evil master plot once and for all.\nKill evil vampire scum in 15 challenging levels across multiple unique acts, including: The Forest, The Attic and The Freaky Ballroom.Meet new characters along the way including a mysterious shape shifter.Feed on enemies and refuel your blood reserves in gruesome new ways including the Blood Fountain.Solve environmental puzzles including Blood Seal, Grinder Switch and Rising Blood Tower.Punishing combat skills deliver Rayne’s intense brutal fatalities:\nInfection: Enemy vampires bloat and explode when triggered.\nHeel Stomp: Instant-kill enemies after laying them out.\nDrain: Bite and drain your enemy’s blood to restore your health.Full arsenal of lethal weapons including Rayne’s signature arm blades and super guns.Battle a variety of new enemies and deadly bosses including Flying Parasites, Blood Balloons, Elite Guards and more!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":19555,"name":"Peggle Nights","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/11a/11aeaf98b9482c86847a78810ef3d03d.jpg","description":"The sun has set at the Peggle Institute, but the bouncy delight has just begun! Join the Peggle Masters on a dreamtime adventure of alter egos and peg-tastic action. Stay up late to aim, shoot and clear orange pegs, and bask in Extreme Fever glory under the silver moon. Then, put your Peggle skills to the ultimate test in Challenge mode. If you can master all that fevered action, play to your heart's content with Duel mode and Quick Play. Plus, you can stock your Trophy Room and revel in clickable replays for even more rebounding joy!\nExplore all 60 levels in Adventure mode\nMeet a new Peggle Master and learn a new Magic Power\nTest your skills in 60 challenges\nUnlock Duel mode to compete against friends and the computer\nCelebrate your Peggle prowess with clickable replays and a Trophy Room!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"PopCap Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19547,"name":"Valdis Story: Abyssal City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/948/9486fa003f3ed8dd470f20532d35d492.jpg","description":"Assume the role of Wyatt in this Action/Exploration Platformer as you explore the ruins of a holy city that was lost many years ago. Battle various types of demons, angels, and a new threat known only as the “Ferals”, using swordsmanship, martial arts, and sorcery. There are many customizable skills and equipment that will aid Wyatt on his journey.STORY:Over 40 years ago, the goddess Valdis was killed by her daughter, the dark goddess Myrgato. Since this event Myrgato has been at war with her twin sister, Alagath the goddess of light. This perpetual war is fueled by human souls that the gods use to create their warriors; Myrgato twisting souls into demons, and Alagath manipulating souls to create angels. Each day the remaining human population dwindles as they are forced to choose a side or die.FEATURES:Intense combat weaving sword and sorcery together seamlessly.\nFind magic souls that aid in combat and traversing the ruins of the city.\nLevel up stats and a variety skills to customize your play style.\nUpgrade Weapons and Armor.\nUnique accessories that can give you the edge in combat, or get you killed!\nInterconnected zones allow you to explore new areas or backtrack.\n2 playable characters on release and more to come!\nCompelling original soundtrack spanning over 2 hours of music!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Endlessfluff Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19351,"name":"Hospital Tycoon","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccb/ccbfd7a19b5e7c7dc5d3cf882ce28f99.jpg","description":"Develop your own hospital drama and manipulate the results to your best advantage! In charge of a rapidly expanding hospital, your job is to cure the patients with your army of doctors and nurses while successfully managing the facilities and taking care of everyone's needs.\nRun the hospital and you influence the outcome in this funny, highly accessible and involving game featuring character relationships, staff management, hilarious diseases and cures and more. Featuring gameplay that's as personable as you want it, Hospital Tycoon has engaging locations, missions and characters galore!\nHospital Tycoon is easy to start, impossible to put down. It's time to start operating!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Deep Red","platforms":[{"id":0,"name":"PC"}]},{"id":14012,"name":"Disciples III - Renaissance","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8e6/8e618ab8d85b249cb0415f0d372ccf00.jpg","description":"Steam Exclusive OfferThis Steam Special Edition includes three exclusive maps and Steam Achievements\nThree Steam-Exclusive additional maps for single player and hot seat mode: The Fall of Londeron, Secret Knowledge, Borderlands\nOver 50 Steam Achievements to unlock\n\nAbout the GameDisciples III: Renaissance is the next title in the award-winning Disciples series and represents a leap forward in the evolution of the turn-based strategy RPG genre.  Building on the overwhelming successes of the first two games, Disciples III: Renaissance introduces a host of new features as well as the compelling gameplay that made the previous titles so popular.\nThree playable races - the Empire, the Legions of the Damned and the Elven Alliance fight for control of the fantasy world of Nevendar. Each race features unique skills and styles.\nBeautiful 3D graphics – a new gameplay engine offers lush 3D worlds, a rarity in the tactical turn-based strategy genre.\nBecome a hero – create a custom hero and lead a party into battle with a huge variety of creatures. Equip your hero from a selection of more than 450 weapons, spells and artifacts.\nUnique characters and classes – recruit party members to aid you in battle. Paladins, Mages, Healers and more feature distinct and visually stunning spells and powers.\nA vast world to explore -19 missions spread across three campaigns take place in a vast fantasy world rendered in stunning detail.\nExtensive single-player gameplay – over 70 hours of campaign play across 19 missions.\nLocal multi-player gameplay","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Akella","platforms":[{"id":0,"name":"PC"}]},{"id":20312,"name":"Dwarfs - F2P","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a92/a92df8e75c137c312af73077ed90184f.jpg","description":"This is the Free-2-Play version of Dwarfs!? You can download the game and play the core game in Arcade mode, plus all the Tutorials and the Challenge modes completely free, forever. No charges, no subscriptions - just free. If you like those modes and want more, you can either pick the modes that you feel like playing and buy those individually - or just buy the whole pack to unlock everything.\nDwarfs!? offers an addictive, fast paced arcade-like experience, with plenty of difficulty levels and game modes to play, in the tradition of great games such as “Lemmings” and “Dwarf Fortress”. As the new overseer for your underground Dwarf base, your job is to manage the small colony and make it as rich as possible, before they meet their inevitable doom! To survive as long as possible, you’ll have to steer and guide your greedy little fellows to the richest points in the caves, while avoiding all the dangers – so they don’t end up destroying your Town Hall and its essential supply of beer. They explore for you, they mine for you and they fight for you - but if you don't keep an eye on them, they'll do what they do best: die for you and take everyone else with them. But, if all else fails when the Spider Queen comes for you – use the Outpost’s Dwarf Cannon and shoot Dwarfs at her!\nThere are only 3 certainties in this world: death, taxes and that Dwarfs always dig too deep!Key features:Fun for all ages and skill levels of gamers, with randomly-generated caves so the game is different every time.\nMadly Addictive Arcade Mode: 4 difficulty levels ranging from casual to crazy hard-core, time limits from 5 minutes to endless, randomly-generated caves and all the gold and monsters you can handle!\nBase Defense Mode: Tower Defense gameplay, except you don’t have a tower. And your Dwarfs dig the routes. Then you defend against waves of monsters!\nRush Mode: Can you handle Dwarfs spawning at insane rates and digging everywhere?\nDark Mode: This time, the only light is in the tunnels your Dwarfs dig. Spooky!\nCampaign Challenges: Tutorials where you can learn all about being a Dwarf Overseer in a few minutes and Challenges where you can put those Overseer abilities to the ultimate test.\nLeaderboards: Compare the size of your beard (and your scores) with your friends and the rest of the world.\nSandbox Mode: Create your own caves!\nCodex: Alongside the integrated help system is the Codex – the fount of all Dwarf knowledge! Contains everything you need to know, including video tutorials for the budding Overseer.\nMedals and Achievements: Lots and lots of shiny stuff to collect and show off to your friends!\nFully Integrated with Steamworks™\nAnd Zombies. Not to mention goblins, skeletons, spiders, dark elves and more.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Power of 2","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12772,"name":"Project Starship","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/405/405b2e8b8ee872949f161e27f531d368.jpg","description":"Project Starship is an arcade bullet-hell with random mechanics. No match will ever be the same. Who will you be? Garret or Gwen? Will you save the world from the mighty cthulhu?\nGuide your hero trough storms of bullets, challenge demons and gods, in an epic and adrenalinich fight with the unknown, where everything is obscure and arcane. Go Deeper, find the hidden eye that everything watch.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EastAsiaSoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":614961,"name":"Planet of Lana","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c61/c61a8959e0cb3cdcb2bd52a2f3aa0c2c.jpg","description":"A planet that used to be a place of undisturbed balance between human, nature and animal has now become something else entirely. The disharmony that had been in the making for hundreds of years has finally arrived in the form of a faceless army. But this is not a story about war. This is a story about a vibrant, beautiful planet –and the journey to keep it that way.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Wishfully","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":514899,"name":"BloodRayne: Terminal Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7bc/7bc71a03ca2351d7872ad37d29613718.jpg","description":"Enhanced and updated for modern systems by the game's original developers, this is the definitive edition of BloodRayne.\nIn the years between the World Wars, Agent BloodRayne works as a killing machine for The Brimstone Society – a top secret fraternity that hunts down and destroys supernatural threats. Two missions, five years apart, turn out to be connected by one man. For years, this man has been searching the world for powerful occult relics to bring about a new age of domination for the Third Reich. In this frenetic and bloody third-person shooter that unleashed the iconic red-headed femme fatale on the world, the dhampir Rayne faces horrific creatures, hordes of soldiers with an array of tools and firepower, and every Nazi officer that stands between her and the one she must stop.\nFeatures and enhancements of the Terminal Cut edition, created by the game’s original development team:\nSupport for higher display resolutions (up to 4K / 3840x2160).\nUpscaled cinematic videos\nSupport for modern gamepads (XInput)\nImproved rendering with up to 4x anti-aliasing\nSupport for higher texture resolutions, allowing for use of uncompressed original textures\nImprovements to effects such as reflections, water, fog, and shadows","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Terminal Reality","platforms":[{"id":0,"name":"PC"}]},{"id":21820,"name":"Grave Prosperity: Redux- part 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afa/afa6cf550b6220f07ebc9ea3e9f18ea0.jpg","description":"Grave Prosperity: Redux follows Amber Ridge as she finds herself broken down on a mountain road. Without any reception and no signs of passers-by, she is forced to walk to the nearest town- Prosperity. A place that knows no God and exists only to make you suffer. Utilize a deadly arsenal of agility, blade-work and gun-play to fend off the darkness that stalks your every movement. Collect EXP through solving puzzles and slaying grotesque creatures in order to upgrade your stats to better suit you survival needs.\n** This game is no longer under development, and no longer for distribution by its creator. The patch that was being worked on for this title has been made into another game entirely called \"City of Amber.\" Progress on its development can be found here: https://www.facebook.com/City-of-Amber-108073936245507/ **","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"LDC Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2138,"name":"The Warlock of Firetop Mountain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7c/b7c6fc606964eb21b79ca4de1eb7705c.jpeg","description":"The Warlock of Firetop Mountain is a tabletop adventure come to life! This fantasy solo RPG combines unique, simultaneous turn-based combat with a journey that changes based on each figurine you take into Firetop Mountain! Which hero will you take into Zagor's lair THIS time?\nThe original 1982 Fighting Fantasy gamebook paperback, written by Ian Livingstone and Steve Jackson, has been transformed into an epic table-top adventure game, with new areas to explore, characters to meet, and of course, monsters to slay! Zagor's home assembles right before your eyes as you travel deep into the belly of the mountain.\nEach character has their own motivations for being in Firetop Mountain, changing the way the gamebook is written and choices presented. Combat is fought using the digital miniatures in a simultaneous, turn-based system called GridBluff, and the game includes over 100 unique hero and monster figurines to discover.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tin Man Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1767,"name":"bit Dungeon II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c54/c547e8370d8b613b7cbd3c12c1c734c6.jpeg","description":"bit Dungeon II is fast action-adventure game with a giant overworld to explore.\nYou are a spirit in an undead world of demons. Your \"loved one's \" grave has been desecrated. Fight through these corrupted lands, and bring peace to her soul.\nThe dungeons are randomly placed in the overworld, changing your experience each play through.\nFeatures:\nPermadeath You get one soul, and only once chance to retrieve it when you die.\nSteam Play Support.\nEach weapon type has a unique power attack including ranged, and magic weapons.\nLevel up based on which weapon you use.\nRandomly generated items.\nGiant difficult dungeon bosses.\nEnemies with disgusting faces.\nOriginal Chip Bit music by Stress_tn.\nController Support.\nOnce you beat the game it starts over, play forever, become stronger then... a god.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kinto Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":377825,"name":"Midnight Protocol","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c96/c96a66704e12bf057ce8627229bb3f3f.jpg","description":"Hack into servers, beat security and steal encrypted data in a world where your identity is just another network address. An engaging story, agonizing dilemmas, and an easily accessible hacking system turn every player into a network hacker in Midnight Protocol.\nMidnight Protocol is a tactical narrative-driven RPG set in a near future filled with labor automation, big data, controversial AI applications, legal gray zones, and the nebulous nature of online identity. You assume the mantle of a prominent hacktivist who has been targeted for blackmail by a shadowy branch of government.\nThe player interacts with their virtual environment through text commands, hacking into countless challenging networks. Character development and roleplay choices made during and in between missions affect the storyline and outcome of the game.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"LuGus Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20982,"name":"Puzzle Pirates","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8b/a8b6cf2df28afbe6b3ebb6371f095c6d.jpg","description":"Brace yourself for swashbuckling puzzle action as you pillage your way to glory across the briny deep!\nCreate and customize a pirate, collect booty, and join a player-run crew of cutthroats! Every activity in Puzzle Pirates is a uniquely fun puzzle: be it sailing, gunning, or hauling treasure, your own puzzling skill determines your success!\nKey features\t\t\t\t\t\t\t\tCo-operative Piracy: Sail the seas with your friends and pillage brigands and merchants aboard your very own pirate ship!\nA Plethora of Puzzles: Play more than 20 puzzles and mini-games, representing various piratey exploits, such as Swordfighting and Sailing!\nSail to Adventure!: Explore a living world filled with thousands of other players! Hunt dangerous Sea Monsters and voyage to lost treasure-filled realms, such as the Haunted Seas!\nBooty!: Customize your pirate with a bounty of different clothing items and equipment!\nPlayer-Run Economy: Run your own shop and produce weapons, ships and other goods for sale. Band crews together under a mighty “Pirate Flag” and become governor of a pirate haven.\nFree to Play!: Puzzle Pirates is free to play, no subscription is required to enjoy everything the game has to offer!\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Three Rings","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3512,"name":"Get Off My Lawn!","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f2/9f2529240563a26709da21cd4aba0045.jpg","description":"First contact didn't go as planned, when aliens woke Murray Mendelson up from his afternoon nap. Pulling the trigger first has drawn Murray in to full scale war with these alien visitors, and they’ll stop at nothing to destroy him. Armed with his musket and inconsolable rage, Murray must defend his home against all odds. Why are the aliens only attacking this one house? Who knows?! Shoot first and ask questions later in this endless fast paced arcade shooter, and keep those pesky aliens off of Murray's perfectly manicured lawn!\nCollect valuable alien orbs to upgrade your weaponry. Use ‘Cane Time’, ‘Infuriate’, and ‘Soundwave’ power-ups to gain the upper hand when all seems lost. The longer Murray holds the lawn, the stronger those aliens get. But there is plenty of firepower waiting for you to try out in The Shed.\nSo, lock and load…and Get Off My Lawn!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Leisure","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":651,"name":"Fieldrunners","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b6/9b6d16e551f5c599f9792a45756973d4.jpg","description":"Fieldrunners is now available on Steam!  Download it now to play the hit tower defense game critics and fans have been raving about.\nDescend into the world of Fieldrunners, the most anticipated and visually stunning game in tower defense history! Defend and control the field using a diverse selection of upgradeable towers in a limitless adventure, using a wide array of tactics and strategies against countless waves of unique land and air combatants! Hours of entertainment and replayable challenges! Do you have what it takes to dominate the Fieldrunners and rise to the top as the ultimate Tower Defense master?  Find out now!\nKey Features:\nIncludes all 8 original maps, each with unique challenges and environments!\n10 devastating weapons to stop your enemies with style!\nBeautiful, hand painted artwork!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SUBATOMIC STUDIOS","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":56222,"name":"Super Smash Bros. Melee","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b78/b780abf866cba1422d01bfa75612dd29.jpg","description":"Super Smash Bros. Melee is a crossover fighting video game developed by HAL Laboratory and published by Nintendo for the GameCube video game console. It is the second game in the Super Smash Bros. series, following the 1999 release of the original game. It was released in Japan and North America in 2001, and in Europe and Australia in 2002.\nThe game features characters from Nintendo video game franchises such as Mario, The Legend of Zelda, Star Fox, and Pokémon. The stages and gameplay modes make references to, or take their designs from these franchises as well. Melee includes all playable characters from the first game in the series on the Nintendo 64 and also adds characters from franchises such as Fire Emblem, of which no games had been released outside Japan at the time. Melee's gameplay system offers an unorthodox approach to the fighting game genre with a counter that measures damage with increasing percentages, rather than a depleting health bar seen in most fighting games. It builds on the first game by adding new gameplay features and playable characters. Following the popularity of its multiplayer gameplay, Melee has been featured in many competitive gaming tournaments, and is one of the most popular fighting games for competitive play.\nThe game received critical praise, as well as awards and acknowledgements from gaming publications. It achieved strong sales upon release, and is the GameCube's best-selling game, with more than 7 million copies sold by March 2008. It is considered to be one of the best video games of all time.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"HAL Laboratory","platforms":[{"id":0,"name":"GameCube"}]},{"id":17535,"name":"Kairo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd8/cd814fac5465c54ff97b8e159592ba7e.jpg","description":"Enter the lost world of Kairo. Explore vast abandoned monuments. Bring strange and ancient machinery back to life. Slowly uncover the true purpose of Kairo and fulfil a great destiny.\nKairo is an atmospheric 3D exploration and puzzle solving game. Developed by Richard Perrin the creator of the white chamber with music by Wounds (Bartosz Szturgiewicz).Key Features\nExploration - Travel through a strange world full of abstract architecture. Each room is unique so there's always something new to find.\nPuzzle Solving - Repair ancient forgotten machinery to slowly bring the world back to life.\nEnviromental Storytelling - Exposition without the traditional dialogue or text. The story of Kairo is told through the world itself. The things you find will slowly help you unravel the true purpose of this mysterious land.\nAtmospheric Soundtrack - The music helps shape the land and will fill you with an equal measure of wonder and dread.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Locked Door Puzzle","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4267,"name":"F1 2012","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/550/550843ff09e61825bfc5cda211e4489b.jpg","description":"Codemasters Racing presents F1 2012, the next game in the BAFTA-winning series featuring all the official drivers, teams and circuits from the 2012 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Learn the basics and master the challenge of driving the best machines on the planet in the Young Driver Test.\nExperience the next generation in weather system technology where storm fronts move across the circuits, soaking specific areas of the track, as well as racing around the all-new Circuit of The Americas in Austin, Texas, home of the 2012 FORMULA 1 UNITED STATES GRAND PRIX. Two new quick fire game options: Season Challenge, a complete Career in just 10 races, and Champions Mode Scenarios, where you test your skills against the very best, complete an exciting line up of gaming options which also includes a 5 year Career, Co-op Championship, 16 Player Multiplayer & Time Attack Scenarios. F1 2012 Feel it!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":709179,"name":"The Witcher Goodies Collection","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Note: If you already claimed The Witcher Goodies Collection at some point in the past, you should still check your library – new content will be added there automatically!\nWe have a real treat for all gamers - The Witcher Goodies Collection available for free.\nIt includes arts, books, soundtracks, the making of videos, Video Game Show concert, wallpapers, and many more goodies from all The Witcher games gathered together.\nClaim this unique giveaway before it ends on January 5th, at 2 PM UTC.\nTo download the goodies, proceed to your Library on GOG.com.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PC"}]},{"id":11248,"name":"The Mooseman","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ba/5ba70c842aaf82176ff47618f776a498.jpg","description":"Welcome to the mysterious world of ancient myth, based on finno-ugric culture of bygone pagan times.\nLong-long time ago the world was created out of an egg-shell by a god named Yen. In the murky depths of the endless ocean the Lower World was born. The Middle World was made for the men to dwell, and the Upper World was were the ancient gods would reside. Multitudes of spirits dwell among the layers of creation, guarding their secrets in the dark. Embark on a journey through all the worlds of ancient myth, find artefacts of Chud' tribes and solve all the mysteries of finno-ugric tales.\nYou are the Mooseman and you have the ability to see all that is hidden to the mortal eye. You are about to visit three layers of this universe - the first one is the Lower World where the spirits of the dead reside.\nExplore the worlds inspired by Perm animal style\nDive into the deep atmosphere of folk Komi music\nMeet long forgotten gods and spirits\nLearn the ancient myths of finno-ugric tribes\nDon't expect an easy journey, there are riddles in the dark\nUnlock new abilities and use them to get to the Upper World\nFind all the artefacts that are hidden from the mortal eye","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sometimes You","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":22161,"name":"Stoneshard","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eaf/eaff196eb6c84bfab34c93e7f6f702ac.jpg","description":"Stoneshard is a turn-based RPG that presents classic roguelike gameplay in a new way, welcoming for both newcomers and veterans alike.\nYou start out as an ordinary mercenary. Mighty forces have clashed over your once prosperous homeland, now ravaged by war, feud and famine. The Grand Magistrate is about to fall, when mysterious stranger makes you an offer you can’t refuse. Travel across the lands as a leader of the Caravan of Companions, as you gather followers for your cause. Along your path not only will you face hundreds of enemies, but also struggle with hunger, fear and pain - as well as internal conflicts within your company.\nTravel across the lands of AldorExplore procedurally-generated lands and cities, liberate villages, plunder caverns and dungeons for fame and loot.\nLead the CaravanFind new allies and persuade them to join you as you build up the Caravan of Companions. Keep the morale high enough to avoid quarrels, and remember - each follower has his own goals, views and traits.\nBecome a true warriorAs you progress, your character will develop attributes, learn helpful skills and obtain traits and talents. Build a hero in a unique way that matches your playstyle!\nSurvive the overwhelming oddsGetting cut in half by a skeleton’s broadsword or having a ghoul rip your throat out are just a few among many ways to die in StoneShard - struggle with hunger, thirst, injuries, fear, insanity and various maladies.\nFend off invadersTry out the vast arsenal of weapons, equipment and enhancing potions. Take part in a fair, face-to-face combat, hunt down your prey using stealth, or cast mystical spells to vanquish those who stand in your path.\nPray for victoryMaintain balance between several rival deities or choose a single patron - and receive astonishing power for a terrifying price.\nDie… to fight another dayThe player character only has one life, but his death won’t mean the end of the game - continue your journey with another hero as a leader of the Caravan, keeping part of your progress.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ink Stains Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20481,"name":"GabeN: The Final Decision","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34d/34da50ced9db1d3c1f1a4b5650d6b3b2.jpg","description":"It's finally time... In the Year 2096, Gabe Newell has finally decided to release his Triple Steam Summer Sale! This sale includes 3 new Valve-made games people have been waiting for for years! Half-Life 3, Portal 3, and Team Fortress 3! When Gabe Newell, also known as Gaben goes to eat lunch, he mysteriously finds his computers sabotaged, and orders a meeting to take place where all Valve Employees must come and investigate the situation. As he is about to leave, his long time co-worker and friend Mike Johnson reveals he saw Robin Walker sneak into Gaben's office and sabotage the games. Although Robin denies it, Mike shows proof of it happening, and Robin finally admits to it... Play as Gabe Newell in his adventure to reveal why his games were destroyed, and reveal a shocking story where Gaben will have to make his final decision... Before it's too late...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alex Zhang","platforms":[{"id":0,"name":"PC"}]}]