[{"id":14279,"name":"Warriors of Vilvatikta","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a0d/a0d152202b3dd80df897dc8563a25f33.jpg","description":"Warriors of Vilvatikta is an epic RPG inspired by real Indonesian history.About the gameThe Kingdom of Singhasari was previously a small kingdom centred in east Java. It has now risen to be a great empire, led by an ambitious king named Kertanegara. His dream is to unite the whole archipelago of Nusantara.\nKamandanu a humble blacksmith, who provides weapons for the king Kertanegara's empire is cast out by his family. Disgraced and alone, Kamandanu embarks on a journey to find and train with his uncle.Warriors of Vilvatikta - Features: Time-proven, traditional turn based battle system.\nAt least 20 Hours of Gameplay.\nTravel across the beautiful, vibrant and detailed world of Vivatikta.\nEmbark on an epic quest inspired directly by Indonesian history.\nMini Games - complete mini games to unlock secret skills.\nAn all new animated Menu System.\nCustom Abilities and strategic battles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RPG Video","platforms":[{"id":0,"name":"PC"}]},{"id":13192,"name":"Upside Down","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23e/23e0152056599606c32dcaa16b65fc16.jpg","description":"Upside Down will immerse you in an incredible adventure. Sharpen your reflexes for this fast-paced, precise puzzle-platformer. As a scarecrow armed only with your sharp wit, you will have to face deadly traps and dangerous wildlife to reach your goal. Each level is distinctive and exotic.\nFigure out genuine puzzles and take the right path toward your salvation.\nFeatures:\n- Unique levels\n- Challenging puzzles\n- Interesting obstacles and game mechanics\n- Beautiful graphics and animations","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":60618,"name":"Unruly Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab3/ab372c44f5118477fd5230827f208339.jpg","description":"Inspired by the timeless 16th century Chinese novel Journey to the West, players take control of four unlikely heroes.\r\n\r\nEffortlessly swapping between and Wukong the Monkey King, Sanzang the Sleepy Monk, Kihong the Greedy Pig, Sandmonk the Sensitive Brute as they travel westward in search of the scattered remnants of the Sacred Scroll.\r\n\r\nAlong the way, whether it be solo or in local coop, players will encounter a diverse lineup of enemies to battle within a colourful fantasy world.\r\nWill you be brave as you face the terrible challenges that lie ahead ?Features An adventure in solo or in coop up to 4 players.\r\nDiscover or rediscover the universe of the Monkey King legend.\r\nChoose one of the 4 heroes, join their strength and switch between the characters depending on the situation.\r\nUnforgettable combats against different kind of enemies and frightening bosses.\r\nPuzzles, platforming and unexpected challenges.\r\nEmbody some enemies and possess their power.\r\nExplore a colorful and fantasy universe through different worlds.\r\nHigh-quality visuals, animations and audio.\r\nFight against your friends in PVP modes in local or online for more fun!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Magic Design Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":23668,"name":"DEEP SPACE WAIFU","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b23/b235b79fbddefb5f569edab5c9254b56.jpg","description":"Our new intergalactic dating app will find you the perfect match! It's up to you save those poor girls from the alien clothing threat!\nKing bear has the strange hobby of swapping girls in the phone until he gets the PERFECT WAIFU! But have the lucky of kicking some aliens in his dates!\n- ONE HAND MODE !\n- 69 ACHIEVEMENTS\n- 60 PIECES OF CLOTHING TO DESTROY!\n- 35 MILESTONES TO THE PERFECT SCORE!\n- 10 CARDS\n- 13 GIRLS WITH A UNIQUE \"PERSONALITY\"\n- 6 BOSS FIGHTS\n- 1 BAD BEAR!\nALSO, CHECK OUR FORUM FOR ( ͡° ͜ʖ ͡°)\nHave a nice day SPACE COWBOY!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Neko Climax Studios","platforms":[{"id":0,"name":"PC"}]},{"id":22957,"name":"SiN Gold","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bf1/bf12d7380934fc8ca5c3b1b5f17e1556.jpg","description":"When the CEO of SinTEK Industries begins injecting the streets with a DNA-altering drug, it's time to reassess the laws of morality. When the same twisted biochemist plans to conquer the world with her army of mutated abominations, it's time to rewrite the golden rule.\nYou are Colonel John Blade, head of the most prominent private protection agency in Freeport. Elexis Sinclaire is waging her holy war against the security industry...and you along with it. You've made a religion out of fighting crime. Now you're going to make Elexis pay for her sins.Includes the original SiN and the SiN: Wages of Sin mission pack.\nExplore different puzzles and new routes each time you play!\nHack the system! Access computer terminals, control security cameras, and wreak havoc!\nEncounter new dangers and intelligent beings in every mission as you fight your way to the ultimate showdown!","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Ritual Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16406,"name":"Amerzone: The Explorer’s Legacy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecd/ecd99a4560b5c56bbe72aa6c721d81ad.jpg","description":"From the creator of the Syberia series, experience Benoit Sokal's first adventure game masterpiece.\nIn 1932, Alexandre Valembois was a young explorer who, with his native friend Antonio Álvarez, wanted to make a name for himself by exploring the mysterious Amerzone region. Befriended by the natives of the region, he witnessed a strange ritual involving a giant egg of the famed white birds. Wanting to prove that the white birds existed, Alexandre betrayed the natives' trust and stole the mysterious egg. Alas, upon his returning to France, nobody believed Alexandre or his journals about the Amerzone.\nSixty years have passed, and the world has changed. World War II has come and gone, the Amerzone remains unexplored and closed off to outsiders by its despotic leader, Antonio Álvarez. Monsieur Alexandre Valembois is an old man at the end of his life, living alone in a lighthouse and wishing to fix his mistake. This is when, a young reporter pays a visit to the old Alexandre Valembois regarding his adventures...\nCan you unravel the mystery of the white birds?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microids","platforms":[{"id":0,"name":"PC"}]},{"id":3535,"name":"Escape Goat 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c1/4c1cb4a9abe7d5dd83288f277ff761b6.jpg","description":"\"The game’s flow from challenge to discovery is a masterwork for the genre ...\" - Ars Technica\nEscape Goat 2 is a puzzle platformer game where you use machinery, the environment, and a friendly mouse to progress through a dungeon.\nOverview: None have overcome the Stronghold of Toragos... will you be the first goat to do so? Escape Goat 2 is the follow-up to the critically-acclaimed 2011 indie game, featuring more than double the content: larger rooms, HD graphics, dynamic lighting, and a host of devilish new traps.\nPick your path through the massive Stronghold, divided into ten unique zones. Worry not, brave Goat, for you have a friend on this mission: Your immortal mouse familiar can crawl to otherwise unreachable areas, to hit switches and distract enemies. Use your wits, reason, reflexes and courage to overcome each room, and save your friends from an eternal slumber...\nOver 100 rooms of puzzles, traps, and sheeply lore\nWith destructible and movable walls, the rooms take on many forms as you manipulate hidden machinery to reach the exit\nFully hand-drawn, hi-def art and animation, brought to life with a custom lighting engine\nEpic 90's Redbook Audio soundtrack, featuring guest track by Disasterpeace (composer, FEZ)\nListen to the soundtrack!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MagicalTimeBean","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1727,"name":"Clash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/997/997d84f6c97f351efc888cc8b6ca6f28.jpg","description":"Earth is in the grips of a bitter cold war - nuclear armaments are armed and ready to fire should either East or West make a move. World leaders look to the skies for answers, and in a manner of speaking, an answer is found. An impossible mineral, a compound of elements that fits not into our understanding of the universe, has been discovered in the deepest reaches of space.\nThis impossible mineral begins to revolutionize technology - first being developed into weapons in order to control the spaces in which the compound can be found. But neither side wants to see the other gain control over supply.\nA distant solar-system. A fight for the survival of billions. That is where you come in.\n\"Clash is a hard-core action/rpg arena blend. With a wide variety of skills to mix and match that inspires creativity and unique styles, Clash lives up to its goal as an action game for the brainy. Play multiplayer with friends or compete in the single-player league by making your way up the leader-board.\"","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Ultima Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":667657,"name":"Kirby and the Forgotten Land","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/42a/42a71f0cbe23185f778c10462faa12d8.jpg","description":"Take control of the powerful pink puffball, Kirby, and move around freely in 3D stages as you discover a mysterious world with abandoned structures from a past civilization—like a shopping mall?! Copy enemies’ abilities like Sword and Ice and use them to attack and explore your surroundings! What journey awaits Kirby? Take a deep breath and get ready for an unforgettable adventure!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":484894,"name":"Ninja Kiwi Archive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/129/129cbcc6b62254efe97961f020fbf6e0.jpg","description":"Ninja Kiwi Archive collects some of the best-loved Flash games from the Ninja Kiwi website in one amazing archival package. Enjoy your favorite Ninja Kiwi games and discover hidden gems from over 14 years of more awesomer, preserved in their original state even after browsers stop supporting Flash.\nAn awesome collection of 60+ classic web games, stored in a time capsule.\nExperience the forerunners to iconic games like Bloons TD 6.\nPlay the Flash version of popular Steam games like Bloons TD 5, Bloons Monkey City, Bloons TD Battles and SAS: Zombie Assault 4.\nLog in to your Ninja Kiwi account and reclaim your progress and save games from the web.\nEnjoy the best single and multiplayer Flash game experiences!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"PC"}]},{"id":375291,"name":"Narcos: Rise of the Cartels","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b48/b4857a39ad8aa61885e62230e4e82edc.jpg","description":"Welcome to Colombia, 1980’s - the fires of El Patrón's empire have been lit, its influence spanning borders, and expansion unabated. Influence and corruption is rife; cops, guards, politicians and those in between are falling into the pocket of the Medellín Cartel, and after years of production, America is finally taking notice.\nNarcos: Rise of the Cartels tells the story of the hit Netflix TV series, of the rise and fall of El Patrón. Choose your side and ally with the DEA or conversely side with the Narcos. Explore recognisable locations from the show and take a role in pivotal world-altering events and battles that will define and shift the war on drugs.\nForm your team from a variety of class-specific roles, join leading characters, upgrade your skills and take part in brutal turn-based combat, where your actions will have consequence.\nPlata o Plomo?\nBASED ON THE HIT NETFLIX TV SERIES\nAuthenticity is at the core of the Narcos experience and highly recognisable and iconic characters from the TV show are available to control and play, such as El Mexicano, Murphy, Peña, Primo and more. Every 'leader' character offers unique gameplay abilities and perks to help turn the tide of battle.FAST-PACED STRATEGY COMBAT\nNarcos: Rise of the Cartels takes turn-based strategy combat to a whole new level with units possessing the ability to move individually one after another or multiple times within one turn, meaning the pace always being ramped up. Plan your moves wisely but be cautious as there are always consequences to your actions.EVERY WAR HAS TWO SIDES\nFeaturing two unique campaigns, Narcos: Rise of the Cartels allows you to see the war from both sides. Choose to side with the DEA and fight alongside Steve Murphy to bring down the drug empire, or choose to side with the Narcos in order to help found, grow and expand the empire under the watchful eye of El Patrón.COUNTERACT AND KILL-SHOT\nInnovative gameplay mechanics keep the turn-based genre fresh by allowing you to take third-person control of your units in order to engage enemies directly, giving you the opportunity to deal critical damage at optimum moments.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Kuju","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":254545,"name":"Cuphead: The Delicious Last Course","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/01b/01b85423bbfb5f8bc6bcf29dc0cfd6d9.jpg","description":"In Cuphead: The Delicious Last Course, Cuphead and Mugman are joined by Ms. Chalice for a DLC add-on adventure on a brand new island! With new weapons, new charms, and Ms. Chalice's brand new abilities, take on a new cast of multi-faceted, screen-filling bosses to assist Chef Saltbaker in Cuphead's final challenging quest.\n\nFeaturing Ms. Chalice as a brand new playable character with a modified moveset and new abilities. Once acquired, Ms. Chalice is fully playable through the DLC and the original Cuphead adventure!\nTraverse a brand new Inkwell Isle and wallop the most wacky and monstrous bosses Cuphead has faced yet!\nFind new weapons and charms to aid you in overcoming brand new challenges and setting new records on old bosses!\nHelp Chef Saltbaker on a brand new adventure to uncover the mystery of Legendary Chalice's secret quest!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Studio MDHR","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":40433,"name":"Virtua Tennis 4","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ec/8ecf2f90e684d59cd88096689607e444.jpg","description":"The world’s top stars return – The top players in the world return, joined by some of the most exciting up-and-coming contenders. An all-star line-up of 19 players includes Nadal, Federer, Murray, Sharapova, Wozniacki and Williams.\nTennis stardom awaits – A totally new World Tour sees the VT career mode go 'RPG'. Designed to encourage replay value and with an element of off-court fame, each decision affects a player’s career path meaning no two careers will ever be the same.\nA true online hub for our community – The new online centre will offer the world’s first engaging online tennis experience. Designed using the popular Virtua Fighter 5 technology, the matchmaking system promises more competitive games, and online tournaments will seek to find the ultimate Virtua Tennis champion.\nExperience the drama - A brand new on-court feature making for more dramatic matches. Build up your Match Momentum gauge over the course of a match and revel in your form as your player grows in confidence, allowing them to play shots mere mortals can only dream about.\nPutting the fun back into mini-games – Breaking the mini-game mould to include new weather conditions and put a real focus on multiplayer action, the VT mini-games will give players a real alternative mode to compete in both multiplayer and online.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":30362,"name":"Earth 2150: Lost Souls","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a7/8a798ffff741a580b11e4d49c5512f7f.jpg","description":"Earth 2150: Lost Souls is one of the three sequels to the original Earth 2150 which is a real-time strategy. The title is considered to be standalone; nonetheless, it adds a little to the unique gameplay.\n\n###Gameplay\nThe Lost Souls is a strategy in the war setting. The player can experience the action in 3D, so he may continuously rotate the camera to get the better angle to the actions. There is three military campaign, which can be otherwise presented as a story arcs. The only working tactics through all of the operations are a war of attrition because the other military tricks do not work there.\nThe units have experience gauges, once filled up they grant the player with an extra level increasing all his stats and characteristics.\nThe games of the series are often criticized for the minor adjustments from game to game, so the gameplay part changes a little within the IP. \n\n###Story\nThe first arc called ED tells a story of Сzar Vladimir II thrown forward in time and forced to give commands to attack the Lunar Corporation to get some resources.\nLC campaign's narrative is all about the encountering the enemy's base in Ukraine — the newcomer from the ED mission picks the quest up.\nFinally, UCS campaign centers around Marcus Grodin and locates in Mexico — the goal of Grodin is to climb out of the tunnels and defeat the enemies.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Reality Pump","platforms":[{"id":0,"name":"PC"}]},{"id":29060,"name":"Child of Eden","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db0/db06b4610e9ae8fde66a9b429a9dcc7c.jpg","description":"The Games on Demand version supports  English, French, Italian, German, Spanish.  One of the most anticipated games of 2011 for Kinect.  Winner of 9 awards at E3 for innovative graphics, music, and gameplay.  Child of Eden is the “multi-sensory shooter” that will send players diving into a visual matrix of synchronized music and mind-blowing visuals.  It will usher forth yet another landmark game experience from the mind of renowned game designer Tetsuya Mizuguchi.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Q Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":17611,"name":"Secret of the Magic Crystals","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/663/66383613216b150e4781531abce4562c.jpg","description":"In this game you manage a horse-breeding farm set in a fantasy surrounding.   The game enables you to breed legendary horses such as Pegasus, Unicorn, Fire-steed, Ice-steed and Demon-steed. You can buy over 700 objects during the game. Make all kinds of horseshoes as well as lots of magical potions for your horses. If they are exhausted or ill, you are able to cure and look after them. Your horses and colts need lots of care and that’s the way they recover their strengths. You can train your horses on four different fields in five levels of difficulty. You can even breed them in order to have more talented horses. Different horse races help you to gather 25 kinds of cups and you can send your horses to complete 30 exciting missions.\nReal time weather and season changing.\n5 different buildings and over 5 levels to upgrade your buildings on your farm.\n5 different type of fantasy horses.\nInteractive horse caring.\nOver 700 items to decorate your stable.\nOver 30 kind of magical potions.\nOver 30 kind of magical horseshoes.\n4 training fields to train your horses, 5 difficulty for each.\n25 cups to win on horse races.\n30 quests to find the lost magical crystals.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Artery Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16521,"name":"WORLD END ECONOMiCA episode.01","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba4/ba4af0d15168128bd561e6c44280e62c.jpg","description":"From the author of Spice and Wolf, Isuna Hasekura, comes WORLD END ECONOMiCA. The opening video features music by Kishida Kyoudan & The Akeboshi Rockets, known for the opening songs for High School of the Dead and Strike the Blood.\nA three part visual novel set in the far future on the moon, 16 years after humans have begun to colonize it. A young boy named Haru has been chasing his wildest dream. His dream is to stand where no man has stood before, and in order to do so he needs capital, a ludicrous amount of capital. What better place to get that amount of capital by using the stock market? There are two key rules that govern the stock market.\nThe first rule: Never take a loss.\nThe second rule: Never forget the first.\nOnly those who follow these rules are able to obtain enormous wealth...","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spicy Tails","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15796,"name":"Post Master","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/906/906e0df6738ae7921b78705bab856de6.jpg","description":"Can you take control of a mail distribution company where your business will need to adapt to a growing city? Will you be able to handle the pressure of new delivery opportunities or are other delivery businesses step in to pick up the slack and impact your profit margin.\nIn Excalibur’s Post Master you’ll start out with a single post office, supplying pick-up and delivery services for a small area of the city. To maintain an excellent service you’ll need to hire workers to sort mail, contract security guards to protect your offices from robberies while also purchasing new vehicles to pick up and deliver mail.\nOnce you’ve settled into your first office, you’ll need to look to the future of your company and determine the best plan of action to expand your services. Will you look to provide the best mail distribution system but supply a small area, or are you looking to conquer the city with several offices and a vast fleet of vehicles.\nIn order to maintain your claim on postal services for parts of the city, you’re going to need to remain competitive. With a rival business looking to take a cut of the services there are methods of attack to remain the superior mail distribution business. You can carefully plan your delivery routes to make your average delivery time faster than anyone else, or you could lower the prices of your services to remain the cheapest.Features of Post Master:\nAn ever growing city that changes frequently\nHire staff and purchase personnel\nSet the duties and route of each vehicle\nPurchase objects for your garage and offices\nHire security guards to prevent post office robbery\nInvest in new offices to expand the reach of your services\nAdjust the prices of your services, do you want to charge a fortune or undercut your competitors?Other titles from Excalibur Games","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Excalibur","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15149,"name":"Luna's Wandering Stars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/792/792def19258456f44d98099efd66dfbc.jpg","description":"Take control of the powers of the cosmos. Explore your curiosity of space. Luna's Wandering Stars is a planetary physics puzzler with a full Level Creator/Editor and online level sharing.\nAn action puzzle game that utilizes real physics to present interesting and challenging cosmic puzzles. Use a variety of powers to control planetary movements, such as changing gravity, designating velocity, applying force, and using mysterious wormholes to move masses around. The goal of every level is to collect enough asteroids using moons to move on to the next level. For a real challenge, collect the rare golden asteroids in every level!Key Features:Intuitively change physics properties of planets and moons on-the-fly\nNine Unique Planetary Powers: Velocity, rockets, gravity, lasers, redirect cosmic bodies, change density, form wormholes, create black holes, and reposition entire planets!\nNearly 200 total levels to play (including Free DLC challenge levels to be added)\nFull Level Editor Coming Soon as a Free Update!\nOnline Custom Level Sharing Cpming Soon as a Free Update!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Serenity Forge","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3324,"name":"Hyperdimension Neptunia U: Action Unleashed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b60/b605fbf8da887d7774f1bd5024506f1b.jpg","description":"The world of Gamindustri is experiencing a strange calm - the Goddesses protecting each nation are all at peace, and there's not an apocalyptic threat in sight! In order to shake things up with a good story, the world's leading journalists Dengekiko and Famitsu challenge the CPUs and CPU Candidates to complete a series of missions but soon they all may be in for a far bigger scoop in this action-packed hack 'n' slash!\nKey Features\nStreet brawling in 1080! For the first time ever, your favorite Neptunia characters will have to hack ‘n’ slash their way through waves of enemies in real time! In the free-roaming stages, you’ll get to create chain combos both on the ground and in the air, all with 1080p graphics!\nTwo-person party! With the Dual System, you’ll be able to switch between two characters on the battlefield. Balance out each character’s strengths and weaknesses to create the ultimate battle duo, and even get some new playable characters – some of whom might be familiar from previous Neptunia games.\nLet’s get physical! The heat of battle can cause some wear and tear on your outfits. When you experience a “Costume Break,” your outfits will tear, lowering your defense but increasing your critical rate and EXE Drive Gauge. The road to comebacks is paved with ripped fabric!\nSkills get the kills! Fill up the EXE Drive Gauge in order to clear the room with two tiers of special attacks, and you might just get a helping hand from your friend later on to perform some super special attacks!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Idea Factory","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":638647,"name":"Haven Park","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/691/6912cbe2a9e0aaab616688b554792e20.jpg","description":"\"I'm getting older, my dear, and I'm not able to take care of the park any longer... Will you help me bring the life back into this place?\"\n\n\n\nBe Flint, who is doing his very best to keep his grandma's park up and running and make it a place for the campers to enjoy. Learn the camper's wishes and build whatever their hearts desire to attract even more quirky characters and look forward to whimsical conversations and quests.\n\n\n\nGet to know the campers and and learn more about the old stories surrounding the forest. Did someone mention a lost treasure?\n\n\n\nHaven Park is a place to relax, to enjoy and to make your own!\n\n\nKey Features\nExplore a tiny and peaceful open world and build cozy campsites at your own pace\nPlenty of quests and a heartfelt story keep you busy for 2-4 hours with many little secrets to uncover\nLearn new skills that help you make the campers even happier\nMeet lots of charming characters and learn their needs to make them fall in love with Haven Park","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Fabien Weibel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":542578,"name":"EverQuest (1999)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63b/63bf623ad3eb7f7d726132563bcfdc08.jpg","description":"Welcome to EverQuest ® - the online game that started it all! No other MMO matches EverQuest's content that includes 18 expansions, plus the original base game. Now, in its unprecedented sixteenth year, EverQuest continues to add immersive gameplay, captivating storytelling and exciting worlds full of mystery and adventure.\nEverQuest is Free to Play. Your Way.™ Join a thriving community unlike any other online game, immerse yourself in hundreds of unique zones, battle thousands of creatures, and complete exciting quests. Group with friends and experience an online game the way it should be, epic and legendary.Key Features:Experience 16 years of continuous development including 18 expansions of amazing content\nBuild your character through 90 levels of power\nMore than 500 zones to explore\nChoose from 16 unique races and 16 distinct classes\nThousands of Alternate Abilities available to further customize your character\nMore than 50,000 items to earn and collect\nHire and control unique mercenaries to aid you in your heroic adventures\nA robust in-game marketplace containing potions, weapons, armor, and mounts\nSolo, Group and Raid across continents filled with perilous dungeons, eerie crypts, floating landscapes, and underwater adventures\nParticipate in several seasonal and holiday events throughout the year","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Daybreak Games Company","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":46592,"name":"Hand of the Gods","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/859/859434f5220e58d121265fa8f4db088e.jpg","description":"“Hearthstone and X-Com combine” - PCGamesN\nCollectible card games and turn-based strategy collide in Hand of the Gods: SMITE Tactics! Wage divine war by summoning the Gods to a full 3D battlefield. Move your forces into position, then unleash divine powers to defeat your foes. Can you Command the Gods?\nDIVINE BLEND OF CCG AND TBS\nIt’s not what cards you play – it’s where you play them. Dominate the battlefield with your tactical brilliance, positioning units for maximum effect.\nBRING YOUR CARDS TO LIFE\nYou can’t contain a God in a flat, 2D card. Drag your cards onto the battleground and watch the Gods come to life in rich 3D.\nUNREAL ENGINE 4 POWERED\nExperience stunning 3D graphics, with FX and animations made possible by Unreal Engine 4.\nCOMMAND THE GODS\nWhich Pantheon will you lead into battle? Build your army from the legendary Gods of Greek, Roman, Norse, Chinese, and Egyptian mythology.\nFREE-TO-PLAY\nIt’s free to play Hand of the Gods – and we’ll give you 4 Core Card Packs to open FREE when you finish the tutorial.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hi-Rez Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":25057,"name":"Wii Sports","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/173/1739bdc5c33e85a0fa54b499a173690b.jpg","description":"This is what video games should be: fun for everyone. Wii Sports offers\nfive distinct sports experiences, each using the Wii Remote controller\nto provide a natural, intuitive and realistic feel. To play a Wii Sports\ngame, all you need to do is pick up a controller and get ready for the\npitch, serve or that right hook. If you've played any of these sports\nbefore, you're ready for fun!\nWii Sports is part of the Nintendo\nSelects family of games—great titles enjoyed by millions, now a great\nvalue at just $19.99 MSRP* each.\n\nFeatures\n\nPlay Tennis, Baseball, Golf, Bowling and Boxing in the comfort of\none's living room. No ball boys scurrying about, no oil from the\nalleys to get players dirty and no rain to keep anyone from a day at\nthe court, park or course. Use the Wii Remote controller to mimic the\nactions of swinging a racket, bat or club, roll a ball down an alley\nor bring the left jab.\n\nPlayers can use their own Mii caricatures in the game and play them\nagainst their friends' Miis for a more personalized experience. As\nplayers improve, their Miis' skill levels will increase, so that they\ncan see exactly how much better they've become.\n\nPeople of all skill levels can pick up and play any of the games in\nthe unprecedented Wii Sports package, making this truly a title for\neveryone!\n\n*MSRP: Manufacturer’s Suggested Retail Price. Actual price may vary. See\nretailer for details.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Desconocido","platforms":[{"id":0,"name":"Wii"}]},{"id":19631,"name":"CaesarIA","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f92/f92dc4d0eddbd2976b36c8647bde4bc2.jpg","description":"CaesarIA is inspired by an old-school economic strategy game, Caesar III which is a masterpiece among the games of this genre in our opinion. There are different economic strategy games and they can be broken down to subtypes but from our viewpoint Caesar encompasses planning, constructing, diplomacy and military campaigns.\nEconomy and Trade\nMiniature model of an economy leaves the ruler no room for mistakes, under his leadership there are extractive industry (mines, sawmills, outcrop mines and farms) and production (factories, armories, wineries and brandy kitchens). And if some resource is scarce or not available, then trade with the neighbors can be a solution for the difficult situation. Mini-economy is complicated and takes into account a variety of facts: taxes, import/export, population of the town, healthcare, unemployment. In order to stay in the black it is necessary to develop houses with high income level but that can lead to a rise in unemployment which consequently results in big problems such as an embezzlement of municipal purse.\nConstruction\nConstruction is defined by the needs of the town, healthcare, procurement, buildings security provision. The main idea of construction is bringing workers to the area, there actors entertain the public, engineer provides service for shabby houses, vigils fight criminals.  Moreover, city folk prefer to occupy quiet picturesque location such as gardens farther from dirty barns and noisy barracks.\nDiplomacy\nThe emperor will not leave the town alone, Caesar himself will demand goods for his personal use, sometimes in huge amounts and with bad timing. If the player has enough nerve he/she can just turn a blind eye to Caesar which unfortunately results in game over. Therefore, it is important to stay friends with Caesar and send him presents such as modest donations or exotic animals. Towns in the neighborhood will also take part in common trade network of the Empire and compete in the deals with the town.\nReligion\nRomans were superstitions people and created the whole hierarchy of gods. 5 gods are in the game:\n- Earth goddess, Ceres, when worshiped in the right way doubles the yield capacity.\n- Restive Neptune can help the merchants have a successful voyage.\n- Sly Mercurius can fill all barns and storage houses up to the roof.\n- Spirit of Mars protects the town from foes brave enough to attack the town.\n- Venus can brighten up the mood of city folk for a long time.\nAttitude of the City Folk\nThe attitude of the city folk to you will be very important, if the reputation of the ruler is bad it can start the emigration, then criminal rate increases - riots, fires and many other problems occur. Therefore, it is necessary to take care of the people and analyse current deficiency. Healthcare is provided by hospitals and bath houses. Entertainment is fence play and chariot-riding. Food comes from farms and the sea. Religion and security are at control of the regular army.\nMilitary Set-up\nThe city has to be protected from invasions of barbarians, the creation of bastille lies ahead, soldiers and barracks can be situated there as well as recruit depot. However, this is a way to recruit only varmint velites and reckless equites. Roman army is its legionnaires and they are heavily armored with helmets and shields that means a demand for ore and iron which are not so easy to excavate. But even if you have 2 cohorts of legionnaires nobody is free of fear therefore there is a need in a military academy where soldiers can have additional training in survival and ethics.\nSpecific Features:\n+ Upload of the map from the original Caesar III game;\n+ Construction\\demolition of buildings and edifices;\n+ Migration of population;\n+ Farming and product distribution;\n+ Entertainment, healthcare, religion, education;\n+ Empire trade network with computer towns;\n+ Extraction of raw materials and manufacturing;\n+ Prefects, engineers, apprentices, soldiers, etc.;\n+ Advisers;\n+ Dynamic town modeling;\n+ Changing the level of the houses according to the environment;\n+ Healthcare and water facilities;\n+ Military buildings.\nFuture Plans\n- Real-life financial system (salary, goods purchase, hiring);\n- Specialization of city folk, setting up personal relations and families;\n- Class system in the town (slaves, plebs, clients and patricians);\n- Various climate conditions;\n- Map editor;\n- Computer towns and empires modeling;\n- Network play.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"rdt.32","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19177,"name":"Risky Rescue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02d/02df8408233eb812a28405fe4c8a9a61.jpg","description":"New game from the creators of award winning Timberman!!!\nRisky Rescue is a demanding arcade game with flat design graphics and innovative controls. Fly a helicopter and do dangerous missions rescuing people. At each level you’ll need to save people standing on the mountain tops, roofs, platforms hanging in the air, etc. Unlock helicopters with different parameters, complete over 50 demanding levels. If that’s not enough try yourself in endless mode, where your skills can compete with the timer. Use your reflexes but be gentle, there is no place for mistakes in Risky Rescue.\nGame features:\n●  50+ demanding levels in 3 flat designed worlds\n●  Multiplayer\n●  Worldwide ranking\n●  about 20 choppers to unlock (boost / additional armour / different parameters)\n●  endless mode\n●  innovative controls\n●  leaderboards and achievements\n●  awesome music and sfx by famous game sound composer\n●  simple but challenging\n● TRADING CARDS!!! :-)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digital Melody","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":12552,"name":"Turbo Pug 3D","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/2168650fb7f194889d8a9fe07fad2228.jpg","description":"Turbo Pug is back! And this time, he's three dimensional!\nJoin Turbo Pug and friends, sprint your way through a randomly generated voxel world with scaling difficulty.\nTurbo Pug 3D - Fast paced, casual fun.\nKey Features:Enjoy the popular Turbo Pug fast paced, timing based, runner game-play style in a whole new way!\nDelve into a randomly generated 3D voxel world\nGrab Pug coins and unlock new characters and hats!\nEquip hats on different characters\nGlobal leaderboards - 'Daily' and 'All time'\nA stunning day/night cycle","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wulo Games","platforms":[{"id":0,"name":"PC"}]},{"id":11958,"name":"Nidhogg 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/962/9626e41ae5809e9545a34c2562e3b749.jpg","description":"The wurm has returned and it must feed! Shed your garments and paint the walls with the flesh of your enemies, for only one can be worthy of sacrifice.\n\nThe rules are simple. Reach the other side and kill anyone that stands in your way. Deftly parry and rend their throats, riddle their bowels with arrows, or squish their brains between your toes. The wurm cares not for chivalry.\n\nSequel to the indie hit of 2014, Nidhogg 2 builds upon the award-winning gameplay of its predecessor with new weapons to wield and levels to master, head-to-toe character customization, and the captivatingly grotesque art of Toby Dixon.\n\nAnd, with music from artists including Mux Mool, Geotic, Doseone, Osborne, and Daedelus, Nidhogg 2 has a soundtrack so good that even the menu screens are awesome.Game Features:Challenge the AI or a friend in 1v1 combat.\nFight for the top seat in 8-player tournaments.\nMaster the distinctive traits of four weapons.\nGet stylish with full character customization.\nTen stages from castles to Nidhogg innards.\nAlter the rules with over 10 different game variables.\nGo online with matchmaking and private games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Messhof","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":5200,"name":"Grand Theft Auto: Chinatown Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bcd/bcdadb5dd2be66dd4dd1f657275b3f8e.jpg","description":"Left For Dead In The Worst Place In America\nFollowing his father’s murder, Huang Lee has a simple mission: deliver an ancient sword to his Uncle Kenny to ensure his family retains control of the Triad gangs of Liberty City. Huang is a spoiled rich kid who expects everything to run smoothly, but his trip does not go exactly as planned. After being robbed and left to die, he will search for honor, riches and revenge in the most dangerous and morally bankrupt city in the world.\nRetired Features:  Rockstar Games Social Club features and unlocks for Chinatown Wars will no longer be available as of 5/31/14.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2007-2009 Rockstar Games, Inc.  Rockstar Games, R* logo, Grand Theft Auto, and other marks are registered trademarks of Take-Two Interactive Software, Inc. The ratings icon is a trademark of the Entertainment Software Association. This product contains software technology licensed from GameSpy Industries, Inc. © 1999-2009 All other marks and trademarks are properties of their respective owners.  All Rights Reserved.\nUse of this software subject to license in game manual & online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee, internet connection, and/or online account registration (13+). Special features may not be available to all users and may on 30 days notice be terminated, modified, or offered under different terms.\nThis videogame is fictional, doesn’t depict any actual event, person, or entity any similarities are coincidental.  We don’t endorse or encourage any conduct depicted.  Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is prohibited.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rockstar North","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PSP"}]},{"id":586042,"name":"Oxenfree II: Lost Signals","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/55e/55e23d1452e7f7f0295c4fe2a4d298b5.jpg","description":"Five years after the events of OXENFREE, Riley returns to her hometown of Camena to investigate mysterious radio signals. What she finds is more than she bargained for.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Netflix","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":334309,"name":"JoJo’s Bizarre Adventure: Eyes of Heaven","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c79/c79c12d7f1a2f887b186e05dbbed233e.jpg","description":"In almost 30 years since its first publication, the JOJO’S BIZARRE ADVENTURE franchise has never been as\nyoung and fresh as today! Featuring a completely new 2 vs 2 fighting system, the House of Joestar is back with a new fast-paced action/fighting game! Strategize with your partner, overwhelm your opponent, and strike a victory pose in stylish team battles only possible in JOJO’S BIZARRE ADVENTURE: EYES OF HEAVEN!\nA BOY NAMED JOESTAR\nIn an original story that spans generations, all the members of the House of Joestar are joining forces to unravel a terrible mystery and discover the “Truth”!\nMORE MORE MORE\nMore than 50 characters coming from the 8 chapters of the story. Also, all of the previously released Japanese DLC is included!\nIT’S ALL IN THE GAME\nNew incredible abilities and fighting styles made possible through open stage cooperative battles! Select your favorite duo and trigger devastating Dual Heat Attacks!\nROAM\nLarger environments with even more stage gimmicks!\nAdditional hardware required for Remote Play.\n1-2 players\n3GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n©Hirohiko Araki/SHUEISHA, JoJo’s Animation Project\n©Hirohiko Araki&LUCKY LAND COMMUNICATIONS/SHUEISHA •JOJO’s Animation SC Project\n©LUCKY LAND COMMUNICATIONS/SHUEISHA\n©BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":19756,"name":"Timore Inferno","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/780/780ab704e133becda922674aead21b02.jpg","description":"Timore Inferno is the 4th indie horror game in the Timore series. Strange visitors have come to a little girl's house, robbing her home and killing everyone inside... Except her. With dolls holding the anger of her loss, everyone who tries to go there and investigate what happened wind up missing.\nTimore Inferno is a horror experience through the hell of a little girl's mind. The player meets a helper whom gives advise on how to stay alive, but it is ultimately up to you to decide whether to take it or not.\nSpecial thanks to Dominique Myers - D.EXE for helping through the game making process.\n-\nSee everything I've made on:\nVidasGames.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vidas Salavejus","platforms":[{"id":0,"name":"PC"}]},{"id":19553,"name":"Eidolon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d1/9d192c45decb1c2055b5f742809e6779.jpg","description":"In Eidolon, you start as a new student at Eidolon University. You're asked to introduce yourself to the new students. In doing so, you'll learn more about them, the true nature of the university, and yourself.\nEidolon University has a 2-3 hour playtime but no two playthroughs will ever be the same due to extensive dialogue options and as many as sixteen unique endings per character.  You play as a new student at Eidolon university. As you interact with the other students (by clicking on them in whatever order you choose), you will have extensive branching dialogue options that unlock new areas, raise affection, and unlock special endings.\nThis download includes the full game, free to play, with no additional content expansions anticipated. Play for free now and forever.\nSome of the characters you will meet while playing include:\nErica (not-datable) – A bubbly sorority sister who'd love to party and make memories with you – or drink too much and forget them.\nMelody (datable) – She's hoping to save the world – and would love help picking up litter or protesting the new power plant, especially with an attractive student like you! If only she could find a way to graduate from the university and make a more meaningful impact...\nVivian (datable) – Voted most likely to succeed. She'll apply that same ambition in dating you and in trying to escape from Eidolon.\nAdrianna (datable) – The resident romantic, hoping to have her own happily ever after. Can you give her the romance she longs for or will she be forced to take matters into her own hands?\nBrooke (datable) – Athletic and skeptical about love – can you work your way into her heart? Or better yet, give her the adventure she craves?\nClaire (datable) – Curious about everything, she's eager to experiment with you in all kinds of ways. But her greatest experiment will be determining the true nature of her world.\nReia (datable) – More interested in books than romance, can you find a philosophy that incorporates love? Or one that explains who - what - she really is?\nSophia (non-datable) – The school's guidance counselor may have answers to the mysteries of the university – or at least towards better understanding why you seek them.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ice Water Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18939,"name":"Shape Shifter","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e29/e291002fb168763508f3b46785c0a062.jpg","description":"Create and discover Custom Levels on the Steam Workshop!\nAbout the GameWelcome to The Geomatrix, a digital realm where everything is a polygon, including you!Create, discover and share levels, compete for the best times and discover hidden secrets. Whether you're a triangle, circle or square, each shape has their own unique abilities that dictate how you solve puzzles and clear levels!-Features-Using the in-game level editor, you can make all kinds of crazy creations from difficult time trials to complex contraptions! The level editor features:Various simple and complex shapes, that you can combine to create minimalist structures or huge open worldsLots of functional blocks, such as the automator and area trigger for the engineers out thereMany handy tools that streamline the creation process, like the camera zoom adjuster and background blocksGrab a friend! Any of your maps can be uploaded to the Steam Workshop to allow them to be played in multiplayer!Deep integration with Steam, use a lobby code or simply invite a friend through the Steam friends menu Compete with each other, for the fastest times and best scores, or work together to solve difficult puzzlesCross-platform compatibility, whether you're playing on a Windows or Mac system, anyone can join their friends, regardless of their operation systemIf you're not as interested in creating your own levels, or just want to experience some pre-packaged levels, I've got you covered!A handful of demo levels, to preview the capabilities of the level editor and to test your skillsHidden collectibles and secrets, for the keen-eyed and curiousA subtle storyline, of course, for the theorists out there","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PRORTUS","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10700,"name":"Knight Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/681/681c533cb3496bdbf865515c7f7b55b2.jpg","description":"Knight Online is a PvP-centric MMORPG that has been under continuous development for over a decade! Two nations, El Morad and Karus are locked in an eternal struggle for dominance of the Adonis Continent. You will be faced with the decision of choosing between one of the two available factions and bring glory and honor\nthroughout constant action-packed PvP battles within the designated PvP Zones during all hours of the day.\nBe part of the exclusive in-game events that are built to test your skills in battle and reward you with the spoils of war upon defeating all those who oppose you!\nEvents Available:\nBorder Defense War\nForgotten Temple\nChaos\nBiFrost\nCastle Siege War\nJuraid Mountain\nLunar War\nDark Lunar War\nEpic events such as Lunar War and Castle Siege war are set to place you in an epic battlefield with action packed PvP that is able to entertain and excite its fans even after many years! We encourage you to try all that the Adonis Continent has to offer and see for yourself why Knight Online is so great even after so many years!\nWhile PvP may be the beating heart of Knight Online, much of the game is spent embarking on quests, killing monsters for great loot and of course defying the forgotten Gods of the Adonis Continent. Upon destroying monsters you will be able to gather equipment that will aid you in your adventures for years to come!\nThe Upgrade System has been built for players to tempt fate in an effort to improve their existing weapons, armor and accessories in order to gain stronger equipment that will make enemies tremble in fear! With its unique ability to let players refine their skills and build their characters and equipment, Knight Online is set to bring an exciting adventure to all those who wish to be part of the most epic Old School MMORPG on Steam!\nSo what are you waiting for? Pick a Nation, build up your warrior and join the fray!","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Mgame","platforms":[{"id":0,"name":"PC"}]},{"id":6220,"name":"Twilight Struggle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e8/8e88e9b19cbc079a50f4befe448b69aa.jpeg","description":"Twilight Struggle is a challenging strategy game of medium complexity that presents new and different challenges with every game session. The game map is a world map of the period, whereon players move units and exert influence in attempts to gain allies and control for their superpower. The playable events in the game cover a vast array of historical happenings, from the Arab-Israeli conflicts of 1948 and 1967, to Vietnam and the U.S. peace movement, to the Cuban Missile Crisis and other such incidents that brought the world to the brink of nuclear annihilation.\nPlay as the US or USSR during the Cold War and change the course of history.\nHighlights\n• Events found in the game are actual events that occurred during the Cold War.\n• Full asynchronous support for multiplayer online games.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Asmodee Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":4265,"name":"Persona 3 Portable","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68a/68a5aaddf51fa089fe1d2fcc9aa1b62b.jpg","description":"Terrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next. As a member of a secret school club, you must wield your inner power—Persona—and protect humanity from impending doom. Will you live to see the light of day?\nHailed by critics and players alike for breathing new life into the RPG genre, Persona®3 now finds a new home on your PSP® (PlayStation®Portable) system. All of the compelling and seamless mixture of social simulation and dungeon crawling is faithfully recreated in portable form, and that’s not all—for the first time ever, you can experience the story from a new female protagonist’s point of view to make new friends and see events from a different perspective.\nNew gameplay additions and slick system enhancements make this version worth playing whether it’s your first time experiencing the Dark Hour or whether you’ve already been to the top of Tartarus and back.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Atlus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PSP"}]},{"id":3331,"name":"Color Guardians","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be2/be2635877fc8dedd70afb4c4184a53a4.jpg","description":"Color Guardians is an exciting fast action side scrolling game that combines quick thinking with frantic gameplay into a hard to master challenge! Switching colors and collecting items, all while avoiding obstacles will surely test your reflexes!\nThe colorful world of Terra Color has been turned to a dark and sad place by the dark powers of the evil color thief Krogma. The only ones capable of restoring the world to its original state are a colorful bunch of characters made of paint called the Color Guardians.\nHelp the Color Guardians bring color back to their world. Guide Rod, Lia and Grock through 70+ levels of fast-paced action and defeat the evil color thief Krogma. The core mechanics are easy to understand, but build up quickly -- and start challenging the limits of your skill.\nGame scope\nColor Guardians includes:\nLoads of content! Play more than 70 levels of fast paced and cleverly designed hard to master challenges.\n5 Different worlds to explore! Each world introduces new challenges and exciting new mechanics.\nPlay as Rod, Lia and Grock and discover the world of Terracolour!\nHidden unlockables including music, concept art, renders and 3D models.\nCompare your score with your friends through leaderboards.\nUnlock a crazy bunch of achievements!\nGame features\nClever, challenging design that will keep you busy for hours.\nEach level is uniquely designed to keep up the challenge!\nFun and fast color-matching gameplay while avoiding obstacles and collecting items. This game will surely test your skills!\nVivid, eye-catching visual design across several different worlds.\nLeaderboards to compete with friends, and plenty of unlockables to fight for!\n60 challenges to unlock extras: concept art, music, and more.\nLocalized on 7 different languages: English, spanish, french, italian, german, portuguese and russian.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fair Play Labs","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3074,"name":"Turbo Dismount","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72f/72f5bfaa8a93be66ff117871eaf1bdb7.jpeg","description":"Turbo Dismount is a kinetic tragedy about Mr. Dismount and the cars who love him. It is the official sequel to the wildly popular and immensely successful personal impact simulator - Stair Dismount.\nThe highlights of this experience are multiple vehicles, an awesome replay system, level editing features, high-speed physics and an indiscriminate sense of style.\nThe purpose of the game is simple - damage awards points. It is up to you to try different combinations of obstacles, vehicles, poses and levels to make it to the top of the leaderboards. To support friendly rivalry, Turbo Dismount supports placing a photo of your friend on the face of Mr. Dismount - such a delightful way to express one's emotions!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Secret Exit","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22379,"name":"Keen Dreams","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb8/bb8f982566aef017cdbaa3ceaa476b3b.jpg","description":"Eat your veggies!\nThe lost episode of PC platforming legend Commander Keen hits Steam with this updated version for modern systems.\nBilly Blaze, eight-year old genius, has just returned home after saving Earth from the Vorticons only to be confronted with a dinner made up of broccoli, Brussels sprouts and mashed potato. Having chosen to eat ice-cream instead, he finds himself besieged that night by horrible dreams full of  living vegetables. The evil King Boobus Tuber has been trapping kids in the nightmarish land of Tuberia, where Tater Troopers patrol and Tomateeth are on the prowl. Trapped in his pijamas — with neither his Vorticon hyperpistol nor trusty pogo-stick for company — Commander Keen must destroy the Dream Machine and return the \"sweet\" to \"sweet dreams\".\nThis updated version includes:\nFullscreen and Windowed modes\nBoth the EGA and CGA graphics from the original game\nSteam Achievements\nScore and Time-trial leaderboards\nCloud saves\nNow go get 'em, Commander Keen!","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"id Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]}]