[{"id":3519,"name":"Frozen Synapse Prime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e98/e988631e8fe4b5c831c7067604cb6cba.jpeg","description":"A Reimagined Frozen Synapse Experience\nTake on the role of Tactics in a brand new Frozen Synapse experience. Lead a rebel faction to overthrow a powerful corporation controlling the city of Markov Geist.\n\nControl an elite strike team of futuristic soldiers - From shotgunners and snipers, to grenadiers and machine-gunners in the ultimate turn-based strategy game. Plot paths and issue orders to your units, test your plans and predict your opponent in each turn. Combat plays out on procedural, 3D, destructible and customizable battlefields.\n\nPlay online to become the ultimate tactician  – Synchronous play allows you to battle against players live. Asynchronous multiplayer enables you to compete in multiple games simultaneously.Key Features Rich single player campaign with 40+ challenging missions set in a dystopian future\nMultiplayer suite with asynchronous and synchronous play options, player matchmaking, preset map, squad options and more!\nIn addition to classic death match, games involve protecting VIPs, rescuing hostages, infiltrating and controlling bases and collecting items to score points\nSave your matches and share your favourites with friends using the Replay Theatre!\nGlobal leaderboards allow you to view a player’s match records and statisticsGameplay EnhancementsWe’ve rebuilt the original Frozen Synapse from the ground up to provide a more immersive and accessible experience, while enhancing everything that made the original so great.\nNew Full 3D Presentation - Experience the world of Frozen Synapse like never before. Newly design characters models, destructible arenas, cinematic replays, kill cams, dynamic lighting, audio and visual effects\nPowered Up Tactics – Devise new strategies with Slide, Sweep, Room Selection, Targeting, dynamic cones-of-vision alongside a host of additional enhancements\nRelive the action – Replay Theatre records all your multiplayer matches, friends battles and the world’s best face offs\nPlus a huge amount of new content and improvements, balanced with feedback from the fans of the original. Check them all out in our community hub.Overhauled Multiplayer Experience  Challenge players online, or compete asynchronously against friends around the world\nA suite of new options for finding, joining, creating and customizing your own matches\nGlobal leaderboards showcase you, your friends and the best of the Frozen Synapse Community\nNew scoring, match objectives and intelligent matchmaking promotes competitive and fair match-ups\nLearn from the pros - Pick up tips and tactics, in specific match-types from the Replay Theatre’s pick of the top matches\nManage and make turns in multiple games at once, via your ‘Active Matches’ list Frozen Synapse Prime Steam Edition  Exclusive new Arena Mode - Battle in unique and challenging scenarios, designed to empower you to strategize in new ways and utilize the terrain like never before\nPlay with keyboard and mouse, mouse only, or controller only\nSteam Achievements\nSteam Trading Cards\nSoundtrack includes all music tracks from the original game, plus the ‘Red Pack’ expansion","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Eleven","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":418467,"name":"Call of Duty: Warzone","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e3/7e327a055bedb9b6d1be86593bef473d.jpg","description":"Welcome to Warzone, the new massive combat arena within Call of Duty®: Modern Warfare®, free for everyone.\n\nDrop In\nJoin forces with your friends and jump into a battleground with up to 150 players.\n\nLoot For Rewards\nDiscover supply boxes and complete contracts to build your arsenal and gain a tactical advantage.\n\nBattle Across Two Epic Modes\nExperience a new way to ‘Battle Royale’ or play ‘Plunder’ in a race to earn $1,000,000 of in-match Cash.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Raven Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":50351,"name":"Rusty Lake Paradise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3cd/3cd70bd7bff5be78d8487dbf872b6486.jpg","description":"Welcome back to Paradise island! Since the mysterious death of your mother your family's home has been cursed by the ten plagues. Find the hidden memories of your mothers past and partake in many ominous family rituals in order to stop the plagues.\nRusty Lake Paradise is the third premium point-and-click adventure by Rusty Lake, the creators of the Cube Escape series, Rusty Lake Hotel & Rusty Lake: Roots.\nKey features:\nPick-up-and-play: easy to start but hard to put down\nUnique storyline: the first adventure game that is based around the ten plagues of Egypt\nAn unforgettable puzzle experience: each plague brings his own atmosphere, suspense and a variety of Rusty Lake brain teasers\nAtmospheric graphics: the pastel background paintings are handmade by Dutch painter Johan Scherft\nImmersive soundtrack: each plague has its own theme song and variations\nAchievements: the island has more secrets to unravel","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rusty Lake","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28326,"name":"Kameo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab9/ab909eb012c4f69e0a5cab42bbe7851f.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish, Japanese, Korean and Chinese. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   Unleash the powers within you! An epic adventure from legendary developer Rare, Ltd. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":25663,"name":"Earthworm Jim","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/360/360f00cbb4b4364b9af0e7ff8e397b65.jpg","description":"Rediscover one of the all-time best video games, faithfully refined\nand enhanced with an exclusive feature!\nThe all-time classic\naction platformer you used to play on Super NES is back in a remake that\nkeeps the essence and core gameplay of the original, plus a\nnever-before-seen feature, exclusively on the Nintendo DSi system.\n\nPlay as the grooviest earthworm in the galaxy. Run, gun, swing from\nhooks with your head, launch cows, bungee jump, rocket through speed\nlevels and more, in a dozen crazy universes that offer huge gameplay\npossibilities. Earn bonuses with facial-expression-based challenges that\ntrack your face using the inner camera. Put on a smile, frown or make a\nvariety of other faces to mimic Jim.\n\nThis game cannot be transferred from the Nintendo DSi to the Nintendo\n3DS system. For more information, CLICK\nHERE >","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Gameloft","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Genesis"},{"id":0,"name":"Wii"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"SEGA CD"}]},{"id":656,"name":"The Little Acre","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/62a/62a4d2bb30617e165fabf8db96aaecba.jpg","description":"The Little Acre follows the story of Aidan and his daughter, Lily, set in 1950’s Ireland. After discovering clues as to the whereabouts of his missing father, Aidan begins investigating until he inadvertently finds himself transported to a strange new world. Ever the hero, Lily sets off after him, encountering her own perils along the way. Featuring full voice-acting and hand-drawn animation, The Little Acre is a memorable, lovingly crafted adventure game.\nThe Little Acre is developed by Pewter Games alongside Executive Producer Charles Cecil (Broken Sword, Beneath a Steel Sky).\nFeatures:\nTwo playable characters\nTraditional hand-drawn animation\nUnique perspective transitions\nBeautiful original score\nFully voice acted","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":428083,"name":"Panzer Paladin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/740/74004bd96c8e432782afe6d4e5e9320b.jpg","description":"The sight of giant swords blazing through the night sky might be hair-raising, but stand your ground! The sinister Ravenous and his legions of brutal demons are poised for battle. Even all the armies of the world can’t stop them, but humanity has one final ace in the hole: a cutting edge power armor called Paladin.\nIt's now up to the strong-willed android named Flame to become a Squire, take control of the Paladin and track down all Weapon Keepers and their diabolical leader. The showdown between mankind’s highest technological prowesses and the powerful forces of the occult has begun!\nSeize weapons from the denizens of the Netherworld and dish out a taste of their own medicine! Show them the power of cutting edge technology combined with swordsmanship. Slash, bash and thrust your way through a series of mind-blowing levels located around the world, all of it rendered in glorious 8-bit graphics! Hop in your Panzer Paladin and take up arms!\nAn engaging action-platformer with fun and intuitive swordplay!\nTake control of the mighty Paladin power armor or eject and play as the small but swift Squire pilot!\nRobots meet demons! Crush the forces of the occult with the power of cutting edge technology!\nOver 100 melee weapons to seize from enemies!\nUse weapons profusely: wield, throw, or shatter them!\nSnap a weapon in half to cast a powerful spell!\nSlash, bash and thrust your way through 17 mind-blowing levels located around the world!\nCarefully crafted 8-bit graphics like you remember them!\nPanzer Paladin is an action-platformer game featuring intuitive swordplay mechanics. The protagonist pilots a power armor called Paladin to fight giant demons by using their own weapons against them.\nThe key components of the swordplay mechanic includes the ability to equip and use any weapon dropped by defeated enemies, high versus low attacking and blocking, a rock-paper-scissor weapon type system that grants attack bonuses, and the ability to cast spells by breaking weapons. Weapons abound in levels, so the player is encouraged to use them profusely. The Paladin is the main means to fight enemies but players can eject and also play as the swifter and smaller pilot called a Squire. The Squire uses a laser whip to attack enemies, swing across gaps, and recharge the Paladin’s energy.\nGiant weapons—swords, lances, hammers—hailing from the dark depths of space, blazed across the sky and pierced through historic locations all around the world. Like a declaration of war against mankind, the Parthenon, atop the Acropolis of Athens, was first to be cut right through by an ominous blade.  Upon impact, each of the weapons opened a breach in the fabric of reality and unleashed legions of colossal demons.\nIn anticipation of such unforeseen Earth-threatening events, the International Security Council had formed Gauntlet, a science committee developing super sophisticated defense technologies. Gauntlet discovers that denizens of the Netherworld can only be obliterated by their own weapons. Spirit Weapons are forged with spirits of the deceased and humans can’t brandish them without becoming corrupt by their foul power... However, a machine would be immune to demonic corruption! Gauntlet recommissions Flame, a former rescue operations android, to become a Squire and take control of the last remaining Paladin unit, a state of the art power armor capable of wielding Spirit Weapons.\nTo arms! Overseeing their operations from aboard the Avalon, their flying headquarters, Gauntlet is ready. The showdown between mankind’s highest technological prowesses and the powerful forces of the occult has begun! It's up to Squire Flame and her Paladin named Grit to defeat all Weapon Keepers, and ultimately face off against Ravenous, the sinister leader of the invasion.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tribute Games","platforms":[{"id":0,"name":"PC"}]},{"id":18698,"name":"Silent Storm Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/629/629646116cf5f84fbe5e3cbf5f2f0a66.jpg","description":"Silent Storm from leading Russian developer Nival is a true 3D tactical turn-based Role-Playing-Game set against the backdrop of WWII. As the conflict rages on the frontlines, you’ll be leading a small multinational squad behind enemy lines to gather information and wreak havoc on your enemies while trying to thwart a mysterious new rising power whose plans are even more horrific than anything the world has yet witnessed.\n\nSilent Storm is fully rendered in breathtaking 3D – and includes fully destructible environments, realistic weaponry and unlimited tactical possibilities. Turn-based gaming has never looked this good!The Story1943: The world seems to face its destruction in all parts; war is raging like never before. You are the commander of a squad, leading the soldiers you’ve selected into special and top secret operations to change the tide of war in your favour – allies or axis, it’s you choice!\nThe new Add-On \"Sentinels\" begins with the end of the WWII nightmare. Veterans from all countries, even former enemies, stand together and form the secret investigation and intervention group \"Sentinels\", for one purpose only: To stop the evil secret society \"Thors Hammer\" they have faced in war.\n\nKey Features:\nTurn-based game, heavy on tactics and team-management\nFlexible missions, 2 different campaigns for axis and allies.\n24 missions during night and daytime, each one has to be prepared carefully and is enriched with random events.\nMultiple options for mission success: brutal force and tactical cleverness can be used in the combination of your choice and in 3 difficulties\nMore than 75 authentic weapons from WWII, including experimental prototypes and rare items\nMore than 40 male and female soldiers to choose from, each one has his / her own character and special abilities\nDestructible environment opens up tactical options, whether it’s flushing an enemy out of a building via rocket launcher or knocking holes in a wall to make a field-expedient shortcut.\nUnprecedented realism featuring true 3D, a fully destructible environment, and real projectile physics that take into consideration trajectory, speed, and piercing performance.\nIncludes Silent Storm and Add-On \"Sentinels\"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":12121,"name":"Vagante","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08a/08afdd7eaf0c355cb8944eeb11583fe7.jpg","description":"Vagante is an adventure set in a dark fantasy world filled with monsters, demons, and crooks. Despite these dangers, adventurers commonly travel these unforgiving lands questing for fame, riches, and power.\nA recent rumor has it that a certain cave at the edge of the woods guards an unfathomable treasure. While a handful of intrepid adventurers have ventured into the cave already, none have returned. Undeterred by the potential danger, you set out by caravan to investigate...Key FeaturesLocal and Online Co-op - Adventure cooperatively with up to four players, either locally or online through Steam!\nProcedural Generation - With procedurally generated levels, no two runs are ever the same, allowing for countless hours of gameplay.\nChoose How You Play - Choose a unique class, skin, and background, then customize your character further as you play with your choice of unique class skills at each level.\nEnchanted Items - Discover magic items that bestow powerful enchantments and game changing abilities.\nDiscover Secrets - Keep track of unlocked classes, backgrounds, music, and more in the Book of Secrets.\nExplore a Rich World - Explore five unique areas each with their own set of dangers such as monsters, unique bosses, and traps.\nTough, but Fair - Play a game designed for players looking for a challenging but rewarding experience.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nuke Nine","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11260,"name":"MapleStory","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec5/ec52542078d1d019befc0514d588f5d6.jpg","description":"Tune Up Is Here\nThis month, we’re getting out our tools to make lots of improvements to MapleStory! We have tons of tweaks in the form of Better Maple improvements, skill revamps, cross world PQ changes, and updates to Kanna and Hayato. You can also enjoy new events as you roll the dice in Dice Master, and cook up a yummy dish in Absolute Taste!\nLearn more here: http://maplestory.nexon.net/news/24746/\nRead the Patch Notes here: http://maplestory.nexon.net/news/24928/\nAbout the GameEons ago, six brave heroes defied the Black Mage and stopped his conquest of Maple World, sealing him away for millennia. Now the fiend has awoken, and a new breed of hero must take up the call.\nChoose from over 40 characters, including mages, archers, pirates, ninjas, even time travelers! Customize your hero with countless cosmetic options and craft your own play-style with robust skill trees. Explore Maple World's mountains, deserts, jungles and more, or travel to the alien world of Grandis for even more intrigue. With millions of players to meet and countless adventures to be had, MapleStory is the MMO that lets you unleash your wild side.Key Features:Customize Your Skills\nChoose from over 40 playable classes, each with distinct personalities and abilities. Level up your hero and specialize your skills for the perfect play-style. Every Maple hero has a story, and they all need players like you to guide them. What will your story be?\nUnlimited Style\nNo two Maplers are alike. Pick from hundreds of cosmetic options to craft the perfect hero. Choose from hats, cloaks, gloves and more to create a look that matches your personality. Crave substance over style? Collect weapons and armor to become the greatest warrior Maple World has ever known.\nFight with Friends\nMapleStory is one of the most social MMOs available. Bring along your buddies and create a guild, or make new friends as you join forces with millions of other players. Exploring Maple World is better with an ally by your side!\nThe Fun Never Stops\nMapleStory is always evolving, with new quests, new locations and new events added on a regular basis. Whether you're enjoying a new mini-game or taking on a new boss, there's always something to do, and someone to do it with.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nexon","platforms":[{"id":0,"name":"PC"}]},{"id":9585,"name":"Nine Parchments","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e8/4e816d620f393541e269c1dd9a575be5.jpg","description":"Nine Parchments is a co-operative blast'em up game of magic mayhem from Frozenbyte!\nA group of drop-out wizard apprentices decide to skip their training for a quick path to the Nine Parchments.\nAs the wannabe wizards rapidly discover powerful new spells and ignore all safety aspects, it's natural that their hasty progress results in lots of unwanted deaths...Features Wield the power of the elements and master a diverse and ever-changing arsenal of spells\nUnlock new playable characters, wizard hats and magical staves\nLevel up and train your characters in the magical arts, but choose your path wisely!\nBattle strange creatures and mighty bosses in a breathtakingly beautiful world, set in the Trine universe\nOnline and local co-op with 1-4 players","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Frozenbyte","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":3369,"name":"Aaru's Awakening","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/032/032aec3377090f154c8e09069ee053fb.jpg","description":"Aaru's Awakening is a hand-drawn, fast-paced 2D action platformer. The game puts players in charge of Aaru, a mythical creature with two unique abilities teleportation and charging. He uses these abilities as he travels through the dangerous world of Lumenox to defeat an evil entity. These two abilities are at the heart of every level design throughout the game, to make for a challenging and fluid experience. The levels require players to make split second decisions whilst completing fast-paced puzzles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lumenox ehf","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":45972,"name":"UnderMine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b5/1b5d958d5a1956319211822a0f2792e4.jpg","description":"Action-Adventure. Rogue-like. RPG.How many genres can one game belong to? We would have prefered all of them, but you’ll just have to settle for most of them. UnderMine stirs a delicious pot of genre soup, taking only the highest quality ingredients from each. We took the procedurally generated madness of the craziest rogue-likes (Binding of Isaac, Dead Cells, etc.), combined that with the exploration and discovery of classic action-adventures (The Legend of Zelda, Hyper Light Drifter, etc.), and topped it off with some light RPG progression and story (Rogue Legacy.)\r\n\r\nFeatures:\r\n\r\nDungeon Crawling: Forge that perfect run where you find all the right items, all the right secrets, and get all the right rolls to become a peasant god of destruction.\r\n\r\nDiscovery and Exploration: Bomb walls, blow up rocks, light torches, and discover secret passages, hidden characters, loot, upgrades, and more.\r\n\r\nCharacter Progression: The peasants keep dying, but your upgrades pass on. Unlock new abilities that will help in combat and open up new areas to explore.\r\n\r\nBosses That Don’t Mess Around: Challenge enormous bosses that take a combination of upgrades and skill to take down.Darkly LightheartedExperience the plight of the poor peasant sent into the goldmine. His job is to labor away for a boss that doesn’t care about him, in an environment that is openly hostile, and amongst creatures that want to tear his flesh off his bones. A pretty funny situation when you think about it.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Adam McLellan","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":12298,"name":"Ylands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fc/6fcd88748018a44a059a9f9b61ab4a13.jpg","description":"ABOUT\nYlands is both a sandbox exploration adventure and a platform for making custom games, ranging from simple scenarios to sophisticated game modes.\nIt will immediately captivate you by its stunning visual style. It lets you create a highly modifiable low-poly island (yland) of your choice and allows you to place it anywhere in the world – fully reflecting the resources, weather and wildlife of your chosen climate zone.\nYou also have full control over your game experience: play alone or with friends; try to live a life on your yland with only a handful of basic survival items or choose to have them all - it's up to you.\nKEY FEATURES\nFully interactable world with thousands of objects and items to be used, found or crafted\nModifiable terrain with fauna, flora and resources fully reflecting its climate zone\nWide range of things you can do - from mining, taming and riding horses, building elaborate energy devices or making potions to constructing ships of a custom design\nAll this while seamlessly switching between single and multiplayer modes (with dedicated servers support) and from first or third person perspective\nBuilt-in game editor that lets you design and share your own levels and adventures","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":274670,"name":"The Last Campfire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc6/cc61170cfe120e42d72a34c46b54b164.jpg","description":"The Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.\nDISCOVER A PURPOSE\n\nThe Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.\n\n \n\nON A JOURNEY\n\nTravel deeper into the lands beyond the dark forest and overcome the adversities before you.\n\n \n\nUNCOVER A WORLD\n\nDiscover beautiful wilderness filled with lost folk, strange creatures and mysterious ruins.\n\n \n\nLIGHT THE LAST CAMPFIRE\n\nFind hope and carry it with you on your Journey to light The Last Campfire.\n\n \n\nFROM A SMALL STUDIO\n\nA unique tale from Hello Games and the creative minds behind LostWinds.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hello Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":47359,"name":"Chuchel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8f/a8fd414f2e209b25b7081a23d04ba3ab.jpg","description":"Chuchel is a comedy adventure game from Amanita Design, the creators of Machinarium, Botanicula and Samorost, where fun is number one. Help Chuchel to chase down the mysterious villain and retrieve his cherished cherry! Outsmart the Pool Monster, escape frenzied Pac-Men and master the bird race. Join forces with Chuchel's buddy Kekel and show the mischievous Chrchel that stealing cherries is wrong.\n\nThe reward? A hearty situational humor, wild music and sounds by the band DVA and hundreds of hilarious animations that warm up even the coldest of souls. Plus cherries.\n\nThe game is all about the main character Chuchel and his never-ending passion for cherries. He is a cute hairy creature (an angry hair-ball basically) who is as pleasant as screaming kids and as intelligent as a potato. His silly orange hat is just  the cherry on top. Don't get fooled by his silly looks though - Chuchel is a true hero who never gives up.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Amanita Design","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":9771,"name":"Heat Signature","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/658/658ee56f04d522faffc4d6009842b07d.jpg","description":"Fly around a procedurally generated galaxy in a tiny defenceless ship, cut your thrusters to cruise past heat sensors, dock with an enemy ship's airlock, and sneak inside. Once you're in, you creep through their corridors, ambushing guards, hiding bodies, stealing new weapons, blowing them up from the inside, or hijacking their turrets and even the whole ship.\nZoom smoothly from a view of the whole galaxy down to your character sneaking up on guards inside the spaceship you're boarding.\nAll seamless: the ship you're on continues to fly around the galaxy as you sneak about inside, even as it gets into ship battles.\nFull modular destruction of every spaceship: shoot a fuel barrel to blow up the room and be flung into space by the vacuum. Rip ships in half, destroy secure rooms to form new entrances to dock at.\nProcedurally generated, from the shape of the galaxy, the trade routes between empires, the shape of every ship, and even the layout of the corridors inside.\nBe a bounty hunter, an assassin, a saboteur, or a hijacker. Earn money from your missions to buy better kit. That kind of thing.\nLovely spacey music.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Suspicious Developments","platforms":[{"id":0,"name":"PC"}]},{"id":3480,"name":"Yakuza 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/40a/40a2d211c0662ca3b20b9cfc21d84a39.jpg","description":"Yakuza 4 lets you explore the city of Tokyo in an unprecedented level of detail, experience every taboo in the underground world through the eyes of 4 revered men. Can you survive the dangers and temptations of the Japanese underworld?\no\tExperience the Japanese underworld under the guise of 4 characters - Each character has different missions and allows the player to explore the city from different viewpoints and engage in the Japanese underworld.\no\tAuthentic replication of Tokyo – In addition to the bright lights of downtown Tokyo, players can now go into the depths of the intricate underground, explore the backstreets of the city and take in the views from the rooftops of buildings.\no\tBecome the ultimate fighter – enhanced battle mechanics and a new fighter training system allow players to work on their skills and become the ultimate fighter.\no\tDeep crime story – an intricate storyline that incorporates all aspects of Japanese culture including hostess bars, karaoke and city exploration.\n1-2 players\n874KB minimum save size\nHDTV screen resolution: 720p, 1080i, 1080p\nDUALSHOCK®3\nNetwork Features\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\n©SEGA. SEGA, the SEGA logo and Yakuza are either registered trademarks or trademarks of SEGA Corporation.  All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":286579,"name":"Last Oasis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35b/35bd4bc67a4b43f31db75745fe867969.jpg","description":"Last Oasis is a Nomadic Survival MMO. Earth has stopped rotating, and the last human survivors need to outrun the scorching Sun in a massive Open World.Walkers\nTraverse the world on wooden wind-powered, walking machines. Walkers can be adapted for travel, transportation, harvesting, combat, or used as mobile bases. A multitude of structures, attachments and upgrades allow players to personalize Walkers to their needs.The Scorching Sun\nThe Sun burns the land in the west, turning it to dust. In order to stay ahead of the obliterating Sun, nomads must explore new territories that slowly emerge on the eastern horizon, from the side of the Earth that has long been frozen in impenetrable ice.The Lore\nAfter a cataclysmic event halted the Earth’s rotation, the planet was split into two extreme and deadly environments. Only a narrow band of space between the hot and cold halves of the planet has conditions that can support life. This band moves at the pace of the planet’s rotation around the Sun, and all life on Earth must migrate with it to survive. In order to keep moving, the remnants of humanity have built nomadic machines, and a walking city called Flotilla.\nEvery day, Flotilla transports more nomads into the passing oases, where warring clans fight tooth and nail for control of territory and valuable resources. Some nomads have carved out lucrative positions for themselves and even gained status with Flotilla; however most nomads are locked in a daily struggle for survival, forced to battle both nature and those around them. There will never be rest for the men who built the walkers; they can only move forward.Survive and Thrive\nFind ways to survive. Gather resources. Craft equipment. Build your Walker. Improve your skills. Learn to exploit what remains of the world. Keep your Nomad alive for as long as you can, as you become stronger the longer you escape death.Trade in a Player Driven Economy\nTrade networks stretch between the known oases. The global player-driven economy is based on real supply and demand. Smart and quick traders can make huge profits, but running trade routes always comes with a risk. Other nomads may opt to produce or hunt down rare and highly localized resources. It’s always wise to consider potential competitors first though. Challenge another clan’s monopoly, and you may become their next target.Travel and Explore an MMO-sized World\nThe world consists of many interconnected oases, forming a large open world. Potentially a thousand oases exist simultaneously - the number automatically adjusts to accommodate the size of the playerbase. Each Oasis is over 100 km2. Explore them to reveal new and unique biomes while plundering their limited resources. Some nomads may pitstop to refill their water. Others will settle for some time, but ultimately everyone will pick up and voyage east to escape the encroaching Sun.No-Man's-Land\nNo-Man’s Land is the open desert that sits between the last livable oases on Earth. Use it to quickly travel between adjacent oases, provided you bring enough water on your Walker. You can safely log off here – the endless dunes allow you to hide your walker and mobile base if you want to go to sleep or just catch a breath.Melee and Walker Combat\nDynamic skill-based directional melee combat. Pick your weapon from a range of one-handed or two-handed swords, maces, axes or quarterstaves. If you prefer to hammer your opponents from a distance, you can choose to fight with a wide range of onboard weapons like ballistas, scattershot guns, repeaters, or catapults. Specialize in one or become a more versatile fighter by trying to master them all.Building Bases\nConstruct portable bases or more permanent fortifications. Protect yourself from hostile players and natural dangers of the world. Stone walls offer superior defense, while lighter wooden structures are able to be packed on large Walkers and relocated.Solo Experience\nIndividuals and small groups of players are the backbone of Last Oasis. Trading, hunting and harvesting allows anyone to acquire better equipment or sell goods for profit. For those who prefer a more high-risk, high-reward lifestyle, piracy is always an option, but beware of payback.Clans and Warfare\nBecome a political and economic power. Control a region and get rewarded with a supply of local resources gathered there by roaming Nomads. Grow your clan and make alliances to maximize and protect your income. Always be ready for conflict – hostile clans will challenge your control and come to take away everything you’ve built.Grappling Hook\nMaster the vertical movement. Every Nomad owns a grappling hook – the most essential and iconic tool of those who drive walkers. Adapt it to your playstyle. It’s all about your skill: some struggle to climb the smallest rocks, while others swing through forests outspeeding even the fastest Walkers. Can you defy gravity?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Donkey Crew","platforms":[{"id":0,"name":"PC"}]},{"id":17081,"name":"The Banner Saga: Factions","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a2/7a28389c05573904aa575d278ed60a3b.jpg","description":"The Banner Saga: Factions is the premiere multiplayer role-playing strategy game on PC and Mac. It brings the feeling of beloved tactical games to a high-definition era with gorgeous hand-animated artwork and a degree of depth unprecedented in the realm of free games. Fight, learn, and lead your clan of vikings to glory!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Stoic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13190,"name":"Okhlos: Omega","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/184/184b5812db922b4380d7c9e27a5c1b21.jpg","description":"Olympus EditionOkhlos: Olympus Edition includes a digital Encyclopedia, a collection of Okhlos prototypes, and the original soundtrack by A Shell in the Pit.\nAbout the GameSqueeze into your toga and slide on your sandals to rally the angry mobs of Okhlos and bring down the oppressive gods of mythological Greece! Your beloved people will not longer stand for the abuse from their deities and take up arms against them and taking down anything and everything in their path. Topple the beastly minotaur, bring down sacred temples, and confront the almighty Olympians themselves while recruiting and balancing your unruly mob with warriors, peasants, slaves and even livestock in their quest for freedom from Mount Olympus! It’s total anarchy in the birthplace of democracy!The people are angry and have united behind the noble philosophers to do their bidding to take down the soldiers, mythical beasts and temples under the control of the twelve vile gods.Carefully recruit your followers from warriors, peasants, slaves and beasts of burden and unlock special units or swap units for one of 100 legendary heroes to upgrade the mob and increase their savagery. Wield the power of Heracles, Leonidas, Pandora, and Socrates to turn your mischievous gang into a formidable army!Every campaign against the gods is different with changes to heroes, monsters, and bosses – and even the mob itself – each time you and your followers set out for battle. Traverse eight procedurally generated Greek cities and never fight through the same world twice!Make your way through all manner of beasts, warriors, and demi-gods to arrive at the feet of the maleficent Olympians and unleash the power of the people in epic boss battles set against ancient ruins before they were ancient!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Coffee Powered Machine","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2289,"name":"Kero Blaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ce/5ce17393fdcd1a4356187e388fa21723.jpeg","description":"From the creator of Cave Story comes Pixel's latest work; Kero Blaster.\nThe C&F Inc. teleporters are going offline all over the place, and it's up to an intrepid frog employee to fix the situation.\nA classically-styled 2D side scrolling action game packed with adventure.\nYou are a bipedal frog and a master of the Custodial Sciences, charged with the unenviable task of ridding your company's teleporters of strange black creatures.\nFight for your life through a menagerie of unique monsters while getting your hands on exciting new tools of the trade.\n2017/3/21\nMultilanguage support!\nAlso, there are FREE games with same characters available on STEAM too!\nPINK HOUR and its sequel, PINK HEAVEN.\nPlease try them for the system test of Kero Blaster.\nPINK HOUR:\nhttp://store.steampowered.com/app/409670/\nPINK HEAVEN:\nhttp://store.steampowered.com/app/409690/","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ACTIVE GAMING MEDIA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":59155,"name":"Astro Bot Rescue Mission","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/234/234bdec585c2eb952792bf7bde47d4d2.jpg","description":"ASTRO BOT Rescue Mission is a brand new platformer, developed exclusively for use with PS VR. Take control of ASTRO the captain BOT and go on an epic VR rescue mission to save your fellow Bots who are dispersed all over space.\nDUALSHOCK®4\nPlayStation®VR Required\nPlayStation®Camera Required\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2018 Sony Interactive Entertainment Inc. Astro Bot Rescue Mission is a trademark of Sony Interactive Entertainment LLC. All trademarks are the property of their respective owners. Appearance in this\ngame does not imply sponsorship or endorsement.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":20915,"name":"Terra Lander","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f20/f209523065ececd5327540fe066b4c60.jpg","description":"Terra Lander is a homage to the classic early days of arcade retro, we hope you enjoy!\nNavigate the player to the landing pad through twenty increasingly difficult levels within the time limit and with enough fuel. Movement or firing uses up fuel though levels can be replenished by shooting the fuel dumps. Running out of fuel means you loose control and can't fire. If all fuel dumps are destroyed on any given level the player's fuel tank capacity is doubled for the next level (this does not apply to starting from the highest level reached).\nAvoid the moving doors and increasingly fiendish enemies, find the switches for the doors that block your way.\nWhen a life is lost the player is temporarily shielded against enemy fire, this is represented by an electrical circular field around the lander just after it is respawned.\nDon't touch anything - that would be fatal!\nBe careful though, loosing a life resets the current level and loosing the last life ends the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DM Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":13086,"name":"DEADLOCK","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f46/f4658add0a9aae824f438ccfafa73eb7.jpg","description":"In DeadLock, the player must connect the processor (circle) and the resources it needs (square) in the appropriate order to end the processors without falling into a \"deadlock situation\" where all processors wait for the other processors to finish. More and more targets need to be scheduled and new kinds of resources appear.Key Features :\nSpeedUp mode for quick viewing of connections\nPause mode that allows you to think on the spot if you're wrong.\nelaborately crafted puzzles.\nComfortable pastel tone color\nThe answer is not one! What is the most efficient way to connect?What is Deadlock?\nDeadLock is a game created based on the 'Deadlock' that occurs in real computer systems.\nIn fact, each processor has the resources it needs, and the processor does not return the resources it previously occupied until it occupies all the resources it needs.\nIn this situation, when two or more processes wait for each other for resources occupied by another process, it is called a 'Deadlock'.Controls :\nif you click on the processor(circle), you'll see the color of the resources(square) you need below, drag them to the resources you want to connect!\n'space' : Pause / Play\n'R' : Restart\n'ESC' : Menu","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Skunkape Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":490430,"name":"Prince of Persia: The Sands of Time Remake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b92/b92b55aeab9ed1777104f71f4b22a613.jpg","description":"The Prince has returned! Experience the classic tale that redefined action-adventure gaming in this full-scale remake for a new generation.\n\n- You are the Prince of Persia. Embark on a journey to save your kingdom from the treacherous Vizier.\n- Master the Sands of Time and use your dagger to reverse, accelerate, freeze, and slow time itself.\n- Fight cursed enemies and solve puzzles along the way.\n- Experience incredible graphical enhancements and re-designed gameplay mechanics.\n- Unlock Prince of Persia, the original game from 1989, along your journey.","review":"","timePlayed":0.0,"releaseYear":2026,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":375231,"name":"Mini Motorways","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a5b/a5bfc1535a634a02ab0928549272d533.jpg","description":"Have you ever been stuck in traffic and wished you could do something to fix it? In Mini Motorways, the city’s traffic problems are in your hands.\r\nFrom the makers of Mini Metro, Mini Motorways is a game about drawing the roads that drive a growing city. Build a road network, one road at a time, to create a bustling metropolis. Redesign your city to keep the traffic flowing, and carefully manage upgrades to meet the changing demands. How long can you keep the cities of the world moving?Key FeaturesDynamically growing cities that make every game unique!\r\nStunning maps visually inspired by cities all around the world for you to explore.\r\nA variety of upgrades help you meet the demands of your ever-expanding road network.\r\nDifferent color modes to choose from, including colorblind and night modes.\r\nResponsive, relaxing soundtrack that grows with your city, created by Disasterpeace.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Dinosaur Polo Club","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":52337,"name":"Them's Fightin' Herds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc8/cc851f5962b7e3a07ec6ae76d61c82cc.jpg","description":"Special Offer\nOwners of Blazblue Centralfiction on Steam automatically unlock exclusive Jin and Ragna Cosplay cosmetics for all characters in Pixel Lobby.\nOwners of Skullgirls Second Encore on Steam automatically unlock exclusive cosmetic items for the Pixel Lobby: Cerebella's Hat Vice Versa, And Peacock's Hat and Bomb minion George.\nOwners of GUILTY GEAR Xrd REV 2 on Steam will automatically unlock exclusive cosmetic items in the Lobby: Sol Badguy's Outfit/Hairstyle, and Ky Kiske's Outfit/Hairstyle, for all characters.\nAbout the GameThem’s Fightin’ Herds is a 2D Fighting game featuring a cast of 4-legged combatants! Beneath the cute and cuddly surface designed by acclaimed cartoon producer and developer Lauren Faust, a serious and mechanically deep, GGPO-powered fighter awaits!\nAs an additional thank you to Skullgirls and their playerbase for supporting us by letting us use the Z-engine via their crowdfund goals, owners of Skullgirls on Steam get an additional discount when purchasing the game. THANK YOU SO MUCH!\nThe full main story will be delivered (FOR FREE) in regularly released episodes after Full release launch, focusing mostly on one character each, along with many unique unlockables, target mode courses and hidden fight scenarios.GAME FEATURESVisual Pixel Lobby: Online multiplayer lobby system uses the same style of overworld as Story Mode to allow all players to explore (read: goof around in) locations within the world of Foenum with other players. Customize your avatar with cosmetic items you collect through Story Mode AND Multiplayer PVP/PVE gameplay!\nDynamic Music System: Rockin’ character themes that adapt in the heat of the battle makes every fight a treat to the players AND the spectators.\nGGPO powered netplay for the smoothest possible fighting game experience.\nMore fighters are on the way, introducing more playstyles to the roster! Each fighter DLC release will include additional unlockable cosmetics, modes and character specific story mode expansions.\n4-button Fighting: A-Light, B-Medium, C-Heavy, D-Magic.\nMagic System: Emphasize your character’s special abilities through a dedicated button and a unique resource.\nJuggle Decay: Opponents become gradually heavier during a combo, but ONLY after the juggle decay bar is filled. This manages combo length without imposing a hard limit. In addition, filling the juggle decay bar prevents standing infinites by removing the opponent's ability to remain standing for the rest of that combo.\nEnhanced Super Attack: Spend an additional meter to add utility to your main super attack with effects that stay true to the characters’ unique personalities and talents!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mane6","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":21716,"name":"Clergy Splode","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e4c/e4c491013298fd3e912d191b686d9952.jpg","description":"Features:★Collect bombs, power-ups and gain power from the heavens.\n★Level up and grow more powerful - Level up by...... you guessed it! Blowing stuff up!\n★Build up awesome bomb-combos.\n★Progress through different levels by completing the requirements.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PiGravity","platforms":[{"id":0,"name":"PC"}]},{"id":17785,"name":"Death to Spies 2: Moment of Truth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74c/74c7ec3b4aacad44d886c12441d1cbdf.jpg","description":"The Most Mysterious Secret Service Agency of WWII\nThis is a third-person stealth-action game describing the activities of the SMERSH, the most mysterious secret service agency of World War II.\nMoment of Truth is a sequel to the popular stealth action title Death to Spies. The game's main character is Semion Strogov, a captain in the 4th department of the Soviet counterintelligence service called SMERSH (a Russian acronym meaning \"Death to Spies\").\nThe hero possesses the skills to accomplish dangerous missions that include gathering information on the location of hostile military and civil units and assassinating enemy agents, including the Wehrmacht's high-ranking officers. His task is to capture spies and saboteurs and gather information about their actions using unique technologies and devices.\nBrand new missions located in Western and Eastern Europe, USA, in the UK and the territory of the former USSR\nNew vehicles and weapons\nEnhanced animation and visuals\nNew graphic effects: new landscape texturing with higher resolution and bump mapping effects, updated rendering with HDR and dithered shadows\nImproved interface\nMoment of Truth contains a lot of improvements based on the game community's requests","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Haggard Games","platforms":[{"id":0,"name":"PC"}]},{"id":14547,"name":"Deadly 30","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39c/39c349109a975c64617dac4e5663f5fa.jpg","description":"Can you survive the horror?\n… a retro-style survival horror game developed by the two-man indie team of Gonzossm and Iggy Zuk. Survive 30 days and nights in a zombie-infested world by recruiting companions, upgrading weaponry and fortifying your position.\nDeadly 30 is a retro-style survival horror game developed by the two-man indie team of Gonzossm and Iggy Zuk.\nSurvive 30 days and nights in a zombie-infested world where you can recruit companions, upgrade weaponry, and fortify your position to fight waves of hungry zombies. During the day, you can gather resources, enhance your base's defenses, and explore your surroundings for useful items in order to prepare for fighting relentless waves of zombie attacks. (Hint: Don't get caught outside your base after dark.)\nThree different playable characters, A.I. controlled Team Combat and upgradeable weaponry and defenses help keep you alive as you attempt to eradicate the zombie hordes and survive 30 deadly nights.\nGood luck! (You'll need it when all hell breaks loose.)\nFeatures:\nElements of tower defense and retro Contra style gameplay.\nThree different characters, playable at the same time.\nA.I. controlled team combat\nUnique upgradable weaponry for each of your soldiers.\nEnhance your base for better defenses.\nGruesome different enemies and deadly weapons.\nTactical planning is required or you will learn to fear the dark!\nNote:\nFullscreen mode and achievements only supported in PC version!\nCheck out the artist who created all of these nighttime terrors at: http://www.youtube.com/user/Gonzossm\nOr the crazy mind of Iggy Zuk, who created this indie-horror masterpiece at: http://www.IggyZuk.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ignatus Zuk and Gonzalo Villagomez","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4137,"name":"Knytt Underground","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23f/23f0e6329c5a9aaffd04930c5a751648.jpg","description":"Knytt Underground is a 2D platformer with a heavy focus on non-linearity, exploring the world, and replayability.  It is the part of the Knytt series and the restart of the IP. \n\n###Gameplay\nThe player explores a vast map by running and climbing surfaces. There are second to none enemies and hostile NPCs. Rooms bound the world in the title. There are a total of 1800 rooms in total. The protagonist can take quests from NPCs and explore the game's world according to his likings.\n\n###Plot\nThe depicted actions take place on the planet abandoned by humans 500 years ago. The player follows the adventures of Mi Sprocket in the world inhabited by sprites, fairies, and other fantasy creatures. She does not talk, so everyone confuses her request for making a wish to the local shrine for saving the world. She sets off on the adventure with two fairies of her kind: Cilia and Dora. Fairies have different personalities so it matters which one is sent to talk with NPCs as it may affect the outcome of the negotiations. \nThe foremost fairies' quest is to find Six Bells of Fate — only after ringing the all would there be a world's order and the destruction of the universe would be canceled.\nKnytt utilizes breaking the fourth wall with exploiting favorite game clichés — disguising in-game characters as the real people and making fun of the main quest which seems to have no meaning.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nicklas Nygren","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PS Vita"}]},{"id":345,"name":"Death Road to Canada","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1c/e1c6229f98a42b082d911fdcf27615bd.jpeg","description":"Death Road to Canada is a Randomly Generated Road Trip Simulator. You control and manage a car full of jerks as they explore cities, recruit weird people, argue with each other, and face gigantic swarms of slow zombies.\nDeath Road is built for replay value. Everything is randomized: locations, events, survivor appearances and personalities. There's a different story every time you play, set in a world that doesn't take itself too seriously.\nDeath Features:\nUp to 500 zombies can hunt you down at a time. Fight them, try to squirm past, or run.\nUse the character creator to put yourself, friends, and family in the game. Have them show up at random to get eaten!\nFind special and rare events, weapons, and characters with strange abilities.\nMake tough choices in Interactive Fiction events. Get different options and results based on the traits of your party members.\nTeach a dog how to drive a car.\nThrow chairs. Get your characters strong enough to throw large sofas.\nMost family friendly zombie apocalypse game on the market! Any gore explosion is in a cute style. We censor the word d*ngus once.\nTell people to \"Cool it.\"\n2 player local same screen co-op where you control up to 4 characters!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":299557,"name":"Emily is Away <3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2f/a2f03870ceee20dbd0335d9389302a40.jpg","description":"It's 2008 and AIM is Dead.Better sign up for this Facenook thing everyone's talking about.Customize your profile.\nAdorn your profile with your favorite movies, shows and bands. Craft your early 2000's online persona.Explore Facenook.\nWall posts, tagged photos and poke wars. Emily <3 is full of nostalgia inducing gameplay.Chat with friends.\nEverything your character says is up to you. Build up your relationships up, or burn your friend group to the ground.Finish your Senior Year.\nEmily <3 features multiple branching paths, unique conversations and different endings. All of them depending on the choices you make.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Kyle Seeley","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":29908,"name":"Another World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b43/b43e17890809393784c90116434ee7f3.jpg","description":"A young physics professor named Lester conducts a particle experiment. Suddenly, something goes wrong, a lightning strikes, and in a moment Lester finds himself in a strange alien world. Now he must fight for his life, first with his bare hands, then with a gun he finds. But what gives him courage is that he is not alone. One of the aliens who escapes from the prison together with him helps him on his dangerous quest. Friendship can overcome all the obstacles.\n\nOut of This World combines shooting, platforming, and puzzle-solving elements. The game is divided into stages; some of them are straightforward and can only be accessed one time, while others are connected to each other, constituting a larger environment. Exploration and problem-solving are emphasized. Many levels include challenges not seen in the previous ones. Tasks may involve environmental puzzles, timed sequences, precise jumping, and combat.\n\nTypically, enemies are defeated by using an energy gun found in an early stage. The gun's regular function is shooting energy projectiles. By pressing down and holding the fire button the player can activate an energy shield which protects Lester from regular attacks, allowing him to fire from relative safety until it evaporates. Finally, by holding the fire button even longer the gun creates powerful blasts which can disrupt shields. Most enemies are equipped with similar guns and are able to perform the same actions as Lester. Fighting enemies therefore requires tactical usage of regular attacks, shields, and bombs, as well as learning enemy patterns.\n\nEach level can be accessed by typing a code the player learns after having completed the level. If Lester dies, the level must be restarted. There is no on-screen interface and no in-game dialogue in the game. Vector graphics are used for creating the game's environments and animated cutscenes.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"DotEmu","platforms":[{"id":0,"name":"Apple II"},{"id":0,"name":"Jaguar"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"SNES"},{"id":0,"name":"3DO"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"}]},{"id":19634,"name":"Incoming Forces","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/853/85338d1de80a4b52875e8283f81323b8.jpg","description":"Prepare for one of the most action packed-shooters in PC gaming history! Every level is full of enemies and targets for you to destroy! In the first game you will battle alien forces intent on wiping out the Human civilization. As a soldier you will use various vehicles and defend vital bases on Earth against the invaders' forces. In the second one you will become a soldier of the alien species and protect your home world from the forces of the Human armada.\nBoth games were famous for fast-paced action, hordes upon hordes of enemies and incredible, cool and satisfying gameplay – this pack is perfect both for hard core action shooter gamers and “Sunday school” casuals. Tons of fun included.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rage Software","platforms":[{"id":0,"name":"PC"}]},{"id":17474,"name":"Killing Floor - Toy Master","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/726/72635157dc5253888a1c94b6b9219443.jpg","description":"This mod needs the full game of Killing Floor to playIf you don't already have Killing Floor, get it here:\nhttp://store.steampowered.com/app/1250/\nAbout the GameIn a free, add-on mod for Killing Floor, created by David Hensley (with help from Killing Floor originator, Alex Quick), you can fight off the bizarre and warped toys of someone's nightmare, that are hell-bent on finishing you off. All the standard Zeds are replaced with evil toys, set in the Devil's Dollhouse map.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Alex Quick","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15941,"name":"SanctuaryRPG: Black Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0e/c0e4bf570d2a52c81f945c87430d67a8.jpg","description":"As the world's first fully-ASCII game to grace the Steam platform, SanctuaryRPG: Black Edition is a humorous and strategic turn-based dungeon crawling adventure. Drawing heavy inspiration from both Roguelikes and Japanese RPGs, the game was meticulously designed to offer a truly compelling role-playing experience complete with a robust action-rpg inspired combat system.\nBlack Edition builds upon the classic SanctuaryRPG formula with all new procedurally generated artwork, as well as a plethora of areas to explore, races to experiment with, skills to master, and loot to collect. Whether you're a valiant hero or a dastardly villain, the fate of Sanctuary is in your hands.\n—Features:\nEnjoy a blast from the past with retro ASCII graphics\nTravel through vast dungeons with classic roguelike action\nExperience hundreds of hours of immersive gameplay\nPut your strategies to work with a sleek combat system\nOver 160 class and race combinations to experiment with\nWreck your enemies with over 1400 weapons and armors\nRock out to an original 8-bit chiptune soundtrack","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Black Shell Games","platforms":[{"id":0,"name":"PC"}]},{"id":13377,"name":"Eaten Alive","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6a/a6abc0cbddb39f59602e00a7fc05bcfe.jpg","description":"Don't get Eaten Alive!\nExplore downtown Boston and the surrounding areas six years after the apocalypse.\nPoint and Click your way through multiple areas including - The city, abandoned buildings, parks, the cemetery, pitch black sewers, the library, the medical research facility and more.\nStay alive or you're dead for good. Eaten Alive uses a perma-death system, there's no loading or saving. You have one life.\nDecide your own fate, make choices and try to stay alive.\nFind and help other survivors, loot them, kill them or just insult them, it's your choice!\nFind and collect records, use them at the jukebox and enjoy original music.\nEaten Alive has an awesome original soundtrack composed by the super dude Felix Arifin.\nJoin Jim Sterling in his apartment and play video games(mini-games)\nEnjoy 3 awesome mini-games.\n\nThe Steam version of the game comes with the Original Soundtrack included.\nCheck out the soundtrack and other work by Felix Arifin here:\nhttps://felixarifin.bandcamp.com/album/eaten-alive-official-soundtrack","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Space Cat Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21793,"name":"Cult of the Wind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2a/a2a4ba7b4e0de8f60f0a35c970f4b884.jpg","description":"Cult of the Wind is a game about people who pretend to be airplanes.\n\"In an unknown time and place, a cult that worships the wreckage of ancient airplanes gathers to mimic the dogfights of old. With the peak of humanity far behind, their world is a mausoleum to a lush and verdant Art Deco past.\"\nIn Cult of the Wind, players compete and cooperate in ritualistic multi-player human dogfights, complete with imaginary weapons, pretend explosions, and airplane noises made with their mouths. Shower your friends in a hail of imaginary bullets and proclaim, \"I got you! You have to lie down,\" to which they respond, \"Nuh-uh, I have a shield.\" You argue about whether or not airplanes can have shields, meanwhile some other guy does a cannonball onto your head while whistling. It's great.\nWith an intuitive point-and-click level editor you'll be able to craft new levels or modify existing ones, then immediately share them with anyone on a server, even if you aren't the host. You can also craft a personalized appearance for your character with numerous articles of clothing and more.\nSimple, robust level editor\nInstantly share your creations with others\nCharacter customization\nDozens of imaginary weapons and abilities\nInfinitely expandable content\nBlindingly high-speed mock combat\nWeird noises","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"North of Earth","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]