[{"id":19611,"name":"Port Royale 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dff/dff8384207920deb1ff27a089cedfa5c.jpg","description":"The Caribbean in the 17th Century - Trade with over 60 towns, create your own production facilities, expand your trading empire and influence the development of the New World.\nAs pirates and military fleets threaten your trade convoys, you'll need escort ships. Or you can turn the tides and hunt for pirates and capture the military ships yourself.\nTake on missions for merchants, diplomats and other characters. By taking on the daring missions of the Vice Kings, where you are to attack and conquer enemy towns, you will be able to influence the defenses of your home towns directly. As a sign of gratitude you will be awarded land, to be used later to build and oversee your own towns.\nHuge game world with 4 nations and 60 towns\nConstruct production facilities, houses and special function buildings to help your towns flourish\nCreate your own towns\nStronger consequences in wars (towns can be conquered)\nIntroductory scenarios to describe all important features of the game\n8 special scenarios for a quick and easy start into the Port Royale 2 world\nOpen ended game with endless detail and game depth\n16 different ship-types","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"ASCARON Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19418,"name":"Europa Universalis: Rome - Gold Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/587/5870e2c822e51b950ea8da529e788b82.jpg","description":"Europa Universalis Rome Gold combines the epic strategy title Europa Universalis Rome with the expansion pack Vae Victis.\nExperience one of the most defining periods in world history in an experience crafted by the masters of Grand Strategy. The greatest cultural and military civilizations are brought to life through this epic title rife with great strategic and tactical depth.\nSet during the golden age of the Roman Republic when the Senate ruled the Empire, Vae Victis features a massive number of additions and improvements to Europa Universalis: Rome, a game that was already one of the most prominent to depict that era in the widest scope. An overview of these key changes begins with government, which has received a lot of attention for the expansion in order to produce more fluid and balanced gameplay. The cast of historical characters of the ancient world have also had a significant overhaul across a variety of areas and with the addition of missions, decisions and laws, Vae Victis is an expansion packed with a huge amount of new content.\nKEY FEATURES\nFully 3D map with integrated graphics and detailed topography\nStart at any date between 280 B.C. and 27 B.C.\nChoose between 10 different cultures, including the Roman, Celtic, Greek and Egyptian civilizations, with more than 53 playable factions on a map spanning hundreds of provinces.\nWatch your characters develop new traits through political intrigue and various interactions with thousands of other characters.\nTrade, negotiate or fight with your neighbours and advance your technologies to unite the Mediterranean World.\nRobust multiplayer allows you to challenge up to 32 players either competitively or in co-op mode.\nNEW KEY FEATURES IN VAE VICTIS\nCompletely revised military AI, particularly in the area of military campaigns\nDynamics of the characters that live in the Republic will come to life as the men and women have their own personal goals and agendas\nAs a republic you will now need to take the Senate into the account. Characters will belong to various parties depending on their goals, values, and ambitions\nMonarchies and Tribes will have their own courts, beware of bootlickers and sycophants who will stop at nothing to replace your divinely appointed ruler\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18660,"name":"The Adventures of Mr. Bobley","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2a/b2a19dabace4558068406a7df7adc4e3.jpg","description":"Summary\nThe Adventures of Mr. Bobley is a 3d platformer adventure game featuring physics based puzzles and challenges that also require you to drive vehicles and operate heavy machinery. Set at a skyscraper construction site, the game’s goal is to climb ever higher and higher. The game is all about physics and interaction with the environment.\nCharacter\nMr. Bobley is just your average construction worker who arrives to work in the morning only to find intricate puzzles to solve. He has to prove his skills in a hazardous construction site environment. To advance in the game he has to figure out how to use various kinds of construction machinery to his advantage.\nGame mechanics\nWhile the game looks almost like a 2d platformer, the character can walk in any direction. The camera view is locked overlooking the scene at a constant angle. Even when driving vehicles the camera angle remains unchanged. To aid the player in orienting themselves in 3d space, small graphical help is provided in the form of a jump distance indicator and a picture-in-picture window.\nLevels\nThere are 24 levels in the game. Each level has several puzzles that you need to solve in order to advance to the next puzzle. Level design can be quite complex because there are usually multiple floors in one level. Higher floors become transparent to prevent blocking the player’s view. Nonetheless, the player always knows where to go because the exit is always to the right and upwards. This is yet another game mechanic taken from classic platformer games.\nPuzzles\nAll puzzles are based on physics interaction with the environment. You have to drive cars, trucks, fork-lifts and tipping lorries. Use cranes and elevators to push, haul, lift and transport objects as necessary to overcome challenges and get obstacles out of the way. You also need to build bridges and make stairways. There are also various minigames like maze puzzle, escape run, even a soccer match.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jan Zizka","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9760,"name":"Hot Dogs, Horseshoes & Hand Grenades","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fe/8feeadd2e929029313824311b8c86cdb.jpg","description":"Do you like hotdogs? How about horseshoes? Hand grenades? (everyone likes hand grenades) Anyway, we got all that, and guns. So if you like cooking, lawn games, and ordnance, this is the VR sandbox game for you.\nHot dogs, Horseshoes and Hand Grenades is a lazy Sunday trip over to your friends house… if your friend was a retired gun-nut with a warehouse full of toys, a few irritating robot pets, and a grill that’s always running. Head on over to the firing range and learn to operate an arsenal full of firearms, compete in structured challenges with global leaderboards. Relax next to the grill, preparing virtual meats, while fending off the ‘wild life’. Or have some friends over and take turns playing classic ‘murican lawn games while making an ass of yourself!\nH3VR(for short), is the heaping pile of our mad obsessive VR experiments. This is very much an impressionistically developed experience, so expect it to mutate, expand, contract, somersault, and occasionally explode along the way to final release.Key Features:Roomscale VR Experience designed for the HTC Vive.\nMultiple shooting and demolitions ranges from realist to fantastical.\nTimed challenges with global leaderboards.\nAlmost 100 accurate simulations of historical, modern and futuristic weapons.\nAuthentic ‘Murican BBQ experience with obsessively detailed grilling simulation.\nHot-seat(or hot-headset rather) multiplayer classic lawn games like horseshoes, bocce, lawn darts and more.\nAn detailed rusty scifi world set in a surreal irreverent vision of the future United States of ‘Murica.\nAnd whatever other madness we see fit to add!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RUST","platforms":[{"id":0,"name":"PC"}]},{"id":741652,"name":"LOST EMBER - VR Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/887/887b395f3f9717c24b27b5629426c0b2.jpg","description":"Note: Owners of the original version of Lost Ember will get free access to the VR version.\nThe VR Edition of the acclaimed indie adventure Lost Ember!\nA breathtakingly beautiful world holds the secrets of its past for you and your companion to uncover in this 5-hour journey.\nExperience the contrasting stories of the fall of mankind and the lush life in a world reclaimed by nature with a wolf as your main character and a determined companion at your side.\nExplore the land, sea, and air, as you possess any creature you come across to experience life from a whole new perspective. Fly through gargantuan canyon valleys as a parrot! Tumble through the grass as a wombat! Swim through shimmering lakes as a fish! Your journey will take you from densely wooded jungles, to lush rainforest canopies, to barren desert plains and archaic temples.\nUltimately, you'll discover a tale of loyalty, despair, and betrayal, as echoes of the lost Yanrana culture come to life in a lush wilderness devoid of man.\nNote that Lost Ember does not support motion controls and is best played with a normal gamepad.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Mooneye Studios","platforms":[{"id":0,"name":"PC"}]},{"id":59349,"name":"The Settlers - New Allies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b57/b5742a425c87b581e680a13b1cc44152.jpg","description":"Twenty-five years after the release of the first Die Siedler game, the world-famous building strategy series returns to the big PC stage. Under the leadership of Volker Wertich, the inventor of the series, the players in the world of The Settlers experience new, exciting adventures.\r\nAfter a devastating earthquake of mysterious origin forced to leave their homeland, the settlers set sail for a journey into the unknown, hoping to find a new home. Not only will you have countless challenges to overcome, but you will also become part of an ancient mystery that will change your life forever.\r\nIn The Settlers explores, colonizes and conquers new islands embedded in a believable, medieval-inspired fantasy world.\r\nA REBOOT OF THE BRAND\r\nIn The Settlers, the best modernized game elements in the series combine with brand new features such as the new food system or a motivating metagame to create a unique new gaming experience. The campaign can be played solo, as well as cooperative, with arbitrary side missions.\r\nONLINE MULTIPLAYER\r\nVarious multiplayer modes provide exciting skirmishes among the players and provide limitless long-term fun.\r\nTHE LOVE FOR DETAIL ON A NEW LEVEL\r\nNever before, The Settlers was so buzzing, detail-loving and emotional. Every step in the production chain, every single product is visualized. Thousands of settlers follow their daily routine on every map and inspire the player with manifold emotions.\r\nSTATE OF THE ART GRAPHIC\r\nThanks to Ubisoft's own snowdrop engine, which is used by The Division among others, Die Siedler sets a new visual benchmark in the build-up strategy genre.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":51673,"name":"Shenmue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c11/c1194278356d6ef0b65722610f618e5c.jpg","description":"An action-adventure game set in 1980s Japan that follows one young man's journey to avenge his father's murder. It was praised for its ambitious scope and pioneered several gameplay features such as realistic open-world environments and Quick Time Events.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"SEGA","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"PC"}]},{"id":17951,"name":"RoShamBo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24b/24b8a1472f5ad69ebac8f8b6deb9949e.jpg","description":"OVERVIEW\nWelcome to RoShamBo arena! A brand new FREE arena fighting game, based on a classic rock-paper-scissors! Choose your character out of dozens unique looks, customize your gear, fight other players, knock their teeth out and become the best in RoShamBo Arena!THE GAME\nIn RoShamBo Arena you’re presented as an arena fighter, who can defeat opponents by choosing one of three punches – rock, paper, or scissors. The one who wins after selecting the shape kicks the other. During the fight each kick will reduce the amount of health points, and the one whose health drops to zero loses. Besides standard kicks you can use one of three special skills, that can heal you, give a boost in attack power, reflect your opponent’s kick and many more. Each character has his own bunch of special skills, which makes your unique. You can compete with other players in real-time in different modes, like duels, tournaments, group fights and clan wars in future updates. In campaign mode you can fight bosses and ordinary fighters to get experience, valuable loot, gear and even more. Get teeth, obtain or buy gear, equip it and fight stronger enemies to get higher in your league.KEY FEATURES\nReal-time arena fighter . Defeat other players in real-time 3-minute arena fight, choosing one three punches – rock, paper or scissors.\nDozens of unique characters. Choose your own character and way him to victory in each battle. Every character has up to 3 unique skills and unique fun animations.\nHundreds of unique gear. Get the best gear in the game, equip it to increase your stats and defeat your enemies.\nSimple and addictive gameplay. Choose rock, paper or scissors. The one who wins, kicks.\nUnique and fun special skills. Besides the rock, paper or scissors you can choose one of three special skills during the fight. Each skill will get you closer to victory, but be attentive. The enemy has his own bunch of skills too.\nCharacter customization. Level up and configure your stats to your own preferences. Create your own unique damage dealer, tank, or support character.\nTeam fights up to 3x3 players. Any player can compete with others together with his friends (up to 3 players, competing each other).\nAchievements. In-game achievements, that set you new heights goals every level.\nSocial features. Find player to co-operate and go to victory together.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blam! Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14613,"name":"Onikira - Demon Killer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07a/07ab1e2ff61adf9f9884092286192c15.jpg","description":"Contributor's Pack\nWe would like to offer a special Contributor’s Pack for our supporters. The pack includes bonus downloads from Digital Furnace Games.\nIncluded in the Contributor’s Pack:\nThe Onikira Soundtrack: Immerse yourself in the beautiful sounds of the world of Onikira.\nDigital Artwork from Digital Furnace Games: Explore bonus art work from developers, Digital Furnace Games.\nAn Extra Key for a Friend: Share your appreciation for the game by giving a free key to a friend!\nAbout the Game\nDeveloped by Irish-based indie, Digital Furnace Games, Onikira: Demon Killer is an awesome side-scrolling, 2D beat’em-up set in fantasy feudal Japan. As Yamazaki Jiro, a lone samurai, players battle to prevent the forces of the Japanese underworld, Yomi, from consuming the land of the living.\nOnikira: Demon Killer blends together complex deep fighting mechanics usually found in traditional 3D beat-em’ups, like Ninja Gaiden or Bayonetta and merges them with classic 2D platform-game mechanics. Onikira’s expressive fighting system enables players to engage in whichever way suits them best. Some players will prefer to go toe-to toe with heavy weapons and mash buttons while others will opt for a ranged game style, avoiding heavy melee encounters. Try launching an enemy into the air, wall jumping to position yourself above them then Katana Slaming them into the ground. Switch weapons to the Naginata and use the Naginata Lift and air dash moves to stay in the air and off crumbling platforms, while pulling enemies up to you to be dispatched in mid-air. Whip out your grappling hook to grapple between platforms, across chasms or fiery pits, all the while fending off enemies.\nOnikira: Demon Killer boasts seven challenging areas and players can express themselves with over forty uber-cool moves, using four devastating weapons. Each level is littered with foul demons that players must dispatch back to the underworld and players must also face two mini-bosses and two epic mega bosses. Every level is crammed full of environmental aids to help the player in combat encounters. Slice the support pillars off a building and watch it crush your enemies as it collapses, or use your moves to fling enemies into spikes, pits, or the path of moving deadly objects. Be careful though, as dropping a building on your own head is known to cause sadness!\nUnique high-level combat – Onikira mixes 2D platform game elements into the combat system to make something special. Moving platforms, wall jumping, wall running and grappling all serve to make for dynamic and emergent combat encounters.\nSeven Areas  – the narrative unfolds over highly polished and gorgeous hand-painted levels featuring rain drenched villages, destroyed opulent cities, mountaintop locations and an erupting volcano.\nMaster unique weapons  – Each weapon - sword, tetsubo, naginata or arm blades - has multiple unlockable moves which can result in massive combo chains when moves are strung together. Combo chains turn directly into score multipliers.\nResponsive and Expressive Combat System  – players are rewarded for strategic and skill-based fighting. Play flows naturally from move to move, allowing the player to create new combos that haven’t been designed explicitly by the developers.\nSoul Shop  – souls are the currency of Onikira. Use them to revive your health and trade them. At certain points inside each level, the player will find rifts into Yomi where benevolent spirits will trade moves for collected souls.\nChallenge Arenas  – players complete combat related challenges and improve their score and skill to gain achievements. The arenas are fully integrated into Steam’s online leaderboards.\nSpecific enemy types  – with their own unique vulnerabilities, every enemy emphasises a particular fighting style, like a floating, possessed Mempo mask that encourages the use of air game or a monstrously twisted high-ranking samurai, where hit and run tactics are the best way to stay alive.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Furnace Games","platforms":[{"id":0,"name":"PC"}]},{"id":9554,"name":"FreeStyle Football","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79d/79de65dc73bc3434a2ffd70615ef0d2e.jpg","description":"No Control, Just Play!\nFREESTYLE FOOTBALL\nIntroduction\nFreestyle Football is a team-based action football game that lets you experience the joy of football as it was meant to be played more easily and quickly through thrilling tension and a competitive spirit. With its combination of seemingly realistic but slightly exaggerated characters, a fantasy world filled with skills, and a realistic street football culture, it provides you with a completely different kind of enjoyment from other football games that you have tried.\nAbout this game\nFreestyle Football is a football game where you play using four players and one goalkeeper. During the game, you do not control all of the players simultaneously- rather, each player controls one player on the field.\nThere are three types of matches in Freestyle Football: fast-paced Battle Matches which allow you to experience the thrilling tension of not knowing when you might score while attacking and defending; Friendly Matches where you can play casual games with friends; and Single Matches for users seeking to escape from the stress of team gameplay and enjoy their own play time.\nAwesome features include:\nUse real-life football strategies and techniques as well as communication with other users for the ultimate team game play experience!\nTrain your own customized and unique characters to dominate the football field!\nA huge variety of over 50 skills including everything from realistic football techniques to exaggerated skills infused with fantasy!\nTrain even more powerful characters which are suited to your own gameplay style through the five-stage training system!!\nOffense, midfield and defense each clearly represent the characteristics of the position preferred by the player through further division into four positions each for a total of 12 positions\nEvaluate individual and team contributions to gameplay through the record and evaluation system where you need not only good attack and defense records but also assists, base points and killer passes in order to succeed!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Joycity","platforms":[{"id":0,"name":"PC"}]},{"id":3626,"name":"MotoGP 13","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e75/e758c140aef3ad21da45e9a5ba86754b.jpg","description":"2013 Riders, teams and tracks; both simulation and accessible bike handling with scalable aids; photorealistic graphics with TV style interface; ingame voice over by official MotoGP™ commentators;  first person elements such as the helmet view and 3D pits to put you in the rider’s shoes. This is MotoGP™13, the official MotoGP™ videogame: try Career Mode, rising from a Moto3™ wildcard to the MotoGP™ World Champion, or challenge your friends in Split Screen or Online Championship.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Milestone","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":801101,"name":"Symphony of War: The Nephilim Saga","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/15b/15b8d68293521f257f1514235ca16589.jpg","description":"Check out Tyrant's Blessing!https://store.steampowered.com/app/1520760/Tyrants_Blessing/\nAbout the Game\nAt the turn of the millennium, the world of Tahnra is headed for a reckoning. The long and bloody conflict of Veridian Succession left the Empire of Veridia scarred, its people subject to brutal hardships. Under the reign of Empress Florina, the vicious cycle seemed to be broken, until a rogue General abducted her from the capital, mustering his own armies and raising the flag of rebellion. You, a young academy graduate, will command an expedition against these forces… a conflict that will set off a chain of events and shake the very foundations of the world.\n2D Turn-based Strategy RPG\nSquad-based player army\nStory-rich 30-40 hour Campaign with huge replay value\n50+ Character classes for your troops\nMassive depth of tactics you will learn through natural play\nLimitless possibilities for how to build your characters and squads\nThe gameplay focuses on grand-scale operations, outwitting and out-planning the opponent, while individual battles are carried out automatically and are thrilling to watch unfold.\nManeuver squads of up to 9 soldiers across battlefields and seize the advantage by grabbing high ground, holding chokepoints, ambushing from the woods, and more\nPay attention to the weather, or fall prey to a sudden blizzard or heat wave\nLiberate  towns and capture resources to bolster your reputation  and sustain your armies\nBreak the enemy's morale, while maintaining your own\nEliminate enemy squad leaders to shatter their chain of command\nTactics win engagements. Logistics win wars. Once the dust settles, it's time to collect the wounded, rally the troops, and prepare for another battle in the long march to peace on Tahnra.\nAssemble squads from more than 50 unit classes, including heavy infantry, archers, shock cavalry, medics, arquebusiers, dragons, battle mages, and more\nOutfit squads with equipment and artifacts obtained through looting and victory\nNurture your conscripts into elite warriors, or hire mercenaries to instantly boost your army's fighting prowess\nResearch upgrades through your faction’s tech tree across a multitude of classes to specialize or generalize your troops for the job\nThe graduates of the Imperial War Academy were sent to quickly contain a rebellion, but became embroiled in a vicious plot far beyond what they could imagine.\nMeet friends, heroes, allies, and rivals from the many different factions across the world\nManage a dynamic relationship system, unlocking iconic conversations, unbreakable bonds, and powerful bonuses between your characters\nExperience an epic tale brimming with malice, treachery, and ambitions, as the fragile peace of Tahnra unravels","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Dancing Dragon Games","platforms":[{"id":0,"name":"PC"}]},{"id":505782,"name":"King Arthur: Knight's Tale","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/838/838f1eeb75bdd3f4a651e132e42e8c20.jpg","description":"You are Sir Mordred, the nemesis of King Arthur, the former black knight of the grim tales. You killed King Arthur, but with his dying breath, he struck you down. You both died – and yet, you both live.\nThe Lady of the Lake, the ruler of the mystical island of Avalon brought you back to end a true nightmare. She wants you to go on a knightly quest. She wants you to finish what you have begun. Kill King Arthur – or whatever he has become after she took his dying vessel to Avalon..\nA Role-playing Tactical GameExperience a unique hybrid between turn-based tactical games and traditional, character-centric RPGs! This dark fantasy version of the Arthurian mythology invites you to manage a team of heroes on the dangerous battlefield, while also engaging in moral choices, hero management, and the rebuilding of Camelot.\nThe dark fate of the kingdomExplore a land of nightmares where vile monsters and magical creatures lurk within castles and forests. The battle between Arthur and Mordred brought death, both of them falling at the hands of each other, and now the consequences unfold. Arthur, resurrected in Avalon, is now an undying mad king, his pain slowly turning this magical place into a nightmare version of Britannia. You are Mordred, brought back to life to find Arthur, and ultimately, kill him to end this accursed condition.\nThe Round Table rebornGather your knights and send them on quests involving deep, tactical battles! Assemble a team of heroes, selecting from six classes (Defender, Champion, Marksman, Vanguard, Arcanist, Sage). Level them up, gain unique skill points, equip the best items looted from missions. But beware! Heroes can die, and the treatment of their injuries, curses, diseases take time. Between missions, make sure that Camelot has the right facilities for recovery, and prepare different heroes for different quests.\nA question of loyaltyHeroes are your main resources – but no mere numbers! They have their own distinct personalities, goals, rivalries (even unique traits, skills and bond benefits). They will observe your decisions closely! Settle disputes, grant favours, select heroes who can work together, send them on missions they are comfortable with. Tread carefully, because their loyalty depends on many factors. They can even leave and turn against you!\nThe making of a monarchYou, as a king, have a personality as well, shaped by your actions and moral choices. The Morality Chart will represent your status between Christianity and Old Faith, between Tyranny and Righteousness. Your choices affect values on this chart, influencing both gameplay and narrative.\nThe weight of decisionsEvery small decision matters – not only the moral choices, but actions taken in the turn-based combat as well. The campaign unfolds with a roguelite twist: no reloads, only regrets! The thrill of dealing with the consequences is half the fun, but your decisions also affect the story. Each playthrough can unfold differently, branching in unexpected ways.\nThe end is only the beginningPlay through the campaign (once or see multiple paths), and after that, you unlock the endgame, reserved only for the bravest. Tough new challenges appear on the map with mythic bossfights, random quests, more loot and character progression ultimately leading to the banishing of Balor, the monstrous god-king of the Fomorians.\nAt release, King Arthur: Knight's Tale will be available with English voice acting, with English, German, French, Spanish, Portuguese, Russian, Chinese, Hungarian text localization. We may add other languages later.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"NeoCoreGames","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":241164,"name":"Accounting+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d6a/d6ad9c892f4519cf96641e8845005c40.jpg","description":"What began as a small game jam between William Pugh (The Stanley Parable), Dominik Johann (Minit) and Justin Roiland (Rick and Morty) is now, two years later, an aberration of warped technology, weird worlds and strange, disturbing creatures. Since its debut in 2016 (10/10 on Steam), Accounting has tripled in size, mutating into an intricate labyrinth of forbidden virtual realities. There are countless more secrets to discover if you have the stomach to brave the dangers of new characters, brought to life by an ever expanding cast of comedic legends (Rich Fulcher, Reggie Watts and Justin Roiland, to name a few).\nHow long have these goggles been pressing into my flesh?\nAccounting is a noble profession. During your tenure with Smith & Smitherson, you will bare witness to the afterbirth of this new facet of human experience. However, it is not without it's dangers. Here are some of the dangers you need to be aware of before entering Accounting+.DANGERSIf you die in VR, you die in real life.\nDo not play after midnight.\nSome Characters may be unfriendly and not actively encourage you during gameplay.\nAchievements linked to unforgivable acts of human corruption.\nA soundtrack that is way better than a VR game soundtrack should have any right to be.\nSubtitles and Translations for 9 languages… Oh wow that’s internationally dangerous.\nThe vacuum of space.\nSitting and Standing Mode are BOTH available (and dangerous)!!\nAnd, unfortunately: The Cops.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Squanch Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":51320,"name":"Attack on Titan 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/334/3347dd41a028675f97ba8484a8c29830.jpg","description":"Abandon all fear.\n\nShingeki no Kyojin 2 is the gripping sequel to the action game based on the worldwide hit anime series \"Attack on Titan.\"\nExperience the immense story of the anime alongside Eren and his companions, as they fight to save humanity from the threat of the deadly human devouring Titans. Try your hand in operating the omni-directional mobility gear, maneuvering and flying through the sky to counter the Titans, and feel the thrill and satisfaction of battling giant opponents.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":29115,"name":"UFC Undisputed 2010","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff7/ff7e4249ccfb4385a83578392830b8fb.jpg","description":"(Online Interactions Not Rated by the ESRB) Access code “UFC Undisputed 2010 Online” is required to play online multiplayer mode. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   So … you want to be a fighter?  UFC® Undisputed™ 2010 is the only mixed martial arts (MMA) videogame that delivers the action, intensity and prestige of the Ultimate Fighting Championship® (UFC).  Step into the Octagon™ to experience the most advanced and commanding virtual MMA action with more than 100 of the best UFC fighters in the world.  Experience intelligent and intuitive combat, increased fighter customization, robust career progression, challenging new gameplay modes and explosive online offerings.  UFC Undisputed 2010 embodies the ultimate essence and supremacy of a UFC fighter.  Ready to be one?","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Yuke's Co","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":23241,"name":"The Red Stare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3c/e3cdca97f7f5a3f24832ed0009fe640d.jpg","description":"The Time to Enlist Is Now!In The Red Stare, you become a special agent in 1950s New York City on a stake out. The Reds have infiltrated the city, and you need to stop them before it's too late.\nDuring your stake out you will be observing your neighbours' every move to find out who of them is the communist spy.\nFrom within your apartment you'll be receiving information via your phone and fax machine, finding clues in case files, and taking pictures that you can fax to your handler - proving that your suspicions are right.\nIt's all about observation and deduction. You’ll have to use a number of different ways to identify people varying from appearances, items that can be found in their rooms, and rules only specific members of the communist ranks follow.\nGood luck, agent! The nation depends on you.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Play:D","platforms":[{"id":0,"name":"PC"}]},{"id":22870,"name":"Legacy of Kain: Blood Omen 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a7/1a72e5260e02d7282652e02ab6ea47dd.jpg","description":"400 years have passed since the vampire Kain damned the world in the original Blood Omen, choosing to rule the world in damnation rather than die for its salvation. Now Kain, who once controlled the land of Nosgoth with his vampire armies, finds his brethren slain and his dark powers stripped by a mysterious figure. To reclaim his rule and exact his vengeance, Kain must dispatch armies of zealot soldiers and overcome legions of demons in order to uncover the ominous plot that threatens the land he seeks to conquer.\n\nBlood Omen 2, the second instalment in the Legacy of Kain Series, is a 3rd person 3D action/combat game in which you assume the role of the vampire Kain. A compelling story takes you through huge, lushly detailed 3D environments and challenges your skills in combat, puzzle solving, stealth and exploration. With each success, you’ll gain new dark gifts that will grant Kain the ability to access treacherous new areas to explore and the power to face stronger, more aggressive enemies. As you develop a stronger, more skilled vampire, you’ll be rewarded with dozens of dazzling in-game cinematic sequences that unfold the continuing epic of Nosgoth, and Kain’s attempts to ultimately rule over it.\nMove through crowds unseen cloaked in stealth, travel stories above the peasant herds on which you feed leaping from rooftop to rooftop, and use mind-control on hapless fools to help you overcome vampire-proof inventions.\n\nUnleash your wrath in a lushly detailed, blood-chilling gothic environment that is not only gorgeous to the eye, but also alive with the soon to be dead.\nBeautifully choreographed combat with surgical precision as you engage armies of demons and humans alike.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":19697,"name":"Perimeter: Emperor's Testament","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/664/664dcb9c7578ea1a019ce55e7cedfa31.jpg","description":"In the near future a new Exodus begins, the remnants of human civilization have to leave the perishing Earth and start traveling into the Psychosphere. The ones who call themselves the Spirits - new pastors of the human race, believe that a new planet, suitable for living, will be found in the Psychosphere. Colossal towns-arks, carrying hundreds of colonists, have been traveling for centuries through hostile worlds of Psychosphere under the guidance of Spirits. Their destination was the New Earth that was to replace their old home. All passed worlds have been connected by portals, that is how the Chain of Worlds has been created.\nBut the end of the hard tests is not in sight, and finally due to the despotism of Spirits and the underground intrigues Exodus went to pieces. New factions have arisen - the Empire and the Harkback. Each faction had their own goals and philosophy. The Harkbacks believed that the old Earth has not died, and the Empire - the most mysterious faction - believed that humans should stay in the Chain of Worlds. The antagonism boiled into a war that has been going on for many decades in many worlds.\nWhereas the Spirits are on the way to their destination and the Harkbacks are seeking the mythical Earth, the Emperor builds up his Sponge Empire using automatic bases - his Vice Frames. He does not believe in the old or in the new Earth.\nSecretly the Emperor creates the Mechanical Spirit - a super mechanism to help him discover new Worlds. Only the Emperor's mortal foes the Spirits could discover new worlds, and that was the source of their power. But now the new time has come.\nOne of the Vice frames starts testing this mechanism, it leads to the appearance of a super mind - Mechanical Messiah and the discovery of the parallel Chain of the Psycho-sphere Worlds. We also meet the \"lost\" Exodus Frames and find traces of the mysterious alien race. The three sides are in the middle of the deadly battle: the Scourge against the Emperor's Slaves, Lash of the Spirits against the Calling of Messiah, a dead truth against a newborn lie.\nWho are the Spirits - savers or killers of the human race? Who is Messiah judge or a puppet? Who is the Emperor? Who will win? The player will find out the answer during the spectacular single player campaign in Perimeter: Emperor's Testament.\n\"I feel hungry tension of the highest spheres. Flesh and blood of the Sponge have been set in motion; they are pulsating around the world in which the Emperor is creating a new history of the great Chain.\"\nFast paced Real-Time-Strategy action\nConstruct or destroy the very gameworld environments themselves using terraforming\nVast singleplayer campaign expanding the story of the original Perimeter\nNew special units, buildings and soundtrack\nPerimeter: Emperor's Testament is affected by the GameSpy shutdown on the 31st of May. You can continue to play the game through LAN, DirectIP and GameRanger.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"K-D Lab","platforms":[{"id":0,"name":"PC"}]},{"id":18506,"name":"SWARMRIDERS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d4d/d4dcd7acb4c78a5eb5223eab25b31b80.jpg","description":"SWARMRIDERS is a FREE \"endless runner\"+\"twin stick shooter\" ARCADE mashup. A \"machine gun swarm surfing minigame\" made as a bonus content for the UBERMOSH community.\n400 years before the events of UBERMOSH:BLACK, the Blade Saint was just a mercenary gunner, shredding eyes on the backseat of a bike.\nPlayers can expect a few minutes of elegant gameplay, responsive controls and a heart pumping original soundtrack.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Walter Machado","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18308,"name":"Super Cyborg","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0de/0dedcadecdd6db691707e500d9dd4347.jpg","description":"Super Cyborg is an old school non-stop hardcore run'n'gun action game! You are an elite battle cyborg who is sent in to investigate a series of anomalies on a mysterious island. The merciless and powerful alien known only as the 'Xirxul life form' has been awakened by unwitting scientists and now: all humanity is in danger!  Shoot, run and jump through 7 levels filled with endless hordes of biological terrors and some of the fiercest boss fights in any title. Destroy everything that moves on this island, because if it moves- it kills!\nAre you ready to save the Earth?\nNow with trading cards!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Music by Darkman007","platforms":[{"id":0,"name":"PC"}]},{"id":13609,"name":"A Kiss For The Petals - Remembering How We Met","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2a/c2a70d52640083d73dcf32396dd39370.jpg","description":"The season is Fall... as the uniforms transition from Summer to Winter garments, Risa suddenly has a pang of nostalgia. It was this very uniform she was wearing on her first day at St. Michael’s... The day she met her future girlfriend Miya.\n\nNow the two of them share a passionate life as a couple living in Risa’s apartment, but there was a time in their relationship when the very sight of one another would be enough to set off an endless bout of arguing. From Risa’s point of view, it all started with her just trying to get Miya to come to class...  \nAnd even now with the two of them going out, the chronically truant girl has failed to mend her ways.\n\nRemembering those days elicits a faint laugh from Risa. Sitting alongside her, Miya reacts to Risa’s sudden outburst with a puzzled expression.\n\n\"I was just thinking back...  About when we first met.\"\n\nIt was a beautiful spring day, with sakura petals dancing in the air.\nThe day of her unforgettable first encounter with Miya...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"St. Michael's Girls School","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11128,"name":"8-Bit Armies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df8/df8a977cb39e030149a9d1bc2ff4bc98.jpg","description":"A Blast From the Past!\n8-Bit Armies is a retro Real-Time Strategy game for the PC. With a colorful, blocky voxel art style, 8-Bit Armies is Petroglyph's most fast-paced, friendly, and accessible RTS game to date. Collect resources, build up and defend your base, amass your army of military units, and ultimately crush your opponents! 8-Bit Armies features offline single-player missions, two-player cooperative missions, AI skirmish mode, and Player-vs-Player Multiplayer modes running on dedicated game servers.\nInitial release includes:\n25 offline campaign missions\n12 co-op missions to play with your friends\n10 multiplayer/skirmish maps that support up to 8 players online\nAI with multiple difficulty options to play with cooperatively or fight against\nClassic Base-Building mechanics let you construct the ultimate HQ from which to launch attacks against your foes\nDestructible environments on maps ranging from small to very large\nEasy to understand modern military units and structures lets RTS beginners jump right in\nFrom the same team that brought you RTS classics such as Star Wars: Empire at War, Universe at War, and Grey Goo\n8-Bit Armies is for anyone that enjoys RTS games, or felt overwhelmed by more serious games.  With hours of solo and co-op gameplay included, there's something here for everyone!More reviews from game journalists...\n\"Its biggest offering to the RTS genre is its brilliant retro design and vivid, colourful graphics coupled with easy-to-learn gameplay. For those intimidated by the complexity of RTS games, 8-Bit Armies is a great place to start.\"\n- CGMagazine\n\"Simple and balanced game play make 8-bit Armies an indie game gem! I wasn’t kidding when I said that I can’t stop playing this game, it is that good!\"\n- Just Press Start\n\"I love the the game, and it is definitely worth buying.\" and... \"It's a fun, fun game and I'm absolutely, absolutely loving it!\"\n- Worth A Buy (YouTube)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Petroglyph","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":10159,"name":"Your Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/422/4229b884d0c6600fa1de2ada3059bec2.jpg","description":"You awaken to the dawn of a new world.\nIt's streams are clean, the forests lush and the local wildlife is hungry.\nYou're cold and in need of shelter as you hear other voices on the wind. You are not alone.\nYour quest: Establish civilization and secure their safety in this new world.\nYour Quest is a casual 2D Strategy/RPG with progressive gameplay where you gather resources to construct a village, craft new weapons and armor, and try to survive the depths of a procedurally generated dungeon under the surface.\nIf you would like to support development, you can \"name your own price\" on itch.io: https://oblivionburn.itch.io/your-quest\nFeatures\nTurn-based Combat\nVillage Building\nCraftable Armor and Weapons\nVillage Raids\nProcedurally generated dungeon\nControls\nKeyboard\nW/A/S/D: Movement\nEnter: Interact and Menu Selection\nEsc: Main Menu and Cancel\nCtrl + W/A/S/D: Turn in that direction\nCtrl + A/D when managing jobs: Increases/Decreases jobs by 10\nI: Inventory\nXbox 360 Controller\nLeft Stick/D-Pad: Movement\nA: Interact and Menu Selection\nStart: Main Menu\nB: Cancel\nLeft Shoulder + Left Stick/D-Pad: Turn in that direction\nLeft Shoulder + Left/Right on the Left Stick/D-Pad when managing jobs:\nIncreases/Decreases jobs by 10\nY: Inventory","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Oblivionburn Productions","platforms":[{"id":0,"name":"PC"}]},{"id":5063,"name":"Mega Man 10(2010)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b87/b876d9664840d7e2f53cf5c649476935.jpg","description":"The original 2D classic Mega Man returns in a new adventure!\nThis latest Mega Man title continues to bring the series back to its old school roots with retro action, platform game play and classic 8-bit style graphics and sound. This latest Mega Man title continues to bring the series back to its old school roots with retro action, platform game play and classic 8-bit style graphics and sound. Rediscover the Mega Man experience with classically inspired new boss characters, each with their own unique weapons and vulnerabilities.\nThe year is 20XX and a suspicious outbreak of Robotenza, a Robot Flu, has broken out. It spreads through the world like wildfire bringing down robots everywhere. People who have relied on helpful robots for ages are unnerved trying to live their lives without their robot assistance. One month after the outbreak, the situation worsens even more. Infected robots have gone out of control, destroying the city and holding it hostage! It's up to Mega Man to take on this sinister threat and get to the bottom of this viral mystery.\n©CAPCOM CO., LTD. 2010 ALL RIGHTS RESERVED.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©CAPCOM CO., LTD. 2010 ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":3707,"name":"Daylight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/883/883f07b7d3331c1f0b2c02c3d17db779.jpg","description":"You awake, trapped in an abandoned hospital. Your only source of light is your phone. You hit a dead-end and must turn around, but behind you lurks an eerie presence and strange noises...\nExperience Daylight, a procedurally generated psychological thriller for your PC. Unreal Engine 4 enhances the visuals of your escape to freedom like never before, heightening every bone-chilling detail of your surroundings. Get lost in a maze that changes with every playthrough, allowing for limitless replayability and the tension of unpredictability every time you start the game. Navigate to safety while avoiding what lurks in darkness. What will be waiting for you down the next corridor?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1127,"name":"Four Sided Fantasy","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c50/c502c60e0ebc928df39ef0de13890109.jpg","description":"Four Sided Fantasy is a game about pushing the limits of the screen. In this world, you can wrap the screen at any time, so that you emerge from the left when exiting right, and falling down a pit turns into falling from the ceiling. Discover a strange world where a man and woman journey through four seasons in a year, constantly separated by the boundaries of the screen.\nEach new season in the game brings a new twist to screen wrap. Just as you think you’ve mastered a screen wrap mechanic, the world will change its rules and present a new way for you to look at the confines of your screen.\nFour Sided Fantasy is a concise puzzle gaming experience that respects your time; an experience that lasts around the same time as Portal.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Serenity Forge","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":301511,"name":"Final Fantasy XII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f9/6f932bffab5e38f540e10bb026621b08.jpg","description":"The story takes place in a world called \"Ivalice,\" in an age when magic was commonplace and airships plied the skies - the Archadian Empire, seeking to strengthen its base of power, had been invading and subjugating its neighboring lands one by one- a fate which befell the small Kingdom of Dalmasca. Archadia's invasion and the subsequent death of the Dalmascan king prompted the Princess Ashe, the sole surviving heir to the Dalmascan throne, to take up arms against the invaders. In her struggle to oust the occupying Archadian forces and restore freedom to her people, Ashe must watch as many of her allies pay the blood price for that freedom. Though tempted to abandon all hope in the face of the Empire's might, her determination keeps her from succumbing before what would seem to be inevitable defeat. Then she meets Vaan, an urchin from the Dalmascan capital of Rabanastre. Vaan dreams of one day becoming a sky pirate, escaping the Empire on his airship. Vaan, Ashe, Vaan's friend Penelo, the sky pirate Balthier, his partner Fran and many more are on an adventure through Ivalice that traces the mysteries behind the Archadian Empire's invasion. Bringing with it a wide array of new gameplay elements, Final Fantasy XII will change the way players think about the Final Fantasy series. Numerous possibilities abound within each scenario, allowing for a less linear, more unique experience for each player. The game also supports Dolby Pro Logic II both in-game and during movie sequences, immersing the player in the middle of the action.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":56050,"name":"FIFA Street","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c3/4c339c6ff0f9467170662478fcd11956.jpg","description":"FIFA Street is a sports video game developed by EA Canada and published under the EA Sports BIG label. It is commentated on by MC Harvey of the So Solid Crew. It was released in February 2005 for PlayStation 2, Xbox and Nintendo GameCube. The cover features Brazilian international footballer Ronaldinho.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":44508,"name":"This Strange Realm Of Mine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/885/885f090265d7a62a446a28458bacf0fe.jpg","description":"- This Strange Realm Of Mine is a First Person Shooter mixed with poetry and psychological horror. Graphic style is 3D mixed with pixel art.\n- Old-School FPS action\n- Explore Fantastical Worlds\n- Puzzles\n- Story heavy\n- Poetry\n- Varying gameplay\n- Original Soundtrack (Included)\nStart off by creating yourself, then die.\nIn REALM you explore your afterlife. On your quest you'll find characters in different situations, with their problems and thoughts on life. You can invite them to your tavern, a safe-haven in the midst of all the chaos. You'll also meet Ulrich, a spiritual guide who'll take you through your experience as a lost soul.\nYou'll come across monstrous beings who are eager to put their teeth in you. There are several ways to rid yourself of them however, ranging from guns to melee weapons. Be ready to get your hands dirty and watch the blood drip slowly from the roof and walls.\nThis universe consists of both beauty and indescribable horrors, in REALM you'll experience both. Let's hope you have a good time, and who knows, maybe you'll learn something on the way..\nKill monsters with any weapon available, such as Pistol, SMG, Shotgun, Axe and so on..\nTalk to NPCs to hear their stories, help them if you can.\nExplore the strange realm of your mind.\nYou'll find yourself in situations that are atypical from ordinary FPS games as well.\nThis Strange Realm Of Mine is a feelgood game, mixed with psychological horror. From blood-filled scenes to poetry. From fast-paced action to dialogues of our views and questions about life, death and everything in-between.\nGame made by solo-developer Doomgriever from Doomster Entertainment","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Doomster Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":23739,"name":"G-Force: The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6af/6afa633097ba04b5985680309d41120d.jpg","description":"Based on the Jerry Bruckheimer 2009 summer movie blockbuster, G-Force: The Video Game puts players in control of Darwin, the guinea pig leader of the covert intelligence G-Force squad, and housefly surveillance sidekick, Mooch. Use high-tech gadgets, awesome weapons, and pint-sized teamwork to save the world from an army of weaponized household appliances! Available in 3D on the PLAYSTATION®3 computer entertainment system.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":21483,"name":"Weapons Genius","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/694/694d02528781b28a2f21da716e59c0c7.jpg","description":"Special Offer\nhttps://store.steampowered.com/app/1107370/Demoniaca_Everlasting_Night/\nAbout the GameWeapons Genius is a Simulator of building Weapons!\nIn Weapons Genius you can build your own Weapon! You can build A big and powerfull gun, or you can build a small but rapid gun, or you can build a gun with high accuracy!\nIn practice mode, you can earn money for another guns to build!\nGraphics and Sound in game is realistic!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JDM4iK","platforms":[{"id":0,"name":"PC"}]},{"id":17504,"name":"Doctor Who: The Adventure Games","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c86/c8672cef47612087cd9020ca2398ae7b.jpg","description":"Join the Doctor as his companion in an out-of-this-world adventure through time and space. You will need all your wits and courage to outsmart and defeat some of the Doctors' most storied enemies like the Daleks, Cybermen, and the Vashta Nerada. Explore the universe, and even see the inner workings of the TARDIS!\nExperience this thrilling adventure game based on the hit TV series, Doctor Who.\nUse stealth and puzzle-solving skills to explore other worlds.\nCollect bonus cards that enrich the story with Doctor Who trivia.\nBecome the Doctor’s companion across time and space!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":17441,"name":"Egg Returns Home","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d3/0d37121a4215a5bfab9a692bab7e6ea6.jpg","description":"Egg Returns Home is a simple platformer about an egg, which is trying to find his way back home. At every level egg needs to get to the teleport.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PigelPix","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13752,"name":"Patchwork","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fad/fad0a16f8325867fc7e8012b0fd81dc4.jpg","description":"In this award-winning board game for two, quilting has never been more competitive! In the long-awaited digital adaptation of Uwe Rosenberg's Patchwork, players patch their way to victory using fabric pieces of assorted sizes, colors, and buttons. The best quilt is the fullest, and whoever can patch up their quilt the most and collect more buttons wins the game – but be resourceful and plan every stitch! Keep an eye on the costs and the time it takes to stitch a patch to be the best patchwork master. Play against quilters from around the world on multiple platforms and compete for the highest rank. Face computer opponents, or stick to a local game with a friend. Patch your way to the top in Patchwork!\nFeaturing:\n- True digital conversion of the award-winning board game Patchwork by Uwe Rosenberg\n- Consider every stitch you make in this deceivingly simple game\n- Worldwide cross-platform multiplayer\n- Easy interactive tutorial\n- Analyze your best games or even learn tricks from the pros with Playback\n- Customize your game interface with an ever increasing number of backgrounds and colorful patterns\n- Challenge the AI in easy, medium, or hard mode","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DIGIDICED","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10002,"name":"Life is Feudal: Forest Village","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/78d/78d620341f38b28b59c10bf7f8097faa.jpg","description":"Life is Feudal: Forest Village is a feature-rich, town building simulator strategy game with engaging survival aspects. Lead your people: a small group of refugees who were forced to start again on an unknown island.\nTerraform and shape the land and expand with houses, pastures, orchards, farms, windmills and many other buildings. Forage in the forest, hunt for prey, grow crops and domestic animals for food. As Winter creeps up, ensure you stock up with enough firewood, charcoal and warm clothes to survive, and remember: a lack of vitamins in good rations may lead to disease and could even totally wipe out your village!\nYou can oversee your village from a birdseye view or occupy one of your villagers to control and perform tasks in a first person view to speed things up or just to explore.\nSome of the more exciting features:\nAdvanced farming system. Different crops and fruit trees require varying amounts of moisture, man labour and time in order to ripen ready for harvest. Your pastures and hens require hunters to protect them from forest predators.\nSwitch between birdseye and first person views. You can play in a birdseye view, watching over everything and issuing strategic orders, or you can possess a villager and play from a first person perspective, performing everyday tasks along with your fellow villagers.\nTerraforming and pavement. Terraform land around your settlement to enable construction of larger buildings. Pave roads to speed up the movement of your villagers and thus improve the economy of your settlement.\nDiseases, food rations and vitamins. Diseases spread faster in cold weather, especially if your villagers lack warm clothes or their food ration is too plain and lacking in vitamins. Try to stock all types of food possible (meat, fish, bread, vegetables and fruits) to keep your villagers’ healthy.\nDynamic ecosystem. Villagers continuously walking in the surrounding woods will scare wildlife deeper into forest. Excessive farming or woodcutting can lead to flora and fauna extinction thus lowering the flow of meat, hides, mushrooms, berries and medical herbs to your stocks.\nReal time weather and seasons system. The seasons effect your village’s needs: summer droughts will force your farmers to water your crops and rainy days will force them to dig trenches to drain excess water, and you’ll need firewood and warm clothes for your villagers in Winter.\nMorale and increasing population. Keep your villagers happy and their families will grow - that is, if their needs are being met! Living in overcrowded hostels, unfulfilled requirements and even bearing witness to a villager’s demise will reduce morale and their productivity.\nDisasters. Lightning can hit tall buildings that are standing on hilltops. Tornados can leave a devastating trail of destruction across your settlement. Earthquakes can destroy your houses and even topple trees. Make sure you are prepared to face those challenges!\nMod friendly. Our game is designed to be modder friendly. Game modders will have access to AI, animations, task and resource management, navigation, sounds and many other game systems. Those systems and assets can be completely changed through game scripts written in LUA.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mindillusion","platforms":[{"id":0,"name":"PC"}]},{"id":4815,"name":"Auditorium","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/281/2816ffb6e2a0a647f57b93e35a9daa82.jpg","description":"The classic particle puzzler finally arrives on Steam! Turn light into sound in this multi-award winning game. Auditorium is about the process of discovery and play. There are no right or wrong answers, and there are any number of ways to solve each puzzle. See why Auditorium has won countless awards and is considered the Second Best Browser Game of All Time. To get started, turn up your sound and fill up the first audio container!\nWe hope you enjoy playing in our Auditorium!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cipher Prime Studios","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":558972,"name":"TRIANGLE STRATEGY","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/334/3340776fc9a78199838c7c1d8ec22bd5.jpg","description":"Three nations battle for control of the dwindling resources of salt and iron\nCommand a group of warriors as Serenoa, heir to the Kingdom of Glenbrook in a tangled plot where your decisions make all the difference. Key choices you make will bolster one of three convictions—Utility, Morality, Liberty—which together make up Serenoa’s world view and influence how the story will unfold. When faced with truly momentous decisions, multiple characters will weigh in by casting their votes on the Scales of Conviction. In these moments, the allies and decisions you make can determine the fate of whole nations and the continent of Norzelia itself.\n\nControl multi-tiered battlefields to strategically secure victory\n\nFinding the best location in turn-based battles can tip the tide of combat in your favor. Position units on higher ground to take control of the battlefield and gain the advantage with increased range. You can also flank enemies on both sides, then strike from behind for a powerful follow-up attack. Elemental chain reactions are also an important part of combat. For example, use fire to melt icy terrain, then use lightning to electrocute it. Push the enemy into the electrified water to see sparks fly!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":540051,"name":"MONOPOLY Poker","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f78/f78ce76a9dc5a33ee62e9019c030b305.jpg","description":"Welcome to the official Texas Hold’em Poker Game of MONOPOLY. Are you ready to conquer the Poker empire ?\nMONOPOLY POKER FEATURES️:\n\nMASTER TEXAS HOLDEM POKER - There are three types of Texas Holdem you can play including: Cash Games, Sit & Go Tournaments, and super fast Spin & Play Rounds.\nFREE CHIPS EVERY 4 HOURS - Receive a free stack of poker chips several times a day so you can play for even longer!\nDOMINATE THE LEAGUES - Beat the other players and prove that you’re a true card shark when it comes to Texas Holdem poker.\nWIN THE RINGS & FEEL THE GLORY - Earn as many of the Champions Rings as you can in the Sit & Go Tournaments.\nCLIMB THE LEADERBOARD - Only the best players will reach the highest spots!\nHIGH QUALITY GRAPHICS - Enjoy top notch graphics and animations.\nCOMPETE AGAINST YOUR FRIENDS - MONOPOLY Poker is a multiplayer game. Invite your friends to play with you in the tournaments...but will you be able to beat them?\nWIN TOURNAMENTS AROUND THE WORLD - Show off your Poker skills from São Paulo to Las Vegas.\nHIGHER STAKES, BIGGER PAYOUTS - The payouts will get bigger and better as you participate in more and more multiplayer tournaments.\nSPIN & PLAY - Press your luck and find out if you can win a huge jackpot in this version of Texas Holdem.\nPLAY ANYWHERE AND ANYTIME - You can enjoy this online poker game whenever and wherever you are with your phone or tablet.\nPLAYING FAIR - This is a Texas Holdem PvP game that plays by the rules to keep things fair.\nMR MONOPOLY shuffles the cards while using the best proven methods. You won’t find any roulette or bingo style poker here!\nAll the thrills of Las Vegas can be found at each one of the Texas Holdem tables that are waiting for you in this challenging free online poker game.\nWIN BIG BUCKS\nPlay your cards right during each round and earn the Jackpot. Just like in a Texas Holdem tournament in a real casino, you’ll need to strategically raise the stakes and know when it’s time to fold. Use your poker skills after MR MONOPOLY passes out the cards and carefully consider how many chips you’re willing to risk during each exciting round.\nThis Texas Holdem card game, which is one of the world’s best multiplayer card games, does not feature real money or real gambling.\nTHREE AWESOME VERSIONS OF TEXAS HOLDEM\nShow off your skills during your attempts to earn the Champions Rings in the Sit & Go Tournaments and make it to the top of the leaderboard. The more chips you win, the higher you’ll rise in the rankings. The competition will get more intense, though. You can even play with your friends in this addictive and free multiplayer poker game. Find out if you can collect all of their chips while you use your favorite bet strategy. Download the game today, and get ready for all sorts of cool and challenging poker excitement!\nDo you want to join poker tournaments and become a master of poker? Download MONOPOLY Poker now and start playing today for free! The classic Texas Hold’em card game, now for mobile and tablets!\nMONOPOLY Poker is a Play-For-Fun Poker game that is intended for amusement only.\nAll in-game sales are final. The games are intended for an adult audience (i.e. intended for use by those 21 or older). The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\nThe MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of the board and playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2020 Hasbro. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"YoudaGames","platforms":[{"id":0,"name":"PC"}]},{"id":59644,"name":"Super Inefficient Golf","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e1/1e1815e5e446bca93f1f09e1b9ff16e2.jpg","description":"GOLF FOR INEFFICIENT BADASSES!Why hit a ball with a metal stick, when you can stick MINES to your ball?\nSuper Inefficient Golf improves upon the most inefficient game ever conceived, by making it even LESS efficient. Master the art of carefully placing your mines, detonating them with expert timing, and BOOM - Birdie!\nThe game is divided into two phases: setup your golf ball with mines, then blast it into space (or better, into the hole) by detonating them! You have full control on which mines explode and when, which gives you complete power over your rocket ball trajectory. Golf clubs will feel so basic after this!FEATURES 18 challenging holes - increasing difficulty, no tutorial. Are you tough enough?\nSlowmo and acrobatic aerial turns - total control, albeit very inefficient!\nUnbelievable views - enter a chill, relaxed environment in which your swearing will echo for miles around.\nOnline Leaderboards - Join the global challenge.\nExplosions! - Exploding mines, exploding barrels, exploding explosions all around!\nGame up! - Bernard Suits would be super happy of our lusory attitude.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"34BigThings","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]}]