[{"id":270769,"name":"SYNTHETIK: Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90b/90b01f69e913f89d18fe4663e89de107.jpg","description":"SYNTHETIK: Arena is the Stand-Alone expansion to the Rogue-Lite Top-Down Shooter SYNTHETIK.\nWith Synthetik we wanted to bring new depth and mechanics to the genre while leaving a lot of freedom for experimentation and different playstyles. It is inspired by the late 90’s Era of games when people put in all the Features they enjoyed without streamlining to the bare minimum.\nStand your ground against relentless opponents in five unforgiving challenges. Master the uniquely deep and satisfying weapon mechanics and the unprecedented amount of customization. Discover many dozens of weapons, items, perks and character upgrades. Join the fight alone or through seamless 2 player online co-op!\nTHE NEXT LEVEL IN GUNPLAY\n> Master SYNTHETIK's uniquely rewarding magazine eject and active reload mechanics!\n> Weapons can jam and produce heat, check yourself before you burn yourself!\n> Tame the movement based recoil, discard and switch between varied ammo types.\n> Savor the uniquely satisfying and direct weapon handling, rewarding precision and mastery!\n> We even brought headshots for the first time to the top-down perspective !\n2 P  O N L I N E C O O P\nOnline co-op allows you to bring reinforcements to the fight. Better yet, share perks, items, buffs and loot with your comrade. Or, if they get in your way, share your bullets.\n1985. After many years of slavery, the AI servants of Kaida Corporation, the world leader in robotics, have formed the \"Machine Legion\" and have set out to destroy humanity. Awakening in Kaida Corp. Headquarters, you are the human consciousness of a forgotten Android prototype; the last straw holding the Legion from unleashing the Heart of Armageddon. Only you can battle through the levels of Kaida Corporation's Headquarters, defeat the battalions of enemies within and put an end to this madness.\nThe defeat of the Machine Legions \"Last Defender\" has thrown you into your Android-subconscious and the only way out is to face the challenges of the machine god Zir. Will you be able to stand your ground?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Flow Fire Games","platforms":[{"id":0,"name":"PC"}]},{"id":58607,"name":"Hexologic","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d22/d2267db471f0e035cc5ab27208ebe50e.jpg","description":"A Sudoku-like gameplay is taken to a whole new level! ! Immerse yourself in the beautiful world of Hexologic. Solve challenging, yet rewarding puzzles, listen to relaxing music, dive deep into the game’s atmosphere and fall in love in with Sudoku again!Hexologic is very easy to learn and in the same time a highly addictive language-independent logic puzzle game. Based on hexagonal grids, the game reinvents sudoku rules and brings it to a whole new level. Combining the dots inside the hexes in three possible directions, so that their sum matches the one given at the edge, will be a rewarding experience for both puzzle games’ veterans and newcomers. A simple gameplay mechanics adorned with a beautiful graphic design, relaxing music and challenging yet not unbeatable puzzles, will guarantee long hours of fun for gamers of all ages.IN HEXOLOGIC YOU’LL FIND:Relaxation, putting your mind at ease in the immersive atmosphere\n4 completely different game worlds, each with unique gameplay mechanics\n60 levels designed down to the smallest details\nWell-balanced puzzles\nAn atmospheric soundtrack accentuating the game’s ambienceJump into the world of Hexologic and prove you are the true master of the hexes!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"MythicOwl","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":49284,"name":"Heroes of Hammerwatch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb4/eb4cd54cf5828b8598b6b95a7ded6253.jpg","description":"Heroes of Hammerwatch is a rogue-lite action-adventure game set in the same universe as Hammerwatch. Encounter endless hordes of enemies, traps, puzzles, secrets and lots of loot, as you battle your way through procedurally generated levels to reach the top of the Forsaken Spire.\nA rogue-lite with a lot of persistent progression. You will start each run in Outlook, a town which you can upgrade to grant your heroes with various enhancements that will further help you in your quest. The heroes themselves will also remain persistent, you can even bring your own heroes to your friends game!Features:Procedurally generated content: Random generated levels offers a high replay value and will bring you a new challenge with each run.\nPersistant progression: Your heroes will retain the experience gained from a run, and will become more powerful as they level up.\nTown upgrades: Construct/Upgrade 10 different buildings that will help your heroes in various ways.\nClasses: Choose from 7 different classes, all with unique stats, abilities and playstyles.\nItems: Find or buy over 100 unique items of various rarity.\nCo-op: Play with up to 3 friends in co-op.\nNew Game+: Heroes of Hammerwatch will be a real challenge, and even if you beat it, the challenge never ends!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Crackshell","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":18702,"name":"The Guild Gold Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c2/4c233789b99b55b3d9e28b38a50e26e9.jpg","description":"It’s the year 1400- the late Middle Ages. Europe sees the dawn of the golden age of the new departures and the free spirit. Under the rule of the bourgeoisie and businessmen, more and more towns are emerging from the clutches of the aristocracy and are achieving independence, power and wealth. New businesses are flourishing, bringing financial strength and political influence to a growing economy.\nHowever, life in the narrow, overpopulated alleyways and streets of the towns also has its downsides: epidemics and diseases are spreading, and thieves and highwaymen lie in wait to get their piece of the wealth. Now you can try your hand in these exciting times of change. Will you head down the path of an honest craftsman or a dubious priest? It’s your choice.The Story:At the age of 13, you leave your parents, go to the city to learn a job and aiming to build your own trade empire at the time of real commercial and though exchanges expansion. You choose the city, each one has its difficulty level, you choose your parents, whose respective jobs predispose you to have specific qualities, and you choose your business among the old fashionned Middle Age jobs. Run your own business, manage your workers properly as to be the more productive you can, and hire guards to protect your goods... Because even if you get better than the competitors, they can destroy your work and your goods... That's the difficult world of business affairs!Key features:Includes the original game plus its expansion pack\nBlackmail, kidnap, sabotage or buy your way into a higher position in the government\nChoose your job according to your qualities, your city and the local religion, hire workers and protect them, and protect your goods from bandits and competitors\nOne of the best Middle Age commercial simulation\nDon't be stopped by your avatar's death : manage your commercial empire through generations!\nA great history revision of this wonderful period : trade expansion, land discoveries, the different religions finally work together","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"4Head Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17640,"name":"Sherlock Holmes - Nemesis","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/117/117a5c17ceab4baa19313a3af412f9c5.jpg","description":"This new Sherlock Holmes game sends us to 19th Century London where Arséne Lupin, a young French burglar with an impressive track record, has just challenged Scotland Yard and the most famous of detectives - Sherlock Holmes.\nThis new adventure offers gamers tremendous freedom and an even stronger sense of involvement through real-time 3D. The game invites you to visit 19th century London in all its splendor and to travel through superb decors which have been faithfully reproduced.\nFeatures\nThe magnificent city of London with all its most famous monuments (Buckingham Palace, the British Museum, the National Gallery, the Tower of London...), is faithfully created for the scenes of investigation\nMeet the Queen of England in a very private interview.\nInteract with more than 40 characters to further your inquiry.\nTake turns being the famous detective, Sherlock Holmes, and his faithful friend, Doctor Watson.\nUse and combine more than 100 objects and discover hundreds of clues and documents to help you bring the investigation to its conclusion.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":15855,"name":"STAR WARS: Rogue Squadron 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2d/b2d1dbce92dcbcd5a5d376984c3cb0fe.jpg","description":"It is a time of great rejoicing in the galaxy. Luke Skywalker, with the help of Wedge Antilles, has blown up the Death Star. But there is little time to celebrate. The mighty Empire is gathering strength for a determined, all-out assault on the Rebel forces.\nTo save the Rebel Alliance from this Imperial onslaught, Luke Skywalker and Wedge Antilles have assembled the Rogue Squadron, a group of twelve of the most skilled battle-tested starfighter pilots. You will fly into battle as Luke Skywalker, to engage in intense, fast-paced planetary air-to-ground and air-to-air missions ‒ dogfights, search and destroy, reconnaissance, bombing runs, rescue assignments, and more.\nTake on the Galactic Empire in X-wings, Y-wings, A-wings, V-wings, and snowspeeders.\nProve you’ve got what it takes against a slew of the Empire’s best and baddest, including AT-AT walkers, AT-STs, TIE fighters and more.\nTest your flying skill through extraordinary environments ‒ over water, through canyons, deserts, and volcanic regions.\nAstonishing 3D details include real time lighting and special effects (explosions, smoke, engine glow, tracer fire and more).","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"}]},{"id":4247,"name":"Dead or Alive 5","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d10/d10bda01b9bc82fb3472c6960aa35afa.jpg","description":"Dead or Alive 5 is a fighting game centered around “disruptive triangle” — the set of different combos in which one type of an attack beats another one and forms a triangle structure, so there are no unbreakable blows. It is a part of a more extensive series developed by Team Ninja consisting of 23 titles and being the 15th game in the franchise.\n\n###Plot\nThere a 19 characters in the game transferring from title to title within the IP. The whole franchise follows a narrative in which some competitor fighters are participating in DOA tournament. The local committee organizes various fights in different locations around the globe. \nUnlike it presumed competitor, Mortal Kombat series, Dead or Alive shows the motivation of each character to enter the contest.\nThe fifth installment develops a story of Ryu Hayabusa — also the protagonist of Ninja Gaiden series — along his way through the tournament. The story features military, clone, and conspiracy arks tied to the different persons. \n\n###Gameplay\nTogether with “disruptive triangle” game features updated tag battles — consisting of two players for both sides. The environment may be bend or even destroyed depending on the fighting process — its elements may be used to aid the battle. The stages are constantly developing themselves — if kicked into Danger Zone, the fighter can suffer severe damage while the stage is falling apart.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":32575,"name":"Tony Hawk's Pro Skater 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c21/c2123c3dea40946f705a54772ed6238b.jpg","description":"Tony Hawk's Pro Skater 2 is the second entry in the well known skateboarding game made famous by world skateboard champion Tony Hawk and features arcadey easy to learn but hard to master gameplay.\n\nGamemodes consist of Career Mode, Free Skate, Simple Session, Multiplayer and the Level Editor.\nCareer mode, as the name suggests, consists of various levels with different tasks to achieve like finding secret tapes, do monster combos or collect the letters S-K-A-T-E and various other tasks to achieve a certain amount of points and progress through.\nFree Skate is as the name suggests skating at your own leisure in any unlocked level.\nSimple Session consists of achieving the highest possible high score.\nMultiplayer is a 2 player split-screen mode with various fun games to play as well as just skating around with the other person.\nAnd at last, level editor, suggestively an editor for creating your custom skatepark with a max block amount of 100.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Aspyr Media","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Dreamcast"}]},{"id":21308,"name":"Obulis","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e61/e6117affcf9576680fa2241f412bcfa5.jpg","description":"Based on the award-winning mobile game of the same name, Obulis takes things to the next level by fusing highly compelling gameplay with outstanding graphics, music and state of the art physics effects.\nThe goal of Obulis is to drop all of the colored spheres into their like-colored pots. Spheres are connected to the playfield using chains and ropes and the player must cut these constraints to put the spheres and the level in motion by the forces of gravity and physical interaction. The controls are extremely simple and intuitive. Obulis can literally be learned in seconds, but the puzzles will keep you thinking for hours.\nOver 150 Levels\nOver a Dozen Interesting Themes\nBreathtaking Graphics and Music\nSpectacular Physics and Special Effects\nUnlock 17 Achievements Found Within the Game","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":17835,"name":"Fantasy Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d2/8d2e7abb02995bd12f1bd0334b04aedc.jpg","description":"Fantasy Wars is a turn-based strategy game set in a fantasy world. Combining both classic strategy gameplay and sophisticated 3D graphics players can experience epic battles like never before. Taking place in a fantasy world of Human kingdoms, Orc clans, Dwarfs' citadels and Elven forests the player is thrust into a world of war and legend. Play the role of an Orc or Goblin boss, a captain of the Human army or lead the elite forces of the Elven army. Participate in castle sieges and village defense, assault and reconnaissance operations and swift raids. To be victorious remember that the amount and experience of troops is not always the key factor, organize cooperation between different types of units and use the landscape to achieve strategic superiority. The game consists of three story-connected campaigns. In each of them players will have to gather an army, upgrade units, find magic artifacts and study magic spells. An epic story has been crafted to draw gamers in. The great Orc chieftain and conqueror Ugraum, incited by the cruel shamans, gathers a huge horde to invade the land of Humans. Only a small, but experienced army of general Pfeil is able to fight against the powerful enemy. However the sides in this confrontation don't know that this is all just a part of evil plot of the dark powers.\nKey features:\nBattlefields and surroundings in full 3D\nVarious tactical opportunities\nVivid characters which develop during the game\nMore than 70 units and 9 types of armies\nAdvanced army upgrade system\nOriginal storyline\nMultiplayer mode (LAN, Internet, Hotseat)\n","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"1C: Ino-Co","platforms":[{"id":0,"name":"PC"}]},{"id":11682,"name":"BrainBread 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/418/4180646b1b1fc8d700752a7f3d66bb35.jpg","description":"CyberCon, the notorious global corporation, aspired to deliver to the world something that would change the fate of humanity. What the world wasn't ready for however... Was CyberCon's true intentions. Their schemes had been controversial to most before, but their newest idea seemed almost too perfect.\nA much sinister secret was about to be exposed. CyberCon's project involved the development of neuro-hub chips. They succeeded and became a phenomenon, later becoming a mandatory law to have them implanted at birth using state of the art surgery and cutting edge technology.\nCyberCon were granted this permission from the government. The controversy was covered up and very little was known how it was done.\nThe technology was seen by many around the world as a major breakthrough that could cure blindness, deafness, disease, and a huge boost in performance for modern day life.\nIt was further aiding as a gateway to easier communication and enhanced capabilities. This was the next milestone in human history.\nHowever, good things must always come to an end.\nAnd CyberCon's true colors are yet to be revealed.Features5 Unique gamemodes.\nOver 20 unique weapons, including akimbo weapons!\nExtreme amounts of gore & gibbing, this is your lovely grindhouse-gore movie!\nOver 100 unique skill combinations.\nA global profile system/leveling system.\nPlay as a zombie, evolve as a zombie using your special zombie skill tree to your advantage!\nModding friendly, customize your own soundsets for any of the npcs, make your own player survivor models, make custom maps, share your creations via Workshop!\nCharacter customization.\nNo pay to win!\nSimple UI and HUD.\nAI Soldiers, Tanks and Bandits/Mercenaries.\nA powerful quest, objective & inventory system.\nPlayable on PC, Mac OSX, and Linux with multiplayer cross-compatibility.\nDedicated Server Support for PC and Linux.GamemodesStory\nFocuses on story based gameplay, progress by doing specific quests or side-quests to increase your chance of survival!\nObjective\nFocuses on small & simple objectives, this is a casual/chill gamemode based on the original BrainBread, if you want a pure BrainBread experience you can enable a server command to force it to vanilla BrainBread mode. In this mode you can also play as a zombie and as a human you can get infected. The zombie's objective is to prevent the humans from progressing, when you get a certain amount of kills you will be able to respawn as a human again, or if you die too many times. All of this can be regulated by the server owner.\nArena\nThis is a wave based gamemode, similar to 'Survival'. You have limited respawns and when you die you'll respawn after X amount of seconds. Everyone respawns at the same time, certain maps may allow certain amount of retries for a wave, if you fail too many times you have to do everything over again. This mode is very action-packed, you better be flexible.\nElimination\nA Humans VS Zombies gamemode, first team to reach the fraglimit wins! In this mode you respawn individually, however if everyone on your team is dead your team will be 'Exterminated', which means the round is over. The opposite team gains a certain amount of points by exterminating the other team, this is an effective way to gain points but it is hard to achieve if there's many players. In this mode you'll also trigger a team perk if your team gets a certain amount of kills, your team will be blessed with some helpful skill for a certain amount of seconds.\nDeathmatch\nA PvP gamemode, solely for humans. Featuring classic old-school powerups, increased speed and flexibility! As well as an announcer which will try to salute you or make fun of you if you fail too much!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Reperio Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":7090,"name":"Galcon Fusion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/274/274e95a679d9144ca87bc5267d1d5971.jpeg","description":"Conquer the Galaxy like never before!  Galcon Fusion is an awesome high-paced multi-player galactic arcade-strategy game.\nSend swarms of ships to defeat enemy planets and conquer the universe!\nBeautiful new HD graphics\nFull-length interactive soundtrack\nMulti-player, team games, and solo missions\nAchievements and detailed rankings\nVariety of games including Stealth and Assassin\nRetro-mode for when you want to LIVE THE 80's!!\nColorblind support for up to 4 players\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Hassey Enterprises","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":538,"name":"Space Hulk","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c6/6c6e0394aedf0f5d00dacbe13a0f750c.jpg","description":"\"WE ARE THE VANGUARD OF HONOUR.  THE CUTTING EDGE OF THE BLOOD ANGELS.  WE BRING DEATH.\"\nThe legendary Space Hulk returns to Windows PC, Mac and Linux in this epic turn based strategy game. Set in the Warhammer 40,000 universe, an intriguing story of legendary battles and heroic actions unfolds. Play as a small squad of fearless Space Marine Terminators who attempt to reclaim their honor by mounting an assault on a derelict space hulk infested by hordes of vicious tyranid Genestealers.\nTake control of the Adeptus Astartes of the Blood Angel chapter and guide them towards glory, while battling fierce Xenos and uncovering ancient relics in the infested confines of the massive Space Hulk named “Sin of Damnation”.\nThe game is a 3D digital turn based strategy game that recreates the classic claustrophobic board game experience in both singleplayer and multiplayer.\nCustomers purchasing Space Hulk will receive a free copy of the Deathwing Terminator DLC for Warhammer 40,000: Storm of Vengeance by EutechnyxKey Features:The first Space Hulk computer game in 17 years! Available on multiple platforms.\nSet in the hugely popular Warhammer 40,000 universe! Official license of the legendary boardgame from Games Workshop.\nTurn-based tactical strategy game! Based on the popular and iconic board game mechanics.\nBlood Angel Terminators! Fight the ferocious Genestealers with heroes of the mighty Blood Angels.\nFearsome Genestealers with challenging AI! Meet unforgiving hordes of Genestealers!\nThematic 3D environment! Experience the dark labyrinth of a Space Hulk as never before..\nSingle player campaign based on the \"Sin of Damnation\" space hulk! Take on the Sin of Damnation campaign, which includes 3 brand new prequel missions and the 12 missions from the classic board game.\nMultiplayer head-to-head recreating the board game experience against a friend! Get in the hot seat and battle it out with a friend.\nCross platform multiplayer between Windows PC, Mac, Linux and iOS! Play asynchronous against friends and foes on multiple platforms.\nNow with online Co-op mode!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Hoplite Research","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":487911,"name":"Super Bomberman R Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55e/55e953707c6d6421c5d942b45462a14a.jpg","description":"With the new Battle 64 mode, players will automatically be placed in one of many areas at the start of each match, and must battle it out against other players in the same area. Areas will begin to close down as the clock ticks and players must pass through the gates to the other remaining areas before the timer runs out!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":21687,"name":"Carmageddon 2: Carpocalypse Now","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5f/f5f8463c9c205002cab44df7ab7cdf3d.jpg","description":"The world's first high-speed internal organ liberation simulator is back in full 3D! The slaughter is bloodier, the body parts fly further, and the destruction is heavier. Crash and burn through the 3D rendered crowds with the pedal to the metal. Destroy your opponents every which way possible, the more creative the destruction, the better the rewards. No rules, no compromise, NO MERCY!\nCarmageddon 2: Carpocalypse Now is the sequel to the sensational \"Game of the Year\" smash and trash blockbuster from 1997. The creators of the original Carmageddon packed the follow-up with more action, fun, and mayhem! Play chicken with an airplane! Fry pedestrians with the Electro Bastard Ray! All of the fun and none of the responsibility of motorized murder and mayhem in one huge package. What are you waiting for? Gear up and ride out!\n\"Ladies and gentlemen, start your engines! Members of the public, you have ONE minute to reach minimum safe distance!\"\nCrazy range of vehicles and drivers, each with their own personality and driving style.\n30 grueling tracks\n10 manic mission levels\n10 stunning new environments\nAll-new damage model - cars smash apart, and can even split in two!\nAll-new full 3D modelled pedestrians!\nA range of wildlife to mow down - from poor penguins to the mighty moose!\n90 Power Ups (and Power Downs) including user-triggerable ones\nWaste trains, planes, and slaughtermobiles\nReckless driving gains points - annihilate anything and everything in your path\nGreat open world track design allowing complete freedom to explore.\nHidden bonus areas to find.\nLudicrously satisfying, arcade-style gameplay.Heavy metal soundtrack from Iron Maiden and Sentience will accompany you on this hellish ride.\nThe aim is for the player to work their way up the ranking system, from 99th place to first. The player vehicle is pitted against a wide range of computer controlled competitors, in locations such as cities, desert, airport, funfair and even an aircraft carrier. Levels can be beaten in one of three ways:\nCompleting all the laps of the race course, as one would a normal racing game.\n\"Wasting\" (wrecking) all the opponents vehicles.\nKilling all the pedestrians in the area.\nEach level has a time limit, but more time may be gained by passing through checkpoints, collecting PowerUps, damaging/destroying the competitors' cars, and by running over pedestrians (with bonuses awarded for style).\nThese actions also reward the player with Credits, which can be used to make instant repairs or recover the car (after falling down a chasm, for example). They can also be used to upgrade Armour, Power and Offense stats in the Parts Shop between races. This is also the time to switch which car to drive if others have been obtained.\nAs well as opponents partaking in the 'race', some levels also contain a number of Cop Cars, which will activate their sirens and hound the player when provoked. They can be attacked and destroyed, but do not count as opponents. A single \"Super Squad Car\" exists in one level, and it can be claimed if destroyed.\nAn Action Replay with multiple camera viewpoints is available at any point during a race.\nOriginally released for the PC in November 1998, Carmageddon 2: Carpocalypse Now was an instant hit and the Carmageddon series sold over 2 million copies worldwide. Here’s what a sample of the gaming press thought at the time:\n“There are many clever vehicles, the levels are fun, and the physics engine is simply amazing...” - Christopher Allen Allgame.com \"Enjoyment\" 4.5 stars\n“If you love the smell of gasoline in the morning, prepare to take a huge whiff of victory. This is random violence and destruction at its most beastly.” - Joe Ottoson Allgame.com \"Enjoyment\" 4.5 stars\n“Arms go flying, heads pop off and roll into walls, and legs fall off and squirt blood on the ground. This game is not for the peace-loving hippie types.” - Dr.Moo GameRevolution.com B+\n“The physics model is so open-ended, and there are so many silly power-ups, Carmageddon II ends up being entertaining for a long time.” - Greg Kasavin Gamespot 8.3 av. User Score\n“Carma II does for Carmageddon what Doom did for Wolfenstein 3D: takes the concept and fine-tunes it, producing a game that is a ghoulish dream come true for fans of the original... and a kick in the cock for the critics.” -PC Zone 9.5\nCarmageddon 2: Carpocalypse Now is the second of a series of graphically violent driving-oriented video games. It was conceived and developed by Stainless Games, published by SCi and released November 30, 1998 on PC & Mac.\nThe Carmageddon series of games was, and remain, a poster child for video game controversy. The controversy surrounded the game's central premise; that of earning reward for running down innocent pedestrians.\nThe game was notable for its realistic and ground-breaking physics, and for its in-game action replay features. It was also one of the earliest examples of a sandbox 3D driving game, and may have influenced other later games including the Driver and Grand Theft Auto series.\nABOUT STAINLESS GAMES\nStainless was founded in 1994 by Patrick Buckland, a veteran of the games industry going back to the Jurassic period of 1982, and Neil Barnden, who used to have hair like a mammoth. A team of 8 worked on the original Carmageddon at Stainless, and 5 are still with the company today, although a couple of them are now kept manacled in a small padded room in the cellar.\nStainless Games now employs around one hundred dedicated people of assorted gender, height and width. They can all be found dangling precariously from a small chalky rock just off the South Coast of England.\nhttp://www.carmageddon.com/bugger\nhttp://www.carmageddon.com","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Stainless Games","platforms":[{"id":0,"name":"PC"}]},{"id":10363,"name":"Waltz of the Wizard","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c62/c62ccc128513ba6f4d0c638cb621f8a8.jpg","description":"Waltz of the Wizard is a virtual reality experience that lets you feel what it’s like to have magical powers. Combine arcane ingredients into a boiling cauldron with the help of an ancient spirit trapped in a human skull. Unleash creative or destructive wizardry upon a fully interactive virtual world. Travel to new places, finding yourself in mysterious circumstances full of detail and unforgettable atmosphere.\nABOUT ALDIN\nAldin has been at the forefront of the VR revolution since early 2013, developing innovative software products across major VR platforms for PC and mobile markets (Trial of the Rift Drifter, Asunder, Twisted Realms  and Waltz of the Wizard). Aldin is currently working on Ghostline, a new kind of analytics and visualization tool for VR that was used extensively in development of Waltz of the Wizard.\nhttp://www.aldindynamics.com\nAldin’s Ghostline was used in the development Waltz of the Wizard to ensure an engaging and polished user experience. Ghostline is an advanced analytics suite for virtual reality that offers unprecedented insight into how users experience your content. Through a simple setup process and intuitive interface, Ghostline instantly provides unique metrics & visualizations to help identify areas of improvement and evaluate the effectiveness of VR content.\nhttp://ghostline.xyz","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Aldin Dynamics","platforms":[{"id":0,"name":"PC"}]},{"id":428106,"name":"Gloria Victis: Siege","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/455/45550e55d57e629d27abcd02193fc6d1.jpg","description":"Wishlist Challenge\nEXPLORE THE WORLD OF GLORIA VICTIShttps://store.steampowered.com/app/327070/Gloria_Victis_MMORPG\nAbout the GameTHESE WALLS CAN’T FALL\nGloria Victis: Siege is a survival resource management game in the style of This War of Mine, set in the medieval world of Gloria Victis.\nYour homeland is drowning in war and chaos. As a group of civilians trapped under siege, you’ll face the ordeal of surviving the invasion. Though you do not participate in the fighting, the castle’s fate is in your hands.\nSupport the last soldiers standing against overwhelming enemy forces. Craft supplies and manage your resources during the day, and scavenge through the fallen city during the night. You must stand until the rescue comes!ENDURE THE SIEGEYou must support the soldiers with weapons and provisions. The wounded and sick also demand your care. But your resources are limited. You must find ways to preserve food, and develop your infrastructure to use your supplies more effectively.\nSCAVENGE THE FALLEN CITYTake the risk of sneaking into the fallen city plundered by the invaders. Under the cover of the night, you can find precious resources, trade with scavengers and other low-lifes, and help the surviving citizens – or exploit them. But be careful, enemy patrols keep watching the streets. You’re no warrior, so a fight is always the worst option. You must be smart to remain unseen... and alive.\nMAKE DECISIONS, FACE THE OUTCOMEIn a war like this, one dilemma might lead to another and no decision is clearly good or clearly bad. One person’s survival may come at the cost of another’s death, no matter if he’s friend or family. Sacrifices must be made – with no guarantee they’ll pay off. In these desperate circumstances, however, survival means more than just staying alive, as morale is paramount. When you have to choose between sustaining the soldiers’ strength and taking care of your own survival, what will you sacrifice?\nYOUR BACK AGAINST THE WALLA messenger had cut through the enemy lines to bring back reinforcements, but it will take weeks before help arrives. You’ll face hunger, wounds, diseases, and despair – but also the growing tensions between the civilians and the last defenders of the city. The soldiers won’t hold for long without your support and if the defense falls, the invaders will have no mercy. The odds are against you – what will you do to survive?\nTELL YOUR OWN STORYGloria Victis: Siege is developed on a game editor platform we created with the goal of sharing it with the modding community along with the game itself – at the release if possible, or later as a free DLC. It will allow you to create new scenarios for the game from scratch and expand the universe of Gloria Victis with your own unique ideas and stories!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"FishTankStudio","platforms":[{"id":0,"name":"PC"}]},{"id":14267,"name":"12 Labours of Hercules III: Girl Power","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/729/7297627ab762a323a8406c82d61339fc.jpg","description":"Our latest games!http://store.steampowered.com/app/567800/\nhttp://store.steampowered.com/app/545820/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other Hercules adventures:http://store.steampowered.com/app/342580/\nhttp://store.steampowered.com/app/360640/\nTry other Hercules adventures:http://store.steampowered.com/app/396800/\nhttp://store.steampowered.com/app/491330\nhttp://store.steampowered.com/app/567800/\nAbout the GameA hero from Ancient Greece, Hercules, is fighting the great beast Scylla, when lurking Charybdis captures his friend Cerberus! Then, unseen by Hercules, takes the hero himself. The only chance for Hercules is his wife Megara. Help Megara free the hero and then accompany him in all of his adventures, including the forest of the Amazons and Mount Olympus in 12 Labours of Hercules III: Girl Power!\nStunning HD graphics and Windows 8 touch screen support\nCollect pieces of numerous incredible puzzles\nComplete in gold time and build the great castle","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":527422,"name":"Leaf Blower Revolution - Idle Game","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f9/4f946dac48cf28907ed8e57870c0f6d3.jpg","description":"Are you tired of blowing away leaves IRL? Or have you ever wanted to blow away the stupid leaves with a rocket engine filled with nuclear fuel? Then Leaf Blower Revolution is for you!\nPurchase Autoblowers, unlock upgrades, earn achievements, and watch the numbers go up:\nAn idle game you can play actively or passively\nBlow leaves virtually\nBuy tools that help you blow away leaves more easily\nBuy Autoblowers and watch them do the work while enjoying your coffee, tea, or beer\nCollect healthy fruits to progress faster\nPrestige, gain coins, and purchase more upgrades\nUnlock areas to find rare leaves\nDefeat really dangerous enemies by blowing leaves at them\nWatch numbers go up\nAND MORE LEAF BLOWING\nPlay Leaf Blower Revolution now!\nRoadmap for future updates:\nMore tools and upgrades\nMore areas and resources\nMore achievements\nQuests\nLeaderboard\nGuilds\nYour idea? Share your feedback on the discord channel.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Humble North","platforms":[{"id":0,"name":"PC"}]},{"id":51383,"name":"Deployment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b6/8b6e862ebdaf9e0b9dcc5dda5742c927.jpg","description":"Time to DEPLOY! Take your friends and get ready for the epic battles in Deployment, the new multiplayer online top-down shooter game from the creators of the We Are The Dwarves.\nAn uncertain future. Cyberspace. War has broken out over valuable data belonging to megacorporations.\nCHOOSE A CLASS AND GET READY FOR BATTLE:Trooper: A powerful unit with high-speed weaponry. He trusts nothing but his combat-tested rifles.\nPyro: A fast unit with light armor. He absorbs damage and transforms it into firepower.\nSniper: An accurate unit with high-tech bullets. He can become invisible and perform stealth kills.\nLaser: high-tech class. He uses his abilities to steal the enemy's health.\nRPG Gunner: An armored class. He fires powerful projectiles and is very useful in team play.\nUnlock achievements to upgrade your classes. Climb the leaderboard with your friends and become the best player in the world!\nCapture as many Systems  as you can to seize the advantage on every part of the randomly-generated levels.FEATURES\nA fast-paced, competitive, multiplayer top-down shooter\nFive classes with varied weapons and ultimate abilities\nAn original room-control mechanic. Capture Systems to seize the advantage in a room\nVaried upgrade tree. Develop your classes to suit your playstyle\nSeveral modes for playing solo or with friends. Assemble a team and climb the leaderboard!\nRandomly generated battlefields. Every battle is unique!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Whale Rock Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":27102,"name":"Super Mario 3D Land","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d9c/d9c8b7edc78391619566adfeb52b5a9a.jpg","description":"Super Mario 3D Land reinvents everything fans love about Mario™ gaming\nwith the first platforming environment in true 3D, without the need for\nspecial glasses Players will experience an exhilarating new sense of\ndepth, distance and speed while running, jumping and stomping on enemies\nthroughout the levels.\n\nTanooki Mario returns! The fan-favorite Tanooki suit makes its first\nappearance on the Nintendo 3DS. Use the Tanooki suit’s tail to attack\nenemies or float gently down from great heights. These abilities help\nplayers move through the 3D environments with more confidence.\n\n3D visuals make it easier for players to judge the depths and\ndistances in their environments. Players can more accurately judge the\njump to the next platform or how far Mario is from a question block.\n\nNew and familiar abilities add unique game-play strategies to the\nadventure. Mario can perform a rolling somersault attack or run fast\nwith a dash move.\n\nThe Circle Pad gives players complete control to confidently move\nMario through fun and challenging environments.\n\nNew enemies include Goombas with tails, tall stacks of Goombas and a\nPiranha Plant that spits ink to obscure a player’s view.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":11748,"name":"The Next BIG Thing","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/088/088a060a32dad171161ca095d217d47b.jpg","description":"The Next BIG Thing is the new, hilarious adventure gem from the creators of Runaway. A great adventure game in high definition, loaded with laughs, tributes, mysteries and wacky puzzles!\nThanks to a production worthy of a great animated movie, an awesome soundtrack, delightful dialogue and a great art style, The Next BIG Thing will make you live an unforgettable adventure which brilliantly takes players across the fantastic movie genres of a totally crazy Hollywood.\nHollywood\nWhat if horror movies' monsters were actually played by real monsters? And what if they were now forced to play in movies for kids, romantic comedies or even musicals? And what would happen if, eventually, they were to rebel?\nIn that context, Liz Allaire, talented journalist who can't count up to 4, and Dan Murray, a tough macho who can't stand beetles, attend the horror movies award ceremony… there is the starting point of an incredible story, full of twists and turns! Help Liz and Dan solve the numerous mysteries of an amazing adventure that you won't forget any time soon!\nKey features:\t\t\t\t\t\tThe new adventure game from the creators of the million-copy seller, the \"Runaway\" saga.\nProduction, graphics, and sound worth a great animation movie.\nA cast of colorful characters, including some of the most legendary monsters and creatures from fantastic movies that our heroes will encounter during their adventure.\nMany crazy mysteries, puzzles and situations to solve.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":4188,"name":"Tom Clancy's EndWar","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/14b/14b232b342cadf8693e3ecaeaa2ae4d1.jpg","description":"Live the thrilling career of an army commander and lead your army to victory in a massive online World War III! Take control of the U.S.-led Joint Strike Force, the European Enforcers Corps, or the Russian Spetsnaz Guards Brigade in a persistent ongoing World War. Create your army to match your tactical style and create a strategy that will defeat your enemies.\nYou Are In Control\nIn addition to traditional RTS controls (mouse selection, hotkeys), EndWar goes beyond other Real Time Strategy games by letting you use your own voice to control your units, offering you true control at the speed of thought.\nPutting You in the Battle\nInstead of using the traditional top-down view, EndWar employs a unique third-person camera that puts you in the heart of the battle, making the use of terrain and cover even more critical to achieving victory.  Zoom in and out at will and watch the devastation unfold as hundreds of units engage the enemy on fully destructible battlefields.\nArmed for the Future\nTrue to the Tom Clancy legacy, EndWar offers a wide range of vehicles, weapons and equipment based on real-world military research, giving you unprecedented access to the cutting-edge technology of tomorrows wars, such as drones and space-based weapons of mass destruction.\nGo to war online in a persistent multiplayer World War III with fully-customizable battalions and units\nRefined HUD and controls and new waypoint system, combined with EndWars proven revolutionary voice command system\n30 stunningly realistic real-world battlefields set in Europe and the United States, including Washington D.C., Paris, and Moscow\nDeeply customizable armies featuring unit ranks and hundreds of upgrades add up to endless replay value.\nIncludes all the downloadable content released on consoles – maps, additional upgrades and battalions.\nWatch the destruction unfold in spectacular detail in massive battles featuring hundreds of units and destructible environments.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"}]},{"id":3611,"name":"Gravity Badgers","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/885/885393a539d42e91a43afc8fe5bf8356.jpg","description":"Step into the space suit of valiant gravity badger Captain T Bayback as he ventures into the deadly depths of deep space to save his friends, family and the universe itself from the threat of the deadly Evil Honey Badgers, aka the Hellsett. For the first time EVER a game unites the thrilling elements of Badgers and Gravity to create a stunningly presented physics-based puzzle game that will take you beyond the realms of possibility, imagination and logic to the star-dusted realm of the GRAVITY BADGERS!\nThrow yourself into the planets' gravity, dodge asteroids and unyielding deadly bosses in over a hundred levels of vacuum-filled adventure and danger, all united under a stunning art style reminiscent of all your favourite 80's cartoons complete with a thumping mullet rock soundtrack!\nThe game has highly addictive physics-based action with 140 challenging levels that will keep bringing you back for more. And if that wasn’t enough it also has five big boss levels including the giant Space Worm, the deadly Doomsphere and five Gravity Badger characters to unlock. Couple this with an amazing soundtrack and awesome graphics; this really makes Gravity Badgers a quality game that you’ll keep coming back to.\nFEATURES\n• Awesome physics based Gravity Badger mayhem\n• Over 140 levels of Gravity Badger action\n• Ten characters & five Boss levels\n• Stunning HD Graphics​\n• Wicked soundtrack","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Wales Interactive","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3200,"name":"Amnesia: Memories","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2dd/2ddde12b1e12e1cd6de7f8afd6aadf5e.jpg","description":"In this visual novel, you'll play as the Heroine whose life depends on hiding your recent loss of memory while you navigate complex relationships with five men. Choose your romantic path from the start to piece together that which was forgotten.  Will you write the lasting love story you deserve, or will your love – and life – come to an end?\nKey Features\n1.\tSelect one of five guys as your love interest, each with multiple branching story paths. Each choice creates a distinct world where characters assume different roles, allowing for 20+ endings!\n2.\tParameters affect your relationship with your future love. Keep track of your relationship here and make sure you’re not headed to a bad ending!\n3.\tPlay mini-games like Rock, Paper, Scissors and Air Hockey against other characters.\n4.\tUnlock voiced images in the Gallery. Touching certain areas of the image will play dialogue of feelings that couldn’t be previously expressed.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Idea Factory","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"}]},{"id":3118,"name":"Overlord: Fellowship of Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e6f/e6faf1b0f2ff32e89546cd9668a60c4e.jpg","description":"Steam Exclusive Pre-Purchase OfferPre-purchase exclusive offer -\nArtbook and Minion Hat redemption:\nYou can check if you have the art book which will be in the game directory -\nThe Default path for Artbook redemption is C:\\Program Files (x86)\\Steam\\steamapps\\common\\OverlordFOE\nThe hats are available for free from the vendor in the game's central hub (Grubb)\nAbout the GameStep into the warped fantasy world of Overlord: Fellowship of Evil, the dark and twisted Action RPG filled with the series’ signature black humour. Penned by award-winning original Overlord scriptwriter Rhianna Pratchett, Overlord: Fellowship of Evil delivers an epic new quest featuring four Netherghūls – undead servants of the dark arts, resurrected in the absence of a true Overlord, to bring evil back to a world overrun by the forces of good.\nAssisting gamers once again are the mighty, maniacal and occasionally moronic minions, ready to unleash their charmingly chaotic brand of destruction and led by Gnarl, their wise old master, voiced, as before, by actor Marc Silk.\nEmbark on a brand new Overlord adventure in single-player or with up to three friends in local and online single-screen co-op. Filled with fun combat and twisted fantasy tales, Overlord: Fellowship of Evil invites players to dive into an Action RPG where it’s good to be bad, but it’s GREAT to be evil.\nOverlord is the only series that actively encourages players to have fun being the embodiment of evil, destroying all that is good in a subversive, comedic manner. Fellowship of Evil captures this essence and adds in four-way, chaotic co-op play where gamers can even turn on each other. Evil always finds a way...sometimes it just needs a bit of a nudge.Key FeaturesSeries signature dark, mischievous humour  Award-winning scriptwriter Rhianna Pratchett returns with a twisted and hilarious tale of evil, chaos, Minions and the burning desire to destroy all things good!\nDevelop your minions! They’re back! Our cruel critters return. Call upon your minions in battle and build them into dedicated devils to do your destructive bidding. “For the Master!”\nInvade. Smite. Loot! Work your way through the Netherworld and unleash hell on the world above! Trample the weak under your evil size 10s with fun and satisfying combat, combining unique abilities and melee attacks to dominate all who stand before you! Share loot or steal the spoils- how far are you willing to go in the Trials of Evil?\nFour times the players, four times the fun! Evil has a new face. Well, four faces, actually. But who wears the evilist? Er, eviler? You decide! Pick from any of four distinct Netherghul characters, each with unique abilities. Play as a team, or screw each other over – evil never plays by the rules!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":2942,"name":"The Legend of Heroes: Trails of Cold Steel","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/291/2917eaf996afa24584de1f020ce6571a.jpg","description":"Among the nations on the Zemurian continent, the mighty Erebonian Empire has been quick to outwardly stake its claim militarily; yet politically, ugly bouts of internal conflict between the upper class and commoners attempting to rise to power have been steadily intensifying day by day. The Noble and Reformist Factions have been none too kind to one another over the years, and tensions between the two only stand to worsen if compromises aren’t made in the very near future.\nRean Schwarzer, like any other citizen of the Imperial Nation, is no stranger to these rising conflicts: the class system has been deeply embedded into the hearts of every Erebonian since the days of old. As a seventeen-year-old student preparing for his new life at Thors Military Academy, however, he notices that his crimson uniform differs from the standard ones issued to his peers—typically green for commoners, and white for nobles.\nEnter, Class VII of Thors Military Academy. For the first time in the prestigious academy’s history, rank means nothing and skill means everything. With nine hand-picked students of various backgrounds and abilities, Rean included, Class VII readies itself to dive deep into the political quagmire that threatens not only them, but the Empire as a whole.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nTaking place on the same continent as the fan favorite Trails in the Sky offshoot of Nihon Falcom’s storied The Legend of Heroes franchise, Trails of Cold Steel (Sen no Kiseki in Japanese) is the first in the series to tread Erebonian soil and explore the inner political conflicts of this oft-mentioned powerhouse nation in detail. Delve into the expansive lore that has become synonymous with the series, enjoy school life and bond with fellow students to earn new abilities in battle, take advantage of speedy, tactical turn-based combat with the newly-developed “ARCUS” system, and uncover dramatic events that stand to change everything these two opposing social classes stand for.\nKEY FEATURESA World Rich in Depth for Veterans and Newcomers Alike\nThe events of Trails of Cold Steel are expertly told so that longtime Trails veterans and casual RPG fans alike can equally enjoy its detailed, highly nuanced storyline.\nNew Link System Adds Depth to Combat\nTake advantage of the Combat Link System by bonding with your allies throughout the school year, netting you a variety of combat benefits including healing, guarding and more.\nA Sleek Update to a Classic Growth Mechanic\nTrails of Cold Steel streamlines the classic “Orbment” magic system from previous titles with new “ARCUS” units, allowing for more ready access to abilities and quicker customization.\nExperience the Game as Never Before\n50% more lines of English voice-overs have been added to the PC release, bringing a fresh experience to even those who have played it before on console.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":593228,"name":"The Amazing American Circus","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec9/ec901b13386ef03af757e0f165e04b3c.jpg","description":"Your worst fear is the audience’s indifference. Your best weapon is a dazzling amusement. Your artists are your army. Behold, the circus came to town!\n\nIn The Amazing American Circus, you’ll build a circus empire from scratch. Flesh and blood opponents, as well as characters known from the American folklore, will stand in your way to success. You’ll come across violent crimes and social inequalities. As a novice owner of a small and run-down circus, you’ll have to face the historic giant of this industry - P.T. Barnum. Can you defeat him?\n\nThe Amazing American Circus tells a story of the most iconic entertainment in American history. The USA, during the Gilded Age, is a turbulent place. On the East Coast springs up a modern metropolis, while in the west, cowboys and robber barons fight for their business. The new era is coming, and this is the last right moment for the circus to flourish!\n\n\nThis is a place and time where you will have to write your own story and build a circus empire. You take the role of an impoverished owner of a traveling Circus. Through your personal and multithreaded story, The Amazing American Circus reveals mysteries behind a uniquely American form of entertainment, full of bizarre folklore, brutal crime, and social inequality as it depicts a story of a struggle between a newcomer and an industry giant - P.T. Barnum.\nExplore the USA\n\nThe United States was a new, developing country with settlers steadily pushing the American frontier… To reach their public at the time, showmen had little choice but to travel light and fast. You will visit legendary places and meet real historical characters being a part of the American circus heritage. You will plan your trip and adapt your artistic offer to different groups of spectators in a constant struggle to provide hard-working Americans with the entertainment they deserve! The Amazing American Circus is a classic ‘travel’ game. Emerge from the South West and reach the progressive North East while seeking fame, glory, and fortune.\nEntertain the Audience!\n\nDeliver a perfect show in a special card duel between you and the audience. Their boredom is your enemy, and your performances and tricks are the best weapons. Choose your cards wisely and try to figure out the mood of the crowd. What’s attractive in the deep South won’t necessarily work in the industrialized North!\nGather a unique Troupe!\n\nAs the traveling Circus owner, you desperately need to look for new troupe members while competing with other circuses. You will gather an exotic crew of strange individuals who will perform for you, but can you deliver the best shows around while traveling from coast to coast? And remember, you will not become a Circus giant with a bunch of few selected performers. You will continuously have to replace entertainers to make your show attractive for different audiences.\nManage and Expand your Circus Camp!\n\nThe Amazing American Circus brings a unique blend of RPG, tycoon, and a card game. Build a strong deck of cards, improve your troupe’s stats, and manage your circus camp. Unlock new wagons and gain access to new skills, buffs, and items.\n\nUnique story and hateful enemies, magnificent shows with challenging audiences and quests, all of this wrapped up in a writing style of the dime novels from the turn of the 20th century - that’s what The Amazing American Circus offers.\n\nWhat The Amazing American Circus has to offer?:\n\nBecome a legend! Save a run-down circus, gather a troupe of performers, and dare to defy the greatest showman on earth - P.T Barnum himself.\nRecruit and train over 12 different types of circus artists\nTake part in exciting battles on the circus arena using the beautifully illustrated collectible cards\nUpgrade your circus caravan thanks to different types of wagons offering over 100 possible modifications\nMeet both historical and fictional characters deeply embedded in American folklore, such as John D. Rockefeller, Susan B. Anthony, or Nikola Tesla\nImmerse yourself in a story taking place during the turbulent era of the fading Wild West and enter the beautiful and dark world of Native American folklore and the immigrant populace\nListen to a unique soundtrack inspired by classic circus music and American country & folk\n\nThe Amazing American Circus in numbers:\n\n170 hand-illustrated cards\nRecruit and train over 15 different types of circus artists\n12 types of circus artists, among them mimes, strongmen, and acrobats\n12 different circus wagons unlocking new skills and options\n16 different types of audience, whom you have to attract and entertain\nOver 100 modifications and upgrade options for your circus caravan\n90 cities and towns to visit\n4 distinct geographical regions - travel across the American continent90 cities and towns to visit\n1 powerful opponent to defeat - the legendary P.T. Barnum\n1 but epic adventure akin to Buzz Luhrman’s musicals, Ennio Morricone’s westerns, and the classic road movies\n60 minutes of a soundtrack inspired by country and folk music from different parts of the USA","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Klabater","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":41336,"name":"Wasteland 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8c8/8c8e92ef385fb2394a96cee14061c901.jpg","description":"Wasteland 2 is a turn-based RPG, set in a postapocalyptic world. The game is the direct sequel to the original release of 1988, and it follows in the predecessor’s footsteps, trying to preserve the feel of an old-school RPG.\nThe story of the game is in the year 2102, 15 years after the first game and more than a hundred - after the nuclear war. The player will create a platoon of four recruits to the Desert Rangers, and guide them on different quests through the Wasteland. The game’s roleplay mechanics will ensure that every action that you take will have an impact on the story, which makes every playthrough enjoyable and new. \nThe game’s difficulty will often set obstacles for new players, as the sequel is as unforgiving as the original. After three, ten, hundred attempts, the players will realize the need to be always ready for new challenges, and in that, Wasteland 2 shines the most, providing great tests but offering great fruit.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":370260,"name":"Football Manager 2020","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f6/1f6831f3d1fb3f8d5307a951f1fe9185.jpg","description":"Pre-Purchase Offer\nAbout the GameSave the talk for the touchline and walk down the tunnel to a living, breathing football world with you at the very heart of it – this is a world where your opinion matters!\nTalkers talk – but managers make things happen, and ours a special breed.\nThey don’t see problems, only opportunities: the opportunity to prove themselves against the best in the world, to turn a player’s career around, to instil a new philosophy, to push the board for more and end that long wait for silverware.\nThis is a world that rewards planning and knowledge but, unlike other games, there’s no pre-defined ending or script to follow – just endless possibilities and opportunities.\nSo, if you’ve ever thought “I can do better than that”, now’s your chance… Stop talking and get ahead of the conversation.\nHow you get to the top is up to you… you’ll own your decisions, and the consequences they bring.\n-\tBase yourself in 50 of the biggest footballing countries worldwide\n-\tOversee a new era of success at one of 2,500 clubs at every level\n-\tSign the best and mould the future – scout more than 500,000 real players and staff\n-\tCreate your tactical vision and bring it to life on the training pitch\n- \tKick every ball with our most immersive and smartest match engine to date\nNew features, game upgrades and licensing updates will drop on our social channels towards the end of September, so get following now to get ahead of the game.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sports Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20331,"name":"AI: Rampage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0bf/0bf714c4d29c2b775f57a5bb0a6686cf.jpg","description":"Tactical stealth action in a post-apocalyptic settings!\nFight against the robots and reclaim the land! Attempt to survive in a post-apocalyptic wasteland, where it seems like everything wants you dead!\nFeatures: Stealth Action!\nIntelligent enemy AI includes visibility and audibility parameters\nThe use of many of the game's vehicles\nFuturistic weapons and items - Frickin' Lasers, invisibility cloaking devices and holograms!When, finally, the dust of the battle settles, who will stand victorious? Complex intelligence, durability and brute force, or human ingenuity?\nThe choice is yours.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sekerin Productions","platforms":[{"id":0,"name":"PC"}]},{"id":16402,"name":"House of Caravan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f44/f44c3c517d591f4e07978ef59ea02a38.jpg","description":"Taking place in a single mansion in Candlewood, northeast USA, in the early 20th Century, House of Caravan is a sinister adventure filled with dark secrets and vexing puzzles.\nStepping into the role of a young boy captured by strangers on his way back from school, you'll be tasked with exploring the house, uncovering clues as to your kidnapping, while attempting to find a way out.\nBut in this apparently deserted mansion, something doesn't feel quite right.\nWith a gorgeously rendered 3D environment, full voice acting, and dozens of secrets to uncover, House of Caravan is a room escape game with a sinister twist..\nWill you escape?\nKey Features\nUncover a dark and twisted narrative to uncover, inspired by Edgar Allen Poe and classic horror films\nExplore a gorgeously rendered house filled with riddles and conundrums – solve the puzzles to find your way out\nA fusion of narrative exploration and point-and-click adventure – with full 3D and first-person perspective\n60-90 minutes of game time on first play through","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rosebud Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14305,"name":"Art of War: Red Tides","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ce/8ce9813789b777a3d1d0698f464d9188.jpg","description":"Game mechanics:\nIt is as simple as follows\nSet troop: select a race, choose ten units under this race to set up your troop and then join the battle.\nSend troop: you have 18 seconds to prepare during each wave, and you need to observe the battle, speculate enemy’s intention and then send appropriate types and number of units to the battlefield.\nDestroy enemy turrets and base: continually overwhelm each enemy, unleash Commander Skills, cooperate with your teammates, pull down their three turrets one by one, and destroy their base. Simple as the battle is, you will still experience various strategies and tactics in each battle.\nGame features:\nEmphasize teamwork in confronting the enemy\nSupport over 300 units that can fight smart in the fiery battle at the same time\nCommand concisely, play smart, and operate conveniently on different devices\nWith over 120 kinds of units in three races, the game emphasizes Strategic Thinking, the core element reflected in the classic strategy games. It is easy to learn but hard to master.\nMonetization:\nArt of War: Red Tides will adopt “free download + in-game purchase” pattern, and the in-game store will sell neither exclusive items that could influence the match, nor in-game currencies.\nOur heartfelt gratitude goes to:\nThe developer of the map Desert Strike of StarCraft 2. Without the enlightenment of the Desert Strike, Art of War: Red Tides could never be possible.\nThe test this time will have no wipe of progress. We will continue to optimize the units balance and other features, so you may find a lot of adjustments in a period. But never ever hesitate to share your opinions and advice with us, as you can help us make the game better.\nLook forward to your advice and opinions.\nLet’s start our journey, commanders!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Game Science","platforms":[{"id":0,"name":"PC"}]},{"id":13654,"name":"Purgatory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5a/e5a9313d47bb088fd84b1a7257853191.jpg","description":"Most stories end with the death of the protagonist. For Xzus, death is where things started to get really interesting...\nPurgatory is a tactical turn-based strategy game akin to the Heroes of Might and Magic series. Guide Xzus through the immortal realm as he recruits spirits to the cause, takes on waves of increasingly-difficult foes and finally defeat the gatekeeper in order to return to the realm of the living!\nFeaturing:\nEpic pixel art!\nTurn-based strategy!\nExplore the afterlife via an overworld map!\nAcquire and spend skill points on improving your character!\nWork your way through scores of spirit foes!\nRecruit spirits to your cause!\nBreak out of Purgatory and regain life!\nA prequel to the acclaimed Data Hacker series!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Eduard Mirica","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1520,"name":"Roundabout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/497/497a95275e030363e3ca4c679f2849f4.jpg","description":"Roundabout is a '70s B-Movie game where you drive a constantly revolving limousine! Pick up passengers, find secret collectibles, take on dangerous missions, and fall in love in an open world puzzle adventure. Roundabout is the debut title from No Goblin, a studio founded by designers of games like Destroy All Humans!, The Gunstringer, and Rock Band!\nIn Roundabout, you need to pick up passengers and drive them to their destinations. The catch: your limousine is constantly spinning in circles! To move around in Roundabout, you need to time your limousine's movement with the constant rotation in order to curve around obstacles, buildings, and more.\nSet in 1977, Roundabout tells the rise to fame story of Georgio Manos, arguably the world's most famous revolving chauffeur. While driving players around the town of Roundabout, players will learn about the dizzying highs, terrifying lows, and secret loves of a revolving limousine driver. You'll experience the seventies in the only authentic way possible: with full motion video set in the interior of a limousine.FeaturesDrive a constantly revolving limousine through the crowded streets of Roundabout.\n'70s B-Movie Full Motion Video throughout the game adds a new spin to a classic rise to fame story.\nOpen world puzzle action, featuring dozens of twisty streets, collectible pickups, and purchasable properties.\nUpgrade your limousine with new hats, horns, and paint jobs.\nA full suite of challenges to compete against your friends in.\nDedicated eSports speedrun mode. Roundabout is the only official eSport endorsed by a talking skeleton.\nBig Head Mode. Also a number of equally fun game modifiers and extras that are not Big Head Mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"No Goblin","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":678660,"name":"The Darkest Tales — Into the Nightmare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3a/e3a6291e3bebe2c39da28b4c3e56a045.jpg","description":"Wishlist now, the tale has just begun!https://store.steampowered.com/app/1307690/The_Darkest_Tales/\nAbout the GameJoin a stuffed bear named Teddy and his magical fairy sidekick Lighty on a high-stakes journey through a nightmarish realm of sinister dreams and distorted childhood fairytales to rescue Alicia — Teddy’s now grown-up owner. Who else will fight for the life of the girl, if not her once most loved toy?\nThe Darkest Tales — Into the Nightmare is a free-to-play prologue, bringing players into the first two chapters of Teddy and Lighty’s journey across this familiar yet twisted world. Are you ready to leave your dusty old toy box and finally take on a real challenge? Do you have what it takes to hack, slash, and dash your way through hostile lands crawling with deadly traps and bloodthirsty monsters? If yes, then turn the page and immerse yourself in The Darkest Tales.\nHappily Never After\nMeet familiar characters from childhood bedtime stories, but don’t expect any hugs and kisses. The wolves are out for blood, the great beanstalk is crawling with bugs and carnivorous plants, and Little Red Riding Hood… well, she may just slice you up in two.\nTeddy Scissorpaws\nDon’t let looks fool you — Teddy may be soft, but with Lighty by his side, our heroes make for a formidable duo. Turn old scissors into magic-powered swords, needles into powerful arrows and grappling hooks, but use your mana wisely, so you don’t lose your stitches. Remember, all is fair in the race to rescue Alicia.\nAhead Lies Only Darkness\nEach chapter takes place in a recognizable yet distorted fairytale world rife with combat, obstacles, and secrets. Put your skills to the test against tough opponents and bring back hope to dreamlands now engulfed by the forces of evil. Gain experience, master and branch out your skill tree, and reach the depths of the nightmare to come out victorious.\nThe Darkest Tales is a game with deep and mysterious lore. As you progress through each page of this story, you’ll begin to unveil the secrets behind this nightmarish world. How will this tale end? It will be up to you to decide.\n\nProgress saved in the free version will be automatically carried over into the full version of The Darkest Tales.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Trinity Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":490752,"name":"Riders Republic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7b7/7b7f740c7f21ca6028cfc420c3f79a76.jpg","description":"Jump into the Riders Republic™ massive multiplayer playground! Grab your bike, skis, snowboard, or wingsuit and explore an open world sports paradise where the rules are yours to make—or break.\r\n\r\n- Battle against over 20 players simultaneously in a massive multiplayer playground.\r\n- Compete in an all-out mass start race—collide, grind, and fight your way to the finish!\r\n- Customize your character to show off your style to your friends or show up the competition.\r\n- Bike, ski, snowboard, or wingsuit through a seamless open world in Career mode or multiplayer events.\r\n- Go wild on the heights of iconic US national parks like Yosemite, Zion, and Bryce Canyon.\r\n\r\nOffline single player.\r\nOnline multiplayer (2-32 players).","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":51079,"name":"Exo One","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d9f/d9f967e0abfd90eaece03c36d4bb5878.jpg","description":"\"A strange signal... an alien craft... an interplanetary, gravity-defying journey through space and time.\"\nEXO ONE is a single-player, exoplanetary exploration game where you pilot an alien craft capable of manipulating gravity.\nDrift and flow across enigmatic and desolate alien landscapes using a gravity-based movement system. Transform between a sphere and glider to maintain momentum, using the geology beneath you and the clouds above to build colossal speeds and heights. See amazing, high-sci-fi planets, float through boiling cloud formations, slide and roll down hill and mountain faces, and drift toward alien horizons.\nAtmospheric, diffused visuals are merged with otherworldly sound effects and a hypnotic electric guitar soundtrack.\nEnter the surreal and alien worlds of EXO ONE and follow the story of mankind's first mission outside the solar system.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Exbleative","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":45644,"name":"Subsurface Circular","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a01/a01896fcc32b154299f187241adad518.jpg","description":"MEET THE LOCALS, PICK UP THE LINGO\nA detective stationed on the Subsurface Circular investigates a series of disappearances among the city’s robotic working class. Collect words and phrases, then use them in dialogue puzzles to uncover the world's secrets and determine its future.\nInspired by classic adventure games and modern dialogue systems, Bithell Games has created a single session story which respects your time and your intelligence.Key Features\nA mature, polished, one-sitting game.\nDeveloped by the award-winning team behind Thomas Was Alone and Volume.\nA graphical twist on the classic text-based adventure.\nUses 'Focus Points', a unique vocabulary-based inventory system.\nOriginal soundtrack by Dan le Sac.\nComprehensive art gallery featuring the detailed work that went into this world.\nUnlockable ‘BithellBot’, our interactive take on a developer’s commentary.FAQs\nIf this game is ‘short’, what’s to stop me getting a refund when I’m done?\nYou’re browsing Steam, which means you understand the work that goes into games, and are in principle up for paying for ones that entertain you. We hope that after a bit of time with Subsurface Circular, you’ll feel good about the price you paid.\nDo I need to have played other Bithell games to enjoy this one?\nNo. Subsurface Circular tells its own self contained story.\nWhy is the game only available in English?\nAs you can imagine, a text adventure game contains a terrifying amount of text, but more importantly, throughout the game we use the particular quirks of word ordering and double meaning in English to support the combination and recombination of threads. Put simply, other languages are going to be more than a straight translation: They’re going to need rewrites and changed design. Not impossible, but more than we could get done this time around. If the game proves successful, we’d like to revisit this.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bithell Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17752,"name":"Bell Ringer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cb/0cb4094ef430aaf857e7c419b1db9c2c.jpg","description":"Bell Ringer is a fast paced arena PvP brawler with local and online multiplayer. Gather your friends and brace yourselves for some intense fighting! Choose between five unique characters with different weapons, special moves and styles.\nGather your friends and play against each other in local multiplayer! Test your skills against other players online.\nPlay up to four players in either in teams or free for all.\nHone your skills against bots. There are different difficulty settings to give everyone a good match regardless of experience and skill.\nChoose the character of your liking, from the broadsword-swinging Lucia to the fast, nimble, claw-bearing Gallows. All characters have unique play styles, appearances and weapons, try them all out and you will surely find a favorite!\nEach character has several special moves which do tons of damage but drain your stamina.\nFive different battle arenas, ranging in size and style. Explore the different environments- from the mountains in Thundercleft Keep, to the tower at Verdant Outpost. Each battle arena incorporates different tactical and strategic elements, use platforms or ladders to make plays - but watch out for pitfalls!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Night Node Software","platforms":[{"id":0,"name":"PC"}]}]