[{"id":26,"name":"Nex Machina","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec6/ec615a8bee92ca26c14950712f19753b.jpg","description":"Nex Machina is a sci-fi game about fighting robots and saving humans. It is a spiritual successor to the 1982 arcade Robotron 2084. The original game's designer Eugene Jarvis consulted Nex Machina creators.\n\n###Plot\nThe game is set in the futuristic world that was recently taken over by a machines' uprising. The robots try to annihilate humans and send \"Harvesters\" to hunt for them. The protagonist is the last warrior who can stand up for the humankind.\n\n###Gameplay\nThe player controls his or her character from the top-down view. Nex Machina contains six worlds divided by 15 levels. Each world ends with a boss fight. The player's primary objective is to defeat enemies, but there's also an optional objective to save humans scattered around levels.\n\n###Modes\nThere are two main modes. In the Single World, the worlds are consecutive, while in Arcade mode, the player can choose which world to play this time. The game has a local co-op and a competitive Online Arena mode, but no online cooperative multiplayer.\n\n###Combat system\nThe protagonist has several types of attacks. The regular gun can be upgraded by power-ups to increase its range and spread. There are also stronger additional weapons, such as a sword and an energy beam. The game aims to keep the action at a high tempo and puts an emphasis on the \"flow\" and timing. By using the character's attacks in the right progressions, the player can perform powerful combo movements.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Housemarque","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":505918,"name":"Armor of Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce7/ce7c9daceeb5701280e269588742b7aa.jpg","description":"Southern Fronts Giveaway\nAbout the GameIn celebration of SEGA’s 60th Anniversary, SEGA has taken the retro thrill of old school tank battles and polished them up with a modern spit shine, integrating art and models from Relic Entertainment's beloved Company of Heroes series.\nPlay solo, team up against the AI, or go head-to-head in all-out 4 player PVP battles!\nFeatures:\nThree scoring modes:\nDeathmatch – reach the score limit or achieve the highest score within the time limit\nScore Zone – only get points when within the zone\nSurvival – fixed number of lives; winner is the last tank standing\nThree configurations: arcade, tactical, hardcore\nNine game modes in total:\nCrazy Tanks,\nKing of the Hill\nStandoff\nSkirmish\nDanger Zone\nLast Man Standing\nAnnihilation\nCarnage\nExtinction\nFour levels from small to large with destructible scenery\nAI opponents\nFully configurable controls (keyboard and controllers via Steam Input)\nRemote Play Together - invite a friend, let them take a tank*Available until 10am PST / 6PM BST October 19th*","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SEGA","platforms":[{"id":0,"name":"PC"}]},{"id":3133,"name":"The Jackbox Party Pack 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c93/c937ca05b295dceab6de72f69e329ba2.jpg","description":"The sequel to the party game phenomenon The Jackbox Party Pack, featuring FIVE fresh, rib-tickling party games! Games include:Fibbage 2 (2-8 players)The runaway hit bluffing game with over 500 brand-new questions, more than 2x the original! Plus new features, like the deFIBrillator!Earwax (3-8 players)The hear-larious sound-effects game that will leave you up to your ears in laughter!\nCow moo? Huge explosion? Or tiny fart? Which to choose?Bidiots (3-6 players)The absurd art auction game where you draw right there on your phone or tablet. Outbid your opponents for weird art pieces – drawn by players themselves – and win this strangely competitive auction game! Don’t be a bidiot!Quiplash XL (3-8 players)The say-anything, gut-busting Quiplash XL, which includes everything in Quiplash, Quip Pack 1, AND over 100 brand-new prompts!Bomb Corp. (1-4 players)The bomb-defusing nailbiter of a party game! As interns at Bomb Corp., you must defuse random bombs in the office in order to keep your jobs. You’ll probably die, but it’ll be good work experience!\nPlayers play using their phones, tablets, or even computers as controllers – making it the perfect easy-to-join party starter. No extra controllers needed! And, spectators can join and affect some games by playing as Audience members!\nNOTE: This game is local play, but can be enjoyed over streams with remote players.\nNOTE: These games are in English only.\nIt’s a game-night riot in a box… without the box!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":452639,"name":"Returnal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/673/673f27be4c5dbf37ce3ed0ed5ddf9d8d.jpg","description":"Returnal combines side-scrolling action with roguelike gameplay into a third-person shooter where players fight to survive a hostile planet that changes with every death. Players can switch instinctively between firing modes by using a single adaptive trigger and can get right back into the action after dying. PS5's immersive 3D audio brings the alien world to life around the player, helping players navigate the intense positional combat.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Housemarque","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":251484,"name":"Tentacle Locker","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c5/4c5192716fa5ac9a38ae9b6c124961dd.jpg","description":"See a girl you like? Get her in your locker!\r\nUse the arrow keys (or A and D) to move around, and Space to grab.\r\nOnce you've caught a girl, you can take a peak at whats going on inside ;)\r\nWhile watching, use the arrows to advance, or esc to force out.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Desconocido","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":19347,"name":"FlatOut: Ultimate Carnage","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1f/d1fd55f7b29e385259fa857aac7c3b0b.jpg","description":"The game is the third game in the FlatOut demolition racing series. Previously, it was known as FlatOut: Total Carnage.\n\nThis arcade embodies the canon of the genre and preserves the reality of the physical parameters of what is happening on the screen.\n\n###With what to go out on the track and what to expect on it\n\nEach car has forty parts that can be damaged - be careful. Or do not be - experience the pleasure of eight thousand objects that can be destroyed on each track.\n\nEvery scratch, every blow is visible to the eyes and noticeable in driving - and every destruction you inflict is absolutely realistic, like fog, dust, smoke, splashes.\n\n###Your style, your mood\n\nBefore the race, set the style of the race, its mood, choose from a variety of options: arcade, Deathmatch Derbie, race for time and destruction.\n\nYou can choose from forty-eight cars and thirty-nine tracks, in six different environments, from deserts to metropolis.\n\nYou can invite up to eight friends to play, for this there is a multiplayer mode. In this mode, Races, Derbies and Stunts, Deathmatch Derbies, Head-On race mode are available.\n\n###Who are these guys?\n\nIf you are alone, eleven other drivers compete with you. Everyone has an individual style of riding, character and temperament - you will not be mistaken, after meeting them on the track. Here are just a few of their CVs.\n\nJack Benton prefers cars that can perfectly hit - fast, small, but heavy. His aggression exceeds experience - it makes him even more dangerous.\n\nSofia Martinez prefers light cars to drive sharply and drive fast. But she can be seen and on a heavy pick-up truck, by which she tries to split all who can.\n\nJason Walker is unpredictable in everything except one - he always chooses muscle-cars. He uses experience to beat his opponent with feeling.\n\nKatie Jackson is hysterical and aggressive at the same time, she's not a rival, she's a moving obstacle.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bugbear Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3203,"name":"I am Bread","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e5/3e58c2d062472909ab910958185ad00f.jpeg","description":"I am Bread is an adventure game developed by Bossa Studios. The game is set in the same universe as Surgeon Simulator 2013 and serves as a prequel to it.\n\n###Plot\nA paranoid therapy patient starts noticing slices of bread or toast moving in his house. He takes it as a warning from an unknown party or as a taunt. The patient later finds out that the only reason behind the slices of bread being moved around is that the bread became sentient. A chain of incidents with the involvement of the bread leads to the Patient, mister Murton, having a heart attack and crashing his car. After the crash, he is taken to a hospital by the Surgeon that is the main character of Surgeon Simulation 2013.\n\n###Gameplay\nThe players control a slice of bread with the objective of making toast. It is essential to keep an eye out on the edibility meter, as the players can encounter environmental hazards, such as fluids, before turning into a toast. Each level of the game represents a different day of the week.\n\nThe game was thoroughly supported with multiple expansion packs. Several new types of bread were added, such as a baguette, a bagel, or a cracker. The type of bread chosen changes the objective the players have to complete. For example, while playing as a baguette, the players have to destroy all the fragile objects they find in the room.\n\nNew levels were also added to the game. One of which is a crossover with Team Fortress 2 and its sandwich item.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bossa Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"}]},{"id":385614,"name":"Grimm - GameClub","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57f/57f97397220442e71c51f9ba44b67fec_KzipzFC.jpeg","description":"\"New and Noteworthy\" - Apple   \"iGame of the Day\" - Kotaku\nFeatured by Apple in the \"Great Platformers\" section!\nMother has lost her baby!  It is up to you, kindly gamer, to safely navigate the baby's carriage through over 10 worlds of twisted Victorian delights, delivering the lost child home.  Avoid the specter of Mr. Grimm, a shadowy figure intent on stopping you at every turn.  Grimm: Ride of the Perambulator is a unique side-scrolling adventure set in a dark and stylized world.\nGAMEPLAY FEATURES:\n- Use the accelerometer to guide the carriage through over 10 worlds and 8 mini-levels of twisted and macabre delights.\n- Launch the baby from the carriage to solve puzzles and combat villainous enemies\n- Survive the fiendish intentions of Mr. Grimm as he doggedly pursues you, presenting new challenges along the way.\n- Enjoy the unique and handmade art of the Grimm world.\nFaithful gamer, the fate of a small child is in your hands.  Bravery and courage are needed.  Go forth, dauntless perambulator!\n\"Exceptionally well made game with a hint of dark humor and original content. Grimm dares to go in a new direction with physics based platformers, and comes out with a winner. Super addictive and engaging game that’s worth every penny.\" - App Safari\n**************************************************\nGrimm is playable for free, with some sections and features available only to subscribers of GameClub Pro, an optional auto-renewing monthly subscription which also removes ads. Besides the GameClub Pro subscription, there are no other in-app purchases in this game.\nIf you choose to purchase the optional subscription:\n- Payment will be charged to your iTunes account at confirmation of purchase. No charge will be made for the free trial period.\n- Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.\n- Your account will be charged for renewal within 24 hours prior of the current period, at the cost indicated.\n- You can manage your subscriptions and turn off auto-renewal by going to your App Store account settings after purchase.\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable\n- Terms of use: https://gameclub.io/terms\n- Privacy Policy: https://gameclub.io/privacy","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Spicy Horse","platforms":[{"id":0,"name":"iOS"}]},{"id":428208,"name":"Monster Train","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f5/3f58a7b2a2b290994eb798eb72ca3fb2.jpg","description":"Hell has frozen over. Only you can protect the final burning pyre from the forces of heaven and restore the inferno. Monster Train brings a new strategic layer to roguelike deck building, with three vertical play fields to defend.\nNo playthrough is ever the same You’ll never play the same deck twice!\n* over 220 cards\n* 5 monster clans with each very different gameplay\n* Each clan has 10 levels to unlock, bringing new cards to your deck\n* Upgrade your clan specific champion multiple times\n* 88 artifacts\n* Upgrade any card twice\n* More then 30 unique random events\n* 25 covenant (difficulty) levelsVisit powerful locationsTo take back hell, you’ll need to power up. Choose your route carefully, different locations give different benefits; upgrade your champion, recruit powerful units, upgrade cards, gain passive bonuses or duplicate any card in your deck.Strategize to fit your playstyleWith five clans to choose from, each has its own unique and surprising gameplay. Pick your primary and supporting clan to gain access to all cards from both. During your run you will be able to improve cards by mixing and matching upgrades to open up new roads to victory. You can even duplicate your favourite card at special map nodes before facing off against the final boss.\nMultiplayer\nHELL RUSH\nIn the Hell Rush multiplayer mode, eight players compete in a frantic real time contest. Each player has the same resources and opponents to create a level playing field. With the clock ticking it’s a test of who can make the best decisions under pressure. Only a true speed demon can remain undefeated.\nDAILY CHALLENGE\nTake on a new challenge every day with a hugely modified run due to gameplay mutators. Compete globally and against friends, and climb the leaderboards with a skill-focused scoring system.\nCUSTOM CHALLENGE\nDesign your own unique challenge and share it with friends. Each custom challenge has its own leaderboard so you can send your friends straight to hell.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":28089,"name":"Strange Brigade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/336/336fe0c89fdee3e618ff88ae1022e89b.jpg","description":"There are remote corners of the British Empire where the shadows linger at their deepest. The servants of The Crown know about these places and the supernatural beings that sometimes lurk there.\nIntroducing the fearless and unflinching STRANGE BRIGADE!\nEmbark on an exotic safari into DANGER where few dare go and fewer return! Encounter FANTASTIC and forgotten civilizations shrouded in MYSTERY! Uncover TREACHEROUS tombs and unfathomable EVIL, never-before-seen by any human now living!\nThis pulse-pounding adventure will rivet you to your game controller!\nDon’t fail to play: STRANGE BRIGADE!\nFOUR FEARLESS ADVENTURERS!\nExplore the ancient world as one of four dashing explorers, each with their own special powers, weapons and tactics.\n\nA THRILLING 1930’s CAMPAIGN!\nExperience a rip-roaring new adventure for 1-4 players filled with pulse-pounding action, treacherous traps and tales of derring-do!\n\nLEGIONS OF BEASTIES!\nFight-back-to-back against an army of mythological menaces unleashed by an ancient Egyptian ruler so nefarious she was wiped from the hieroglyphs: Seteki the Witch Queen!\n\nHIDDEN TREASURES!\nStay on the lookout for secret caves and buried riches. Get off the beaten track and keep those peepers peeled … what with all those dastardly traps about!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rebellion","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2483,"name":"Table Top Racing: World Tour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/097/097f489f2bea1b5e77aebfc487cec647.jpg","description":"Table Top Racing: World Tour is a racing simulator with the emphasis on its cartoon-ish style of toy cars. The genre is already well-established, and the game continues to use ordinary mechanics for entertainment and replayability.\nThe player can choose between different upgradeable cars, and compete in four different championships. Each map is a racing track in an utterly non-racing environment, such as a kitchen table, children’s playroom and so on. Different race types make the player consider his car of choice, as well as the upgrades, for the challengers are vicious and always tries to utilize every card in their sleeve against you.\nThe game also features a multiplayer mode, where up to 8 racers can compete with each other on various race tracks, for glory or fun. The soundtrack and the graphics style gives the game the look of a real racing simulator while keeping the setting of toy cars, which allows the players to immerse themselves in the high octane world of Table Top Racing.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playrise Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":16974,"name":"Samorost 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/246/24654e315cc125395170b88573d6f96a.jpg","description":"Samorost was a tiny flash game made by a web-design agency Amanita Design, and the sequel was highly requested by the players who were interested in surreal visuals. So Samorost 2 brings back the Gnome, who now has to bring his kidnapped dog back home after completing different environmental puzzles. The game’s story takes the player through the mix of locations that combine futuristic designs and imagery with organic nature settings.\nAs a point and click adventure, Samorost 2 takes the description literally, and there will be no active inventory, and all of the puzzles will be solved by the items presented on the screen, where players will have to click on the objects in the correct order or with the precise timing to solve a puzzle and move to the next screen. This installment of the series includes an original ambient soundtrack by Tomas Dvorak, who received the Original Sound award at the Flashforward Film Festival 2006.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Amanita Design","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17652,"name":"Legend of Grimrock 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d39/d39aeca90fad83dd776730e7c13271d6.jpg","description":"Like the first part of Legends of Grimrock 2, this is an action RPG that focuses on the dungeon crawl. The game draws inspiration from games like the Dungeon Master, adding a lot of modern parts and mechanics. For example, the game has non-linear gameplay and multilayered levels.\n\nThe player gains control of the party from one to four characters and together with them explore 3D grid-based levels from the first perspective. Heroes are prisoners who, after a shipwreck, ended up on the secluded Isle of Nex. The island is full of ancient ruins and riddles, underneath it lies a network of caves and dungeons, which the heroes have to explore. The game tries to concentrate on the exploration and survival of the player offering puzzles from time to time. The game is only available for a solo completion. There are 42 types of enemies here and more than 20 hours of gameplay. And new adventures can be done by using the built-in dungeon editor.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Almost Human Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":6334,"name":"Cook, Serve, Delicious!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/54b/54bce49cb005bf5bc42e1c02c3f72c28_qPUv8xA.jpeg","description":"Cook, Serve, Delicious is a hardcore restaurant sim, one of the few in its genre that gives the players total control over where they want to take their restaurant.\n\nThe game centers on an old, worn down restaurant in the SherriSoda Tower, which was once the heart of the building but closed down as business (and tenants) dropped to an all time low. But with the local economy rising back up and occupancy reaching its maximum, SherriSoda Tower has decided to bring back the old Cook, Serve, Delicious restaurant, and has given you complete control to bring it back to its old five star status of world class dining.\n\nTo do that, you’ll start with a few thousand dollars and thirty foods to choose from to put on your menu, as well as a host of restaurant equipment and more. Nearly everything is unlocked from the start of the game for you to purchase; this is your restaurant, and you must figure out the best strategy to get that restaurant packed with satisfied customers. Can you prove your culinary skills?\n\nAnd if that weren’t enough, you’ll also have the opportunity to be cast in the Iron Cook television show, throw parties for offices in SherriSoda Tower, read virtual mail in your SherriSoda Tower Email account which ranges from game tips to crazy spam (nearly 500 emails in all), from customers providing feedback to your restaurant to opportunities such as being able to fund projects via “ClicknStart” and other big surprises!\n\nThe game draws a lot of inspiration from the original PlayStation game Ore no Ryouri. Cook, Serve, Delicious! was initially a free game that used hand-drawn graphics in its gameplay. The game's author David Galindo wanted to make a sequel for that game, but he had no funds to do so. After publishing his first attempt at releasing a full-scale game, Galindo earned some money that would be used for the development of Cook, Serve, Delicious!\n\nWith hours of content and tons of secrets and unlockables, Cook, Serve, Delicious will provide a big challenge for anyone who’s ready to take their crumbling, rat infested eatery to a luxurious Platinum Star Restaurant. Good luck!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Vertigo Gaming","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":773,"name":"Oddworld: Stranger's Wrath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/546/5464304424db26e3fbc7eaa8b7748f97.jpg","description":"Initially released in 2005 for Microsoft Xbox and later ported to other platforms, the game is part of the Oddworld series. It is significantly different from other installments: here the player takes control over the bounty hunter named Stranger. He catches criminals and gets rewards for them. The final goal is to earn enough money for some mysterious medical operation.\n\nThe player travels with Stranger to four cities: Clakkerz; Gizzard Gulch, Buzzarton, and New Yolk City. One of the features of the game is the use of \"live\" ammo: insects and small mammals. All of them have different stats and are effective against different types of enemies.\n\nThe game uses two camera modes: from the first and the third person. Third-person perspective is used to solve platformer challenges while traveling long distances and in hand-to-hand combat. The game switches to the first person while using the sniper class weapons.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Oddworld Inhabitants","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":15176,"name":"Kabounce","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb2/fb232f5d838e7f8364c666c111541ce1.jpg","description":"A unique twist on pinball with a competitive multiplayer angle, Control the ball and bounce through pinball machine-inspired levels from a third person view!\nKabounce GameplayKabounce is the physics-based, team versus team, competitive pinball game. You control the ball and engage in thrilling, sport-like, pinball matches. Use abilities in game to destroy your opponents and take their points. Slam and bounce between bumpers, rack up points with astonishing bumper and combat combos. Bank your points or risk losing them to the opposition.\nAddictive online competitive action in 4 versus 4\nOffline couch co-op, up to 4-player split screen\nSingle Player Challenges\nExperience and cosmetic unlock system\nMillions of customization combinations to make your pinball stand out\nStat tracking and leaderboards\n4 diverse and unique abilities to customize your gameplay experience\nPhysics based gameplay with multiple uniquely themed pinball arenas\nPlay offline against bots, splitscreen, or on a Local Area Network (LAN)\nOriginal electronic sound tracks\nFull controller support\nKabounce gives you the option to customize your pinball and save it to a load out. Select from a range of skins, modifications, accessories and trails.\nCustomization OptionsSelect a Pinball Base\nAdd a base Modification\nTop Accessory\nFront Accessory\nand a Special Accessory\nChoose a Trail effect\nSave and play!\nKABOUNCE is currently still in development, features may still be expanded upon, added, or revised. Join in on the discussion forums and check back for updates!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Stitch Heads Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9786,"name":"Offworld Trading Company","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02b/02b2367620982ae26d04ed51d5c35505_apw2ZVh.jpg","description":"In the sci-fi game Offworld Trading Company, the player can lead an interplanetary corporation in a futuristic trade war for control of Mars.\n\n###Gameplay\nThe game mixes resource mining and construction used in real-time strategies with a stronger economic element. The player has to choose a company he or she will control. The other three companies become the player's rivals. They seldom fight outright, and their rivalry is largely economic. However, they can secretly organize acts of sabotage against each other, eliminate resources with underground nukes and hire goons to attack or defend. The main goal of the game is to assume control over all four companies by purchasing their majority stakes and to create a monopoly. If a rival company obtains the majority in the player's corporation, he or she loses the game.\n\n###Resources\nThe game puts a strong emphasis on mining and trading resources. Each level starts with the player scanning the surface of Mars to find resources and build his or her headquarters next to them. Offworld Trading Company has thirteen types of resources. Most of the resources, such as iron, aluminum, and water, can be mined from the Martian soil. Some, like steel, food, and chemicals, are produced from other resources and require special buildings. Each resource has a value that can increase or decrease depending on the demand and supply.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mohawk Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":45894,"name":"Spacelords","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f76/f768aa9bd48a535f5853e79257e50488.jpg","description":"Raiders of the Broken Planet - Prologue is free of cost game which serves as a demo campaign for an online asymmetric multiplayer game Raiders of the Broken Planet, which was developed by MercurySteam and later rebranded as Spacelords.\r\n\r\n###Setting\r\nSet in the distant future on a mysterious Broken Planet, the game tells the story of its Raiders who set out to free the planet from the hands of the Antagonist.\r\n\r\n###Gameplay\r\nThe game focuses on the four versus one asymmetric multiplayer horde mode. Play as one of the Raiders with three other players and stand against numerous hordes of enemies or switch sides and become the Antagonist, who will use all means to stop the heroes from completing their objective. The players are free to choose one of seventeen characters to play as. The game also features a so-called Character Card system which allows for the customization of the chosen character. The players can also mod their weapons however they see fit. \r\n\r\n###Controversy\r\nRaiders of the Broken Planet was renamed to Spacelords due to completely changing its pricing model and going free to play. All the campaigns of the game were made available to all the players.\r\n\r\nYet the gunplay got an overhaul. In order to get a new weapon, the players have to grind for a randomly spawning blueprints and then spend large amounts of in-game currency to build the weapon they got. This was met with severe backlash by the users.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mercury Steam Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":15042,"name":"The Culling Of The Cows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/387/38756bb95a4da67b406aab36e4ef653c.jpg","description":"Addictive gameplay of tower defense genre is a simple selling point that carried a lot of games over the line of an impulsive purchase. Some people would buy the game for the design or the setting. Some will get the game to play with friends. But in the case of The Culling of the Cows, it’s the atmosphere and style of the game. Story-wise, players are taking the role of Sammy, unstable and schizophrenic farmer that thinks that only he is capable of stopping the epidemic that spreads over the farm and the city, with the prophetic obsession and validation from God.\nThe game is a short but challenging 2D tower defense game, where players will have to use several guns, and God spells in order to not let the infected cows and other monsters into his barn. The game consists of 40 levels accessed through the world map, that shows what kind of threats are waiting on the level and what kind of assists will be available to the player. For the players that want to get something else from the game after beating it, they can access the Cheat Console.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":7769,"name":"Broken Sword 2 - The Smoking Mirror (Remastered)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3bc/3bc5be3c955655e4ae46dee83f5217e5.jpg","description":"Direct sequel in story, genre and art style, Broken Sword 2 – the Smoking Mirror: Remastered is a remake of 2010 release that takes place 6 months after the events of the first game, where George Stobbart and Nicole Collard visit an archeologist to gather information on the mystery Mayan stone Nicole found while working on a news story. But they’re ambushed and separated, and now George has to escape the burning building, reunite with Nicole and uncover the secrets of a Mayan stone, leading to a lost temple.\nThe game is played like any other point-and-click adventure, where the player controls the characters and interacts with the environments through the mouse clicks, or in case of a PlayStation release through the controller. The game has over 60 characters player can interact with unique voice lines regarding every game item players can get in their inventory. Remastered edition replaced pixelated backgrounds with more detailed ones, fixed the quality of FMV’s and general audio and added fully animated facial features.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Revolution Software","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":34744,"name":"Warcraft 3: The Frozen Throne","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/672/67272c0ae016e71bf46c8e337803d7da.jpg","description":"The Frozen Throne provides gamers with a vast new chapter in the epic Warcraft saga. In the single-player campaign, players revisit the war-torn world of Azeroth. Several months have passed since Archimonde and the Burning Legion were defeated at the battle of Mount Hyjal, yet a new threat has arisen throughout the land. One new Hero per race, each possessing powerful spells and magical abilities. A host of new units, each equipped with new abilities and spells, giving players the opportunity to create diverse strategic and tactical forms of combat. Player-built shops, unique for each race, equipped with items carefully designed to improve and aid the units of every race. Neutral Heroes, available for recruitment by all players, that can supplement and strengthen a player's army with all new spells and abilities. Expanded multiplayer options over Battle.net including multiple new game types, clan and tournament support.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12614,"name":"Sundered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f5/3f511f83640249c3225e40050909301c.jpg","description":"Resist or Embrace\nSundered is a horrifying fight for survival and sanity, a hand­-drawn epic from the ​creators of ​​Jotun.  It is a replayable metroidvania where you resist or embrace ancient eldritch powers. You play Eshe, a wanderer in a ruined world, trapped in ever-­changing caverns filled with hordes of terrifying enemies. Harness the power of corrupted relics to defeat gigantic bosses, at the cost of your humanity. Resist or embrace.Key Features\nBeautiful hand­-drawn art and animation\nTerrifyingly epic boss fights\nUnique abilities that may be powerfully corrupted… at a cost\nHundreds of upgrades and multiple character builds\nDynamic encounters against hordes of enemies\nA mix of hand-crafted & procedural levels\nMultiple endings and over 15 hours of gameplay\nCore Gameplay\nExplore.\nDelve into a procedurally generated dungeon at the heart of a beautiful hand-drawn world. Classic Metroidvania elements such as backtracking, secrets and unlocking new abilities that open new regions are at the core of the exploration experience.\nFight.\nConfront hordes of dynamically spawned eldritch monsters. Put your skills and reflexes to the test through furious melee combat and epic boss fights against uniquely designed enemies. All monster spawns are dynamic, constantly keeping you on your toes.\nDie.\nDesigned as a challenging adventure for seasoned gamers, frequent deaths are part of the Sundered experience. But taking our inspiration from our favorite rogue-like games, death in Sundered is only the beginning.\nUpgrade.\nWhen you die, you respawn in the Hub, where you level up and customize your character. Equip and upgrade a host of unique Perks, stats and special Abilities hidden throughout the world.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Thunder Lotus Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":2468,"name":"Battleborn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9df/9dff3770c2ce5747acb2da33d3b18c02.jpg","description":"Battleborn is a first-person shooter game that features several elements from MOBA and was developed by Gearbox Software.\n\n###Setting\nHumanity fights over the last star in the universe named Solus. Different species had to unite in order to save Solus from destruction by Varelsi. The best fighters of the world are pronounced Battleborn and are sent to fight.\n\n###Gameplay\nAt the beginning of the game of every game mode featured in the game, the players have to choose one of several characters. Every character features their own abilities, skills, and attacks. A loadout system is also present in the game with players choosing three items to carry into the battle with them. Every item can be bought with an in-game currency named Shards. Such equipment enhances your characters abilities or debuffs your enemies powers. \n\nThe players start at level 1 and gain new experience for leveling up after killing enemies or completing objectives. After leveling up, the player unlocks one perk from the character-specific skill tree. These levels are reset on every new game. There are three main game modes available in the game which put ten players in a match against each other. \n\nPlayers also increase their command level after every gain. In Battleborn's meta-game this allows for unlocking new outfits and cosmetics. New gear can be unlocked using loot drops after each match or picked up during one. The game also features loot boxes.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21705,"name":"TIS-100","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38d/38de014fb42ed1844d4a0f250cf876f4.jpg","description":"###The hacker setting\nAnother puzzle game that uses the corrupted computer from the 1980s as the basis for its gameplay. The game uses the Unity graphics engine and came out on three operating systems: Windows, OS X, and Linux. The game was originally supposed to be dedicated to the programming of nanobots, which are launched into the body of a living person, but the developer opted for a more appealing idea for a setting.\n\n###Key features\nThe plot tells a story about the player finding the faulty TIS-100 computer and the manual to it. TIS (Tessellated Intelligence System) is similar to the first computers from the 80s. Each level looks like a 12 program of nodes, located by a grid of 3 to 4. Each node has a processor register, behind which a certain numerical value is hidden. In order to solve the puzzle, the player needs to reprogram the node so that they perform specific actions using a simplified version of the real assembly language. In the version for Steam Early Access, which was released in 2015, 25 levels were available for the completion. Their number reached 50 at a full release. Only a single story campaign is available in the game. The players noted that the game is an excellent exercise for all programmers who want to compete with each other in optimizing the code in a fictional multithread assembler.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zachtronics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":318414,"name":"RobocraftX","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f6/2f64b3cf144ae54188237873a02b8edd.jpg","description":"Robocraft X is a new game built within the Robocraft Universe being developed from the ground up based on a new powerful online physics engine. It is at a very early stage of development at the moment which is why this Steam store page is Unlistedand only available to those who have the url shared with them.\nThe reason we are releasing this extremely early version of the game totally free is to begin to build a community of players who can help us develop this game with their feedback and support.\nThe co-founders of Freejam (original creators of Robocraft) have been hard at work developing a powerful new Robot building online physics engine. It is with this new physics engine that we aim to create - in time - a builders paradise. A game with incredible freedom to build any machine you can imagine and then bring it to life. A game which allows you to play solo, with friends, and competitively against others in a large variety of game modes which challenge your machine building skills.\nNB: The original Robocraft game is still in active development by a separate team and still being regularly updated.\nPlanned features are:\nBuild machines from high fidelity modular components and bring them to life, control them yourself, and even hop in and drive them\nInvite Friends to build with you and pit your machines against each other or play cooperatively in your own locally hosted sandbox\nEdit your machines whilst they are moving, adding and removing parts during simulation, even when playing online\nCompete online with other players pitting your designs against theirs in official events which change frequently on a regular basis\nBuild your own maps and even your own games with in-game editors and share them with the community\nBuild machines at crazy scales from RC Cars to Star Destroying space ships\nFree-to-play","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Freejam","platforms":[{"id":0,"name":"PC"}]},{"id":21233,"name":"Breath of Death VII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/470/47007a1d93022e6210c3af8a3c5b52a7.jpg","description":"The game is a parody of classic RPGs which were popular among the players back in the day. Breath of Death VIII is a 2D adventure in the best traditions of role-playing games of the late 80's, early 90's from the American studio Zeboyd Games. The studio consists of only two people: Robert Boyd and William Stiernberg. The title is a reference to the number parts of Final Fantasy, in fact, the previous 6 of the Breath of Death parts do not exist.\n\nThe player follows the adventures of Dem the Skeleton Knight, Lita the Vampire Techie and Erik the Zombie Prince. Each can be customized using upgrades from the branching skill-tree.\n\nThe developers wanted to abandon the most annoying element in the classic RPGs - turn-based combat and endless random encounters. Therefore, the game uses a hybrid combo system that takes into account several important parameters: the character is chosen and how many moves have already been made. Also, the number of random enemy-encounters in one location is limited to a certain number.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Zeboyd Games","platforms":[{"id":0,"name":"PC"}]},{"id":11428,"name":"Streamline","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/928/928515db0188ec1703eee284d19a4cc0.jpg","description":"Streamline is an experimental game that combines platforming and survival elements. You run on a platform that falls apart and you need to stay alive as long as you can. The world around consists of cubes; you have a physics-based ability to return them to their place before everything is destroyed.\n\nThe game is split into two modes. The Survival is classic: stay on the platform using your powers. The Dash mode adds to the concept a necessity to collect orbs on the same collapsing platform. All changes on the levels are random: there are no identical playthroughs. Every time you play Streamline, you face new challenges and ways to reach the goal.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frostcloud Studios","platforms":[{"id":0,"name":"PC"}]},{"id":4490,"name":"ICO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ef/3ef0dc5bda761da51de4dcb170dcf32a.jpg","description":"It's a classic hit and exclusive for the PlayStation 2. Released in 2001, a minimalistic action-adventure explores a simple concept - the boy meets the girl. However, the approach of Japanese game designer Fumito Ueda made the game a real hit.\n\nThe player takes control of the young boy with horns named Ico. He was kidnapped by a group of soldiers and imprisoned in a stone sarcophagus. The kidnappers plan to sacrifice him, but Ico manages to flee. During the escape, he stumbles upon a girl named Yorda speaking a different language. She is the daughter of the castle’s Queen. The mother is going to use the body of Yorda to extend her life. So begins a long road to freedom.\n\nThe game has many innovative mechanics: for example, the story is told with the minimal use of words, it also used new graphics techniques never seen before on consoles. Despite the commercial failure, the game is recognized as a work of art and is considered must play for all fans of video games.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Team Ico","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":14001,"name":"Penumbra: Requiem","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1c/f1c411c7ceabbc1dbe9daff5a9a5e94a.jpg","description":"Penumbra: Requiem is a survival horror puzzle developed by Frictional Games. It is the third game in Penumbra series of games.\n\n###Plot\nThe game picks right off the end of the last one. Phillip sends an e-mail asking his friend to \"Kill them. Kill them all.\", after which he takes a hit on the head from someone, knocking him unconscious. The main character sets out to escape from the research complex yet again and stumbles upon the notes of another scientist that was also trapped in the complex.\n\n###Gameplay\nThe game features a highly sophisticated physics engine. This allows interacting with in-game items by moving the mouse instead of pointing at clicking at them. The game features no weapons whatsoever and the only option for the players to avoid getting killed is to run away and hide. \n\nUnlike the previous games, Philip can no longer put items in his inventory, yet he can still move them in the world. There are no clues or the characters thoughts present in the notebook. The players have to find keys to activate a portal that leads the players off the level. These keys are usually placed in hard to get spots and require quite a bit of thinking to get to.\n\nThere are two endings present in the game. The ending is chosen by the players themselves and is not affected by the players' actions made throughout the game.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frictional Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":61044,"name":"Breathedge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef8/ef853efdaf6778ca731eec21d1d7d0d7.jpg","description":"Breathedge is an ironic outer space survival adventure game. Take on the role of a simple guy who just carried his grandpa's ashes to a galactic funeral   and found himself in the middle of a universal conspiracy.\nWelcome to Space\nA massive space hearse suffers a wreck in the deep space, leaving the area filled with debris, coffins, dead passengers and yourself. Survive in this interstellar dump, uncover a global conspiracy, save the princess and don’t break your fingers while tapping the keyboard as you travel around the world (keeping your display on for full immersion is advised).More Flotsam and Jetsam!\nIt took a long time for our ancestors  to develop because they had no duct tape. You have it and you know how to use it. With this magical artifact, you can create a vast variety of useless objects and throw them out the airlock! There are also many useful items to be created, but be careful as this may result in completing the game.Fix and Decorate\nWhen all the people around you just hover around in the vacuum doing nothing but playing dead, various tools and gears will help you become the worst noisy neighbor ever. Create a unique space station, provide it with oxygen and electricity, install all kinds of equipment from solar panels to hamster farm, and turn it into a real bachelor pad by stuffing it with furniture mixed with all kind of junk.Honk! Honk!\nYes, you heard that right, it’s your own private car horn! Besides that, you can assemble a small rocket, ride the dead or build a large space shuttle. Transportation helps you move faster, evade obstacles and see the death screen after a head-on collision.Prologue, Epilogue, and Other Nonsense\nSurviving in space is fun, and surviving with a story is even more fun because you can just skip it all to annoy the scriptwriters! Breathedge offers you an intriguing plot with lots of dark jokes, cynical dialogues, an immortal chicken, a mad enemy, as well as badly animated cutscenes and other features of an excellent game.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"RedRuins Softworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":16181,"name":"Polarity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca4/ca4111b9e2efeb0e2472d9ff958d6cd3.jpg","description":"Polarity is a first-person puzzle that continues the tradition of Portal, and a similar visual style is a direct homage to the Valve's game. The player has to get through the 15 levels of the campaign solo or with a friend.\n\nThe plot of the game tells about hiring a player so that he hacks the safest database on the planet. The employer has a lot of money and an unclear motive. The player agrees and, as well as the story goes, it reveals new details about the mysterious customer. Each riddle and each puzzle suggest several possible solutions. This is also facilitated by the physical model of the game. There are two polarities: plus and minus, red and blue. The player can change them to solve puzzles and pass levels. To prevent the player from it, there are dangerous lasers, machine guns, and moving platform.\n\nDespite the developers' claims of the game’s difficulty, the game will not offer unsolvable tasks, and its completion will take just several evenings.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bluebutton Games","platforms":[{"id":0,"name":"PC"}]},{"id":10091,"name":"Gremlins, Inc.","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ff/8ffe8f19d2e764867c8ed625ddf4e368.jpg","description":"This is an intense strategy board game in a steampunk world of corrupt capitalist gremlins who compete for money, political power and prestige. Save and invest, steal and extort, arrest and get arrested – in single-player and multiplayer, with ranks and ladders, team mode and spectator mode. Featuring seasonal content updates, regular tournaments, item drops, full support of Steam Community Market – and more!\n\nHOW DO YOU PLAY THIS GAME?\nGremlins, Inc. is designed for up to 6 players, in multiplayer or in single-player mode (with AI bots). Each player has 6 cards on their hand (replenished from the same deck) and uses them either to move around the playing field or to perform different game actions. There is a lot of interaction with other players, and duels are significantly different from 3-player or 4-player games. You can play until a certain score limit, or until agreed number of rounds, or for time limit. The game offers both custom and ranked sessions (with matchmaking by rating).\n\nCAN YOU PLAY IN TEAMS OR JUST WATCH?\nYes, you can! In addition to custom sessions (where you define the parameters of the session and may optionally set filters for those who can join you) and password-protected private sessions (so that you and your friends can play undisturbed), the game offers team mode (2x2, 3x3, or 2x2x2) with teams of human players and/or AI bots. Gremlins, Inc. also supports a built-in spectator mode, which allows you to watch sessions of other players right from inside of the game, sharing your emotions with players and other spectators through messages and emoticons.\n\nCAN YOU PLAY THIS GAME OFFLINE?\nCertainly! When you buy this game, you get 2 products in your Steam Library: Gremlins, Inc. – the edition that is playable online in single-player and multiplayer modes, with full support of item drops and Steam Workshop; and Gremlins vs Automatons – the edition that is playable offline in single-player mode, without any connection to our server whatsoever.\n\nHOW LONG DOES IT TAKE TO PLAY ONE SESSION?\nThe game offers different session settings to make them fit your available time, and single-player mode offers automatic SAVE / LOAD function at every turn so that you can take a break whenever you want (while multiplayer mode offers re-connect functionality as long as the session is still in progress). A quick duel for 20 score points with a fast timer can finish in under 20 minutes, while a 4-player session for 60 rounds can last for 2 hours or more.\n\nSHORT-TERM AND LONG-TERM STRATEGIES?\nThere are different types of cards in the game (permanent, regular, secret and criminal) and as each card can be used either to move or for action, you will develop both short-term and long-term strategies for making the most out of where you are, and what you currently have in your hand. Normally, you spend half of your game time accumulating resources and building the foundation for the end-game, and the other half trying to control the progress of your opponents (stealing, arresting, initiating player conflicts, and so on). The more you play, the more new strategies you will discover – especially when combining the effects of several cards played in a combination.\n\nMAKE DECISIONS, PLAN YOUR MOVES\nThis is an intense strategy game: make decisions at every round! Plan your moves, then adjust to the actions of the other players and new cards drawn.The design of the playing field and the multiple layers of optional features (that you can turn on or off, as you wish) allow for a variety of strategies. The more you play, the more roads to victory you discover, using a combination of features based on the particular setup of the session.The game offers a diverse resource system that allows for many comeback chances even after you're robbed or arrested (or both). With score, money, votes, malice, income and bribes, the tension often remains until the very last round.The multilayer mode of the game features a system of ratings, ladders and ranked sessions: compete in a specific league, and take part in the regularly organised tournaments with over 1,000 participants. A system of anonymous masks allows everyone to compete on equal terms in a ranked session.Additionally, the game offers over 10 single-player challenges plus the option to create custom single-player sessions with different settings and a different mix of AI bots.Finally, there's the team mode where victory is determined not only by strategic skill, but also by communication and coordination of each team, which is an entirely different layer of game mechanics.\n\nFACTS & FIGURES\n179 cards in the main deck (143 of them – unique): permanent, regular, secret and criminal, each with a hand-drawn steampunk illustration; with each Season update, we keep adding several new cards to the deck.38 events in the Misfortune deck: these are the special events triggered at certain moments in the game, and may affect the current standing of all players to a significant degree, especially when used on a specific opponent.6 special Chaos Cards: this is an optional set of cards available to every player in the game; turn them on or off to change the dynamics of the session.12 sets of Character Abilities: another optional feature that brings to the game special game mechanics unique to each character type; playing with these makes different competing strategies even more pronounced.11 original locations: the Office, the Plant, the Dump, the Marketplace, the Inferno, the Jail, the Casino, the Court, the Treasure, the Bank and the Astral Plane; and 7 original spot types: Risk, Gamble, Police, Income, Bribe, Misfortune and Tribune.Finally, the game took us three years to develop from concept to full release, and we're still committed to continue supporting the community through development of new content. There are currently over 120,000 players of Gremlins, Inc. on Steam from all over the world, including USA, Russia, China, Japan, UK and France. Collectively, players launched over one million game sessions in the three months since its release.\n\nFINALLY, WHO ARE THE GREMLINS?\nYou think that’s just a pocket watch in your hand, a watch that’s a bit late because you keep forgetting to wind it up? No, no and no – you couldn’t be further from the truth! What you carry around is a whole gremlin town packed into this tiny mechanism: a town with its own bank, its own casino… and even its own jail! Gremlins are the microscopic creatures that inhabit any mechanism that they can possibly infiltrate. If a watch or a telescope malfunctions, then it’s probably due to gremlins who took up a residence there.\n\nMore than anything in life, gremlins value money, political power and prestige: prestige that one can claim after completing some sort of a grandiose engineering project. Aside from working on their own projects, gremlins mostly spend their time preventing other gremlins from building something even more grandiose. This they achieve through bribing officials and lying to the electorate, as well through stealing from their competitors - and outright arresting them.\n\nA DISCLAIMER (JUST IN CASE)\nWe felt it important to note that Gremlins, Inc. is not a free-to-play game. Also, this is not a CCG or TCG: you do not need to buy boosters or packs; in every session the game offers the same deck to every player, and everyone's chances are equal.\n\nOUR DLC POLICY\nWe are committed to the principle of continuously updating the game with new features and new game content that come as regular updates, FREE to every owner of the product. At the same time, from time to time we release DLCs that feature fun cosmetic content. If you like it, you can support our efforts by your purchase. However, there is absolutely no pressure to own any of the DLCs in order to play the game or compete in the tournaments. Every player, whether they have DLCs or not, has access to the same game features and the same game mechanics.\n\nThe game also supports crafting: once you find a blueprint of a specific item, you can create as many such items as you wish, as long as you have the required number of charges (you get charges when you convert other in-game items that you do not want, or have multiple copies of). Finally, the game has its own Steam Item Store where we sell a very small number of unique items that influence the item meta-game (but they have no effect on the game mechanics).\n\nONLINE & OFFLINE VERSIONS\nGremlins, Inc. was designed as a digital board game with the multiplayer mode at its heart. However, this is not to say that we don't like single-player – we do, and there's a separate section with the single-player challenges as well as the mode where you can create any custom single-player session that you like! One of the products that you receive with this game, Gremlins, Inc., features both single-player and multiplayer modes, and requires that your game client is connected to both Steam and the game's server at all times – in order to support item drops, Steam Community Market and Steam Workshop. The other product that is included with the game, Gremlins vs Automatons, features single-player mode and is designed specifically to be played offline.\n\nAMSTERDAM AND SINGAPORE SERVERS\nThe game currently supports 2 separate servers: Amsterdam and Singapore. Players are able to check their ping value for each of these servers, and play on the server that is the most convenient. Each server has its own player ladder, statistics and player profiles. Most players choose Amsterdam, since ping to Amsterdam from anywhere in the world rarely exceeds 300. However, as we saw more and more players from the Asian region join the game, especially from China, we added the server in Singapore in order to be able to offer faster connection specifically to these players. We hope that this works well for every player, as good player experience is our top priority. We will continue to monitor the quality of our server/client connection in order to adapt the servers to the changing requirements and we thank you for your patience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Charlie Oscar Lima Tango Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4327,"name":"Quantum Conundrum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a50/a50f57cc5d6baa0d54ae22e039be510d.jpg","description":"Quantum Conundrum is a first-person puzzle-solving game developed by Airtight Games. The director of the game, Kim Swift, was a lead designer of a game called Portal.\n\nYou play as a nephew of a brilliant scientist who is unexpectedly sent to stay with his uncle. The Professor is working on an experiment that goes not according to the plan. The scientist can't get out of a pocket dimension and the house you were staying in is now shattered across four dimensions with different properties. You have to get everything back together.\n\nThe player is able to run, jump and interact with several in-game objects. It is possible to die from hazardous liquids, bottomless pits, falling down from a great height or getting killed by lasers. The levels in the game are represented as the rooms of the house. The objective of each level is to find the exit door and get to it.\n\nThe players can manipulate the rooms traversing through the dimensions. Each dimension has its own physics. For example, in the Fluffy dimension, the objects are much lighter than normal. Players can access only one dimension at a time.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":44764,"name":"Knowledge is Power","genre":"Family","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/16a/16a095b654f590f378210949a9058cb2.jpg","description":"Answer a massive variety of trivia questions to outsmart your opponents, with tactile challenges thrown in to keep you on your toes. This is all about speed and accuracy -- are you up to the task?\nCompatible mobile device and Companion App required. For more information visit: www.playstation.com/playlinkcompatibility.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2017 Sony Interactive Entertainment Europe.  Knowledge Is Power is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":19306,"name":"Serious Sam: The Random Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8ab35c2bd3cf0c700f55521d33047338.jpg","description":"One of three games in the universe of Serious Sam from independent developers. They had the opportunity to create a game in a recognizable setting, and the publisher can promote a new take in the Serius Sam series. The game tries to embrace the action-packed action of the big games but in the RPG genre. Visually it resembles the classic jRPG but plays differently.\n\nBattles are all also turn-based like in the reference, but by using an object or weapon, the player has to move the main character and hit the enemies, dodging their attacks. As the name implies, the main battles take place after random encounters. The main character can be joined by new characters, at levels you can find new weapons. At the end of each level, the player will face a boss battle. The game quite accurately adheres to the style of the series:  a vast number of enemies appears on the screen simultaneously.\n\nThe game is rather short. The story campaign is only available for solo completion.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":18914,"name":"Skyborn","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/865/8657fc8f962f3e76ed1cea190323c4ef.jpg","description":"Skyborn is an RPG driven by the story.  The game resembles the old-school jRPG titles, and made with RPG-maker — a set of software tools designed to make traditional RPGs. \nWith an average playtime of 5 hours, Skyborn offers a world populated with Skyborn race. The Protagonist, Claret Spencer, becomes drawn into the adventure of saving his home city and reclaiming the right on it. The game includes many NPCs — one of the primary focuses was to write down all of the game dwellers' personalities as detailed as possible. The plot of the game is catchy, well-designed and does not look like a typical RPG-Maker game — such titles do not even reach the greenlight often.\nThe gameplay, however, is widely considered to be borrowed from classical jRPGs — the typical mission includes traveling throughout vast locations and bringing the items. Given the low density of playable content, these quests happen to be quite burdening in the sequence of the continuous plot uncovering.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dancing Dragon Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9753,"name":"Rising Storm 2: VIETNAM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e49/e49218a5fe469df9ae3aaa4438599f67.jpg","description":"Digital Deluxe Edition\nPurchase the Digital Deluxe Edition and receive 2 character customization items, 4 early item unlocks and the Official Soundtrack.Exclusive Content 2 Exclusive Customization Items - Camouflaged Boonie Hats for both factions\nThe Official Soundtrack made from original composed music will be available to Digital Deluxe Edition owners after the release of Rising Storm 2: Vietnam.Early UnlocksUnited States Army/Marines\nLowland ERDL Camouflaged Helmet\nDarkhorse Pilot HelmetNorth Vietnamese\nHeadscarf\nCamouflaged Ushanka\nOwners of Killing Floor 2 will receive 4 Vietnam-era weapon skins for the RPG-7, M1911 pistol, Lever Action Rifle and M16 M203.\nThese skins will available in the next major Killing Floor 2 update (TBD).\nAbout the GameRising Storm 2: Vietnam is the sequel to PC Gamer’s 2011 & 2013 ‘Multiplayer Game of the Year’, published by Tripwire Interactive and developed by Antimatter Games, the same team that created the award-winning and innovative asymmetric gameplay of the original Rising Storm.\nFor the first time, the authentic gunplay and visceral first-person action of the Red Orchestra series is coming to an era of automatic rifles, man-portable grenade launchers and more modern weapons systems. Rising Storm 2: Vietnam casts players into a brutal, authentic recreation of the Vietnam War.\nRising Storm 2: Vietnam offers intense tactical action for up to 64 players in battles between the US forces and the Vietnamese, with each force having their own unique abilities and tactical advantages such as Napalm Strikes, Artillery Barrages, surface-to-air missiles, traps, ambushes and more.\nA variety of authentic period weapons available including the M16, M14, M60, M79 and M3 Grease Gun for the Americans; and the Type 56 Assault Rifle (a Chinese copy of the famous AK-47), RPG-7, MAT-49, SKS Carbine and many, many more for the Vietcong.\nWeapons also have a wide range of functionality with in-game implications, including adjustable stocks, attachable bayonets, and a new and advanced recoil system which builds on the already phenomenal weapon handling that the Red Orchestra series is famous for.\n\nPlayers on the US team will be able to pilot 3 different helicopters - the UH-1H \"Huey\" transport, the OH-6 \"Loach\" light recon and the powerful AH-1G \"Cobra\" attack helicopter.\nPlay as both the United States Military and Vietnamese resistance fighters. Rising Storm 2: Vietnam allows players to control either the U.S. Army and Marines Corps or the militarized and guerrilla forces of North Vietnam - the NVA and the Viet Cong.\nEach map faithfully recreates the look of the Vietnam experience and aims to pull players directly into the war with its extreme authenticity to real life.\nMaps will include the famous jungles of Vietnam, but will also cover battles that occurred in cities, on rolling hills, in US Firebases, Rice Fields, Plantations and many more authentic locations.\nGame types include Red Orchestra's classic territory control mode, the new Supremacy mode, for large-scale combat including helicopters, VC tunnels and more, as well as the new smaller Skirmish mode and maps designed for 16 or less players.\nThese new smaller maps are designed to be a more competitive, squad-based experience that reflect the small unit actions that Vietnam is famous for.\nEnhanced squad system that allows players to set up squads as they want them - name them, add their friends, set the squad tag color in game. Once in game, easy identification of your squad in the world and on maps - and dedicated VOIP channels for the squad, as well as bonuses for working together.\nRising Storm 2: Vietnam's focus will be player skill and balance. We won't be locking content like weapon upgrades, improved player characteristics or new armaments behind a rank or experience system. We want to put the tools to succeed in the hands of every player.\nRising Storm 2: Vietnam will allow players to customize their player characters with additional uniform and equipment variants earned as they play. These will include new headgear, clothing, tattoos, glasses and more.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tripwire Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":371832,"name":"Rogue Company","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a4/2a46b3821f99c0fcfe01b56d0a20e551.jpg","description":"Rogue Company is the third-person tactical action shooter that puts the fate of the world in your hands. Suit up as one of the elite agents of Rogue Company, each with their own individual set of skills, and go to war in a variety of different game modes.\r\n\r\nRogue Company is action packed with no shortage of weapons, gadgets, and style. The mission starts now. Save the Day, Look Good, Get Paid.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hi-Rez Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9734,"name":"Warhammer 40,000: Dawn of War III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a73/a73e4a34957fe58b505bfef725492778.jpg","description":"Warhammer 40,000: Dawn of War III is a real-time strategy game developed by Relic Entertainment. This is the third part of the Dawn of War series. \n\n###Plot \nThe game is set in a dystopian vision of the future. In the universe, humanity developed a galaxy empire called The Imperium of Man.\nThe characters include human beings and monsters, such as the Eldar and the Ork races. The story starts at a lost planet called Acheron, where characters discover a deadly weapon called the Spear of Khaine. The Space Marines assemble at Acheron to find the deadly weapon. The main characters come from the main fractions, the Space Marines, the Eldar, and the Orks. The plot revolves around their interactions. \n\n###Gameplay \nThe gameplay is set from the third point of view; the player can shift the screen to see the whole stage. He is also able to choose for whose side to perform: the Space Marines, the Eldar or the Orks. In the multiplayer mode, it is possible to use various skins for each fraction. \n\n###Reception \nAfter the previous game, Dawn of War II, the developers used innovative graphics details, graphics, and new items. The critics highly appraised the game. However, some players criticised it for focusing on multiplayer gaming mode instead of the classic real-time strategy mode.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":723957,"name":"Yu-Gi-Oh! Master Duel","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/06f/06fa9a33188522273623ef314ec4fc3b.jpg","description":"Now you can play the \"Yu-Gi-Oh! TCG,\" digitally, anywhere.\nFast-paced Duels with stunning HD graphics and a new, dynamic soundtrack! Get ready to challenge Duelists around the world!\n\n◇Play Duels at Any Level!\nThe full Yu-Gi-Oh! experience is available for anyone at any Skill Level. Don't worry if you're a new player or if you haven't Dueled in a while, the in-game tutorials will teach you the basics on how to play the Yu-Gi-Oh! TRADING CARD GAME. You'll be given a Deck when you finish to help you start your journey!\nCollect new cards as you progress through the game to power up your Decks!\n\n◇Rotating Tournament Formats\nMix it up and put your Dueling skills to the test! A wide variety of events and tournaments will be available for players.\nBuild and Duel with different Decks utilizing 10,000+ unique cards and special rules unique to Tournaments!\nChoose the tournament YOU want to Duel in and aim for that number one spot!\n\n◇Uncover the Stories Behind the Cards\nThe Solo Mode guides you through storylines of the themes from the Yu-Gi-Oh! TCG. Hone your Dueling skills by completing the stories.\nRecommended for beginners, returning players, and those of you who are interested in learning more about the lore of the world of the Yu-Gi-Oh! TCG.\n\n◇Features\nLink with the mobile app \"Yu-Gi-Oh! Neuron.\"\nView Decklists from Duelists worldwide and improve your own Deck!\nTry the sample draw feature to simulate what cards you could get in your first hand!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]}]