[{"id":971515,"name":"Shadow Tactics: Aiko's Choice","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/650/650029ee2c55793ac07f64390a9afaac.jpg","description":"Buzzhttps://store.steampowered.com/app/1545560/Shadow_Gambit_The_Cursed_Crew/\nJOIN OUR DISCORD\nAbout the GameReturn to the beautiful world of Edo Japan\nSet in Japan around the early Edo period, Aiko's Choice is a stealth strategy game that takes place within the story of Shadow Tactics: Blades of the Shogun. The expansion focuses on one of the main game's protagonists: the kunoichi adept Aiko. She is a master of camouflage and distracts enemies disguised as a Geisha.\nAlthough Aiko was certain that she left her old life behind her, Aiko's former sensei, the cunning spymaster Lady Chiyo, reappears from the shadows to challenge her. Together with her deadly companions she sets out to hunt down the ghosts of her past...Play a team of five unique assassins\nIn the style of the main game, you take control of five skillful assassins, including Aiko, to sneak in the shadows between dozens of enemies. Aiko's companions are just as deadly as her:\nHayato is an agile ninja, who clears the way silently with his sword and shuriken. The mighty samurai Mugen prefers a more powerful approach and can defeat multiple foes at once. Yuki is a young thief, who places traps and decoys enemies towards their deadly fate. The wise marksman Takuma, however, relies on his sniper rifle and distracts enemies with his loyal pet companion Kuma.\nDefine your playstyle\nChoose your approach when infiltrating enemy bases in hidden forest camps or lively Edo period towns. Set traps, poison and distract your opponents – or avoid enemy contact completely. Carefully plan your every move, utilize your characters' unique skills and execute your own ingenious tactics to outwit your enemies on the challenging missions that lie ahead!\nReturn to the beautiful world of Shadow Tactics set in Japan, early Edo period.\nRejoin your favorite characters for another adventure set within the story of the main game Shadow Tactics: Blades of the Shogun.\nExperience a previously untold tale centered around the kunoichi adept Aiko, who must face a vicious enemy connected to her past.\nExplore three fully fledged main missions, set in brand-new environments, and three shorter interlude missions.The expansion includes all the features of the main gamePlay a team of five different characters with their unique skill sets.\nSynchronize your team's actions to strike down your enemies at once with the \"Shadow Mode\" feature.\nChoose between non-lethal or deadly stealth attacks.\nFind dozens of ways to take out or sneak past your opponents the way you want.\nChoose from three difficulty levels to match your skill.\nDisclaimer: You don't require a copy of Shadow Tactics: Blades of the Shogun to play Aiko's Choice. Even though you can enjoy this standalone expansion on its own, we recommend playing at least the first few missions of the main game to get a feeling of the game's mechanics as well as the characters and story!\nWe are very happy to finally return to Shadow Tactics: Blades of the Shogun after all these years, and we hope that we were able to convert that joy into this standalone expansion. Join us on another visit… to Japan, early Edo period.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mimimi Productions","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":787592,"name":"Far Cry Instincts: Predator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/72d/72d3fb52f5cbf0404bb8f22e51494d93.jpg","description":"Based on Ubisoft's award-winning franchise, Far Cry Instincts Predator™ includes two games in one—all new Far Cry Instincts Predator content, as well as the original Far Cry Instincts™ game.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":616671,"name":"The Wandering Village","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/256/2569eafb05406efeebe8c767b45fbc65.jpg","description":"In a world where mysterious toxic spores are contaminating the planet, a group of people seeks shelter on the back of a giant, wandering creature. Become their leader, build their settlement and form a symbiotic relationship with the creature to survive together in this hostile, yet beautiful world.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Stray Fawn Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":267710,"name":"Kingdom Rush Vengeance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9fd/9fde9dff029ee28d81b6dd96341e613a.jpeg","description":"Vez’nan the powerful almighty wizard has returned! Embark on an epic journey as you gather his army and fulfill his devious plans... muahaha. Get ready to show the Kingdom who the real boss is! Fight your way as you conquer the new and the good old realms. Face empires of mighty enemies and clash against supreme bosses in this classic tower defense full of humor and epicness!\nFeatures\n- 16 new towers, each with unique abilities and special powers.\n- Choose your arsenal of towers and make devastating combinations to stop your enemies!\n- 16 challenging stages across three lands ripe for the taking!\n- 9 powerful heroes who will follow your command without hesitation.\n- Over 35 deadly enemies that will put all of your wit and tactical skills to the test.\n- Rush the Kingdom as you bring down 3 mighty Kings in the most legendary of boss fights!\n- New powers and reinforcements to vanquish your foes.\n- 10+ trinkets and artifacts for that extra edge in battle.\n- 30 upgrades to train your army to their best form.\n- 50+ Achievements, hidden secrets and fun stuff for you to play and discover!\n- No Wi-Fi at your Dark Tower? No worries, just play offline!\nGet Lord Vez’nan’s latest news here:\nhttps://www.kingdomrushvengeance.com/\nTerms and Conditions:\nhttps://www.ironhidegames.com/TermsOfService\nPrivacy Policy:\nhttps://www.ironhidegames.com/PrivacyPolicy","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ironhide Game Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":253283,"name":"Combat Arms: Reloaded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7d/f7da26e4902e58b227acf69bce67fd9f.jpg","description":"RELOADED AND RELOADED\nCombat Arms is a fast-paced, multiplayer shooter, designed for non-stop action on various combat zone. Combat Arms longevity positions it at the peak of the online shooter genre, with a sizeable and dedicated community at its heart. A robust clan system ensures that the player base continues to thrive and perform at an elite level.\nJOIN THE ELITE COMMUNITY\nOver 7 million registered players, now it’s your turn to design your own elite merc. Look the part with various customizable features. Reveal your personality in-game and within the community. Meet hordes of elite players who match your skill level.\nPURE COMBAT MODE\nEnter a competitive and fair gameplay with restricted and balance weapon and gear to compete with other team and relying more on your team strategic gameplay. Gather up your comrades and prepare to fight.\nAll equipment for PCM is Free. Enjoy the real Free 2 play!\nCOMBAT GRADING SYSTEM\nCompete to acquire the highest grade and trample anyone who will block your path in standing atop. Compete and rise above them all.\nARMED TO THE TEETH\nOver 600 assault rifles, machine guns, shotguns, rocket launchers and pistols at your disposal. Every weapon plays differently, and mastering your weapon is the key to survival. Keep a finger on the trigger and an eye on the enemy!\nKILLS FOR THRILLS\nEnter a heart-pounding combat environment where every bullet matter. So make it count. It’s kill or be killed, so stay focused to experience the thrill of the win!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Nexon","platforms":[{"id":0,"name":"PC"}]},{"id":37378,"name":"Pro Evolution Soccer 6","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/979/9794beb61b89d46909893f2980eb8d02.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":27519,"name":"Fire Emblem: The Blazing Blade","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/049/049346481c0f988bc2946f857e111834.jpg","description":"After centuries of peace, smoldering rivalries threaten to set the world \n      aflame in a blaze of battle! The drums of war beat, noble houses plot \n      treason, and allies becomes enemies. As Lycia stands poised for war, a \n      shadowy figure manipulates empires for his own ends. Lyn, Eliwood, and \n      Hector are brave warriors that are prepared to fight back the forces \n      that would destroy their homeland. Help them gather other heroes to \n      fight beside them, taking care that they do not fall in battle; \n      otherwise they are lost forever. Plan your strategy and command the \n      field of war as you train and learn each unit's strengths and \n      weaknesses. Become a master tactician, and douse the embers of war \n      before they burn the world to ash!\n    This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii U"}]},{"id":25230,"name":"Spider-Man: Friend or Foe","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e94/e94b92b8fb1795abf3ea54882a75c02c.jpg","description":"Defeat Spider-Man’s most famous enemies, like Venom, Green Goblin, and Doc Ock to add them to your epic array of playable sidekicks in this movie trilogy inspired adventure. Experience ground-breaking\nCo-operative Multiplayer, as Spider-Man or a sidekick, in exotic spots around the globe, including Tokyo, Egypt and Nepal. \nInspired by the Spider-Man movies, this Action Adventure game reinterprets big-screen moments and battles with a humorous twist. Replay chapters with different sidekicks and eventually with Black-Suited Spider-Man.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Beenox Studios","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":22998,"name":"F.E.A.R. Platinum","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6a/f6a3649916fcfd0a6a6f1459d08d8dc5.jpg","description":"F.E.A.R. Platinum includes the original F.E.A.R. and its two addons: F.E.A.R. Extraction Point and F.E.A.R. Perseus Mandate.\nBe the hero in your own cinematic epic of action, tension and terror. A mysterious paramilitary force infiltrates a multi-billion dollar aerospace compound, taking hostages but issuing no demands. The government responds by sending in a Special Forces team only to have them obliterated. Live footage of the massacre shows an inexplicable wave of destruction tearing the soldiers apart. With no other recourse, the elite F.E.A.R. (First Encounter Assault Recon) team is assembled to deal with the extraordinary circumstances. They are given one simple mission: Evaluate the threat and eliminate the intruders at any cost.\nF.E.A.R. Extraction Point\nExtraction Point kicks off where the original game ended – with a bang. As the helicopter which the F.E.A.R. team is on attempts to leave the vicinity, it instead winds up crashing. The F.E.A.R. team is thus forced to seek out an alternate extraction point, all the way battling the now free Alma and her paranormal minions across a destroyed city.\nF.E.A.R. Perseus Mandate\nAs the first F.E.A.R. team and Delta Force fight for control of the situation, a second F.E.A.R. team is sent in to shed some light on Armacham Technology Corporation's (ATC) dark past. As a member of a secondary F.E.A.R. team, you are brought in to discover more information regarding the secret project at the ATC facilities.Hyper-stylized combat for breathtaking cinematic quality action\nGripping supernatural storyline for spine-tingling intensity of play\nAdvanced graphics and physics for visceral movie-like experience\nEnemies with special abilities and A.I. so intuitive it’s like battling living, breathing players","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"}]},{"id":20907,"name":"Bitweb","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/607/607d094269e2f217b144b76e41e97a9f.jpg","description":"Xor the inner and outer gates blocking your character with those of another cell to clear passage.  Score points by collecting items.  Arrows can be shot for defending against the ravenous hounds.  A potion will render you invincible for some time.  Rescuing the Elven Princess will score you double the points.  All will be lost if you don't stash your points in the chest though!\nBig credits to Thebluefish for compiling for windows, without that release would not have been possible! http://swiggidy.com/\nAlso credits to the artists on opengameart.org and the Urho3D engine developers!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"practicing01","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20471,"name":"Reaper - Tale of a Pale Swordsman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f2/6f200b7a3380d53f96b79353fbb7c17d.jpg","description":"Enter the world ripe with magic and monsters. Become the Black Swordsman and slay thousands of enemies in an epic action RPG!\nWar broke between the industrious Imperium and the savage tribes of Wilderness. Demons and carrions have returned to the land.\nPlay all sides and make your own decisions. Take countless quests and uncover the secrets of Wilderness!\nLevel up your character with skills of your choice. Select from more than 30 unique & tiered skills to improve your character.\nLoot gold from slain enemies, find treasures and negotiate quest rewards. Choose from hundreds of exquisite armors, swords and accessories.Features\nDark Harvest Mode. Standalone action game with separate character and inventory. Win a sequence of battles to level and gear up.\nTorken Arena. Face the mightiest Torken warriors in an unforgiving contest for gold and fame.\nDark Shrine. Long forgotten shrine in the woods holds a sinister secret. (Repeatable quest.)\nDark Item Set. Mastercrafted full heavy armor, sword and accessories available at merchants. Jet black and imbued with dark magic powers.\nFortune Teller. Orisee is a master of the Destiny Tarot. For a price, she may steal a card from fate itself.Support and Feedback\nPlease contact support@hexage.net with any inquiry or feedback.\nFollow @hexage for the latest development updates and news.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hexage","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19245,"name":"Silverfall","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d21/d214537fc42e8924316fc2ca1dd3abb7.jpg","description":"Silverfall, a once glorious city, lies in the fantastical Kingdom of       Nelwë, where the forces of Technology and Nature are strongly opposed. Symptoms of this terrible conflict have begun to manifest physically as melded cyberbiologic organics and living steam-driven automatons.\nDrag your hero from the pits of this world and craft him into a mighty champion that can oppose the planet-choking Order of Nothingness. Freedom to evolve in either the technological or spiritual paths is in your hands and you must choose your comrades wisely to provide a balance and benefit to your efforts - but be cautious, any bias in your choices will either corrupt or upgrade the growing world around you.\nCreate & customize your hero (face, sex, skin, hair...) from the 4 Nelwë races (human, elf, goblin & troll).\nYour hero advances without class limits and with more than 130 skills & magic spells at his disposal.\nFreely explore a stunning and immense fantasy world!\nFrom the floating city of Cloudworks, to the volcanic scenery of the city of Blazis.\nRevolutionary light and shadow effects combine with a realistic physics engine which gives never seen before detail to the environment & special effects.\nPlayable with up to 8 players in multiplayer mode through either a LAN connection or on the Internet, with cooperative play or PvP.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Monte Cristo","platforms":[{"id":0,"name":"PC"}]},{"id":19113,"name":"Castle In The Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/050/0501937350e6795cd4910a025c3f088f.jpg","description":"One dark and gloomy night, the kingdom of Alexandria is attacked by an evil sorcerer and his army of darkness! Despite their best efforts to protect their king and their princess, the royal guard falls, one-by-one, to the forces of evil. One knight, unconscious but still alive, awakens on the throne room floor to find that the princess is nowhere to be seen! What's more, the entire city had been overrun by monsters! With sword in hand, he embarks on a death-defying mission to find his princess and to restore peace to the kingdom!\nA game by Matt Kap, the lead artist behind The Binding of Isaac: Rebirth\nA large world heavily inspired by the golden era of video games\nLevel up your knight with wildly different abilities\nAn arsenal of over 100 weapons, armor, items and magic to collect and use!\nOver 50 bosses to find and slay\nMore than 100 different enemies\nFast-paced chiptune soundtrack\nCastle In The Darkness is a fun and challenging shout out to the early days of video games! It's an action exploration platformer with some RPG elements, much like games from the Castlevania or Metroid series. It's super fast-paced, challenging, and full of secrets!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nicalis","platforms":[{"id":0,"name":"PC"}]},{"id":15379,"name":"Disney Infinity 3.0: Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1cd/1cdf41b3a65264042f1fc10dcdf0a449.jpg","description":"Disney Infinity 3.0: Gold Edition includes Star Wars™ to the ever-growing collection of Marvel, Disney and Disney•Pixar characters, stories and worlds NOW with all Disney Infinity Characters and Playsets Unlocked. Together new heroes can join forces with all other Disney Infinity characters and embark on adventures as big as your imagination in the 3.0 Toy Box! Disney Infinity encourages you to play your way, whether you explore open-world creation in the Toy Box or story-driven gameplay inside Play Sets!\nAll Disney Infinity 3.0 Playsets Unlocked:\n- Twilight of the Republic\n- Rise Against the Empire\n- The Force Awakens\n- And More...\nAll Disney Infinity 3.0 Characters Unlocked:\n- Rey\n- Yoda\n- Chewbacca\n- Han Solo\n- Darth Vader\n- Hulkbuster\n- Ultron\n- Iron Man\n- Olaf\n- All Disney Infinity 1.0 Characters\n- All Disney Infinity 2.0 Characters\n- And More...\nEnjoy Disney Infinity with a Full Toy Box!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ninja Theory","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":13555,"name":"Akin","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e5/7e5caf32db419eaa06a542bbc977c061.jpg","description":"In this puzzle, you only have to draw one continuous line.\nWhen you draw on a tile, it will change color from orange to blue or from blue to orange. You solve each puzzle, by making all tiles akin.\nThere are 96 puzzles on \"Normal\"-mode and 96 puzzles in \"Time\"-mode. Each puzzles can have many different solutions. Start with basic puzzles and unlock harder ones.\nThere are also special tiles. The \"Teleport\"-tile, teleports the line to another point in the puzzle. The \"Double Use\"-tile can be used twice, which is requires to solve some of the puzzles\nSteamworks Integrated\nThis is game is Steamworks integrated with achivements, badges, trading cards and more.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ThinkOfGames","platforms":[{"id":0,"name":"PC"}]},{"id":11328,"name":"Eleven: Table Tennis VR","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/133/1336daa65c508b952a1765dc464e6234.jpg","description":"The ultimate Table Tennis simulator. Play opponents in online multiplayer or practice against the advanced AI. With physics designed to be as real as ever achieved in a Table Tennis simulator, you will forget you are in VR.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"For Fun Labs","platforms":[{"id":0,"name":"PC"}]},{"id":11084,"name":"BoomTown! Deluxe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f33/f33df75c9671db51411951a07e7b81c8.jpg","description":"Updated to v1.1.1Update v1.1.1 fixes the Buy All Buildings achievement.\nYou now only need to buy all the buildings in a single scenario to unlock the achievement.\nAbout the GameBecome the greatest mining tycoon of all time. An explosive combination of mining sim and city builder. Your dream of building your own thriving town starts with few explosive charges and a yellow truck. As you mine the landscape and the money starts to roll in you'll be able to expand and manage your business empire, buying buildings, shops and facilities. Soon people will be rushing to set up camp in your fledgling town. Then the real challenge begins...\nAn in depth array of tools, graphs and stats are available for you to maximize your town planning strategy. Keeping the townsfolk of your western town happy is essential, happy citizens spend in your shops and build ever larger and grander houses turning your once small town into huge metropolis.\nDirt, crime, illness and power outages are just some of the problems you'll encounter as your town grows forcing you to make tough decisions. Bulldozing settlements to build a prison is sometimes for the greater good. As space becomes a premium, using explosives to deforest the landscape just makes good business sense. With procedurally generated landscapes, loads of mining upgrades, buildings and the gold market to negotiate every game of Boomtown is a unique test of your strategic management skills.\nTest your skills over 5 varied scenarios each one requiring a different approach to maximise your population and each with a unique set of rewards and complexities that need to be mastered for you to become a true mogul.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ish Games","platforms":[{"id":0,"name":"PC"}]},{"id":10736,"name":"Lethal Brutal Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db6/db66d866a02e4d297ebd976097d67494.jpg","description":"Little racing indie project.\nYou will be involved in violent races full of explosions, gunfire, jumps and dangerous obstacles on the tracks.\nTake part in the races, and try yourself in the career of brutal races.\nYou have to go through 25 different routes (on the beach, above the lava, in the desert), competing with different riders. Each level you will receive messages from your rivals, and an invitation to take part in the race.\nEarn money and place upgrades on a wheelbarrow: nitro, engine, tires, armor, rockets. Buy new cars, equipped with more powerful weapons to get to the elite races.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Petrodiy-Games","platforms":[{"id":0,"name":"PC"}]},{"id":10614,"name":"Dead Realm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8d/b8de1a1d92c1907683c266c54bf5f308.jpg","description":"Ghosts prey on the living inside the haunted grounds of a long dead electricity tycoon. Dead Realm is a creepy multiplayer action game with immersive and horrifyingly beautiful environments. You’ll either play as Human and work with your friends to run, hide, and survive or you can play as a Ghost and reap the living.\nDead Realm is a first person action horror game where players are split into two sides, the living and the undead. Originally an Early Access game, Dead Realm was developed with community feedback to make a fun, fast paced action game which emphasizes stealth and survival over strength. Often times, staying hidden is your best chance to survive and win.\nThe world of Dead Realm exists on another plane where ghosts of all shapes and sizes seek to reap those who dare to enter their domain. Players can select from multiple modes and pay across 9 varying maps, making sure players can never be scared the same way twice.\nFeatures Include:\n- 5 Terrifying Game Modes; each with a different theme and set of rules. Some favor stealth, others favor teamwork, all will make you afraid of things that go bump in the night.\n- Ever wanted to fight back against the undead? You can now with our mode, “The Hunted,” which combines the atmospheric experience of Dead Realm with FPS mechanics.\n- 9 immersive, horrifying maps, ranging from sprawling outdoor mazes to tight quartered buildings. Each map brings new depth and adds new variations to our different mode.\n- A selection of frightening Ghosts (and alternate skins for each) so players can pick a ghoul to best suit their mood and playstyle.\n- 10 Special Characters, based on some of the biggest Gaming Video and Streaming personalities in the world, each one made in collaboration with the influencer.\n- 10 Humans to choose from, each with unique unlockables, emotes, and style.\n- Multiple Enhanced Abilities for ghosts and humans designed to fit strategic, patient, or aggressive playstyles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Section Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3418,"name":"Desert Ashes","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50c/50cf8414e2305317736468f2e271c2d7.jpg","description":"Desert Ashes is a turn based strategy game with online multiplayer and single player campaigns which also boasts an innovative menu system allowing players to enjoy multiple games at once.\nThe Day-Night system adds a dynamic twist to turn based battles including weather conditions that can affect the battlefield map, for example, all bodies of water have the ability to freeze over night!\nOn top of this, Desert Ashes offers its players special unlockable perks to customize their armies with, for example, The Fort Toughness Perk that adds 20% DEF to all allied units at a structure, and the Vampire Perk that gives players to convert 20% attack damage to HP between 10pm and 5am!\nExperience also exciting single player campaigns that allows the player to experience playing as both the winged crusade and the landians.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nine Tales Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3353,"name":"RISK","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/5345169c91df296b2c8611bf39ebed6a.jpg","description":"Draft! Attack! Fortify! Play the original game of strategy and world domination — now for your PC.\nEnjoy the classic look and fun of RISK in an exciting new interactive experience. Play two ways as you strategize over the map and set out to conquer the world. Test your power against computer enemies, or compete with friends in Hotseat multiplayer. Use strategic thinking and tactical gambles and earn a host of achievements as you take territory after territory. Can you lead your army to victory?\nFeatures\nThe original board game of strategy — now on your computer\nFace up to 5 AI players trying to keep you from world domination\nBattle friends on the same computer in Hotseat multiplayer\nJust pick up and play — it’s easy to learn and control\nCustomize the gameplay options like starting territories and card-set values\nEarn scores of medals and awards as you progress toward victory\nCan’t play the whole game at once? Just pause and resume whenever you like.\nNew to RISK? Follow our easy tutorial and you’ll be ready to take on the world!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":1914,"name":"Angry Birds Star Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c44/c44e6b06e90235bf8558636ec1efae8b.jpg","description":"JOIN THE ANGRY BIRDS IN THEIR BIGGEST ADVENTURE YET!\nA long time ago in a galaxy far, far away... a group of desperate rebel birds faced off against a galactic menace: the Empire’s evil Pigtroopers!\nRebel birds, striking from a hidden base, have won their first victory against the evil Imperial Pigs. During the battle, Rebel spies managed to steal secret plans to the Empire’s ultimate weapon, the PIG STAR, and are racing to deliver the plans to the Rebel Birds. Now they need your help!\nJoin an epic adventure with the Angry Birds in the legendary Star Wars™ universe! Use the Force, wield your lightsaber, and blast away Pigtroopers on an intergalactic journey from the deserts of Tatooine to the depths of the Pig Star -- where you’ll face off against the terrifying Darth Vader, Dark Lord of the Pigs! Can you become a Jedi Master and restore freedom to the galaxy?\nTime to grab your lightsaber and join the adventure! May the birds be with you!\nHOURS AND HOURS OF ENGAGING GAMEPLAY - Explore more than 100 levels in iconic locations like Tatooine and the Pig Star. Can you dodge Imperial pigs, laser turrets, Tusken Raider pigs, and the dark side of the Force to get all three stars?\nNEW GAMEPLAY MECHANICS - Use lightsabers, Blasters and Jedi powers to wreak havoc on the Imperial Pigs!\nLEVEL UP YOUR BIRDS - Keep playing and level up your birds to improve their skills!\nSECRETS AND HIDDEN GOODIES - Can you unlock all the R2-D2 and C-3PO bonus levels?\nFREE UPDATES - This is only the beginning of the epic saga!\nTHE MIGHTY FALCON\nStuck on a tricky level? Earn stars and call the Mighty Falcon to rain down the destruction. New goals, achievements and gameplay!\nPATH OF THE JEDI\nThe ultimate training ground for a Young Jedi, this episode features 40 Dagobah Challenge Levels with Jedi Master Yoda! Master the Path of the Jedi to unlock the ultimate Lightsaber! Available as an in-app purchase, or by earning three stars on every level.\nFollow @angrybirds on Twitter\nWatch the videos, read the comics and submit fan art at angrybirds.com/starwars\nLike us at facebook.com/angrybirds and say hello!\nTerms of Use: http://www.rovio.com/eula\nPrivacy Policy: http://www.rovio.com/privacy\nThis application may require internet connectivity and subsequent data transfer charges may apply.\nImportant Message for Parents\nThis game may include:\n- Direct links to social networking websites that are intended for an audience over the age of 13.\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.\n- Advertising of Rovio products and also products from select partners.\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Exient Entertainment","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"}]},{"id":1540,"name":"Project Root","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17c/17c034c1170060f3af1a7578a29b99b5.jpg","description":"Prometheus Corporation is the leader in the generation and distribution of energy to all cities in the world. Due to the ideas and designs of charismatic president Demetrio Watts, the corporation developed new technologies producing higher quantities of energy at a lower cost, granting them near-absolute control of the market.\nThe friendly policies enforced by Prometheus and Demetrio Watts has made citizens confident they will have access to electricity in their houses every day. However, very few of them are aware of what's behind Demetrio Watts' smile or behind the scenes in Prometheus Corporation. Secret plans. Terrible plans. Plans which will take the population by surprise. When they realize what is going on, it will already be too late.\nA group of rebels are the only ones who know Demetrio and his company's true intentions, and will do everything it takes to bring the truth to light about the person who pretends to be their eternal benefactor. It will not be easy or agreeable, but the danger behind what Prometheus hides within is a threat to all. Stopping Demetrio Watts is in the hands of a group of unknowns. Depends on Arcturus.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Reverb Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":985992,"name":"Fallout: London","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f68/f68b50c69364afcd040c336b68126a3a.jpg","description":"Fallout London is a total conversion mod made by Team FOLON® for Fallout 4 GOTY and requires you to own the base game on either GOG or Steam.\nHow to install and play Fallout London:\nIf you own Fallout 4: Game of the Year Edition on Steam, please click here to access the installation's instructions provided by Team FOLON®. You will have to downgrade your version, then install the Fallout: London via our dedicated launcher.\nIf you own Fallout 4: Game of the Year Edition on GOG, since our version is directly compatible with Fallout: London, you will only have to follow these easy steps:\nInstall the English version of Fallout 4: GOTY Edition via GOG GALAXY and disable your cloud saves.\nGet Fallout London in our store for free.\nInstall Fallout London via GOG GALAXY and launch it.\nFollow the launcher’s instructions, and enjoy!\nA Polite Disclaimer\nIn typical imperial British fashion, Fallout: London will take over your Fallout 4 installation. Installing Fallout: London will make irreversible changes to the default Fallout 4: GOTY Edition installation. You’ll also need to disable cloud saves (as the save folder is shared between the game and the mod). If you’d like to play the default Fallout 4: GOTY Edition again, you’ll need to uninstall the game and the mod, and then reinstall Fallout 4: GOTY Edition.\nSummary\nFallout: London lets you explore a dishevelled London set in the Fallout universe. It overhauls Fallout 4 with a new story, new weapons, London-centric items and a vast recreation of the ruined city to explore.\n\nFallout: London is a free total conversion mod for Fallout 4, available to anyone who owns the base game and all of its DLCs. It is developed non-commercially by Team FOLON, many of whom are proud London residents or expats.\nAbout This Game\nThere has never been a better time to sample the capital’s delights! Fallout: London lets you explore the wonders of the city 160 years after the bombs have dropped, and 40 years before the events of Fallout 3. You can now reimagine Fallout in a London-centric universe, interacting with a brave new world of London-based locations, stories, factions, creatures, weapons, and gameplay mechanics.\nFeatures\nProtect and Survive!\nThe Gentry-dominated London stands on a knife-edge, and you may be the key to which way the guillotine falls. Play a new story set in London with a fresh character beginning, numerous conflicting factions to engage with and multiple story paths and endings with up to 90 hours of gameplay. Just be aware of what terrible secrets you may uncover in the shadowy gaps amidst the halls of power.\n\n200 Quests to change London’s future\n20 Factions bickering for power\n7 Companions to bring along on your journey\n15 Boroughs crafted from the ground up, bringing you a new warped and broken London\nExtended Dialogue System to bring player-choices to the table, carve your own story!\nOverhauled Original Soundtrack to bring personality to each nook and cranny\nOriginal Voice Acting from all major characters, gangs, and factions\nAuthentic London Flair!\nDiscover new weapons, creatures, clothing, items, collectables, architecture, foliage and NPCs to complete the London setting. Interact through the world with your custom Atta-boy, with a fresh interface based on the UK’s life-saving Protect and Survive nuclear information campaign.\n\nBuild back better with 7 unique settlements\nNew craftable items with a plethora of new weapons\nDynamic new animations to bring life\n","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Team FOLON®","platforms":[{"id":0,"name":"PC"}]},{"id":801553,"name":"The Last Case of Benedict Fox","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f5/0f573a7c772decd973c41aa54da2ecd6.jpg","description":"Take on the last case of Benedict Fox and dive into a twisted world of secret organizations, forbidden rituals, and cold-blooded murders. Explore the memories of deceased victims as you search for clues and fight demons in this fantastical Lovecraftian Metroidvania.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Plot Twist","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":290928,"name":"The Tenants","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b56/b563d1b39f2be411d0384ee9d5ead2f3.jpg","description":"Decide which tenants you want to make business with. React to various situations... you never know what's gonna happen: annoyed neighbours, problematic tenants, police involved? Gotta stay alert!\nDesign your apartments and give them a polished look. Get rid of that old paint and buy some new furniture or just change the floors. Do not overdo it though! The better it looks, the more money you make.\nInvest wisely to achieve maximum profit. Keep an eye out for the best bargain, and strike when you see an opportunity. Are you into risky deals, or you just want to play it safe? The choice is yours!\nBecome a landlord and get involved in real-estate. You are the one in the driver's seat. Stay calm, focused and ready to make your bussiness rise all the way to the top!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Ancient Forge Studio","platforms":[{"id":0,"name":"PC"}]},{"id":55132,"name":"Street Fighter II: The World Warrior (1991)","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40b/40b529990743d2515760b1909eb61020.jpg","description":"Street Fighter II is a fighting game. Players select from one of eight characters: Ryu, Ken, Blanka, E. Honda, Zangief, Chun Li, Guile and Dhalsim to do battle with. They must then use their combat strengths to defeat the other seven fighters followed by four boss characters: M. Bison, Vega, Sagat and Balrog. Each character represents a certain country and has his or her own reasons for wanting to win against the others.\n\nEach character has his or her own selection of basic fighting techniques based on three styles of punches and three styles of kicks. The effect of each of these changes depends on the characters orientation (ducking, airborne or standing still). Street Fighter II has a \"button combination\" style of gameplay used to unleash powerful moves specific to each character. These include the ability to project fireballs, channel electricity or capture the opponent in a tight suplex.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Capcom","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Genesis"},{"id":0,"name":"PC"},{"id":0,"name":"Game Boy"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Atari ST"},{"id":0,"name":"SNES"},{"id":0,"name":"3DO"},{"id":0,"name":"Commodore / Amiga"}]},{"id":38946,"name":"StarСraft II: Legacy of the Void","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc7/cc7caf0e38a065f75d9030999e50c671.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28577,"name":"Ninja Gaiden 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c6e/c6e59ac06976a364c1e8ed3b90d5b0a5.jpg","description":"Ninja Gaiden 3 takes players on a journey with their hero Ryu Hayabusa once more, but this time they’ll see more from their protagonist than they ever imagined. For the first time, we look at the world through Hayabusa’s eyes, and find out what drives him.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":24033,"name":"Golden Sun","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/00c/00c36514a5db26f48f47425ddf40767d.jpg","description":"Alchemy served in the building of Weyard's great civilizations. But when\nwar began to consume the land, the power of Alchemy was sealed into four\nElemental Stars. Forces of darkness are now pursuing the lost art of\nAlchemy, and as they draw ever closer to their foul purpose, mankind\nhangs in the balance.\n\nYou and your companions are the last hope. Use noble weapons, magical\nPsynergy and elemental creatures known as Djinn for the upper hand in\ndangerous battles. Combining Djinn in different ways will allow you to\ncreate powerful spells and attacks against deadly foes. Can you prevent\nthe oncoming darkness?\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Camelot Software Planning","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":21141,"name":"Déjà Vu: MacVenture Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/539/539d898b3f5e741653b5e9e8cb63d82d.jpg","description":"You wake up in a bathroom stall in a seedy Chicago bar with no idea of how you got here or, for that matter, who you are. You’ve dealt with the effects of benders before and this ain’t one of those. As you shake your head (hoping some memories might shake loose), you notice a ’38 hanging on the door. You check the chamber – six shells – three of them empty. That can’t be good. You gather your trench coat, stumble up the stairs and find some stiff slumped over a desk. There’s three bullets in the guy. Yeah, this is gonna be a bad day.\nThe original Macintosh AND Apple IIgs versions are back, featuring gumshoe detective Ace Harding! Come see where the world of first-person adventures started and experience the classic 1940′s noir game as it appeared in 1985.Déjà Vu: MacVenture Series Key Features\nTwo Original Versions: You get BOTH the Macintosh and Apple IIgs versions, restored to their original glory!\nFirst Person Adventuring: Over 50 game rooms of Noir adventure.\nDrag and Drop: Utilize the classic, groundbreaking windows-based, drag and drop object system.\nPuzzles: Tons of great puzzles.\nCustomized UI: Move the UI around to suit your needs and resize the retro graphics to full screen.\nSave System: Save your progress at any time – create as many save points as you wish.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zojoi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18265,"name":"The Haunted: Hells Reach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59e/59e77430e9ff6bba250e1a6c80f37712.jpg","description":"All Hell Has Broken Loose!!!  The Haunted is a fast paced third person action horror game that focuses on delivering an intense multiplayer experience. Your goal is to liberate cursed places and survive the assault from the minions of Hell. The game features several multiplayer modes such as co-op survival, demons vs. humans and demonizer.\nKey features:Addictive cooperative online and offline gameplay for up to 4 players!\nMultiplayer versus mode! Humans vs Demons in exhilarating and distinct game modes “Battle” and “Demonizer”.\n8 larger environments with unique level events such as meteor showers and lightning storms which affect the gameplay.\nOver 30 upgradeable weapons and hidden special weapons and items.\nFree future updates and DLC!\nCustom level and modification support!\nPowered by Unreal Engine 3.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"KTX Software","platforms":[{"id":0,"name":"PC"}]},{"id":14870,"name":"Streets of Rage 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abb/abb14126d559b9c36b80e194dbb5330b.jpg","description":"Just UpdatedAll SEGA MegaDrive/Genesis titles now launch using the new SEGA MegaDrive/Genesis Interactive Hub, with all new features, UI and Steam Workshop Support!\nAbout the GameThe mysterious crime boss Mr. X has enlisted the help of Dr. Dahm in creating lifelike robots to replace key city officials, and soon will be able to run the entire city by\nremote control.\nStrategically placed bombs are being used to distract the city police while Mr. X deals with the city leaders one by one. Now it’s up to our four heroes, Blaze, Axel, Skate and Zan to prevent a catastrophe from unfolding.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Genesis"},{"id":0,"name":"iOS"}]},{"id":14553,"name":"Race.a.bit","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b3/0b30c93eb0f5515a0d55c38cd151eaf4.jpg","description":"Experience the thrill of retro racing on crazy tracks in the very first social racer – completely in the style of 8 and 16-bit classics. Enjoy the reinterpretation of old-school gameplay in combination with perfect controls and the driving beats of unique artist Bit Shifter!\nBe creative: Race on self-designed tracks and share them with people all over the world! Countless level objects and a user-friendly editor offer you virtually infinite possibilities to let your creativity run free.\nCompete against friends and the highest ranking players and beat their times on original tracks and maps created by them! Fight your way to the top of the global leaderboards!\nThanks to pick-up-and-play controls, you can jump right in and you'll soon be drifting through the bends and speeding along the virtual tarmac like a pro!\nFEATURES\nA large selection of tracks and vehicles\nPowerful level editor with countless objects and functions\nVarious control modes to suit everybody's style\nFresh interpretation of the 8-bit/16-bit style racing games\nFantastic soundtrack by Bit Shifter","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":13129,"name":"Trip to Vinelands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c00/c004b2423a5353b9807ef0d2ab91fcc0.jpg","description":"Trip to Vinelands is an arcade retro hardcore maze wanderer minigame. A weird underground-indie experience for your desktop with original audio and art.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Walter Machado","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10708,"name":"Affected Zone Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/459/4594551d16051bf796942ad89464fd3a.jpg","description":"Welcome to Affected Zone Tactics, a tactical online game with cooperative turn-based PvP combats. Travel through the Tesla portal to a dangerous parallel world, lead the squad of reckless mercenaries, and outrage mighty corporations and cliques.Key features:Cooperative turn-based battles\nFight together with other players in a unique mode of tactical turn-based combats using covers and capturing strategic positions. Unite into clans and play with your friends.\n4 classes and 12 specs\nHire various spec fighters and build a squad that meets your tactical preferences. Every spec has its own set of equipment, skills and combat tactics.\nMany types of weapons & equipment\nFight, get experience, and study new types of mercenaries' combat gear. The game features more than 100 real models of weapons from pistols and assault rifles to machine guns and grenade launchers.\nCommander's career\nMove your main character along the carrier ladder by making the squad grow and by taking new battles. Take over command over allied fighters.Features we are going to add:Clan hierarchy\nDevelopment of clans and their players.\nClan wars\nAdvanced clan clashes and clan ranking.\nPlayer's and clan's bases\nConstruction and development of your own base.\nStory PvE missions\nFighting against mutants and monsters, performance of combat missions assigned by corporations' agents.\nGlobal map\nGlobal clan wars and territories seizure.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Light Vision Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10635,"name":"Detached","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/420/420a4ba77ce3f7e1c533c3e8672d624a.jpg","description":"Detached is a space exploration VR game that demands tactics and skill to survive. Strap yourself in for hardcore gameplay uniquely designed for VR headsets.\nTrapped in an abandoned space station, you must race against borrowed time to find your crew before your oxygen supply runs out. As you solve puzzles to open airlocks, locate power cores and disable transmitters, something tells you that you won’t be alone when you finally escape into the universe’s deep infinity.\nCore FeaturesGo Hardcore – Experience 360-degree freedom of movement, rotation and acceleration in a sandbox environment built for VR headsets.\nIt’s Getting So Atmospheric – Discover the wide blue yonder inspired by the sublimity of Gravity with an accompanying fully orchestrated score composed by Mikołaj Stroiński (The Witcher 3, The Vanishing of Ethan Carter).\nBlast, Splinter and Charge – Employ Shield, Boost and EMP Rockets skills in both single-player and multiplayer modes. Hit targets with lock-on missiles built into your suit. Master weapon cool down times before your opponent gets the upper hand. Gain temporary immunity with the shield skill. Exploit boosting tunnels to gain a speed advantage.\nAstronautic Drills – Get to grips with your spacesuit’s controls in a zero-G environment through a dynamic tutorial before venturing into outer space. FPS-style steering will introduce newbies and those sensitive to VR playing to the hardcore VR experience.\nBlink and You’ll Miss It – Challenge a friend to Detached’s nail-biting PvP mode and then spend time getting acquainted with the infinite universe in single-player mode.\nWarningThis is an extreme VR experience that simulates sudden and dramatic acceleration, freefalling, twisting and rolling. Even with the 90 FPS frame rate, it is not for VR-sensitive players.\nExploration. Rivalry. Survival. These are the tenets of deep space society. Detached drops you at the edge of a universe destroyed by human misrule and extortion. Thanks to years of warfare and greed, the human colonies in deep space are no more. The great factions have crumbled; the corrupt corporations have dissolved.\nMost people adhere to the last remaining code of humanity: no killing. But in the lonely expanse of space where resources are low, many are willing to bend the rules to survive.\n“Detached will give you tons of freedom in how you play, and the gaming sensation is intense,” says Łukasz Hacura, Creative Director of Anshar Studios, “players of our Early Access release told us exactly what we needed to know to make the game absolutely electrifying for virtual reality headset users.”\nDetached isn't just a game; it’s an experience. Unlike many games where VR is a mere expansion, VR is the primary asset of Detached. To complete the game, you must master the controls of your EVA spacesuit and develop your ability to move in a realistic zero-G environment.\nPut your skills to the test in both single-player and multiplayer modes. Multiplayer pits you against your friends in an entirely new take on capture the flag. Race against each other to gather the necessary skills and complete your mission. Every second is precious, and every choice you make can mark the difference between life and death.\nSingle-player mode makes full use of the VR headset, giving you the chance to interact with the tranquil expanse of space. Beta players have lauded Detached’s sandbox environment that encourages players to enjoy the types of experiences normally only felt by astronauts.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Anshar Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":6625,"name":"Anarcute","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/884/8849350184ca167bfc48e20e69fae90b.jpg","description":"Anarcute is a rampaging riot simulator, combining adorable aesthetics with huge-scale chaos, colourful destruction and crowd-beat’em all gameplay!\nThese are dark times. A group of evil corporations has taken over the major cities of the world. They took control of the media, brainwashed the police and now shamelessly dictate the citizens' lives from the heights of their skyscrapers.\nIt is time to act! Take control of the revolution to face the terrible Brainwash Patrol who’s dominating the world.United we stand!In Anarcute you’re not controlling a single character but rather a whole crowd!\nThe bigger the crowd, the more powerful it gets. Wake up your fellow rioters in the cities and grow the revolt to unleash devastating abilities!The city is your playgroundPhone booth, fire hydrants, trash cans, bikes, cars… use objects from the city as projectiles. If your crowd gets big enough, you’ll even be able to take down whole buildings and make them collapse on your opponents!Fight the Brainwash Patrol Your opponents will stop at nothing and they will use all of their impressive equipment to stop you from completing your objectives. Lasers, Electric Turrets, Spider Robots, Helicopters and Mortars are some of the many traps and enemies that will stand in your waySpread the revolution across the GlobeDuring your adventure, you will get through 5 cities with unique visual and audio settings. From Tokyo to Paris and going through Reykjavik & Miami, the Brainwash Patrol won’t give you any rest. Explore every corner of the cities to find all the animals and customize the crowd to your taste!\nIt is time for the cute revolution!Key Facts :Lead a group of adorably cute rioters and wreak havoc all over the world in your fight against evil\nPick up any object in the streets and throw those at the Brainwash Patrol\nTake down any building on your path and take advantage of the city’s layout\nFight the Brainwash Patrol, a terrible force ready to do anything to stop you\nExplore the world and set it free!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Anarteam","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5684,"name":"The Incredible Hulk (2008)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/692/6923e20d9884ae4e4814ea2031078a4f.jpg","description":"THE INCREDIBLE HULK™ is a fast-paced, action-packed video game that enables players to take on the role of one or more of Marvel’s most powerful Super Heroes. As the Hulk, players can demolish anything in their path, including lamp posts, passing cars and even entire buildings.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"}]},{"id":844372,"name":"Chenso Club","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/327/32710be0a530f3941607897c350ad521.jpg","description":"The alien invaders are everywhere, attacking everything and everyone! And when they die, the life-force they leave behind is an ultra-incredible energy source! Is there any hope?\n\nMeet the Chenso Club: a growing group of fighters here to save the world. They’re using the aliens’ life-force to power up and beat them at their own game. Don’t let their adorable nature fool you - they will happily and brutally obliterate any threat that gets in their way.\n\nOur heroines want any excuse to use their newfound powers. It’s up to you to master their moves, increase their power and show the world the might of the Chenso Club.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Pixadome","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]}]