[{"id":16023,"name":"The House in Fata Morgana","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/830/83021c213afdfe02312195a921bdae7d.jpg","description":"You awaken in a decrepit old mansion.\nA woman with eyes of jade stands before You, informing You that You are the Master of the house, and she Your Maid. However, You have no memories, no concept of self—or, indeed, any certainty that You are even alive.\nThe Maid invites You to join her on a journey through the mansion's lifeless halls, to behold the numerous tragedies that have befallen its residents. She suggests that among them, perhaps You will find some trace of Yourself.\nBeyond the first door lies the year 1603.\nIt is an era of unparalleled beauty, where art and theatre flourish. Roses bloom abundantly in the garden where the inseparable Rhodes siblings play, and though they appear to be free of worry and strife... not everyone is content to see them happy.\nBeyond the second door lies the year 1707.\nIn this era, the mansion lies in ruins, and a beast dwells within. He claims to yearn for a life of serenity, but it is not long before he yields to his innate savagery and a massacre ensues.\nBeyond the third door lies the year 1869.\nIn this technologically advanced era, people are always on the move. The mansion's master is an ambitious businessman who has invested in the rail industry. However, his obsession with wealth and power leads him to neglect and mistreat his wife.\nBeyond the fourth door lies the year 1099.\nThe Maid tells You that this is the final tale. In this era, You see a young man who claims to be cursed and a girl with white hair, called Giselle, who has been branded a witch and marked for death.\nHaving borne witness to these four tragedies, each set in a different time and place, You are now free to choose whether You wish to end Your story here... or press on.\nBut there are those who would say,\n\"You were able to bear them because they weren't your tragedies.\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mighty Rabbit Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PS Vita"}]},{"id":15804,"name":"Demolish & Build 2017","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/706/70649ab7d61cf1de6ff28137a84d9e4f.jpg","description":"Become a boss of Demolition & Build company. Destroy small wooden huts and huge concrete buildings. Manage your workers.\nInvest earned cash in your own land properties and rent them for profit in open sandbox world.\nUse various hand tools, buy new machines and customize their parts for specialized tasks.\n- Various machines to work with\n- Open sandbox world\n- Advanced destruction system\n- Invest, Build and Profit\n- Hire and manage your workers\nAvailable machines:\nTower crane - deliver your materials to normally unreachable spots.\nBulldozer - this heavy machine is great for demolition of small structures, as well as trampling vegetation and flattening terrain.\nSkid Loader - a small, but awesome machine. It can dig, demolish and carry loads. Just attach the required part to do the job.\nExcavator - to do serious digging or demolition, attach a specific tool to the excavator arm.\nRoad Roller - useful for compacting sand and asphalt roads.\nPickup Truck - perfect to drive between contract locations.\nDump Truck - perfect for delivering sand or metal scraps.\nCrawler Crane - comes with a wrecking ball, no structure will stand a chance against it.\nConcrete Mixer Truck - if you need to pour some concrete on your construction site.\nCargo Truck - designed to carry wood, bricks and concrete segments to construction sites.\nCHECK OUT UPDATES AND NEWS:\nhttps://www.facebook.com/PlayWayGames\nhttps://twitter.com/Play_Way\nhttp://www.playway.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Noble Muffins","platforms":[{"id":0,"name":"PC"}]},{"id":13105,"name":"Road Madness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/132/132b8f94122171620cb86610ec047968.jpg","description":"In the 21st century, the world is occurred by Resource Wars, as the Earth’s oil supplies are being exhausted. The conflict ends with nuclear strikes. The civilization is almost exterminated. The effects of the war do not fade for the next hundred years and as a consequence, anarchy and chaos control the world. Without any laws the survivors are ruled by a criminal totalitarian system. To control people and entertain them the leaders of this system organize deadly races.\nAs one of the racers of this deadly game you can chose a car, upgrade it and try to break through all the obstacles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Faton","platforms":[{"id":0,"name":"PC"}]},{"id":12212,"name":"Sorcerer King: Rivals","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5c/c5c743474d865319ef431e02b429dff4.jpg","description":"Note for Sorcerer King playersThis is a stand-alone expansion to Sorcerer King.  You do not have to have Sorcerer King to play this as it includes everything that was in Sorcerer King.  However, if you have Sorcerer King, a discount should be shown.\nWhat's new includes:\n* Two new races (Sorcerer King included Men, Rivals adds Dwarves and the Undead)\n* Two new sovereigns\n* Two new champions\n* Three new demigods that can roam the world enforcing the Sorcerer King's will\n* New victory condition: Ascension\n* Lots of new quests, items and units\n* Quest Editor\n* Steam Workshop support for sharing your creations or downloading maps and quests made by others\n* Revamped main game UI\n* Elimination of the Doomsday counter from Sorcerer King\nThanks for your support!\nAbout the GameNever the same game twiceYou have risen to lead an up and coming civilization in magical land of Elemental. Your village lives in the shadow of one of the precious shards of magic.  It also possesses something unique in all the world -- the Forge of the Overlord. This powerful artifact allows its user to craft magical items and equipment.\nArmed with the Forge of the Overlord, your people look to you to challenge the malevolent Sorcerer King, a being who has devastated the land and filled it with ruins and minions.\nUnknownst to him, you have learned the Spell of Ascension that will allow you to channel the magic of the shards and enable you to ascend to a being of nearly unlimited power who can set the world free (or destroy it).\nBut you are not alone. Other civilizations are rising while the Sorcerer King schemes in his distant fortress. They too have their own plans…A rich world to explore Choose from one of eight civilizations to play as including the Endless Night, The Dwarves of the Frozen Realm and the Men of Altar.\nDiscover ancient dungeons, lost temples, haunted villages and more that lead to adventures with danger and treasure\nUse the included map editor to create your own unique world or let the game randomly generate one for endless replayabilityA Deep history to expand into Meet other races to ally with or go to war against\nPut down criminal organizations, liberate oppressed towns and discover new lands to found new cities in\nResearch new spells, learn new skills, and craft new itemsA vast empire to exploit Use magic to raise mountains or create icy plains\nHarvest metal, crystal, horses and other resources to build ever more powerful forces\nEnlist the aid of powerful champions and terrible demigods to do your biddingA myriad of foes to exterminate Use your magic to charge Curgen's Bane to transform you into a god\nGather allies and assault the Sorcerer King in his fortress\nDestroy the demigods of Elemental with your righteous mightBeyond the game Construct new worlds with the included map editor to create your own land to conquer\nDesign new quests with the quest editor to create your own story or recreate your favorite RPGs of the past\nShare your maps and quests with others with the integrated Steam Workshop library.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":11263,"name":"FortressCraft Evolved!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/436/436209118fd9fc8dbc3942dcc5373834.jpg","description":"\"In a world where early access and indie usually means abandoned, unfinished garbage, this game's post launch development is outpacing many AAA titles and companies.\"\n\"This really isn't the same game that I originally purchased anymore. With all the changes that have been made over that duration the game is so much more fun\nnow that there are machines to alleviate almost every large build annoyance that used to exist.  The FALCORs, thieves, excavators, drills etc.. all did so much for\nautomation it's almost hard to believe I ever did that stuff manually before.\"A Whole New Survival Experience...\nFortressCraft has undergone a radical visual alteration, completely reworking the surface, along with a brand-new rendering system. On top of that, there is an enormous amount of work to make the game more understandable and accessible for new players. The combination of these two things should work towards making it feel like a fresh, new experience.  Prepare for a new exploration and survival experience!\nFortressCraft Evolved’s Survival Mode is a unique-blend of Voxel Landscapes, Tower Defense, Crafting, Logistics, Exploration, Combat and Assembly lines. Players begin by crash-landing on a strange alien world, left with only a small handful of starting machines. Using hand-held scanners they must locate ore resources, place down Ore Extractors and Conveyors to automate the raw material back to the Smelter; take the fresh ingots through multi-machine assembly lines, followed by researching new technologies that help them explore thousands of meters below the planet's surface.\nAn advanced HoloBase allows players to keep an eye on their factory which they must defend against waves of alien attacks with multiple tiers of missile and energy turrets. To survive they must continue to develop new and unique power systems, from solar energy to Jet Turbines, culminating in crafting an Orbital Energy Transmitter thousands of cubic meters in size, to beam power off-planet, and start the next phase of the game.\nAnd all this with an enormous draw-distance, scalable gameplay engine that is equally at home on high-end or low-end computers, and full multiplayer support! This does not even factor in all that you can do in the Creative Mode whose only limits are your time and imagination. With an array of Super Build Tools and a high-resolution Custom Detail Block Workshop players can build anything and on a massive scale unseen in other games.\nExperience the largest worlds ever seen in any computer game - ever!\nCreate a futuristic mining operation consisting of thousands of huge machines.\nFull Tower-Defense style combat in a voxel universe.\nUse hi-tech machinery to locate and process resources from thousands of meters away.\nExplore thousands of metres vertically, overcoming ever-more difficult challenges.\nOfficial Texture Pack and Mod Pack support\nState of the art lighting and shadowing, utilising high resolution maps for machinery and environment\nInnovative“Build to Me” Feature to facilitate rapid, accurate building\nShareable Creative Schematics\nSuper Build Tools  allowing instant creation of primitive shapes","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ProjectorGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10634,"name":"Audition Online","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/651/651614735501dd86c21e94c022266f97.jpg","description":"Audition is an online music and dancing game that allows players to compete against and cooperate with players from around all over the world. Dance your way to virtual stardom by syncing your avatar's moves with the beat of today's hottest pop music. Players get to engage in a variety of single and multiplayer modes, while dressed in your choice of threads. No two avatars are alike, so customize your avatar to your heart’s content.Key Features Fresh Content: Audition is updated regularly with new content. Enjoy diverse music selections, pick your preferred new clothes and try new dance moves.\nBackground Music (BGM) selector: Want to listen to your own playlist when you’re not on the dance floor? No problem! Our BGM selector’s just perfect for you.\nMy Album: Create your own set list of favorite songs for your DJ pleasure whenever you man a game room.\nOver 20 different game modes to choose from.\nCouple with another player and unlock new modes and swag with the marriage feature.\nThousands of outfits, hairstyles, shoes and fashion accessories to choose from. Dress your character in new threads with every update.\nStay connected with old friends, make new friends and meet fellow hipsters from all over the world with the built-in instant messenger, friend list, chat, and more.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"T3 Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":6898,"name":"Bloons TD 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b22/b2240f461105f9f01cc8c881312c0c91.jpeg","description":"Five-star tower defense with unrivaled depth and replayability.\nThe Bloons are back in full HD glory and this time they mean business! Build awesome towers, choose your favorite upgrades, hire cool new Special Agents, and pop every last invading Bloon in the best ever version of the most popular tower defense series in history.\nFeaturing an all New Tower and Special Agent, glorious HD graphics, original Tracks and Special Missions, a whole new tier of Specialty Building upgrades, and a never-before-seen Monkey Lab to upgrade your towers, Bloons TD 5 delivers hours of fun and challenging play to fans and new players alike.\n“Nations need to brace themselves for a complete loss of productivity”\n- Jayisgames, 4.7/5.0\nMore Awesomer New Features:\n- Cool new towers – Heli Pilot, Bloonchipper, Engineer\n- Exclusive new Special Agent – Radadactyl\n- All new Monkey Lab – researches unique abilities and tower upgrades\n- Specialty Building Tier 4 Upgrades\n- Exclusive tracks\nHours and Hours of Awesome Gameplay:\n- 21 powerful towers with Activated Abilities and 2 upgrade paths\n- 10 Special Agents\n- 40+ Tracks (plus their Reverse versions!)\n- 10 Special Missions\n- 250+ Random Missions\n- New Bloon enemies - tougher Camos, Regrower Bloons, and the fearsome ZOMG\n- 50+ Steam Achievements\n- Steam Cloud Support\n- 3 different game modes\n- Freeplay mode after mastering a track\n- 3 difficulty settings and family-friendly theme so anyone can play\nAnd that's just the beginning - heaps of planned updates will keep Bloons TD 5 HD fresh, fun, and challenging for many months to come. Now it's time to pop some Bloons!\nRemember to save to the Steam Cloud after each victory to save your progress.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Web"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":2837,"name":"Albedo: Eyes From Outer Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/729/7295eaa2f274e9cd9711d31fa4d0e90e.jpg","description":"Inspired by 60s pulp sci-fi movies, Albedo: Eyes From Outer Space is a first-person adventure game. Working as a night-watchman at a partially abandoned, secret research facility, you are knocked unconscious by a nearby explosion. Waking in the complex’s basement you look up and see a gaping hole in the ceiling. Escaping the damaged building is only the start of your troubles and as you begin to explore the base you encounter strange, unearthly organisms. Is this all because of some sort of biological experiment gone wrong? You’ll need to fight for survival as you unravel the mysteries and solve the problems that lie ahead.\nA 60’s sci-fi, b-movie inspired narrative, with plenty of mystery and suspense!\nStunning 3D environments and detailed objects to manipulate.\nRealistic and atmospheric sound effects will envelop you in your surroundings.\nAdventure-style gameplay featuring puzzle elements and incorporating first-person shoot’em-up action.\nTwenty detailed rooms to explore; each full of mystery, strange visions and intricate puzzles to solve.\nAn advanced physics engine making object interaction extremely immersive. Pick up and use objects as you would expect to in reality.\nOver 100 items to interact with.\nUnique hint system using a device to ‘see into the future’ to help solve complex problems.\nMultiple challenging mini-games and puzzles.\nUnearth hidden areas, discover Easter eggs and unlock achievements.\nOver 8 hours of challenging gameplay!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Merge Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":647762,"name":"Find Love or Die Trying","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05f/05f55552374c2d2c041a1d0adcb4ef8a.jpg","description":"I'm your host Kat, and this is Find Love or Die Trying!\nIt's the premiere of our new dating show, where ending up single... means ending up dead! Not sure why you'd sign up for this, but now that you're here, you've got 7 days to get one of the lovely ladies on your tropical island getaway to fall in love with you. If she's willing to put a ring on it, you're both free to leave. If not... well, it's in the name of the show!\nYou'll get the chance to meet:\nAllie, the daredevil athlete with a rebellious streakScarlett, the charming scientist with a penchant for destructionViolet, the cold-as-ice scion of a mysterious MegaCorpTerra, the eccentric gamer who marches to her own drumYui, the childhood sweetheart with a smile that could melt ice\n...And last, but definitely not least, me! Kat! The impossibly perfect and painfully gorgeous host and producer. Did I forget to mention generous? I'll be helping you get those romantic connections going, so you better be grateful!\nThen again, my bonus is tied to the ratings, and not you surviving the show, so... Hm.\nAnyway....\nI can't wait to start filming our first episode together!Features4+ hours of Visual Novel Gameplay with branching choices and consequences7 unique endingsOriginal story,  art, and musicPlay as a male, female, or non-binary protagonist","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Auden Jin","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":59011,"name":"Myst III: Exile","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84d/84d93ad9f40193c6973606e5b6fd41bc.jpg","description":"\"The idea that someone may be linking into my study, reading all of my books, disturbs me...\" <br/><br/>Experience the stunning sequel to Myst and Riven, a complex tale of betrayal and revenge that only you can successfully unravel. Myst III: Exile plunges you into an adventure so real, you'll forget it's a game.<br/><br/>- Five entirely new Ages to explore<br/>- Hours of new mysteries to uncover<br/>- Dramatic new storyline<br/>- Free-look Movement System - View 360° at every location<br/>- Rich music and riveting cinematics","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Presto Studios","platforms":[{"id":0,"name":"PC"}]},{"id":53939,"name":"Mega Man 2 (1988)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/583/583615a299e4f355dfac6acebb95f2a9.jpg","description":"In the future city of Monsteropolis, the use of robot labour has helped civilization grow more than ever before. At the forefront of this technology is Dr. Light and his assistant Dr. Wily, who are commissioned to build six robots to handle a variety of specific tasks. They are named Bombman, Gutsman, Iceman, Cutman, Elecman, and Fireman in reference to their individual prime functions. Dr. Wily, however, has bigger plans and chooses to take control of the robots and let loose destruction in a bid for world control. Dr. Light fights back with the best tool he has, an experimental human-like robot, Rock aka Mega Man, who had been tested to perform cleaning duties. Now properly armed, it's up to Mega Man to take on the maverick robots, fight his way into Dr. Wily's castle, and end this madness.\n\nMega Man is a side-scrolling platformer. Mega Man has the ability to jump and fire his weapon. He must travel to the levels of the six robot masters and defeat them in combat. By doing so, Mega Man is able to acquire their power for his own. These powers can then be used interchangeably with his main weapon and target the weaknesses of specific enemy bosses. Additionally, some hidden areas of the levels can only be accessed by using certain captured robot weapons. A special Magnet Beam ability can also be found which can be used to create steps.\n\nTravelling throughout these levels, Mega Man is confronted by an army of lesser robot creations. Destroying these usually yields energy capsules (for refilling Mega Man's Energy), weapon capsules (for refilling Mega Man's special robot weapons), and extra lives shaped like Mega Man's head.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Capcom","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"}]},{"id":52332,"name":"Crisis Core: Final Fantasy VII","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/907/90749f6693d8b7e1a3c4ce8bfd44b80a.jpg","description":"Crisis Core: Final Fantasy VII is a prequel to Final Fantasy VII and is a part of the Compilation of Final Fantasy VII. The game stars Zack Fair, a member of SOLDIER, assigned to find the missing SOLDIER Genesis Rhapsodos and discovers more information about SOLDIER's high-ranking Sephiroth and Angeal. Square Enix debated on porting Before Crisis: Final Fantasy VII, originally just for the Japanese mobile market, however, decided to just start fresh with a new game; Crisis Core.\nThe game sold over 3 million copies worldwide and received generally positive critical reviews. It scored a 35/40 from Famitsu magazine and was praised for how well the story tied into Final Fantasy VII. Some said the game was too short but had plenty of side-quests to keep you busy, along with an involved battle system.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Square Enix","platforms":[{"id":0,"name":"PSP"}]},{"id":17043,"name":"Morningstar: Descent to Deadrock","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78d/78d5530b2d5453af35876b8fc84d4525.jpg","description":"Crash-landed on a desolate, alien planet, what should've been a routine work-for-hire job for Powell has become a deadly mission to save the merchant vessel Morningstar and her crew. With one man dead and the captain gravely injured, Powell is on his own to repair the ship and find a way to escape the strange gravity well of the empty planet they've landed on.\nAnd if the situation weren't dire enough, the only signs of life on the planet are the remains of a much larger and better equipped ship and her crew, all dead, and not by natural means. What--or who--brought down these ships and is killing their crews? For what reason? And can Powell find a way off-planet before he shares the same fate?\nFeatures\nExperience an immersive sci-fi adventure, packed with gorgeous HD graphics, brand-new puzzles and scenes, and an all-new, streamlined interface\nNewly remastered cinematics display the haunting landscapes in beautiful high definition\nUncover the mystery of Deadrock through new and optimized puzzles and an extended storyline\nThe alien planet of Deadrock comes alive with full voice acting and engrossing sound effects\nIncludes an atmospheric remastered soundtrack with over 30 minutes of original music","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Red Herring Labs","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16401,"name":"Realms of Arkania 2 - Star Trail Classic","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/168/16861a19abee598e4ae9a005798bb034.jpg","description":"Star Trail (1994) is the second part of the glorious Realms of Arkania Trilogy...\nCan you join together the elves and dwarves in common war against the orc invaders? Star Trail features over 70 spells, 50 skills, over 350 types of items and weapons. A convenient autodiary records your adventure while a sophisticated automap allows for fast travel.\nStar Trail was acclaimed best RPG of 1994 by:\nPC Gamer\nCD Rom Today\nStrategy PlusThe Realms of Arkania TrilogyThe Realms of Arkania games (Blade of Destiny, Star Trail and Shadows of Riva) deliver a prime example of the classical European fantasy universe. Based on Germany's most popular pen & paper role playing game, it was also the first German computer RPG series to get widely recognized outside of its home country. To this day it holds a stable hardcore fanbase that loves the games for their comprehensive adaption of the pen & paper ruleset and the believable medieval fantasy setting.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Attic Entertainment Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16328,"name":"Ultimate Word Search 2: Letter Boxed","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ee/3eeb77cfb2821fa8b12510490d89cb43.jpg","description":"Ultimate Word Search 2: Letter Boxed takes you into a world of mystery where your task is to locate hidden words in a matrix of letters. Each matrix contain words that wrap around a 3D-cube going left, right, up and down. There are 24 words to discover and the game includes 84 English word categories featuring random words from a large vocabulary of options. To select a word you touch the first letter of the word. Then touch the last letter of the word. You can and may need to spin the cube in between touching the letters. You can actually touch the last letter first and first last. Words can go left, right, up or down so look for them in reverse order as well. Often, the words you need to find will wrap around the sides of the cube adding to the fun. No game will ever play the same and only true wordsmiths will beat this ultimate word-challenge.KEY FEATURES84 different word categories (English)\n24 random words to each challenge\nRewarding points- and star-system\nBeautiful 3D graphics\nGreat music and sounds\nIntuitive controls","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":15178,"name":"Wooden Floor","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c78/c7837598dac81e0095eae1d0a454ecb2.jpg","description":"Wooden Floor is a first person adventure horror game inside an old house that seems normal but the further you progress into the game you start to realize that rooms change if you close a door behind you and whole corridors appear out of nowhere. Not being able to predict what is going to happen next or where you are heading for you need to make your way through the increasingly maze-like becoming house to find a way out of this bad dream that you just woke up into. The only thing that goes with you is the wooden floor underneath your feet.\nGameplay Features:\nLevel Streaming -> changing, appearing/disappearing, rotating rooms, corridors and objects Unreal Engine 3 graphics (UDK) Maze-like becoming house and environment (expanding environment) Puzzle Elements (Keys, Collecting and some Jump 'n' Run or Platforming) Adequate Scares (no screamers)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pheenix93","platforms":[{"id":0,"name":"PC"}]},{"id":14259,"name":"Kelvin and the Infamous Machine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5b/e5b52ac520adfb7ae8ca31cd295d7e3a.jpg","description":"Kelvin and the Infamous Machine is a hilarious point-and-click adventure in which you stumble irresponsibly through history to help legendary geniuses complete their masterworks!\nKelvin is the well-meaning research assistant of Dr. Edwin Lupin, an outstanding but tacky physicist who goes completely nuts when his life’s work, a shower-shaped time machine, is ridiculed by the scientific community. Bent on leaving his mark, Lupin launches himself into the past to prevent history’s greatest geniuses from completing their defining works, so HE can complete them instead.\nNow the very fabric of time is beginning to unravel, and it’s up to Kelvin and his fellow research assistant Lise to repair it. Point and click your way through three wacky, gorgeously drawn chapters to help Ludwig van Beethoven, Isaac Newton, and Leonardo da Vinci achieve their destined greatness!\nClassic point-and-click gameplay, featuring both pointing and clicking.\nBeautiful hand-drawn 2D environments.\nA huge variety of wacky puzzles that increase in difficulty as you go.\n56 quirky, fully animated characters\nOver 2000 lines of written dialog.\nOriginal soundtrack with 12 unique tracks.\nAnd of course, the unique opportunity to annoy three of the greatest minds in history and save the universe!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blyts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10912,"name":"DED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/479/479656124af2f5b19cfa89fe0909b9ee.jpg","description":"DED - a game in the shoot'em up genre. Your granddaughter has been kidnapped, and your daughter and son-in-law murdered. Having just bits and pieces of information about the abductors, you will have to save your granddaughter and find the masterminds behind these crimes.\nA moderately hardcore game with dynamic gameplay that will help you while away a few evenings.Survival Mode\nFAQ.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":972995,"name":"Grand Theft Auto VI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/734/7342a1cd82c8997ec620084ae4c2e7e4.jpg","description":"WELCOME TO LEONIDA\r\n\r\nGrand Theft Auto VI heads to the state of Leonida, home to the neon-soaked streets of Vice City and beyond in the biggest, most immersive evolution of the Grand Theft Auto series yet.","review":"","timePlayed":0.0,"releaseYear":2026,"developer":"Rockstar Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":831883,"name":"Under The Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eaf/eaff05afd0b8cdec8d90667047c96dec.jpg","description":"Join Our Discord Channel!\nAbout the GameJoin Ali Kemal on his fantastic journey on the path of true love!\nUnder the Moon is an indie adventure - riddle game. If you're a riddle enthusiast you will have lots of fun while solving riddles in game while experiencing the stylized graphics, ambient soundtracks (which are exclusive for the level that you're in) and mellow atmosphere.\nFeatures:\nMore than 50+ riddles. (With updates it will be 100)\nPlayable 4 Map ( Turkey, China, Russia, Egypt )\nThere are 2 more maps to be added with updates. ( Germany, England )","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Bamya Games","platforms":[{"id":0,"name":"PC"}]},{"id":311780,"name":"Hedon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/406/406e7d9e086784e6551db2dcbf1388a0.jpg","description":"➣ It's an oldschool/boomercore game not by just looks and engine, but by gameplay.\n➣ Gory, fast paced shooting, a solid arsenal of weapons and magic items.\n➣ Sprawling levels that offer a degree of freedom and don't hold the player's hand. Exploring, hunting secrets, backtracking, patience and having to figure out what to do next is key. Monsters and pickups are hand-placed and vary according to the difficulty you play on.\n➣ Original story packed with lots of lore and doubled by a permeating atmosphere.\n➣ Original soundtrack ranging from tense to serene ambient, spiced up with bursts of metal. Also, did I mention the legendary Alexander Brandon? If you enjoyed the Unreal and Deus Ex soundtracks, you're in for a treat!\n➣ Thousands of hours of work put into an original concept, digitally hand-drawn graphics (textures, sprites, frame by frame animations etc.), scripting, sound effects and level design, all by a one man dev team aiming to create a unique game with a unique atmosphere.\n➣ Six to eight hours of good 'ol singleplayer action with five difficulties including Brutalizing, which changes the gameplay to allow interesting second playthroughs (different fights & pick-ups, companions etc.).\n➣ It's very light on storage (under 300mb) and well optimized. It's also portable so no DRM and no online ties either - you buy it, it's yours!\nMy aim is to research classic game design and refresh the valuable bits we've lost in an experience that ultimately rewards the player through learning and investment rather than through mechanically administered gratification.\nHedon is an oldschool game, and that's pretty much enough of a description. You will be dropped in a hostile world that has its own workings, characters and intrigues, and you will be expected to fend for yourself. The build up is slow and steady, the story is consistent, the combat is fast paced and ruthless. You will sometimes find yourself lost in a non linear level design with various aesthetics (forest, caves, forge, barracks, snowy mountain etc.) where exploration and learning by yourself is the key to improve.\nYou may find that Hedon takes a certain amount of inspiration from games such as Unreal, Blood, Thief, Arx Fatalis, Serious Sam etc. but nonetheless aims to be original at all times.\nYou play as Zan (any similarity with the creator's username is a pure coincidence), a half Orc - half Demon warrior who wakes up in a caved in tunnel with no memory of how she ended up there. The first episode will focus on our hero's descent into a strange underground world which is threatened by the sudden attack of a massive Cultist force.\nThere are certain races and factions populating the world of Hedon.\nThe Iron Division\nA faction of amazon-like Orcs and Goblins, the Iron Division are the keepers Hedon's greatest secret - the crystal technology. Various magical crystals sprawl across the underground, providing energy, heat, oxygen and often forming entire biomes around them. Combining this power with crafting and the ancient art of magic, the Iron Division has founded a whole new civilization within their mountain stronghold known as Valc.\nThe Cultists\nFallen to sin, the raving husks of what were once human now worship various figures of the Underworld. Little can be done to cull their addiction to pain and suffering. Little but a spray of frag fire or an explosive bolt that is...\nThe Demons\nChaotic Demons dwell in the deepest parts of Hedon, lashing out at the weaker minds of the inhabitants of the Overworld. Along the ages, they have subdued entire towns to become their cultist slaves and feed their endless hunger through pain and suffering. Demons only care about feeding, and they will stop at nothing to do so.\nThe Earthborn\nAncient dwellers of the underground, Minotaurs and Dwarves have built their own civilizations, ever clenched in warfare with the Demons spawning from below. However, their great cities and heritage were lost hundreds of years after their inevitable defeat in front of Hell's armies, and now they have been scattered and forced to live in small clans and towns.\niamfailtacular - story collaboration/world building, brainstorming\nAkhzul - Hedon's OST dedicated composer. A one guitar man band.\nAlexander Brandon - The man himself. If you enjoyed the soundtracks of Deus Ex or Unreal, then you're in for a few pleasant surprises. I bought few licenses for some of his personal tracks (and other songs that didn't make it in Deus Ex/Unreal) and fit them into Hedon!\nBreathelast - A band of underground sharks who pitched in with instrumental tracks of their songs. Also one of my favorite bands ever.\nMethadone Skies - Another solid band from the underground, guilty of creating dreamlike musical atmosphere.\nShivaxi & Xenofish - 5 Michelin Star chef and his cool friend who made an awesome remix for Alexander Brandon's Underworld.\nSOFTWARE USED\nEngine: GZDoom\nCoding/Scripting/Resource Management: SLADE3\nLevel Design: GZDoom Builder\nGraphic Design (Textures, Sprites, Animations etc.): Adobe Photoshop Elements 8, Clip Studio Paint\n3D Modelling: Blender\nSound Editing/Recording/Mixing: Audacity","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Zan","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":60843,"name":"Dawn of Man","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf1/cf158eb8b608235cd3a6b8cf25e6cb38.jpg","description":"Take control of a settlement of the first modern humans, guide them through the ages in their struggle for survival.\nDawn of Man is a survival/city-builder from the creators of Planetbase.\nThe game starts in the Stone Age, and takes you up to the Iron Age, spanning more than 10,000 years of human prehistory.\nYou will have to get your people to survive, expand and evolve, just like our ancestors, facing the challenges that the environment will throw at you.\nHuntAnimals were a vital source of food and resources for ancient humans. Use their meat to feed your people and their skin and bones to make clothing and craft the tools you will need to stay alive.\nConfront Mammoths, Wholly Rhinos, Ancient Bison, Megaloceros, Cave Lions and other species that roamed the earth at the time.GatherCollect a variety resources from the environment: fruit, berries, water, wood, flint, stone, ores. Use them to prepare food, to make tools and to build structures in your settlement.Plan for harsh timesFish is more abundant in spring, berries and fruit can be collected in summer and animals are easier to come by when it's warm.\nWhen winter comes, make sure to have enough non-perishable food and warm clothing in order to survive.Expand and fortify your settlementBuild more homes and facilities for your people, in order to expand your population.\nConstruct fortifications and craft weapons, so you are ready for when the inevitable conflict comes.Research TechnologiesEach new discovery will make it easier for your settlement to be able to support larger populations, but will also bring new challenges: increased food demand, morale issues and more frequent raider attacks.Build Megalithic StructuresOur ancestors were capable of incredible engineering feats: mine massive rocks from the environment, transport them using sledges and construct colossal stone structures.Control NatureUnlock farming technologies to grow your own vegetables, so you can feed large amounts of people. Domesticate animals to produce food, resources and provide increased muscle power.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Madruga Works","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58999,"name":"Mega Man X Legacy Collection 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c51/c517d16cf9c4eab209e5b676aef25acb.jpg","description":"Complete the exciting Mega Man X saga with this collection of four\naction-packed titles! Spanning two gaming eras, this collection\nshowcases the evolution of the series with Mega Man X5, Mega Man X6,\nMega Man X7, and Mega Man X8. Both Mega Man X and his ally Zero return\nas playable characters, allowing players to jump and shoot through\nchallenging stages with X’s arm cannon, or slash through enemies with\nZero’s energy saber.\n\nMega Man X Legacy Collection 2 also includes an armory of new features.\nTest your skills in the new X Challenge mode, which pits players against\ntwo deadly bosses in two-on-one battles. Explore a huge museum filled\nwith rare production art, catalogs of classic merchandise, a playlist of\nnostalgic commercials, and more. The collection also includes an\nanimated prequel film starring the origins of Mega Man X villain, Sigma.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":36523,"name":"Myst V: End of Ages","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a71/a714a48d1cbf625d402f2545ba48f870.jpg","description":"The Grand Finale of the greatest adventure!  Decide the fate of a civilization in this triumphant final chapter to the Myst saga.  Embark on an epic journey into the heart of a shattered empire as the only explorer who can still save it— or destroy it with the wrong choices.\nWhether you’re a longtime Myst fan or new to the series, the Grand Finale is an epic adventure you won’t want to miss.\nKey features:\nDeveloped by the original creators of Myst:  Rand Miller and Cyan Worlds bring you the ultimate chapter in a series already renowned as the pinnacle of adventure gaming.\nExplore vast 3D worlds with an easy click of the mouse:  Improved point-and-click interface offers several options to accommodate your exploration style.\nInteract with the world like never before:  The innovative new slate lets you communicate with mysterious creatures and manipulate the world around you.\nThe characters of Myst brought to life:  New facial mapping technology brings characters to life with unprecedented emotion and expressiveness.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":28840,"name":"Droplitz","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/741/741bcfe15b1fe83ddc54be4f78749cc3.jpg","description":"Immerse yourself in this addictive puzzler that's all about strategically twisting and connecting mismatched dials to save precious droplitz.  Just making a single junction is child's play; can you master the art of the combo or will you let your pipes runneth over?  Be warned: losing too many droplitz can be hazardous to your ability to win.  With four unique play modes, a variety of board sizes, and infinite replayability, Droplitz promises to drain all your time away. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Blitz Arcade","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":20942,"name":"Mainland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35d/35d2368f13cf3b241f783f8468001f9c.jpg","description":"Mainland is a free text adventure game about an explorer in the 19th century whose captain and crew have been killed by plague. The game focuses on unconventional story and atmosphere rather than hardcore puzzles, and features gameplay similar to classic adventure games.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vasily Voronkov","platforms":[{"id":0,"name":"PC"}]},{"id":19346,"name":"Fate of the World","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/648/64858fc589a88831e8f20e004c239e6b.jpg","description":"Fate of the World is a dramatic global strategy game that puts all our futures in your hands. The game features a dramatic set of scenarios based on the latest science covering the next two centuries. You must manage a balancing act of protecting the Earth’s resources and climate versus the needs of an ever-growing world population, who are demanding ever more food, power, and living space. Will you help the whole planet or will you be an agent of destruction?\nFate of the World is brought to you by the award-winning Red Redemption games team and Battlestations: Midway Producer Klaude Thomas with climate science by Dr. Myles Allen (University of Oxford), writing by David Bishop (Dr. Who, 2000AD) and music composed by Richard Jacques (Mass Effect, Alice in Wonderland) with game design by veteran game designer Matthew Miles Griffiths (Conflict: Desert Storm, Battlestations: Midway).\nFate of the World has been nominated for the 2011 Index: Design Awards and as a Top 10 Social Impact Games of 2010-11 by Games for Change\nKey features:\t\t\t\t\t\tCovers 2020 to 2200 - Two centuries years of possible futures\n12 regions - China, Europe, India, Japan, Latin America, Middle East, North America, Northern Africa, Oceania, Russia, South Asia, Southern Africa\nScientific Model - by Dr Myles Allen of Oxford University\nDetailed real-world data - gathered over years of research\nOver 100 major policies - including geoengineering, technological research, international aid, diplomacy, economics, emergency defences, species protection, forestry, health, energy choices, population, politics, and clandestine operations\nMore than 1,000 impacts - including storms, floods, heatwaves, flash fires, desertification, glacial melt, sea level rise, resource wars, drought, famine, dissidence, extinctions, epidemics, technological break-throughs, energy shortages, and political backlash\n50 signature animal species to save - against the backdrop of enormous biodiversity loss\n40 specific future technologies to develop - including nuclear fusion, biofuels, nanotech, robots, AI, smart grids, advanced medicine, synthetic food, and space exploration\n6 'tipping points' - world-changing events such as the Amazon collapse and the Antarctic ice shelf collapse\n3D Earth globe - showing climate related changes with Earth 'telemetry' - visually graphing past and future change\nEarth overlays - revealing local temperature change, devastation, and population\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Red Redemption","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19168,"name":"Tex Murphy: Martian Memorandum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fe/2feaede13feabd7037be6a4d600a11c1.jpg","description":"Experience the power of full motion video and sound!\nAn exhilarating fast paced interactive mystery Guaranteed to Entertain You!\nThe FIRST EVER Multimedia Entertainment Product\nOVER 24 MEG. of Sound and Graphics Excitement compressed to just over 7 Meg.\nFully Animated TALKING Characters\nINTRIGUING Story Line\nIN DEPTH Character Development\nOn Demand HINT SCREENS\nRich MUSICAL SCORE - Digitized Sound Effects\nSupports ALL Major Sound Boards\nThe Most Vivid, LIFELIKE GRAPHICS Ever Seen\nA Humorous, Thrilling Adventure With A KNOCKOUT ENDING!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Access Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18066,"name":"Random Access Murder","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df0/df0fb9588f64b8aecdd56c9702361a28.jpg","description":"Upcoming featuresOver the coming weeks we will add character progression and customization, stay tuned!\nAbout the GameYou're a robot. Murder other robots with your data-destroying weapons and create a stack of dismantled enemies. Be the last heap standing and DO NOT RUN OUT OF MEMORY!\nRAM is a 1st person arena shooter with a unique look and fast-paced action. Play online against your friends (or enemies) across 5 arenas. The 9 different weapons in the game won't hurt your opponents, but rather leak their memory, causing different glitches and bugs.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Team Murder","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17862,"name":"Imagine Me","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57f/57fe268623a18a11295aa361d5bb0781.jpg","description":"Feature ListSingle player campaign\nHand-painted scenes from Zac Duff\nUnlockable memories to form story\nCreative play. Complete dungeons by creating your own path.\nRandomized dungeons\nDungeon boss battles\nPartial Controller Support\nSteam Cloud Stats\nSteam Achievements\nSteam Trading Cards\nSteam Workshop\nOriginal soundtrack composed and performed by Lisen Jernqvist and produced by Tori Kamal\nAlienware AlienFX\nAbout the GameHelp Robbe reclaim his memories in this 2D, dungeon platformer. Search spike-filled dungeons for the exit, unlock memories, face his darkest fears - and maybe some of your own.\nImagine Me was originally released to Steam Early Access in March 2014.  The development team worked closely with the Steam community to grow and shape the game into what it is today.  The Imagine Me team includes all of the Early Access community members who devoted time and effort to the development of Imagine Me.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"KinifiGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17836,"name":"Major Stryker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec5/ec573bfeb0548b5354cd0c9ca7a916b3.jpg","description":"Major Stryker is the first Apogee game with \"triple-parallax scrolling\", adding to the illusion of depth and danger. Your mission is to pilot a high-powered, armored space ship through dozens of stunning scenarios, such as space stations, lava caves and alien cities.Features\nRocket-Powered Processing: EGA high-speed animated graphics (VGA compatible) and awesome cinematic sequences.\nBounty Hunter: Bonuses and secrets to discover.\nSave Your Game: Save and restore up to 10 games.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Apogee Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17627,"name":"Frozen Cortex","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4c/b4c99d4847b128b75c64294f522dbc5b_pkWJ3QK.jpg","description":"Frozen Cortex is a simultaneous turn-based strategy game from Mode 7, the creators of Frozen Synapse.  Get a free key for a friend with every purchase!\nMake a plan for your customised robots on a randomly-generated playfield.  Positioning, timing and reading the terrain are all vital if you want to outwit your opponent.\nYour moves, and those of your opponent, play out at the same time.\nTaut, competitive multiplayer and a deep, complex single player with three different league modes (including large-scale randomly generated league) mean that you can experience your own brand of futuresporting glory!\n“Another brilliant slice of strategy from Mode 7” (Eurogamer)\n“I’ve been looking forward to this as much as almost any other game this year.” (Adam Smith, RockPaperShotgun)Features\nFree key for a friend with every purchase\nFour core single player modes: roguelike “Knockout” mode; Global Cortex League mode; Manager Mode; Randomly Generated Season Mode\nExperience the intrigues of the Global Cortex League with a compelling story that spans the various modes - play how you want and keep up with the narrative!\n7 unique AI teams each with their own coach who responds dynamically to the play\nManager Mode - vast season mode featuring salary cap, roster management, free agent bidding, a college league, injuries and much more...\nMultiplayer modes: Full Match and Duplicate; several variants of each; make your own custom mode!\nOnline rankings and fast matchmaking\nTeam Editor: name your players, customise their stats, armour, faces and more!\nFurther customisation options including Pitch Editor\nMusic from legendary indie game composer nervous_testpilot\nThis game was previously called Frozen Endzone and was renamed Frozen Cortex while in Early Access","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mode 7","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17016,"name":"Zombie Kill of the Week - Reborn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bd7/bd72eb1c7a14a886fc80a6cfb0cb8f9b.jpg","description":"Zombie Kill of the Week - Reborn is a challenging, fast paced, 2D survival shooter! And when we say fast, we mean breakneck, flat-out, adrenaline fuelled fast!  What’s different from the other shooters is your goal isn’t to run through levels and finish the game, but to survive for as long as possible under increasingly frantic conditions (we say as long as possible because ultimately you will die!).\n\nSeems simple enough, but where Zombie Kill of the Week - Reborn really takes off is in the added layers of depth and huge variety of features and customisation available. Players earn money for slaughtering the zombies (money might not bring you happiness, but it does buy you guns!). We live in a consumer society after all, which is useful, as you can spend big on over 25 different weapons (including chainsaw, katana, mini-gun, RPG, D.O.M. and many others!). You also need cash to open doors, activate jumps, buy new weapons, or hunt for the magic fridge and see what loot drops are inside! In short… the longer you survive, the more weapons and prizes you get.\n\nSurviving longer also gains you ZKW-Points which you can cash in to totally customize your character, customize your weapons, buy new weapons, buy different perks, open new maps, and a lot lot more! Players also earn XP as they play, allowing them to level-up their character and develop them to fit their chosen gameplay skills. Survival is all about the margins, and every little extra helps!\n\nThe Steam release also features an exclusive level editor for the Zombie Kill of the Week - Reborn community, which allows the community to create their own custom and bespoke maps, then share them with friends (and enemies) for everyone to enjoy. Endless permutations and maps means endless challenges.\n\nWith a compelling single player survival mode, as well as cooperative multiplayer for up-to four players, this is one zombie firefight you are not going to want to miss! If that wasn't enough you can even play cross-platform play with Android owners too!\nKill zombies with a very wide arsenal of weapons, including: Chainsaw, RPG, D.O.M., katana and many others!\nOver 20 Steam Achievements\n5 stunning maps\nExclusive Level Editor for PC. Create your own custom maps, then upload and share with friends.\nCooperative multiplayer for up-to 4 players\nFull controller support\nOnline highscores\nCloud profiles\nWeapon customization\nPlayer customization\nSkills, trophies, perks, blood and gore!\nOriginal sound tracks composed by Roland La Goy\nCross-platform play with Android allowing you to carry on playing on the go!\nhttp://store.steampowered.com/app/310850","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Still Running","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16596,"name":"Expand","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/109/109ae28b3e350f1456e4197e24ebf6bf.jpg","description":"Expand is a 2D indie minimalist game in which you guide a pink square through a circular labyrinth that constantly rotates, unfolds and expands around you. Navigate through a world that can easily lift as well as harm you, keeping you disorientated and unfamiliar in your surroundings.\nA world set in five stages, Expand offers an atmospheric experience of exploration, discovery and introspection through gameplay and compelling soundtrack designed to immerse you deeply into its allegorical themes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Chris Johnson","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16325,"name":"Puppy Dog: Jigsaw Puzzles","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da7/da7917bf39bbcbb8298f3affe729868d.jpg","description":"Puppy Dog: Jigsaw Puzzles is the perfect game to dog lovers and jigsaw puzzle game enthusiasts. The game includes 84 challenging jigsaw puzzles with beautiful pictures of irresistible cute puppies. There are 4 levels of difficulty adding to the fun. Puzzles will increase in size with additional pieces to place, and the quicker you solve each puzzle, the better star rating you will get. Are you up for the challenge? Woof!KEY FEATURESIrresistible cute puppies\n84 challenging jigsaw puzzles\n4 levels of difficulty\nFun casual gameplay","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":13521,"name":"Hard Truck: Apocalypse - Arcade","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43e/43ea949849549c1ab122696cd2d2a7f8.jpg","description":"Hard Truck Apocalypse: Arcade/Ex Machina Arcade - is the races through the deserted prairies and canyons of northern America, infected by a fatal virus. You are to find the reasons of the global catastrophe described in the original game Hard Truck: Apocalypse. The game is a standalone project, with the gameplay that's different from the original game.  INCLUDED IN EX MACHINA GOLD EDITION","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"}]},{"id":12867,"name":"The Purring Quest","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/807/8071aafd62557ab0dd140adef0da5ec8.jpg","description":"Have you ever wanted to be a cat? You will be able, thanks to the aventure platformer The Purring Quest. Take on the role of Kimchi the cat and meet famous cats of the internet in a journey full of humor. Enjoy the detailed hand drawn graphics and the smooth animations made by a veteran traditional animator with experience in major studies like Disney and Warner.\nA percentage of the profits will go directly to various animal welfare associations. So in addition to enjoying the game, you are contributing to a good cause.KEY FEATURES\nBeautiful hand drawn graphics\nTraditional 2D animations\nAmazing orchestral soundtrack\nFamous cats and lots of humor\nFind the caged kitties and unmask the evil one\nCommitted to a social cause","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Valhalla Cats","platforms":[{"id":0,"name":"PC"}]},{"id":915,"name":"Wick","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dab/dabf5629dace0b6c384ad93961466a6e.jpg","description":"Join Jean Wick in his quest to restore hope to a dying world by carrying on a dead monk’s mission to fill the cathedral with light. Use Jean’s douter and a mix of waxy tricks to avoid being detected by Mara, a nun who succumbed to despair as she tried to heal the overwhelming tides of plague victims, and the Legiones, giant insects who feast on the dead. Travel deep into the darkness to bring the world back to the light, or die trying.\nWick was developed by Studio Whip, a group of students at Florida Interactive Entertainment Academy (FIEA), over the course of eight months.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hellbent Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":23875,"name":"Xenoblade Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ad/5ad4f07b3aa8a23f64378f0da28930b8.jpg","description":"Discover expansive environments and deep character customization options\nas you delve into an epic conflict between the Homs (humans) and Mechons\n(robots). Explore the game's unique upgrade system, battle system, and\nrelationship-building system as you fight to change the future with\ntrusty allies and the ancient Monado blade.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Monolith Soft","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"}]},{"id":20819,"name":"Epic Cards Battle(TCG)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/594/594f410543adf60f88c2ad8314788bd9.jpg","description":"3D Strategic Trading Card Game(TCG) that you couldn't miss！\nEpic Cards Battle lets you experience legendary battles with friends and players all around the world！\nFeatures\n- Next-Generation Revolutionary cards battle game in 3D with hundreds of stunning battle visual effects. Players will actually experience the epic battles happening in front of them.\n- Abandon the brainless card games and play the real strategic cards game, 3 kinds of card types: Unit, Spell, Trigger. Build up your own cards deck to conquer your opponent.\n- Free-To-Play: Players could enjoy the fun without spending a penny.\n- Experience real-time match making and battle with players around the world.\n- Well designed game systems. Ladder, leaderboards, cards looting system, daily login rewards, daily missions, cards enhancing, battle replays, friends, chat system.\n- Campaign quests with lots of rewards, each quest is thoughtfully designed to be a puzzle waiting for you to challenge.\n- 5 main factions: Shrine Alliance, Nature Force, Hell Legion, Fanstiya Empire, Dynasty Rising. 5 attack targets, 4 attack type and 4 armor type. Unlimited combinations of cards, pushing the limits of your brain.\n- Easy to play, Difficult to master. You can start immediately without knowing any rules of battle. Interactive tutorials helping you get the basics of this game quickly.\n- Supports asynchronized battle which allows you to play with friends anytime, you do not have to wait friend to be online. Just send or accept the battle request. It's that easy~\n- Amazing game interface, artworks and legendary sound tracks music inspires you while playing.\n(Supports multiple languages in game)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"momoStorm Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]