[{"id":2258,"name":"A Boy and His Blob","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a5/2a5a257d20eebd5ba35fb5a650ee0b75.jpg","description":"A Boy and His Blob makes its triumphant return! A reimagining of the NES classic, as the boy, you feed your blob jelly beans and watch him transform into cool and useful objects to solve puzzles and escape danger. With its robust and emotionally driven story, challenging puzzles, and visually impressive art style, A Boy and His Blob is sure to become a classic once again.\n\nWhen Blobolonia is threatened by an evil Emperor, the blob comes to Earth looking for help. Instead, he finds a young boy. Help the blob dethrone the evil Emperor that's terrorizing Blobolonia and establish a friendship with the blob that will last a lifetime.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Abstraction Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"}]},{"id":19522,"name":"Between Me and The Night","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/714/714b71e3ff4616949567c62d916fee24.jpg","description":"‘Between Me and The Night' is a surrealist action adventure game that walks the thin path between sanity and madness. Take on the role of a young boy and explore and interact with the mysterious house in which he lives. Solve puzzles around the house to reveal new places, help you overcome the shadows of the night and discover the strange world beyond it's walls.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RainDance LX","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16726,"name":"Eador: Genesis","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6be/6be4cd415b47078ccf78c0128baed0dd.jpg","description":"Eador: Genesis is an indie turn-based strategy game created by Alexey Bokulev. It has inspired the development of Eador: Masters of the Broken World.\nTake the role of a mighty Master and shape the destiny of Eador, on land and within the astral plane itself. Explore the land and rule provinces as you see fit, defend them, and keep the populace in line or they may rebel. Choose from thousands of items — swords, spells, weapons, armor, and more — to outfit the heroes you recruit so they may best meet any challenge. Keep your heroes healthy and they will grow stronger as they gain experience from battle. Forge alliances and engage in the delicate art of diplomacy as you negotiate trade agreements or wage war against a mutual foe. Eador, with its many wonders and adventures, awaits. Will you answer the call?\nKey Features:\nThe critically acclaimed indie TBS inspired by classic strategy games\nA balanced fusion of grand strategy, turn-based tactics, and RPG elements\nOver 170 buildings, 80 spells, and 70 units available that can be used in any combination","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Snowbird Games","platforms":[{"id":0,"name":"PC"}]},{"id":13852,"name":"The Shivah","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38d/38de9a12029b15bc15262379840814b1.jpeg","description":"Russell Stone is a Jewish Rabbi at a poor synagogue in New York City. He is a devout man with a problem. Membership is way down and he lacks the funds to keep his synagogue open. Things are looking very bleak, and he has grown progressively more cynical and bitter with the passage of time.\nJust as he is on the verge of packing it all in, he receives some interesting news. A former member of his congregation has died and left the Rabbi a significant amount of money. A blessing? Or the start of something far more sinister? Can Rabbi Stone just accept the money and move on? His conscience says no. Step into his shoes as he travels all over Manhattan in his attempt to uncover the truth.\nFeatures rabbinical conversation methods, a unique method of fighting, an original score, and three different endings!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":10552,"name":"Meadow","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ae/5aef66474e040c113a5c44560d5d7560.jpg","description":"Heaven is a place called Meadow! Vast, teeming with life and now a unique social experience. Might and Delight invites you to frolic freely in the lush fields of Meadow - a unique multiplayer sandbox.\nUnlike traditional titles from the Shelter franchise, in Meadow the more time spent embracing the gameplay features in the world, the more you receive. Owning any previous Shelter related title(s) or products will also unlock in-game content. The open landscape also provides ample room for exploration with new patches and additions promised.\nBand together with other animals, form uneasy allies or choose to explore alone. Whatever you decide, the open park life is one you will want to immerse yourself in.\nMain features:\nPlay as any combination of animals on land, water or air in the largest expanse of land ever created for a Shelter game.\nCommunicate with other animals via specially created emotes, symbols and sounds.\nUse senses to discover and track other players in world.\nVisit the den to choose from up to 9 different animals, over 60 skins and over 90 expressions and symbols to unlock.\nThe more Shelter titles and products you own, the more bonuses you unlock.\nNew original music from Retro Family.\nShelter products in Meadow\nOwning any Shelter game will unlock the ability to play as that animal in Meadow (e.g. owning Shelter 2 unlocks the lynx etc.)\nOwning all games (no soundtracks or books included) will give you the possibility to play as the adorable bear cub from Paws.\nGain unique sound abilities if you own any combination of soundtracks.\nOwning our interactive books will unlock unique 3-dimensional emotes.\nFor the collector and owner of the entire Shelter catalogue, you unlock the ability to play as a bird.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Might and Delight","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":42370,"name":"Edge of Eternity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/295/2959ee1a7bb55a7258cc5406b91c50bc.jpg","description":"In a world torn asunder, the people of Heryon wage a desperate war against a mysterious invader, the Archelites. As this conflict against magic and technology grows to cataclysmic proportions, a new threat emerges from the battlefield.\nThe Corrosion: the Archelites’ most cruel weapon, a terrible sickness that poisons the body, twists the limbs and warps people into horrible, misshapen abominations.\nA forlorn soldier in this godforsaken war, Daryon is ready to make the ultimate sacrifice for his country... until the day he receives a letter from his sister. Their mother has contracted the fateful disease, and they need him to find a cure.\nOn that day, Daryon will have to make a choice that will change his life – and the fate of his world – forever.\nAn enthralling JRPG adventure where your choices matter:\nDiscover a grand tale of hope and sacrifice, filled with plot twists and heart-wrenching moments. Solve quests in multiple ways, make your own choices and face their consequences.\nA gorgeous world to discover:\nJourney through the world of Heryon’s unique and ethereal environments, and unearth its most ancient secrets.\nA stunning soundtrack from the composer of Chrono Trigger & Xenoblade Chronicles: :\nHeryon is brought to life by a sublime soundtrack from industry legend and composer of Chrono Trigger & Xenoblade Chronicles, Yasunori Mitsuda\nA Deep & Strategic Combat System:\nOutwit your enemies in epic turn-based tactical combat: use the environment to lure them into devious traps, outsmart and outflank them to inflict massive damage! Craft your gear and enhance it with powerful crystals to unlock unique combinations of skills and power-ups.\nA Cast of Charismatic Characters:\nMeet a cast of larger-than-life companions, each with their own unique personalities and attributes. Watch them grow and evolve throughout the story, as you live through it yourself. Discover their dreams, flaws, hopes, and torments as you experience and share many special moments together.\nCommunity features:\nBuild your own world and adventures with Edge of Eternity’s modkit: the Eternal Forge, share your creations with the community, and share your adventures online through a special Twitch mode!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Midgar Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":16725,"name":"Moirai","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c69/c69a863c4730b6a6ec79b3e2ce8cb583.jpg","description":"The townsfolk tell you that a woman named Julia has gone missing. You venture out into the cave just beyond the village looking for her. You're given a knife to protect yourself. What you find there may surprise you.\nMoirai is an experimental, first person game created by Chris Johnson, Brad Barrett and John Oestmann.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Chris Johnson","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":6298,"name":"Incredipede","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/181/181db2da1f5ca3aaf1139490462cd330.jpeg","description":"Steam Greenlight\nAbout the GameIncredipede is a puzzle game that celebrates the vast diversity of life in the world. The game follows Quozzle, a lone Incredipede on a quest to rescue her sisters. She has a unique ability to grow new arms and legs wherever she needs them, transforming into a snake, a spider, a horse, a monkey - anything you can imagine. You can give her antlers or a tail, use nature as a blueprint or strike out in weird new directions. Control Quozzle as she learns to swing through the trees, climb sheer cliffs, dance over rivers of lava, and even soar through the air on thermal winds.\nIncredipede was made by a small team headed by Colin Northway, author of Fantastic Contraption. It was written while traveling in over a dozen countries including Honduras, Turkey, Japan, and Costa Rica.\nMake and control a staggering array of creatures\n120 levels in three beautifully crafted worlds\nSend your creatures to your friends to try to control\nUse the Level Editor to create your own puzzles\nImmersive ambient soundscape","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Northway Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":2096,"name":"TRANSFORMERS: Fall of Cybertron","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f4/5f44810c864fa054da5e0b84dc16267d.jpg","description":"Transformers™: Fall of Cybertron™ transports you to the final days of the planet Cybertron where you will experience the darkest hours of the apocalyptic war between the AUTOBOTS and DECEPTICONS.  Embark on an adrenaline-fueled journey through a wide range of missions and massive environments designed around each character’s unique abilities.   With the stakes higher than ever before, you play as a variety of Transformers characters, including Grimlock’s nearly indestructible T-Rex form and the legendary Combaticons forming into the colossal Bruticus.  Fight through both sides of the Transformers’ most epic battles leading to their legendary exodus from their homeworld.\nTransformers™: Fall of Cybertron™ allows you to go head-to-head as AUTOBOTS and DECEPTICONS with its multi-player online mode.  Create your own personalized character and weaponry with the most advanced and in-depth customization ever before seen in a Transformers video game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Activision","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":44,"name":"The Disney Afternoon Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b1/4b1dcd2b961f9bbed964d0b4914ed5e8.jpg","description":"Starring a cast of beloved Disney characters, The Disney Afternoon Collection takes you back to a golden era of gaming and afternoons filled with adventure. Hunt for treasure around the globe as Scrooge McDuck, fight crime as the hero Darkwing Duck, take to the skies as ace pilot Baloo the bear, and enjoy co-op as Chip and Dale to take down Fat Cat.\nThe collection includes the following six games:\n1.       Chip 'n Dale Rescue Rangers\n2.       Chip 'n Dale Rescue Rangers 2\n3.       DuckTales\n4.       DuckTales 2\n5.       Darkwing Duck\n6.       TaleSpin\nAll six classic games feature new and improved visuals and include filtering options that replicate a retro look and feel.\nThis collection also offers new ways to play with Boss Rush and Time Attack modes, each of which encourages time-based gameplay and features online leaderboards. Additionally, a new “Rewind” feature makes these challenging titles more accessible for newcomers, with the option to rewind time and enjoy a swift recovery from blunders. Best of all, the in-game  Museum will provide history buffs with a wealth of extras to celebrate the era of the original releases, such as concept art, and music – all lovingly preserved.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":563395,"name":"Voidigo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2e/b2ee48597052337024512605f49600a1.jpg","description":"Voidigo is a chaotic and colorful roguelite shooter with a focus on dynamic boss fights.\nEquip one of the many ranged weapons and fight back the corruption.\nOr use one of the melee weapons if you prefer a more personal approach.\nDodge attacks and stomp your enemies to gain the upper hand.\nThe many bosses of Voidigo will put up a good fight, relentlessly fueled by the void's corruption.\nDuring the fight the boss might flee the area, leaving you to decide whether to hunt them, or gather your strength.\nBut don't linger too long or they will start hunting you.\nTo help you on your fight, find a wide array of powerups for fun synergies.\nWhen between worlds, trade your weapons, powerups and other resources. To fully tailor your playstyle.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"semiwork","platforms":[{"id":0,"name":"PC"}]},{"id":530497,"name":"Evil West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b5/1b5182c76448fc3ffcbb16b3a55392ee.jpg","description":"Evil never sleeps… but it bleeds.\nA dark menace consumes the American frontier. As one of the last agents in a top-secret vampire-hunting institute, you are the final line between humanity and a deep-rooted terror that now emerges from the shadows. Rise up to become a Wild West Superhero, eradicate the vampire threat and save the United States!\n\nIn visceral, explosive combat, unleash hell with your firearms, lightning-fueled gauntlet and gadgets. Kill bloodthirsty monstrosities in style as a lone hunter or in co-op with a friend. Explore and fight in a narrative-driven campaign while upgrading your weapons and hunting tools. Unlock new perks to evolve your monster-slaying mastery, crafting your own playstyle to defeat the supernatural hordes.\n\nBattle alone or with a friend in stylish, gory action combat\nMyths and legends retold within a stylised, weird wild west universe\nEvolve with perks, upgradable weapons, and tools\nExplore and fight through a story-driven campaign to save America","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":349610,"name":"Le Donjon de Naheulbeuk: L'Amulette du Désordre","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca7/ca78b2ce41c564855f1927c48ce6d693.jpg","description":"Are you ready to dive into a tactical RPG chock-full of charm, humor and crazy characters?!\nThey are clumsy, inexperienced and feisty but...they’ll have to endure each other’s company to get the dungeon’s treasure.\nHowever, a feeling of déjà-vu quickly arises...\nGuide this team of unlikely heroes in an adventure full of humor and chaos!\nThe Naheulbeuk universe is an original creation by French author John Lang. It started as a very popular audio comedy series parodying role-playing games and heroic fantasy tropes. Now the story is available in English and as a video game for the first time!Game features\nA...LESS THAN IDEAL...TEAM OF HEROES:\nPlay with seven classic role-playing game characters complementing each other’s skills as you level them up: the Ranger, the Elf, the Dwarf, the Magician, the Ogre and the Thief!\nEvery member of the team has their own skill tree to upgrade their abilities and equipment.\nChoose one of three additional companions to join the team on their adventure!\nEPIC BATTLES:\nExciting turn-based battles, with creative support mechanics between team members.\nAn adaptive difficulty system: from an accessible and fun story mode with simplified combat to the “nightmare mode” where the smallest tactical errors will doom you!\nAn expansive bestiary (more than 100 enemies!) pushing you to think more tactically with every fight.\n{STEAM_APP_IMAGE}/extras/explo_floor_gif.gif\nEpic boss battles where you’ll have to muster both strength and smarts to emerge victorious!\nHidden and destructive objects (including beer kegs) with surprising status effects will turn the tide of battle for the better...or worse!\nA DREADFUL DUNGEON:\nExplore a huge and surprising dungeon from the cave up to the luxury quarters of the evil lord Zangdar, passing through the goblin iceskating park and even an extremely lively tavern!\nEscape traps and solve deadly puzzles to unlock the most impressive treasures!\nBizarre conversations, absurd situations and unusual encounters await!\nExperience an exciting main storyline and many side quests for your heroes","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Artefacts Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18716,"name":"WASTED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fa/8fae705b6b1c7225f894748c746b8272.jpg","description":"Games for dummies: A bunch of anonymous ATMs act like bumper cars in an arena, roaming around set on a desolate square quay surrounded by an infinite ocean. As a first-person player, you ram into other bot ATMs before they hit you to earn cash. Spoiler: you always lose. Designed for PC, using keyboard or Xbox controller. Play @Kunstmuseumgelsenkirchen or download for free to play at home!This is an indie art video game by Studio Alona Rodeh, Berlin, Germany. It was produced for Interzone, a solo show at Kunstmuseum Gelsenkirchen (2024-2025) with the support of Stiftung Kunstfonds_SoloProjekt, the Ministry of Culture and Science of the State of North Rhine-Westphalia, Alfried Krupp von Bohlen und Halbach-Stiftung, and Artis.WASTED can be played with an X-Box controller (preferred) or keyboard.X-Box Controls:Up/Down = AccelerateLeft/Right = Steer Left/RightMenu Button = Pause/RestartKeyboard Controls:Up/Down = AccelerateLeft/Right = Steer Left/RightEsc = Pause/RestartZ = Left TriggerSpace = Right Trigger","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mr. Podunkian","platforms":[{"id":0,"name":"PC"}]},{"id":18608,"name":"Data Hacker: Corruption","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a5/1a532e9f03515c021cb10a47bb9cdcf0.jpg","description":"This second Data Hacker title allows those who have completed the prequel 'Initiation' to import their completed save files with ease; keeping decision data, team members and inventory intact!\nOr, start a new game and make your choices on the fly!\nData Hacker: Corruption is a retro-inspired JPRG set within a virtual realm and a simulated Online Game. It is a narrative-driven game that questions the value and definition of life and its inherent value. The game features two completely separate storylines and partial voice-acting.\nOur story shifts up a gear: everything is changing rapidly, with each side vying for a position that will secure their future. The SiliCAI army fends off both Virulea and Hunter attacks while trying to maintain equilibrium. They seek power untold; a way to vanquish those who would do them harm.\n\nIn the coming war, on which side do you stand? Do you defend the SilicAI and their digital world, or fight for the people of the real world?\nThis second Data Hacker title allows those who have completed the prequel 'Initiation' to import their completed save files with ease; keeping decision data, team members and inventory intact! Or, start a new game an make your choices on the fly!\n\nFeatures:\nImport your save file from Initiation (Keep your team, inventory and decision data intact!)\nFully voice-acted opening and closing cutscenes!\nA massive graphics overhaul,\nTwo possible routes to take; play both the 'Real' and 'Virtual' story lines,\nOver 1000 craftable items,\nA fan-favoured new game+ feature with extra content!\nOver 70 unique team recruits to build your dream team,\nTons of optional, additional content, allowing you to explore the Worlds to a deeper extent,\n69 achievements to attain,\nTrioarch; the addictive trading card game,\nTwo different racing minigames,\nAn expansive set of Worlds, Settings and Dungeons!\nTo prevent the spread of Corruption, time for a Reboot http://store.steampowered.com/app/331790","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"New Reality Games Int.","platforms":[{"id":0,"name":"PC"}]},{"id":4957,"name":"Theme Hospital","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc5/fc52d6a48ea3596563f4853c71ea8028.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nManage floor designs, hire medical staff, and cure some of the wackiest diseases known to man.  Act quickly though, it is sure to be a matter of laugh and death!\nDownload this PS one® Classic today!\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 123 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\n© 2009 Electronic Arts Inc. Trademarks belong to their respective owners.\nAll rights reserved.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":619806,"name":"FAR: Changing Tides","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d70/d70084559f41e7a7d4b1cc441c163763.jpg","description":"Set sail and discover the wonders of a flooded world filled with mystery. Traverse the ruins of a once great society and use the pieces from its past to build a brighter future. Dive into unknown depths on the hunt for precious fuel and salvage, devise innovative solutions to overcome intricate obstacles, and unearth forgotten relics lost to time. Carry their memories and don’t give up hope.\n\n\nCAPTAIN YOUR SHIP\nExperience the thrill of captaining a unique seafaring vessel with a mind of its own. More than a ship, this is a friend. Together you’ll brave high seas, navigate intense storms, and plumb the perils of a briny deep, growing as an inseparable partnership. Along the way you’ll need to keep things functioning by unlocking parts and fixing faults. The farther you travel, the more you’ll learn about your ship’s fascinating complexities.\n\n\nA CAPTIVATING WORLD\nContend with both the fantastical and familiar in a richly detailed environment to charm and challenge. From bleak shorelines lapped by tides, to desolate basins in flooded forest valleys, to submerged enclaves frozen in time, each lovingly hand-painted location tells its own incredible story.\n\n\nA MEDITATIVE EXPERIENCE\nFAR: Changing Tides is a relaxing, accessible and meditative adventure for everyone to enjoy. Set against exquisite and elegant scenery, and scored by a hauntingly beautiful soundtrack, this game transcends language to deliver an enthralling, warm-hearted, life-affirming experience that will stay with you.\n\nA LONE SAILS LEGACY\nImmerse yourself in an entrancing odyssey like no other. FAR: Changing Tides is the sister title to 2018’s multi-award-winning FAR: Lone Sails. Like the critically acclaimed first game, it encompasses ecstatic highs, mournful lows, and great mysteries to uncover. At the centre of this evocative and poetic journey is the unforgettable tale of a boy and his ship, searching the world for answers.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Okomotive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":19006,"name":"Hook","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f2/2f2bca9ccd1d666e14f9f0554c42fb80.jpg","description":"HOOK is a short minimal, puzzle game that I made after getting a lot of positive feedback about a\nprototype that is published on Kongregate.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Maciej Targoni","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Web"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5512,"name":"Army of Two: The 40th Day","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/743/74353594f351ba09d451ab118ff8c81c.jpg","description":"A carefully orchestrated series of mysterious catastrophes is dragging Shanghai, China to the brink of ruin, and now the Army of Two™ must fight their way through ravaged city districts as they try to beat the odds and uncover the secret of the 40th Day.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":427779,"name":"Beyond The Wire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/93f/93f72c178e3cd8cbfb821885e4dad63a.jpg","description":"Beyond the Wire is a large scale multiplayer first-person shooter immersing players in the frantic and bloody Western Front of the Great War. In battles with up to 100 real-world combatants, players will have to contend with large open maps and tight claustrophobic trenches. Utilizing both period-appropriate guns and a more tactical close-quarters melee combat system, the action in Beyond the Wire is more comprehensive than anything seen in a WW1 game to date.\nSoon entering Closed Alpha, Beyond the Wire will have an Early Access release in 2020. Wishlist now for development updates and information about release!Tense & Chilling Trench WarfareIt’s muddy, it’s bloody, it’s gruesome. Tight corners, waves of bayonets on all sides, and limited vision - this game shows off Trench Warfare at its worst. Are you up to the challenge?\nMassive Multiplayer Action 100 players at a time face off in 50v50 tactical combat, with an emphasis on methodical bolt action rifle combat and the brutal scale of action soldiers faced on the front lines of the Great War.A Unique Melee System Weapon type and player stamina both have an impact on feel and effectiveness of Melee attacks. Bayonet charges add one last brutal option to the arsenal of choices players have at their disposal. All of this adds to the realistic portrayal of World War 1 combat.\nTeam-focused GameplayCo-ordinate and chat with your fellow soldiers-at-arms! Beyond the Wire places an emphasis on team collaboration. Players succeed only when their teammates do.Cinematic VistasBeautifully crafted maps provide a rich playing environment that helps to further emphasize tactical and strategic challenges.\nGraphic Imagery The horrors of war are honestly represented with realistic gore, brutal violence, and vision limiting attacks such as chlorine gas or white phosphorus.Historically Inspired WeaponsWeapons created with an emphasis on historical accuracy, with minor changes made only when it creates a more engaging and fun gameplay experience. While Beyond The Wire is not a simulation game, we strive for as much accuracy as possible while still ensuring a fun First Person Shooter experience for a wide range of players.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Redstone Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":43753,"name":"Xenoblade Chronicles 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9a/a9a6055569c986a04d066b310ea57ebb.jpg","description":"As the giant beasts march toward death, the last hope is a scavenger\nnamed Rex—and Pyra, a living weapon known as a Blade. Can you find the\nfabled paradise she calls home? Command a group of Blades and lead them\nto countless strategic victories before the world ends.\n\nEach Titan hosts its own distinct cultures, wildlife, and diverse\nregions to explore. Search the vast open areas and labyrinthine\ncorridors for treasure, secret paths, and creatures to battle and index.\n\nDuring these escapades you'll get to know a large cast of eclectic\ncharacters, including the weaponized life forms known as Blades. Gather\nthese allies, bond with them to increase their power, and utilize their\nspecial ARTS to devastate enemies. But to save the world of Alrest, you\nmust first demystify its cloudy past.\n\nA new story in the Xenoblade Chronicles™ series\n\nThe next adventure is on the Nintendo Switch™ console—set on the backs\nof colossal, living Titans\n\nDiscover each Titan’s diverse regions, culture, wildlife, equipment,\nand hidden secrets\n\nFind, bond with, and command weaponized life forms known as Blades to\nearn abilities and enhance them\n\nUncover the history of Alrest and the mystery of its endless ocean of\nclouds","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Monolith Soft","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":31906,"name":"Diablo II: Lord of Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/525/52577395aba84652f16e68e9541d38d7.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Blizzard North","platforms":[{"id":0,"name":"PC"}]},{"id":13276,"name":"Cubic Castles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c61/c611cd869e51c771498326dd3b4b8fdc.jpg","description":"3D Platforming Meets Open World Voxel Building!\nCubic Castles is an online game where you build worlds from cubes and other items. What kind of worlds? Anything you want! Role playing, 3D-platform gaming, or other challenges! What you make is up to you. Want to make a punishing parkour with slippery ice and deadly spikes? No problem! Or maybe a simple house on a hill overlooking a lake? That's easy too! Even after only a few days the open beta saw players create many fantastic and varied worlds!\nFeatures:\nMassively multiplayer in one large, persistent world.\nYou share the world with everyone! Find a plot of land, put a castle down, and start creating!\nSuper-playable 3D Platform Action\nCubic Castles operates with a fixed camera that you control, and the gameplay is anything you want it to be, from action platforming to artistic design.\nCustomizable Characters\nCreate your own unique look with hats, shirts, plants, glasses, and more!\nMining Resources\nMine resources in a variety of world biomes including forests, arctic wastelands, deserts, mountain ranges, and tropical islands, all with different resources you can use. More to come!\nIntuitive Crafting\nJust drag your raw resources and tools into a workbench to see what you can build.\nCrazy Obstacles\nAccelo-rings, mechanical spikes, quicksand, lava, warp doors, and tons more!\nGenerous Economics\nForget the grind! Our pricing is fair and reasonable. And cubits even pop out for free as you mine.\nActive Community\nWe just launched the open beta, and already there’s a very active, vocal community. And we're listening!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cosmic Cow","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":45545,"name":"Raiden V: Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5a/d5af48793440a97cbf0fb9c114f77234.jpg","description":"THE ORIGINAL BULLET-HELL IS BACK!\nArcade hit Raiden first left its mark on the shooting genre 25 years ago. The easy to learn, hard to master series comes to the PC in its most modern and advanced form yet! Join the war for Earth's future-where the tide of battle holds constant surprises.\nGame Modes:\nStory Mode - All new story full of twists and turns! The story alters depending on your performance!\nBoss Mission - Defeat bosses under special conditions and compete in the leaderboards!\nGallery - Dozens of character, concept, and game art waiting to be unearthed!\nFeatures:\nSupports 1 - 2 players (offline)\nNew ship damage system (uses health bar, not lives)\n3 distinct ships with different Defense, Mobility, and sub-weapons\nNew \"Cheer Attack\" that greatly boosts sub-weapons for a short time\nVoice Acting for the first time in the series\nDirector's Cut exclusive levels","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"UFO Interactive Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":35020,"name":"Metal Gear Solid 2: Substance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d47/d47f3c61af2d0510cbd5e2e2818b4ab9.jpg","description":"Top-secret weapons technology, under cover of an oil tanker, is being mysteriously transported to an unknown destination. As Solid Snake, an ex-special forces member and one-man army, it's up to you to infiltrate the transport and keep this deadly weapon of mass destruction from falling into the wrong hands!\r\n\r\nMetal Gear Solid 2: Substance is the enhanced edition of Metal Gear Solid 2: Sons of Liberty, one of the most anticipated sequels and highly acclaimed titles of 2000. Now with all-new game modes (VR Missions, Alternative Missions, Snake's Tales Missions), hidden characters and storylines, the adventure takes you even deeper into the world of stealth and espionage than ever before.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":14337,"name":"Defend Your Life: TD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/652/652e0c77fe46da3480abac293ba6e9ad.jpg","description":"Defend Your Life! Is tower defense set in human body where players are fighting against villain hordes of viruses and bacteria. Levels and units correspond to reality of human anatomy.\nShow your tactical and strategy thinking in epic battlefields situated in appendix, pancreas, heart, brain and many others vital organs. Customize build order of towers and use wisely upgrades and mighty spells. Use electric shock, bombard the enemies or support your towers by adrenalin injection. Summon mighty Golem and stop enemies like Flu, Cold, kidney stones or cancer. Everything in outstanding graphics.Key Features:Enjoy 17 epic battles in real human organs with interactive\nFight against 20+ different enemies based on\n2 monumental boss fights where you will face the Stonekid and Cancer\nCommand Platelet soldiers and support them in fights\nHero Room with specialists ready to fight under your command\nBuild and upgrade 3 attacking towers with rich tech tree and don´t forget to support them with tower increasing range, attack rate or damage\nUse and upgrade in-game bonuses with strong effect during fight – explosive bombs, electric shocks or adrenaline increasing attack rate of your towers\nEnjoy the game on easy mode or accept the challenges of medium or hard difficulties\nRead the in-game encyclopedia in order to take advantage of the knowledge about enemies and buildings\nUse headphones for engaging audio experience included original music and sound design.\nEnjoy the awesome hand painted levels and catchy cartoon animations\nAddictive gameplay that will hook you in the human body for hours and hours!Contact & SupportFor all news, strategy guide or full wiki of Defend Your Life! visit http://defendyourlife.aldagames.com/.\nIf you would like to learn more about our studio Follow us @AldaGames, like on Facebook or visit our website at: http://www.aldagames.com/.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alda Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":367081,"name":"Medieval Dynasty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e7/4e799f7d79c3eb4c8e6bc15f460b0ac8.jpg","description":"Europe in the Middle Ages -- Nobles and clergy rule over Europe. Trade between the nations brings not only prosperity but also envy, distrust, and greed. Take advantage of this ever-changing global landscape and turn your simple village into a domain fit for a king! Ensure your bloodline’s place in history by creating a dynasty that will rule for generations!\n\nMeet the trials and tribulations of the Middle Ages head-on in MEDIEVAL DYNASTY:\n\n•\tSafeguard your place in history by founding a prodigious dynasty\n•\tExpand your borders by constructing buildings for your people\n•\tFarm, hunt, and cultivate the land to keep your populace well-fed\n•\tThe winters are harsh; plan accordingly so that your people don’t starve\nExperience the blood and dirt of the Middle Ages in a realistic 3D Open World.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Render Cube","platforms":[{"id":0,"name":"PC"}]},{"id":51507,"name":"Forgotton Anne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8d/f8dc81f20f9e56f7bfbe853cda8fcb51.jpg","description":"Imagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again.\nForgotton Anne is a seamless cinematic adventure with a focus on meaningful storytelling and light puzzle platforming. You are Anne, the enforcer who keeps order in the Forgotten Lands, as she sets out to squash a rebellion that might prevent her master, Bonku, and herself from returning to the human world...\nKey Features:\nDiscover a beautifully realised world of wonder filled with Forgotlings - charming everyday objects brought to life, bursting with personality.\nUncover the truth behind the harrowing conflict taking place between an impassioned ruler and ruthless rebellion.\nHarness the power of Anima, the energy that brings life to the Forgotten Lands. Use it to solve puzzles and command ultimate control over Forgotlings’ lives.\nChoose carefully. Your words and actions can alter the tale being told thanks to a branching dialogue system that places the power in your hands.\nRun, leap, and soar as you strive to guide Anne home, unlocking areas and abilities along the way.\nEnjoy hand-animated visuals created using the same traditional techniques that brought your favourite animated movies to life.\nImmerse yourself in a soaring orchestral score performed by the Copenhagen Philharmonic Orchestra.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Square Enix","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9673,"name":"Flat Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f5/8f5a4e32988c86cfc92e592c3b6c43ac.jpg","description":"Flat Heroes is a minimalist super intense local multiplayer game with cooperative and competitive modes for 1-4 players that features squares!\n------------------------------------------------------------------\nFlat Heroes is a minimalistic, super intense action game starring squares for 1 to 4 players. It features a delightful control that allows players to move around the scenario in a super fluid way allowing them to beat all the challenging scenarios that its cooperative mode offers.\nThe game also features four completely different versus modes for players to compete against each other or against the AI, each mode highlighting a different set of skills.\nThe graphic style is based on the latest graphic design trend, keeping a simple but direct aesthetic and polishing all the animations and transitions to create an eye candy experience.\n------------------------------------------------------------------FAQ:\n- Can I play the game alone?\n> Yes. The levels of the waves (cooperative) mode have been designed to be enjoyed solo as well, and the versus modes also feature bots to play against. But you can invite your friends at any moment! Call them if you get stuck! :)\n- Will the game have online multiplayer?\n> No. If the game sells well and we see an option we might consider it, but it's not a feature as of now.\n- Can I play with controllers? What if I don't have any?\n> The game has been designed to be played using controllers, so ideally you will need as many controllers as players. However, we have also added a keyboard-mouse control scheme for those who don't have a gamepad.\n- Does it have a color-blind mode?\n> Yes,  the game allows players to lock a color scheme that suits their needs, during the Early Access we'll work with the community to make sure there's a color palette for each type of color-blindness.\n- Is the waves mode too hard and frustrating?\n> It's really accessible, the first levels are easy as you get introduced to the mechanics, and the game gets more challenging on the latest levels, especially if you are playing alone. But it gets easier if you bring in more friends to help you!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Parallel Circles","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":427787,"name":"Shop Titans","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f0/8f07b1a5a155bb434d597a87f2056184.jpg","description":"As a thriving new shop owner in a bustling adventurer city, it’s time to roll up your sleeves and get to work! Craft, haggle and sell your way to the top and you are sure to attract many colorful characters to your shop… perhaps even the king himself!\nGET CRAFTING\nCRAFT: Craft from an ever growing collection of items including swords, shields, boots, guns and much more!\nUPGRADE: Master your favorite blueprints and unlock powerful upgrades to make them more efficient and valuable!\nENCHANT: Enchant powerful elemental and spirit effects to any item and awaken their true power with over a million possible combinations!\nBUILD YOUR OWN SHOP\nCUSTOMIZE YOUR SHOP: Carpets, racks and stalls… or simply tons of cat statues! Design the shop of your dreams and your customers will love you for it!\nDRESS TO IMPRESS: Choose among dozens of hairstyles, clothes and accessories to make your shopkeeper truly stand out!\nASSEMBLE HEROES AND QUEST FOR LOOT\nPERSONALIZE YOUR PARTY: Recruit and customize Heroes among 18 classes and equip them with items you made yourself!\nMEET THE CHAMPIONS: Team up your Heroes with unique and powerful Champions, characters with powerful abilities and unique stories.\nBATTLE MONSTERS: Send out parties of Heroes to battle monsters and gather valuable crafting materials!\nA MASSIVELY MULTIPLAYER WORLD\nJOIN A GUILD: Team up with other players around the world and invest together to create a bustling city!\nTEAM UP: Raid the Lost City of Gold together with your guild and unlock extremely valuable blueprints!\nPLAY THE MARKET: Rack in gold (and gems!) by participating in a worldwide, player-driven market!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Kabam Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":17534,"name":"Dead6hot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/877/877445ea341f04f184cbe1acb5092f08.jpg","description":"Dead6hot (pronounced Dead-Shot) is a quirky little local multi-player shmup. Dead6hot is focused on fast paced shooting and a very frantic atmosphere. It can be played in short periods making it perfect for the short coffee breaks or whenever you feel like killing a few minutes (pun intended).\nIt takes place across 5 unique stages and 15 levels in total. You and your not so arch enemy each play as one of ten character choices while trying to kill each other or the hordes of minions. You get to wield five types of weapons in arena style combat. The last man standing wins!\nDead6hot features:  Four game modes\nSingle player versus an AI player or against hordes of minions\nLocal multiplayer versus each other or cooperative against the minions\nFive stage settings, including underground, a pyramid, and a futuristic city\nEach stage has three differently designed levels for single player vs. AI, multiplayer vs. each other, and the hordes of minions\nFive weapon types including grenades, pistols, and machine guns\nTen delightful characters to choose from including Elfis Presley, Bathead, and the masked luchador El Pistolero","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Chuck Productions","platforms":[{"id":0,"name":"PC"}]},{"id":16106,"name":"Reversion - The Escape (1st Chapter)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76c/76c2575acee13ea41e9c87d070ec8123.jpg","description":"Steam Exclusive Offerdue to popular demand, the game has now Trading cards.\nAbout the GameYou wake up in a hospital with no memories... You are in Buenos Aires in 2035 and the city is under the control of a military organization. Suddenly, you realize that your life is in danger and that you need to escape as soon as possible. What are you going to do?\nReversion is a science-fiction Point&Click Adventure Game developed by the indie 3f interactive. Inspired by classics of the genre from Lucas Arts, Sierra or even Pendulo Studios, 3f interactive thought its game for the fans of old school adventure games.\nYou will be propelled to a desolate future, robbed of your memories and looking desperately for a clue to understanding your predicament.\nPlay as Christian and find his way back to his memories, through numerous puzzles and dialogues with intriguing characters. Team up with Victoria, a mysterious girl also held in the hospital, and escape from this hell. Along your way out, discover who you are and what happened before you woke up 20 years later to, maybe, change the future…\nPlunge in this fascinating adventure and reverse the disastrous events that left the city in ruins.\nTake your chance to change history; it’s time for Reversion.Features:\nCharismatic and mysterious characters\nDeep and challenging puzzles to keep you hooked\nWide variety of interactive objects through each scenery\nClassic 2D graphics, as in the golden age of the genre\nHand drawn characters and locations, digitally colored, achieving a beautiful result that you can see for yourself\nHints system to help you move forwardOther Reviews\nhttp://indiegames.com/2012/05/freeware_game_pick_reversion_3.html\nhttp://www.rockpapershotgun.com/2012/05/10/buenas-noches-buenos-aires-reversion/\nhttp://techzwn.com/2012/06/f2p-fridays-reversion-chapter-1/\nhttp://www.indiegamemag.com/argentinian-adventure-reversion-translated-to-english/\nhttp://toucharcade.com/2012/10/18/reversion-the-escape-review/  (iOs Version)\nhttp://www.game-boyz.com/content/node/18806 (iOs Version)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"3f Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10668,"name":"Road to Ballhalla","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebe/ebe3ff591823d6f0ae6ff13ae78ac093.jpg","description":"Steam Workshop Integration (BETA)Create and share your own trials or play those of other players! Help us beta-test the Road to Ballhalla Editor, which is available for everyone!\nAbout the GameRhythm-driven GameplayMove with the music to overcome even the most difficult hazards, like laser beams or insane camera angles trying to explode both your balls and your brain.Dynamic Music and SFXThe dynamic music by Emmy-nominated composer Nicholas Singer is tailored to the rhythm and style of each level, with sound effects adjusting to the level's music. Without it, you'd fail even harder.Epic StorylineNot included. Instead, be guided by floor texts that make fun of you when you fail and drop awful puns even if you unexpectedly don't.Scavenger HuntDiscover secret areas that lead to other secret areas which in turn lead to other secret areas1. You get the idea, and maybe even the rainbow that awaits you at the end of the treasure. Probably you'll just google it though.SpeedrollingReplay levels in Rush mode as fast as you can and prove that you are a good person by beating other players' highscores.Style your BallsBe rewarded with awesome bonus contents like tasty new colors2 and trail effects for your balls.Did you just Twitch?Enable Twitch integration and let the game mock not only you, but also your audience.Workshop IntegrationCommunity levels are probably better anyways - create and share your own challenges with the level editor.\n1 May contain traces of you going nuts.\n2 gluten-free","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":2881,"name":"Dead Island Retro Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/757/7572dd1a82c19e38d67977b64af6e000.jpg","description":"Time for some 16-bit retro revenge! Hell-bent on saving his cat, Max must carve a bloody path through a zombie-infested California, tearing his way through hordes of the undead, battalions of corrupt soldiers, and a slew of evil-minded ex-cons. Pull off crazy combos, collect power-ups, wield super weapons, and unleash insane magic attacks as you fight to become the amazing 16-bit side-scrolling hero you've always believed yourself to be!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":387309,"name":"Stay Out","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/897/897c2291479f2dff9c414e95f2a83bc9.jpg","description":"Stay Out - is a MMORPG with shooter elements, based on spirit of “stalking” - an urban exploration, searching and exploring mysterious, abandoned and forgotten by humanity pieces of our planet.\nDiscover a world full of dangers and incredible events, which has its own laws and principles.\nBecome one of the “Stalkers” - people living the romance of the unknown, able to overcome any trials in search of artifacts on the territory of the Alienation Zone.\nTake a look beyond the edge of the unknown, where the secrets of nature and deadly dangers await the daredevils at every turn.\nSurvive in harsh conditions, when you count every sip of water and every match.\nSecret laboratories, life forms of unknown origin, mysterious anomalies, and strange artifacts that challenge our knowledge of the laws of nature - all this is a huge world of \"Stay Out\".","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mobile Technologies","platforms":[{"id":0,"name":"PC"}]},{"id":387232,"name":"New Super Lucky's Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/880/880ca9c8cb5b3270c719c0202f27f2a7.jpg","description":"Join Lucky on his thrilling journey through the Book of Ages, a magical artifact that opens doors to amazing worlds. Meet new friends, explore exciting lands, and recover the missing pages from the evil sorcerer Jinx and his villainous family, the dreaded Kitty Litter.\n• Featuring a huge variety of gameplay, from expansive 3D hubs, to story-based adventure levels, 2D side-scrolling challenges, rewarding mini-games, mind-bending puzzles, and thrilling boss battles.\n• Thousands of collectibles to gather, tons of rewarding secrets to discover, a cast of memorable characters, and an entire wardrobe of costumes for the stylish adventurer.\n• Designed to delight and challenge players of all ages and skill levels.\n• A complete re-imagining of the original Super Lucky's Tale, featuring redesigned and new levels, a fully rotatable camera, tighter movement control, and major overhauls to nearly every other aspect, including the story, cinematics, music, and more.\nJump, burrow, and tail swipe your way to victory in this love letter to classic 3D platformers!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"playful","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":58086,"name":"LEGO The Incredibles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2d/f2dba64bcb56a6074f7d89b981c62071.jpg","description":"Experience the thrilling adventures of the Parr family as they conquer crime and family life through both Disney-Pixar films The Incredibles and Incredibles 2, in a LEGO® world full of fun and humor. LEGO® The Incredibles allows players to explore action-packed story levels and an epic hub world - including Municiberg, as they use their unique “Super” abilities to bring the city’s Super Villains to justice. Gamers can also team up with family and friends in 2 player co-op to assemble incredible LEGO® builds!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"TT Fusion","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":36999,"name":"Dreadnought","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/717/7170a9c4824d5b759e061e241d659706.jpg","description":"Team-based, capital ship combat perfected. Dreadnought is a free to play, sci-fi warfare game that puts you in command of million-ton capital ships for tactical matches in space and over planetary surfaces. Plasma broadsides, Goliath nuclear torpedoes, and long-range Tesla cannons are all part of a broad arsenal you can employ against your enemies. The game is a free-to-play full game experience with no Pay-to-Win mechanics.\nIn this online multiplayer, action shooter the deliberate combat pace gives you time to think and react to an evolving battlefield. You will take into combat a selection of ships and loadouts which gives you the opportunity to respond to the opposing team’s fleet composition and strategy.\nWhen your enemy is within weapons range the sky lights up with an assortment of lasers, missiles, and cannons that you must contend with. Your ship is equipped with an energy management system that gives your crew the ability to activate shields, increase engine speed, or put all power to weapons to increase your damage output. Through cunning ship configuration, effective energy management, ship positioning, and an intimate understanding of your weapon systems, you can lead your team to victory!\nAs you play, you earn credits and experience to unlock over 60 ships and over 150 weapons and modules across five tiers.\n\"Have you tried Dreadnought? Best free game out there. Graphics are awesome, kinda feels like I'm stealing by playing this one\" - JPanman\n\"Boom. Straight facts right here! Dreadnought is awesome, free to play, and not pay to win! \" - @Elite_CR\n\"At first i didn't think I'd EVER like the corvette ships... turns out, they're a whole lotta fun!  Dreadnought is a blast (pun intended)\" - @TrashPandaGrr\n\" I'm here to say that Dreadnought, the free to play large spaceship biffing game, is fun as hell and very pretty \" - @badthingsliker\n\"So very proud to represent Dreadnought! Every time I get online and interact with the amazing community they have, I am reminded how lucky I am!\" - MTNrhyno\n\nCommand million-ton capital ships in 8v8, team-based combat\nTens of thousands of possible combat loadouts allow you to define your own play style\nUnlock over 60 ships across 5 classes and over 150 weapons and modules\n6-point, customizable cosmetic slots and hundreds of thousands of color, decal and pattern combinations give you the freedom to personalize your ships\nCreate a Captain avatar and customize with full outfits that suit your background\nFight across space lanes, starbases, and even planetary surfaces\nRespond to the opposing team’s composition by changing ship and loadout to better answer the dynamic needs of the battlefield\nDeliberate pace of combat gives you time to plan your strategy and carefully execute it\nZ-axis combat reminds you to look up and down in addition to left and right\nMultiple game modes including classics: Team Deathmatch, Onslaught, Conquest, or customize your own unique match!\nNew ships\nNew game modes (e.g. Havoc, co-op PvE missions)\nNew maps\nReworking the user interface\nBeam weapon revamp\nGame server refactoring\nDaily login bonuses - Come back daily to get better and better rewards\nPrestige system - Show off your experience and gaming prowess to other players\nMatchmaking improvements\nCrew progression\nAnd more...\nIn Dreadnought, you can never “buy power” and there are no \"pay to win\" mechanics.\nShip customization purchases can apply to all ships in a given class through all tiers.\nWe develop and release regular game updates\nOngoing bug fixing, balance and quality of life improvements\nRegular community streams will inform about upcoming changes and development updates\nWe listen to our players. Tell us what you think and want to see - we will take it into account\nThe game is currently in Open Beta. At Steam launch, all current players will be required to have a Steam account and complete a (painless) one-time accounting linking process. New Steam players post-launch will need to complete the same process. Again, for existing players/players who choose to play before Dreadnought is available on Steam, your progress and balances will remain intact from now on through the transition to Steam.Add us to your Steam wish list to be informed when Dreadnought launches and follow us to receive updates on ongoing development.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Grey Box","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":25142,"name":"Spider-Man 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/621/621abeb341a359cf755be4f80fa09c7f.jpg","description":"Based on the hit film, Spider-Man 3 allows players to experience the\r\nactions of heroic red-suited Spider-Man and, for the first time ever,\r\nhis darker, more mysterious black-suited persona.\r\n\r\nSet in a larger, dynamic, free-roaming New York City, the game gives\r\nplayers the freedom to choose their own gameplay experience through\r\nmultiple movie-based and original storylines, fully integrated city\r\nmissions and performance rewards including improved speed, combat\r\nmaneuvers and agility. In Spider-Man 3, players draw upon Spider-Man's\r\ncompletely revamped combat abilities as they protect the city and defeat\r\nnemeses using expanded aerial fighting, finishing moves and dynamic\r\nwebbing during missions and epic boss battles.\r\n\r\nWelcome to the dark side: For the first time ever, control the\r\nlegendary black suit, which magnifies Spider-Man's strength, agility\r\nand durability. Punish your enemies with explosive new attacks and\r\nincredible upgrades, including fearsome room-clearers. All this power\r\ncomes with a price, though, as players will find the black suit harder\r\nand harder to control. Will you be strong enough to make a heroic\r\nchoice before your quest for vengeance turns the city against you?\r\n\r\nLet freedom ring: Go anywhere at any time in a larger, dynamic,\r\nfree-roaming New York City and get involved in whatever you want,\r\nwhenever you want. Players decide how to proceed through the game and\r\nset their own goals. Should Spider-Man follow a plot twist, switch to\r\nan alternate storyline, fight off crime waves that threaten the city\r\nor explore vast interior and underground locations? You decide.\r\n\r\nThe city is your playground: From towering skyscrapers to the vast new\r\nsubterranean sewers and subways Spider-Man must patrol all of New\r\nYork. Three criminal gangs and variety of Super Villains will be\r\ncompeting for your attention, taking hostages, stealing cars,\r\nharassing citizens, and creating havoc. Will you be able to save\r\neveryone?\r\n\r\nSuper Villains galore: Experience multi-stage, dynamic boss battles\r\nagainst the headlining villains from the movie as well as a host of\r\nlegendary comic book foes who all take advantage of their\r\nenvironments, their minions, and the large-scale destruction that\r\ntheir superpowers cause in trying to defeat Spider-Man.\r\n\r\nGo, go gadget: In addition to faster web-swinging, certain events and\r\nenvironments open up additional Spider-powers for you to control.\r\nUsing Spider-Man's web abilities, he can catch falling objects\r\nincluding people and debris, fix hazards like broken train rails,\r\nbarricade doors, and even slingshot from the tops of buildings for\r\nincreased speed and huge air.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Treyarch","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PSP"}]},{"id":21691,"name":"Steel & Steam: Episode 1","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/481/481740b43d7c764d225d645990ea6a01.jpg","description":"Steel & Steam is a Jrpg Fantasy Steampunk Adventure!\nThe desert plague is spreading from the East: a reminder of a destructive past.\nMan has evolved since the wars of old, creating new ways to combat this deadly expanse.\nUsing Steel and Steam, man fights this terror, as well as the monsters that spawn from its touch.\nNow covering half the continent of Terra Corpus, the desert’s slow and steady hunger is threatening to consume and corrupt all life in the world.\nSome of the desperate seek out legends of the past: elemental guardians said to sleep inside the planet. Once resurrected, these powerful beings can be controlled, and guided to stop the desert.\nThe legends speak of a chosen few who have the ability to tame these elemental beings and reshape the world.Our story Begins With One Such Person.\nSteel & Steam takes the best elements from the fantasy JRPG’s of old, such as great stories, awesome characters, and classic monsters, and combines them with a touch of steampunk. It’s like taking Lord of the Rings and mixing in the Wild West.\nIt’s a game where you, the player, decide how to interact with the game. The classic games usually had a linear, player-focused story moving the game forward. Steel & Steam follows this model, but also gives you the option of moving the story forward through multiple, intertwined story lines. Any character you meet has the potential to affect the end. Will you or will you not save the world? Who you interact with, and how, will affect the way the ending is played out. Whatever happens in one city or town can affect another. These choices give additional life to the world of Steel & Steam.Who Are the Main Heroes Of Steel & Steam?\nNoah Phoenix, age 19, 5’10, 170 lbs. Favourite weapons: sword, axe or pistol. Protective wear: shirts, light, medium and heavy coats. Noah is an adventure junky; he likes to jump in feet first, while searching for the next mystery around the corner. After a short stint with the Silver Head City Guard, Noah decided to move on as a freelancer. Without Alyssa to watch his back, he probably would have already bitten off more than he could chew.\nAlyssa Noble, age 21, 6’3, 180 lbs. Favourite weapons: fists, clubs or rifles. Protective wear: shirts, light, medium, and heavy corsets. Alyssa grew up learning how to fight by protecting her father’s caravans. She likes to step back and assess the situation, before laying it out cold with a good punch. Noah’s best friend and protector, she believes that if she wasn't around to watch Noah’s back, he would have been killed long ago.\nHere is an idea of some of the things you can expect from Steel & Steam:\nA PC release: The game will be released for PC.\nA huge world to explore: The game is being designed as an immersive fantasy world. Cities and towns will be full of people and buildings to engage with, with story lines that characters can choose to follow regarding the history and current state of affairs that affect the day to day lives of the people who live here.\nAn engaging story: An episodic story that involves two main heroes, with an epic conclusion.\nChoose your story: You have the chance to complete side missions that change how you interact with the world of Steel & Steam. From changes to the characters you meet, all the way down to changes in the very landscapes you encounter, the side missions provide extra depth that unlocks new stories and opportunities to earn experience without the grind.\nRetro style gaming at its finest: Remember the glory days when games told epic stories? Steel & Steam is a retro RPG similar to the classic RPG games played on the Sega Genesis, NES and SNES systems. Relive the past, relish the future, and revel in the now.\nA little side fun: Want to take a break from saving the world? Then you can also play some mini games, such as fishing or arena gambling\nAn Original Soundtrack","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Red Meat Games","platforms":[{"id":0,"name":"PC"}]}]