[{"id":49715,"name":"Serious Sam 3 VR: BFE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96e/96efa69d237d0bcd1636c1ec69e6a2e0.jpg","description":"Serious Sam 3 VR: BFE is a virtual reality action shooter, a glorious throwback to the golden age of first-person shooters where men were men, cover was for amateurs and pulling the trigger made things go boom.\nServing as a prequel to the original indie and Game of the Year sensation, Serious Sam: The First Encounter, Serious Sam 3 VR: BFE takes place during the Earth’s final struggle against Mental’s invading legions of beasts and mercenaries.Key Features\nNow available in glorious VR! - \"basically the same game but the devs just ticked a magical checkbox for VR\"\nSerious Sam Fusion 2017 integration - play cross-platform with players of the pancake version to find out what's the ultimate combo: hi-tech motion controllers or good old keyboard & mouse\nTrue locomotion support - teleport, instant teleport, blink teleport, classic full locomotion (with or without comfort mode).\nDual-wield the Destructive Arsenal – A scoped assault rifle or a double-barreled shotgun? Automatic shotgun or the punishing minigun? Why not use both!? Unleash the almighty barrage of flaming cannonballs!\nFrantic Arcade-Style Action – Hold down the trigger and lay waste to a never-ending onslaught of attackers or face being overrun by Mental’s savage beasts. No cover systems, no camping – it’s just you against them. All of them!\nSteam Workshop – Submit your content creation or download new player-created content and modifications using Serious Sam Fusion 2017\nMultiplayer – Fight against each other or other teams in various multiplayer versus modes like Deathmatch, Team Deathmatch, Capture the Flag, Last Man Standing, Last Team Standing and Instant Kill. Or, you know, play nice and game together in Standard Co-Op, Classic Co-Op and Coin-Op Co-Op. Op op!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Croteam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":35948,"name":"SWAT 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2e/f2e59a790f186dbeb0a0085ef4558385.jpg","description":"SWAT 4 is a first-person tactical shooter that puts the player in command of a Special Weapons and Tactics team. The campaign consists of 13 deployments that range from simple warrant service to hostage situations involving heavily-armed terrorists, and it is the player's duty to minimize casualties on all sides.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"2K Australia","platforms":[{"id":0,"name":"PC"}]},{"id":30748,"name":"The Operative: No One Lives Forever","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0c/a0c5990e25bae51c320403d155281d75.jpg","description":"In No One Lives Forever, you assume the role of Cate Archer, a beautiful, but deadly operative working for UNITY--a super-secret organization fighting to free the world from the clutches of H.A.R.M. From tense subterfuge to in-your-face combat, the game features spy action influenced by the 1960s and killer weapons, including a rocket-launching briefcase, a robotic poodle, and exploding lipstick. Through 60 levels of exotic locales, you must battle deadly arch villains, fight off killer sharks, skydive from a plummeting airliner, and explore twisted jungles.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20176,"name":"Poöf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bcf/bcf48324a3299a4d0bbe2127a9c96b28.jpg","description":"Poöf has been tricked by accepting a golden laying kitten. But the precious kitty makes all the greedy monsters envious. Survive waves of monsters trying to steal your revenue!\nPoöf vs the cursed kitty is a mix between tower defense, and platforming action, a game focused on hardcore gameplay, tight controls and choices, inspired by games such as Mario Bros Arcade Game, Orcs Must Die and Super Crate Box.\nTo get rid of your enemies, simply jump on them, or place towers to attack and poos to slow down, use fire knives or bombs, ice winds to freeze enemies and golden eggs for Armageddon ! You can also control time: slow it down in danger moments and accelerate it to increase the difficulty and score more points. How fast will you play?Key Features\nHardcore gameplay and exponential difficulty\nOriginal Graphics and frenetic Music\n108 Missions to accomplish to unlock upgrades\n36 Upgrades - Powers, Weapons, Enemies, and more.\n12 Unique Enemies - Including Ogres, Ghosts, Dragons, Slug dogs, or even gigantic Flies.\n10 random Customization objects to collect - Backgrounds, Music, Poöf and kitty’s costumes.\nUnlock a Leaderboard to compete worldwide\nSupport USB game controllers","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arkedo Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20073,"name":"GIGANTIC ARMY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b3/5b3c53eecbf8ef9c262b3be48e26a6ca.jpg","description":"Side-scrolling mech-shooting bad-assery is BACK!\nGIGANTIC ARMY is a heartfelt homage to 16-bit era mech shooters such as Cybernator / Assault Suits Valken, Metal Warriors, and Front Mission: Gun Hazard, developed by the studio behind the acclaimed shooter SATAZIUS.\nIt is the 21st century and Earth is at war with the Ramulons – an alien race determined to stop humanity’s advance into space.\nMankind’s war against the Ramulons has reached the planet Ramulon itself and it is now down to YOU to pilot the ‘GMR-34 SALADIN’ - a Manned Combat Robot - and take on the Ramulon army. Customize your arsenal of explosive, projectile and plasma weapons, and combine them with melee attacks, thrusters and shield to take the fight to the enemy and end the conflict!\nGIGANTIC ARMY boasts awesome retro arcade stylings, slick animation, superbly detailed character and stage design, and addictively frenetic game play.\nFeatures:\n• Six stages of intense mech-shooting action!\n• Twelve mid and end level bosses of gargantuan proportions to take down!\n• Four difficulty modes from ‘Easy’ to ‘Insane’ to cater for all skill levels!\n• Customizable weapons load-out to suit your play style!\n• Dash, thrusters and shield give your mech satisfying maneuverability and defensive options!\n• Rebalanced gameplay from the original Japanese version!\n• 42 achievements!\n• Steam Trading Cards!\n• Linux Version!\n• Bonus retro packaging PDF assets to create your own physical version!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ASTRO PORT","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19694,"name":"Theatre of War 3: Korea","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7f/c7fdeeff663ff51e0b3598582e76af9d.jpg","description":"Replay the events of the first hot war of the Cold War era, the Korean War, also known as the Forgotten War. Players will be involved in two campaigns, both set in the 1950’s: the North Korean (June 25 – August 20) and the American (September 15 – October 8).\nIn this title tactical engagement experts can test their skills on a new strategic level. Move your forces over the entire Korean Peninsula, managing reserves, as well as the fuel and ammo supplies. Tactical battles in Theatre of War 3: Korea are generated based on the strategic situation.\nKey features:A new strategic mode greatly enhances the experience of tactical battles\nNon-linear dynamic campaigns, a first for the series\nCampaign generator with additional USSR faction for creating “what-if” scenarios\nUnique landscape modeling for correct infantry combat simulation\nLots of new artillery, armor and aviation units, e.g. transport helicopters\nUpdated control system focusing more on squads and not on individual soldiers\nEngineer Corps: real-time mining and demining\nDetailed replication of authentic Korean landscape and architecture\nNew binocular view feature for total immersion","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":18646,"name":"OCEAN CITY RACING: Redux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63e/63e61cc57e384d6d317bfa06070cf3e2.jpg","description":"OCEAN CITY RACING is an open world driving game offering a variety of different gameplay options to it's players.  Enjoy the FREE ROAM MODE that lets you explore Ocean City in it’s full detail , drive your way through the thrilling RACE MODE or be the fastest driver in TIME-TRIAL MODE and participate in events! FREE ROAM MODE\nTotal Freedom! Explore the environment by exiting the car and walk in first person view or cruise around Ocean City either with the many different vehicles that are scattered around the map. RACE MODE\nBecome the best driver in Ocean City. Race in exciting tracks set in different time of day settings and unlock vehicles as you progress. TIME TRIAL MODE\nConcentrate on setting the fastest time on each unique track which includes insane stunt locations, off road tracks and a subway station.\nKEY FEATURES\n• Unreal Engine : Powered by the industry leading game engine Unreal Engine  , Ocean City Racing offers a massive open world city with a traffic and a pedestrian system , a day & night cycle, dynamic, real-time lighting and shadows, also different weather conditions such as rain, fog and sun.\n• Open World City and Environment: Ocean City is based in 3 main districts which are connected via 2 different bridges and a tunnel. All these are explorable by users either with a vehicle or on foot.\n• Vehicles: Features over 20 highly detailed vehicles to drive. Ranging from sports cars , muscle cars , super cars , off road vehicles. Even a kart and a quad bike can be driven.\n• Mini Games:  Free Roam Mode of Ocean City Racing includes many mini games such as Car Football, Stunt Locations , Easter Eggs and much more.\n• Progression: Ocean City Racing allows players to progress through time trials and circuit races and allow them to unlock new cars and events on the way.\n• Soundtrack: Features songs of Christopher Amott from his 'Impulses' and 'Follow Your Heart' albums , as well as other instrumental and orchestral songs that fit the atmosphere of the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"OCR Dev Team","platforms":[{"id":0,"name":"PC"}]},{"id":15656,"name":"That Dragon, Cancer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8f/e8fa452900cc19ee168c74d6d13f69bd.jpg","description":"\"This is where we go to remember our son Joel, up through here along this path. We want to show you who he was, and how his life changed us. Can we walk here together for a while?\"\nA videogame developer's love letter to his son; an immersive narrative driven experience to memorialize Joel Green and, through his story, honor the many he represents. That Dragon, Cancer is a poetic and playful interactive retelling of Joel’s 4-year fight against cancer.\nUsing a mix of first-person and third-person perspective, and point-and-click interaction, this two-hour narrative experience invites the player to slow down and immerse themselves in a deeply personal memoir featuring audio taken from home videos, spoken word poetry, and themes of faith, hope, despair, helplessness and love, along with in-game tributes to the loved ones of over 200 of our Kickstarter backers.\nCan you find hope in the face of death?\nNote: Thank You For Playing is an independent project, produced and directed by Malika Zouhali-Worrall and David Osit. The Green family along with the rest of the Numinous team did not produce the film, but they are very honored to be the subjects of the film.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Numinous Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":14155,"name":"Beware Planet Earth","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9b/e9b9829e063a17e7f31faf216fbaa529.jpg","description":"Beware Planet Earth! is a beguiling mix of classic tower defense and time management coming to PC via Steam for the first time. Save your cows from the Martian invasion by building an effective defense using towers, traps and objects, and also by firing your Zapper directly at the invading force of little green men!Key FeaturesExclusive content on Steam: a multitude of new levels and enemies inspired by Valve’s universe!\nEndless Fun: full story mode with 46 levels over 4 seasons, plus 28 bonus challenges!\nSimple gameplay: different difficulty modes to choose from; “Veteran Mode” for experienced players and “Normal Mode” for the beginners\nIntense action: grab your Zapper to attack the Martians and overpower your machines!\nWacky machines: choose among 20 wacky machines; from the classic defence tower to the Helicowpter!\nDeadly enemies: over 20 quirky Martians; from the Metalhead and the Mad Scientist to the Ninja!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lightmare Studio","platforms":[{"id":0,"name":"PC"}]},{"id":12306,"name":"GROOVY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/538/5382b1da5fa87f23635d18c2ecc364ce.jpg","description":"Join the Discord\nAbout the GameGroovy is a fast-paced precision platformer where you can manipulate the colors of the world. Avoid traps using speed boosts, jump boosts, and color powers alongside a robot surfer named Finn to defeat the Gloom.\nIn Groovy you can manipulate the color of the world to alter the environment around you. This can be used to avoid traps, walk through walls and platforms, and more!\nThe gloom has infested the world of Groovy! It is up to you and your robot companion, Finn, to take them down!\nEveryone has their own preferences and, in a game about color, you should be able to choose the ones you look at. Choose from 15+ player colors and over 25 color palettes!\nSingle-player level campaign.\nColor manipulating platforming.\nIntense boss fights.\nCollectable smileys within each level.\nReactive dialogue from Finn the robot.\n25+ Color palettes.\n15+ Player colors.\nEndless and Boss Rush mode.\nChill Fishing mode.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SGS Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4067,"name":"Tales of Graces f","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/091/0912526bd231dd23a91de48a94486a06.jpg","description":"Tales of Graces f is now available as a digital download!\nJourney through a vibrant world full of political intrigue and strife, as you explore perilous dungeons and fight your way through fearsome adversaries! Command the tide of battle by freely switching between different fighting stances in real-time action-packed battles! Customize your character's appearance and skills to truly personalize your fighting experience!\n*This software is the same as the PlayStation®3 system game released on 3/13/2012 (BLUS-30903).\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\n© MUTSUMI INOMATA\nTales of Graces™ f & © 2010 NAMCO BANDAI Games Inc.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":3847,"name":"Just Dance 2014","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f8/7f8434f750a4e0e9a43a8549ce4fe661.jpg","description":"The party is back! Just Dance 2014, the next edition of the world’s 1 selling dance game, is bringing all new moves with breakthrough features and over 40 of the hottest tracks and dances.\nWith Just Dance 2014’s fresh list of hot tracks, you control the party! Get friends and family moving with Pitbull ft. Christina Aguilera’s “Feel This Moment,” Psy’s “Gentleman,” or One Direction’s “Kiss You.” Celebrate the throwbacks with legendary songs like Gloria Gaynor’s “I Will Survive.”\nJust Dance 2014 takes the fun to another level this year with all new ways to create the best party ever! Own the spotlight and lead back-up dancers with the new On Stage Mode, dance with anyone anywhere in the world with World Dance Floor or work out to customized Just Sweat experiences on any song! Bring home the ultimate party starter and join in the fun!\nVideo output in Full HD 1080p requires 1080p native display.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2013 Ubisoft Entertainment. All Rights Reserved. Just Dance, Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.\nPlayStation®Camera (sold separately) required to use this product.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"}]},{"id":2441,"name":"Shadow of the Beast","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e15/e156e882f49f56c7fa6b5f49f31b4c4b.jpg","description":"Explore the alien landscape of Karemoon, a world filled with beauty, brutality and mystery, on a lone quest to overthrow the malevolent tyrant Maletoth.\n\nSurvive epic boss battles and tackle hordes of enemies in ferocious adrenaline-fueled action. Develop abilities with skill points earned from the death of your opponents, unlocking increasingly brutal moves as you draw power from the blood of your foes.\n\nThe story of Aarbron is told once more. Re-live the legend.\n\nNearly 25 years ago, a game was released that would burn a lasting impression on the mind of gamers, Shadow of the Beast on the Amiga. It followed a monstrous warrior named Aarbron as he sought revenge against the beast lord that transformed him from a human. Now, Heavy Spectrum Games is bringing the story to a whole new audience, re-imagining Shadow of the Beast as a hyper violent next-gen adventure.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Sony Computer Entertainment Europe. Shadow of the Beast is a trademark of Sony Interactive Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":932691,"name":"Limbus Company","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7d/e7dfda8360574293c8b4dd81d2971f8c.jpg","description":"▶ A Combination of Turn-based RPG and Realtime Brawl\nEach turn results in a display of exhilarating action.\nIn the combat phase, units on both sides will act simultaneously.\nDuring the scramble, characters targeting each other may Clash.\nThe outcome of a Clash depends on the strength of their opposing skills and a sprinkle of luck; the winner can shut down the loser's skill.\nEnsure you use the right skills to win Clashes.\n▶ Single-handed Skirmishing\nConnect skill icons across the grid, and your units will take action according to your commands.\nChaining skills of the same color allows you to deal greater damage.\nUsing simple and practical controls, watch as the Sinners dance to your tempo.\n▶ Create Diverse Strategies with Identities and E.G.O\nForm teams of Identities and equip them with an arsenal of E.G.O that will create powerful synergies.\nYour foes come armed with a variety of Affinity-based attacks and tricky effects.\nIn particular, Abnormalities are formidable foes that may prove to be considerable challenges.\nLearn their behavior and weaknesses, and compose the right team to eventually conquer them.\n▶ Immerse Yourself in the World of Project Moon\nFrom the creators of 《Lobotomy Corporation》 and 《Library of Ruina》,  another tale set in the same, unique world unfolds.\nIn this massive dystopian metropolis, you will embark on a journey to find Golden Boughs with a cast of 12 Sinners.\nEnjoy a gripping story and the series of events that await.\nAll dialogue in the main story comes fully voiced in Korean.\nBest of luck, Dear Manager.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"ProjectMoon","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":750298,"name":"Iron Lung","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a5/3a54ad7b51f0bb9bfc558abcde90258e.jpg","description":"A short horror game where you pilot a tiny submarine through an ocean of blood on an alien moon.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"David Szymanski","platforms":[{"id":0,"name":"PC"}]},{"id":338387,"name":"KILL la KILL - IF","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b67/b6769a1f19b6d6dd9216e3d4e56701b9.jpg","description":"The critically acclaimed 2013 anime title that shook the streets of Honnou City, 'KILL la KILL' finally makes a comeback as an action fighting game! Play as Satsuki Kiryuin, Ryuko Matoi, and more, and indulge in the alternate story that will draw you deeper into the vivid and action filled world of 'KILL la KILL'.\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\n1-2 players\nNetwork Players 2-2 - Full game requires PlayStation®Plus membership to access online multiplayer\n10GB minimum save size\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© ARC SYSTEM WORKS / ©TRIGGER,Kazuki Nakashima/Kill la Kill Partnership","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Arc System Works","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":50404,"name":"Holyday City: Reloaded","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2f/e2febc1ceb2959d9413d5cb60d10655f.jpg","description":"Fun and money!!! This is what Holyday City Reloaded is about.\nPlay and unlock unique mechanisms to develop YOUR City.\nBuild Nightclubs to entertain your citizens.\nBuy a Cafe, equip it with the best possible coffee grinder machine and the citizens will form a queue to buy it before going to work.\nConstruct Science Labs to gain access to cutting edge technology and be able to manipulate the time.\nBuild Hotels and Factories and many other unique businesses.\nTrade your Resources to meet your city needs.\nBuild infrastructure and improve your billion dollar businesses and many more.\nDevelop the most profitable City, embark in a money making adventure and become the worlds richest tycoon.\nInnovative City Leveling SystemThe more profitable you make your city the more levels you acquire!\nExpand your city from a small town to a metropolis and then in a huge Skyline City.\nWhile you are at your huge office turn your amazing chair around and gaze the amazing view from the tallest skyscraper!\nEverything you see, makes money for you!\nUnlock trophies from your battle with the markets and store them in your personal mancave dungeon at home! Each time you want to relax visit your personal gallery's showroom and stare at these golden beauties!\nOFFICEWhen you get used to the view get back to work!\nSpend time in your personal office invite and interview the most experienced Managers that you intend to hire or make wise Investments that will skyrocket your profits!UNLOCKUnlock more unique features like, Marina, Ship Missions, City Aquarium, Airport, City Facilities, Atomic Lab, City Upgrades.\nHolyday City Reloaded is possibly the best and most accurate capitalism simulator. Start with a humble boutique expand and invest in many sectors and become the best businessman in the world. Your only quest is to make more money!\nPORT - AIRPORTExport your excessive resources for money. Export food, energy, materials, iron to the best markets of the world!\nUtilize your Iron deposits and create infrastructure in order to upgrade your port and improve your export prices.\nUnlock the Airport, establish trade routes and trade your excessive resources that you do not want to sell!\nTake the right investing decision and utilize your city's resources in the best way.\nSell, Trade or Invest. The decision is Yours!EVENTSUnique events take place in Holyday City during the year. Each event lasts for limited time only.\nParticipate and play in unique different mechanisms and claim amazing rewards!\nBoost not only your in game progress but also your fun level :)PRESTIGE ITEMSDevelop your city and unlock unique Prestige Items that you can show to your friends varying from Sports Cars to Jets and Private Tropical Islands!\nYou can become the richest capitalist in Holyday City. Take your personal Jet, visit your tropical island and go for a trip with your unique style yacht!AGENTSInvite the best agents from all the cities of the world to your office. Determine their price and sign profitable contracts with them and they will boost your city economy for you!\nMODERN ERA QUEST FOR RICHESIf you think that the ancient world champions were having a hard time fighting with other heroes for glory we can only guarantee that they wouldn't stand a chance in the realms of the modern era where the battle is with the markets! Make the right decisions because you cannot hide behind a merchant's guild, this is a solo mission to gather the world's riches!OFFLINE PLAYINGThe game keeps playing even when you are offline!\nCome back after a long break and with a click you will collect huge amounts of cash to spend!\nIf you are an idle/clicker player and you enjoy grabbing a soda and playing games this is a game that you want to try out!\nKEY FEATURES\nBuild the most charming City, Holyday City.\nBoost the progress of your businesses.\nHire managers.\nInvest your money in profitable investments.\nSign profitable contracts.\nResearch new technologies and manipulate time.\nUpgrade City's Infrastructure.\nExport the resources that your city produces.\nSend your ship in missions.\nExpand your City.\nModern and Social graphics.\nThe game progresses even while you are away or offline!\nMultiple events through the year.\nNOTE\nHolyday City Reloaded has been produced by the same gaming studio that created Midas Gold Plus http://store.steampowered.com/app/557400/ game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Holyday Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42238,"name":"The Walking Dead: 400 Days","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f3/1f3e7d7421a79617f4a06d365e0f3860.jpg","description":"Centered on a truck stop on a Georgia highway, this DLC episode for Season One of The Walking Dead by Telltale Games tells five linked stories of survival in the wake of the zombie apocalypse. From day 1 of the undead plague to 400 days later, The Walking Dead: 400 Days offers more of the horror and human drama of Robert Kirkman and Telltale’s award-winning series. Echoes of the choices you made in Season One will carry over into '400 Days' and the choices you make in '400 Days' will resonate into Season Two.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Telltale Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":37420,"name":"F.E.A.R. Extraction Point","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/495/495ae86eaf78b8f44049d07bd16cff9d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"TimeGate Studios","platforms":[{"id":0,"name":"PC"}]},{"id":23156,"name":"Army Men RTS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb9/cb988f8c804a749536038594388d441c.jpg","description":"Army Men RTS brings you back to the days of staging battles with tiny plastic soldiers in your backyard...except these green soldiers carry out your every command!\nCollect resources and build bases, vehicles, and entire platoons before the Tans can retaliate! The fun is fast and furious in this in-depth, pick-up-and-play battle!\nIntense RTS action: build structures, manage resources, and create battle tactics.\nLead tiny troops through life-size environments from the backyard to the kitchen, and more!\n3 gameplay modes: Campaign, Great Battles, and Multiplayer.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Pandemic Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"}]},{"id":20310,"name":"The Joylancer: Legendary Motor Knight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8b/e8bf0321a7b572253877423a20ff4317.jpg","description":"http://store.steampowered.com/app/332300\nAfter 256 years of peace in the lands of Antoria...\nthe ROSELIAN ARMY OF BATRATHYM has risen up once more to attempt to reclaim the land of ANTORIA that they lost in the 43rd War of Darkness.\nThreatening to start War of Darkness 44, KING LANCELOT BARTHOLOMEW ROSELL of the ROSELIAN EMPIRE sends his beasts through the lands, corrupting and destroying everything in their path.\nRefusing to hide from the incoming threat, a young recruit at the MOTOR KNIGHT ACADEMY named JOY LANTZ leaps into action!\nWith the power of DIVINE LIFE granted to the MOTOR KNIGHTS through their DIVINE ARMOR, and her powerful signature weapon, the hybrid motorized lance-drill BURST ARM known as the JOYLANCE, JOY refuses to let anybody stop her from saving the world-- not even the ACADEMY itself!\nAllow your DIVINE ARMOR and your BURST ARM guide you to TRUE JOY!\nEXTREME MOTORIZED ACTION! THE JOYLANCER: LEGENDARY MOTOR KNIGHT has a large selection of local multiplayer components, allowing up to four players to play at the same time, in almost every game mode!\nGet up to three friends in the action in the MAIN GAME by giving their souls to your weakened foes!\nCooperate with your friends to complete the mysterious DARK PALACE Mode!\nBattle against each other in huge skirmishes and various duels in the MOTOR COMBAT mode!\nWe don't want Joylancer to be just a single-player experience; our goal is to create an intense action game that can be enjoyed by yourself, with friends, or even at parties!THERE IS TRUE JOY IN LANCING!\nOver 12 different types of enemies to face, each one featuring its own strategies and special techniques!\nExtreme Motorized Multiplayer -- tag in a partner to have them take control of an enemy, OR fight with up to four players in the MOTOR COMBAT melee arenas! (Local / Offline)\nThe Dark Palace -- Explore the mysterious palace containing a variety of combat challenges! Can you survive the many floors of the THE DARK PALACE?\nRevised Life Systems -- collect DIVINE TANKS to store extra life energy that saves you from peril!\nExpansive Difficulty System -- featuring a huge variety of difficulties for both casual and hardcore action aficionados!\nTons of Player Customization Options!\nSingle color action not your bag? Set the color layers to your own custom colors, or activate the colorful DX Mode!\nSet a variety of different viewing ratios and fill out the empty space with our colorful GAME JOY DX borders!\nManually adjust what effects display on-screen, turn up / down the screen shake & hitstun slowdown, choose between multiple soundtracks, and more!\nJoylancer is a game that is constantly growing and experimenting with new ideas, mechanics, and various touches that we make over development.\nYou can expect to see the following features to launch with the November 7th release:\nSave ANTORIA CENTER CITY, home of the MOTOR KNIGHTS, from the threat of the Roselian Army! (AREA 1)\nMake your way through the FOREST OF DECEPTION and defeat the beast corrupting the forest! (AREA 3)\nTry to conquer 50 floors of the DARK PALACE! -- Battle enemies, collect powerups, and try to survive with no continues!\nPlay with up to 4 players in MOTOR COMBAT! -- Time Combat, Divine Combat, and Crystal Combat modes!\nSix difficulty modes! -- Enjoy unlimited continues, relax with generous checkpoints, or prove your skill under no continues and no retries!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"alpha six productions","platforms":[{"id":0,"name":"PC"}]},{"id":20299,"name":"Scoregasm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c24/c24febccf3cc2be35c99762e3746f0f7.jpg","description":"Scoregasm is an incredible, variety rich shooter with a non-linear, branching paths style galaxy to explore. It's pretty, accessible, fun and really rather good!\nBlast your way through the galaxy's many varied levels and use your skills to change your route, find new levels, new enemies, unlock bonus challenge stages and fight the bosses to discover multiple endings!\nKey Features:\n\n43 varied levels to find in the main game\nMultiple routes, explore the galaxy to unlock new levels!\n43 Challenge levels to unlock, one for each main stage\nOver 100 different enemies to find and kill\nAchievements that you actually have to achieve!\nSecret Expert Galaxy\n86 Combo Medals, one in each level!\n7 endings - find all the biscuits and a £5 note!\nFancy Pants 3D graphics\nOnline Scores for every game mode and challenge game!\nJoystick/Control pad support\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"RC Knight","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19613,"name":"Three Fourths Home: Extended Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ed/2ed29ad7c887285e1cdb9a61ceef4616.jpg","description":"In her mid-20's, Kelly has been forced to move back to Nebraska. Back to that flat expanse, that seemingly endless sea of rustling cornstalks peppered by rusty silos and rustier towns. A typically intense Midwestern storm is approaching while Kelly is out; she needs to get home.\nThree Fourths Home is a visual short story in which you assume the role of Kelly during her drive through the storm. In the 20 miles between her grandparents' crumbling barn and her parents' home, she receives a phone call from her mother. While driving through a stylized representation of rural Nebraska, you must navigate an extended conversation between Kelly and her parents and younger brother.\nThree Fourths Home takes a look into a specific moment of these characters' lives and their relationships with one another. The narrative touches on a variety of issues affecting Kelly and her family, including disability, adulthood, and familial obligation.Gameplay\nAs a visual short story, dialogue choice is the primary focus of Three Fourths Home. Between the main game and the epilogue, nearly 800 unique dialogue choices shade the story differently based on how you play. In addition to dialogue choice, you must also keep driving in order to keep the conversation going. Stop, and time slows to a crawl. Kelly has to move forward in order to get home.\nNew to the Extended Edition\nFor its Steam release, Three Fourths Home: Extended Edition includes an expanded edit of the initial release as well as several new elements, including a new epilogue in addition to a number of extra features.\nEpilogue: Idling in the Rubble\nSet at a bus stop in snowy Minnesota, Idling in the Rubble follows another conversation that Kelly has with her mother. The 20-30 minute experience delves into Kelly's past, examining her reasons for moving back to Nebraska and her internal struggle following the events of the main game.\n\nExtra Features\nRadio\nListen to the soundtrack by Neutrino Effect\nStories\nFour new stories penned by Kelly's younger brother, Ben\nPhotos\nTake a look through Kelly's final project for her college photography class","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"[bracket]games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14027,"name":"Airline Tycoon 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c93/c935f425ec67458c23569ce99af31a3a.jpg","description":"A decade after the best-selling Airline Tycoon comes the long awaited sequel to the legendary tongue-in-cheek economic simulation that puts players in the role of CEO of an international airline! Airline Tycoon 2 will challenge players to run a modern airline, design unique airplanes and grow a run-down carrier into a globally recognized company that passengers practically beg to fly. Airports worldwide are waiting to be explored, but beware– your rivals never rest! Crafty opponents are also working to dominate the skies… and they won’t let anything stand in the way of their goals!\nKey Features: \t\t\t\t\t\tExplore real world airports, from Moscow to New York, with realistic travel conditions and passenger volumes\nBuild your ideal fleet of planes – use the in-game editor to craft inexpensive mass-transportation „Greyhounds in the sky“ or unique, luxury jets that spoil the elite\nJump into the action as one of four playable avatars with unique strengths\nExplore your home airport in full 3D, while bossing your employees around and expanding your blossoming airline; you might even meet VIPs at the airport lounge\nTest your management mettle in a challenging business environment as you schedule flight plans, coordinate arrivals and departures and balance income and expenses – all to grow profit and enhance your airline’s global reputation\nRandom events bring variety to the game -- The Pope wants a special flight? Civil war in Russia? Volcanic ash clouds above Europe? If you act quickly, you can profit from these events!\nSabotage – annoy and slow down your opponents with devious actions. But beware; your adversaries may just pay you back in kind!\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"b-Alive","platforms":[{"id":0,"name":"PC"}]},{"id":11731,"name":"Albert and Otto","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e13/e13e55fb183c484cf547c0afd6c5d413.jpg","description":"Developer\nAbout the GameIn this first installment “The Adventure Begins” the player is thrown headfirst into a haunting world set in 1939 Germany in search of a mysterious girl with bunny ears.\nClues as to who she is and what happened to her are scattered throughout the game in the form of drawings left in post boxes and shards that the player must piece together.\nHowever the player is not alone on this adventure, help comes in the form of the girl’s magical bunny, Otto.\nThe player must use both Albert and Otto in creative ways to traverse a haunting world. At the beginning of the story, Albert can shoot and jump, while Otto can fit through tight gaps and hold down power switches. But together, they unlock new skills such as a double jump, levitation, control of electrical currents, and more as the story unfolds.\nFeatures\nUnique mechanic utilizing a little bunny which the player can carry around or leave and/or remotely control in order to solve puzzles\nA story that is inspired by dark events buried in our history and isn't spoon fed to the player but spans across 3 episodes and is told through a child's drawings and clues scattered throughout the game that force the player to think outside the box.\nLevitate sheep, use them as platforms to swim on, a torch to light a dark cave or as a distraction for wolves while you make a quick escape. (if your stomach can handle it)\n2.5 - 3 hours of unique puzzles that utilize a bunny, levitation, electrical switches, wolves, piranhas and more.\nExperience a mix of slow paced thought provoking puzzle design and fast unforgiving gauntlet sections.\nCome face to face with intimidating larger than life mechanical monsters and outsmart them.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9869,"name":"Wyrmsun","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0bb/0bb0d1448a8c802dd16353ae54f9488f.jpg","description":"Wyrmsun is an open-source real-time strategy game which features elements of mythology, history and fiction.\nIn the Wyrmsun universe a myriad of inhabited planets exist. Humans dwell on Earth, while dwarves inhabit Nidavellir and elves nourish the world of Alfheim. These peoples struggle to carve a place for themselves with their tools of stone, bronze and iron. And perhaps one day they will meet one another, beyond the stars...\nFeatures:\nRetro-style graphics\n3 playable civilizations\nStory-based scenarios, playable on a huge map\nDozens of units, buildings and technologies\nPersonal names and traits for units, being generated from several historical and fictional languages\nUnits can earn experience, being able to upgrade to new unit types or acquire new abilities upon level-up\nPersistent heroes, who carry over their level, abilities and items throughout scenarios\nPossibility to create your own custom persistent heroes\nNormal, magic-enchanted and unique items drop from enemies\nVery moddable game, with a built-in mod editor and Steam Workshop integration\nIn-game encyclopedia, allowing players to learn more about the units, buildings and other elements of the game, as well as their historical and mythological sources of inspiration\nNo microtransactions\nWyrmsun receives constant patches, frequently providing you with new content and features!\nNote: Multiplayer uses a peer-to-peer connection, so that you may need to tweak your firewall settings or port-forward to make use of the feature. See the Wyrmsun Q&A for instructions on how to port-forward.\nJoin us in Wyrmsun's Discord channel to chat about the game and discuss the development of new additions to it!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Andrettin","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5505,"name":"007 Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8d6/8d6af8c3058f13f95b221db6f2543355.jpg","description":"Gamers and Bond aficionados alike will become James Bond, reliving the world-famous spy’s most iconic and intense undercover missions from throughout the entire Bond film franchise — including this year’s highly anticipated new installment, “SKYFALL” available as a free download on November 9, 2012.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Activision","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":2684,"name":"Strike Suit Zero: Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/634/6343080a9108a9e40709a8eaf87101ff.jpg","description":"In the year 2299, an interstellar war rages. Take control of the Strike Suit – a craft with the ability to transform into a hulking suit of space armor - in a bid to save Earth from destruction. Immerse yourself in massive fleet battles where your dogfighting skills will directly affect the fate of the cosmos.\n\nDiscover a colorful and vibrant universe, with an epic story spanning 17 unique missions. Engage intelligent enemy fighters and take on colossal capital ships, exploiting weak points in their super-structure to blow them apart piece by piece. Upgrade your Strike Suit and customize your weapon load-outs to tailor combat to your tastes. Take advantage of six craft, including three Strike Suits, to experience dogfighting action as you’ve never seen it before.\nThe Director’s Cut is the definitive version of the game featuring a next-gen graphical overhaul, restructured campaign and additional content – including the Heroes of the Fleet campaign.\nThis is space combat reborn. Key Features\nFast, frantic space combat: freely engage multiple enemies, dogfight other pilots, fight massive fleet battles and defend vast structures.\nThe Strike Suit: strategically switch from Pursuit Mode (speed and power) to Strike Mode (a powerful, highly maneuverable combat mode).\nCapital Ship Destruction: take capital ships apart piece by piece – take out their turrets or target weak-points to blow out entire sections of their superstructure.\nVibrant and vivid universe: space is far from the dark, featureless void you'd expect. Discover the color and vibrancy of the Strike Suit universe across 13 unique locations.\nShip Designs from renowned Mechanical Design engineer Junji Okubo (Appleseed: Ex Machina, Steel Battalion).\nMusic from award-winning sound designer Paul Ruskay (Homeworld) including a collaboration with Japanese singer/songwriter Kokia (Tales of Innocence, Gunslinger Girl: II Teatrino).\nDirector’s Cut features new ship models, improved textures and lighting, a restructured campaign, the Heroes of the Fleet mission pack and the Marauder and Raptor Strike Suits.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Born Ready Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":840956,"name":"Fall of Porcupine: Prologue","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a0e/a0e43f919a9353dc9b376daca5994738.jpg","description":"The full version of Fall of Porcupine is coming soon to GOG.COM. You can wishlist here\nNew jobs can be tense – especially when you’re about to become a doctor! Join Finley on an original narrative adventure as you take your first steps in a new and exciting world. Together, experience the “Last Days of Summer” before a change of seasons stirs up the sleepy town of Porcupine.\nFALL OF PORCUPINE: PROLOGUE is a 100% free intro episode for the upcoming story-adventure FALL OF PORCUPINE.\nFALL IS COMING\nFALL OF PORCUPINE is a unique story adventure. The collision of work and daily life and an exciting reflection of an unhealthy healthcare system.\nFEATURES\n“Don’t miss our great features! Read more!”\nExplore A Beautiful, Diverse World\nNot only is there a lot to discover in the old hospital, but also in the small town of Porcupine itself. Take the time to meet the villagers and have a beer with them in the local pub, or take a trip to the nearby forest, where mysterious castle ruins are hidden.\nGet to Know The Exciting Characters\nThe blunt head doctor, the selfless nurse, Finley's smart friends, and many other residents populate the small town of Porcupine. Engage in funny, profound, and sometimes serious dialogues with them, in which you'll be able to choose your answers and influence your relationship with them.\nDemonstrate Your Skills and Empathy\nYou don't even have time to look at the clock because your patients are waiting! Investigate what's wrong with them through your conversations and treat them in different minigames that challenge you in logic, speed, and skill. And most importantly, withstand the stress when the strict head doctor questions your knowledge yet again.\nUncover Dark Secrets\nAt first glance, the small town is a warm, friendly place where everyone knows and greets each other. But if you live there for any length of time, you'll suspect that not everyone is as honest as they pretend to be and shadows lurk in the distance. Be on guard!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"BUNTSPECHT.GAMES","platforms":[{"id":0,"name":"PC"}]},{"id":611699,"name":"College Bound - Episode 1","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e62/e62cfc3fd878432ece1e1c9d4417a6b6.jpg","description":"College Bound is an adult game currently in development that features over 20 uniquely modeled and detailed female characters with high-quality, fully animated scenes.\r\nEpisode 1 includes weekly updates from 0.1.0 up to 0.3.6\r\nAfter two years of working your ass off in college, you finally managed to qualify for an international student exchange program, which also guarantees you a generous scholarship. It's supposed to be a hell of a year-long adventure - you and your girlfriend Summer (who made the cut as well) together in sweet, sweet Paris. Sounds nice, doesn’t it? Well, maybe if the principal didn’t suddenly exclude you from the program completely. That bitch.\r\nWhat caused her last-minute decision that’s threatening to ruin your relationship and year of adventure? What about your scholarship!? Are you and Summer going to be able to endure the long-distance test or will the plentiful temptations be too hard for you to resist? Are you a cheater, or are you loyal?\r\nWhat kind of friend will you be? Protect someone that you care about from a creep, stand up for those being bullied, and investigate a mystery involving school faculty. Or maybe all you care about is getting some action.\r\nFind answers to these questions (and many more as they unravel) on your own, as the choices you make in College Bound will impact the story with each and every update.\r\nThe game is a visual novel in-progress, utilizing classic Ren'py controls and containing high-quality renders as well as fully-animated, non-censored adult scenes. There's plenty more to come in the future.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"FOZ","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":378573,"name":"Metro Exodus: The Two Colonels","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b69/b691051365808f2b710df44382d3260b.jpg","description":"The Two Colonels is a story DLC for Metro Exodus that is part of the Expansion Pass. It takes place in the Novosibirsk Metro before the arrival of the Aurora Crew and follows the story of Colonel Khlebnikov. The story provides more details about the fall of Novosibirsk. The Two Colonels was released on the 20th August 2019, as announced at Gamescom a day previously.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"4A Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":364976,"name":"OMON Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0f/f0fdda4686835d1d291b6dee858c070e.jpg","description":"OMON Simulator\r\nYou are an officer in a special unit called OMON. You should ensure the safety of citizens at rallies, protests and public actions. Also take care of the protection of the first persons of superpowers.\r\nArrest people with your friends in a cooperative mode Unique Features\r\nProtect rallies and protests\r\nArrest people dangerous to society\r\nCatch the opposition leader - Alexey Carnivalny\r\nTake care of the first persons of superpower\r\nCo-op Mode - disperse rallies with your friends! (up to 10 people)\r\nAll characters and events appearing in this work are fictitious. Any resemblance to real persons, living or dead, or events is purely coincidental. The game does not have the goal of insulting or humiliating anyone.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ukrainian Bears","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":61061,"name":"The Blackout Club","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/76e/76e2ee3e55ed82691619e4896b6f2b35.jpg","description":"The Blackout Club is a 1st person, co-op horror game centered around a group of teenage friends investigating a monstrous secret beneath the skin of their small town.\nYou and your friends must team up to overcome the powerful forces that are arrayed against you. Using tools such as drones, noisemakers, and grappling hooks you will outwit and outmaneuver while attempting to obtain and record evidence that will prove what is happening to the rest of the world. With procedural elements that change goals, enemies, loot and more, no two nights in the neighborhood will be the same.\nNo one believes you, join The Blackout Club and make them see the truth.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Question","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":54751,"name":"Soulcalibur","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/743/7430f1846ba6ce836f169d936c89819e.jpg","description":"Soulcalibur (ソウルキャリバー, Sōrukyaribā) is a weapon-based 3D fighting game developed by Project Soul and produced by Namco. It is the second game in the Soulcalibur series, preceded by Soul Edge in December 1995. Originally released in arcades in July 1998, it ran on the Namco System 12 hardware. It was ported to the Dreamcast in 1999 with new features and improved graphics. The North American version was released in September 1999 as a launch game for the Dreamcast and was part of the successful launch of the new console. It became available as a downloadable title on the Xbox 360's Xbox Live Marketplace in July 2008 and it is backwards compatible with the Xbox One along with the sequel. A sequel, Soulcalibur II, was released in July 2002.\nThe game centers on the pursuit of the legendary weapon known as Soul Edge, now in the possession of a warrior known as Nightmare, who slaughters countless people to satisfy the blade's bloodlust. Other warriors pursue him either to claim the weapon for themselves or to destroy it, end his mass murder, and free him of its curse.\nDeveloped closely with Namco's Tekken development team, it is one of few home console ports that outdid their arcade parent graphics-wise. The title brought many innovations to the fighting game genre that include a heavy emphasis on weapons and a unique eight-way movement system. Soulcalibur is widely regarded as one of the best Dreamcast titles and is often cited as among the greatest fighting games ever released, as well as one of the best video games of all time.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"Dreamcast"}]},{"id":54520,"name":"Star Fox 64 (1997)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/569/5694a091203e4d29c15a9b734f933e9c.jpg","description":"Star Fox 64 was the first Nintendo 64 game to have included support for the Rumble Pak, with which it initially came bundled. The game has sold over 4 million copies since its release, making it one of the best-selling games on the system. The game received critical acclaim for smooth animation, detailed visuals, voice acting and use of multiple gameplay paths. It has been deemed by many critics and gamers to be one of the best games ever made.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":44506,"name":"Citadel: Forged with Fire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/294/294896c9944b4260dc49b384a441a0e9.jpg","description":"Citadel: Forged With Fire is a massive online sandbox RPG with elements of magic, spellcasting and inter-kingdom conflict. As a newly minted apprentice of the magic arts, you will set off to investigate the dangerous world of Ignus. Your goal: create a name for yourself and achieve notoriety and power among the land’s ruling Houses.\nYou have complete freedom to pursue your own destiny; hatch plots of trickery and deceit to ascend the ranks among allies and enemies, become an infamous hunter of other players, build massive and unique castles, tame mighty beasts to do your bidding, and visit uncharted territories to unravel their rich and intriguing history. The path to ultimate power and influence is yours to choose.\nWelcome to the magical world of Ignus: a 36 square kilometer landmass of sweeping plains, dense forests, craggy mountains, festering swamps and frozen tundra. Leave no stone unturned as you explore dangerous caves and ancient ruins to recover powerful artifacts and uncover a rich history spanning thousands of years. Embark on a journey across the land to find the perfect place for you and your allies to call home.\nMaster a diverse range of powerful spells. Use the Extract spell to quickly harvest the world’s bountiful resources, bring meteors down from the heavens with Conflagration, or lift and throw an entire castle with Telekinesis. Discover your conduit of choice among a huge selection of mystic wands and staves, magically imbued axes, swords, maces and hammers, and enchanted gauntlets.\nAlign your efforts with fellow Warlocks to create a mighty House. Create an internal hierarchy of power, design and plant your own House flag, share your resources to build huge castles and team up to hunt legendary creatures. Wage war with opposing Houses or hatch plans of deceit and trickery to cause internal chaos and ascend the ranks within your own.\nUse the Pacify spell to tame ferocious creatures and amass an army of minions. Tamed companions will gain experience and grow with you as you travel the world and triumph in battle. Siege an enemy fortress with a horde of savage Orcs, ride Horses and Direwolves to quickly traverse the vast landscape, or rain fiery death upon your enemies from the back of a Dragon!\nConstruct your Dream Castle using hundreds of structural pieces found within a flexible and easy-to-use building editor, or take advantage of the dynamic destruction engine and crush someone else’s. Enhance your fortress with magical structures like defensive shields, attack towers, mana pools and respawn stones. Unlock new fortification materials and building features as you level up: with so many materials and pieces to work with the only limit is your imagination.\nAre you an old, bearded and wise Warlock or are you a young, ambitious and strong-willed Mage? Create your own style with a huge variety of clothing and weapon options. Discover a near limitless variety among these items’ stats with Citadel’s rich and deep loot generation system; every loot pull is different and ensures that fighting monsters and exploring dungeons is a constantly rewarding and memorable experience.\nWhy walk when you can fly? Use your Wizardly prowess to take to the skies. Enjoy the convenience of a custom-crafted broomstick, tame and mount airborne companions like dragons and giant eagles, or use alchemy to concoct potent elixirs allowing flight without the aid of beast or broom.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Virtual Basement","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":44120,"name":"StarCraft: Remastered","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ab/0ab355d5f87d75b009a68ab24f917ee0.jpeg","description":"REDISCOVER A CLASSIC\r\n\r\nStarCraft®: Remastered upgrades the essential sci-fi strategy experience from beginning to end. Welcome back to the original game and its award-winning expansion, StarCraft: Brood War.\r\nWe’ve remastered our units, buildings, and environments, improved game audio, and broadened our supported resolutions. Illustrated interludes bring the struggles and victories of heroes like Artanis, Fenix, Tassadar, Raynor and Kerrigan to life like never before. Most importantly, the strategy gameplay that StarCraft perfected years ago remains unchanged.\r\n\r\nHighlighted Features\r\n\r\nRemastered Graphics\r\nRemastered Dialogue and Audio\r\nBlizzard Friends and Matchmaking\r\nClassic StarCraft Gameplay","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13790,"name":"Aim Hero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/126/126ca0af03ca29650a1c61f9034486e5.jpg","description":"Aim Hero is an ultimate solution for practicing firing accuracy to do better in FPS games.<h3>Features:</h3><ul><li>Mouse sensitivity settings imported from popular games;<br/></li><li>More than 8 training modes, 3 difficulty levels each (We are going to add 5 modes in few weeks);<br/></li><li>Detailed statistics is provided as each training is completed;<br/></li><li>The best scores are saved automatically;</li></ul><h3>Games you may use to set your mouse sensitivity:</h3><ul><li>Counter-Strike: Global Offensive;<br/></li><li>Overwatch;<br/></li><li>PUBG;<br/></li><li>Fortnite;<br/></li><li>Paladins;<br/></li><li>Rainbow Six Siege;<br/></li><li>Quake Champions.</li></ul><br/>We are going to add more games on the list.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ProGames Studio","platforms":[{"id":0,"name":"PC"}]},{"id":11017,"name":"MachineCraft","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55f/55f57d8995b17e2876181dd125466dfb.jpg","description":"OVERVIEWThe main purpose of this game is showing and watching machines made out of blocks.\nSome of the game-modes allow you to battle or race against other players. (testing phase)\nYou can create your original machine with ease by reassembling those machines that are distributed,\nor by using the automatic control block.CRAFTBy using plastic chassis and functional parts, you can make a variety of shapes and movements,\nsuch as standard machines(cars, bikes, tanks, airplanes, helicopters, ships), as well as\nunique machines (transformation-robots, arm-cranes, animals, plants, meals).\nAdditionally, you can place boxes of any size to make a simple stage.MULTIPLAYYou have the freedom to make a room and set the rules as you want, and maximum of 30 people can join.\nCurrently lounging around is the mainstream, but I am aiming at enhanced competition in the future.\nMy goal is to make this game into a place where people can feel free to make their room in their own rules without serious conflict.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"G2CREW","platforms":[{"id":0,"name":"PC"}]},{"id":10101,"name":"Micro Machines World Series","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86e/86e1cb8e8dce87981e53e6ec3a88ebb7.jpg","description":"The legend is back! Micro Machines World Series combines the thrilling madness of racing micro vehicles with epic team battle strategies, set against the extraordinary interactive backdrops of the everyday home! Grab your NERF blaster, try to avoid the jam, and unleash miniature multiplayer mayhem onto the world!\nLEGENDARY LOCATIONS: Featuring the iconic kitchen and pool table tracks amongst others, plus all-new locations and arenas such as the garden and workshop, Micro Machines World Series features 10 Race Tracks and 15 Battle Arenas!\nCOOL INTERACTIVE PLAY-SETS: Teleporters, catapults, giant fans, etc add even more fun and will ensure no two races are the same!\nCUSTOMISABLE VEHICLE CAST: An array of amazing miniature vehicles, each with its own unique load-out of weapons and abilities plus a massive range of customization options!\nOFFICIAL HASBRO LICENSES: Featuring NERF, G.I. JOE, HUNGRY HUNGRY HIPPOS and OUIJA\nCLASSIC MINIATURE RACING: Micro Machines racing for the purists, including Elimination mode! Huge variety of weapons, interactive tracks, unique skins, and gravestamps to earn!\nALL-NEW BATTLE MODES: Up to 12 players in huge arenas, multiple modes that proves that a single takedown is just as satisfying as winning a race!\nTEAM-PLAY: Game-changing synergies as you join together to take on the rest!\nONLINE & OFFLINE MULTIPLAYER: Featuring leaderboards, regular challenges/competitions, seasons, playlists, multiple divisons, etc!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]}]