[{"id":58928,"name":"EA SPORTS NHL 19","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47f/47fd327083bfa04edb709632a033dce3.jpg","description":"In NHL® 19, play on outdoor rinks and journey from the ponds to the pros in new and returning game modes. Compete with and against 200 of the greatest hockey legends to ever hit the ice, including Wayne Gretzky. Powered by cutting-edge new gameplay technology, experience explosive-edge skating that delivers more acceleration, speed and responsiveness.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-4 players\nNetwork Players 2-12 - Full game requires PlayStation®Plus membership to access online multiplayer\n30GB minimum save size\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCONDITIONS AND RESTRICTIONS APPLY. SEE https://www.easports.com/nhl/game-and-offer-disclaimers FOR DETAILS.\nNHL, the NHL Shield and the word mark and image of the Stanley Cup are registered trademarks of the National Hockey League. NHL and NHL team marks are the property of the NHL and its teams. © NHL 2018. All Rights Reserved. Officially Licensed Product of the National Hockey League.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":58819,"name":"Archangel: Hellfire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/125/1259d6aee5d50c3516369cb3ef3f972f.jpg","description":"THE WAR NEEDS YOU! Archangel Hellfire is the unholy union of god-like mech weaponry and infernal team deathmatch gameplay. Pilot massive weapons of destruction, armed to the teeth, and war on post-apocalyptic lands in this free-roaming shooter. Think you have what it takes to battle mech-to-mech and win world domination for your faction in The Great Mech Wars? Enlist and get into a mech today!\nFEATURES:\nBuilding-sized Mechs: Drop into six different state-of-the-art war machines\n13+ Weapon Systems: Rain hellfire in every direction with arm-mounted artillery\nUnique Special Abilities: Singularity Beam, Invisibility Cloak, Death from Above… Use strategically!\n4 Unforgiving Maps: Blast the destructible desert, mountain, farmland, and city into pieces and use the natural features of the landscape to your advantage.\nTactile cockpit controls: Roam free, and fight to win with full control of your mech","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Skydance Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":15527,"name":"Steel Ocean","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/597/59737a14fa46d1812596756a70812b64.jpg","description":"“Steel Ocean” is a free-to-play, MMO shooting game. As a navy commander, you may choose  6 types of warships used in the World War II to fight the 16vs16 battles.  Start the voyage with your warships and fight for the honor of your fleet!\nGame Features:\nEssence of team play: Tactics first\n6 warship types and over 100 famous warships with distinctive features.\nSteel Ocean presents the 6 most representative warships of the modern and contemporary naval system, namely, destroyer, light cruiser, heavy cruiser, battleship, carrier, and particularly the “deep sea killer” – submarine, appearing for the first time.\nIncorporating hundreds of classic tactics, and supporting the original tactic system.\nSteel Ocean also restores hundreds of classic sea battle tactics and sea battle maps. The players may replay the “Wolf pack tactics”, “Competing for T head” and other famous tactics at real time, and independently design the new tactics based on the maps, natural environment, weather conditions, warship combination and other objective factors.\nDiversified competition modes, and team play varying from modes.\nThe actual sea warfare is not merely the exchange of firepower. Steel Ocean provides tens of combat modes, from the MOBA random matching for combat, the battle to seize the isle for testing the team tactics, to the short distance contact battle without isle, combat of small teams in different sizes, and even the super large legion PVP battlefield in the boundless water…, available to meet the different requirements of game players. Each mode includes several sets of applicable tactics and derivative skills, bringing the endless and changeable battlefield experience.\nHighly immersive interactive map to restore World War II scenarios.\nThe development team of Steel Ocean accurately simulates the isles, reefs, buildings, metrological, weather conditions, etc. of many sea areas in the world, based on the results of consulting extensive historic records and many times of site surveys, and the actual geographic environment data.\nSeparated Damage Calculation system to ensure more accurate attack.\nIn addition to the original damage calculation by health bars of the TPS vehicle war games, Steel Ocean is incorporated with the separated damage calculation system (“SDC”).\nCommanded by hundreds of officers of World War II, providing warships with tactic soul.\nSteel Ocean includes the innovative warship commander system, incorporated with hundreds of famous navy generals during the 2nd World War, based on the actual history of the period, to impart the cold warships with the different tactic features.\nUnique legion system to create super marine legions.\nThe fleet guild system provides a big platform for players to communicate on tactics, and also combines the team play and the fleet growth mechanism into one.\nBuilt-in radio voice to effectively restore maritime communication.\nOne of the most critical factors deciding the success or failure of a military operation is intelligence. The information communication at any place and at any time is the basis for the battle with the team collaboration, and the key for realizing the strategic cooperation of multiple warship types in the modern sea battles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ICE Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":13139,"name":"Switchcars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51c/51c6febfaecaba7b1785bca22d329dbb.jpg","description":"Switchcars is a vehicular roguelike arcade set in a broken spacetime. Escape alien beasts through procedural environments, using more than 1,000 vehicles. All you need to do is reach the year 2055. In theory.\nYou are probably not going to make it. Not the first time, not the second, but perhaps the 100th? Every round is different, and you'll get better over time, so crack your knuckles and show those alien beasts who's the master of vehicular arts, the ultimate escaper of Earth, the unintended interdimensional time traveler scientist-man of pure vehiculative efficiency! Or, get struck by a bus and try again.Features:\nNew kind of gameplaySwitch instantly between vehicles in your inventory to move as fast as possible.\n1,000 vehiclesNearly all kinds you can imagine, all driveable, with different behaviors. There's a bit more than a thousand actually, and more is yet to come.\n\nProcedural environmentsForests, streets, ice plains, outer space, train yards, minefields - Around 100 unlockable types of terrain, diverse traffic to dodge, as well as more than 150 static scenery objects.\nTime travelThe playable years are 1950 to 2055. The point in time dictates available vehicles and environments, but also difficulty. Can you make it to the end and get an interstellar spaceship, the ultimate vehicle?\nVehicle upgradesRocket-propelled motorcycle with caterpillar tracks and machine guns? Yes! There are 40 powerups that can be used on any vehicle, altering their performance and appearance.\nContent browserBrowse vehicles, lanes or powerups you've unlocked. See how many you haven't seen yet.\nImmensely replayableDue to agile gameplay and procedural nature of the game, the rounds are always different, relatively short and unpredictable - in classic action roguelike manner.\n\nHigh fidelityCrunchy crashes, distinctive and colorful pixel art, highly detailed sound and original adaptive music.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Altfuture","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10644,"name":"Dark Fall 2: Lights Out","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b5/2b57095a370984e561c9bde2ddc07552.jpg","description":"Three men once manned the lighthouse on Fetch Rock, but they vanished without trace on New Year, 1900. No-one knows what really happened to those three poor souls, and no-one is brave enough to stay in the lighthouse, alone, after dark. Except you...travel to Fetch Rock Island, and discover what really happened...\nUse supernatural investigative techniques and realistic ghost hunting gadgets to reveal the evil presence that threatens Fetch Rock. Together you must defeat the evil that hides in the mist and uncover the mystery of Lights Out.\nThe game is best played in a dark room with your speakers turned up. Unless you're scared, of course.The StoryMany lives have been lost on the lethal rocks surrounding the harbour town of Trewarthan. Mysteriously, a thick fog covers the land and the silence is shattered by the sound of ghastly foghorn. Suddenly, the faithful light of Fetch Rock Lighthouse is plunged into darkness.\n‘Fetch’ is the old English word for ‘ghost’; The old lighthouse is built upon something ancient and terrible, causing manifestations, time distortions and unexplainable paranormal events. Only by jumping through time, from the ancient Bronze Age to a futuristic research base, will you be able to uncover what is really happening on fetch Rock. Was your arrival upon the Island, that foggy night, really coincidence, or is someone, or something calling to you, across time.Key FeaturesIncludes Dark Fall 2: Lights Out Director's cut version\nExplore the historic Lighthouse in four different eras.\nDiscover what happened to the Lighthouse Keepers, that foggy night.\nCommunicate with the dead to solve puzzles and mysteries.\nA spooky tale by Jonathan Boakes, author of The Lost Crown.\nDelve into a non-linear story, based upon a real event.\nUse Time Portals to jump through time, exploring the past and future.\nExperience the life and times of a Victorian Lighthouse.\nRealistic world to explore, based on a real location.\nFull audio experience and spooky soundtrack.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Darkling Room","platforms":[{"id":0,"name":"PC"}]},{"id":3856,"name":"Ratchet & Clank: Into the Nexus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa4/aa4733f9a852ad2e3f056f152f186a0d.jpg","description":"After one of the most infamous manhunts in galactic history results in the capture of Vendra Prog, Ratchet and Clank offer to escort the dangerous criminal to the Vartax Detention Center. After a daring orbital jailbreak at the forgotten edge of the galaxy, Ratchet and Clank find themselves lost in an abandoned sector. There, in deepest space, they uncover an inter-dimensional event that threatens the universe—and forces Ratchet to decide what’s really important. Features: A return to the Future – Series protagonists, Ratchet and Clank, return along with Captain Qwark, Talwyn, Cronk and Zephyr in a brand-new, story-driven single-player adventure. Even more crazy weapons and gadgets for your arsenal– Arm yourself with a variety of exotic new weapons and gadgets, including the Winterizer and Nether Blades. Clank strikes back – All-new gameplay offers inter-dimensional challenges where Clank can alter gravity, manipulate objects and solve mind-bending platforming puzzles. Discover new worlds… and the dangers of space – Traverse through the zero-gravity of space and explore a mysterious sector filled with new planets to explore along with hidden dangers and dark secrets yet to be uncovered. Includes entitlement for the Full Digital version of Ratchet & Clank Future: Quest for Booty™.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©2013 Sony Computer Entertainment America LLC. Ratchet and Clank: Into the Nexus and Greatness Awaits are trademarks of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":962676,"name":"Persona 3 Reload","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/29a/29a78d7b6be61673c910d588bf188e2c.jpg","description":"Step into the shoes of a transfer student thrust into an unexpected fate when entering the hour \"hidden\" between one day and the next. Awaken an incredible power and chase the mysteries of the Dark Hour, fight for your friends, and leave a mark on their memories forever.\n\nPersona 3 Reload is a captivating reimagining of the genre-defining RPG, reborn for the modern era.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Atlus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":301514,"name":"Solar Ash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e84/e844fe6d2f7182096b1e9f214e511ca6.jpg","description":"Solar Ash Kingdom is the second game from Heart Machine, the creators of the award winning 2016 game Hyper Light Drifter.\n\nJourney through a surreal, vivid and highly stylized world filled with mystery, wild high-speed traversal, endearing characters, and massive enemy encounters.\n\nThe Void beckons...","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Heart Machine","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":288559,"name":"Blood & Truth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28d/28d239c526c178a04ec8740793e2cf63.jpg","description":"Put on your PlayStation VR headset and ready yourself for hard-hitting action in the gritty and glamorous London underworld. You are elite Special Forces soldier Ryan Marks, on a desperate mission to save his family from a ruthless criminal overlord.\r\n\r\nGrab your PS Move motion controllers and blast anyone in your way as you go face to face with enemies, uncover secrets and experience the thrill of the chase in a high-octane action narrative inspired by PlayStation VR Worlds’ ‘The London Heist’ experience.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SCEE London Studio","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":53803,"name":"Duck Hunt (1984)","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d6/6d64669142fd714483c54bd37c79bc33.jpg","description":"Duck Hunt (Japanese: ダックハント, Hepburn: Dakku Hanto) is a light gun shooter video game developed and published by Nintendo for the Nintendo Entertainment System (NES) video game console. First released in Japan on April 21, 1984, it was later released on October 18, 1985 in North America as a launch game for the NES, and on August 15, 1987 in Europe. The game was released as a Virtual Console title for the Wii U in 2014.\nIn Duck Hunt, players use the NES Zapper to shoot ducks that appear on the television screen. The ducks appear one or two at a time, and the player is given three shots to shoot them down. The player receives points upon shooting each duck. If the player shoots the required number of ducks in a single round, the player will advance to the next round; otherwise, the player will receive a game over.\nThe game initially received few reviews, but was given mild critical praise and elicited a positive gamer reaction. Prior to the NES version, Nintendo also made a Duck Hunt game based on Laser Clay Shooting System released in 1976. It was later a pack-in game, paired with Super Mario Bros.; the pack later also included World Class Track Meet.","review":"","timePlayed":0.0,"releaseYear":1984,"developer":"Nintendo","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Wii U"}]},{"id":31341,"name":"Command & Conquer: Generals","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b8f/b8fc70ec8d35ae13f9609e1b118aa33c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Electronic Arts Pacific","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22409,"name":"Postmortem: One Must Die (Extended Cut)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5f/e5f0f8894a446f2558fcfed545b38caa.jpg","description":"Narrative-adventure playing an Agent of Death who must take ONE life that could change the fate of a conflict-torn Nation!\nThink The Walking Dead meets Home and The Last Express, with a dash of To The Moon!\nFreeform exploration with Rich dialogue\nWhat might you learn searching the fundraising Gala and talking to patrons? Perhaps the less you know the better?\nMeaningful choices and Unintended Consequences\nCan your choice change the fate of a Nation? What other result could your meddling have?\nCast of ambitious and influential characters\nWhat if they die? More importantly... what if they live?\nComplex setting of violent domestic conflict and industrial revolution\nA devastated country - but is it your place to fix it? What if your educated guess is wrong?\nDynamic and surprising Ending\nThe choice is *entirely* up to you - but what other factors may be affecting the outcome?\nOnline Stats to compare Your Choices with\nAnonymous aggregate stats of everyone's playthroughs will let you see how your own choices compare! Are you one of the good guys?Free VersionThe basic game, without the extra character and bonus materials, is also available for free from our Official Website!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":19871,"name":"Explodemon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1bb/1bbe80684789d442c5db32d81275c6ed.jpg","description":"Explodemon combines the retro style of 16-bit platform games and Japanese action titles with the upgradable skills, hidden collectables and clever puzzles from more modern titles. Players use Explodemon's self-destructive nature to combat enemies and fly through the air, all the while solving a huge variety of physics-based puzzles.\nWith twelve huge levels, full keyboard and controller support, upgradable skills and a full set of achievements and collectables to discover, Explodemon captures the essence and nostalgic feel instantly recognisable from SNES-era platformers with the depth and variety of more recent indie platform titles.Features:\n• Explore 12 gigantic levels of intense platforming action set across three diverse worlds\n• Adapt to a constantly changing gameplay experience with new skills and hazards aplenty!\n• Evolve Explodemon into your own personal destruction machine with upgradable skills\n• Countless collectables and 20 achievements add a modern depth to the retro style\n• Enjoy a comic story told with suitable aplomb and panache!\n• Full controller support","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Curve Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":19629,"name":"Strike Vector","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a2/4a221fd88269e46fe15c816bee3f3f1c.jpg","description":"\"Strike Vector is gorgeous shooter with strong mechanics and lots of customisation\"\n7.7/10 – IGN\n\"it more than makes up for by being a gorgeous, intensely competitive experience that matches its aesthetic appeal with pure shooter satisfaction\"\n– 7.5/10 –destructoid\n\"Strike Vector does one thing - frantic multiplayer combat action - and does it really well\" Luke Plunkett\n– Kotaku\n\"I do, however, know one thing for sure: Strike Vector The Videogame is unarguably stunning\" Nathan Grayson\n– Rockpapershotgun\n“Strike Vector est la petite bombe indépendante sans prétention que l’on ne voyait pas venir”\n17/20 – jeuxvideo.com\n“BELLISSIMO, Strike Vector è uno sparatutto indipendente adrenalinico, appagante e assolutamente spaziale. In tutti i sensi”\n9.2/10 – IGN.it\n\"Amateur de sensations fortes, à vos souris. Si vous cherchiez du Quake en altitude, de l'instagib en vaisseau spatial, le titre qu'il vous faut est enfin dispo : ça s'appelle Strike Vector et c'est pour les joueurs hardcore dont l'estomac est bien accroché\"\n4/5 – gameblog.fr\nStrike Vector is a Brutal aerial FPS that will see you test your skills online against other players in the tradition of Quake 3 and Unreal Tournament. The game offers an hardcore learning curve for those who don't fear to die a lot at first but who will get a massive rewarding feeling when they will master the game and dominate the battlefield.all New Features Will Be FreeRagequit Corporation will offer free downloadable content after the game release. We want to make sure that every person playing Strike Vector have access to the same content regardless of when they will get the game.gameplayWith a distinct old school feel, reminiscent to games such as Crimson Skies, Quake 3 and Unreal Tournament, Strike Vector will let you test your reflexes and skills against your friends. Team flight and mutual assistance is required to fulfill your missions but individual aiming and piloting skills are also mandatory.two Movement ModesYou fly the Vector, the lastest hyper-speed VTOL, highly customizable and manoeuvrable Jet fighter. Your enhanced version can instantly switch between 2 movement modes :\nJet Mode: reach high-speed, intercept opponents and fast evade incoming projectiles.\nStationary Mode: strafe in all directions with increased precision, hold and defend key locations.\nThis unique gameplay allow you to fight face to face with your enemies like classical FPS, or playing dog fighting.game ModesTargets to reach, positions to defend, enemy structures to destroy … Players may select among famous game modes such as deathmatch, team domination, team deathmatch, and Bounty Hunter! More game modes are coming soon!build Your Own vectorEquip your Vector in your own style with two differents weapons to get the edge on various situations or be a specialist by choosing the same weapon for each side of the craft. Hundreds of combinations are available, making your ship the only kind of his genre on the battlefield.\nDepending on your weapons and perks choice, your playstyle will be different from another player, you create your own class :\nFast and stealthy to capture positions and hide in massive structure to surprise your enemies.\nHeavy and powerful to defend strategic points or assault enemies defenses.\nCustomize your ship appearance among various type of skin decorations and put a gadget in your cockpit to make you feel like you are at home. A mach 3 home!varied EnvironmentsYou will play through gigantic flying structure like aerial oil platforms, slums, cities, factories, abandonned stations and much more and find many destructible objects like giant cargos or pressure vessels and use them to trap players in deadly explosions, block or open passages and fulfill your mission objectives.\nUse your environment to avoid and escape homing missiles by adopting a risky flying style. Play the way you want with various game mode adapted for a 360° warfare\nEliminate every players in classic deathmatch, support your team in domination or the greedier and more...\nSTRIKE VECTOR FORUM : http://www.strikevector.net/forum/\nSTRIKE VECTOR OST : http://themaravers.bandcamp.com/","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ragequit","platforms":[{"id":0,"name":"PC"}]},{"id":18160,"name":"One More Dungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85e/85ed85931fd6e69765b312f801faf69c.jpg","description":"One More Dungeon is a first person shooter roguelike with procedurally generated levels and pixel-art graphics. Being a nameless adventure seeker, you have to get to the final level of the dungeon and destroy the obelisks, which is being used by forces of Evil to invade the world. Use a melee weapon, magic staffs, and antique artefacts, to burst way through the hordes of enemies inhabiting a few game areas.\nKey features:\nFusion of old school FPS and Roguelike games.\nProcedurally generated levels.\nPermadeath\n30+ types of enemies and 80+ items.\nParallel universe with manually created locations.\nSanity level, reduced by using of artefacts.\nSet of mutators, selected before the game started and modifying the gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9468,"name":"It's Spring Again","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2df/2df5ff42da4895d3f5118288d011ef89.jpg","description":"\"It's Spring Again\" - an educational game for children ages two and up. It uses game mechanics to teach children about the seasons.\nThis game intended to develop associational and logical thinking. By following the hints, children help the seasons change. They learn the order of the seasons and create a melody for each of them with a little help from their parents and the narrator.\n\"It’s Spring Again\" is based on a successful puppet show for children ages 2 to 5, in which puppets controlled by actors showed children audience the magic of change of seasons.\nThe game enriches the show by allowing children to directly interact with the story.\nThe voice actor of the game’s narrator is a wonderful actress and a musician Ekaterina Efremova. She lives in Murmanks (Russia) her whole life, performing for children and adults at puppet theaters, singing songs to a guitar and other instruments. She cooperates with musicians working in different genres, loves improvisation and is never afraid of experimenting in her art.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sometimes You","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":5545,"name":"Disney Infinity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ae/7ae75478ca3658633b85780e05ab2c56.jpg","description":"Play with some of your favorite Disney and Disney/Pixar worlds like never before! Experience adventures in the worlds of Pirates of the Caribbean, The Incredibles, and Monsters University. Battle enemies, solve puzzles, overcome obstacles and complete a variety of other unique quests.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Avalanche Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"}]},{"id":4628,"name":"Mortal Kombat Arcade Kollection","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ee/2ee5fe3d7fd4056b5600d803781dbc34.jpg","description":"The Original Arcade Trilogy together for the first time in a single package, just the way you remember it. Mortal Kombat, Mortal Kombat II and Ultimate Mortal Kombat 3 enhanced with online play, leaderboards, and trophies. Maybe you were king of the arcade, but how do you stack up against the whole world?\nMORTAL KOMBAT: ARCADE KOLLECTION SOFTWARE © 2011 WARNER BROS. ENTERTAINMENT INC. DEVELOPED BY OTHER OCEAN. ALL OTHER TRADEMARKS AND COPYRIGHTS ARE THE PROPERTY OF THEIR RESPECTIVE OWNERS. ALL RIGHTS RESERVED.\nMORTAL KOMBAT: ARCADE KOLLECTION, MORTAL KOMBAT, THE DRAGON LOGO, AND ALL RELATED CHARACTERS AND ELEMENTS ARE TRADEMARKS OF AND © WARNER BROS. ENTERTAINMENT INC.\nWB GAMES LOGO, WB SHIELD: ™ & © WARNER BROS. ENTERTAINMENT INC.\n(S11)\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":1454,"name":"Madden NFL 17","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e11/e11c5c049bbb63a19789a28755c667bf.jpg","description":"Take your team all the way in Madden NFL 17 and put yourself at the center of your team’s Championship run in Franchise mode, delivering new ways to play and more decisions to make. Arm your team for gridiron glory on both sides of the ball with innovative ball carrier feedback cues, defender fake out mechanics and a new, authentic defensive AI system. Experience the most dynamic gameplay analysis with unprecedented depth throughout the NFL season with the all-new, in-studio Madden NFL commentary team featuring Brandon Gaudin and Charles Davis. Driven by the most balanced gameplay yet, the deepest commentary in Madden NFL franchise history, along with fun and fresh ways to play modes such as Ultimate Team™ and Draft Champions, Madden NFL 17 is the most complete Madden…ever.\nLearn more about Madden NFL 17 at easports.com/madden-nfl.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-2\n24GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCONDITIONS AND RESTRICTIONS APPLY. SEE https://www.easports.com/madden-nfl/game-disclaimers FOR DETAILS.\n© 2016 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc.\nThe mark 'John Madden' and the name, likeness and other attributes of John Madden reproduced on this product are trademarks or other intellectual property of Red Bear, Inc. or John Madden, are subject to license to Electronic Arts Inc., and may not be otherwise used in whole or in part without the prior written consent of Red Bear or John Madden. All rights reserved.\nOfficially Licensed Product of NFL PLAYERS INC. and NFLPLAYERS.COM","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":491512,"name":"Idle Slayer","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/026/02659d9b66b1a8bdebecc92ef5093600.jpg","description":"You are a monster slayer trying to keep your people safe from the darkness. They pay you to deal with them and they will pay you even more if you look good.\nStart from nothing, jump to get a few coins and upgrade your gear! Now you gain much more than before, which you can use it to upgrade your gear even more!\nThe game focuses on giving you a light start with simple mechanics but it slowly starts adding new gameplay styles, mechanics and features.Features +300 In-game Achievements which rewards the player.\nAscension System with big Skill Tree.\nRetro Pixel Art theme.\n6 Zones/Maps with different enemies.\nQuest System.\nOffline Progress.\nRandom Events.\nProcedural Map.\nDecisions are important because they can slow down or speed up your gameplay. You will have to choose wisely. Or not. Maybe not being wisely is the wisest.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Pablo Leban","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":455580,"name":"Anno: Mutationem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b1d/b1d0b2d6b4cbc94d8c2066353367d13e.jpg","description":"Welcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements you become Ann: a highly-skilled combat-trained lone wolf on a personal mission in the giant Metropolis, full of sinister mega-corporations, mysterious fringe groups and creatures more bizarre than words can express.\n> This is a world full of surprises waiting for you to find out! While going through the main story you can chat with a Cyborg corgi, take on a part-time bartender job, hunt down vicious criminals reveal the true face of a trending V-streamer! By exploring diverse locations such as neon Noctis Town, an off-shore cargo ship and huge underground structures, players are free to go as they please and act as they want.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Thinking Stars","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":455579,"name":"Operation: Tango","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d40/d40a1ce414000d1d1f47800ffe70fb0a.jpg","description":"Operation: Tango is an espionage-themed cooperative adventure challenging you and a friend to complete dangerous missions across the globe in a high-tech near-future world.\n\nAs an exclusive team of two, you and your partner will become AGENT and HACKER, working together to infiltrate, investigate, and eradicate the forces threatening the free world. Work in tandem from two different points of view with only your voice to link you. Teamwork is crucial, and communication is key!\n\nNOTE: Operation: Tango requires both players to have access to a working PC-compatible microphone.\n\nSuperior Teamwork\nBe observant, keep talking, and make sure nothing explodes. Combine complementary skill-sets to overcome intense challenges against \"impossible\" odds.\nAuthentic Espionage\nExotic locations filled with thrilling scenarios create classic “Hollywood” spy moments. Experience the ultimate secret agent fantasy!\nTechnological Toys\nEnjoy the visual splendor and technological advances of a fully-connected augmented world.\nInnovative Brainteasers\nOvercome obstacles in ways you’ve never dreamed. Each mission features unique challenges, keeping you and your partner on your toes while delivering some of the most satisfying \"eureka!\" moments in modern gaming.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Clever-Plays","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":428178,"name":"Windbound","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dbc/dbc51edb2ebf3f36860b26a5a0f8a852.jpg","description":"The Forbidden Islands are Calling!\nUnlock their Secrets!\nShipwrecked alone on an uncharted island, explore, adapt and navigate the land and perilous seas to stay alive.\nAs Kara, you are a warrior, caught at sea in a fierce storm, adrift from your tribe. Thrown from your boat, at the mercy of the turbulent waters, you are tossed on to the shores of the Forbidden Islands, a mysterious paradise.\nWith no boat, no food or tools, just the will and skill to survive, uncover this beautiful island’s rich resources. Craft tools and weapons to hunt and defend yourself against nature itself with its wild and fantastical creatures.\nWhilst exploring further islands and the scattered ruins across their lands, secrets of the past and glimpses of the future are revealed. Unravel the mystery behind them all and you may find more than just your way home.Uncover the Secrets WithinEmbark on a personal journey and discover the history of the idyllic Forbidden Islands; each holding the key to a mystery and unexpected revelations.Explore As Far As The Eye Can See  Head towards the horizon, advancing across the islands, each with their own diverse wildlife, landscapes and challenges to face.Live Off The LandScavenge the islands’ untamed terrain for resources that you can use to craft a full range of tools and weapons to hunt wildlife and upgrade your boat. You must set sail when resources become scarce.Build Your Perfect SeacraftYour boat is your key companion on this journey, carefully craft your own custom sailing vessel to take on the treacherous waters, traversing from one island to the next. Design your boat to battle tempestuous winds, monstrous waves, and deadly sea creatures.\"","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"5 Lives Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":370216,"name":"Football Manager 2020 Touch","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c6/3c6f8107d61130a3d058d86874dd6416.jpg","description":"In Football Manager 2020 Touch you’ll speed through the seasons, skipping the pre-match proceedings and media circus to focus your attention on the core elements; squad building, tactics and Match Day.\nEven Match Days can be fast-tracked with an ‘Instant Result’ feature that accelerates your climb up the table, leaving you plenty of time to tinker and tweak in-between.\nWhilst you’re trading depth for speed, you won’t lose any detail, as Touch packs the full power of Football Manager’s world-renowned database which has:\n-\t50 playable nations\n-\t130 of the top leagues\n-\t2,500+ manageable clubs\n-\t500,000+ fully modelled players and staff\nThe wonderkids are all there – you just don’t have to wait as long to see them reach their potential.\nLicensing updates along with new features and game upgrades will drop at the end of October on our social channels, so get following now to get ahead of the game.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sports Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":288635,"name":"Joy Ride Turbo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a5a/a5ad5483cf65892ed5aeb090f30aa7ab.jpg","description":"From the Kinect Joy Ride creators comes Joy Ride Turbo, a controller-based arcade racer delivering precision handling and crazy stunts with more thrills, speed, & mayhem! In the new Stunt Park, you’re free to show off! There’s no limit to the whacky tour de force you achieve with friends. It’s a vibrant playground for your car - jump off cliffs, shoot from a cannon, & more. Plus, explore and find collectibles that unlock cars – giving you an edge for faster races and death-defying tricks. Race new tracks, old favorites and 3 modes of play: Battle Race, Pro Race & Time Trial. Challenge family & friends to local 4-player split-screen or race up to 8 on Xbox LIVE. With Joy Ride Turbo, everyone’s in the driver’s seat in this madcap kart racer.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":50971,"name":"Pokémon Crystal Version","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5a/a5a6c58932269cf51d99c6257b82778f.jpg","description":"Originally released for the Game Boy™ Color system in 2000, the Pokémon™\nCrystal game added several new features to the Pokémon franchise.\nFor the first time, players could choose a female or male character,\nPokémon battles featured animation, and more. And now, this Virtual\nConsole release invites you to explore the Johto region again—or for the\nfirst time.\n\nExperience an adventure through Johto based on the Pokémon\nGold and Pokémon\nSilver games, but with updated features and added story\nelements specific to the Pokémon Crystal game.\n\nGet the chance to encounter the Mythical Pokémon Celebi in an event\nafter completing the main adventure.\n\nMeet the mysterious character Eusine and find out how he’s linked to\nthe Legendary Pokémon Suicune.\n\nBattle and trade with friends using local wireless.*\n\nWith the paid service Pokémon\nBank, you’ll be able to bring Pokémon you have caught in this\nversion of Pokémon Crystal into the Pokémon\nSun, Pokémon\nMoon, Pokémon\nUltra Sun, and Pokémon\nUltra Moon games!\n\nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy Color"}]},{"id":42288,"name":"Metal Gear Solid: Peace Walker HD Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/656/65637b0e1920bcb6664548de649bbe78.png","description":"The Games on Demand version supports  English, French, Spanish.  1974 The Peace Walker Incident The era is the 1970s.  Big Boss has stationed his \"Army without a Nation\" in Colombia, South America, where he is approached by visitors from Costa Rica-- \"a Nation without a Military.\"   In the wake of the Cuban Missile Crisis, Latin America became key to maintaining the power balance between East and West.  But now, a mysterious armed force threatens to disrupt this balance.  To preserve peace and neutrality in Costa Rica, the \"Soldiers without Borders\" move into action.  In time, they would come to be known as the founders of \"Outer Heaven.\"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":38945,"name":"StarCraft II: Heart of the Swarm","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/775/7759b78ea6074f2b103ab6755d47199d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22629,"name":"Metin2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b7/3b76c82b267a38490d07560609ae926a.jpg","description":"YOUR SWORD FOR THE DRAGON GODThe appearance of the Metin stones has torn deep rifts through the once flourishing world of the Dragon God. War has erupted between the kingdoms – wild animals have transformed into fearsome beasts and the dead have arisen to bloodthirsty, demonic life.\nDefend your kingdom and hurl yourself into incredible battles full of action and magic. Raise your weapons against the forces of evil and become a living legend in one of Europe’s biggest MMORPGs!SHARPEN YOUR BLADE AND MIND Experience epic PvE adventures and merciless PvP duels\nFight through maps and dungeons against dragons and sinister demon lords\nCharge into fast-paced battles – even against entire hordes of enemies\nBecome a mighty warrior and increase your character’s level right up to 120CHOOSE YOUR PATH AND FORGE ALLIANCES Choose from five character classes – Warriors, Ninjas, Shamans, Suras and Lycans\nChoose your kingdom: Shinsoo, Chunjo or Jinno\nFound a guild with friends and build on your lands\nFight on lightning-fast mounts and tame cool pets\nContinually improve your weapons and equipment through a selection of crafting systems\nTake part in regular seasonal and community events","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Webzen","platforms":[{"id":0,"name":"PC"}]},{"id":18555,"name":"Planetbase","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/617/617a8ba98a12763772ad6abac8deb57a.jpg","description":"Planetbase is a strategy game where you guide a group of space settlers trying to establish an outpost on a remote planet.\nIn the game you play the role of the base architect and manager, telling your colonists where to build the structures they will need to survive. You will have to ensure that they have a constant supply of oxygen, food and water to stay alive.\nYou will get them to collect energy, extract water, mine metal, grow food, manufacture bots, and build a fully self-sufficient base in a harsh environment, where you are always one step away from total failure.\nEven if the game is not intended to be a simulator, all the mechanics are plausible, and based on what the expected challenges of establishing a colony in an new planet would be.Features:\nFour different planets with different conditions and increasing difficulty.\nHarness solar and wind energy (if available) in order to power the base's structures.\nGrow hydroponic Vegetables and synthesize Vitromeat to feed your population.\nMine and produce raw resources, process them, manufacture goods, and establish a production chain.\nCarefully manage the colonist immigration flow to ensure you have the people with the right skills.\nSurvive disasters like meteors, sandstorms or solar flares and defend your base from intruders.\nMechanize your base by creating your own bots that will help with the more arduous tasks.\nGrow your colony from a few initial pioneers to a vibrant planetbase with hundreds of colonists.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Madruga Works","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":18230,"name":"Dementium II HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a18/a1876fd3f46f2dfe7015a036070313a1.jpg","description":"Happy Horrordays from Bright Dawn!\nNeed a last minute gift or looking for that special present for yourself? Look no further!\nDementium II HD Trading Cards - Available Now!\nAbout the GameThe visage of doctors and patients alike fade in and out of these nightmarish visions of tortured memories.  This eggshell reality is fractured by experiments conducted in the ward.  Blood, flesh and screams surround as you put together the pieces of your story and make your escape from the Bright Dawn Treatment Center while the dark doctor watches on in amusement.  You are William Redmoor and your life is about to become a living hell.\nDementium II HD is the resurrection of the award winning handheld cult favorite rebuilt with all the classic gameplay while providing updated visuals, lighting and refined controls.  Same Bones. New Flesh.\nClassic gameplay that balances the Action, Story and Puzzle elements into an unforgettable horror experience.\nFight through unique enemies that require different strategies to defeat the nightmares, or to simply survive\nTwisted storyline that keeps you guessing throughout the entire game.\nMultifunctional weapons that take out the enemies and grant access to new areas.\nNew ghostly creatures haunt Pelf Village that will chill you to the bone.\nSteam achievements, Cloud Save and Controller support","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Memetic Games","platforms":[{"id":0,"name":"PC"}]},{"id":861285,"name":"Soulstone Survivors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ad/1ad3a512cde30760eec0eed0b74dbe09.jpg","description":"Soulstone Survivors is an action roguelite where you slay hordes of foes and face titanic bosses while learning powerful skills to enhance your character. Play as a Void Hunter, and with the spoils of every match craft weapons, unlock new characters, upgrade your skill tree and equip new runes, all in your quest for godlike powers.\nEasy to play, hard to master\nWith deep RPG mechanics intertwined with Roguelite elements, Soulstone Survivors offers a condensed, yet deep Action RPG experience:\nExplore almost 150 unique Active Skills (and growing!);\nUnlock and play with 14 Characters, with many more to come;\nExperiment with hundreds of Passive Skills and Runes to customize your characters;\nProgress through the Skill Tree with your Soulstones;\nFace and defeat powerful Bosses;\nChoose Curses that increase your challenge in interesting ways;\nOvercome extreme challenges to craft legendary weapons;\nComplete dozens of achievements and unlock new powers;\nDevelopment Roadmap\nWe have prepared the roadmap below which outlines what to expect as the game evolves:\n\n\nWill new content only be added to the full release?\nNo! The Early Access version starts with the values outlined in the roadmap above but will quickly evolve with constant updates until one day we are ready to flip the switch. With Early Access, you will get access to all updates and future content as they are developed and added to the game.\n\n\nIs that all that is coming to the game?\nNo! For us, Early Access is the perfect tool to help us develop the game with our community. We work quickly and you can expect very frequent updates until at least all the promised goals are met, however, we have tons of other ideas to explore with the game.\n\n\nCan I help, send feedback, and be a part of the process?\nAbsolutely! We have very close communication with the community. We read and listen to feedback in all channels we can. We run weekly competitions in our Discord for new content to add to the game and credit the authors, we read everything from Steam Forums to YouTube videos to Twitter messages to e-mails and everything in between, before we decide on next steps.\n\n\n\nWe are a tiny team that chose to stay independent and continue developing a game we love and would like to thank you very much for your attention and interest, and to all our existing community for all the help so far, we wouldn't be here without you!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Game Smithing","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":421699,"name":"Coloring Game 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbb/fbb2900bfc74ef2ba67f1e02f834c25b.jpg","description":"Coloring Game 3https://store.steampowered.com/app/1275640/Coloring_Game_3/\nAbout the GameColoring Game 2 is a sequel of the existing color-by-number game which so many users have liked. The sequel features new options and images.\nThe Fill tool provides new opportunities for coloring images.\nThe progress indicator has been added.\nBesides, we have introduced the option of changing pixel borders.\nAfter the release of the sequel all games in the Coloring Game series will be updated to the 2.0 version.\nThe full completion of the game doesn’t require purchasing the DLC. No DLCs with new levels are going to be released for the Coloring Game 2.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"}]},{"id":53180,"name":"Castlevania: Aria of Sorrow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fc/0fc9e7cce8ddb4225cfee49b1f928601.jpg","description":"Castlevania: Aria of Sorrow is a side-scrolling platforming video game developed and published by Konami for the Game Boy Advance. It is the third and final installment of the Castlevania series on the Game Boy Advance and was released in North America on May 6, 2003 and in Japan on May 8, 2003. Producer Koji Igarashi, who had led the production teams for previous Castlevania titles, led Aria of Sorrow's development as well. Michiru Yamane also returned to compose the music for the game alongside Takashi Yoshida and Soshiro Hokkai. Director Junichi Murakami was new to the Castlevania series.\nAria of Sorrow is set in the year 2035, when Dracula has long been sealed away after a battle in 1999. The plot follows the journey of Soma Cruz, a teenager granted occult power as a result of being a potential vessel of Dracula's reincarnation, as he battles dark figures that wish to inherit the undead lord's power. The game incorporates the same combination of elements from platform games and role-playing video games as in the previous game Castlevania: Symphony of the Night. Aria of Sorrow introduces several new features to the series, such as the \"Tactical Soul\" system and employs a futuristic storyline in contrast to the medieval setting of many other Castlevania games.\nAlthough Aria of Sorrow sold poorly in Japan, selling only 27,000 units nearly one month after its release, it was commercially successful in the United States, with more than 158,000 units sold in the three months following its release. Aria of Sorrow received praise from several video game publications, with some considering it one of the best games in the Castlevania series since Symphony of the Night. Konami released a sequel to Aria of Sorrow, titled Castlevania: Dawn of Sorrow, on August 25, 2005 in Japan. It incorporated many elements from its predecessor, including the \"Tactical Soul\" system. Aria of Sorrow was re-released as part of Konami's \"Konami the Best\" line on November 3, 2005 in Japan, and in a dual pack with Harmony of Dissonance, titled the Castlevania Double Pack, in North America on January 11, 2006.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii U"}]},{"id":37032,"name":"The Whispered World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d5/3d5eca8567a12ec9f45e15318484cd33.jpg","description":"When the fate of the world must be decided, an unlikely hero is born!\nSadwick’s adventure starts as he embarks on a quest to find an explanation to his recurring nightmares. In his dreams, he is chased by a mysterious blue orb as the world around him collapses.\nHis worst fears are confirmed when he consults Shana, the old wise woman. Not only does she prophesize the end of the world, but that Sadwick is the CAUSE of it.\nDefy the prophesy and experience an adventure like no other!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":21637,"name":"URU: Complete Chronicles","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4a/b4ad67a51a0efaf409699f58b96c2cfb_yR6FgHr.jpg","description":"The critically acclaimed adventure of Uru: Ages Beyond Myst returns with this special collection that contains more Uru than ever before. Already the deepest Myst adventure to date, Uru is significantly expanded with the addition of To D'ni™ and The Path of the Shell, expansion packs that will take Uru beyond your imagination.\nUru: Immerse yourself in a story that features the discovery of the lost D'ni civilization. Follow Yeesha, eccentric daughter of Atrus, to discover Lining Books, encounter descendants, and solve puzzles as you adventure through surreal 3D worlds beyond your imagination.\nTo D'ni: The first Uru expansion pack lets the player visit various parts of the D'ni cavern. Myst fans will be astounded by the amount of historical and cultural information included in this expansion, and those new to the greatest adventure game of all time will be driven by the expansion story's major dramatic question: \"What happened to the DRC and its Restoration?\" Through a series of challenges that send the player searching the island of Ae'gura and two D'ni neighborhoods, the player accesses three sections of the D'ni Great Zero.\nThe Path of the Shell: The second Uru expansion pack. The second expansion pack for Uru takes the player on a journey to uncover Yeesha's destiny. In Uru, the player learns about D'ni's past. In Uru: To D'ni, the player learns about D'ni's present - the failed Restoration by the DRC. In Uru: The Path of the Shell, the player learns about D'ni's future.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":19689,"name":"The Club","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58b/58b1f0152c5369da1ea324878c7fc9a1.jpg","description":"The Club™, created by critically acclaimed developer Bizarre Creations, is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, and lethal weapons. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influential elite who place their bets on who will survive as the blood-bath ensues before them. Take control of up to eight uniquely trained killers motivated by greed, driven by pure insane bloodlust, and hell bent on earning respect on a global level.\nRise Through the Ranks of The Club™. As one of eight fighters, blast your way through five single player game modes including: Sprint, Time Attack, Survivor, Siege, and Run the Gauntlet.\nEarn Respect Online. Shoot your way to the top of the leader boards in over eight cut-throat multiplayer modes. You will face-off with 7 real-time opponents online or battle with your friends offline in 4-player action modes.\nThe Club™ is Global. Battle in eight unique real-world locations from around the globe, including war-torn cities, abandoned factories, steel mills and many more.\nExtreme Gun Battles in Hazardous Environments. A motion blur camera system intensifies the adrenaline rush in both open range and close quarter firefights. Destroy and manipulate objects in the environment to your advantage.\nBuild up the highest score. A unique score-based accumulation system creates even more competition among players; the faster, more efficient and accurate that you are, the more points you will earn to unlock weapons, characters and maps.\nSelect from an Arsenal of Weaponry. There are 17 high-powered assault weapons to choose from and customize, including Automatic Weapons, Sniper Rifles, High Caliber Pistols, Sub Machine Guns, Mounted Weapons, and many more.\nEach Character has a Story to Tell. Choose from eight different characters to rise through the ranks of The Club™ and uncover each person's true motives and intentions.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Bizarre Creations","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":17881,"name":"Doorways: Holy Mountains of Flesh","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2e/d2ebb846105fe709bed7b85671a7603d.jpg","description":"General Information\nJuan Torres and his family were the target of an uncountable number of rumors and several disappearances that took place in El Chacal, a small village of around 4,800 inhabitants, located in the arid mountainous region of Salta, a province of Argentina.\nAmong the stories spread around the surrounding villages, legends involving cannibalism, black magic, sects and all kinds of superstitions were heard.\nIt was also said that Juan Torres was the heir of a large fortune and, somehow, with no claim raised against him, he and his family managed to control the entire town and establish their own law.\nThe family was made up of Juan, Celia Torres and his only child, Jeronimo.\n----\nDoorways is an episodic game, it's divided in three parts and they can be played separately:\nDoorways: Prelude (Chapter 1 & 2):\nhttp://store.steampowered.com/app/248470/\nDoorways: The Underworld (Chapter 3):\nhttp://store.steampowered.com/app/311250/\nDoorways: Holy Mountains of Flesh (Chapter 4):\nhttp://store.steampowered.com/app/383930/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Saibot Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17098,"name":"Fibbage XL","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f91/f91b434a5df5ecbe52f86402e20ec775.jpg","description":"NOTE: This game is in English only and is local multiplayer.This is the standalone version of Fibbage XL, which appears in The Jackbox Party Pack.\nIt’s Fibbage XL – the hilarious bluffing party game from The Jackbox Party Pack! Fool your friends with your lies, avoid theirs, and find the (usually outrageous) truth. And get this: your phone or tablet (or keyboard) is your only controller! It’s easy. Just type in your lies to questions like: “The mayor of Rabbit Hash, Kentucky is a _____.” Baby? Rabbit? Ham sandwich? It’s up to you! Fool your opponents into thinking your lie is true and you’ll rack up the points! But be careful, if you pick an opponent’s lie, they’ll be doing a Fibbage fancy dance. For 2-8 players.\nNew features not in existing versions of Fibbage or Fibbage XL:\nFamily-Friendly Filter\nTwitch log-in capability\nMore fun!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jackbox Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9844,"name":"The Underground Man","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c05/c05bd1a05e32180e97d8f10747d310a1.jpg","description":"Moscow: somewhere in the near future. The city and perhaps the Earth's surface has turned into a radioactive ash. Survivors are living a savage lifestyle: they kill each other, they rob each other, they eat and rape each other (sometimes both at the same time). Those who decided that they could not exist in such conditions began to live under the ground. “The underground people” is how they referred to themselves and you are one of them. The times have changed and it is time for you to make your own journey into the big world. The biggest problem is that the people on the surface do not know about your existence. They have heard about “underground people”, but they consider those rumors to be fiction. Your objective is to prove to them that you do indeed exist and that you also possess the ability to adapt to the extreme conditions of the wild radioactive desert. Moreover, you will be responsible for provisioning your fellow brothers and sisters, who are staying underground.\nFeatures of the game include:\n-Enjoyable retro-graphics\n-A post-apocalyptic theme\n-Extremely detailed characters\n-A cozy bar as a location\n-A unique system of character development; you write it yourself and it is applied to your adventures.\n-Mercenary-girls that will help you during your journey\nAnd a lot more.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mehsoft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]