[{"id":16705,"name":"Sugar Cube: Bittersweet Factory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a34/a3401ff8570e8d00196a06aa6153c8ae.jpg","description":"A cube of sugar escapes from factories to avoid the fate of becoming a cookie!\nSugar Cube: Bittersweet Factory is a 2D platformer game that presents the story of a sugar cube. The background tiles of the game have two sides, namely, the front and the back. These tiles can be flipped for access to critical hints to solve different levels. They may or may not help you, so pay attention!\nThe game is the full version of IGF China 2010's winner, Sugar Cube. It includes 5 factory themes containing 90 levels and 2 endings. Also included is the full soundtrack of the game.\nNote: Soundtrack will be located at -> Steam -> Steamapps -> Common -> Sugar Cube Bittersweet Factory -> Soundtrack","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Turtle Cream","platforms":[{"id":0,"name":"PC"}]},{"id":13233,"name":"CubeGun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/724/7240a55e198d936efb3b24b0753375d9.jpg","description":"Design your own Battle Ship and Island\nDesign your own battle ship with weapons,armors,functional devices In a cube based editor.\nWeapon Balance\nEvery weapon has pros and cons,Every weapon is useful in the right position.\nMultiple Battle Strategy\nTo fight with different types of enemy ships,use different battle strategy. Use Energy Shield to block bullets, Use Mortar or Torpedo to break shield,AA-Gun to shoot torpedo,or use armor to protect your deck and charge enemy ship directly.Use thrust to rush to the weak side of enemy ship.Use cannon to push enemy back when they charge toward you.\nNo Role Level\nPlayers are equal in online battle.There is no such thing as a level 99 player kills a level 1 player with a single bullet.It's all about your control of movement and right combination of weapons.\nDesign your own Profession\nAlthough there is no built-in profession as warrior or archer,With different combination of weapons and devices,you can customize the profession of your ship such as:Long range attack/Charge/Tank/Cure/Weapon obstruct.\nSimple combat control\nMovement,Rotation and Critical Skill cast.\nWeapon Merge & Weapon Height\nPut multiple weapons of the same kind in square pattern to merge them into a bigger one,make it more powerful.Raise the deck under a weapon to increase the shooting range.\nEverything is physical and breakable\nEvery part of ship can be destroyed.When you drive your ship to collide the other ship,Decks will be broken and ship will be push back  and rotate.Terrain can be destroyed with weapons too.\nSupport Multi-player battle up to 3V3\nCooperate with your teammates in online battle,Cure your teammate's ship with huge combined Repair Station,Arm with plenty of armors to be the Tank of team and cover your long range attacker teammate,Collide enemy with your ship to stop them from escaping when your teammate is using super skill.Weapons&DevicesMinigun:[/b]High fire rate,high bullet speed,need turn your ship to aim. Energy Shield:Blocks high speed bullets,width 5,length 1,will turn red and lose function temporarily when get overtaken damage.\nTorpedo:Fly pass through Energy shield,only weapon to destroy deck under device.\nAA-Gun:Shoot down all slow bullets as torpedo and mortar ammo,high fire rate,low range,low damage.\nArmor:Protect the deck under it,can take several torpedo attacks,or use to collide with enemy's ship.Armor on a multiple level deck is very hard to destroy.\nMortar:Low fire rate,low bullet speed,long range.Fly pass through Energy shield and armor,destroy target directly,destroy multiple targets nearby with high damage,suitable to attack heavy armor enemy,not suitable to flexible ships.\nThrust:The bigger your ship is,the slower it will be,both in movement and steer,thrust increase ship's move and steer speed.\nCannon:Low fire rate,high bullet speed,push enemy ships back when hit,use it to push enemy back or push them to hill and crash into pieces.\nInterference Robot:Hit target to make them lose function temporarily,can be used to interference weapons/energy shield/repair station/thrust etc.\nRepair Station:Repair device nearby automatically,not include itself.\nLandMine:throw landmines and wait for enemy to trigger.Can be removed by AA-Gun\nMagnite:pull your target closely,very useful when you want to collide your enemy or pull your enemy to the landmine area.\nBoomerang:can be used to attack enemy's back side,return immediately when hit enemy(so very effective in close combat),can't shoot again until the Boomerang fly back.\nDeck Cube:All devices must be on a deck cube,A deck can have several levels,Higher deck gives the weapon on it longer attack range.If all levels of deck are destroyed,the device on it will be destroyed too,So use torpedo to attack the deck or collide it with your ship will destroy enemy's weapons and other devices indirectly.\nEngine:Heart of the ship,more health point than other device,so is the deck under it.If it is destroyed,the ship will crash.\nWeapon balance\nEnergy Shield block high speed bullet\nMissile pass through Energy Shield\nAA-Gun shoot down Missile\nTorpedo break Deck\nArmor withstood Torpedo\nMortar fly over Armor\nStrategy Balance\nHigh fire rate weapons strategy defeats Flexible movement strategy:\nHigh fire rate weapons can shoot flexible target accurately with high speed bullet.\nTank strategy defeats High fire rate weapons strategy:\nEnergy shield and armor can block bullets effectively.\nLow fire rate weapons strategy defeats Tank strategy:\nTake advantage of slow movement and heavy armor ships,use low speed but shield ignore missiles to destroy their line of defense.\nFlexible movement strategy defeats Low fire rate weapons strategy:\nUse flexibility to dodge slow bullets and rush to the weak side of the enemy,shoot/collide and run.\nPoints and Weight Balance\nThe design points of ships are limited.Every strategy of points allocation has pros and cons:\nWeapons and devices need more points.\nDeck Cube need less,the cheap deck can be used to collide enemy ship hull,Higher deck give the weapons longer shoot range and protect devices behind it.\nBut more decks make your ship heavier,penalize you in low move and steer speed.Some weapons are more effective in numbers,such as single mortar has low accuracy,but plenty of mortars shoot at same time make enemy hard to escape.\nSo it's better to allocate points in several kinds of weapons than buy all kinds all devices.Besides,combined weapon is mush more powerful than scattered ones.\nCritical Skill\nThe top most 3 kinds of devices can use Critical Skill in game  by clicking the Critical Skill button.More devices need more cool down time,which are more powerful as well.After you release the critical skill,the weapons will keep in critical model for a short time.Every device has special critical skill.Some weapon increase attack point,some weapon increase fire rate,the thrust increase force,Energy shield refill its energy and increase energy regenerate rate,Armor refill health point and increase defense rate.\nUse critical skill at right time is the key to win a battle,some critical skill can be used together,such as use critical thrust to rush to enemy then use critical armor to collide it.Use both critical thrust and critical cannon to fall back and push the following enemy away.GameplaySingle Game\nWe made a serial of tutorial levels to teach players the pros and cons of every weapon,let you practice designing different kinds of ships to fight against enemies.Challenge epic Boss when you are ready.Some player may like to build their own levels with the built-in level and enemy editor.We plan to publish the whole editor to public in near future then you can upload your home made single play level to our game server and share with others.\nLoot Base\nBuild your military island and loot random player's island with your battle ship.If you defeat them,loot their gold,or leave yours if you die.This game mode need a network to download random island data,but don't need continuous connection as PVP mode,so if you are playing this game mode with your mobile device outside your house where is no WIFI connection,mobile network will be enough.\nOnline Battle\nThis is the best part of the game,Fight other players with your teammate in real time,test your skills you practice in single game,and cooperate with your teammate.You can choose a buit-in map or a player made map.\nWe plan to publish several game mode of online game map\nBattle Map:players vs players death match.\nCooperation Island Map:players vs computer controlled evil island\nCooperation Ship Map:players vs computer controlled evil ships","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"candyrocketstudio","platforms":[{"id":0,"name":"PC"}]},{"id":9030,"name":"Spartans VS Zombies Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b82/b82fa6a6d5ede54a5dfc8557b69e2dc9.jpg","description":"In this tug-of-war, casual defense game， you play Leonidas who is the hero-king of Sparta,  against hordes of attacking zombies in Thermopylae. Recruit allies and build defenses to stop them!\n● Leonidas actually learned magic, very useful, very powerful, very funny.\n● A wide variety of allies to summon including swordsmen, Royal Guards, archers, witches and more.\n● More flexible combination of tactics.\n● Special supply system.\n● 60 waves in classic mode, and after accomplished difficulty will increase.\n● 3 kinds of endless mode, wilder, more fun.\n● Beautiful graphics, epic battle.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Glu","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":4553,"name":"Stuntman: Ignition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c42/c42f29be7d70f949b61d96a09cadf5b3.jpg","description":"Take the wheel and steal the scene as you master the greatest stunt sequences ever filmed.\nDownload Stuntman®: Ignition™ today!\nThis title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionalities such as versus mode may not be available.\n©2007 THQ Inc. Developed by Paradigm Entertainment. Havok™ Software © Copyright 1999-2006 Havok.com Inc. (and its Licensors). All Rights Reserved. See www.havok.com for details. Includes Logitech® Force Feedback Technology. THQ, Stuntman: Ignition, Paradigm Entertainment and their respective logos are trademarks and/or registered trademarks of THQ Inc. All rights reserved. All other trademarks, logos and copyrights are property of their respective owners.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. If you do not wish to accept all of these terms, do not purchase this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":4313,"name":"Malicious","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0d/d0dc23db1e877bcd91aaf39141545871.jpg","description":"Take control of the Spirit Vessel and battle waves of brutal fighters and colossal enemies to rid the world of the evil force of Malicious™. Gain new weapons, build your powers and perform devastating combo attacks as the final showdown between good and evil draws near.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2012 Alvion Inc. Malicious is a trademark of Alvion Inc. Developed by Alvion Inc.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3536,"name":"F1 2014","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ed9/ed9cddf4d5f7b306df9405629ee73dd2.jpg","description":"Feel the power of new turbocharged FORMULA ONE cars in the most accessible FORMULA 1 video game yet. F1 2014 features all the cars, drivers and circuits from the 2014 FIA FORMULA ONE WORLD CHAMPIONSHIP, including new tracks in Russia and Austria, the return of the Hockenheimring in Germany and the 2014 FORMULA 1 GULF AIR BAHRAIN GRAND PRIX which ran at night for the first time in 2014. A new driver evaluation system which tunes the game to your level, shorter career options, refined handling and new Very Easy difficulty level brings FORMULA ONE alive for absolute novices. Experienced gamers can customise their settings to enjoy a more serious simulation of the demands placed upon FORMULA ONE drivers. An expanded Scenario mode, extensive online multiplayer options and split-screen racing enhances F1 2014’s recreation of the world of FORMULA ONE for long-established fans and newcomers to the series.\nNEW CIRCUITS – Race the new Spielberg circuit in Austria, the new Sochi Autodrom in Russia and the return of the Hockenheimring, plus experience the 2014 FORMULA 1 GULF AIR BAHRAIN GRAND PRIX which was run as a night race for the first time this year\nALL THE CARS, ALL THE STARS – F1 2014 features all of the new season’s driver changes up and down the grid and the dramatic changes in this season’s cars\nEXTENSIVE MULTIPLAYER OPTIONS – Prove yourself in two-player split-screen or online in 16 player races with 6 AI to simulate full 22 car grids\nDRIVER EVALUATION SYSTEM – Replacing the Young Driver Test in-game is the driver evaluation system, which tunes the game to your level following a one lap race\nRACENET – Track your stats and get new regular online challenges with RaceNet, Codemasters’ free online community hub\nERS DEBUTS – Replacing last season’s KERS system, ERS delivers drivers more power automatically and opens up overtaking opportunities – feel how this extra power changes the race\nEXPANDED SCENARIO MODE – Complete an increased range of scenarios based on real-world racing situations and earn medals in this extended mode\nREFINED HANDLING -Enhanced game physics combine with refined handling via gamepads to deliver a more authentic and accessible driving experience for all players\nTURBOCHARGED FORMULA ONE – Experience the raw power delivered by the new turbochargers in changes the handling in each F1 2014 car\nENHANCED CAREER MODES - Play through a full FORMULA ONE season or choose from shorter seasons, including 7 race and 12 race options.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":1740,"name":"ZHEROS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9da/9da52f589e725bcbd2f8abddbef335f8.jpg","description":"ZHEROS is a next gen beat’em up based on the genre hallmarks, above all: smashing hordes of enemies and punching stuff.\nIn a journey through distant and unknown galaxies, you will play as the members of the ZHEROS squad: Mike and Captain Dorian. Brave, strong as awkward and dim-witted the first one; agile, smart and ready for anything the second one. They are both intergalactic agents called to defend the universe from crime.\nYour mission:  defend the universe from the evil Dr. Vendetta and his twisted plan to mutate every living creature in his trusted minions.\nIn single player or in co-op mode, you can rely on your punches, using a rich selection of combos, and on powerful hi-tech weapons, but if that was not enough, a strong and destructive mech will come to the rescue in the most dangerous situations.\nFrom bizarre characters and encounters to strange locations, find out what mystery awaits you at the end of your journey.\nFeatures:\n•\tEngaging combat which aim to bring back the old style beat’em up feeling\n•\tLots of spectacular combos and chain moves\n•\tA bright and neat graphic style across two dangerous worlds\n•\tJump aboard your awesome mech! Rockets and lasers await you!\n•\tDouble the action in the local co-op mode\n•\tPlenty of twisted robots and bio-mechanical creatures will try their best to stop you\n•\tDevelop your character to fit your play style, upgrading your muscle or your weapons","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rimlight Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":669325,"name":"Castlevania Advance Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e6/5e6bbe68bd1f0a945c475b9ba20a3a5f.jpg","description":"Join the fight against Evil in the Castlevania Advance Collection, a compilation of timeless action-exploration masterpieces!\n\nIn addition to the three legendary Castlevania games that were first released on Game Boy™ Advance, this collection also includes Castlevania: Dracula X and some never-before-seen sketches and artwork from the games!\n\nAll four games are enhanced with newly added modern features such as Rewind, Save/Load and Replay, making this the best way possible to experience these classics or discover them for the first time! This collection also boasts a handy Encyclopedia, a Music Player with all soundtracks and you can even change the ROM Region to play all games in different versions.\n\n \n\nFEATURED GAMES\n\nCastlevania: Circle of the Moon (GBA) - This was the first Castlevania title released on Game Boy Advance! The story follows Nathan Graves, a vampire hunter apprentice who enters Dracula's Castle along with his Master in order to prevent the dreaded return of the Count. Combine action and attribute cards to create over 80 unique spell effects, ranging from fire whips to ice blizzards, with the 'Dual Set-up System'.\n\nCastlevania: Harmony of Dissonance (GBA) - This was the second Castlevania title released on Game Boy Advance! Play as Juste Belmont, the grandson of legendary Vampire Hunter Simon Belmont! This title introduced a lot of new features to the franchise, such as 'Boss Rush' mode and the 'Spell Fusion' system that lets players combine Sub-Weapons with Spell Books to cast devastating spells.\n\nCastlevania: Aria of Sorrow (GBA) - The third and final Castlevania game on Game Boy Advance! Soma Cruz, a young high school exchange student in Japan, is somehow involved in the eternal cycle of reincarnation of the Dark Lord himself. What role does Soma play in all of this? Will he be able to return to his own world? Aria of Sorrow also introduced a brand new attack system called 'Tactical Souls', that lets Soma Cruz capture the souls of slain monsters to acquire their abilities. (100+ abilities in total!) Aria of Sorrow also has a ton of New Game+ content.\n\nCastlevania: Dracula X (SNES) - Castlevania: Dracula X is a reimagination of the cult action game Castlevania: Rondo of Blood. Released on the Super Nintendo Entertainment System™ (SNES), Dracula X has been acclaimed as one of the most challenging Castlevania titles ever created. The Dark Lord Count Dracula rises again from the dead to revive the forces of darkness and to annihilate this corrupted world and create a new one. You are Richter Belmont, heir of the Belmont family, and you set out for Dracula's Castle to defeat its evil master. Fight your way through Dracula's Castle and defeat the toughest enemies with the new special attack 'Item Crash'!\n\n \n\nBRAND NEW FEATURES FOR AN IMPROVED EXPERIENCE!\n\nGallery - Browse through scans of the original package designs and discover incredible artwork never shown to the public before.\n\nROM Region Selection - You can choose between the Japanese, American, and European versions for each game.\n\nEncyclopedia - Learn more about all three GBA games thanks to their dedicated encyclopedia. Detailed information on enemies, the 'DSS' system, the 'Tactical Soul' system and the 'Spell Fusion' system will help you truly master each game's unique combat system!\n\nMusic Player - Listen to any of four complete soundtracks any time you want. You can even create your own playlists!\n\n \n\nNEW 'QUALITY OF LIFE' FEATURES\n\nSave/Load - You can now quickly save and reload at any point in the game. Even right before that deadly attack from Dracula himself.\n\nRewind - You can now rewind the state of the game for a few seconds for a second chance. It is almost like being resurrected...","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":514894,"name":"Football Manager 2021","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86f/86ff71c8b2fc1f9e5b067e5e8fc0438c.jpg","description":"FM21 empowers you like never before to develop your managerial prowess, play the beautiful game your way and reach elite status. Dynamic, true-to-life management experiences deliver football authenticity like no other game can.\n\nNew features and game upgrades to Football Manager 2021 redefine the way you interact within the game world. Your words will have greater impact as you impose your personality on your players, the fans and the media.\n\nFurther additions push realism and football authenticity to greater levels and deliver the best looking 3D match simulation in the series' history.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sports Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":53938,"name":"Mega Man (1987)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f78/f7809ab885f7464845681e5931aabeb8.jpg","description":"Mega Man, known as Rockman (ロックマン, Rokkuman) in Japan, is a 1987 action-platform video game developed and published by Capcom for the Nintendo Entertainment System (NES). It was directed by Akira Kitamura, with Nobuyuki Matsushima as lead programmer, and is the first game of the Mega Man franchise and the original video game series. Mega Man was produced by a small team specifically for the home console market, a first for Capcom, who previously focused on arcade titles.\nThe game begins the struggle of the humanoid robot and player-character Mega Man against the mad scientist Dr. Wily and the six Robot Masters under his control. Mega Man's nonlinear gameplay lets the player choose the order in which to complete its initial six stages. Each culminates in a \"Robot Master\" boss battle that awards the player-character a unique weapon.\nCritics praised Mega Man for its overall design, though the game was not a commercial success. Mega Man established many of the gameplay, story, and graphical conventions that define the ensuing sequels, subseries, and spin-offs. The game has since been included in game compilations and rereleased on mobile phones, console emulation services. It received a full 3D remake titled Mega Man Powered Up in 2006.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Capcom","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Wii U"},{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"}]},{"id":44585,"name":"Mana Spark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b7/8b776421719b3753dabb418a243f1657.jpg","description":"Features:\nCOMPLETELY SKILL-BASED COMBAT: Each enemy has its own set of skills, behaviors and collaborations. Learn their patterns and discover their weakness before they lay their hands on you.\nEXCITING PROGRESSION: Be responsible for rebuilding and maintaining your guild's village. Meet new characters, choose your traps, your weapons and keep track of your discoveries and unlocked content.\nHANDCRAFTED & PROCEDURAL GENERATION: Designed to make each new run a completely new experience. Each room is handcrafted to get the most out of the combat, but you'll never explore the same dungeon twice.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BEHEMUTT","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":28224,"name":"Burnout 3: Takedown","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/364/3642f0c38a105c8750c4b48097effc15.jpg","description":"Burnout 3 takes the hit series even further, now featuring a unique \"crash and burn\" racing concept and a one-of-a-kind special effects engine that delivers spectacular visuals. The intensity heats up as players race, and often crash, their way through oncoming traffic in an attempt to claim the top spot. Boasting multiple single-player, multiplayer and online crash and race modes, Burnout 3 offers players the opportunity to race through busy city streets and be rewarded for taking risks that result in heart-pounding action and electrifying crashes.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Criterion Games","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"}]},{"id":22391,"name":"Dysfunctional Systems: Learning to Manage Chaos","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1db/1dbfdf74b2809013812e417c2091106b.jpg","description":"From Dischan Media, creators of the highly acclaimed Juniper's Knot, comes Dysfunctional Systems: Learning to Manage Chaos.\nDysfunctional Systems is a visual novel series featuring Winter Harrison, a student mediator from a utopian world. Learning to Manage Chaos is the first entry in the series.\nWhat is a mediator? A mediator is someone who travels to chaotic worlds, attempting to resolve the issues plaguing them. The first entry in the series follows Winter's second mediation, where she shadows the experienced and aloof mediator: Cyrus Addington.\nDysfunctional Systems: Learning to Manage Chaos features two distinct endings, unlockable bonus art, an animated opening video, and a jukebox of in-game music.What is a visual novel?\nA visual novel is a mix of choose your own adventure books, comics and manga, music, and animation. Play through the story and make choices for the main character to change the outcome of the episode and the events of future episodes!Soundtrack Included\nAll Steam purchases of Dysfunctional Systems: Learning to Manage Chaos include the official soundtrack absolutely free! Enjoy a total of 18 tracks, including a full rendition of the Dysfunctional Systems opening theme, in both MP3 and FLAC. The album is included with the game files. To access, right click the \"Dysfunctional Systems\" entry in your library, click \"properties\", then go to the \"local files\" tab, and click the \"browse local files\" button.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Dischan Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19532,"name":"The Old City: Leviathan","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd0/cd0eb57fdaa6bd558eff72d7ffebdbb6.jpg","description":"The Old City: Leviathan is an experiment in first person exploration that focuses entirely on story.\nEverything else is secondary. All that exists is you and the world. Set in a decaying city from a civilization long past, The Old City: Leviathan puts the player in the shoes of a sewer dwelling isolationist. You progress through the narrative by simply exploring the world. The story itself is told via the musings of your character and, chiefly, the environment itself. This environment has been designed to be diverse, interesting, and meaningful to the narrative of the game.\nThe objective is to understand. The story of The Old City: Leviathan is not told in a traditional manner. As you progress through the narrative, you will overhear a conversation between two entities. The first entity is the nameless character you are controlling who communicates through a monologue. The second entity is the depths of the environment, details and all. Your task is to piece together the narrative as if you are jumping into a conversation with no context. The more you explore, the more you will potentially understand.\nThis experience is not a normal one.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"PostMod Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":19394,"name":"Echelon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fd/0fd5f4646fceea9149cf7f04ee7c92a0.jpg","description":"Darkestville Castle Coming Soon\nA new part of Montezuma available on Steam!http://store.steampowered.com/app/443370\nAbout the Game\nImminent threat to the Federation rises in 2351. Velians intend to cast a shadow over every colony within the Federation in their rebellious uprising.\nVelian unique military technology makes them almost invincible. And they has no intention to show any mercy.\nAs a Federation Pilot you must interfere with their plans and destroy Velian elite forces in a fierce battles over surface of the planets.\nAccurate aircraft physics with realtime damage effects.\nOver 200 different military vehicles and structures to destroy.\nWingmen support to aid in completion of mission objectives.\n14 types of aircraft, with a choice of 16 different weapons.\nProgressively increased control over craft and strategic objectives.\nBranching campaigns for a variety of playing experiences.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Access Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17002,"name":"Hate Plus","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cf/6cfe5019a2a37bb63066efb3eb4dff92.jpg","description":"Let's spend the next three real-time days together uncovering the mystery of what went horribly wrong on a derelict generation ship, with the help of a spunky/more-than-slightly-traumatized AI sidekick!\nA sequel to Analogue: A Hate Story that tells a whole new hate story of its own. Analogue players can pick up where their finished save files left off, and new players can start fresh in Hate Plus.\nA dark visual novel about transhumanism, cosplay, cake-baking, and the slow patriarchal erosion of freedoms taken for granted.The story so far...I can't believe it! My mission was supposed to be routine data recovery on an old derelict generation ship, but instead, I ended up rescuing an adorable AI girl who grew up in a tremendously patriarchal Neo-Confucian society? And now she's discovered a bunch of messages left by the mysterious Old *Mute... and wants me to uncover with her the slow enactment of a regressive political program that caused her society to regress to Joseon Dynasty social mores?!\nI wasn't expecting this at all! I thought the three day trip back to Earth would be peaceful and lonely and not at all filled with reading about tragedy!\nAnd so began my hateful days...","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Love Conquers All Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16925,"name":"RACE: Caterham Expansion","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e77/e7743713bf9e28ee910c657077bdbe25.jpg","description":"Celebrating the 50-year anniversary of Caterham Cars Ltd, RACE fans can now expand the WTCC Experience with this exceptional series of classic sportscars. RACE: CATERHAM introduces a total of 60 individual new cars/car skins based on some of the most exciting models in the Caterham sports car range, including the Caterham CSR 200, CSR 260 and the CSR 320 Concept, a concept version with a grueling 320hp.\nRacers can run the cars on two exciting new tracks: the legendary Imola circuit and the former GP track Estoril.\nRACE: CATERHAM includes new features that improve the original RACE game experience: improved performance scalability, a performance monitor to help the player find the best possible graphical settings, and a new controller interface with more options for joy-pad or keyboard/mouse controls.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"SimBin","platforms":[{"id":0,"name":"PC"}]},{"id":14925,"name":"Medieval: Total War - Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9df/9dfa8245cfbb456f829eb03c58877457.jpg","description":"From the lush grasslands of Western Europe to the arid deserts of Northern Africa, and from the first Crusade to the fall of Constantinople, wage total war in order to expand your influence and secure your reign as you build a dynastic empire to stretch across four centuries.\nRecruit and deploy armies, besiege settlements, fight naval battles and employ agents such as emissaries, spies and assassins to aid with diplomacy, offer alliances or bribes, or execute more clandestine actions.\nA dramatic period of rebellion, civil war, and the birthing of nations provides the backdrop to your own scheme for ultimate power. Carve a niche for yourself through the crucible of battle and become the statesman and king the era demands.\n\n• Fourteen playable factions from across Europe, the Middle East and Africa.\n• Up to 10,000 soldiers on-screen deliver incredible, epic battle scenes.\n• New siege systems make the most of an era where formidable castles dotted the landscape.\n• Valour, Vice and Virtues colour your faction’s characters, effecting how other treat them and the men they lead.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Creative Assembly","platforms":[{"id":0,"name":"PC"}]},{"id":11113,"name":"Starpoint Gemini Warlords","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6bb/6bb551be86adf1668df4cdc795ee521a.jpg","description":"Warlords with WorkshopStarpoint Gemini Warlords features full Steam Workshop integration. Creating and using mods has never been easier!\nCheck out what the amazing community has created in the Workshop section and give those new ships or quests a go.\nAbout the GameStarpoint Gemini Warlords is a space sim coupled with role-playing and strategy elements. Send your mighty war fleets into combat or lead them yourself. The choice is yours. Be the Warlord!\nControl your ship directly to show off your battle prowess. Aim and fire manually or command your gunners to do the job for you while you execute unique skills. Choose your companions to follow you into battle and if you need an extra hand, have your fleets join you in glorious combat. Battles in Warlords can vary from duels and small skirmishes to clashes of massive fleets in planetary orbits.\nConstruct ships and assemble your mighty war fleets to pitch them against the other war-mongering factions of Gemini, but be mindful of the situation you're sending them into. A seemingly weaker fleet can be accompanied by warmasters, well-trained specialists that can sway the battle in their favor, but fear not, you can have your fleet follow you so you can lead them to victory!\nUpgrade your headquarters with additional modules to produce more advanced weapons and enhancements, develop new ships leading up to the station-size Proxima, unlock new structures and activate various bonuses that influence all of your territory. You are the leader of your people and a powerful leader deserves a stronghold.\nSpread your influence and increase your resources by expanding your territory, but don't stretch your defenses too thin or your enemies might take advantage. Territory can be fortified and improved by building various resource and defense structures. Expand the T-Gate network to make your fleets travel across your ever-growing empire faster. A timely arrival can make all the difference.\nBegin your adventure on a small, agile gunship and work your way up to a massive carrier class capable of deploying numerous fighter wings. Upgrade your chosen vessel of destruction with a plethora of weapons and enhancements. And to finish it all off, throw a coat of paint on it to get that perfect vessel you always wanted.KEY FEATURES:Massive game world, populated by over 60 diverse factions, ready to face your war fleets.\nCampaign mode – Play through the story of the “exiles”, who settled on the barren planet of Phaeneros on the outskirts of Gemini, after escaping the alien invasion of the Sol system.\nFive free roam scenarios with distinct start setup.\nChoose among nearly 90 different ships, from gunships and corvettes to bulky carriers.\nBuild your own personal headquarters to boost your economic and military power.\nProcedurally generated freelance jobs offer a great way to earn Credits that you can use to pump upgrades into your ship.\nProcedurally generated encounters can creep up on you when you least expect them.\nChoose one of three unique character classes or whip up a hybrid class of your own.\nConduct research on a multitude of different tech that affects everything from your own ship to the global scheme of things.\nConstruct ships, assemble war fleets and send them in all directions to conquer for the glory of the Solari Concord.\nBuild and upgrade infrastructure across the star system to improve resource gathering and strengthen your dominion.\nEngage in diplomatic relations and sign trade deals to get that boost you need.\nMod support that greatly surpasses that of its predecessor, Starpoint Gemini 2.\nFor more information, check out the official Starpoint Gemini Wiki on Gamepedia.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Little Green Men Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":11002,"name":"Take On Mars","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca4/ca4dd24501fecb95fef9f41645e0fecb.jpg","description":"Be smart, Take On MarsTake On Mars offers many benefits over real-life manned Mars exploration:No need to wait until the 2030s (or longer)\nSkip years of astronaut training, political debate, and budget cuts\nUnlimited funding and infinite lives\nCommute between Earth and Mars in seconds\nAvoid the discomforts of real space travel\nPick your own crew or go solo\nAll-you-can-eat potatoes all day every day\nFree trips to Earth’s Moon and International Space Station included\nAll for the price of just a few burgers!\nAbout the GameExplore the rocky terrain and sandy wastes of the Red Planet. Bohemia Interactive’s Take On Mars places you right in the middle of mankind’s most exciting undertaking. Start out in the seat of a rover operator, finish as the first human to have ever set foot on Mars. With a scientific arsenal at your disposal, you will pioneer the exploration, and colonization, of the Red Planet.Key FeaturesSpace Program Campaign Chapter 1: Robotics Campaign\nExplore the Red Planet from the perspective of a science-driven space agency. Command rovers, landers, or probes, over a distance of hundreds of millions of kilometers - and collect important scientific data about Mars. Research new technologies to gain new equipment.\nSpace Program Campaign Chapter 2: Manned Mission Story Campaign\nTake on the role of astronaut Mark Willis, one of the crew members in the first manned mission to Mars. When things go wrong during the descent into Mars’ atmosphere, and the connection with Earth is lost, the crew is declared missing in action. However, there’s one survivor: you. Relying on a background as a mechanical engineer, you will need to fight for survival and construct the machines needed for a chance to return home.\nSandbox Survival Multiplayer\nInvite your friends in drop-in/drop-out online multiplayer, and establish the foundations of a human colony on Mars. Work together to extract raw materials from Martian soil, refine them into real compounds, and use the 3D Printer to build your habitat panel by panel. Develop a power grid, pressurize living areas, utilize botany to grow crops, and operate various vehicles and machines to keep you and your crew alive.\nReal Life Locations\nTravel across a vast, unforgiving Martian terrain with locations based on actual satellite data from famous locations such as Victoria, Gale, and Cydonia Crater. Be prepared for extreme weather and sandstorms, and watch out for radiation exposure from Mars’ solar events. Aside from the Red Planet, Take On Mars features various additional special locations and celestial bodies, including Mars’ moon Deimos, Earth orbit, Earth’s Moon (Apollo 17 Moon landing site), International Space Station (with full interior), Earth Training Centre, and Mars Yard.\nAdvanced Simulation\nExperience motion in locations with different gravity strength, including Zero-G. Break off cameras, robotic arms, or even individual struts and wheels - all affecting the way your vehicle handles. Each object, system, and instrument in Take On Mars is accurately simulated to offer a truly authentic experience.\nContent Creation Tools & Modding Support\nCreate your own scenarios in the 3D Editor and share them on the Steam Workshop. Dive into Take On Mars’ powerful Workbench editing suite to develop new terrains, add-ons, and total modifications.\nAnd More\nFamiliarize yourself with Take On Mars’ gameplay via 5 training missions. Play a variety of individual scenarios set across different locations. Discover interesting facts about the Red Planet with the in-game Mars Encyclopedia.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":5360,"name":"SimCity 2000","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/590/590bd58a61e5842491604130766b13a8.jpg","description":"SimCity 2000™ is the second title in the revolutionary SimCity franchise. Design, build, and customize the city of your dreams with the ultimate city simulator. Watch as your city comes to life, and help it grow as you deal with education, health issues, and crime, and manage traffic, the city's budget, and the needs of the citizens.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Maxis","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PSP"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"SNES"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":593358,"name":"Warpips","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/807/807ace9a4b241d853c5b04e27bd9863d.jpg","description":"Early Access Roadmap\nFeatured DLChttps://store.steampowered.com/app/1606930/Warpips__Supporter_Pack/\nDiscord\nAbout the GameWarpips is what would happen if Command and Conquer and Nexus Wars had a baby made out of tanks and napalm! Set lose the engine of war and watch the chaos of physics-based combat explode onto the battlefield! Assemble your army from a diverse roster of infantry, vehicles and airplanes. Deploy troops, call down airstrikes, and launch missiles - all without that pesky micromanagement.\nFocus on the big picture; no complex micro\nEach round lasts between 10-20 minutes\nEasy to learn, hard to master\nBuy the game - you get the game\nNo microtransactions\nNo pay to win\nRandomly generated battles\nDifferent each time you play\nLots of replayability\nChoose complementary unit synergies\nInfinite strategic combinations\nFully unlockable upgrade tree\nSpawn infantry, vehicles, airplanes and helicopters\nCall down air strikes, missile attacks and artillery\nUnits take cover and respond intelligently to their situation\nEverything explodes!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Skirmish Mode Games","platforms":[{"id":0,"name":"PC"}]},{"id":428614,"name":"Shadow Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afb/afb64cefd58d1e5ea452cddbf9a2ef7f.jpg","description":"GET YOUR PREMIUM BETA KEY\nRegister for a Premium Beta Key, which will get you the powerful Shadow Lord gear set for the Final Beta!\nRegistrations open until April 16th, 2020 00:59 UTC.\nJOIN OUR DISCORD\nAbout the GameCountless will fall and only one will ultimately rise victorious in the Shadow Arena.\nIn battles that pit 40 heroes against each other in fierce, action-packed showdowns, do you have what it takes to defeat your opponents and become the final survivor, the sole champion?A Dynamic Fantasy Arena FighterExperience a new style of PVP action in this fast-paced fantasy arena fighter where the most battle-hardened characters from the Black Desert universe compete against each other until only one is left standing on the battlefield. Playing as one of these heroes, your fight to survive the Shadow Arena will be intense, with opponents coming at you from every direction and the dark fog looming on all sides, threatening to swallow everything in its path.\nThe Means to Your EndWill you rain steel on your competitors with swords and weapons, or hit them with a barrage of spells? Will you outplay your opponents in direct combat or outmaneuver them with other strategies? How will you survive the arena's giant dragon and the Ancient Ruins Guardians?\nRegardless of the choices and moves you make, in the end, there is only one rule in the Shadow Arena: fight until you are the last one standing!\nSo enter the battlefield shrouded in darkness, where the strong eat the weak.\nBecause there's no need for the weak.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Pearl Abyss","platforms":[{"id":0,"name":"PC"}]},{"id":286525,"name":"Silver Chains","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c80/c808131dc50efd799673d8ee09ed67f0.jpg","description":"After his car hit a tree in a stormy night, Peter wakes up in an old abandoned mansion, somewhere in England. He can´t remember why and how he got here, but soon he realises that the house is not as abandoned as it seems.\nWhile trying to find a way out of the house, Peter has to uncover the dark secrets of what has happened in this place. As he tries to find his way out, Peter discovers hints which indicate that he has already been here before. But by the time he’s starting to put the pieces of the puzzle together, something evil has picked up his trail…\nSilver Chains is a first-person horror game with a strong emphasis on story and exploration. Search for clues within an old abandoned manor to unravel the truth about the terrible events which have happened here.\nSolve puzzles to find out how you are connected to the mysteries of this place. But be careful: something evil lurks in the cold, dark masonry and it has already started hunting you…\nFeatures:\nAn atmospheric horror experience: photo-realistic and detailed graphics bring the interior of an old abandoned mansion to life. Dark passages, a brawly thunderstorm, paranormal activities and a thrilling story will provide you with complete immersion into the game, accompanied by an eerie soundtrack and English voice overs.\nStory-Exploration-Game with puzzle- and action elements: find out the mysteries of a huge mansion and the history of its inhabitants. Solve puzzles to gain entry into locked areas but beware the dangers which lurk in the dark. This evil you cannot fight - run for your life and find a place to hide.\nBeware the dangers lurking in the dark. This evil you cannot fight - run for your life or find a place to hide: Experience an intense feeling of horror as you try to escape from the monster chasing you down.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cracked Heads Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":58559,"name":"Madden NFL 19","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2b/f2b8a92fb7d71985196159f10ba89023.jpg","description":"Madden NFL 19 gives you game-changing control on and off the field.   Real Player Motion transforms the way you play Madden delivering you gameplay control with precision and intent.  Create and share custom Draft Classes, design your game strategy, progress your players and execute your game plan with all new positional archetypes in Franchise.  In Madden NFL 19 Ultimate Team, train your favorite players to fit your roster and lead your team to glory in all new ways to compete.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-4 players\nNetwork Players 2-6 - Full game requires PlayStation®Plus membership to access online multiplayer\n52GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nConditions and restrictions apply. See www.ea.com/legal for details","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":51609,"name":"Mario Tennis Aces","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/655/655977041d1fcd25a71a54727b93bb2f.jpg","description":"Earn double Gold Points when you pre-purchase Mario Tennis Aces!\n\nReceive a bonus of 300 My Nintendo Gold Points when you pre-purchase the\ndigital version of the Mario Tennis™ Aces game through Nintendo eShop or\nNintendo.com (where available). Offer ends 6/21 at 11:59 p.m. ET. Bonus\npoints will be issued a few days after the release day of the game and\nare earned based on the original list price of the game on Nintendo\neShop, and will vary by country and currency.\n\nUnleash an arsenal of shots and strategies in all-out tennis battles\nwith friends, family, and fan-favorite Mushroom Kingdom characters.\nWhether you play locally,* online,** or using simple motion controls,\nintense rallies await! In Adventure mode, experience a new favor of\ntennis gameplay, with a variety of missions, boss battles and more.\n\nComplete missions and boss battles in Adventure mode while mastering the\ncontrols. Test your hard-earned skills in singles or doubles with up to\n4 players in local* or online** multiplayer, not to mention Tournament\nMode, which lets you challenge the CPU. Store up energy and use it to\npull off amazing feats: move so fast the world slows down around you or\naim in first-person to send the ball crashing down! Your rivals may\nattempt to block you, but if they fail, their racket will take\ndamage—and break after three hits. Fully charge your energy to launch\nthe ball with enough force to KO your opponent!\n\nRally against other players in singles or doubles as one of 15+\nMushroom Kingdom characters\n\nServe up everything from basic shots to trick shots to split-second\nblocks\n\nUse energy to leap after the ball, slow down time, aim in\nfirst-person, break rackets, and KO opponents!\n\nPlay locally,* online,** or swing your Joy-Con™ controller like a real\nracket in Swing Mode\n\nTake on CPU opponents in the Mushroom Cup, Flower Cup, or Star Cup in\nTournament Mode\n\nAdventure mode offers a new flavor of tennis gameplay, with a variety\nof missions, boss battles and more.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Camelot Software Planning","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":42930,"name":"Resident Evil: Revelations 2 - Episode 1: Penal Colony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4d/f4d8c1733f477ddf655d14eda4162a69.jpg","description":"Resident Evil® Revelations 2 follows two interwoven stories of terror across 4 episodes of intense survival horror.\nEpisode One: Penal Colony\nKidnapped by a unknown group of assailants, Claire and Moira awake to find themselves trapped on an isolated island infested with horrifying creatures beyond imagination. Now they must desperately struggle to escape the horror.\n*Episode One includes Raid Mode for countless additional hours of gameplay.\n*Episodes One-Four required for Platinum Trophy.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n©CAPCOM CO., LTD. 2015 ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":27058,"name":"Super Mario Land","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1fe/1fe7141e0363840130cb2edfbe71a9aa.jpg","description":"Ancient ruins, giant crabs, Koopa Troopas, flying stone heads, and\r\nhungry sharks await you in this 1989 Game Boy game.\r\n\r\nIn the beautiful kingdom of Sarasaland, a mysterious alien has appeared\r\nand hypnotized the inhabitants, while kidnapping Princess Daisy for\r\nhimself!\r\n\r\nTravel over land, in the air, and underwater, as Mario runs, jumps, and\r\nbounces his way to fortune and glory on his mission to save Princess\r\nDaisy and restore peace!\r\n\r\nAncient ruins, tempestuous waters, and brand new challenges await!","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy"}]},{"id":21217,"name":"Kingpin — Life of Crime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42c/42c73f56c4c80e92cbfcafb5b3ee0717.jpg","description":"Kingpin is a tale of revenge. Take control of a street gang and order your recruits to attack, defend or even do a little safe-cracking to pick up some needed cash. Use that cash to buy nastier weapons and take down your punk enemies in this intense first-person shooter. Being the Kingpin is half attitude and all action.\nStart your own gang and recruit right from the streets. If a new gang member turns out to be a punk, blast him and make room for new ones. Move up in the world, but watch out for the Kingpin; eventually you're going to have to take him on.\nSomewhere in a past that never crossed paths with the future lies the world of the Kingpin. Burned out buildings and urban decay are the landscape. Local gangs roam the streets, protecting their turf and scoping out opportunities.\nSome of the features include\n16-player multiplayer action via LAN or Internet\nLocation-specific damage — shoot a snitch in the kneecaps or snuff out a rival with a head-shot","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Xatrix Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19741,"name":"The Lady","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8df/8df64638d17d98364d41c4de8ea5d1f9.jpg","description":"“The Lady” is an emotional 2D Surreal Puzzle Horror adventure.\nThe Lady is a surrealist emotional journey that takes The Lady through a series of fever dream hallucinations, while being at odds with inner struggles of anxiety and depression. She encounters multiple versions of herself throughout the game, unsure of which versions to trust. From the initial confusion, to all out anxiety that one would experience with panic disorder, it's all there for you to explore first hand through the eyes of The Lady.\nThe Gameplay Mechanics are inspired by classic SNES and Turbo Grafx16 type games. The gameplay difficulty is brutal, just like life itself.\nThe game is displayed in a “waist up” cinematic style, for a more personal experience. Gameplay features side-scrolling exploration, puzzle solving, retro arcade-style boss battles, and plays in letterbox full screen HD.FeaturesThe most unique Female Protagonist to ever appear in a video game\nFive unique levels each with their own play style\nRetro difficulty\nNo tutorials, no hand holding\nPuzzle exploration\nA story that will make you ask questions about \"The Lady\" and about yourself","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MPR ART Hallucinations","platforms":[{"id":0,"name":"PC"}]},{"id":19082,"name":"CATS!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d69/d69de8c8ed6c6c14f799e0854d29cdb3.jpg","description":"CATS!\nCATS! is a CAT-based parody of some of the top video games of ALL time -\nEnjoy parodies inspired by Super Mario Bros®, Tetris™, Candy Crush Saga®, Nintendogs + Cats™, Sonic the Hedgehog® + more - all from a Cat's perspective!\nThe game also features a \"Pet Toy\" mode so that your pet can interact with the game. Just leave your pet alone with your screen on and let your pet try to chase and catch various objects on screen.\n----------\nCATS! currently features the following 5 modes:\n#1. Arcade mode - side-scrolling Super Mario Bros. and Sonic the Hedgehog -inspired mode starring CATS!\n#2. Puzzle mode - Tetris and Candy Crush Saga -inspired mode starring CATS!\n#3. Pet Toy mode - your pet (cat or dog) can interact with the game in real-time! Just leave your pet alone with your screen on and let your pet try to chase and catch various objects on screen.\n#4. Jump mode - Sonic the Hedgehog and Super Mario Bros -inspired mode starring CATS!\n#5. Screensaver mode - Nintendogs + Cats -inspired mode starring CATS!\nWe plan to add more levels and characters to the game...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Catstudio","platforms":[{"id":0,"name":"PC"}]},{"id":16313,"name":"Bubble Blowout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f6/1f615b0e1f4cea71e0a57e0a02b20ce0.jpg","description":"There are bubbles everywhere in Bubble Blowout! Use your cannon at the bottom of the screen to match-3 or more bubbles, and clear the entire screen to progress. The more bubbles you burst at once the higher score and better bonus you will get. Suitable to players of all ages and experience levels, this crisp and colorful bubble-blaster offers multiple modes of play. RELAX mode is ideal to introductory players seeking a laid-back and casual gameplay experience. CLASSIC mode has 21 exciting levels to beat, and only experienced players will achieve top-star ratings across all levels. RUSH mode is a match made in heaven to expert players going for the highest score in a fun bubble parade that never ends.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":4546,"name":"Red Dead Redemption: Undead Nightmare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/632/63248c06f2dbf7362ed7add26603d40f.jpg","description":"ACROSS THE VAST WESTERN FRONTIER, A PLAGUE IS SPREADING. When former outlaw John Marston wakes up at his farmhouse, he finds a world gone insane: overnight, deranged hordes have overrun the towns and outposts of the American frontier.  In a desperate attempt to save his family, Marston must traverse a world torn apart by chaos and disorder, using every skill he has to survive long enough to find a cure.\nTake on the Dying and Undead West in multiplayer with exciting Co-Op missions and Competitive Modes.  Attack and defend in Stronghold Mode, or take over territory in Land Grab.  Play online as iconic characters from Red Dead Revolver or as the legends from Red Dead Redemption.  School your friends in Poker, Liar's Dice and Horse Racing and annihilate your enemies with the deadly Tomahawk and Explosive Rifle.   Red Dead Redemption: Undead Nightmare standalone does not require a copy of Red Dead Redemption to play.\n©2006-2010 Rockstar Games. Rockstar Games,R*,Red Dead Redemption & other marks are trademarks of Take-Two Interactive Software. All Rights Reserved.\nUse of this software subject to license in game manual & online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee, internet connection, and/or online account registration (13+). Special features may not be available to all users and may on 30 days notice be terminated, modified, or offered under different terms.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nThis videogame is fictional, doesn’t depict any actual event, person, or entity any similarities are coincidental.  We don’t endorse or encourage any conduct depicted.  Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is prohibited.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rockstar North","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":1121,"name":"Secret of Mana","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/05c/05c76881c6c97cbfeb22117a770cbd69.jpg","description":"Originally released in 1993, \"Secret of Mana\" is by far the most popular title in the “Mana” series. Now it's finally getting a long-awaited, full 3D remake!\nThe game faithfully retells the beloved story while adopting modern 3D graphics and controls. It will feature a newly arranged musical score, voiced characters and new content.\nThe adventure of Randi, Primm, and Popoi is reborn in the new \"Secret of Mana\"!\nKEY FEATURES:\n3D REMASTERED GRAPHICS\nThe world of MANA rebuilt in vivid 3D graphics.\nUPGRADED GAMEPLAY\nExciting new interlude episodes.\nLOCAL CO-OP\nPlay with your friends in three-player co-op mode!\nVOICED-CHARACTERS\nFinally hear the voices for iconic characters Randi, Primm, and Popoi along with many others!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":742,"name":"Minecraft: Story Mode - Episode 1: The Order of the Stone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c4/3c492d58f5082a1fb5efca8bfd2be940.jpg","description":"THE ADVENTURE OF A LIFETIME IN THE WORLD OF MINECRAFT\nAs Jesse, you’ll embark on a perilous adventure across the Overworld, through the Nether, to the End, and beyond. You and your friends revere the legendary Order of the Stone: Warrior, Redstone Engineer, Griefer, and Architect; slayers of the Ender Dragon. While at EnderCon in hopes of meeting Gabriel the Warrior, you and your friends discover that something is wrong… something dreadful. Terror is unleashed, and you must set out on a quest to find The Order of the Stone if you are to save your world from oblivion.\n• Created by award-winning adventure game powerhouse Telltale Games, in partnership with Minecraft creators, Mojang\n• Featuring the voices of Patton Oswalt (Ratatouille, Agents of S.H.I.E.L.D), Brian Posehn (The Sarah Silverman Program, Mission Hill), Ashley Johnson (The Last of Us, Tales from the Borderlands), Scott Porter (Friday Night Lights, X-Men), Martha Plimpton (The Goonies, Raising Hope), Dave Fennoy (The Walking Dead: A Telltale Games Series, Batman: Arkham Knight), Corey Feldman (The Goonies, Stand by Me), Billy West (Futurama, Adventure Time), and Paul Reubens (Tron: Uprising, Pee-Wee’s Playhouse)\n• You will drive the story through the decisions you make: what you say to people (and how you say it), and what you choose to do in moments of thrilling action will make this YOUR story","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Telltale Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":60973,"name":"INSOMNIA: The Ark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/062/0620bf3e7f52201a507401f4eab4bf9f.jpg","description":"INSOMNIA is a dieselpunk sci-fi RPG about the slowly degrading remnants of human society attempting to survive on an abandoned space metropolis. Develop your character, explore lovingly handcrafted locations, interact with peculiar NPCs and factions, craft equipment and try to stay alive in this brutal world.\nWelcome to Object 6 - a colossal space station set on a dismal 400-year journey in search of a new home. Your character wakes from cryogenic sleep — stricken with a rare psychological disease and unknowingly holding humanity’s last hope in his bare hands...Exploration is rewarding…and dangerousSurvive hunger, thirst, fatigue while searching for valuable technology and resources in over 70 unique locations. Pay attention - INSOMNIA’s nuanced world can conceal unexpected quests from treacherous characters, as well as savage enemies and deadly hazards.Personalized journeyBreak free from character classes and unwanted grind with a flexible perk system combined with a large amount of craftable items and equipment. Choose your gear wisely - every armor and weapon type in the game has its own tactical virtues and shortcomings.\nСhoices matterNavigate a non-linear storyline with ‘points of no return’ that encourage unorthodox approaches and 12 different story endings. Your character’s chosen background plays a role in how you interact with NPC’s and factions, as well as influences the outcomes of certain quests.\nA rich universeExperience a neo-noir world with elements of dieselpunk. Witness man-made apocalyptic landscapes imbued with a dark ambient soundtrack and echoes of a decaying civilization.Public support for INSOMNIA\nPlease feel free to contact us here if you are Streamer or Influencer.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Mono Studio","platforms":[{"id":0,"name":"PC"}]},{"id":21628,"name":"Foreign Legion: Buckets of Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2f/e2fd139bb17b83d531d74f8f91a90e0e.jpg","description":"Foreign Legion: Buckets of Blood is a cartoon-style third-person shooter. You take the role of a last-standing hard-boiled Legionnaire taking on an entire rebel army.\nA small campaign with various objectives, such as defending civilians, escorting a tourist bus and a mass-chicken-murder map. The game includes a ranking system that allows you to unlock new outfits, accessories and of course new weapons.\nKey features:\n18 Various Steam achievements: Try to win Chicken Slaughter (killing all the chickens) and Damage Control (sparing all the civilians) in the same game!\nFill your buckets with blood by causing suicide bombers to explode prematurely or shoot gory head shots!\nA dynamically evolving soundtrack that reacts to your actions!\nA complete arsenal of weapons, including personal air-raid support to slaughter attacking hordes at once.\nA broad range of difficulty with action-packed fun for both casual and veteran players!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sakari Indie","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20800,"name":"Realms of Arkania 1 - Blade of Destiny Classic","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f8/6f827c6e97588f93a07eb31c725873e6.jpg","description":"Blade of Destiny (1992) is the first part of the glorious Realms of Arkania Trilogy...\nAn Orc army stands ready to attack Arkania's villages and towns. The only hope of saving the land lies in the legendary Blade of Destiny. Can you find this magical weapon in time to stop the siege? A rich and detailed adventure that will engage your mind and challenge your imaginations.The Realms of Arkania TrilogyThe Realms of Arkania games (Blade of Destiny, Star Trail and Shadows of Riva) deliver a prime example of the classical European fantasy universe. Based on Germany's most popular pen & paper role playing game, it was also the first German computer RPG series to get widely recognized outside of its home country. To this day it holds a stable hardcore fanbase that loves the games for their comprehensive adaption of the pen & paper ruleset and the believable medieval fantasy setting.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Attic Entertainment Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20296,"name":"Wrack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/956/956d52d142a2c4e3fe8a0afb8fd27abb.jpg","description":"Introducing the arcade shooter - Wrack! Combo your way to victory in this addictive single-player adventure. Slaughter countless enemies as you build up long kill chains, and wipe them out with powerful chain finishers. Plus, with Steam Workshop and extras like Time Attack, the action never has to end!Key FeaturesCombos and Chains - Be a badass! Take monsters down by the dozen, and rack up addictive fighting game-style kill chains and kill combos!\nFinishers - Use your kill chains to unleash devastating chain finishers! Use them to wipe out groups of enemies, take down powerful enemies... or even bosses!\nMega Man-style Bosses - Battle bosses (and minibosses!) inspired by games like Castlevania and Mega Man! Learn how to evade their attacks, and then take them down!\nExtra Modes - Compete against yourself, your friends, and the world in Wrack's Time Attack and Score Attack modes! Your best entries are saved to the Steam leaderboards.\nSteam Workshop - Create your own levels or fully-fledged mods! Share or play the creations of others using Steam Workshop.Reviews\"It reminds me of first-person Mega Man.\" -- Keiji Inafune\n\"One of those better than it has any right to be experiences.\" -- Jim Sterling\n\"Wrack is great!\" -- John Romero\n\"I think they're developing a really nice game here.\" -- TotalBiscuit","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Final Boss Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20139,"name":"Quintet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d1/3d1da89f238bce3cd9b2a54b7a1e7605.jpg","description":"Your orders, Captain?\nYou've always wanted to sit in a big captain's chair and shout, \"More power to the shields!\" and \"Fire the torpedoes!\" I have too, and this is why I built Quintet.\nQuintet is a scifi cooperative, cross-platform, multiplayer, \"crew\" game where players work harmoniously to control the same ship. There are 5 roles: Captain, Helm, Tactical, Engineering and Science. How successful you are will depend on how well you all work together. You can play Quintet for hours for free and enjoy 20 playable ships online. There are 5 additional ships available with an upgrade.\nTruly multiplatform - No one is left out!\nMac, PC, Linux, iOS, and Android can all play together on the same ships and in the same missions. The Captain can be on an iPhone with a Tactical officer on a Linux box with an Engineer on an Android tablet with a Science officer on a Mac.\nNo friends? No problem!\nQuintet has one, two, three, four and five player ships. All the different ship types can all play together in the same scenarios. Quintet plays over the Internet so you can all play together even if you can't be in the same room. Easily drop in and drop out any time.\nSeveral game types\nQuintet features lots of different scenarios for co-op and pvp game play. Work together to fend off a massive armada or have a 20-ship free-for-all. Upgraded version includes beloved game types such as Capture the Flag and King of the Hill (my hill is a polyhedron).\nAlways Fresh\nI love working on this game. I update Quintet all the time. I'm constantly adding new features and new scenarios. Got an idea? Post your idea in the forum.\nIntuitive controls\nI wanted non-gamers to be able to play Quintet. I've simplified and streamlined the interface so you can drag in more friends of yours to play this crazy space game.\nControl DMX and Philips HUE Lights\nGet immersive! Quintet has a built in simple scripting language for controlling DMX lights and Philips HUE lights. You can trigger lights when you fire weapons or when the shields are hit.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Carmine T. Guida","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]