[{"id":13890,"name":"Once on a windswept night","genre":"Casual","price":0.0,"description":"Once upon a time, a long, long time ago, there was a traveller...\nOur protagonist, a mysterious traveller, wanders the far-off land of Desservir searching for patrons to buy their wares.\nUpon hearing about a large annual market in the village of Castella, the traveller decides to set up a stall and try their luck.\nLife, however, is not so easy.\nAfter being double-crossed by a goblin and left in the middle of the cold, wet moors to die, the traveller almost gives up hope.\nThat is, until they stumble upon a mysterious church in the middle of nowhere, and meet the two nuns who attend to it.\nWhat are these two nuns doing on their own, and why is there such a melancholy atmosphere in the air?\nThe traveller has only one windswept night to uncover these mysteries and learn the truth.\nThis VN has choices and multiple branches\nThe script is around 40k\nSince it's a yurijam VN, it focuses on yuri (GxG) relationships\nIncludes lots of unfair achievements that are hard to get\nCustom sprites, backgrounds, and OST\nWritten by the author of Asphyxia, Strawberry Vinegar, and Emmeline Burns\nMost importantly of all, it's completely free!","imageUrl":"https://media.rawg.io/media/screenshots/19d/19da69bfb4b13294c60531a77c0179d6.jpg","releaseYear":2017,"developer":"ebi-hime","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13003,"name":"Leaving Lyndow","genre":"Adventure","price":0.0,"description":"Leaving Lyndow is a short, first-person exploration adventure game, set in the Eastshade universe.\nIt's Clara's last day on the island where she grew up. With high honors, she's graduated and fulfilled her childhood dream of joining the Guild of Maritime Exploration. She needs to complete preparations, visit her favorite places, and say her goodbyes - before leaving on a journey she may not return from. *Dangerous journey not included*Features    Leaving Lyndow is a peaceful experience, with a detailed environment to explore at your own pace.\nExamine objects to learn about the life and world of a young scientist preparing to leave home.\nPartake in mini-games that further reveal the story.\nSpeak with friends and family as they prepare for the departure of a loved one.\nShort and sweet: An experience that can be completed in one sitting.","imageUrl":"https://media.rawg.io/media/screenshots/42c/42c506512991e1ea99cca79180e8a134.jpg","releaseYear":2017,"developer":"Eastshade Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":868099,"name":"Nova Lands: Emilia's Mission","genre":"Adventure","price":0.0,"description":"Wishlist the main game!https://store.steampowered.com/app/1501610/Nova_Lands/\nJoin our Discord server!\nAbout the GameWelcome to your new home! Nova Lands: Emilia's Mission is a prologue chapter of a survivor you'll meet in the main game. Learn your way around Nova planet at a steady pace and discover the basics of resource gathering, automation, and survival.Build an awesome baseIn order to survive, you'll need to advance your technology, build processors, and automate your base. Thankfully, you've got a whole array of amazing helper bots that will speed the process and allow you to do something even more fun.\nExplore the islandsWith enough technology at your disposal, unlock new islands and gather new resources, meet new creatures, and connect the islands together for even more efficient production.\nMeet new friends!You are a guest to Nova, and it's up to you if you want to remind a kind visitor, or become an interloper. Creatures drop rare materials, but at the same time, if you like wildlife, you can skip combat entirely.","imageUrl":"https://media.rawg.io/media/screenshots/27b/27bf5aa654c73161e5defc9fa828641d.jpg","releaseYear":2022,"developer":"BEHEMUTT","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":558975,"name":"Splatoon 3","genre":"Action","price":0.0,"description":"Ink up the Splatlands in the next Splatoon™ game!\n\nEnter the Splatlands, a sun-scorched desert inhabited by battle-hardened Inklings and Octolings. Splatsville, the city of chaos, is the adrenaline-fueled heart of this dusty wasteland.\n\nEven in this desolate environment, Turf War* reigns supreme and battles rage in new stages located in the surrounding wilds.\n\nDynamic new moves help these fighters dodge attacks and cover more ground, along with a new bow-shaped weapon to sling ink. Stay tuned for more information to be revealed, as the Splatoon 3 game is scheduled to release for the Nintendo Switch™ system in 2022.  \n\n    Ink it up with a new entry in the Splatoon series\n    Discover the Splatlands, a new sun-soaked region with trendsetting inhabitants\n    Experiment with new styles for Inklings and Octolings\n    4v4 Turf Wars* are back, with new stages, new maneuvers, and new weapons","imageUrl":"https://media.rawg.io/media/games/360/360ac0a839ab0f0d9a70b35d38264cb0.jpg","releaseYear":2022,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":351787,"name":"Budget Cuts 2: Mission Insolvency","genre":"Action","price":0.0,"description":"You made it out of the TransCorp office alive, only to discover that more than menial office tasks have been taken over by robots. Is humanity being optimized out of existence altogether? Something needs to be done.\nBuilding on the aspects that made the first Budget Cuts such a beloved title, Budget Cuts 2 covers a great variety of scenarios, environments, puzzles and combat.\nBudget Cuts 2 is the conclusion of the adventure that you started in Budget Cuts, but is also a self-contained game and easy to get into. While you were hiding and narrowly escaped certain death in your familiar office environment in the first Budget Cuts, Budget Cuts 2 is all about charging into unknown territory and taking matters into your own hands.\nA multitude of new environments, new enemies, new gadgets and new types of challenges.\nThe sequel to one of the first and one of the most loved VR titles of this era.\nA delicious blend of dark and tongue-in-cheek humor, and tacos.\nCan be played with or without the first Budget Cuts.\nComing this year to an HMD near you!","imageUrl":"https://media.rawg.io/media/screenshots/940/9402eb4e26aa0eeca3a1eeaca511723b.jpg","releaseYear":2019,"developer":"Neat","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61232,"name":"Swarmlake","genre":"Action","price":0.0,"description":"Swarmlake is a challenging, small FPS about fighting 10,000 enemies at once with the only goal of beating your highscore.\nSimple: Collect shards from the ever-growing swarm to score\nVertical: Shoot into the ground or close enemies to fly skywards\nExplosive: Collide with pink bombs to take out all close enemies\nChallenging: All enemies as well as you are defeated in one hit\nHandcrafted: Custom-made optimized engine and original theme song\nIntense: Music visualization and 10,000 enemies in an infinite arena\nFun: Tight controls, instant action, fair enemies and no randomness","imageUrl":"https://media.rawg.io/media/screenshots/197/19795ccd6cfcbd7305b5ec9baf59fb18.jpg","releaseYear":2018,"developer":"Dominique Grieshofer","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53743,"name":"Castlevania III: Dracula's Curse","genre":"Action","price":0.0,"description":"Castlevania III: Dracula's Curse is the third Castlevania video game produced for the Nintendo Entertainment System. It was published by Konami in Japan in 1989, in North America in 1990, and in Europe in 1992. It was later released on the Wii Virtual Console in the PAL regions on October 31, 2008, in North America on January 12, 2009 and in Japan on April 21, 2009.\nThe plot of Castlevania III: Dracula's Curse is a prequel to the original Castlevania (much like the earlier Game Boy game Castlevania: The Adventure) set a few centuries before the events of the original game. The game's protagonist is Trevor C. Belmont, an ancestor of the original hero Simon Belmont.","imageUrl":"https://media.rawg.io/media/screenshots/522/5226ace83022aba21bb46b617fc33855.jpg","releaseYear":1989,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"}]},{"id":52055,"name":"Marco Polo","genre":"Action","price":0.0,"description":"MARCO POLO - The art of bargaining lies in knowing how far you can go. Fame, fortune and adventure lie ahead.\nDiscover the world of Marco Polo as you travel the legendary Silk Route from the Holy Land to China. Match yourself against the colorful underworld of the Middle Age marketplace where strategy and bargaining skills will guide you. Arms and merchandise are your wares, but secrets too, must be bartered.\nAs special messenger to the Pope or counselor to Kublai Khan, the Mongol emperor, you'll build your wealth and prestige by carrying out challenging missions. Knights will defend you, but thieves lie in wait. Experience your own epic adventure.\nFEATURES:\n• Multiplayer competition with up to four players.\n• Hours of gameplay with 63 towns to discover and 334 different trading missions.\n• 2000 digitized images and extensive video sequences chronicling life in the 13th Century.","imageUrl":"https://media.rawg.io/media/screenshots/5d6/5d634f359383742655694990f3e43c84.jpg","releaseYear":2018,"developer":"Infogrames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51066,"name":"Unforeseen Incidents","genre":"Adventure","price":0.0,"description":"Add to wishlistYou're welcome to add the game to your wishlist now and you'll be notified when it is released.\nAbout the GameUnforeseen Incidents is a classical style interactive mystery set in a beautifully hand-painted world. When small-town handyman Harper Pendrell meets a dying woman in the street, he unwittingly stumbles into a diabolical conspiracy – a mystery only he can solve. An unknown disease is spreading across the country, and between them a scientist, a reporter and a reclusive artist hold the key to stopping it. A perilous journey awaits, and every step brings Harper closer to a cabal of dangerous fanatics. Before he knows it, he finds himself in a fight for the future of humankind armed only with his trusty multi-tool.\nCan Harper find the courage to expose the truth and prevent an epidemic, even if it means succumbing to contagion himself? Join Harper and experience a challenging investigation, smart dialog and a rich cast of characters in this thrilling new adventure game from Backwoods Entertainment and Application Systems Heidelberg.FeaturesUncover and solve the dark mysteries behind the ongoing catastrophe and try and save the human race!\nExplore plenty of intriguing locations with challenging puzzles\nListen to an elaborately arranged soundtrack and full English or German voice acting\nEnjoy a classical style mystery adventure game\nBehold beautiful, lovingly hand-painted 2D graphics with over 60 backgroundsMeet lots of interesting characters","imageUrl":"https://media.rawg.io/media/screenshots/e7a/e7ae079ac0bd68b5978754172d135029.jpg","releaseYear":2018,"developer":"Application Systems Heidelberg Software","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":50178,"name":"ZULA Latinoamérica","genre":"Action","price":0.0,"description":"Zula is a first person shooter free-to-play where you will discover different real-world scenarios such as Paris, Battle of Gallipoli (World War 1), Northern Iraq, among others, with a wide variety of maps to enjoy, each with different playstyle.\nAs a player you can support two different sides: if you choose to go on the side of ZULA then you will be supporting Demir's revenge through the mafia, on the contrary if you choose to be a Gladio, you will be in favor of the mercenary forces that have infiltrated in almost all the military services of the world.\nYou can participate in different game modes, including DeathMatch, Capture the Flag, Escort (special mode with tanks of war), and many more!\nYou will receive gifts every day in your account and you will be able to enjoy exclusive events in game, you can also participate in special missions that will allow you to obtain rewards.\nIf you are a competitive player, our official E-Sports team manages hundreds of tournaments a year with prizes in dollars for the most ambitious player.","imageUrl":"https://media.rawg.io/media/screenshots/f13/f139c1276b4e7baaaa2620dd23f3fa9b.jpg","releaseYear":2017,"developer":"MadByte","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46393,"name":"Idle Bouncer","genre":"Strategy","price":0.0,"description":"Bounce the ball to generate energy each time it bounces off the ground - the higher it jumps, the more energy it generates. Buy new balls, upgrade energy amplifiers, size, height and the other things to generate more and more energy.\nOnce your balls energy empire generates enough energy, you will be able to exchange it for powerful meta-energy. You will lose all your balls and energy upgrades, but you can change the world by increasing gravity, density and the other things to speed up your run.\nMake the balls jump, upgrade and change the world! Drop the balls to generate energy with each bounce. Upgrade available balls and buy new ones to generate even more energy. Sell your balls empire to get meta-energy to change the world!","imageUrl":"https://media.rawg.io/media/screenshots/760/760964af6728e2a84a51369b2cbf4d14.jpg","releaseYear":2017,"developer":"Upturn Games","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":44929,"name":"Lost Technology","genre":"Simulation","price":0.0,"description":"Story\nWar...\nNo one knows when or how it started.\nIn the lands controlled by humans, one fights in the name of peace and justice, one battles for no reason other than to fight, one battles out of greed, to gain more land, and like this, they all faded in the fighting.\nThe victor edits history to put them in a favorable light, and removes anything that they deem unflattering...\nAs a result, humanity has lost many things to the wars.\nTerritory, technology, and their true history...\nNow there's not a single country that’s lasted more than 50 years...DescriptionLost Technology is a real-time-strategy (RTS) siege game.\nThe game is centred around three major phases:\nPhase One: Turn-Based War Strategy\nRecruit units, and build your army. Find those who will fight for you, command their movements and formation to smoothly prepare to assault your enemy’s territories, or being diplomacy to build peaceful and prosperous relations.\nPhase Two: Real-Time Battle\nCo-ordinate your army and navigate them through the battle field. With a variety of terrains, attacks and formations, utilize them all to overpower and defeat your enemy.\nPhase Three: Story Event\nPlay through scenarios, each triggered by special events within the game. Your choices and interactions here will affect your strategy and progression.\n\nYou must take control of all territories to complete the game.The WorldAt a glance, the world of Lost Technology appears to resemble the Middle Ages, as well as a fantasy setting.\nHowever, civilization had once exceeded our current level of scientific advancement.\nThis drastic difference in advancement is due to the decaying effects of ongoing war. What remains in the game is the world experienced by the player.\nLong ago when the realms were undivided, there existed incredibly advanced technology that we could not even imagine.\n\nThis technology would be:\n\"Weaponry\", \"Ideology\", \"Appliances\", \"Theory\", \"Manufacture\", \"Speech\", \"Craft\", \"Knowledge\", \"Study\" and \"Law\"...\nA wide range of fields that were developed over long periods of history.\n\nHowever, most of this has now been lost through the endless wars.\nThe player's mission is to choose a single power and bring an end to the wars, once again creating a world of peace.Game Structure\nTurn-Based War Strategy Phase\nReal-Time Battle Phase\nStory Event PhaseWar Strategy Phase (Turn-Based)\nForm your squad\nAssemble your ideal team of warriors.\nAttack\nOnce prepared, move to attack the enemy region.\nRecruit troops\nRecruit standard troops and strengthen your army.\nRecruit comrades\nYou can recruit powerful comrades in your region.\nDiplomacy\nDeepen your bonds with those you would rather not fight.Battle Phase (Real-Time)\nMove your army into battle.\nCommand your army into various formations.\nLead your solders into battle with a variety of attacks.Many components are automatic, allowing for a good flow and making each engagement short and satisfying.Event phase\nThere are various factors which can trigger the event phase.\nYou increased your territory.\nYou befriended a specific comrade.\nYour territory borders another country.\nYou destroyed another country.\nYou met a certain comrade on the battlefield.The event will display story text with occasional choices to be made by the player.FeaturesOver 100 comrade units (generals) with their own beautiful illustrations by Agahari!\nCarefully chosen music samples, as well as compositions from the legendary Cranky!The differences between the Japanese and English versions This is a game has a large amount of story text for each playable faction. Ideally we would like to provide fully localized versions for each respective faction, however, the size and scale of the game meant that a full localization would be extremely difficult to provide all at once, and so only the three factions known as the Reinald Empire, Makan, and Álfheim are included in the English release.\nIt is possible to start with any of the other playable factions, but story events will not occur and only the simulation part of the game may be played.\nThe Japanese version still contains the currently available free version, all of the basic functions without changes, and all factions are included in full right off the bat.\n(Still, a mod function is removed from the build due to the copyright issue.)\nHowever, it will be distributed as a paid title due to adjustments made specifically for Steam and the addition of trading cards, etc.\nWe currently plan to look carefully at how this title sells (including sales within Japan) and will proceed with the localization of the remaining factions in accordance with the sales numbers. The remaining factions are set to be distributed as additional DLC in the future. Please stay tuned for more news regarding further details.\nWith your support, we hope to provide players with Lost Technology in its full glory!Developer's Voice- Developer: CB-SXF6\nWe’ve finally managed to make our way up to release.\nWe’ve come quite a long way in the two-plus years since PLAYISM first reached out to us on March 16th, 2015.\nLost Technology is an appropriation of a game program called Vahrenturga.\nVahrenturga was the winner of the 2009 game contest held by the major Japanese free game posting site Freem!, and boasts over 200,000 downloads.\nI became obsessed with this game and spent an immeasurable amount of time playing it before subsequently becoming obsessed with creating mods, and then finally using the game system to create my own original title.\nThat title is Lost Technology.\nTherefore, this program wasn’t created by our team, and the cooperation of the creator of the original game “Nanaashi”, was absolutely necessary for us to be able to release Lost Technology overseas.\nNanaashi was extremely happy to hear about our plans for an English version, and I myself was a huge fan of Vahrenturga, so I did everything in my power to ensure that this game could be released.\nIn Japanese, kanji characters can be utilized to shorten all sorts of texts, but that’s not possible in English.\nThere are some parts in which the text simply could not be made shorter.\nDue to this, we often had issues with the game screen requiring tweaking in order to keep all of the necessary text visible and in place. Each time this occurred, Nanaashi helped immensely by accepting our requests for the required tweaks and adjustments. Furthermore, we also had some very serious problems with differences in non-Japanese OS text encoding, and these problems became so serious at one point that we actually came close to giving up on the release altogether.\nHowever, Nanaashi was somehow able to figure out and solve the source of these problems, allowing us to finally bring the game to release. I honestly cannot thank Nanaashi enough.\nTo all of our overseas players who enjoy Lost Technology:\nI would be enthralled if all of you would check out and play Vahrenturga as well since it's game program can be used freely, so as long as you have the various materials in place, you, too, can make your very own original strategy SLG on the same game system.\n- \"Vahrenturga\" developer: Nanaashi\nCongratulations on the release of the English version of Lost Technology.\nAs the creator of the original, I am truly honored to have Vahrenturga used as the base system for this expansive strategy-simulation title featuring beautiful illustrations, music, and voice work.\nThank you very much.Frequently Asked QuestionsQ\t What is the purpose of the \"Watch\" mode?\n\"Watch\" mode is a feature that is not essential but better to have than not.\nWhen playing story mode or free mode, you can make the important decisions for your faction and then let the rest play out automatically, which is convenient.\n\nQ\tI couldn't beat the game in \"Watch\" mode, even though I unified all the nations...\nSeveral factions have hidden dungeons, which you need to search using the \"Find\" option. However, \"Find\" cannot be used while in \"Watch\" mode, so even when you have unified the nations the game will not register as complete.\nQ\t Is there one story for each faction?\nSo far, yes. But there is a secret story for one of the factions...\nQ\t A character from the story is currently roaming... isn't that odd?\nInitial members of your faction and units who join as part of the story will continue to be present in the story, even if they are released from service.\nChanging this would affect the flow of events and make it possible to unify all the nations without seeing the ending.\nQ\t Could I make a Let's Play of this and share it publicly?\nYes, please feel free.\nYou do not need to worry about revealing spoilers.\nHowever, please refrain from making videos designed to slander this game.\nQ\t Is it OK to make fan content based on this game?\nYes, please feel free.\nHowever, graphic/sexual content is restricted to locations for people of 18 years and over. It may not be shared in locations accessible to all ages.","imageUrl":"https://media.rawg.io/media/screenshots/275/275bc9cb89c1c17a2814ff2dc3af57e8.jpg","releaseYear":2017,"developer":"Studio 4D","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44363,"name":"Rogue Trooper Redux","genre":"Action","price":0.0,"description":"A pioneering tactical shooter and landmark comic book adaptation,  Rogue Trooper is back, remastered and revitalised in true high definition.\nExperience acclaimed combat and explosive third person action in this BAFTA-nominated tale of betrayal and revenge at the far reaches of the galaxy.\nYou are the last Genetic Infantryman (GI). Bred for war and betrayed by your superiors at the Quartz Zone massacre, you stalk the battlefield as a one-man squad, carrying the sentient biochips of three fallen soldiers in your rifle, pack and helmet.\nYour mission? Fight your way across the chemical-blasted wastes of Nu-Earth - a planet ravaged by an endless apocalyptic war – in search of the Traitor General… and payback!\nROGUE, REMASTERED\nA classic returns with HD graphics, remodelled assets, dynamic lighting, enhanced geometry, new special effects and more. New features also include modern controls, extra difficulty settings and a revamped cover system.\nACCLAIMED CAMPAIGN\nFight through 13 expansive missions in a diverse campaign penned by famed writer Gordon Rennie. Battle the insidious Nort regime across iconic locations from the Rogue Trooper comic including the Quartz Zone, Petrified Forest and Harpo’s Ferry.\nCUTTING-EDGE COMBAT\nExperience Rogue Trooper’s timeless blend of stealth-action gameplay, cover-based combat and epic set-pieces. Tackle objectives your way as you cut a swathe through Nort footsoldiers and vehicles with Lazookas, explosives, turrets and more.\nENHANCED ABILITIES\nYour biochips aren’t just there for conversation, they are your tactical edge! Gunnar turns your rifle into a sentry gun and boosts your accuracy under fire. Helm offers tactical advice and distracts enemies. Bagman can manufacture custom ammo, salvage parts, upgrade weapons and even lay minefields!\nONLINE CO-OP\nTest your mettle in online co-op for 2-4 players and relive the events leading up to the main campaign. Defend your position against incoming waves of deadly Norts in ‘Strongold’, or fight your way to safety in ‘Progressive’ mode!","imageUrl":"https://media.rawg.io/media/screenshots/d7e/d7e31731e32c00353451347e0b82ff5b.jpg","releaseYear":2017,"developer":"Rebellion","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":43857,"name":"HYPERCHARGE: Unboxed","genre":"Action","price":0.0,"description":"UPDATE 02 - MAJOR CHANGES TO CORE GAMEPLAY\nWe've listened to your feedback and implemented the most requested features asked for. Please view the full Change Log  to see all of the changes.\nNEW PLACEMENT SYSTEM: More freedom to build. You are no longer limited to set positions when it comes to placing your defences. Within the grid, players can now place their turrets and traps almost anywhere on the floor.NEW ENEMIES:Watch out for those Helicopters that drop deadly bombs on top of you. Be also vigilant as the Army Man Jeep has a powerful .50 Cal Machine Gun and is ready to destroy you!NEW UPGRADE SYSTEM FOR TURRETS: You can now upgrade your Turrets with the credits earned by surviving waves and destroying enemies.NEW TRAPS:Damage and slow down your enemies by placing devastating traps that will help you survive each wave.NEW LOADOUT SYSTEM:Players can now benefit from the improved loadout system while being able to choose from any 3 buildables they like.\nIt doesn't end here. We are developing the game with our community and can't wait to show you what's on the shelf for our next update.\nAbout the Game\nHYPERCHARGE: Unboxed pits up to 4 of your friends against relentless waves of enemies in a CO-OP experience. As the enemy become stronger, can you handle the pressure of each wave? Work as a team to build your defenses and expand your base. Increase your chances of survival by gathering Batteries and maintain power to your defenses.We are always listening to your feedback. Please take a look at our forums and let us know how we can make the game better for you.\n1-4 player online & local co-op\nFortify and defend against hordes of enemies\n11 unique enemy types\nNo elephants\nOver 100 cosmetic options\n4 maps, 5 weapons\nFight off weaponised toys that will swarm your base with the sole intent of wanting to destroy the Core. Use teamwork and choose your weapon!\nAssemble barricades, fences and use traps to slow down the enemy. Construct a selection of devastating turrets that are suited for different occasions.\nSwarms of enemies begin to overwhelm you. Stop them from breaching your base and protect the Core.\n\nSooner or later your defenses will run out of power. It’s up to you to maintain and supply power to them. How long can you and your allies survive?\nFrom all of us at Digital Cybercherries we are so thankful for your support and appreciate the feedback you give us. Keep being awesome and we'll see you in game!","imageUrl":"https://media.rawg.io/media/screenshots/bfc/bfcc9545a182d25d6bc1f438c23d7c74.jpg","releaseYear":2017,"developer":"Digital Cybercherries","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":31309,"name":"Worms World Party","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/385/38595c76447f64a1d8afc9d92fa31aa8.jpg","releaseYear":2001,"developer":"Team17 Digital","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"}]},{"id":30584,"name":"Unreal Tournament 2003","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/3e8/3e8a4f80ff655c0321f34a064095d1e3.jpg","releaseYear":2002,"developer":"Digital Extremes","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":24916,"name":"Madden NFL 07","genre":"Sports","price":0.0,"description":"Get under center and drive for the goal line. Tear up the field like\nnever before with the Wii-exclusive FreeMotion controls that put players\nin command.\n\nFeatures\n\n• New FreeMotion control: Intuitive new Madden control for the Wii adds\nnew levels of gameplay depth. Throw like the pros do, as well as hike,\ncatch, juke and stiff arm.\n• Exclusive multiplayer mini-games:\nWii-Only Mini Games designed to support four player gameplay. \"2 on 2\"\nbrings back school yard football but using NFL players, Y.A.C Attack\nmakes the action 3 on 1 as each player gets a shot at QB versus 3\ndefenders. Kicking Combine gives you a fast paced FreeMotion field goal\nkicking challenge\n• New Wii multiplayer enhancements: Wii only\nMultplayer enhancements increase the fun factor for up to four players.\nMultiplayer Sprint allows users help a teammate by boosting sprint speed\nand players can control the wind in Kicking Combine.\n• New play\ncalling system designed for basic football fan knowledge: Simplified\nfootball play calls makes the game easy to pick up and play. Pick plays\nby play type using basic tactics of football like short pass or outside\nrun. More advanced Madden fans can still use the full NFL playbooks like\nany other version of Madden.\n• Madden in-game tutorials: New in-game\ntutorials teach users how to use new FreeMotion controls and allow users\nto practice within the game.\n\nThe game may be the same brand of excellent Madden NFL football you're\nused to, but the playing field is very different.\n\nWith the new FreeMotion controls, Madden NFL 07 successfully\nincorporates the flick of the wrist in addition to the push of a button.\nNow to pass the ball, players flick the controller forward. The faster\nthe flick, the faster the pass. Slow flicks generate a long pass to give\nthe receiver time to get under the ball. Jukes are now controlled by\nmoving the Nunchuk controller left or right. Gamers generate a stiff are\nby moving the Wii Remote controller right or left.\n\nThose who have played previous versions of the Madden NFL franchise will\ncertainly know the gameplay mechanics, from defensive line shifts to\noffensive hot routes. The key to being successful at Madden NFL 07 for\nWii is to trust your instincts rather than reacting with buttons.\n\nPassing, for one, is a test of touch. How fast or how hard should you\nthrow that pass? In your playbook, each available receiver is designated\nby a direction on the Control Pad. To pass to this receiver during the\nplay, you simply press the Control Pad direction and flick the Remote to\npass. Each play has a preferred receiver for whom the play is designed.\nTo pass to him, all you need to do is flick the Remote, no accompanying\ndirection necessary.\n\nThe running game is where FreeMotion control shines, mostly because\nrushing the ball is truly a test of anticipation, reaction and power. As\nyou run, you can see what tacklers stand in your way. Once they're close\nenough, that's when you react, whether you juke or blast them with a\nstiff arm. Once they think they have you wrapped up, sometimes you've\ngiven the chance to power through them by pushing both controllers\nforward. There's something extremely satisfying about physically\nplanting a stiff arm in someone's facemask. You can't get that in any\nother football game.\n\nDefense also gets a FreeMotion upgrade as pushing the controllers\nforward can help you deliver the big hit. When you're playing in the\nsecondary, flicking the remote will give your defender a chance to swat\nat the ball. It's this level of integration that really revolutionizes\nMadden NFL 07 without forsaking the gameplay elements gamers have come\naccustomed to.\n\nBottom Line\nThe football franchise dives into the end zone and\nscores with a motion system that gets gamers in the game without going\nover the top.\n","imageUrl":"https://media.rawg.io/media/screenshots/c6b/c6b966383bd772c6a964b355e1c1acf5.jpg","releaseYear":2006,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":23005,"name":"Zak McKracken and the Alien Mindbenders","genre":"Adventure","price":0.0,"description":"It's 1997, and the world is a dumber place than ever... Space Aliens have built a stupidity machine that's slowly reducing everyone's IQ to single digits. Worse yet, the only person who can stop them is Zak McKracken, reporter for the disreputable National Inquisitor, who dreams up stories about carnivorous cantaloupes and vegetarian vampires.\nThey've taken over the phone company... Sure, it sounds like another one of Zak's tabloid fantasies. But while most people wouldn't believe him, he finds three who don't need convincing--Annie, Head of the Society of Ancient Wisdom, and her friends, Leslie and Melissa, two Yale coeds who traveled to Mars in their modified van. The four of them must piece together fragments of an ancient puzzle, unmask the aliens, and destroy the stupidity machine.\nZak McKracken and the Alien Mindbenders is a classic point-and-click adventure with four controllable characters. Solve puzzles and interact with the crazy world using the old school verb command interface. Go on adventures all across the globe and even into space. If you're looking for an actual globe-trotting adventure from days gone by, you cannot miss with Zak McKracken and the Alien Mindbenders!\n• Crazy off-the-wall humor.\n• Beautiful late 80s pixel graphics, perfect for any retro gamer!\n• Challenging, mind-bending mystery!\n• No typing required! Just point-and-click to solve puzzles and talk to the crazy characters that live in Zak's world!\n• This game is powered by ScummVM.","imageUrl":"https://media.rawg.io/media/screenshots/590/590c79474dc9fe2ecdd12a468c209f59_db26Na1.jpg","releaseYear":1988,"developer":"LucasArts Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22020,"name":"Blossoms Bloom Brightest","genre":"Adventure","price":0.0,"description":"A mysterious journey lies ahead of them; what misadventures will they experience over the next two weeks?\r\n\r\nFEATURES: Two to three hours of gameplay\r\nTwo routes\r\nFour endings\r\nFour CGs\r\nPartial voice acting","imageUrl":"https://media.rawg.io/media/screenshots/622/6224b079648d9dbf7f20a819ea682001.jpg","releaseYear":2017,"developer":"Reine Works","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20941,"name":"Breakout Invaders","genre":"Action","price":0.0,"description":"\"Breakout Invaders\" is a fun fusion between two classic game genres: \"Breakout\" and \"Space Invaders\". Play through 100 variety levels, with a lot of original game styles. Defeat the space invasion destroying enemies and blocks structures like castles, temples, towers, cities, cemeteries, cathedrals,... You can customize and improve your ships, collect the enhancers items, fight again final bosses and much more.","imageUrl":"https://media.rawg.io/media/screenshots/1cf/1cf73a4cdce392b18ccd3a1fe24519bc.jpg","releaseYear":2015,"developer":"DreamsSoftGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20823,"name":"Monopoly","genre":"Strategy","price":0.0,"description":"Own it all in the classic property trading game!\nBuild your fortune as you buy, sell and trade the world’s most famous properties. It’s classic MONOPOLY fun!\nTake a ride on Reading Railroad, build a house on Baltic Avenue, or buy up the whole neighborhood — it’s your turn to get rich! You’ll take a spin around the world’s favorite board with animated tokens, 3-D dice and customized game environments. Prove your skills as a deal maker in up to three levels of difficulty. Pass GO, take a Chance or head over to Community Chest as you wheel and deal your way to the top. But remember to stay out of Jail! Are you ready to own it all?\nFeatures:\nEnjoy classic MONOPOLY play\nBuy, sell, trade and manage famous properties\nPlay with animated tokens, 3-D dice and customized game backgrounds\nChoose from 3 levels of difficulty\nExplore “House Rules” to play with a twist\nNote: Multi-player is hot-seat multi-player only.  Online multi-player is not supported.","imageUrl":"https://media.rawg.io/media/screenshots/1f0/1f01a10e38da349d95258a768e076910.jpg","releaseYear":2008,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"}]},{"id":20232,"name":"Alum","genre":"Adventure","price":0.0,"description":"Guide Alum on his spiritual journey through the dangerous, icy, \"Land of Tide\". Help him discover the truth about his city, Kosmos, and the mysterious epidemic known as \"The Vague\". As the tale unfolds, it will keep you enthralled all the way up to its epic conclusion.\nAlum is an original point-and-click adventure game. It has the nostalgic feel of classics (90's Lucasarts, Sierra games) mixed with modern game-play elements and pacing that caters more towards this generation. The world, story, and characters lean towards a RPG-esque style, while the game-play mechanics and puzzles stay true to the classic point-and-click genre.\n- Features -\n* Full length game (roughly 7-10 hours of gameplay)\n* Over 70 hand-drawn backgrounds - Including a map screen to travel across the \"Land of Tide\"\n* All original soundtrack (live recorded instruments mixed with electronic elements)\n* Intuitive puzzles that are logical, balanced, and rewarding (no pixel hunting)\n* Full voice acting\n* Gratifying frame by frame animations\n* Retro classic resolution","imageUrl":"https://media.rawg.io/media/screenshots/fa0/fa014c7ed4aaebcafa6f237543ec23bb.jpg","releaseYear":2015,"developer":"Crashable Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19434,"name":"Sunset","genre":"Action","price":0.0,"description":"Roadmap\nWorld premiere of Sunset's Tech Demo at Milan Games Week 2021;\nSteam page creation;\n2k wishlists: Steam Playtest activation;\n5k wishlists: Open beta testing;\n8k wishlists: Full Demo;\n10k wishlists: Early Access;\nMore to come;\nAbout the Game\nSunset is a Sci-Fi TPS set in a near future where space exploration has brought humans to colonize new planets in search of the resources depleted on Earth. Ten light-years away, as one of Earth's main Space Stations approaches Dracon Ismenios' orbit, attracted by signals of a high density of precious minerals, a group of space mercenaries known as Nortens attacks the colony, taking the surviving crew hostage. During a training session on Earth’s International Army's basecamp you receive the S.O.S. from the Station and, against your superiors' orders, you immediately steal a spaceship and embark on a solitary journey to save the survivors, knowing that among them is your son. When your spaceship gets damaged and falls on Dracon Ismenios, your mission will be to find a way back, before it is too late.KEY FEATURESExplore the breathtaking sceneries of an alien planet filled with beauty and danger, on a quest to repair your spaceship and save your son. Discover the hidden mysteries of Dracon Ismenios while fighting with the Nortens, mining cinnabar to recharge your weapons and trading with the Merchant, the only person on the planet willing to sell you pieces of your spaceship.A NEW SHOOTING EXPERIENCE\nShooting, mining, and using your Division’s special tools, all the major gameplay dynamics will be available thanks to your solar powered backpack. Remember to charge it any chance you get or you’d better find somewhere to hide!\nAll the relevant information will be displayed through diegetic objects, no HUD will ruin your immersion in the game.YOUR GAMEPLAY\nThe Division you’ll choose at the beginning of the game will determine your equipment, and special abilities. It will be up to you to find your own unique way to play Sunset. Become the best soldier of the planet by engaging in fast-paced battles or skillfully avoid combat to save more cinnabar and use it to personalize your character or trade objects with the Merchant, the fate of this journey is in your hands.DISCOVER DRACON ISMENIOS\nDiscover the untouched landscapes of Dracon Ismenios, with its rich and varied biomes and the many challenges they hide. Find your own way to interact with native creatures, natural events and the unique geography of each sector, adapting your playing style and strategic thinking to each location.BOSS & EVENTS\nEvery sector has its own boss fight that you need to complete to unlock new sectors of the map. Inside the game many randomly spawned events will happen, making your experience of a sector different every time.  Every few months, organized events like treasure hunts will also give the players the chance to discover the hidden mysteries of Dracon Ismenios, while chasing ancient alien artifacts and deciphering complex riddles.RANKING & REWARDS\nBringing cinnabar back to your basecamp will allow you to upgrade your ranking in your Division and unlock new skins, helms and vehicles on the in-game shop. Don’t worry, the only values required here are cinnabar, cinnabar and more cinnabar.CREATED WITH UNREAL® ENGINE 4Sunset is being created using Unreal® Engine 4 to deliver the best interactive experience possible.","imageUrl":"https://media.rawg.io/media/screenshots/a46/a464aca4b8ab708d9a21565e65e7823c.jpg","releaseYear":2015,"developer":"Tale of Tales","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15446,"name":"Zeus + Poseidon","genre":"Strategy","price":0.0,"description":"Start with a plot of land by the shores of the wine-dark Aegean and create a thriving city-state of your own design.  Build roads and monuments, set taxes, control trade, and command armies on land and sea.  Construct massive sanctuaries, a stadium for the Games, even an Atlantean pyramid.  Build armies and fleets to battle neighbors on land and sea.  Succeed, and make them your vassals.  Fail, and you'll be forced to play tribute until you win back your freedom.  Rule the legendary world of Atlantis.  Mine orichalc, and make use of unique buildings like bibliotheques and observatories.\nAcropolis’ delivers the city-building excitement and strategy of both Zeus’ Master of Olympus’ and Zeus’ Official Expansion Poseidon’.  Build great empires, dabble in combat, trade, and politics, and keep monsters like Medusa at bay with the help of great heroes from mythology.  Establish new colonies in the ancient Americas, Africa, Europe, and Asia.  Create your own adventures with a powerful yet easy to use Adventure Editor.\nYou’ll create bustling cities filled with thousands of citizens in mythological Greece and the lost continent of Atlantis.  Exercise your might by threatening neighboring cities with invasion, or cultivate them as allies against even stronger opponents.  Build beautiful Greek sanctuaries and Atlantean pyramids piece by piece.  Summon heroes to rid your town of plagues and monsters, or appease gods and goddesses to protect you from evil.\nAcropolis’ delivers hundreds of hours of gameplay in one game!\nOne of the best city builder games out there, made by a team of experts in the genre: Impressions Games.\nDiplomacy, war, economy, and logistics - you must master all these arts to ensure your victory.\n65 episodes in which you build and rule seven city-states and two powerful civilizations: Ancient Greece and Atlantis.","imageUrl":"https://media.rawg.io/media/screenshots/eb1/eb1139fabc279c9d86696bfbd26c20b8.jpg","releaseYear":2016,"developer":"Impressions Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15021,"name":"Super Blood Hockey","genre":"Sports","price":0.0,"description":"ARCADE-STYLE HOCKEY ACTION! Travel back to a time when sports games were all about the action. Customize your lineup and use superior skating, positioning, strategy and violence to assert your dominance on the ice.\nCRUNCHY RETRO PIXELATED GORE! Experience brutality on ice like you've never witnessed before: blood splattering collisions, brain-scrambling head injuries, bloody vomiting spells and violent seizures.\nMIND MELTING CHIPTUNE SOUNDTRACK! Enjoy the driving retro beats of an original soundtrack by chiptunist Shawn Daley.\n4-PLAYER LOCAL MULTIPLAYER! Paint the ice with the blood of your friends!\nGLOBAL SHOWDOWN! Take on the world in a global ice hockey tournament. Failure to secure victory for your nation could result in your execution.\nCHALLENGE MODE! Conquer a variety of difficult challenges (4 vs. 8, manual goalie control, etc.) and fun scenarios (12 vs 12 Mega Rumble, Turbo Mode, etc.).\nCONTINUED DEVELOPMENT! The release is not the end! Voice your opinion in the discussion forum and tell me what else you would like to see in the game!\n*For the best experience a gamepad is highly recommended (e.g. Steam Controller, Xbox 360, Xbox One, Playstation + many others will work with emulation) - The game can also be played with only a keyboard.\nMade in Finland\nTehty Suomessa","imageUrl":"https://media.rawg.io/media/screenshots/257/25767746d29c7c05110f294d6253958d.jpg","releaseYear":2017,"developer":"Digerati Distribution","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":14555,"name":"Skilltree Saga","genre":"Action","price":0.0,"description":"Skilltree Saga is the first Rogue-like RPG set in Aventuria - the world of The Dark Eye. Choose to play as human, elf or dwarf and battle randomly generated opponents in over 100 stages, developing a set of magical, enhanceable skills.\nStory\nA sinister army of orks and goblins led by the Dark Ruler Sargul are besieging the city of Griffinsford. To make matters worse, your beloved, the daughter of Baron Griffontrue, was abducted, and you desperately take up pursuit. When ambushed by goblins, you are saved by a master of the mysterious Elemental Knights. You are given the rare opportunity to become part of this elite and ancient hidden order. After intensive crash course training, it is up to you to defeat the sinister horde that threatens to overrun the land.\nMotivating Rogue-like Elements\nRandomly generated monsters and treasure await the brave Elemental Knight in the margravate of Griffinsford. Defeat enemies and gather from a wide variety of equipment, which you must don to enhance attributes like Strength, Cleverness or Constitution. In the market you can trade equipment and purchase provisions. Use diamonds to purchase rare astral and healing potions to replensih your Astral Energy and health.\nRound-based Duelling\n\nCareful consideration is mandatory when facing the minions of Sargul! Choose from a variety of skills, damage your enemy with wind and water magic or force them to their knees with powerful fire spells. Learn and upgrade your skills. You will need them! So too, your enemies will strike at you with magical skills of their own. Fire will burn your skin, ice chill your bones. Other skills will enfeeble your senses or rain death down upon you.\nSkilltree with numerous spells of the Elemental Knights\nYou start as an unknown adventurer of either human, elf or dwarf origin. In your conflicts against dangerous monsters, you will earn experience to increase your power steadily. Through level ups you will earn Adventure Points, which can be used to enhance your skills and learn new spells.\nOver 100 levels of challenging dungeons. Rogue-style!\n\nChoose from several dungeons to challenge and master. Hidden within you will encounter deadly creatures, chests filled with treasure or fountains of healing. You may come across a shady but neutral goblin merchant, who will offer to sell you items and equipment on your journey. Fall to a dungeon's dangers and you will be forces to begin anew, but with the experience earned in your attempt. Only the most bravest and strongest will face and conquer the more difficult dungeon bosses, and lend immortality to their name in the hall of heroes!\n\"The Dark Eye\" is published under the license of Chromatrix GmbH. \"Das Schwarze Auge\" is a registered trademark of Significant Fantasy Medienrechte GbR.","imageUrl":"https://media.rawg.io/media/screenshots/620/620f8cc4505c9b8e05d2eaff00a273ee.jpg","releaseYear":2014,"developer":"Headup Games","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":13130,"name":"Vintage VR","genre":"Casual","price":0.0,"description":"In the 19th century, when people had no HTC Vives to play with, they resorted to using primitive stereoscopes to see stereoscopic images in 3D!  This free VR experience allows you to view a collection of over 700 such images from that era and enjoy them as people saw them over a century ago, using your VR headset.  Stand atop the pyramids, view the battlefields of France in WWI, go alligator hunting, and see the world as people once did from the comfort of their Victorian homes!\nThe VR experience is set in a single room, decorated to look like one you might find in the Victorian era.  But the focus of the game is not the room, it is the old photographs, which have been carefully selected for the best 3D effect.  Use the trigger of your Vive controllers to move between images, giving your eyes time to adjust and focus between each image.  These photos are from the late 19th and early 20th century, when stereographic capture was rather crude and done with bulky cameras, so viewing these images will probably not be as comfortable for your eyes as modern stereo images typically are.\nThis game is being made available free to help promote VR adoption as well as to allow people to learn more about this remarkable art form that led to the development of the virtual reality headsets we enjoy today.","imageUrl":"https://media.rawg.io/media/screenshots/358/358463cbe6c2b7f11aca0924966f2e9c.jpg","releaseYear":2016,"developer":"Dunderware","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13017,"name":"Shadow Ops: Red Mercury","genre":"Action","price":0.0,"description":"Race against time and terrorism as a member of the elite counter terrorist team in this all-out first person shooter. From the hostile streets of the middle-east, where danger can come from any direction, to the landmarks of a major European city. Your duty is to hunt down a terrorist overlord carrying a nuclear device before untold disaster is unleashed. Mix all-out assault with stealth infiltration in your mission to prevent disaster.Features: Exciting mix of all-out assault with stealth and infiltration\nPlay as a Delta Force operative trying to keep a nuclear accelerant out of terrorist hands\nMore than 20 authentic general military and special forces weapons\nFight alongside (and sometimes against) international special forces from the United States, the United Kingdom, Russia, France, and Germany","imageUrl":"https://media.rawg.io/media/screenshots/470/4707a158debd22e1b0f8808a8ca8c871.jpg","releaseYear":2004,"developer":"Zombie Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11404,"name":"The Fall of the Dungeon Guardians","genre":"RPG","price":0.0,"description":"Introduction :\nThe Fall of the Dungeon Guardians is an RPG Dungeon Crawler game, in First Person View, inspired by classics like Dungeon Master™ and Might & Magic®, but featuring a modern tactical combat based on the triptych “tank/damage dealer/healer” mechanism coupled with the threat & aggro system and an active pause. Story :\nYou’re a newly employed guard of a prison deep inside a dungeon. The night of your arrival, strange things happen and when you wake up in the morning, all prisoners have escaped amidst chaos. The warden wisely decides to leave the dungeon as quickly as possible, while tasking you to run after the escaping prisoners. You then assemble your team and venture into the mysterious dungeon. A Call For Adventure :\nEnter a big, massive dungeon, full of danger, mystery and secrets.\nFight your way through hordes of enemies and powerful creatures.\nExplore intricate corridors, underground palaces, mines fallen into oblivion and evil crypts.\nSolve puzzles, avoid deadly traps, uncover hidden passages, and keep your bearing through mazes & hallways. Character Building :\nYou’ll take command of a party of 4 guardians. Each guardian comes with a set of spells & abilities, with new ones appearing over the course of the adventure.\nFor each new level reached, the guardians get a point to use in their talent trees, allowing them to reinforce their abilities or gain new powers.\nThere are 4 classes to choose from: the warrior, the healer, the mage & the rogue. Each class has 3 specializations represented by a talent tree, and each specialization comes with its own set of abilities. So you have 12 base build-ups. In addition, your guardians can choose freely to spend their talent points in any of the 3 specializations of their class, allowing for even more varied set-ups.\nThe dungeon is filled with loot: epic armors, legendary weapons and mystical, magical items. Often when you kill a group of enemies, they’ll drop a random piece of equipment that one of your guardians can use, raising more and more of their powers. Evolved Combat System :\nThe combat is focused on the triptych “tank/damage dealer/healer” mechanism, coupled with an exciting threat mechanism: your healer’s spells directly threaten all the enemies nearby, and thus your tank must use his abilities to attract their wrath and protect the healer. The tank must then be able to mitigate a lot of the enemy damage using his defensive skills.\nYour last 2 guardians will be the damage dealers, trying to kill the enemies as fast as possible, while they’re busy with the tank.\nAll guardians get a lot of abilities and not only will using the right one at the right moment be essential to your party’s survival, but also combining different abilities in sequence to maximize their efficiency will be required to vanquish your strongest foes.\nIt sounds like a lot, but fortunately the game comes with an active pause: you can pause the game whenever you feel like it, check everything, queue the next abilities for your guardians, and then resume the game.\nYou don’t like tanks, or you don’t like pausing the game? No problem, just lower the game difficulty, and you’ll be able to play without a real tank or pausing. You can precisely tune the difficulty at any time during your exploration.\nUnlike old-school FPV Dungeon Crawlers, you don’t have to strafe-turn-strafe-turn all the time in Dungeon Guardians. Your tank comes with serious defensive skills (armor, dodge & parry) that let him handle most of the enemy attacks, as long as the healer backs him up. So most fights are done while standing your ground.\nHowever, occasionally your whole party will have to dodge some extremely powerful enemy attacks, usually by walking back, so you’ll still need some moving reflexes and awareness of your surroundings during the fights. Built-in Map editor & Modding :\nThe game comes with a full featured map editor, letting you create your own dungeons. The basics are very simple, but a bit of learning will be required to handle the more advanced puzzle mechanisms.\nAdditionally, with the Modding SDK, you’ll be able to fine-tune the existing enemies, classes, specializations, abilities, talents, gear, and enchantments, and with a bit of dedication you should be able to add your own, and even add sound FX or music. Game Features :    4-character Party\nGrid-based movement : your party moves 1 square at the time, and turns by a quarter\nFirst person view\n4 classes, 12 specializations\n5 playable races : human, dwarf, elf, dark elf, halfling\nActive pause (ie: you can pause the game and still queue commands for your party members), and numerous optional auto-pauses\n25-50 hours of gameplay, depending on your own skills and the difficulty settings\n20 bosses, each with an unique strategy\n100 kinds of creatures (including variations)\nPuzzles (the few ones required to finish the game are easy to solve)\nA lot of tactical combat\nBuilt-in Map Editor & Modding support","imageUrl":"https://media.rawg.io/media/screenshots/cb4/cb4971eed57b53725cca0123a8a898a3.jpg","releaseYear":2015,"developer":"Mana Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10692,"name":"Fine Sweeper","genre":"Casual","price":0.0,"description":"Just Updated\nVersion 1.2 introduces a brand new scoring system and features new special abilities. Save up on extra-lives in the Bank of Hearts and reap the rewards such as auto-flagging or securely opening tiles. Players who pride themselves in good memory and fast sweeping skills get the points they deserve and new challenges they seek. Fine Sweeping!\nAbout the GameFine Sweeper is a re-envisioning of the good old casual game we’re all familiar with since Windows 3.11 came along, and we collectively sunk millions of productive hours into an ugly little thing called Minesweeper. Still itching for a fix but you can’t look at the hopelessly outdated and functional presentation any more? Now there’s cure: Fine Sweeperinherits and expands upon the best traits of the genre.\nPlayers who just randomly clicked tiles open in past and never got the addictive rules have the option to learn the mechanics with a little tutorial slideshow. Seasoned players can test their abilities in the “Classic Mode” without extra-lives. Or set up your game independent from the campaign mode to either be a stroll in the park or a dash Through the Fire and Flames.\nThe campaign offers levels increasing in difficulty and size of the playing field while staying true to the core mechanics. It offers newcomers and veterans a challenge without the game being unfair, item drops will help you progress, and a little mishap near the end doesn’t mean “Game Over” right away.\nFurther, Fine Sweeper is now integrated into Steam: There are 18 + 1 achievements waiting to be unlocked, global and local leaderboards, your progress and settings will be synced with the Steam Cloud so you can keep progressing no matter where you are.\nPlease note: Fine Sweeper won’t guarantee guessing-free boards, there’s always an element of luck involved to progress (especially on higher levels), still your first click remains always safe.","imageUrl":"https://media.rawg.io/media/screenshots/dd6/dd6b21d6dc1d7be81cc69d28ec464bf8.jpg","releaseYear":2015,"developer":"Pixel Prophecy","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9987,"name":"The Exiled","genre":"Action","price":0.0,"description":"The Exiled is a fast-paced PvP game set in a forsaken valley. Game worlds last for up to one month. Open PvP and Full Loot mean that you will to constantly balance risk and reward. Find a group of friends and form a clan to thrive in the valley. Cooperate or conquer, craft or combat; every decision is critical as you seek to flourish in a forsaken valley. A classless system means you shape your character to fit your style of play. With no grind, full loot and unrestricted PvP clashes, you must constantly balance risk and reward as you decide how to interact with the world and your fellow players. Craft equipment, construct your settlements and build alliances, as you explore challenging open world environments with unique geography and features. Each skirmish and siege will define your fate, as you vie to win your freedom from The Exiled.\n-Why we're creating The ExiledTo make a long story short: We love PvP but we hate having to grind for it. Doesn't matter if that grind means clicking on rocks and trees, farming rats or watching our mining lasers overheat on some asteroid. We just want to log into the game, find a friend or two and compete with an army twice our size. We want a game that takes us seriously as adults and allows us to make our own diplomatic decisions instead of throwing us in a battleground with a bunch of randomly selected \"friends\" and \"enemies\". We want a game that is constantly changing, keeping us on our toes and forcing us to get better instead of showering us with meaningless rewards and digital bauble.\n-Meaningful PvPOpen PvP: Engage other players in combat anywhere, anytime.\nFull loot: Carrying high-level equipment into combat means you risk losing it.\nPlayer-run clans: No pre-built factions. You decide who you ally with.\nCity building and sieges: Build up your own towns - or raze those of your enemies.-Skill-based CombatFull friendly fire: Make sure your fireballs hit the enemy and not your allies.\nLine of sight: Hide behind a bush to ambush your enemies - and look behind you!\nFootsteps: Every player leaves them behind - want to be a bounty hunter?-Free Character Development15 different class combinations: Have you ever played a Scythe-wielding mage?\n80+ combat abilities: Build a lightning wall, lay explosive traps or shoot a hail of arrows.\nAll equipment is player-crafted: You can tweak your gear to fit your play-style.-A Changing World in ConflictThe world of The Exiled is in a state of upheaval. A once peaceful and prosperous trading city turned from a multi-cultural melting pot into a stone cold dictatorship. You are on the receiving end of this societal change and together with hundreds of other misfits - criminals, political rebels and adventurers - you get exiled to a barren land -The Valley. Now you have to decide how to continue your life. Do you become a lone wanderer and live off the lands? Will you join the rebels and try to leave the valley by force? Or do you turn to your baser instincts and survive by robbing your fellow inmates?","imageUrl":"https://media.rawg.io/media/screenshots/8b2/8b2ac7015139e3b9da11364bd808d37b.jpg","releaseYear":2017,"developer":"Fairytale Distillery","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5548,"name":"Dragon Ball: Raging Blast","genre":"Fighting","price":0.0,"description":"Features over 70 playable characters, and allows you to relive epic battles from the series or experience alternate moments not included in the original anime and manga. With stunning 3D graphics, powerful and customizable Super Attacks, online gameplay and large-scale, destructible environments that allow you to fully experience the devastation of your attacks, Dragon Ball®: Raging Blast is set to deliver more explosive fighting action than ever seen before!","imageUrl":"https://media.rawg.io/media/screenshots/51d/51d8837f9b802166e63b3008e2335c6f.jpg","releaseYear":2009,"developer":"BANDAI NAMCO Entertainment America","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3723,"name":"No Heroes Allowed: No Puzzles Either!","genre":"Desconocido","price":0.0,"description":"HEROES… WELCOME TO YOUR DOOM\nSave dastardly villain Badman from an army of brave heroes in this free-to-play puzzler.\nAs the all-powerful God of Destruction, you must quickly move falling tiles to match three or more identical icons – which will then summon a pack of deadly monsters hungry for juicy hero flesh.\nFor each second that passes, the heroes take one step closer to finding your master. Can you take them out in time?\n• You will be granted eight pickaxes when you download this game and each puzzle you play will use up one pickaxe. Once you have used up your pickaxes, you will be given three more pickaxes to use each day – each one will take eight hours to recharge after use.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n©2014 Sony Computer Entertainment Inc. No Heroes Allowed and No Heroes Allowed: No Puzzles Either! are trademarks of Sony Computer Entertainment America LLC.","imageUrl":"https://media.rawg.io/media/screenshots/9e9/9e9754f31a872b746b6456d01e2c5ebf.jpg","releaseYear":2013,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"}]},{"id":971652,"name":"Escape Memoirs: Mini Stories","genre":"Adventure","price":0.0,"description":"\"Escape Memoirs: Mini Stories\" is a series of co-operative escape-room style puzzle scenarios for 1-5 players. In each story, you will face various puzzles that you need to overcome to escape. You must use your wits to their fullest potential to succeed.\nIn the \"Jail Breakout\" scenario, you are a burglar who, after an unfortunate turn of events, finds themselves in a jail. Can you conquer the many obstacles that stand in the way of your escape?Solve PuzzlesFrom security devices to deductive reasoning, wide variety of puzzles await you in each scenario. They are sure to test your wits and intellect.\nExplore and DiscoverThere are plenty of hidden collectibles for you to find as you make your way through each scenario.Work TogetherPlay solo, or work together your friends, in up to 5-player multiplayer. MORE ESCAPE ROOMS\nhttps://store.steampowered.com/app/2363730/Escape_Memoirs_Questionable_Side_Stories/\nhttps://store.steampowered.com/app/1925320/Escape_Memoirs_Mansion_Heist/","imageUrl":"https://media.rawg.io/media/screenshots/a7a/a7a87c9cbf5dc7e6c965ce3390fd387e.jpg","releaseYear":2022,"developer":"0 Deer Soft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":833436,"name":"LEGO Bricktales","genre":"Adventure","price":0.0,"description":"In LEGO® Bricktales, discover an innovative brick-by-brick building mechanic to design puzzle solutions from your own imagination. See your creations brought to life in a beautiful LEGO world where every problem has a constructive resolution.\n\n\n\nEmbark on an epic adventure across a world of beautiful LEGO diorama biomes crafted brick by brick as you search for inspiration to help your grandfather reinvigorate his rundown amusement park with your little robot buddy in tow. Your journey will take you to the deepest jungle, sun-drenched deserts, a bustling city corner, a towering medieval castle, and tropical Caribbean islands. Help the minifigures of these worlds by solving puzzles and unlock new skills throughout the story to further explore these worlds and uncover the many secrets and mysteries they contain.\n\n\n\nFrom purely aesthetic creations, such as a market stand or music box, up to functional physics-based puzzles like building a crane or gyrocopter - each diorama offers a variety of construction spots with the freedom of intuitive brick-by-brick building. In each spot you are given a set of bricks and it’s up to you to figure out a unique build that will work. On top of specific puzzles and quests, there are additional builds in the amusement park so you can customize the rides to make them your own!\n\n\n\n\n\n\nYour grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren’t made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology.\n\n\n\nAs a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. Strap in for the ultimate building adventure and save your grandfather’s amusement park!\n\n\n\n\n\n\nA globetrotting LEGO adventure: Experience a whimsical and epic adventure around the world, packed with charming dialogue and fun secrets to unravel.\nBeautiful diorama worlds: Explore five varied story world biomes and the amusement park hub, all fully built out of LEGO bricks.\nBuild like never before: Discover the most intuitive brick-by-brick building in a LEGO video game, as you see your creations come to life in a three-dimensional world.\nTest your skills with varied puzzles: Different types of puzzles will test your building skills. Use your engineering brain in functional physics-based puzzles to build a bridge for a digger to get across a river, put your designer hat on to build a stunning new throne for the King, or customize the rides in the amusement park.\nMaster your builds in Sandbox Mode: Unlock the Sandbox Mode upon completing a construction spot, then you go back in and improve your build with a huge selection of additional bricks from different themes.\nHeaps of items to collect and unlock: Find collectables in the different dioramas and use them to buy cool new items for your wardrobe or new brick color sets for the sandbox mode.\nBuild your unique character: Create your own minifigure character from a huge selection of parts and unlock more options inspired by the worlds you visit as you progress through the story.","imageUrl":"https://media.rawg.io/media/games/b6e/b6e61bd8eec75b4ca2bf931d32b9b1d4.jpg","releaseYear":2022,"developer":"ClockStone","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":779852,"name":"Nightmare of Decay","genre":"Action","price":0.0,"description":"Nightmare of Decay is a first-person action horror game set in a nightmarish manor.\nAfter going to bed one night you awaken to find yourself trapped in a manor infested with zombies, psychotic cultists, and a horde of other horrors. You must utilize an assortment of different weapons and limited resources in a brutal fight for survival as you try to escape from the nightmare...or die trying.\nExploreNavigate and explore an expansive multi-level manor.Fight Fight against a variety of different enemy types including shambling zombies and gun toting cultists.SurviveLimited ammo and resources encourage a more hardcore survival experience.","imageUrl":"https://media.rawg.io/media/games/22f/22fef317398db059560bd5830503c122.jpg","releaseYear":2022,"developer":"Checkmaty","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":586185,"name":"Shadow Man Remastered","genre":"Action","price":0.0,"description":"Shadow Man: Remastered is a complete overhaul of the classic game with restored, previously cut content!\n3 New Levels:\n\"Summer Camp, Florida\" (Day and Night)\n\"Salvage Yard, Mojave Desert\" (Day and Night)\n\"Asylum Station 2 - Experimentation Rooms\"\nNew Audio (from the original games composer, Tim Haywood):\nRemastered music and SFX\nNew music and SFX for the restored levels\nRestored cut/unused voice dialog in levels\nArt Updates:\nSwitch between the original textures and the new high resolution textures\nHD Textures for all levels and objects\nNvidia Intro Cutscene Textures\nHD HUD and inventory icons plus a new icon for the Shadow Gun\nRestored unused animations\nRestored several cut and censored models from the original levels\nN64 Gad Icons\nGameplay Improvements:\nNew weapon wheel to select weapons faster as time is slowed down\nImproved controls\nImproved destructible objects using Bullet Physics\nAuto targeting\nTweaked/improved AI\nLevels rearranged as originally intended\nA ton of fixes across the entire game to each level from object to geometry fixes\nFixes to the localization for English, French, German, Spanish, and Italian\nOver 30 achievements\nNew Weapons:\nA second Violator (Consistent with the N64 version)\nSawed-off Shotgun (replaces the second regular shotgun)\nNew model and many sound variations for the Shadow Gun\nNew Enemies:\nYort\nYort Floater\nThe Seraph Queen\nSeraph\nDead Worm\nUnused zombie restored in Station 2\nOne arm Tenement Zombie.\nRendering Improvements:\nSupport for 4k resolution with 240hz refresh rate\nDynamic Per Pixel Lighting\nClustered Forward Shadow Mapping\nOrder-independent transparency\nNew Post Processing Effects:\nAmbient Occlusion\nAntialiasing\nAnisotropic Filtering\nMotion Blur\nFilm Grain\nDepth of Field\nSecrets:\nAll the secrets from the N64/Dreamcast/PC included in this remaster\nPlus many more to be discovered!","imageUrl":"https://media.rawg.io/media/games/118/118febc46aaedb9a2a8179d7258e1556.jpg","releaseYear":2021,"developer":"Nightdive Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":578226,"name":"Astria Ascending","genre":"RPG","price":0.0,"description":"Explore the vast and beautiful world of Orcanon\nVisit five different cities populated by unique creatures and solve more than 20 dangerous dungeons. With over 50 hours of gameplay and a range of fun mini-games - including shoot ‘em ups, an original fantasy-themed card game and challenging environmental puzzles.\nA grand tale of fate and sacrifice\nImmerse yourself in a fascinating narrative rife with betrayal, sacrifice and terrors. A story based around adult characters, Astria Ascending offers a more mature experience and extensive dialog.\nA rewarding turn-based combat system\nFight over 200 different monsters in captivating turn-based combat. Collect and summon legendary beasts into the fight and build up your power to wield legendary Cosmo Breaks.\nMeet an unforgettable cast of characters\nPick from eight customisable player characters spanning a range of fantastical races and skills, and assemble a heroic team that must sacrifice everything to save the world. With 20 classes to pick from and an array of unique skills to command, their fates are doomed, but the world is not.\nA hand-drawn adventure crafted with skill and passion\nFrom a team featuring developers from Final Fantasy, Nier Automata and Bravely Default, Astria Ascending includes full voice acting in Japanese and English, a traditionally animated fully hand-drawn 2D world and a dynamic weather system.","imageUrl":"https://media.rawg.io/media/screenshots/6a8/6a84a44a05494ab0cefe5e17032415b5.jpg","releaseYear":2021,"developer":"Artisan Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":471033,"name":"NHL 21","genre":"Sports","price":0.0,"description":"NHL 21 will be officially revealed in August 2020. Reserve your pre-order copy today and check back for more details.\nOffline multiplayer (2-4 players)\nOnline multiplayer (2-12 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nUses DUALSHOCK 4 vibration function\nPS4 game can be controlled via PS Vita\nEnhanced game play on PS4 Pro console\nOptional In-game purchases\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","imageUrl":"https://media.rawg.io/media/games/576/5764a182aafe5b5fddc25fdfd15170d6.jpg","releaseYear":2020,"developer":"Electronic Arts","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":455517,"name":"Source of Madness","genre":"Action","price":0.0,"description":"Source of Madness takes place in an alternative reality where the world did not go into the age of enlightenment, where magic and the monsters of Lovecraft exist or rather allow you to exist. The world is steered and controlled by cosmic entities where the human race hangs on in foolish attempts to survive for yet another sunrise. You play as newly initiated acolytes at the tower of knowledge, where people of Loam have taken shelter from the disturbing hordes of monsters currently infesting the Loam Lands.\n\nYour voyage will not only be one of the depths in terra nor only the depths of treacherous forests but to the grand non-euclidean citadel R’Lyeh, to the moon, and the celestial bodies on the rims of the universe!\n\nThese worlds warp and distort with the current unstable space time leaving things each day different and inhabited by deformed and grotesque beings of celestial origins. You are only protected from the warp by the powers of the Tower of Knowledge, yet now you have to voyage out, to find the twin tower, the Tower of Madness.\nExplore an ever-changing neural world\nExplore a uniquely created world by neural networks, inspired by Mr. H. P. Lovecraft - see the depths of its insanity. Source of Madness offers a rich and unique world that never seems to be fully discovered. Each time you play, the world will have new possibilities and hidden areas filled with lurking monsters and threats. Every time you die and start over - the whole world and its inhabitants change. This world is cursed and soon to be lost.\n\nEver Changing Dynamic World: For each new run your world is twisted into something new and fresh\n9 unique Biomes\nOriginal world\nPhysics rigged world\nNeural network art\n4 Bosses","imageUrl":"https://media.rawg.io/media/games/8ee/8eec4807df435c9a176cb693f73828c9.jpg","releaseYear":2022,"developer":"Carry Castle","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]}]