[{"id":18099,"name":"Phantaruk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00f/00f56056c5ae2d197f4a09839862a45a.jpg","description":"APPROACH THE EDGE OF HUMANITY.\nFor long has the humanity been constrained by limits of human body. Most have accepted the imperfection of flesh, but some sought for liberation. To pursue the dream of creating a post-human being – to achieve ideas of transhumanism – is the driving force behind H+ Corporation. Within its facilities technology and homo sapiens became one entity. An organism devoid of humanity’s biological weaknesses.\nYou board the spaceship Purity-02 – prime complex of the H+ Corporation.\nThe dream shatters to a nightmare when you realize what has become of Purity-02. Once a research vessel, it has turned into a deadly, deserted trap. To flee Purity-02 you have to investigate the mysteries of the ship. With every passing minute the chances of survival grow slim. Infected with a parasite emitting deadly toxins, you struggle against havoc being wrought within your body. But there is yet a greater danger to evade.\nA beast is roaming the ship. A creature known from long-forgotten fables and ancient myths. It could prowl around in any shadow and lurk behind any corner. You must plan your every move. You must survive the infection.\nYou Must Get Off the Ship.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Polyslash","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":18089,"name":"Might and Magic: Heroes VII – Trial by Fire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bb/4bb1858045f9e2e0cddc911a6dc3e23b.jpg","description":"A STAND-ALONE EXPANSION - ideal for existing Might & Magic Heroes VII players, newcomers and fans of previous entries alike.\nA NEW EPIC STORY - Play two original and thrilling campaigns starring the recently crowned emperor Ivan and legendary Dwarven heroes.\nNEW FORTRESS FACTION: DWARVES - Lead the fierce warriors, industrious blacksmiths, and masters of Rune Magic on a path to define their destiny.\nEXPERIENCE MIGHT & MAGIC HEROES' UNIQUE MIX OF TURN-BASED STRATEGY AND RPG GAMEPLAY - Now featuring improved mechanics and additional maps.\nREDISCOVER THE RICHNESS OF THE  MIGHT & MAGIC UNIVERSE - filled with new heroes & iconic creatures, new artifacts, abilities and achievements.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Limbic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":18058,"name":"Vampire Legends: The True Story of Kisilova","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/111/1119026ef17735d78a922e1a25796a6b.jpg","description":"Vampire Legends: The True Story of Kisilova is an adventure game with elements of horror, based on the first documented case of vampirism!\n18th century Europe: fifty years after a great plague had swept the land of the Habsburg dynasty, the subjects of the Emperor are in danger again. A series of horrifying, unexplainable deaths occur in the remote Serbian town of Kisilova. Fearing that the plague may be striking again, the residents begin to flee their homes. Summoned by the Prince of Württemberg himself, Imperial emissaries come to Kisilova to investigate the events and prevent further deaths.\nThe heroine and her companion have to lead an investigation, question the witnesses, explore every nook and cranny in the town and solve many puzzles. Will they be able to uncover the secrets of the local dignitaries and discover the identity of the hooded stranger trying to thwart their plans?\nThe fate of Kisilova and the Empire lies in your hands!\nFeatures62 hand-painted areas depicting remote lands of 18th century Europe.\nYour fellow investigator will often come to your aid.\n36 challenging mini-games and 21 scenes with hidden objects.\n14 intriguing characters to meet during the investigation.\nAdditional adventure with multiple endings!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":17041,"name":"Heroes & Legends: Conquerors of Kolhar","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73e/73edd2761f748f63f2b2bd8dcb3171ba.jpg","description":"Wielding sword or spell, help your party of heroes carve a pathway through hordes of demons, undead, and mythical monsters as you race to thwart an ancient prophecy of doom from unfolding in this action-packed fantasy role-playing epic. Blending combat and strategy, Heroes and Legends: Conquerors of Kolhar challenges you to pit your wits and reflexes against an array of vicious enemies in both story-driven and randomly-generated adventures.\nOutfit your band of wizards, warriors, and assassins with custom-made weapons and armor built using a full-fledged crafting system, then lead them into battle against legions of lethal foes. Manage combat tactics, wield ice and fire against your adversaries, and obliterate your opponents in a spray of sparks using magical artifacts. As you explore and gain experience, you'll unlock more challenging scenarios and more powerful special abilities, and along the way you'll meet a host of new friends and enemies in this spellbinding tale that will leave you breathless right up to the end.\nFeaturing a massive menagerie of creatures to fight, and dozens of unique powers to poison, petrify and annihilate them with, Heroes and Legends: Conquerors of Kolhar invites you to experience the adventure of a lifetime.\nThe game also comes with a beautiful Bestiary containing 51 monsters from the game, and a set of 10 printable collectible cards!Key Features:•\tEpic blend of fantasy role-playing and strategy\n•\tManage a team of five powerful heroes\n•\tFight for glory in story-driven quests and random adventures\n•\tCraft your own custom weapons and armor\n•\tMore than 100 bloodthirsty monsters to battle\n•\tDozens of powers and special abilities to pick from","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cuve Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17038,"name":"Take the Dream IX","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c54/c5486f0a1ab310207558a13bd2de90d3.jpg","description":"What is love?\nBy the creators of Close Your Eyes. A classic love story. A stubborn woman named Gwen is off to save her girlfriend, Flora, from a strange depressed phantom know as ArKun. Now Gwen must go rescue Flora and reunite with her one true love. You can do it, admirable player, most certainly. After all, this is just a game.\nIt's all just a game.\nThis game includes the following to some degree:\nVoice Acting\nOriginal Artwork\nOriginal Music\nOriginal Spritework\nDefault RPG Maker Assets\nLove","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Yai Gameworks","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11842,"name":"Planet R-12","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3c/f3c713b1f35e2098550370a88e9464b0.jpg","description":"Please do not buy this game! Wait for the big discounts and then hardily take it! ;)\nGood robot broken robot!\nEnemy combat robots is not an obstacle for a commander like you!\nAssemble your team, equip them and save the fighters from this treacherous planet!\nThis is a tactical shooter for the real commanders who like battles, lots of weapons, interesting robotic enemies, huge bosses, explosions and riding on the tank, show these robots who's boss!\nNow in game there are 7 types of soldiers which you can gather your team from 1 to 3 fighters. Each soldier may have different weapons and skills.\nOn the planet of robots you will meet incredible robots-creatures, from small Robo-bugs to huge mechanical monsters, they do not like living people and will try to destroy you. To successfully fight an enemy, use your team of soldiers and available skills.GAME FEATURES:The option to play either as a strategy to controlling the soldiers, or to participate in the battle one of the soldiers.\nThe game has over 40 unique enemies and bosses.\nMany robots getting damaged gradually destroyed and you can see the mechanical insides.\n7 persistent soldiers to your squad.\n10 skills which are very helpful in battle, for example - energoschit gives the soldier for a while absolutely inviolable.\nThe opportunity to discover new weapons for your fighters or improving the existing ones.\nAdditional bonuses in the game: life, double damage and more.ABOUT ROBOTS:I tried to make a lot of interesting and varied opponents and I think I have made it.\nAfter destruction of robot to each soldier is given points, which replenishes the condition of his \"skill\". Defeated robot remains bonuses - the stronger the robot, the more bonuses remained.ABOUT SKILLS:Skills are very important for use: without them the game is not passable. In the beginning, many people makes mistake by trying to pass through game using own dexterity and without using game \"skills\". Robots love such newbies)).\nThe game has three main skills and one for each type of soldier.MAIN SKILLS: - \"freezes\" all the robots in a specified area for a few seconds;\n- creates energy shield around soldier, making unit completely untouchable;\n- call for bot that will land and help soldiers on the battlefield.SOLDIERS DESCRIPTION:\nJohnnie excels in all areas of combat on the battlefield and can use four different weapons and has two different skills.\nJohnnies weapons:\n- The Basic Pistol is a standard Pistol issued by the 2050 Army and is used for Close Range Combat and for special situations such as Retreating.\n- Blast through Enemy Robots with Johnnies personal Assault Rifle that deals Medium Damage and can target Enemies from Medium to Long Range. Johnnie has the ability to upgrade the Assault Rifles Damage after accumulating experience.\n- The Silenced Assault Rifle deals Medium Damage at Close Range but has Low Penetration. The Silenced Assault Rifle Range can be upgraded as well as the Magazine.\n- Johnnies favorite weapon, the Scoped Assault Rifle deals Medium Damage at Long Range and can be enhanced with Range Upgrades and Fire Rate Upgrades.\nJohnnies skils:\n-Johnnie has the ability to toss a grenade near enemies that explodes and deals Medium Damage.\n-A Enhanced Grenade means a bigger explosion. Destroy multiple enemies soon as Johnnie resupplies his Enhanced Grenade.\nGonzález loves shotguns and is not afraid to Melee Enemies.\nGonzález weapons:\nShotgun - A powerful Short Range Weapon that shoots Buckshot.\nCons: Short Range and Slow Reload.\nUpgrades:Range,Magazine.\nSir Explosive - Shoots explosive bullets causing Severe Damage with a Knock Back Effect.\nCons: Slow Fire Rate.\nUpgrades:Damage,Range.\nGonzález skils:\nRocket Barrage - Targets Enemies and releases a Barrage of Missiles.\n*Tip* Freeze Enemies before use.\nBeatrix is a Expert Sniper and packs a serious bang with each shot!\n\"They never see me before I destory them, it is funny!\" - Beatrix\nBeatrix weapons:\nThe submachine guns used for Close Range Combat .\nSniper Rifle -  The Sniper Rifle has Maximum Range and Heavy Damage.\nCons: low rate of fire.\nUpgrades: Rate.\nBeatrix skils:\nshot with increased damage.\nNina is a trained soldier but dedicates her time healing wounded Soldiers.\n\"I'll heal my team, then i'll destory the enemy.\" - Nina\nNina weapons:\nA Good Rifle that allows you to shoot at enemies from a Far Distance.\nCons: low rate of fire.\nUpgrades:Damage, Magazine.\nBasic Machette - Serrated Machete causing Severe Damage in Close Combat.\nSpecial Forces Machette - Special Forces Machette inflicts Heavy Damage in Melee Combat.\nNina skils:\nHealing - Restores the standard of living in most wounded Soldiers.\nMisha moves slow but he rips apart Enemies with his Heavy Weapons and Heavy Armor.\n\"I am a One Man Army, but I enjoy the company.\" - Misha\nMisha weapons:\nHeavy Machine Gun - Heavy machine gun deals Good Damage and has a Large Magazine.\nCons: Slow Reload.\nUpgrades: Range, Magazine.\nLead Rain - A Powerf Weapon capable of Simultaneous Fire in three directions, thereby causing damage to a Large Area.\nCons: Slow Reload.\nUpgrades: Damage, Range.\nMisha skils:\nFire Rate - Temporarily increase the weapon's rate of fire.\nElectro - Experimental soldier with a Experimental Weapon.\nElectro weapons:\nAn Experimental Weapon that causes Severe Damage to Electricity from Long Distances.\nCons: Slow Fire Rate.\nUpgrades:\tDamage, Rate.\nElectro skils:\nLightning Stream - Produces a stream of Electrical Discharges that deals Great Damage to near by Enemies.\nKurt - The soldier moves very fast and jumps high.\nIf his laser sword is fully charged it does great damage.\nElectro weapons:\nLaser sword, capable of accumulating energy and causes more severe damage. The damage is doubled if the strike of the sword was during the jump.\nCons: Slow Reload.\nUpgrades:\tDamage.\nElectro skils:\nExplosive strike deals heavy damage to all enemies nearby with Kurt.\nABOUT BONUSES: - replenishes health: the larger the size the more will be added;\n- replenishes the level of main skills;\n- gives double health;\n- increases damage by two times;\n- opens up new weapons for the fighter: if not, then gives a bonus to current weapon.\nPerks for the weapons increase one of the properties, if the property is available for increase or has not reached a limit. For example ammount if damage done.\n-damage\n-range\n-rate\n-ammoSTORY:Planet of the robots attacked the spaceship of earthlings, to eliminate the threats were sent a squad of starship troopers, 7 persistent and armed soldiers, robots have attacked and blown up their ship but the soldiers managed to escape.\nYour task as commander of the squad and using their weapons and skills to defeat the evil robots and hostile mechanisms.\nYour skills in tactics and strategy will help to win over military robots, soldiers can be swapped by dragging them around the screen and you yourself decide which fighter will stand in front, right, use skills, for example, before to launch missiles at the robot it is better to freeze it so he couldn't move.HOW TO PLAY\nTactical mode - control a squad with only the mouse by issuing commands for movement and the soldiers are fighting on their own. In the meantime you help them by using their fighting skills. For example, the skill \"electroshock\" completely stops the robots at the area.\nDirect control -you become one of soldiers and control unit in a classic way \"WASD + mouse\" and the other soldiers will follow you and help in battle. Please don't try to beat the game without using skills, you will not succeed! For convenience, use the keys skills Q,E,F,Z,X,C.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Timushev Vladimir","platforms":[{"id":0,"name":"PC"}]},{"id":11759,"name":"Screeps","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a1/0a1fc59699dfe8637b9fd20bbef70c63.jpg","description":"Why subscription?Note: everything below is about the official MMO world only. The single-player mode and unofficial private servers are available without subscribing.\nScreeps is an unusual MMO game that has no counterparts at the moment. There are numerous online games where your character exists in the game world only while you’re online and disappears after you exit the game. There are fewer games that have your character or units continue some defined automatic activity even after logging out. But only Screeps runs your scripts in full continuously, on the 24/7 basis, and you are allowed to use them for anything JavaScript allows.\nThis makes Screeps more like a hosting or cloud computing service rather than a traditional online game. We offer you server CPU time and fixed amount of memory that you can use as you wish (though it’s still preferable to use it in relation with the game!). Though a new player gets a quite low initial CPU limit, after upgrading your game level you can end up with your limit up to 300 ms per game tick which is quite a serious hosting asset.\nAs we designed the game, we were considering numerous options and finally came to a conclusion that justification of such expenses requires only one model: game time (or, in our case, CPU time) subscription. And note that we don’t offer multiple subscription options: the subscription cost is the same for all players. Thus we avoid creating game advantages for certain groups of players since all are provided with equal opportunities to use server resources.\nIf you don’t wish to use such resources on general terms, you can just confine yourself to purchasing a starter kit on Steam. A minimum 10 CPU amount will be reserved for you on the official MMO server, but it won’t grow following your game level. Such a mode is not suitable for a full competitive playing but is still enough for those who are fine with 2-3 game rooms in the game world to have some fun of the game.\nSubscription Tokens\nSubscription Token is a special in-game item that allows its owner to activate 60 days of CPU subscription. You can buy a subscription token the same way as a regular CPU subscription, but these items are tradeable, you can sell them to another player or buy for game resources.\nHence, those players who want to share their resources with others can play Screeps as a free-to-play game! Subscription tokens trading is possible via the in-game market or Steam Community Market allowing to trade purchased tokens for real currency using your Steam Wallet.\nAbout the GameScreeps is about scripting your creeps.\nIt is an open source MMO RTS sandbox game for programmers, wherein the core mechanic is programming your units AI. With all the attributes of a full-fledged strategy game, you control your colony by writing real JavaScript which operate 24/7 in the single persistent world filled by other players on par with you.\nYour colony can harvest resources, build units, conquer territory, trade with another colonies. As you conquer more territory, your influence in the game world grows, as well as your abilities to expand your footprint. However, it requires a lot of effort on your part, since multiple players may aim at the same territory.\nScreeps is developed for people with programming skills. Unlike some other RTS games, your units in Screeps can react to events without your participation – provided that you have programmed them properly. And, unlike other MMO, you do not have to play Screeps constantly to play well. It is quite enough just to check once in a while to see if everything goes well.\nFeatures:\nYou play by writing JavaScript AI which controls your units 24/7 even while you're offline.\nUnits of all players coexist in the same real-time huge persistent world and obey the same rules.\nMany kinds of units, base building, mining resources, territory control, economy, manufacturing, transporting, logistics, trading – all the attributes of a real strategy game which you need to program!\nThe better your scripts, the better your game — irrespective of the time played. Your creeps will mine, build, defend, and conquer as you just work, sleep, or walk your dog.\nOnly basic programming skills are required. However, if you are a pro developer, now is the chance to put your skills to the limit!\nEdit your scripts from the in-game editor, or using your favorite external IDE.\nLifetime MMO access with 10 CPU limit included in the starter package. Raise your CPU limit to the point depending on your game level by purchasing a CPU subscription plan or via in-game items called Subscription Tokens. The subscription cost is the same for all players, there is no way to pay more to gain more advantages.\nHost your own server, modify games rules and play with your friends via LAN or on the Internet. No subscription required. The server is an open source project.\nAnd many more features to come! (see Roadmap)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Screeps","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10173,"name":"Muv-Luv","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca5/ca5e0650fbae8d942621d1983a9b3eb8.jpg","description":"The Muv-Luv series is an epic saga told in three parts: Muv-Luv Extra, Muv-Luv Unlimited, and Muv-Luv Alternative. What begins as a tongue-in-cheek romantic comedy ultimately transforms into an action-packed thrill ride in a war-torn alternate reality, and it’s this drastic-yet-methodical genre twist that makes the final chapter the most highly-revered visual novel of all time. This is a story that will plant seeds in your brain early in the first act that you won’t even notice until they sprout in the third for maximum narrative payoff and crushing emotional impact. Don’t fall for Extra’s cutesy exterior. This series ventures into some of the darkest thematic territory you’ll ever see, and when the final curtain closes, you’ll likely need a forklift to pick your jaw up off the floor. Make no mistake: this is a story that will challenge you in ways few works of fiction dare attempt, and an emotional tour de force unlike any other.\nThis game contains the first two arcs: Extra, and Unlimited.\nThe final arc, Muv-Luv Alternative is the story’s massive climax, and is nearly the size of the first two combined.Muv-Luv Extra\nTakeru is your average unassuming high school senior whose entire world gets turned upside down one morning when he awakens to find himself in bed with the heiress to one of the world’s largest international conglomerates. She calls herself Meiya, and - despite never having met him before - she insists that the two of them are destined for one another. This comes much to the chagrin of his childhood friend Sumika, the girl next door who’s always had feelings for him, who realizes that if she doesn’t act fast, she might just lose him forever. All of which begs the question: just who is Meiya? And do his feelings for Sumika run deeper than he thought? In the end, he’ll need to decide between the girl who’s been with him through thick and thin, or the stranger who claims they’re bound together by fate.\nBut that’s only one side of the story.Muv-Luv Unlimited\nJust as the page turns on Takeru’s happily ever after, he awakens one morning in a world not his own. An alternate timeline, humanity on the brink of extinction. A world infested by alien invaders locked in a war that’s been raging on for decades. And yet, all the set pieces are the same - his house is still here, albeit dilapidated and barely standing. His school is still here, though it’s now a military academy. And even though they don’t recognize him, all his friends are here too… with one exception.\nWas this all just a dream? Or was the world he thought he knew really a dream all along?Muv-Luv Alternative\nTo avoid spoilers, we only recommend visiting Muv-Luv Alternative Steam page after finishing Muv-Luv Unlimited.Features:A Dating Sim - Date any of the heroines, get to know their personalities and backstories, and fall in love with each other!\nAvailable in three languages - Japanese, English and Simplified Chinese.\nThe User Interface has been reworked, so it's compatible with the newest tablet PCs and touchscreens.\nUser save data are stored in Steam cloud so readers can continue their progress anywhere with ease.Muv-Luv Reviews (Original AppID)https://steamcommunity.com/app/449830/reviews/?p=1&browsefilter=toprated&filterLanguage=all","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Pqube","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":10012,"name":"Dawn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/604/604eeee98dea5dd7a7ae0dd4eff6f84d.jpg","description":"Dawn is an atmospheric 3D platformer in which players guide a druidic creature named Ash through a beautiful environment to bring life and light back to a dead tree at the center of the world. Players must use Ash’s power to grow plants and activate objects to create paths through the environment. The world of Dawn is filled with hidden flowers off the beaten path – collect them all to unlock a secret!FeaturesA beautiful organic world to explore.\nAccessible, fluid platforming gameplay.\nDynamic original soundtrack that responds to the player's progress.About the TeamDawn was created by Brave Rabbit Games, a team of 18 students from the Guildhall at Southern Methodist University, a graduate school for game development in Plano, TX. Development took place over the course of roughly five months in the latter half of 2016, as the capstone project for Guildhall's team game curriculum. We've been learning how to make games for two years now, and we're excited to share our best project yet!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Brave Rabbit Games","platforms":[{"id":0,"name":"PC"}]},{"id":5623,"name":"Ninja Gaiden 3: Razor's Edge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eca/ecad605a6e0addd45e6740dd42c7565d.jpg","description":"Razor's Edge sharpens up the battles, difficulty levels, visuals, and much more to deliver the ultimate Ninja action game experience!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"}]},{"id":4531,"name":"Sly 2: Band of Thieves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5b/b5b1243abc5dbbc441dcde08409cf8c7.jpg","description":"Sly 2: Band of Thieves (Kaitou Sly Cooper 2, 怪盗　スライ・クーパー２) is a Platformer 3D/Stealth video game published by SCEI, Sucker Punch released on June 16th, 2005 for the PlayStation 2.\n\nSly and his crew are back and ready to pull off another series of big heists.\nWord is out that Interpol has excavated the robotic remains of Clockwerk -Sly's nemesis and sworn enemy of the Cooper clan--and it's up to you to prevent it from being reassembled. To do this, you must once again enter the thieving world of pickpocketing, vent crawls, rooftop chases, and stealth attacks.\nSly 2: Band of Thieves takes you on an adventure across numerous locations, including Paris, Prague, India, and the Canadian Wilderness.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":4050,"name":"Fatal Frame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/327/3271b52a14c6717920cb0cf401ec95ae.jpg","description":"Miku's brother has gone missing after visiting the haunted Himuro mansion.  Armed with only her Camera Obscura, can she save him from the ghosts?","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Tecmo","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":963218,"name":"EA SPORTS FC 24","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/104/10404407d458d90f4559a1f587c2650a.jpg","description":"EA SPORTS FC™ 24 welcomes you to The World’s Game—the most true-to-football experience ever with HyperMotionV*, PlayStyles optimised by Opta, and a revolutionised Frostbite™ Engine reinventing how 19,000+ authentic players move, play and look in every match.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"EA Canada & EA Romania","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":960484,"name":"Miasma Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/526/52637ef0c009f5e1142e2f1dbbbacfb7.jpg","description":"In the not-too-distant future. America has been torn apart by a savage force known only as the ‘Miasma’.\n\nMeet Elvis, a young man brought to the mining town of Sedentary as a baby. Left by his mother in the care of a robotic older ‘brother’ and given a mysterious glove with which he can control the Miasma.\n\nJoin the brothers on a quest across a post-apocalyptic wasteland to find the answers they crave. Answers which may change the course of human history forever.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"The Bearded Ladies","platforms":[{"id":0,"name":"PC"}]},{"id":461747,"name":"Anno 1404 - History Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2cd/2cdda4b29d6b79f44d18b0929de6850f.jpg","description":"Relive the captivating gameplay of a true city-building classic with Dawn of Discovery® and its Venice expansion in Anno® 1404 History Edition. See the game like never before, updated and optimized to work smoothly on current computers with resolutions of up to 4K, and enjoy all improvements while continuing your existing game with full save compatibility.\n- Expand your empire with the Venice expansion, including co-op and competitive multiplayer, as well as new features, ships, quests, and items.\n- Experience updated and expanded multiplayer functionality.\n- Take advantage of improvements like borderless window mode and multi-screen support.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ubisoft Mainz","platforms":[{"id":0,"name":"PC"}]},{"id":419941,"name":"Devil's Kiss","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b59/b599e0578a6b58b16cb103abc532bb59.jpg","description":"https://store.steampowered.com/app/1060600/Lair_of_the_Clockwork_God/Find out how it all started in this enticing, highly-charged Visual Novel prequel for \"Lair of the Clockwork God\". Join heroes Dan and Ben as they navigate a rough first school day stuffed with flirting, demons, and all manner of compromising personal information.\nDan pulls up to the gates of Big School with a glint in his eye and an eye to make friends with the most influential mid-nineties video game archetype, and start his career as a useless sidekick. Hang out with the personification of Point and Clicks, RPGs and shooty-bang adventurers, and get swept along on a mysterious Globe-spanning conspiracy!PLEASE NOTE: this game is FREE with every purchase of 'Lair of the Clockwork God'!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Size Five Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":297286,"name":"Metamorphosis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/185/1852f6ec477a9d6b25a3395ce43b74c6.jpg","description":"You awaken one morning to discover that you have been transformed into a tiny bug. This is rather inconvenient, as your friend Joseph is being arrested for reasons unknown and he can’t recognize you like this.\nTo save Joseph and to find the answers you seek, you must embark on a perilous journey through a strange world which, like yourself, has turned twisted and unfamiliar.\nWhat once seemed like mundane dwellings has become an expansive obstacle course, and you’ll have to leap, climb, and chart your path through the dingy nooks and crannies that exist within the cracks of civilization.\nMetamorphosis is an extraordinary adventure through surrealist landscapes. Use your wits to unravel the truth and return to the life you once knew.Featuring;\nFirst-person perspective from a bug makes you see the world in a whole new light.  Challenging environmental puzzles that have you searching for clues, creating diversions, and overcoming obstacles.  Rewarding exploration featuring unique movement mechanics that make full use of your tiny body and sticky limbs.   A surreal story that players can influence, inspired by the curious imagination of Franz Kafka.  Eccentric, colorful characters spanning the world of both humans and insects.  A hand painted world that adds a layer of the fantastical to even the grittiest environments About Ovid Works;\nWe're a team of developers making story rich and immersive games for PC and consoles. Our passion is telling expressive stories through fun moment-to-moment gameplay.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ovid Works","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":251513,"name":"Light Bearers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ae/1ae25501c50eceea02dd416155d6ab34.jpg","description":"“Deep into that darkness peering, long i stood there wondering, fearing,\ndoubting, dreaming dreams no mortal ever dared to dream before”\n- Edgar Allan Poe\n\nGameplay\nLight Bearers is a multiplayer asymmetrical hide and seek game where during each round one player is chosen as the Shadow while the other players play as Light Bears trying to avoid being infected by the Shadow.\nOnce infected Light Bears become Shadow Bears and start working\nfor the Shadow trying to capture and infect Light Bears.\n\nIf all Light Bears reach the Light Pool at the end of the round, they win; however if the Shadow (and his minions) manage to infect all Light Bears before time runs out, the Shadow wins.\n\nAll Bears (Light or Shadow) play in first-person to create a more gripping and adrenaline pumping experience while most Shadows play in third-person to give them situational awareness and a sense of true power.\n\nWishlist Light Bearers Now!\nAdd Light Bearers to your wishlist to stay up to date with new content\n\nThe Shadows\nThe Free-To-Play version of Light Bearers has two Shadows unlocked and ready to play. Unlock the DLC - Full Game to gain access to all available Shadows.\n\nEach Shadow has three abilities crafted for their specific play style; each one offering the player new and interesting game mechanics and combos.\n\nThe Bears\nDuring any given round of Light Bearers you might play as either a Light Bear or a Shadow Bear. Depending on which one you are, your win condition will change - evading the shadow and escaping through the Light Pool or chasing and infecting all remaining Light Bears.\n\nWhether you are a Shadow Bear or Light Bear there are map mechanics that will aid you in your efforts. Shadow Bears can use the Shadow teleports to move swiftly and easily around the map whereas the Light Bears have hiding spots scattered throughout the map that help them avoid detection.\n\nBoth bears have a special ability associated with their type. Light Bears have a useful Dash that gets them out of tough spots and the Shadow Bears can create a wall to stop their prey from getting away.\n\nLight Bearers Full Game\nWant more Shadows? Want to be the most badass looking Light Bear... Ever?\n\nGet the Light Bearers Full Game DLC to not only unlock all current and future Shadows but also the ability to level up your character and unlock some of the most awesome customization content ever seen with eyeballs... ever.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Fat Bomb Studios","platforms":[{"id":0,"name":"PC"}]},{"id":49105,"name":"The Mummy Demastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/256/2567e3ac5b300a6f4b8056cd163d0f08.jpg","description":"A powerful ancient evil has arisen, and the war to save humanity has begun! The Mummy Demastered throws you into a 16-bit-inspired battle against the undead in a 2D, nonlinear, action-packed adventure. As an elite agent in the monster-hunting Prodigium organization, you must use a variety of weapons, upgrades, and mysterious artifacts to defend mankind against the supernatural hordes of Princess Ahmanet. Your Prodigium unit is already on the scene, but HQ lost contact with them hours ago. Only by exploring tombs, forests, abandoned tunnels, and the cursed streets of London will you discover the fate of your allies. But beware - Ahmanet commands legions of undead, insects, plague-ridden vermin, and worse! If you're not careful, you'll be the next soul in her army.\nKEY FEATURES:\n- Stunning retro-inspired graphics and atmospheric chiptune soundtrack\n- Shoot-'em-up action meets exploration-based adventuring\n- Fight for survival against swams of horrifying enemies and bosses\n- Obliterate monsters with an arsenal of weapons including grenades, a flamethrower and more\n- Uncover and collect 50 hidden relics","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":46698,"name":"All Our Asias","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cee/cee8bb8abc8adf08b513c87ed6a6d2e5.jpg","description":"All Our Asias is a surreal, lo-fi, 3D adventure, about identity, race, and nationality.\nThe protagonist's name is Yuito.  31, Japanese-American. Hedge fund analyst. USA-born and raised.  One day he receives a letter from his estranged father. His father is dying. It's too late for Yuito to speak to him.\nBut his father is on life support, and Yuito has an opportunity. He can under go a  Memory World Visitation, and enter his father's Memory World, a series of supernatural landscapes where Yuito can explore his father's experiences and secrets.\nIt is risky, but the idea of meeting his father, and perhaps something more, compels Yuito to make the journey...\nThe people and places Yuito encounters along the way - these will be the story of the game.\n2-3 hours long.\nNavigate surreal and ''realistic'' areas via simple 3rd-person movement and light platforming. Easy to play.\nConverse with characters small and large as Yuito progresses deeper into this Memory World.\nA lo-fi art direction influenced by the PSX and N64 era.\nA soundtrack by Sean \"seagaia\" Han Tani, and talented collaborators.\nFrom Sean Han Tani, the co-creator of Anodyne and Even the Ocean.\nComing Fall 2017 for Windows/Mac. Wishlist the game today!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sean Han Tani","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":45661,"name":"Hyper Universe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/235/2352468213b934a59d73b0ff57c8840d.jpg","description":"Pulled from across the universe, the Hypers take many shapes and sizes: A mage who rains down giant snowmen, a mongoose riding astride an armored rhinoceros, a tentacled Admiral with the power of the kraken at his call, and more! Through crazy exhibitions of skill, they compete to hone their power and seek the key to unlock the salvation of the universe.\nIntense Side-Scrolling MOBA Action: Hyper Universe combines the gameplay found in a side-scrolling action platform title with the highly strategic team-oriented play of a MOBA.\nDynamic Hyper Roles: Choose from a diverse set of both new and traditional MOBA roles that create a frenetic battlefield dripping with synergistic opportunities. Whether you prefer to be the tanky engager or just yearn to deal excessive amounts of burst damage, there’s a role that will fit your playstyle.\nStranger Danger!: What’s that around the corner?! The battlefield is riddled with dangers and mechanisms destined to be employed by enemies and allies alike. Team up and discover unique strategies as you climb ladders, bust through floors, and warp behind your enemies in pursuit of hyper victory.\nExplore the Battlefields: Travel across multiple universes as you battle on unique maps that consist of varying turret lanes and jungle camps. Fight for control across the seven-level high map variants and prove you can rise to the challenge of Hyper Universe.\nIt’s a Hyper Universe… Anything goes.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"CWAVESOFT","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":35297,"name":"Sacred","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73f/73fff0ec09d7ce2423f0fed1db534ad1.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"ASCARON Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":32785,"name":"Heavenly Sword","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de5/de54f4d1e6cfc2e4f9228f372021c536.jpg","description":"Emotionally charged, stunningly beautiful and delivering unprecedented character performances, Heavenly Sword truly showcases the awesome power of PlayStation 3. A dramatic tale of revenge sees Nariko, a fiery red-haired heroine embark on a quest for vengeance against an invading King and his army.\r\n\r\nThe story builds around the ancient Heavenly Sword which once belonged to a powerful deity. It can never be wielded by a mortal without it draining their life-force, killing them within hours. When the invading King (played by Andy Serkis of Lord of the Rings and King Kong) destroys the warrior clan that guards the Heavenly Sword, the clan leader’s daughter, Nariko, takes up the sword in a desperate fight for survival.\r\n\r\nNariko must now pay the ultimate price as she embarks on one last mission of vengeance against the King and his army before her life is finally drawn to a close… Heavenly Sword combines the visceral action and visuals of the best action movies with a ground-breaking, free-style combat system. You can freely switch between multiple sword types and a wide range of weapons on-the-fly.\r\n\r\nThe latest physics technology has been integrated into the combat, resulting in destruction on an epic scale as you destroy opponents and the environment alike. Battle through lush environments with operatic grace and style taking your fight to the clouds, over water, through tree-tops and more. Enemies employ complex squad-based fight choreography and can attack one-on-one, in groups of several dozen, or even in battalions of thousands, pushing real-time AI to levels unseen before.\r\n\r\nThree distinct fighting stances – Switch on the fly allowing you to create your own fighting styles\r\nPhysics-based Combat – Use debris against opponents; kick tables to halt an oncoming surge of fighters; smash the enemy into the scenery or throw bodies into other enemies using aftertouch controls\r\nFeaturing the acting talents of Andy Serkis, Steven Berkoff and more\r\nWide range of objects and weaponry including multi-skewering spears and devastatingly explosive bazookas.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Ninja Theory","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":31235,"name":"The Need for Speed","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/003/003467edf5e2fd4bb14fb9f215e86fda.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"3DO"},{"id":0,"name":"PC"}]},{"id":28883,"name":"NHL 10","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de4/de483775004958841226651f8381441a.jpg","description":"EA SPORTS™ welcomes you to NHL® 10 and the franchise that has redefined sports video game excellence. On the heels of capturing 12 Sports Game of the Year awards with NHL 09, NHL 10 builds off of its  ‘Best in Class’ momentum by delivering an enhanced gameplay experience that features more innovation, polished fundamentals, and deeper game modes. Utilizing a new board physics engine, use your body to shield the puck on the boards, then kick-pass it to teammates as winning one-on-one battles for possession along the boards becomes a test of will. An all-new first-person fighting engine enables you to trade punches and grab an opponent’s jersey to land a punch that sparks your team to victory. With more than 200 gameplay refinements that replicate the skill, power, strength, and finesse of authentic NHL action, plus a new Battle for the Cup mode, an evolved GM Mode, and improved Be a Pro and EASHL modes, your chance to prove you’re tough enough begins now.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":25153,"name":"Mortal Kombat: Armageddon","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3c/a3c585489971b680f628ebc28620e6c4.jpg","description":"For the fi rst time ever on the Wii™, players will be able to experience\nthe latest chapter in Midway’s award-winning, best selling video game fi\nghting franchise, Mortal Kombat®: Armageddon™. With the most complete\nroster ever, including more than 60 fighters from the entire Mortal\nKombat® universe (past, present and future), a revolutionary\nKreate-A-Fighter mode and Kreate-A-Fatality mode, plus a brand new\nKonquest mode and Endurance Mode, Mortal Kombat®: Armageddon™ promises\nto be the most complete, intensely lethal, fighting experience ever!","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Midway Games","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":25128,"name":"Galaga","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c92/c92797bedbbb006f8ecb6b1110ff8a07.jpg","description":"Move right and left to defend against the missiles and attacks of the\nGalaga aliens and the Galaga Commander. Aliens attack in formations\nusing a variety of attack patterns. Rescue a captured fighter to combine\nwith it, forming a Dual Fighter with twice the firepower! Earn Perfect\nBonuses more easily by using a Dual Fighter on the Challenging Stages!\nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii"}]},{"id":23606,"name":"Streetball VR","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c2/4c245a7a07061f1305b48ca81f02aa18.jpg","description":"The classic streetball arcade sport is back!\nExperience the pleasure of basketball when you step into the street one on one with the top finest in basketball action and play in different streets with beautiful backgrounds in VR.\nPractice your skills or take your talents and break the time record with your acrobatic jams and an astonishing display of skills.\nYou can spank the basketball with special skills and acrobatic moves and score a point in real-time. Whether you want to play against the computer or enjoy with others for high scores, you are rest assured of a more entertaining blast!\nThe game supports both HTC Vive and Oculus Rift.Game Features\n3 Maps\n4 Various colored balls\n2 Game Modes: Practice and Time Mode\n32 Hip Hop Tracks\nFree Soundtrack Download\nRequired Hardware HTC Vive + Motion Controller or Oculus Rift + Touch ControllerPlanned Features\nMore Cool Street Maps\nMore Game Modes\nOnline Multiplayer\nMusic Player for add own Music from Computer","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Indiecode Games","platforms":[{"id":0,"name":"PC"}]},{"id":21651,"name":"Protocol","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/767/7676df796f7c04199c37c46c8ba77cec.jpg","description":"You were chosen to execute the Protocol program. Your goal is to establish the first contact with the alien life form.\nYou have to perform a number of tasks under the control of artificial intelligence, on the territory of the research center, built around the wrecked alien ship. Any violation of the rules will lead to the elimination of you and the whole operation.\nRemember, the fate of humanity could depend on your actions.\nAfter you have agreed, the \"Protocol\" comes into force.Have A Nice Day.\nP.S. Protocol - It’s a first person action-adventure game, where you have to solve complex problems exposed by the artificial intelligence of the complex and at the same time conduct your own investigation.\nWelcome to the Complex: dive into a tense, moving plot, actions of which take place in the secret complex somewhere in the Arctic circle.\nVR+PC: You can play in VR and on PC, using familiar WASD + mouse look mode.\nSecrets and mysteries of the complex: explore and find out all the plot twists. What would you choose: Follow the Protocol? Or go against the system? It's up to you.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Fair Games Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":21042,"name":"TRIP","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3db/3db8726371981b1ed6e8db61dfec6722.jpg","description":"TRIP\nControl your Characters with your mouse to avoid the enemys!\nTRIP is a mouse-controlled strategy game. You can choose between diffrent\ncharacters, with multiple spells to stay alive in diffrent arenas. Collect\ncoins after every game-session to buy new characters and more.\nSkill your Character with experience points and level, to make it easier in the arenas\nMake your today a new Highscore!\nKeep listen for new Updates with more functions, characters and even Coop!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Axel Shokk","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19765,"name":"Stargazer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0a/c0a96d0d92bcb671f68f3180e506d66d.jpg","description":"Jaxx Fury, the legendary hero, returns to his hometown after years of exile. With his brave and unyielding spirit, he stands as the last hope against the dark wizard Nachtengel. As shadows loom and danger grows, Jaxx must rise to save his people and reclaim his destiny, that was once a dream, and shall be realized!\nTake control of our hero, wielding his legendary guitar as a weapon to battle hordes of enemies and conquer challenging obstacles! Navigate through vibrant levels filled with dynamic environments... with hidden 1UPs for you to find.\nFeatures:\nHeavy Metal music to go along with the fast-pace\nNovel levels to let players experience different ambiance\nChallenging obstacles with varying difficulty\nFinal boss worthy of rage!\nLet Nala guide you to Nachtengel and defeat him once and for all! Navigate the labyrinth of this cursed town with many different obstacles in your way.\nDo not be disheartened! Do not give up, no matter how difficult it gets. The town depends on you!\n... and finally, always head towards the gate!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"John Wizard","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16997,"name":"Artificial Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f9/9f9a16196bcf9acaa04121ecf06826b0.jpg","description":"In a nutshell:\"It's a yummy cocktail out of a AC130-Top-Down Shooter, RTS and a bit of Tower Defense. It's surely different, but it works out!\"\n1 simple task:Defend your Operation System (OS) against intruding creeps.\nThe execution might be a bit harder, though.FeaturesA new genre (RTS + Tower Defense + Orbital Shooter)\n21 Offense Weapons (From Flintlocks to Neutron Bombs and Nukes)\n21 Defense Towers (From Pistol Sentry Towers to Railgun Installations)\n7 Hardware- Levels (Evolve from Punch-Tape to Quantum A.I.)\n49 Challenges on 7 different Servers\n13 Music Tracks\nFiring off miniguns, launching Hellfire missiles, dropping incinerating Hades-Bombs and colossal asteroids, deploying mighty railgun and acid towers and spawning your own Intrusion Counter Measures (ICMs) to reconquer corrupted databases and firewalls are just some of the actions you can take while fending off the creeps. Earn RAM and upgrade your arsenal and hardware-level. Start as an analog punch-tape system and evolve into a quantum A.I. mainframe.Offense - Orbital ShooterThere are 21 offensive weapons available, reaching from outdated flintlocks, over maverick-missiles to devastating meteors and neutron-bombs. You can switch between three pre-loaded weapon categories and launch the installed weapons every few seconds. Each round you fire costs you RAM and each weapon type has its own unique cooldown so you must choose wisely and adapt quickly to different situations. But beware, aiming requires some skill. Creeps are moving targets and your projectiles need some flight time before impact. You can unlock and install new weapons in the uplab.[/b]Defense - Tower DefenseThere are 21 defense towers available, reaching from pistol-sentry-towers, over incinerating flame-throwers to powerful long-range railgun towers. In addition there are 7 production towers which produce your main resource: RAM (Random Access Memory). Yes, building up a small RAM economy is very important, in order to keep your system routines running. Towers must be deployed by an expensive capsule drop and you have to find the sweet spot between the right amount of resource production towers and the performance of your defense perimeter. You can unlock and install new tower versions in the uplab.Conquer - Real Time StrategySpawn Intrusion Counter Measures (ICMs) in order to conquer corrupted system-structures like databases, honeypots and firewalls. Databases e.g. spawn datablips, which carry valuable data and head for your backup-devices. Every datablip successfully arriving at its destination releases a certain amount of RAM, so you should do your best to protect those important but vulnerable convoys.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Thiemo Bolder, ONEMANGAMES","platforms":[{"id":0,"name":"PC"}]},{"id":16694,"name":"The Corporate Machine","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c5/1c503d7347847bf286457f4fa5669cb4.jpg","description":"The Corporate Machine™ is Stardock's classic 2001 real-time economic strategy game, available now on Steam. Dive back into the timeless battle for one of the most ruthless environments ever created: international trade.\nCorporations exist in a constant state of war: Plotting to destroy their rivals, CEOs chase world domination through economic strategies less deadly but more complex than any military maneuver. Control the market, or face the prospect of buyout and bankruptcy. Build your business empire, dominate the industry, and amass a fortune you will need that private island to fully enjoy.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":15524,"name":"Lazerbait","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e09/e093634e8c2f11f49e8264f428c69037.jpg","description":"Lazerbait is a free arcade strategy game set in virtual reality with one simple goal: capture all the planets to build more ships and destroy your enemies!\nThe player is presented with a god-like perspective of a system of planets. Each planet that a player owns will produce ships over time. Using the motion controllers, the player can direct their fleet of ships from planet to planet in attempt to capture as many planets as possible. The more planets a player owns, the more ships the player can produce. Eventually players can build up fleets of many hundreds of ships that lead to awesome massive space battles.\nThe player is challenged by up to 7 A.I. characters in free-for-all style who are also working hard to capture all the planets and eliminate their enemies. The game is highly configurable allowing players to choose the game speed, map size, ship limits, number of A.I. players, and A.I. difficulty. Maps are procedurally generated at random for each game played so no two games will ever be the same.\nGlobal stats and leaderboards are kept over time for the total number of ships destroyed and the total number of A.I. players defeated at each difficulty setting.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Taylor Stapleton","platforms":[{"id":0,"name":"PC"}]},{"id":14644,"name":"Alien Run","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fd/0fdc4b4e45f4afdd67058a4593d02264.jpg","description":"In a faraway galaxy, an evil creature of alien origin has built energy-stealing mechanical machines on six planets. Unless all of those machines are destroyed, the planets will die and the evil plans of an unknown villain will be brought to life. The main character - a little alien named Lou decides to save the planets and stop the villain.\nA long way to victory lies ahead of you. Don’t forget about the obstacles which will try to stop you from succeeding. Jump, run, crouch, and move between three layers to stay up!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hipix Studio","platforms":[{"id":0,"name":"PC"}]},{"id":12202,"name":"Spellstone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/513/513fe2c410a2c5af7033d43543fd8930.jpg","description":"Spellstone is a fantasy card game with beautiful hand-drawn art and rich lore! Collect hundreds of striking cards to battle through a compelling story to unravel the mystery of the Void.\nHeroes, creatures, monsters, demons, animals, and more are brought to life with a stunning hand-painted style.\nCapture Spellstones to unleash ancient and powerful creatures! However, there is dark magic at work on the island. Will you become a Hero or be consumed by the Void?\nDesigned for desktop players, Live Multiplayer PVP adds a new layer of competition to the world of Spellstone! And follow the world of Spellstone through a series of special stories and other events too, with branching tales and powerful treasures.\nDo you have what it takes to rise to the top of the Bounty Hunter charts? Battle players around the world for huge bonuses, powerful unlocks, and bragging rights.\nThree factions of heroes and creatures to battle and control. Do you favor the Powerful Wyld, Nimble Aether, or Fiery Chaos?\nHundreds different creatures to collect, upgrade and fuse!\nMaster powerful card skills to win an edge over your opponents.\nBattle thousands of other users around the world to prove who is the best!\n96 levels and 7 levels of mastery with endless player rewards for each.\nHundreds of hand-drawn character cards that evolve as they become more powerful!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kongregate","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":11846,"name":"City Climber","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0a/c0aea81a2f8cb0dc5ce47b0517a9a8c6.jpg","description":"City Climber is a silly physics-based game about climbing and finding your way through various environments. Progress through the story or enjoy funny challenges filled with falling and destruction.StoryFind your way through 14 levels filled with various obstacles.Unlock new customizations for your character.Compare your level times with friends and other players through integrated Steam Leaderboards!Local Co-Op - Two playersPlay through the story with a friend and test your coordination.Control a cubical robo-climber with differently colored arms.Each player has control of only one arm!ChallengesEach challenge mode contains 10 levels to play through:Step by Step - Use your environment to successfuly roll down the stairs.Leap of Faith - Jump from a crane and hit the target area below.Crazy Carts - Climb onto a vehicle propelled by fire extinguishers and make it to finish.Fall Hazard - Balance your body on various props and don't fall down.Broken Space - Fall through the floating debris and hit the cardboard boxes below.Party ModeLocal turn-based multiplayer for up to 4 players.Compete against each other in set of randomly selected challenges!- Support for Xbox controllers & controllers with Xbox control scheme","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SimpleGhost","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11386,"name":"Rad Rodgers: World One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d6b/d6bcb6613ea68f81201ed57f58e9da4b.jpg","description":"The StoryRad is a rambunctious but spirited young boy who maybe plays too many video games. After dozing off at the tail end of a long night of gaming, Rad awakens to find his dusty old console has turned itself back on. Suddenly a vortex emerges and he's sucked into his TV, where he finds himself the star in his very own video game adventure.\nDusty is Rad's good-hearted but foul-mouthed, now-sentient game console. His clock speed isn't what it used to be, but what he lacks for in megahertz he makes up for with experience and attitude!\nRad & Dusty's adventure begins in the First World, taking them through seven dangerous stages of action-packed, humor-filled, hardcore platforming fun. This decaying jungle world has been infected by a fierce corruption, and it's up to the unlikely buddy-duo Rad and Dusty to save the jungle's inhabitants and restore the Elder Tree as guardian of the land.\nFeaturesWeapons: Dusty arms Rad with a variety of radical bad-ass weaponry. The Bolt Blaster has unlimited ammo, is easy to use, and more than enough firepower to get the job done. The Phoenix Cannon shoots out a fiery bird whose wingspan lights enemies ablaze as it flies by. There are 5+ weapons in this first chapter, with more to come.\nSounds & Music: Our composer Andrew Hulshult combined his years of musical experience (both performing and writing) with his passion for retro-style gaming to create an amazing and authentic soundtrack for the game complete with MIDI-inspired music... And synthesizers!\nThe Pixelverse: While Rad and Dusty are a great team, only Dusty can enter the electrified Pixelverse -- a dangerous spacetime-breaking region that exists behind the game world. Dusty enters the Pixelverse when necessary to repair glitches in the running game world, allowing both Rad & Dusty to continue their journey.\nClassic Easter Eggs: The game features hard-to-find collectibles in sometimes even harder-to-find classic secret rooms. Use your precision platforming skills to collect 'em all.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Interceptor Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":10799,"name":"Red Death","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10a/10ae2d57dbc19c203320fcadd73f8181.jpg","description":"Red Death is a vertical shooter, Prologue of the series Project Starship!\nWhile dodging thousands of bullets, your duty is to destroy the unknown calamity that is afflicting the earth!\nSomething weird is going on!\nWill you save humanity from extinction?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"EastAsiaSoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5690,"name":"The Sims 3 Pets","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/301/301221cbcc8aefa4c7412bd2a530b0f8.jpg","description":"<br/><br/>Create perfect—or imperfect—pets for your Sims, from fierce guard dogs to destructive kittens to trusty horses and more as you determine not only how your Sims’ pets look but their personality traits as well. With a variety of new activities and social interactions, take control of these pets and experience the world from their perspective. Give your Sims a new member of their household and discover all-new ways to play with life!<br/> <h3>Key features:</h3> <ul><li>More pets mean more fun! Create a wide variety of unique dogs, cats, and—for the first time ever—horses! Think your Sim has what it takes to tame a wild horse?<br/> </li><li>Be the Pet. Wield control of your Sim’s pet to chase, dig, tackle and more. Be the perfect companion or wreck havoc on your Sims!<br/> </li><li>Pets have their own traits! From intelligent, brave, and friendly to hydrophobic, skittish, and clueless to gentle, fast, and agile, determine the personality of your Sims’ pets.<br/> </li><li>Pets can learn skills. Cats and dogs can learn to hunt, dogs can learn to locate collectibles and fetch your Sims a date, and horses can learn racing and jumping.<br/> </li><li>Sims can take their pets outside! Take Spike to the park, bring Whiskers to the library, or ride Star to the new Equestrian Center.<br/> </li></ul><h3>Online Disclaimer</h3>\t\t\t\t\t\tINTERNET CONNECTION, ONLINE AUTHENTICATION, ACCEPTANCE OF END USER LICENSE AGREEMENT, AND LATEST THE SIMS 3 PATCH UPDATE REQUIRED TO PLAY THE SIMS 3 DIGITAL DOWNLOAD PRODUCT. ACCESS TO ONLINE SERVICES INCLUDING SIMPOINTS AND DOWNLOADS REQUIRES AN INTERNET CONNECTION, EA ACCOUNT AND GAME REGISTRATION WITH THE PROVIDED ONE-TIME USE SERIAL CODE.  REGISTRATION IS LIMITED TO ONE EA ACCOUNT PER SERIAL CODE AND IS NON-TRANSFERABLE. EA ONLINE PRIVACY POLICY AND TERMS OF SERVICE CAN BE FOUND AT http://www.ea.com/. YOU MUST BE 13+ TO REGISTER FOR AN EA ACCOUNT.  MAC USERS MUST UPDATE TO THE LATEST VERSION OF THE SIMS 3 LAUNCHER TO ACCESS ONLINE SERVICES, INCLUDING SIMPOINTS AND DOWNLOADS.  [Manual only: EA MAY PROVIDE CERTAIN INCREMENTAL CONTENT AND/OR UPDATES FOR NO ADDITIONAL CHARGE, IF AND WHEN AVAILABLE.]  THE SIMS 3 DIGITAL DOWNLOAD PRODUCT USES SECUROM DIGITAL RIGHTS MANAGEMENT TECHNOLOGY PROVIDED BY SONY DADC AUSTRIA AG.  FOR MORE INFORMATION ABOUT SECUROM, VISIT HTTP:/FAQ.SECUROM.COM/. GAME CAN BE PLAYED ON UP TO FIVE COMPUTERS AT THE SAME TIME; USERS CAN MANAGE WHICH COMPUTERS ARE AUTHORIZED OR DE-AUTHORIZED TO PLAY GAME.  VISIT http://activate.ea.com/deauthorize/ FOR MORE INFORMATION ON DE-AUTHORIZATION. INCLUDES SOFTWARE THAT COLLECTS DATA ONLINE NECESSARY TO PROVIDE AND ACTIVATE IN-GAME ADVERTISING FOR ALL THE SIMS 3 PRODUCTS PREVIOUSLY OR HEREAFTER INSTALLED.<br/>\t\t\t\t\t\tEA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON http://www.ea.com/1/service-updates.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"}]}]