[{"id":36649,"name":"Fate (2005)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ac/6ac38734827f01e8f7b29f104bd3326b.jpg","description":"**FATE: The Traitor Soul is now live on Steam!**\nPlay (or Re-play) This Classic Dungeon Crawler!\nDuring the golden days of action RPGs, FATE was a powerhouse, winning runner-up for PC Magazine’s Role-Playing Game of the year.  Popular enough to spawn 3 sequels, this was one of the premier dungeon crawlers of its time.  Now is your chance to enter the legendary town of Grove and experience the original for yourself!\nHello, traveler.  Journey to the outskirts, where the Old Wood meets the Dungeon Gate.  Battle vicious creatures, collect unique weaponry, learn powerful spells and glory will be yours.\nRise and test your worth! Step forward and determine Your FATE!\nNEW Steam Trading Cards – Fans of old (and fans of new) can enjoy this never-before-seen art!\nNEW Steam Badges – 6 levels for you to collect, hoard and show off.\nNEW Steam Emoticons – Oh, you’re old school all right, throw a little FATE into your chat to prove it.\nNEW Profile Backgrounds – FATE up your profile with these beautiful works of art made especially for Steam players.\nGameplay – It’s quick, immersive and classic.\nProcedurally generated levels – Explore limitless caverns, dungeons, mines and tunnels.  What will you find?\nEconomy - Buy and sell items… or try your luck with shopkeeper!\nPet - Choose a dog or cat and evolve it into more and more powerful creatures.  Rawr.\nStreet Cred – Up your gamer street cred by playing this classic game and show those hipsters what for!","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"WildTangent","platforms":[{"id":0,"name":"PC"}]},{"id":25119,"name":"TMNT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24b/24b4255973b9f45ca7ae669bbf27e646.jpg","description":"Based on the all-new CGI TMNT movie, Ubisoft’s TMNT video game takes\nplace in New York City, a city plagued with fast-moving shadows and\nattacks from strange creatures. Could the wealthy and mysterious Max\nWinters be involved? New York City needs the Turtles now more than ever\nbut they face their most trying time both as heroes and as brothers.\nWith the fate of the City and their family at stake, it’s up to Leonardo\nwith Zen Master Splinter to restore unity and ninja discipline to the\nTurtles. In this highly immersive experience, join the Ninja Turtles\nteam and experience intense acrobatic navigation, collaborative combat\nand powerful fighting moves. Engage in over-the-top Ninja action to\nreunite the Turtles and save New York City.\n\nFeatures\n\n• Embody All Four Famous Turtles\nLeonardo, Raphael,\nDonatello and Michelangelo are playable, each with unique acrobatic\nmoves, weapons and combat skills, such as Michelangelo’s fast nunchuk\nface slap and Raphael’s powerful Sai throw.\n• Extends the\nTMNT Movie Experience\nThe video game uses the same dark and\ndangerous environments and same themes in the new TMNT movie. Will the\nTurtles be able to unite against the odds or will sibling rivalries\ncreate an unstoppable rift between the brothers? Only the players\nabilities can determine the outcome for the family.\n• Intense\nNinja Fighting\nBy harnessing the power of Ninjitsu, the four\nTurtles have become masters of combat. Leonardo shows a calm discipline\nwhen he faces his foes, attacking carefully and masterfully. Donatello’s\nbow staff can be used to reach distant enemies and as a pivot for him to\nswing himself around the arena. Michelangelo is a fast, flamboyant,\nenergetic fighter, good for quick slashes with nearby enemies but for\npowerful direct attacks nothing beats the intensity of Raphael’s\npowerful Sai punches.\n• Unique Acrobatic Navigation\nThe\nTurtles jump from rooftop to rooftop, scale tall buildings, dive into\nsewers and race through every corner of the city to confront their\nenemies. Using the Jade Engine, from the Prince of Persia franchise,\nUbisoft’s acclaimed Montreal development team brings a unique fast-paced\nnavigation element to the Turtles gameplay.\n• Powerful Tag Team\nMoves\nTogether the Turtles can team up to reach locations\nunattainable alone, or use their unique individual abilities to find\nalternate routes and secret areas of New York City. By pairing up in\ncombat, the Turtles can leverage their combined powers to create a\nmultitude of devastating attacks to cripple the enemy.\n• Diverse\nEnemies and Bosses\nCharacters from the movie and the original\ncomic book series creep out of the shadows to face the Turtles. From the\nPurple Dragon Street Gang to the infamous Foot Clan, a new group of\nenemies lurks in the sewers. Find out what their plan is and how the\nTurtles can stop them.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Ubisoft","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":18870,"name":"Star Fields","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34e/34e2617ce68e9e7b8ca4b41325a876ed.jpg","description":"Star Fields is a casual, arcade style game with strategy and shooter elements.\nSimple, fast paced game-play, enjoy the original electronic/progressive/synth/retrowave soundtrack or import your own mp3s and listen to them while you play!Features: Simple, fast paced game-play - Collect rings of the same colour to boost your score\nCollect power ups.\nOriginal electronic/progressive/synth/retrowave soundtrack.\nImport your own mp3s and listen to them in game!\nOnline leaderboards.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"AG media","platforms":[{"id":0,"name":"PC"}]},{"id":12458,"name":"TAIKU MANSION","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51e/51e3e2ca09ae8249df25fc0ae4eca20c.jpg","description":"After recieving a voicemail from a friend whose been dead for 5 years, you head to the location as directed and end up at Taiku Mansion. As soon as you step inside, the front door jams shut behind you. It was a trap. An ominous voice fills the mansion and your mind. You have no idea who this voice belongs to, but they want you dead. You have until dawn to escape the mansion. Fail and you're dead. succeed... and you might just live to tell the tale.\nFeatures\nUnique Puzzles: Every puzzle you face within the mansion is unique and different. No two puzzles are the same so you will be forced to you every inch of your cunning and wit to solve the mysteries before it's too late.\nClassic Gameplay: Using gameplay tropes from classic text adventure titles, mixed lovingly with modern staples of the game industry - use a simplfied interface to navigate around the mansion with ease.\nHaunting atmosphere: Every sound, image and puzzle has been hand crafted to send the chills through every hair on the back of your neck. Every crunch, punch, footstep and door opening has been tuned to ensure you never feel safe whilst solving the riddles of Taiku Mansion.\nDeeper Story: Taiku Mansion features a narrative written by Ryan Shah (Kitatus), who has written a number of extremely popular books, both fiction and non-fiction. Every word, letter and phrase has been inserted with the greatest attention to detail to add to the creepy aesthetics of Taiku Mansion.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ST. TAIKU","platforms":[{"id":0,"name":"PC"}]},{"id":21112,"name":"Combat Wings: Battle of Britain","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef1/ef1cf740193cdba7f94579b25b00ea04.jpg","description":"Destroy the Luftwaffe!\n\nThere’s something new in the air, and it’s more than the hum of hundreds of aero engines... As the Luftwaffe launches its aerial offensive, the outnumbered Royal Air Force is scrambling to bring into combat new planes that will ensure victory over a stronger foe. Will they succeed? It’s up to you, and your Hurricane or Spitfire. If you hold off the enemy long enough, you’ll be the first to fly the Hawker Tornado and Westland Whirlwind into combat, and enable the Empire to strike back before Reichsmarschall Goering finishes his breakfast. You’ll be rewarded with bonus missions, promotions, decorations, and a view of burning Berlin from the tail turret of a Halifax bomber. Join in the new Battle of Britain. Your aircraft is ready and waiting...\nEnjoy the realism of a detailed damage model, stunning graphics, and outstanding special effects\nChoose between arcade and flight simulator control modes, and the RAF or the Luftwaffe in multiplayer mode\nGet on board of one of realistically modeled planes, e.g. Spitfire and Hurricane and dive into the world of ultra realistic air fights\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"City Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":20845,"name":"How To Survive: Third Person Standalone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63e/63eba98e69f7d5bfc7e980ad96bdc0f8.jpg","description":"Special OfferHow to Survive 2 on Early Access now!\nAlso remember that if you own How to Survive: Third Person Standalone there is special gift waiting for you!\nhttp://store.steampowered.com/app/360170Survivor Loyalty Item: “Primal Fear” Armor Set.If you are already a survivor who’s got How to Survive or How to Survive: Third Person Standalone on Steam, we welcome you back with a very special treat: the “Primal Fear” armor set!\nA set of protective gear finely crafted out of the best bones and scrap metal that can be found in the dumpster. Made by master Survivalist Kovac himself, it promises to keep bites and scratches to a minimum while displaying a distinctive swamp-chic style!\nJoin Early Access now, slip it on and knock’em dead!\nAbout the GameDriven by community suggestion, 505 Games and EKO Software introduce you to a new single player 3rd person view experience that allows you to re-play the zombie crafting adventure \"How to Survive\" from a deeply immersive point of view. Their rotten breath doesn’t smell any better, they don’t look any healthier, they still just grunt, but being closer up makes it a whole load more personal...\nYou’ll have to survive a zombie infested archipelago crafting your own tools and weapons to fulfill your basic needs of food, water and shelter while facing natural and unnatural threats. A survival guide written by an eccentric stranger may be your only help…Features:Navigate islands filled with exuberant scenarios filled with flora and fauna.\nChoose among 4 playable characters, with different stats and skill progressions.\nHunt, fish, forage for food and water.\nHundreds of items to handcraft weapons and tools. From fishing rods to flamethrowers.\nPlay through the Story Mode or 8 demanding challenges.\nAdditional free roaming mode includes Permadeath!\nThree difficulty levels, including new improved difficulty conditions for die-hard survivors! How to survive?   Any which way you can!Game includes:All the content of the original game How To Survive :\n- 4 islands.\n- Story mode.\n- 8 challenges.\n- Leaderboards.\nKovac’s way DLC:\n- Gameplay affecting rain effect.\n- Crocodile & bear.\n- Item durability.\nHello, my name is Nina DLC character & flamethrowers.\nOne Shot Escape DLC - Rogue like mode.\nTombstones & Backpack extension.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Eko Software","platforms":[{"id":0,"name":"PC"}]},{"id":19700,"name":"Advent Rising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/60d/60de445e6c692a1e43a85896bf3c32ef.jpg","description":"In Advent Rising, a common legend pervades the galaxy--that one day humans will deliver the universe. Many view humans as the messiah, a symbol of hope, or fantastical creatures, but the Seekers view them as enemies that must be destroyed. In third- and first-person points of view, you'll realize what it means to be truly human as you delve into an intergalactic saga. Advent Rising sets you on an action-packed adventure where you'll develop superhuman powers, wield an arsenal of high-tech weapons, and command a vast array of futuristic vehicles.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"GlyphX Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":19399,"name":"The Last Express Gold Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3a/a3ac7194d9a76a7d20166bd421f2ffc3.jpg","description":"Feature List•\t20+ hours of game play: interact with 30+ characters, move in real-time and converse with them\n•\tYour actions affect other characters’ behavior, making every play-through different\n•\tRewind feature allows you to back up and choose a different course of action\nNEW “GOLD EDITION” FEATURES:\n•\tAdvanced hint system\n•\tNew more intuitive UI & improved inventory\n•\tChallenging achievements to test your sleuthing skills\n•\tCloud Saving (Steam)\n•\tIn-game bonuses (unlock characters biographies and more)\nAbout the GameStep aboard the 1914 Orient Express in this award-winning mystery adventure from Prince of Persia creator Jordan Mechner.\nDescribed as one of the best adventure games of all time, The Last Express is an intrigue-filled adventure set aboard the luxurious Orient Express. In July 1914, on the eve of World War I, as the train departs on its final journey from Paris to Constantinople, the player steps into the shoes of Robert Cath, an American doctor with a mysterious past. A fugitive from French police, Cath boards the train in answer to an urgent telegram from his best friend – and plunges into a maelstrom of conspiracy, romance and murder.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18915,"name":"Last Word","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07d/07d15c6084074063d4616401f2cf16f8.jpg","description":"Photographer Whitty Gawship attends a prestigious get-together at the residence of the impressive Professor Chet Chatters. Members of the party are veteran conversationalists, each trying to gain subtle power over one-another. The mood shifts when Whitty and the others discover that the professor can get the \"Last Word\" in every conversation via his miraculous invention. Dastardly!\nBut what are the professor's motives? And why invite a commoner?\nLast Word is an unconventional JRPG. Battle sophisticated guests using words as weapons. Collect topics by gossiping to unlock mysteries. Drink wine. The night is young and no one can leave until the devious Professor Chatters says so! Can Whitty and Seymour overcome the power of the professor's amazing machine? Or will they succumb to the saucy banter of the motley aristocrats around them? Don't hesitate in getting the Last Word.Features\nUnique battle system! Fight with the subtle nuances of conversation.\nEngaging storytelling! Get whisked away by a narrative brimming with character! And fun!\nKey Topic System! Gather gossip to unlock more... gossip!\nVocal SFX! Each character has their own awe-inducing sound. Listen to the quality of that throat clearing!\nBow Ties! Learn skills and equip them using snazzy Bow Tie Points!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Twelve Tiles","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18268,"name":"Data Jammers: FastForward","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5e/a5e7f0266ff8d571073d697ed4cb8dca.jpg","description":"Data Jammers: FastForward is a continuously moving three dimensional driving and destruction game set within a retro wireframe world of impossible race tracks. Prowl twisting bitstreams amidst bizarre geometrical environments enhanced by otherworldly soundscapes as your nimble avatar encounters more dangerous denizens, hazards and boss guardians along the way!\n\nYou are a Data Jammer...specifically a D.O.O.D. (Digital Operative, Optical Data),  an elite virtual commando tasked with one purpose: Infiltrate the virtual Vaults of Ouroboros, the Military Industrial Complex, and take down The System!\n\nThe Deep Grid. The Wilderness. You've heard the hushed rumors about a \"network behind the network\"; a sub-cyber matrix of covert datastreams utilized solely by the Dark Powers of the world. Now, after several risky excursions beyond vast Pulsor City, you know the truth --Ouroboros exists!  In defiance, you have trained to work for the Good Guys to preserve Freedom by defeating the devious Grid Guardians, exposing the sinister secrets of those evil villains who use it to conspire and oppress!\n\nFrom the makers of Brainpipe: A Plunge to Unhumanity, Weird Worlds: Return to Infinite Space, Dr. Blob's Organism, and Strange Adventures in Infinite Space.\nKey features:\t\t\t\t\t\t Zen-inducing frenetic arcade gameplay\nArresting 3D visuals and audio\nMindbending race tracks\nIncreasingly challenging environments, critters and hazards per level\nEasy to learn and play\nBrisk play sessions\nExcellent replayability\nHands on tutorial\nSupports game controller and good ol' fashioned keyboard\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Digital Eel","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17475,"name":"Star Wars: Trials on Tatooine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3eb/3eb66904f7de7c252673a280ea8bd2c8.jpg","description":"Take Your First Step into a Larger World of Star Wars\nThe creative minds of Lucasfilm’s ILMxLAB present a virtual reality experiment set in a galaxy far, far away…Star Wars: Trials on Tatooine. For the first time ever, wield a lightsaber as you leap into action in the most immersive Star Wars virtual reality experience ever. Be transported to the desert world of Tatooine, repair the iconic Millennium Falcon, and defend the plucky droid hero R2-D2 from incoming stormtroopers in this captivating experience set after the events of Return of the Jedi.\nUsage Notes\nTrials on Tatooine uses a single controller. We support both 5.1 surround and headphone audio, pick the setting with the icon on the intro screen for your configuration.\nTrials on Tatooine approaches photo-realistic quality and requires a powerful computer. The quality setting on the left of the introduction screen should default to the correct setting for your system. If you drop frames try setting the quality knob one lower. In general, a minimum spec computer will run on the lowest setting while a fast computer with an Nvidia Titan X GPU will run on the highest setting.  Trials on Tatooine also supports SLI and will automatically render on two GPU’s if available.\nThis software is offered for noncommercial, personal use only.\nPrivacy Policy – http://disneyprivacycenter.com\nTerms of Use – http://disneytermsofuse.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ILMxLAB","platforms":[{"id":0,"name":"PC"}]},{"id":13947,"name":"Midnight Carnival","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de7/de75bea04474d27802884b42348824ac.jpg","description":"Midnight Carnival\nMidnight Carnival is a Visual Novel with a dark and disturbing story and theme.\nAbout the game:\nBrandon is a mentally unstable, antisocial young man ,suffering from deep depression. He craves a change in his life, but having no strength to make changes on his own, he hopes for miracle. Brandon will come to understand, that his miracle will come at a great cost.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Delusional Games","platforms":[{"id":0,"name":"PC"}]},{"id":10201,"name":"HEX: Shards of Fate","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13e/13e89e8cbfd6a999c58f3a774dcd799f.jpg","description":"HEX: Shards of Fate – Magical World for Keen Card Players\nHEX: Shards of Fate is an exciting challenge for fans of cards, action and strategy. Explore the fabulous world of Entrath, wrestle your way through sinister dungeons and use skill and guile in matches against other players.\nThis digital card game combines the best of two worlds: classic TCGs and online RPGs. Create powerful decks from over 1,000 unique cards and dive into epic battles. Earn equipment items and use socketing gems to further improve your deck, whilst a variety of champions with individual skills complement your card armies. Cool animations and effects enrich the gaming experience on your road to victory!\nExperience HEX: Shards of Fate\nPlay the first digital TCG with RPG elements\nSelect a champion from eight races and three classes\nExplore dungeons in the exciting single-player mode\nPut your skills to the test in 1 vs 1 matches and hone your strategies\nTrade cards with friends and other players\nWin amazing prizes in daily tournaments with up to 128 players","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hex Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3379,"name":"Tiny Troopers Joint Ops","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8cb/8cb1eafabaf20d227b0b7ef733705eeb.jpg","description":"Tiny Troopers Joint Ops is an epic bite-sized arcade shooter, filled to the brim with action-packed mini maps of mayhem and ALL NEW content EXCLUSIVE to Xbox One!\nTake control of your tiny troopers as you battle evil adversaries from around the world with a multitude of weapons. Recruit specialist mercenaries such as Medics, Machine Gunners and the Elite Delta Force to subdue enemy insurgents! Collect medals, dog tags, Intel and more during the course of each mission to ensure victory.\nEXCLUSIVE NEW CONTENT TO XBOX ONE - experience the ALL NEW Zombie Wave Maps where the desert-dwelling dead are descending in droves to devour you in “Operation: Zombie Storm”, or fight back against a flock of poultry that ain’t paltry in “ZFC”, cruise and clear the airfield of cantankerous cadavers in “Zombie Patrol” or call in help from the skies whilst facing endless waves of Zombies in “Z-End”.\nIf you think you are tough enough, try the Ultra Hard Mode – all complimented by a brand new cinematic soundtrack and all completely EXCLUSIVE to Xbox One!\nWith over 7 hours of gun toting explosive gameplay, Tiny Troopers is miniature warfare on a massive scale!\n• Over 60 action-packed mini-maps of mayhem including Zombie Survival Mode with online leaderboards!\n• Recruit specialist mercenaries such as Medics, Machine Gunners and the Elite Delta Force to subdue enemy insurgents!\n• Twin-stick arcade control system to blast your way through waves of enemy rebels.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wired Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":14,"name":"Tetrobot and Co.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/792/792efebdeb29cb4492d30a963eb38440.jpg","description":"Tetrobot is the world's most popular and reliable robot, but he's not perfect. That's why I, Maya, have built him a microscopic little brother, Psychobot.\nHelp me guide Psy through Tetrobot's cogs and circuits: by swallowing blocks of matter and spitting them out, we can repair anything. Learn how pipes, lasers, fans and other electronic devices work, learn how to alter the chemical properties of slime, and collect all the memory blocks that you find on the way.\nThe owners of damaged Tetrobots all around the world rely on us because we are the only people who can repair their precious robots.Key FeaturesPure puzzle gameplay for gamers who like to give their minds a workout.\nOver 50 levels to play and even more secrets to unlock.\nOriginal music composed by Morusque (Knytt Stories, Saira, Blocks That Matter, Exodus)\nFind out what became of Tetrobot, Alexey, Markus and Maya, 15 years after \"Blocks That Matter.\" Steam FeaturesSteam Achievements: An even greater challenge for avid gamers.\nSteam Cloud: Start a game at home, finish it at work (if you're careful).\nSteam Workshop: Create your own puzzles and share them in one click (available soon).","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Swing Swing Submarine","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":57799,"name":"Spyro: Year of the Dragon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b8/4b823c94b723f1dc99b6f0d1cf00349d.jpg","description":"Spyro: Year of the Dragon (also known as Spyro 3) is a platformer video game developed by Insomniac Games and published by Sony Computer Entertainment for the PlayStation in 2000. Year of the Dragon is the third installment in the Spyro series. The game was the last Spyro game Insomniac developed; their next title would be Ratchet & Clank for the PlayStation 2. It was released in North America and for PAL regions in October and November 2000, respectively, but unlike the other two games, it was not given a Japanese release.\nNamed after the animal of the Chinese zodiac, which was the symbol at the time of the game's release, Year of the Dragon follows the titular purple dragon Spyro as he travels to the \"Forgotten Worlds\" after 150 magical dragon eggs are stolen from the land of the dragons by an evil sorceress. Players travel across thirty different worlds gathering gems and eggs. Year of the Dragon introduced new characters and minigames to the series, as well as offering improved graphics and music.\nUpon release, the game sold more than two million units in the United States and received critical acclaim. Reviewers noted the game built on the successful formula of its predecessors by adding more games and expansive environments. It was followed by the multiplatform title Spyro: Enter the Dragonfly. It was later re-released under the Greatest Hits label, fixing numerous bugs as well as adding additional music.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PlayStation"}]},{"id":20356,"name":"Damned","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/010/010cf96a586bd8f54d479b5f9d2cce4d.jpg","description":"Damned: A Randomized Online Horror Game\n- What is Damned?\nDamned is a randomized online horror game for up to 5 players (4 survivors and 1 monster).\nYou’ll be able to play as one of four people trapped in different haunted places (hotels, hospitals, etc).\nAs a survivor your main objective will be finding your way out, as well as helping your friends get out too. You’ll often find yourself on the edge, hearing and seeing ghostly things, trying to find keys and items to help in your escape. And sometimes you’ll find yourself running desperately from a monster, who’s there only to find and kill you and your friends.\nYou’ll also be able to play as the monster. The game will feature different monsters, each one unique in its gameplay and hunting style.\n- What kind of horror game is Damned?\nDamned explores the sense of being defenseless against a powerful supernatural force. The survivors can’t directly affect the monster in any way. When it’s there to get you, your only chance is to run and hide.\nThis perception of being defenseless is very strong, primal and terrifying, it builds up anxiety and makes you really scared, fearing any unexplained noise or movement.\nThis is how Damned creates horror in a multiplayer game session, and we believe it to be super effective! (tested and approved!)\n- Why is Damned a randomized game?\nEvery stage in Damned is randomized:\nAlmost all the objects in a stage may or may not appear;\nThe item system is fully random too, randomizing which item will appear in the game, and where it'll be;\nThe way to win a match as a survivor is also randomized;\nEven the stage may trigger random events to scare the survivors inside.\n- Why is Damned a competitive and cooperative game?\nBecause in a full game, with 4 survivors and 1 monster, there’ll be a survivor “team” cooperating to try and escape together, and at the same time they’ll be competing against a monster, trying to flee from him and deny each one of its attempt to hunt and kill a survivor.\n- How to play as a survivor?\nAs a survivor you’ll be cooperating with your friends (up to 4 survivors in a single game session):\nYou and your friends will be searching the level for keys and items to help in your escape;\nEach survivor will have a flashlight that can be turned on and off, helping you see your surroundings, but at the same time letting the monster know where you are;\nThe survivors will be able to manipulate objects throughout the hotel, like drawers, doors, safes, cabinets, wardrobes;\nChallenge yourself to find the exit and get out alive.\n- How to play as the monster?\nAs the monster, your game will be all about competing alone against the survivors team.\nThe game will feature different monsters, each one unique in its play style. It's up to you to play a few rounds with each monster and decide which one works best for you.\nHow are you going to hunt and kill the survivors?\n- Why is Damned worth buying?\nBecause it’s fun!\nIt’s really scary, you’ll find yourself on the edge a lot of times, trying to evade the monster or trying to pay closer attention because you don’t know if the sound you just heard is some random noise or if it is the monster haunting you.\nIt’s a real horror game, it explores deeply the feeling of being completely defenseless against a powerful force that can finish you easily. Your only choice is to run and hide!\nAnd also because it’s really fun to play as the monster as well. You’ll keep haunting and building up anxiety in people, making them terribly scared of you. We really put you in the skin of a terrifying monster.\n- Links and contact:\nGot any questions and/or suggestions? We want to hear your opinion, please contact us: contact@9heads.com\nDamned: http://www.damned-game.com\n9heads Game Studios: http://www.9heads.com\nFacebook: http://www.facebook.com/9heads\nTwitter: http://www.twitter.com/9headsGames","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"9heads Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":13516,"name":"Dungeon Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ee/7ee870be1aa4ec55d85906be3f5717a5.jpg","description":"Challenging 2D platformer with simple graphics and great chiptune soundtrack. Try to get out of a dangerous dungeon full of enemies and traps.\nFeatures:\nMinimalistic graphics\nHardcore gameplay\nGreat original Soundtrack\nMany levels\nEnemies blast if jump on their heads\nCoins! Who does not like a coins?\nCan you pass all the tests and get out of a dangerous dungeon?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alexey Roenko","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":10806,"name":"Original War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0e/e0e932ec00ca3383b42eb94c9fbc57f1.jpg","description":"An American geological expedition, under a UN mandate, assesses the natural resources in a distant part of Siberia, deep in the trackless steppes of Eastern Russia. But instead of oil, they discover a deposit of a hitherto unknown mineral.\nAmerican scientists working for Department of Defense find out that this mineral is in fact identical to the substance used to power an extraterrestrial artifact in their possession. This object is called the EON (Extraterrestrial Object Nexus).\nIt was found in 1919 by Colonel Emerson near the site of the Tunguska explosion. Emerson was the commander of a US military unit in charge of transporting US war supplies from the city of Vladivostok to the Eastern front during World War I.\nDoD Experiments have shown that items placed in the capsule are transported hundreds of thousands of years back in time. The American scientists were not able to understand its construction, nor could they manage to synthesize its fuel. Eventually, the machine - classified Top Secret - was stored, pending further advances in human science.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Altar Games","platforms":[{"id":0,"name":"PC"}]},{"id":7598,"name":"Splendor","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d1/6d1e001ea6e2a48079a98dd1d8f922c4.jpg","description":"The OFFICIAL digital adaptation of the best-selling board game Splendor.\n\nIn Splendor, you embody a rich merchant during the Renaissance. You will use your resources to acquire mines, transportation methods, and artisans who will allow you to turn raw gems into beautiful jewels, attract nobles and earn prestige.\n\nPress Reviews and awards:\n\n* Spielbox: *\"The app is a sparkling jewel…\"*\n* Pocket Tactics: *\"... I’m not sure there’s a better looking board game app on the market.\"*\n* Pocket Gamer: *\"... it's a sure-fire winner.\"*\n* Forbes: *\"...high replay value. Looks and sounds great, plays smoothly...\"*\n* Play Board Games: *\"The Splendor App is pretty splendid...\"*\n* Purple Pawn: *\"The quality of the tabletop-to-mobile adaptation is first-rate.\"*\n* Honor: Best Board Game App 2015 (BoardGameGeek)\n* Received the award of the Golden Geek Best Board Game App 2015\n\nThe digital version of Splendor faithfully adapts all the various elements of the Space Cowboys’ award-winning board game:\n\n* Fast and easy to learn, yet hard to master.\n* Lavish graphics and cards, true to the original game.\n* “Renaissance” graphical and musical ambiance.\n* Solo mode, pass & play and online multiplayer (2 to 4 players).\n* An exclusive game mode: scenario-based “Challenges”.\n* Historically-accurate background stories for Challenges set in the 15th to 16th centuries.\n* Multiple types of Artificial Intelligence, based on unique strategy behaviors instead of difficulty.\n* 3-minute step-by-step interactive tutorial to learn the game and digital interface.\n* Achievements board.\n* Worldwide leaderboards and rank system by connecting with a Days of Wonder account.\n\nSplendor introduces a special game mode, called Challenges. Challenges are based on historical events and anecdotes of the 15th and 16th centuries, setting up a real scenario in various places across the world. They teach you advanced techniques and offer rules variants. They put the player in unique situations with a goal to reach. Either earn a certain number of points or pick up a special card combination, in a limited time or limited number of moves.\nBecome a game expert and achieve 48 challenges along the trading routes of the world (Madrid, St. Petersburg…), not to mention duels facing  great historical figures such as Charles V or Marie Stuart.\n\nLanguages available: English, French, German","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":5397,"name":"Watchmen: The End is Nigh","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb4/cb47682bd285880ac37eb693d9edc3f7.jpg","description":"The lines between good and bad have been blurred and crime and terror run rampant in the streets.  The alleys, rooftops and sewers are crawling with criminals and brutal gangs.  And now, Underboss — in a daring escape — has broken out of prison and is ruling with vicious darkness.  The city is in need of saviors and only masked hero vigilantes answer the call... you answer the call.\nKey Features\nPlay as two unique Watchmen characters, each with their ownabilities:\nRorschach, a feral, street-wise fighter who can disarm enemies to use their own weapons against them\nNite Owl, a refined fighter who uses martial arts expertise and high-tech wizardry\nFight and watch the blood fly through six chapters of gut-wrenching in your face action.\nIntense, visceral — battles fight up to 20 enemies at the same time with bloody, street-fighting moves.\nClean up the streets with friends in split screen co-op multiplayer competition or solo","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":1269,"name":"The Bunker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ce/4ce75aff15d5fb52af09baff7e487749.jpg","description":"Video Games Just Got Real\nAs the last remaining survivor in a nuclear bunker, John’s daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self destruct. He has to venture into long forgotten areas, recovering long repressed memories and unlocking the dark secrets of The Bunker.\nThe Bunker is a completely live action experience with zero computer generated effects, filmed on location in a decommissioned government nuclear bunker with a plot crafted by writers and designers behind titles like The Witcher, SOMA and Broken Sword, and incredible cast including Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful, Assassin’s Creed 3).\nKey Features:\nAn incredible cast, including Adam Brown (The Hobbit), Sarah Greene (Penny Dreadful), Grahame Fox (Game Of Thrones) and Jerome St. John Blake (Star Wars)\nTotally live action - No CGI, no motion capture, shot on location in a genuine decommissioned nuclear bunker\nA complex, twisting plot written by award-winning screenwriters and designers behind Broken Sword, The Witcher and SOMA\nHidden secrets, documents and recordings to explore the mystery further\nNeo-retro soundtrack by composer Dom Shovelton","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wales Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":17739,"name":"King’s Bounty: Legions","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b2/5b2ccd9accda5b2d726b6396085aa67f.jpg","description":"King’s Bounty: Legions is vibrant, well thought-out 3D online strategy game with turn-based combat in a vast and diverse game universe.\nHead into a world full of magic, wondrous creatures and wicked monsters. Become a knight, forge armor in the smithy and amass an invincible army! Upgrade your troops and learn new spells.\nWage battle against friends and share your achievements! Join a clan or create your own.\nReinforce your garrison and assault others’. Complete hundreds of quests and truly earn your king’s bounty!Key Features7,000,000 players\nIn PvP mode you will encounter real opponents who don't necessarily fight by the rules. The game’s automatic selection system will match you up against an equal opponent from anywhere in the world.\n\nRatings and Clans\nDefeat your foes to climb to the top of the ratings. Siege enemy garrisons to procure elements with which to craft runes to enhance your army. Join a clan and work together to earn an aura, which improves your hero’s leadership.\nTurn-based Combat\nThe more you fight, the more valuable resources you will acquire with which to craft your hero’s gear. Plan carefully how to use combat spells, taking into account their duration and cooldown. Whether fighting your friends’ armies or hordes of various creatures, randomly generated obstacles on the battlefield will keep battles exciting and unpredictable.\nStar of Balance\nAssemble an invincible army by calling to your banners all sorts of creatures, and use their abilities to emerge triumphant from any fight. The game features over 50 creatures with 5 different combat styles: archers are effective against healers and mages, healers fare better against mages and defenders, while defenders have an advantage over warriors and archers… The abilities of all creatures are exceptionally balanced.\nHundreds of Quests\nKing’s Bounty: Legions is rich with lots of different plotlines. And as you travel the roads of the game world, in its cities and villages you will meet many people in need of your help and willing to make it worth your while.\nCult Series\nThe unsurpassed setting and unique atmosphere of King’s Bounty immerse the player deep in the magical world. This new game is a worthy addition to the legendary series, rightly considered one of forebears of the turn-based strategy genre.\nOne World for All Platforms\nKing’s Bounty: Legions is available on all popular social networks, as well as iOS and Android devices. Play anywhere, anytime, and on anything!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nival Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":10952,"name":"Guild Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/073/0737def014367b4fc3e566cdb9439642.jpg","description":"You’ve just bought yourself a new island with a derelict Guildhall and it’s time to fill it up with QUESTS!\nIn fact, it turns out that first island is just the start of many, and soon your quest empire will grow. Fill each island along the way, and unleash your guildians onto your own custom quest lines. You pick the types of quests you want and then reap the rewards.\nWant to take it slow and safe? Create a bunch of adventure quests. Want to indulge in the thrill of battle for higher danger but higher rewards? Build battle quests and reap in the XP to level up your guildians. Collect cards and equip them to gain permanent boosts, earn star points and invest them to even change the look of your guildians!\nCollect different guildian classes and equip them to whatever islands you have. Swap them out and find the best combinations for the job. Having trouble with some nasty orcs? Make sure you have some Knights to help protect the others, or maybe a Cleric will do the job and keep everyone healed. It's up to you!\nOnce you conquer an island and move onto another one, you can either leave your guildians behind or bring them with you to tackle new challenges.\nLuckily, your guildians are smart enough to do your job without question, even when you're not around! So come back later, collect your rewards, and expand further. Guild Quest has been designed to be much more of a Second Screen kind of game you can run on the side (even while playing other games).\nThe challenge curve is up to you. Build the world you want to see then sit back and watch your Guildians go!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hyper Hippo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":8042,"name":"A Good Snowman Is Hard To Build","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7f/b7ff238914d25fb9ab68b92389de18a8.jpg","description":"A Good Snowman Is Hard To Build is an adorable puzzle game about being a monster and making snowmen.\nAdorable graphics by Benjamin Davis\nFeaturing a gorgeous original soundtrack by Ryan Roth\nLovingly-crafted puzzle design from Alan Hazelden, one of the creators of Sokobond\nAwards:\nBest Character Design - Intel Level Up 2014\nOfficial Selection - Develop Indie Showcase 2014\nOfficial Selection - Screenshake 2015\nOfficial Selection - BAFTA Inside Games Arcade 2015\nOfficial Selection - Different Games Arcade 2015\nOfficial Selection - Fantastic Arcade 2015","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Draknek & Friends","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":5757,"name":"Tengami","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c1d/c1def68350ed273eedacc35590df5a88.jpg","description":"Tengami is an atmospheric adventure game set inside a Japanese pop-up book. Fold and slide the beautifully crafted paper world to solve puzzles and discover secrets.\nDiscover the wonders of a folding world\nGo on a serene journey through Japan of ancient fairy tales brought to life through striking visuals, unique gameplay and haunting music. Experience dark forests, abandoned shrines and tranquil mountain waterfalls as you seek to uncover the secret behind the lone dying cherry tree.\nFirst of its kind pop-up book gameplay\nNot a book, but a game inside a pop-up book. Tengami plays like nothing else before it. Reach directly into the world to flip, fold and slide parts of the world to delve deeper into your mysterious journey.\nStunning original soundtrack\nA beautiful and original soundtrack by renowned composer David Wise accompanies your adventure. Use of headphones is recommended for the most immersive experience.\nAuthentic and intricate\nTengami’s world is built as an authentically folding three dimensional pop-up book with an all new technology created just for this game. Everything seen in the game could be recreated in real-life with just paper, scissors and glue.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nyamyam","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":3803,"name":"The Raven - Legacy of a Master Thief","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fc/2fcac0cc77f15695e4bcff652a58c408.jpg","description":"'The Raven - Legacy of a Master Thief' is a thrilling crime adventure in three chapters from the creators of 'The Book of Unwritten Tales'. Full of twists and turns, it immerses you in both sides of the story, combining thrill-of-the-chase whodunit with the risk and reward of a heist story.\n\nParis, 1960. Europe is in the grip of the gentleman master thief The Raven. His burglaries are spectacular and he always emerges unscathed. Young hotshot investigator Nicolas Legrand stuns the public when he confronts the master thief and fatally wounds him.\n\nLondon, 1964. An ancient ruby – one of the legendary 'Eyes of the Sphinx' – is stolen from the British Museum. At the crime scene: a raven feather. Is somebody trying to follow in the Raven's footsteps? – Legrand is back on the case. At the same time in Zurich a phone rings. Constable Anton Jakob Zellner looks up from behind a mountain of files. He has no idea what lies hidden in a bank vault, just a few hundred meters away from him. As he reaches for the receiver his life takes a crucial turn…\n\nAll three chapters are now available:\nChapter I: The Eye of the Sphinx\nChapter II: Ancestry of Lies\nChapter III: A Murder of RavensKey Features:\tKing Art's thrilling crime adventure – full of twists and turns – immerses you in both sides of the story, combining elements of classic whodunit and heist stories\nCinematic presentation with hundreds of camera angles and dozens of cutscenes\nOptional puzzles and scoring system for adventure game veterans\nNotebook and help function for adventure game newcomers\nBreathtaking real-time 3D graphics in full HD","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":304206,"name":"Liberated","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93f/93f10e8d12d6d9bd3b8f8a55c761f079.jpg","description":"Liberated is an interactive dystopian graphic novel that unfolds on the pages of a comic book. The game is made up of 4 chapters - comic book issues showing the story from a perspective of different characters.\nIt is set in a dark world in the near future where technology turned against people. Under the pretext of ensuring security and order, many civil rights of citizens are being violated and modern technology has become a tool of the authorities to manipulate people. People are being surveilled in every possible way - via social media, CCTV, their online payments, device tracking and many others. Liberated is also a story about authoritarianism: about how it appears in a democratic society, gradually develops and ultimately tears it down.\nSTORY\nThe story presented in Liberated focuses on the fate of a group of people which has decided to oppose the new social order by using various methods of resistance even resorting to violence. On the other side there are representatives of the police and government, for whom the priority is to ensure order by all means possible, sometimes even by violating human freedoms. By exploring the story from different perspectives and both sides of the conflict, player learns the history of a world and begins to understand the motivations of various characters. The player also learns that any action and any decision will bring consequences and story can change.\nGAMEPLAY\nThe gameplay is made up of 2.5D platformer, where the player moves in 2D within 3D environments, story elements presented within heavily stylized and animated comic book frames, QTE sequences and branching dialogue.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Atomic Wolf","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":61131,"name":"Zero-K","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb5/bb53b73d3b8a27f374c680f4350c20c6.jpg","description":"Commander wanted! Construct giant robots, build an army of a thousand Fleas. Move mountains if needed. Bury the enemy at all cost!\nTraditional real time strategy with physically simulated units and projectiles.\n100+ varied units with abilities including terrain manipulation, cloaking and jumpjets.\n70+ mission galaxy-spanning campaign to be enjoyed solo or co-op with friends.\nChallenging, (non-cheating) skirmish AI and survival mode.\nMultiplayer 1v1 - 16v16, FFA, coop. ladders, replays, spectators and tournaments.\nPlanetWars - A multiplayer online campaign planned to start in May.\nReally free, no paid advantages, no unfair multiplayer.Fully Utilized Physics\nSimulated unit and projectile physics is used to a level rarely found in a strategy game.\nUse small nimble units to dodge slow moving projectiles.\nHide behind hills that block weapon fire, line of sight and radar.\nToss units across the map with gravity guns.\nTransport a battleship to a hilltop - for greater views and gun range.Manipulate the Terrain\nThe terrain itself is an ever-changing part of the battlefield.\nWreck the battlefield with craters that bog down enemy tanks.\nDig canals to bring your navy inland for a submarine-in-a-desert strike.\nBuild ramps, bridges, entire fortress if you wish.\nBurn your portrait into continental crust using the planetary energy chisel.Singleplayer Campaign and Challenging AI\nEnjoy many hours of single player and coop fun with our campaign, wide selection of non-cheating AIs and a survival mode against an alien horde.\nExplore the galaxy and discover technologies in our singleplayer campaign.\nFace a challenging AI that is neither brain-dead nor a clairvoyant cheater.\nHave some coop fun with friends, surviving waves of chicken-monsters.\nCloaking? Resurrection? Tough choices customizing your commander.Casual and Competitive Multiplayer\nZero-K was built for multiplayer from the start, this is where you can end up being hooked for a decade.\nEnjoying epic scale combat? Join our 16v16 team battles!\nLooking for a common goal? Fight AIs or waves of chicken-monsters.\nPrefer dancing on a razor's edge? Play 1v1 in ladder and tournaments.\nComebacks, betrayals, emotions always running high in FFA.\nWant to fight for a bigger cause? Form a clan and join PlanetWars, competitive online campaign with web-game strategic elements, diplomacy and backstabbing.Power to the People\nWe are RTS players at heart, we work for nobody. We gave ourselves the tools we always wanted to have in a game.\nDo what you want. No limits to camera, queue or level of control.\nPaint a shape, any shape, and units will move to assume your formation.\nConstruction priorities let your builders work more efficiently.\nDon't want to be tied down managing every unit movement? Order units to smartly kite, strafe or zig zag bullets.Plenty of Stuff to Explore (and Explode)\nZero-K is a long term project and it shows, millions hours of proper multiplayer testing and dozens of people contributing ever expanding content.\nLearn to use all of our 100+ units and play on hundreds of maps.\nInvent the next mad team-tactics to shock enemies and make allies laugh.\nCombine cloaking, teleports, shields, jumpjets, EMP, napalm, gravity guns, black hole launchers, mind control and self-replication.\nTiny flea swarm that clings to walls?\nJumping \"cans\" with steam-spike?\nBuoys that hide under water to ambush ships?\nMechs that spew fire and enjoy being tossed from air transports?\nCarrier with cute helicopters?\nJumping Jugglenaut with dual wielding gravity guns?\nMeet them in Zero-K!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zero-K Team","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":44630,"name":"Fantasy Strike","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f27/f27107e3c857a93fe0975c5cd834190f.jpg","description":"A fighting game designed from the ground up to be so easy to control that even non-fighting game players can play it, yet deep enough to play in tournaments. Simple yet deep, vibrant graphics, and excellent online play. Great for bridging the gap between players of many different complex fighting games because you can all reach basic competency in Fantasy Strike in just a few minutes.\nFeatures\nControls. Moves are all single button presses, no joystick motions. Designed to work great on keyboard.\nUnique throw escape. To escape (normal) throws, simply let go of all your controls! You'll automatically \"yomi\" counter any throw attempt.\nExcellent online play. Uses GGPO, the best-in-class networking technology any competent fighting game should use.\nLife bar shows discrete hit points. You always know exactly how much a combo will do because life bars show each individual hit point.\nDiverse cast of characters. Be an archer with fiery arrows, a colorful painter, a martial arts master who can transform into a dragon, and more!\nNumerous game modes in development. Right now: play online quickmatch, directly challenge a friend, play local multiplayer, arcade, or try our full-featured practice mode. Several more modes are in the works.\nController support. We support almost any kind of controller: keyboard, PlayStation 4 Dual Shock, Xbox One controllers, joysticks, all with a simple interface to quickly set your buttons however you want.\nMenus design. Menus are designed to be used with mouse and keyboard OR controller. Every screen has both a controller version and mouse/keyboard version. If you use controllers or joysticks, you don't need to touch the mouse. But if you prefer a mouse interface, the game is optimized for that as well.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sirlin Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15993,"name":"Solstice","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e7/5e720e24691bd8a94a7c9b460575ff25.jpg","description":"Solstice is a dystopian mystery thriller about small personal disasters that turn into great catastrophes.\r\n\r\nA magnificent city in the middle of a frozen wasteland, cut off from the world by raging blizzards. Inhabited only by a small group of misfits, who either can’t or don’t want to leave for the dead winter season.\r\n\r\nWhen the local madman goes missing, an ambitious doctor on a contract and a mysterious young woman, who arrived with the last dog sled caravan, start questioning the true nature of the city's splendor...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"MoaCube","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11849,"name":"Platformines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8a/a8a55f70fc76f611162967ed9f8ed59b.jpg","description":"Platformines is a unique 2D platformer packed with exploration, RPG and shooter elements, set in a vast 16-bit underground world. In their quest to rebuild their spaceship, players will embark on a journey to discover the mysteries of a gigantic complex of mines. Deadly enemies, traps and treasures are just a few to mention from what players will encounter while trying to escape from the hostile world. Customise your character, master all difficulty levels and literally jump to the top of the leaderboards to prove your skills!Limitless Gameplay: An infinite number of randomly generated worlds to explore each one with its own configuration of traps and enemies!\nUnstoppable old-school action with 3 different difficulty levels to master!\nDiscover hidden chests or just…loot your enemies in order to get tons of items and upgrades!Limitless Customization: Build your character choosing from countless customization options\nAdditional in-game fancy items, like hats & wigs, for even further customisationLimitless Fun: Retro gaming experience with 16-bit graphics & reinvented classical music\nSimple classic mechanics for immediate fun; jump and slash!\nProve your skills and climb to the top of the leaderboards!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Magiko Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":4203,"name":"Saints Row: The Third - The Full Package","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/09b/09ba5a476a877b957c717aad1cf709fd.jpg","description":"From the ingenious minds that brought you all those Saints Row games comes the ultimate Saints Row compilation: Saints Row®: The Third™ - The Full Package. This premier edition includes award-winning Saints Row: The Third all through downloadable mission pack and more than 30 bonus DLC items. With every weapon, every vehicle, every outfit, go over the top, off the reservation, and to places where no decent game should go.\n1 player\n382KB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-2\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2012 THQ INC.  DEVELOPED BY VOLITION, INC.  THQ, SAINTS ROW: THE THIRD, VOLITION, INC. AND THEIR RESPECTIVE LOGOS ARE TRADEMARKS AND/OR REGISTERED TRADEMARKS OF THQ INC.  ALL RIGHTS RESERVED.  ALL OTHER TRADEMARKS, LOGOS AND COPYRIGHTS ARE PROPERTY OF THEIR RESPECTIVE OWNERS.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Volition","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"}]},{"id":41458,"name":"The Elder Scrolls Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1af/1af8786543bcd0ec61a509604902a41f.jpg","description":"Includes The Elder Scrolls Online base game and the Morrowind Chapter.\n\nJoin over 10 million players in the award-winning online multiplayer RPG and experience an ever-expanding story set across Tamriel. Explore a rich, living world with friends or embark on a solo adventure – the choice is yours to make in a persistent Elder Scrolls world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Zenimax Online Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":40689,"name":"Defy Gravity","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/406/406023ddaa4945764a11c369184d5f27.jpg","description":"Little indie studios are always finding a way to stay noticed, and this puzzle platforming game is another proof. Small indie studio Fish Factory Studio published only this game to the most positive feedback. There is no story or a plotline because the game centers on the formula of a player having a unique weapon or a unique mechanic that will help them to solve puzzles. In the case of Kara, voiceless character controlled by the player, it’s a gun that creates gravity or anti-gravity anomalies. She can push and pull not only other items but herself as well. \nAll 24 basic maps that form the challenge Gauntlet players have to complete are a linear map with a single entrance and a single exit. After the first level where players are trying to learn controls and mechanics, types of the traps and obstacles they will have to overcome, the game will ramp up the difficulty. Eventually, after completing the main game, the second quest mode will become available, that will add 24 more levels.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Fish Factory Games","platforms":[{"id":0,"name":"PC"}]},{"id":29429,"name":"Mortal Kombat 4","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/428/42849cb6c2adc926f723a1f74a5e1898.jpg","description":"Shao Kahn has been defeated at the hands of Earth's warriors, and now Shinnok has escaped to his confines in the Netherealm. The war has resumed once again. This time, the battle CAN be won by mortals!","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Midway Games","platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"}]},{"id":27970,"name":"Mario Kart 7","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0d/f0dcecdb5cbd387bcb97587bb6ce3852.jpg","description":"The newest installment of the fan-favorite Mario Kart™ franchise brings\nMushroom Kingdom racing fun into glorious 3D. For the first time,\ndrivers explore new competitive kart possibilities, such as soaring\nthrough the skies or plunging into the depths of the sea. New courses,\nstrategic new abilities and customizable karts bring the racing\nexcitement to new heights.\n\nFEATURES:\n\nThe Mario Kart franchise continues to evolve. New kart abilities add\nto the wild fun that the games are known for. On big jumps, a kart\ndeploys a wing to let it glide over the track shortcut. When\nunderwater, a propeller pops out to help the kart cruise across the\nsea floor.\n\nPlayers can show their own style by customizing their vehicles with\naccessories that give them a competitive advantage. For instance,\ngiant tires help a kart drive off-road, while smaller tires accelerate\nquickly on paved courses.\n\nPeople can choose to race as one of their favorite Mushroom Kingdom\ncharacters or even as their Mii™ character.\n\nNew courses take players on wild rides over mountains, on city streets\nand through a dusty desert. Nintendo fans will recognize new courses\non Wuhu Island and in the jungles from Donkey Kong Country™ Returns.\n\nThe game supports both SpotPass™ and StreetPass™ features.\n\nPlayers can compete in local wireless matches or online over a\nbroadband Internet connection.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":27509,"name":"A World of Keflings","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f39/f3998d8218c3588c629f89dbf52c7794.jpg","description":"Embark on a giant kingdom-building adventure journeying to exotic lands \n      and helping your new, tiny Kefling friends along the way in A World of \n      Keflings! Play as your Mii and help the friendly, little Keflings \n      harvest resources, assemble buildings and create thriving cities in \n      desert, forest and ice kingdoms. Mine stone and crystal, harvest lumber \n      and wool, and craft elaborate buildings. Have fun creating and \n      customizing beautiful cities filled with fountains, workshops, castles \n      and more! Complete quests to help the Keflings solve their problems. \n      Compose new music or recreate your favorite songs by shooting Keflings \n      through musical cannons. Build a robot, rescue the princess, make \n      friends with a dragon and help a creepy witch get even creepier in this \n      exciting, friendly, city-building adventure!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"NinjaBee","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":20943,"name":"Zombie Zoeds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e25/e25a1506d7d628e607dde00df0c69db5.jpg","description":"This zombie shooter.You have to kill zombies.\nThe game features multiple levels where you have to kill the zombies and save civilians.Move to be in the dark.\nLook for a safe way and do not rush.The game has several types of weapons that will help get to the end.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mystic Games","platforms":[{"id":0,"name":"PC"}]},{"id":13758,"name":"Monster Puzzle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/834/83441ffc5f68b61bf23a04a7da0ddc21.jpg","description":"Far away, lost in another dimension, there‘s a world where human dreams come to life. A land built upon sweet dreams where Trekkie and her friends live, safe from the bitter monsters inhabiting the dark world of nightmares. But even all the fear and anguish in the land of the human aren't enough for the nightmare monsters, who are stealing the dreams of Trekkie‘s world, keeping them hidden while dreams are corrupted and transformed into nightmares. Help Trekkie ﬁnd their dreams before it‘s too late!Features50+ levels\nCharming world with a cartoon, minimalistic style\nRetro-inspired 8-bit sound effects and music\nAvoid your enemies","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Flynns Arcade","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]