[{"id":49498,"name":"Moss","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c02/c0220e3e2ee083531ae461f4a7003c5a.jpg","description":"Moss™ is a single-player action-adventure puzzle game and new IP from Polyarc tailor-made for the VR platform. It combines classic components of a great game—such as compelling characters, gripping combat, and captivating world exploration—with the exciting opportunities of virtual reality.\nAs a special thank you to fans, Polyarc is gifting the full Moss digital soundtrack composed by two-time BAFTA award-winning composer Jason Graves to everyone who has purchased or will purchase Moss by August 17, 2018.\nIn Moss, players meet Quill, a young mouse with dreams of greatness beyond the confines of her settlement. While exploring the woods, she finds a mysterious Glass Relic and an ancient magic is awakened. With her uncle now in grave danger, Quill must embark on an epic journey—and she needs you there by her side. Together, you'll travel to forgotten realms, solve challenging puzzles, and battle menacing enemies. Alone, no one can conquer what you're up against. But united, you just may defeat even the darkest of villains.GameplayReach into The World of Moss\nYour every action has meaning. Moss takes full advantage of today’s virtual reality technology, letting you move objects, battle enemies, and manipulate the field of play as the key ally to our hero, Quill.\nAdventure to Fantastic Places\nTravel to a lively world that hums with wonder and legend. Explore caves, forests, and foreboding ruins that are filled with ancient artifacts, mysterious creatures, and sprawling views.\nForm a Unique Bond\nYour abilities are complementary to Quill’s in an alliance for the ages. Combine classic, action-adventure controls with a world that responds to your touch. Solve puzzles, combat evil, and achieve victory together.\nA Story Told Unlike Any Before\nFrom its opening pages, Moss will draw you into a first-of-its-kind fully immersive world of myth and magic. Enjoy a rich tale of intriguing characters, illustrious artifacts, and legends old and new.Moss SoundtrackJason Graves brings to life the melodic and playful adventure in Moss from the hero Quill’s perspective. Graves accomplishes this by employing small and intimate-sounding instruments composed, arranged, and produced in a pastoral soundscape with enchanting Waltz-esque flair. The soundtrack consists of 11 in-game tracks with more than 57 minutes of music, including the bonus track “Home To Me,” featuring YouTube sensation Malukah.\nNOTE:  Gamers who purchase Moss by August 17, 2018 will find the free soundtrack in the DLC section of the game as part of the August 3, 2018 game update. Everyone has until August 17, 2018 to download the MP3 files before the soundtrack is removed from the DLC section of Moss.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Polyarc","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":35358,"name":"The Witcher","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f7/2f70e8bf43b0d6223823aa644b0a2854.jpg","description":"The Witcher is the very first instalment of the series that follows the story of Geralt from Rivia. Being found unconscious on the battlefield he must retrieve his memory and help the emperor's daughter, Adda to stop her from turning in to a feral monster. Facing the biggest enemy, Salamander, Geralt must also help all the fractions around the world to find peace between each other.\nThe fighting system is very flexible. Choosing from three different styles, you can adapt Geralt for any kind of a combat situation. Fast style of fighting gives you an opportunity to strike your opponents with your speed. The strong style focuses itself on destroying your enemies with powerful attacks, while sweeping style is very good when facing a number of foes. You can also craft some potions to gain important benefits such as seeing in the dark or having a larger amount HP. Plot style is unique as well. The game never gives a precise definition of evil, which leads the player to convenient situations where the choice is quite bad anyway.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PC"}]},{"id":23214,"name":"NBA 2K18","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b1c/b1cd7434177e0f47ef1e4597f5701f13.jpg","description":"Pre-Purchase Offer\nPre-order NBA 2K18 now to receive bonus in-game content!\nLegend Edition\nThe NBA 2K18 Legend Edition includes the following digital items:\n100,000 VC\n20 MyTEAM Packs to build your perfect fantasy team, delivered one a week, featuring a guaranteed Shaq card, one random Team 2K Free Agent card, and more!\nShaq Attaq shoes\nRookie Shaq jersey\nShaq Official Logo shirt\nShaq \"nickname\" jersey\nShaq Championship ring\nLegend Edition Gold\nThe NBA 2K18 Legend Edition Gold includes the following digital items:\n250,000 VC\n40 MyTEAM Packs to build your perfect fantasy team (delivered one a week). Featuring a guaranteed Shaq card, one random Team 2K Free Agent card, and more!\nShaq Attaq shoes\nRookie Shaq jersey\nShaq Official Logo shirt\nShaq \"nickname\" jersey\nShaq Championship ring\nMitchell & Ness Shaq jersey collection - 5 in total\nAdditional MyPLAYER apparel items\nAbout the GameFEATURESRUN THE NEIGHBORHOOD\nThe future of sports career modes has arrived, allowing you to play the game the way you like. Build your career in NBA games, hit the courts in The Playground Park, join the Pro-Am circuit, or explore the shops and venues in an all-new open neighborhood setting. Featuring new MyPLAYER upgrade and endorsement systems, our biggest cast of characters to date including NBA players, and so much more.The Road to 99\nThe overarching meta-game that rewards users for improving their MyPLAYER’s overall rating, regardless of which modes they choose to play. Featuring a unified badge system across Pro-Am, Park and your NBA journey in MyCAREER, your attributes, animations and badges all combine to define your play style on your road to a 99 overall rating.  Updated Create A Player\nCreate the MyPLAYER you want, whether scanning your face with the MyNBA2K18 mobile app or building something custom using our preset options. Hairstyles have been updated with numerous new options to choose from, and body weight and height are more accurately represented to ensure the unique look you want for your MyPLAYER.   MyTEAM\nCollect player cards featuring NBA legends from yesterday and today, and compete in a variety of online and offline modes. Super Max\nConstruct a salary-capped team and compete against other users of similar ability in a new season mode. With a limited salary cap to distribute among 13 players, you’ll have to be strategic in selecting your lineup for each round. Prizes are awarded based on your performance each round, ensuring that every game matters.Pack & Playoffs\nAn all-new draft mode that challenges you to build the best possible 5-man team from packs you’ll open before each round. Compete against other users’ drafted teams and advance to earn better prizes. With Pack & Playoffs, it’s a new lineup and a new experience every round. Schedule Challenges\nPlay through a 30 game schedule for each of the 30 NBA teams. Earn MyTEAM points and prizes as you work your way through 900 unique challenges based on the 2017-18 NBA schedule.ELITE GAMEPLAYNew Motion System\nThe new motion system brings player control to a new level of realism.  Now, dribbling and off the ball movement are no longer driven by animations. This groundbreaking technology dynamically creates animations to deliver the best gameplay experience possible.  You are now in complete control.  Improved Shot Meter\nHit shots more consistently thanks to an improved shot meter, featuring multiple feedback points for more precise shot timing. GRAPHICS & PRESENTATIONImproved Player Accuracy\nCountless hours of work have been put in to make every NBA player look and feel like their real-life counterparts, down to the smallest details including scars, stretch marks, and even faded tattoos. The player body system has been completely redesigned to accurately match the physique of every player in the league, and player faces have been rebuilt from scratch to show more details and respond more realistically to light.Laser Scanned Uniforms & Accessories\nLaser scanned uniforms from all 30 NBA teams accurately depict each design down to the smallest stitch. Using True Color Technology, team colors have never been more pure & authentic, and whites have never popped so brightly. And with the overhauled player body system, uniforms fit accurately for each specific body type. To round out the complete on-court look of an NBA player, users will enjoy the largest collection of scanned shoes and accessories in NBA 2K history.Special Guest Commentary\nThe biggest roster of broadcasting talent in sports videogame history gets even bigger. Future Hall of Famers and former NBA 2K cover athletes Kobe Bryant and Kevin Garnett join the booth on a rotating basis to lend their expertise to the broadcast, bringing the total number of in-game broadcasters to 13.LEGENDARY TEAMSAll-Time Teams\nThe greatest players in NBA history from all 30 teams, together on All-Time franchise rosters for the very first time. Compete in Play Now to find out which franchise’s All-Time Team reigns supreme, or challenge all 30 All-Time Teams in MyTEAM’s All-Time Domination mode.  Classic Teams\nPlay with 62 of the NBA’s greatest teams from the past, including 17 new additions. Pit your favorite classic roster against current NBA teams, replay epic Finals matchups, find out if Shaq & Kobe can compete with the great Lakers teams of the past, or matchup the ’97-98 Bulls against the ’15-16 Warriors to settle the argument once and for all. The possibilities are endless.MyGM/MyLEAGUEMyGM: The Next Chapter\nFor the first time in a sports game, MyGM introduces a narrative-driven, story-based franchise experience that maintains all of the user control and team building aspects that fans have come to love over the years. Your path will be determined by the choices you make and the answers you provide at many key points in the narrative. Make the story your own, and build a winner!MyLEAGUE\n2K’s fan-favorite franchise mode allows users complete customization over their league. Choose the number of games and teams, adjust the league settings, and apply your custom setup to a single season, multi-season or online experience. Or, skip the regular season and jump right into to the Playoffs. True-To-Life League Structure & Rules\nBoth MyGM and MyLEAGUE feature numerous updates to match real-life NBA rules, including many from the new Collective Bargaining Agreement. Negotiate player contracts that work best for your franchise and each player, including Super Max & “Bird Rights” deals for elite players, Over-38 contracts for older players, and two-way contracts for younger players. Manage your roster by using the Stretch Provision to minimize the Salary Cap when you waive a player, or develop younger talent in the G-League or by stashing them overseas. Simply put, the most detailed and authentic franchise experience on the market puts you in the hot seat as an NBA GM like never before.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"2K","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":13280,"name":"Nimbatus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ff/2ff223a50df4a85dd85bdbc3cd59027c.jpg","description":"Nimbatus is a procedurally generated action simulation game. Craft freely customizable drones and explore an endless universe. Drones interact with the destructible environment in a physically correct manner. On your journey you will find hundreds of different drone components and research groundbreaking new technology.\nKey Features:\n> Create your own drones with physics\n> Countless drone parts\n> Sensor and Logic parts to build fully autonomous drones\n> Thousands of different weapon combinations\n> Procedurally generated universe\n> Fully destructible environment\nInspired by:\n> Faster Than Light\n> Reassembly\n> Kerbal Space Program","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Stray Fawn Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11665,"name":"SpellForce 2 Anniversary Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/88a/88add4b9a50c2f6478c7929063c14af0.jpg","description":"SpellForce 2 - Anniversary Edition presents the award-winning SpellForce saga hits: \"SpellForce 2 – Shadow Wars\" and the add-on \"SpellForce 2 – Dragon Storm\" for a spectacular game experience!\nExperience the age of heroes: roleplaying action & realtime strategy in a perfect mix of genres.\nMysterious powers arise from darkness and shadow. They are threatening Eo, the world of SpellForce, already devastated by wars and sundered by intrigues. A hero, born of the legendary  Shaikan and linked by a life bond with an ancient dragon now holds the fate of the world in his hands! Unite powerful heroes and armies under your banners, as only with joined forces you can combat this threatening doom! The burden of ancient blood is heavy, and it is yours to carry…\nFight epic campaigns with your heroes, with over 90 hours of playing time.\nIndividual development of the avatar and heroes with an extensive skill tree!\nControl various game factions with three races each in a life-like fantasy world.\nCommand infantry, mounted and flying units, and unleash the enormous titans!\nExperience spectacular mass battles in breath-taking 3D graphics!Anniversary Edition Features:Re-implemented multiplayer and NAT traversal for a smooth online experience\nMany Bugfixes\nAdditions and Fixes for the Free Game Mode\nWidescreen Support\nFull compatibility with modern operating systemsMajor Engine & Technical Re-Design/Re-Work:Grass rendering improved\nView distance improvements\nImproved trees (trunk/branch)\nImproved leaf rendering (add leaf subsurface scattering)\nImproved lighting (per pixel, basic Bidirectional reflectance distribution function specular, rim light, view dependent ambient, etc)\nImproved shadows (soft shadows, percentage-closer filtering)\nShader Model 3.0 usage only","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":284674,"name":"Totally Reliable Delivery Service","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/253/25378cb362ba095ccc1062fed2136ede.jpg","description":"Alpha Sign-Ups Open!We will be doing an extensive Alpha test for Totally Reliable Delivery Service soon. This is to test online networking and technical performance of the game. If you'd like to participate, sign-up at http://trdsgame.com\nAbout the Game\nBuckle up your back brace and fire up the delivery truck, it's time to deliver! Join up to four friends and haphazardly get the job done in an interactive sandbox world.\nDelivery attempted, that's a Totally Reliable Delivery Service guarantee!\nFEATURES:\nLocal and Online Multiplayer: Go it alone to ensure the safety of your deliveries, or join your friends and put your teamwork to the test.\nControlled Noodly Chaos: Unpredictable ragdoll physics meets snappy platforming. Sprint, leap, dive, climb, and grapple with ease, but collide with something and you'll be knocked out cold!\nA World of Distractions: Take a break from deliveries and play around! The world is chock full of toys, vehicles, and machines that can be used for work or play.\nRagtag Crew: Choose from four unique, blue-collar workers and get your rear into gear, it's time to deliver!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"We're Five Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":60685,"name":"Swag and Sorcery","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98a/98a62d390fd5347907b25790f8a449fb.jpg","description":"Welcome to Swag and Sorcery, a new streamlined RPG from the creators of Punch Club and Graveyard Keeper! Build your own fantasy village, train and equip your heroes and send them out to collect Swag!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"tinyBuild","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":42857,"name":"Dead Island 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9cd/9cd22ae5aebd922f96f2bc50efab83df.jpg","description":"A deadly virus is spreading across Los Angeles, California, turning its inhabitants into ravenous zombies. The city is in quarantine and the military have retreated. Bitten, infected, but more than just immune, you learn to harness the zombie inside. Only you, and the handful of other swaggering fellows who happen to be resistant to the pathogen, holds the future of LA (and humanity), in the balance. As you uncover the truth behind the outbreak you’ll discover who – or what – you are. Survive, evolve, save the world – just another day in LA! The much-loved zombie saga is back with a unique formula of horror, dark humor and over the top zombie-slaying, spanning an epic pulp adventure. Dead Island 2 is a thrilling First-Person Action RPG that takes players across a brand-new playground. Stylish, vibrant and flooded with zombie infection, explore iconic, gore-drenched Los Angeles. Meet larger-than-life characters. Slay countless foes in exquisitely bloody detail. And evolve to become the ultimate Zombie Slayer. See you in HELL-A!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Dambuster Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":39080,"name":"Gran Turismo 5","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dc1/dc19247b653958c45f0625a097d7623a.jpg","description":"Gran Turismo 5 is the fifth part of the Gran Turismo series.\n\nIn addition to the characteristics of each model of the car, tuning is possible in the game. Tuning, as well as the acquisition of more and more powerful cars, becomes available as a result of victories in races, obtaining prize money and improving the skill of the driver.\n\nMany of the car systems that can be tuned in real life can be customized in the game - and the consequences for the behavior of the car in the game will be shown. For example, suspension settings affect handling.\n\nThe main mode of the game is arcade. But there is also a \"simulation\" mode that conducts the player through a series of races, constantly complicating the conditions and giving the player a chance to smoothly master the game, increase skill, earn game money for increasing the number of cars and other needs.\nIn Gran Turismo 5 there are 1031 cars, 26 locations and 71 variations of tracks. In addition, for the first time the editor of the tracks appeared in the game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Polyphony Digital","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":20723,"name":"Millie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d58/d58563f2943a8a248e645f8a18568ca5.jpg","description":"A joyful, casual puzzle game that will tease both your wits and your memory!\nYou've always dreamt of flying. Roaming high in the clouds, free from all worries. Just gliding through air like a bird. Unfortunately, you were born as a millipede, and your best chance of launching to the sky is probably in some crows mouth... or is it?\nRumor has it that the local Aviation School is accepting new recruits for a pilot course. Seeing an opportunity to make your dreams come true, you seize the moment and embark on a journey of your life. Your path is full of dangers, mazes and obstructions, but the end goal is more than worth it!\nSo rise on your feet, all 100 of them, and get going!\nControl a millipede, roaming through over 90 diverse levels. Solve the elaborate mazes laying on your way. Gather and use multitude of power-ups that will help you with your struggles. Enjoy three types of immersing mini games. Grow bigger and bigger; and remember: try not to eat your tail.\n- Almost a hundred challenging and diverse levels\n- 3 totally different environments.\n- Tons of power-ups and helpers\n- Varied and colorful levels\n- Immersing mini-games\n- Really enjoyable, casual gameplay","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":20109,"name":"DogFighter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/676/676a45b05a0d3b6d0f4f360e905e45cf.jpg","description":"DogFighter is an action game developed by Dark Water Studios. The original game has three updates. \n\n###Gameplay \nDogFighter is an aerial combat game; the player aims to win the race while flying through the arenas, shooting enemies, and achieving points. During the game, the players can track his progress with the number of position in the left corner of the screen and with earned points in the right corner. After the player's plane is destroyed, the online leaderboard appears. It shows the list of players (up to 15 persons), number of suicides, deaths, and kills; and each player’s points. There are four multiplayer modes and seven single-player modes. Using the points, the player can improve his biplane with more than 20 offensive and defensive weapons and eight craft upgrades. \n\n###Key features \nA single player mode includes tournaments which let the player achieve other medals. On the multiplayer maps, the players gather together to perform against each other. In modes like DeathMatch, Capture the Flag or Team DeathMatch the player can fight against 15 opponents. Advanced server modes let the players empower improvements in the normal modes including Insta-Gib, Turbo Mode, and Black Death. There is all manner of maps with different obstacles, such as bridges, mountains, towers, and so forth.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Dark Water Studios","platforms":[{"id":0,"name":"PC"}]},{"id":1922,"name":"FINAL FANTASY V","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7b1/7b184215cc792ea2abf115f4e566b486.jpg","description":"Twenty years after the original FINAL FANTASY V released in Japan, the classic RPG has found its way to PC!\nEmbark on an epic adventure as four heroes are driven together by fate: Bartz and his chocobo companion, Princess Lenna of Castle Tycoon, the mysterious Galuf, and the pirate captain Faris.\nThe crystals that bring peace and prosperity to the world – earth, water, fire, and wind – have lost their power and are on the verge of destruction.Key Features:Customize characters with an unprecedented degree of freedom with the job and ability system – 26 unique job classes!\nVeteran character designer Kazuko Shibuya has returned to recreate the characters and graphics for an enhanced experience!\nUpdated controls and active-time battle system are optimized for fluid combat for PC.\nThis new version also includes “The Sealed Temple” from the 2006 release, as well as the Tetsuya Nomura-designed optional boss Enuo, and an extraordinary soundtrack\nIncludes STEAM trading cards and achievements.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Square Enix","platforms":[{"id":0,"name":"SNES"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Game Boy Advance"}]},{"id":510699,"name":"My L'manburg [Dream SMP fangame]","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67c/67c157d4252564ae6f6ceab90cb9a170.jpg","description":"In this fan-game you will play as TommyInnit, a teenager that got in a very real Minecraft War, got betrayed, saw his friends die, and watches how one of his closest friends slowly loses his mind. Yet, somehow, Tommy manages to keep his sanity.\nWould you like to change the story? Or do you want to help Tommy convice Wilbur that there's a lot of other ways besdie blowing up Manburg?\nOr...\nMaybe, you want to betray everyone?\nAfter all, everyone who's claiming to be on our side... They're just lying to us, so why can't you do the same?\n---\nThe game is a work in progress!\nPlease let me know if there's any bugs, crashes, etc. so I can see what can I do with it.\nI hope you enjoy the game, and if you do, please leave a comment and follow me so you'll know about future updates!\nContact Info\n@K4KRR_ - My Twitter\nkesha4kablin#6884 - My Discord\nSpecial thanks to\nEveryone from Dream SMP for creating the series,\nEthan for testing the game to see if there's any bugs,\nFriends who support me while I'm working on this game,\nAnd you for playing it!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"K4KRR","platforms":[{"id":0,"name":"PC"}]},{"id":41128,"name":"Final Fantasy X","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ddc/ddc65c56f16bc3effb8d2645b095a8c5.jpg","description":"Enter a fantasy world where humans are on the brink of extinction. In this all-new Final Fantasy RPG, you must stop a powerful force called \"Sin\" that destroys cities and lives. Along your journey, you will meet Tidus--a star blitzball player--and Yuna--a young woman with who is skilled in summoning and controlling aeons - powerful spirits of yore. Final Fantasy X is the first Final Fantasy game to feature voiceovers with advanced facial expressions. Travel to uncharted seas and treacherous lands in a quest to save mankind.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Square","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":8001,"name":"Garfield Kart","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cea/cea57dce0127ef9238b08d5946cb9210.jpg","description":"Use your best driving skills and the bonus objects to be first across the finish line! But watch out... it's a free-for-all out there!\n16 DIFFERENT CIRCUITS — stunning 3D environments from the world of Garfield (Garfield's neighborhood, the city, the Mally supermarket, the sunny farm, the misty docks, the oasis, the dark manor house, etc.)\n8 CHARACTERS — Garfield, Odie, Jon, Nermal, Arlene, Liz, Harry and Squeak.\n8 BONUSES for some crazy attacks and defenses (Exploding Diamonds, Lasagnas, Pies, Magic Wand, Pillow, Bewitching Perfume, Flying Saucers)\n3 GAME MODES: Grand Prix / Single Race / Time Trial\n3 DIFFICULTY LEVELS: 50cc, 100 cc and 150 cc\nDAILY CHALLENGE: Try out a new challenge every day!\nCUSTOMIZE your characters with tons of hoods and accessories","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Microids","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":14621,"name":"Basement","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d7/6d7e6f8e453fcef0f5d6b7e535669fa2.jpg","description":"Basement is a drug-dealing strategy game where you play a scientist who is forced to do illegal stuff in your basement. Actually it’s all about management. You build your own enterprise producing several types of drugs, find the right place to sell them, invite scientists and security, avoid federal agents and build the most effective company.\nYou start in your own basement. Since the police has no interest in a small dealer, you have the chance to grow. Once your expansion becomes noticeable you’ll be allowed to sell at higher rates, get better workers, upgrade your production and access new technologies. But be careful! This growth will attract the cops. With rapid growth, your enterprise will become fragile. If it survives all the troubles it faces, you will become invincible. Otherwise, you will lose money, workers and respect. While your influence in the city shortens, you risk being imprisoned in the end.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Halfbus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":384504,"name":"As Far As The Eye","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/669/669c93f06ad275c83d7c4d70c6dddb5b.jpg","description":"Unexpected is pleased to present As Far As The Eye, a strategy and micro-management game of a peaceful nomads tribe who migrate through a natural cycle of several hundred years to reach the center of the world, the Eye.\nA F.A.T.E offers the players a nomadic adventure on a turn-based basis alongside the Pupils, these littles beings connected to nature who change their shape according to their occupation.\nFeatures :\nEstablishment of a base\nConstruction of buildings\nSystem of trades and levels\nRandom events\nKnowledge tree\nExploration\nHarvest resources to move forward\nIn order to allow life on the camp, the Pupils reap resources in their procedurally generated environment. Some allow them to feed themselves, others to build and improve their buildings and cope with the vagaries of climate and nature.\nIt will require ingenuity to place the buildings and optimize the yields of the various hexes while keeping and eye on the resources needed to leave the caravan for the next step.\nA system of jobs and knowledge\nEach Pupil can learn several jobs. In total, there are six jobs, eleven specializations and seventy-eight levels that nomads can explore in this version of the game.\nBeyond the improvement of each individual, the player will also be responsible for creating a savant tribe by unlocking knowledge in a tree, changing the gameplay style.\nThe Procedural and the Random\nIn order to offer a unique experience to each player, we have developed our own procedural generation of steps, as well as a system of random events that you will have to cope with and protect yourself from.\nAn adventure that suits you\nDo you like quiet and serene games where time flies slowly and during which there is no pressure on you? Do you prefer, on the contrary, to feel the blood beating on your temples when you encounter great and difficult challenges? In As Far As The Eye, you can modify your experience as you wish using a game settings editor that will allow you to choose the duration of the game, the size of the steps, the frequency of resources spawn and many other options.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Unexpected","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":62419,"name":"Ikenfell","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f56/f56c37a881bed123f3bd64b76f1a90c7.jpg","description":"A turn based-tactical RPG about a group of troublesome magic students. Use timing mechanics to power your spells and block attacks, explore the twisted halls of a vast magic school, fight challenging monsters and bosses, find tons of hidden treasure, and uncover dark secrets never meant to be found.\nA heartwarming and twist-filled story about friendship, trust, love and loss\n3 students in battle, from a total of 6, each with unique powers and strengths\n48 unique spells: blast your enemies, knock them back, poison them, or heal and buff your allies. There is no \"MP\"... spells are about skill and strategy! Each with its own timing to master\n80+ enemies to battle: spirits, myths, monsters... even students and teachers! Learn their tricks and traps, and master the timing of their attacks to overcome them\n20 challenging bosses who will push your strategy and timing to the limit\n100+ items to discover: wands, hats, cloaks, rings, and magical artifacts. Secret treasure is hidden everywhere, and every item you find helps you fight against the powers threatening you.\nExplore a vast school of magic: the dorms, alchemy labs, astronomy tower, twilight yard, and a dozen more mysterious and magical locations\nBeautiful soundtrack from the composers behind Steven Universe\nCats. Everywhere.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Happy Ray Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":27977,"name":"The Legend of Zelda: A Link Between Worlds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab1/ab1800c2f46aec115be6a716b1493f79.jpg","description":"Two worlds collide in an all-new adventure set in the world of Super\nNES™ classic The Legend of Zelda™: A Link to the Past™. In this newly\nspun tale, Link™ transforms into a living painting to cross into a dark,\nparallel dimension mirroring Hyrule. Conquer the puzzles, traps, and\nhidden rooms of deadly dungeons to save both worlds from certain doom!\n\nBrought to life in 3D, this beloved, top-down world is the perfect\nbackdrop for a sweeping new tale. Dungeons sink deep below the screen as\nLink and his attacks pop out, highlighting the nonstop action. The pace\nis faster than ever, especially since you can swap items on the Nintendo\n3DS touch screen. Shoot an arrow, toss a boomerang, bomb a wall, then\nmerge into a painting to slide between two worlds - all in a matter of\nseconds. With gameplay, visuals, and controls this smooth and\nconsistent, no Zelda™ adventure has ever been so action-packed.\n\nAn all-new adventure in the deadly, beautiful world of The Legend of\nZelda™: A Link to the Past\n\nBecome a living painting to slide within walls and between two\ndimensions at war\n\nSink into the classic, top-down world of Zelda™ like never before with\n3D visuals at 60 FPS\n\nEasily swap inventory items on the Nintendo 3DS touch screen to keep\nthe action coming\n\n“Five Stars” – Joystiq\n“A perfect handheld Zelda\nexperience” – Joystiq\n“Imaginative and stuffed with\nsecrets” – IGN\n“9.4 out of 10” – IGN\n“10\nout of 10” – Game Informer","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":21140,"name":"Pressured","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd0/cd0a46ccb924ea0a5087aef0b382dfba.jpg","description":"Feature List-Easy to learn but hard to master gameplay\n-3 levels of difficulty to unlock\n-Works great with touch screen monitors or with a mouse\n-Simple pick up and play mechanics\n-Intriguing dark story told through unlocked poems\n-Includes Steam trading cards\nAbout the GamePressured is a unique and intense number puzzler. Hit your targets to unlock pieces of the dark story, all told via the poetry of Nicholas Gordon.\nYou'll need a combination of quick thinking and sharp reflexes if you don't want to succumb to the pressure.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Paul Marrable","platforms":[{"id":0,"name":"PC"}]},{"id":4471,"name":"LEGO Pirates of the Caribbean: The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c95/c9545f740a380e364d3baffd7e7aa812.jpg","description":"LEGO® Pirates of the Caribbean: The Video Game is an action adventure game that brings the Pirates of the Caribbean world and all its colorful characters to life in LEGO Brick form. Players will experience all the memorable scenesall four films in the humorous and quirky LEGO Video Games style.\nProduct Features:\nExperience the swashbuckling adventure, irreverent humor, memorable characters and amazing creatures of the Pirates of the Caribbean universe (content from all 4 films), through action-adventure gameplay, engaging puzzles and hilariously quirky LEGO cutscenes.\nPlay as Jack Sparrow, Captain Barbossa, Davy Jones and all of your other favorite Pirates of the Caribbean characters, each with their own personalities!\nExperience your favorite sequences from all four PotC films in an all-new way with the \"\"LEGO twist\"\" that takes players from the port of San Juan to the pirate haven of Tortuga and everywhere in-between!\nLocal Co-op play, one of the most beloved features of the LEGO video game series, returns to allow you to team up and enjoy the adventure with others!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":499331,"name":"Sackboy: A Big Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ec/2ec8d2b5d990b9407e20dc81d271300d.jpg","description":"Face thrilling, unpredictable challenges as you explore distinctive hand-crafted lands through deeply immersive and expressive controls.\nGo solo in an epic race against time stuffed with danger and peril – or create teams of two to four adventurers for fun-packed party play as you work together to overcome nefarious tasks however you can imagine.\nCan you save Craftworld from the dastardly Vex and his nightmarish Topsy Turver device… and become the Knitted Knight of legend?\n• PERILOUS PLATFORMING EXPERIENCE\nExplore here, there and everywhere as you utilise Sackboy’s cool, diverse move-set to face a huge variety of thrilling challenges, fierce enemies and startling surprises.\n• COLLABORATIVE, CHAOTIC AND JOYFUL MULTIPLAYER\nTake on side-splitting challenges in local and online* party play. Parties can play through the whole game – including unmissable co-op only levels.\n• RE-STUFFED. RE-STITCHED. RE-ZIPPED.\nSackboy returns to the big time stuffed with fresh moves and game-changing gadgets in an awe-inspiring and downright fun 3D adventure in this new, but familiar world.\nOffline multiplayer (2-4 players)\nOnline multiplayer (2-4 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOptional In-game purchases\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sumo Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":59640,"name":"The Jackbox Party Pack 5","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5bf/5bfa95ccedfe3169021b26d6a836aa9f.jpg","description":"It’s the biggest Party Pack yet with five party-saving new games!\n1)      The pop-culture trivia mash-up YOU DON’T KNOW JACK: Full Stream (1-8 players). The classic returns, full of wild new surprises.\n2)      The what-if game Split the Room (3-8 Players). Create strange and divisive hypothetical situations.\n3)      The lyric-writing game Mad Verse City (3-8 players). Channel your inner MC as a rap battling robot.\n4)      The competitive drawing game Patently Stupid (3-8 players). Create odd inventions to solve bizarre problems.\n5)      The deadliest game show in the Crab Nebula, Zeeple Dome (1-6 players)! Fling yourself at bloodthirsty aliens to win millions of Zubabucks!\nPlay using your phones, tablets or computers. No extra controllers needed!\nNOTE: The Jackbox Party Pack 5 is in English only.\nNOTE: The game is local multiplayer but can be enjoyed over streams with remote players.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21411,"name":"Star Chronicles: Delta Quadrant","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e4/1e4431c37c4d11e3a7ffed55c211cacc.jpg","description":"Delta Quadrant is a sci-fi turn-based strategy game with lite rogue-like elements. Destroy enemies to collect loot, gain experience to level up and use skill points to become stronger. Intended as a fun little sci-fi title, not too hardcore or difficult.\nPiloting a weak exploration ship, you are in search for a new homeworld for your people - that is, until you are lured into a trap by the Dark Order. This has you end up deep in unknown enemy space, with no allies or friends. Alone.\nYour attempt to escape will put you in the path of numerous enemies. Fight to survive, gain experience, level up and get improved weapons and equipment. You will die, but you will also get stronger!\nAs you gain experience and level up, your ship gets stronger (improved hull strength, bigger shield capacity and more powerful engines), and you'll get skill points to help improve various aspects of your ship.\nRogue-like\nTiled Layout and Movement (think Chess)\nTurn-based Game Play\nGain experience, level up, die, get stronger, start again. Rinse and repeat!\n\nCustomization - choose your play style - defensive / aggressive / adaptive\nDefensive - Focus your skills on upgrading your shields. Assign power from your engines and weapons to your shields. Even modify your ship's weapon hard points to allow for additional shield generators!\nAggressive - Focus on POWER - take out the enemy before they get a chance to damage you! Divert more power to weapons. Modify equipment hard points to mount even more weapons.\nAdaptive - Focus on energy transfer to easily adapt to the current circumstances. Divert all power to engines to flee if you're in a tight spot OR divert all power to weapons for a quicker kill OR divert all power to shields to outlast your enemi","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alister Software","platforms":[{"id":0,"name":"PC"}]},{"id":19703,"name":"Inquisitor","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/050/050c96e6bc2909529c0aaceaa7d6e79b.jpg","description":"Inquisitional statistics:\nThree character classes--Paladin, Priest, and Thief--each with his own unique and independent story.\nWield the power of the Inquisition as you arrest heretics; use a variety of tools-such as the iron maiden, suspension, and the rack-to extract confessions and burn the heretics!\nAnimations of the game characters, reflecting every change in the equipment, consist of almost one million sprites (i.e. graphical elements)\nA wide, open-ended world for you to explore and exploit as you see fit.\nMore than 200 weapons, 80 spells, and 7 schools of forbidden and allowed magic!\n37 extensive dungeon complexes (including multilevel dungeons)\n34 surface areas with deep forests, green pastures and extensive towns\n10 years of development, 3 years of translations, months of proofreading\nMore than 5,000 pages of text\nOverview:\nUltherst was once a peaceful, God-fearing land until the Three Scourges of God came to pass as foretold by Saint Ezekiel, one of the twelve followers of the First Prophet. First came the famine that devasted the populace. Next came the plague that added more unfortunate souls on Death’s abacus. Finally came the great rain of fire, and death fell down on sinner and innocent alike, blood flooding the streets in place of water. The people, in their desperation, turned away from the Holy Mother Church and delved deep into pagan decadence or succumbed to the temptation of the Devil. You have been charged with the office of Inquisitor. It is up to you to investigate crimes against the one true faith and root out heresy--using any and all means necessary. As in all best computer RPGs--the most important choices are yours to make.\nInquisitor is a unique blend of action-oriented combat with a deep and involving tale of betrayal, torture, madness, and infernal damnation. Put your wits to the test as you collect evidence against possible heretics and put them to trial once they have been charged. Use the might of the Inquisition to extract a confession from your subjects, but be warned, use your power wisely or you will face the consequences. If a gritty old-school open-ended isometric RPG is what you looking for, look no further. Inquisitor will provide you with hours of gameplay and a dark, involving story.\nDeluxe version bonuses:\nBook – The Inquisitor Novel (pdf)\nBook – Revelation of Ezekiel (pdf)\nArtbook (pdf)\nTwo-hour soundtrack (38 songs)","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"CINEMAX","platforms":[{"id":0,"name":"PC"}]},{"id":616688,"name":"Core Keeper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8d9/8d980d350e5b4661bba3a15afa7b04da.jpg","description":"Drawn towards a mysterious relic, you are an explorer who awakens in an ancient cavern of creatures, resources and trinkets. Trapped deep underground will your survival skills be up to the task?\n\nMine relics and resources to build your base, craft new equipment, survive, and power up the Core. Defeat giant monsters, discover hidden secrets, farm crops, cook new recipes and explore a procedurally generated underground world in a mining sandbox adventure for 1-8 players.\n\nExplore a vast underground cave of endless resources. Mine resources, discover hidden crystals, fossils & trinkets and survive a procedurally generated underground world.\n\nExpand your base from humble beginnings to a vast homestead. Build workbenches and generators to craft new equipment and technology, create your base, and power up your Core.\n\nCustomise your explorer and craft new items, armour and equipment to venture further into the cave. Craft a pickaxe to mine walls and resources, build bridges to cross underground lakes, and place torches and bonfires to light up the darkness.\n\nPlant seeds and nurture crops to grow food, or combine ingredients in the cooking pot to discover tasty new recipes with unexpected buffs.\n\nExplore living biomes and fight cavernous creatures in a simulated underground ecosystem. Defeat giant beasts to claim their crystals and continue the adventure.\n\nSurvive alone or play online with up to 7 other players. Visit their caverns or invite them into yours, working together to mine resources, fight, farm, craft and survive.\n\nFind massive bosses in an infinite, procedurally generated world with endless gameplay and resources.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Pugstorm","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":427653,"name":"Hardspace: Shipbreaker","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/290/290068e3847a26968e29a64737f551a6.jpg","description":"Welcome to LYNX, the galaxy’s leading ship-salvaging corporation!\r\nAcross your career, you’ll have the privilege of paying your debt to us by purchasing salvaging rights to increasingly large and valuable ships. Cut them open and extract as much value as possible!\r\nYou are equipped with the latest in LYNX tech. Carve entry points, salvage valuable materials and components with your cutting tool or slice scrap metal at any angle into a million pieces as you ponder a lonely existence… the possibilities are endless! Be cautious – dying is extremely unprofitable.\r\nWe strongly advise upgrading your tools, helmet and suit to take on more lucrative contracts - all you need to worry about is how you’ll pay for it!\r\nAs of today, your debt amounts to:\r\n999,999,999 Credits\r\nGood luck on the job, cutter!\r\nExperience daily life as a blue-collar spaceship salvager\r\nCut and destroy at will within a next-generation physics simulation\r\nUpgrade tools and unlock new perks to take on harder contracts\r\nJOIN THE COMMUNITY\r\nHardspace: Shipbreaker is a game in early access. Don’t hesitate to join our official Discord server and share your feedback with the development team so that we can improve Hardspace: Shipbreaker together.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Blackbird Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":306147,"name":"Rover Mechanic Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f19/f194138b1e493d0d62a8421beb2575b6.jpg","description":"Rover Mechanic Simulator is a game in which you are a mechanic working on one of the first Martian colonies. Your main tasks include the repair and maintenance of Mars rovers, so that the remaining crew can collect detailed information about the structure of the planet by using them.\r\nThere are many devices at your disposal that will allow you to dismantle and maintain even the smallest parts of the rover. Use different tools such as a screwdriver, compressor, soldering iron, 3D printer and many more. In the later stages of the game, you'll be able to upgrade them, making your work even more enjoyable and effective.\r\nNot all parts need to be replaced in its entirety. You can use special workbenches that can be used to restore damaged IC's and clean and maintain parts that have worn out during rover's work. Thanks to this you can save resources for much more difficult tasks.\r\nUse various devices which will help you prepare the rovers for the repair process. But be careful, their design is very delicate and hasty decisions can increase damage to fragile scientific instruments, which will require more time and resources to complete the job.\r\nThere are many devices on Mars which served people in the past but broke down at some point. You can fix and restore them to service. Thanks to you they can continue to perform their tasks by sending specialized information about the composition of the planet. \"Spirit\", \"Oppurtunity\" and others have served people for years and they can still do it!\r\nGain experience, earn higher and higher ranks  and undertake more and more difficult tasks. The future of humanity on Mars rests on your shoulders!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Pyramid Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":50328,"name":"Zwei: The Arges Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b8/7b850144aa708592a85ccc475d92c977.jpg","description":"Pokkle and Pipiro are two step-siblings living by themselves in the ho-hum village of Puck on the time-forgotten floating continent of Arges. Pokkle loves making terrible puns and wears a tail for funsies, and Pipiro loves buying fashionable clothes and has no filter whatsoever. Together, they meander through what seems to be a peaceful, monotonous existence in their sleepy little burg where nothing interesting ever happens.\nUntil something does, anyway! A mysterious masked figure shows up one night and steals six holy idols from the local shrine. The self-proclaimed “Archduke of Arges” tenders a hefty reward for their return, and our “brave” duo jumps at the chance to go find them – Pokkle for the glory, and Pipiro strictly for the cash moneys.\nTheir journey will take them to every last nook and cranny across the land and lead to confrontations with a wide variety of friends and foes, each more ludicrous than the last, as a sinister plot to revive an ancient “Demon Lord” unfolds and 500 years’ worth of history comes into focus. Can two 14-year-olds with limited abilities and almost no social skills truly save the day? Or is Arges just pretty much screwed?\nReleased in Japan simply as Zwei!!, Zwei: The Arges Adventure is the direct predecessor to the previously released Nihon Falcom action RPG Zwei: The Ilvard Insurrection, from the creators of the popular Ys and The Legend of Heroes franchises.\nBoasting a completely standalone story set on a mysterious “low fantasy” island floating amongst the clouds, Zwei: The Arges Adventure plays out as a classically styled action-oriented 2D dungeon crawler with oodles of optional content and unlockables, player-defined challenge through a unique food-based experience system, and a pervading tongue-in-cheek humor style that helps set it apart from other entries in the genre. Although released on several different platforms in Japan over the years, this is the first time it’s ever been officially released in English, and is the most feature-complete version of the game to date.\nSo what are you waiting for? There’s no need to ask Zwei; you Arges gonna have to play this game right now!FEATURESSD Anime-Style Characters Inhabiting a Colorful Hand-Drawn 2D World\nBoasting beautiful painterly art rife with detail and animations, and populated with an equally colorful cast of super-deformed anime characters who are constantly on the move, the world of Arges feels perpetually alive and energetic.\nFast and Chaotic Combat Featuring a Plucky Duo of Protagonists (and One Pet)\nFend off merciless enemies in real time with Pokkle’s melee attacks and Pipiro’s myriad magics, and solve puzzles to progress through the game’s many dungeons, all while either flanked by a loyal pet or while monitoring said pet from afar as it goes off on its own adorable little journeys.\nTongue-in-Cheek Story and Characters Providing Genuine Humor\nPokkle’s terrible puns and Pipiro’s all-encompassing snark combine with quirky NPCs, self-aware dialogue, weird and unlikely locations, over-the-top situations, fourth-wall breaking, optional side-quests, and more to provide a genuinely funny and dynamic RPG experience.\nFood-Based Leveling System Allowing Players to Challenge the Game on Their Own Terms\nEat food to level-up, or hoard your food so you can exchange it in town for even better food down the line that grants even more experience. Will you stay low-level and challenge dungeons well beyond your means for the promise of more level-ups to come, or will you engorge yourself on demand to make the road ahead a little easier?\nMinigames, Music, Achievements, Art, and More, Creating the Definitive Zwei Experience\nPlay an Ys-inspired typing tutor, an adorable yet savage aeroplane shmup, or a block puzzler that rewards you for not making combos – or maybe just take the time to help guide your pet through the harsh wilderness for various spoils! If that’s not enough, why not try for one of the myriad new achievements, seek out one of the newly illustrated character bromides, or switch out the regular soundtrack for its 2008 arranged version? You can even play the game with Japanese text if you want! Add to that a bevy of control improvements and other modernizations, and you have the ultimate update to this unsung Falcom classic!","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":17917,"name":"Hero of the Kingdom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f38/f385453daa49d9b945f5e6d28b491771.jpg","description":"Set off on a dangerous journey to save your father and the kingdom.\nYou were living a calm life on your small farm together with your father. One sunny day your life completely changed. Malicious bandits raided your house and burnt it to ashes. Your father is missing. A darkness is falling over the whole country and you are setting off on a dangerous journey to places unknown. You must overcome your fear and find your father. You won't hesitate to take the road. This is going to be the greatest adventure of your life.\nExplore a huge beautiful country.\nMeet dozens of people and fulfill many various quests.\nCollect herbs, hunt for animals, and go fishing.\nFind hundreds of scattered hidden items.\nReach up to 38 achievements.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Lonely Troops","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16716,"name":"Gomo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6eb/6eb1cd04ef52ae1af6d36d490aa2cc3a.jpg","description":"How far would you go to save your best friend?\nFor Gomo, the answer to this question is clear: To the end of the world and further, if necessary.\nJoin him on his journey through the bizarre 2D landscapes of this dreamlike Point & Click Adventure!\nFar away, in a hidden valley Gomo and his dog Dingo live in undisturbed peace; but serenity in this fairy tale vale soon comes to a violent end: an unknown alien force abducts Gomo's companion. In exchange for his beloved pet, Gomo is supposed to obtain a rare crystal for the alien. This crystal lies well protected in a subterranean mine- getting your hands on this one won't be easy!\nHowever, there is no choice, but doing as the alien asks...\nYou want to help Gomo? Then be prepared for a surreal journey packed with challenging puzzles.Features:Presented by the creators of the „Deponia“-Series, „The Whispered World“ and „Edna & Harvey - The Breakout\"\nPoint & Click exploration through a surreal dreamscape.\nFondly animated characters, hand-drawn backdrops and creative puzzle design\nCommunication in non-verbal comic style","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10811,"name":"Villagers and Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f62/f627c4e311ef044b0283d59b02340732.jpg","description":"Step into a magical land unlike any other!Villagers and Heroes is a free-to-play MMO game in which players experience the thrill of battling unique monsters, the satisfaction of crafting powerful weapons and gear, and the pleasure of building lasting friendships in a friendly community.Gnomish Augmentation = Sandbox Gameplay.This unique feature is at the heart of the deep yet elegantly simple player choice system in Villagers & Heroes.  The weapons and armor that a player equips not only grant a versatile assortment of heroic feats and spells, but also a large array of proficiencies and augmented abilities. The process of Gnogmenting gives the players the ability to mix, match, swap, replace, customize and design gear exactly how they want! Combine ancient elder gear with remarkable weaponry dropped from the monsters of the world. Or craft your own gear using any or all of the 10 gathering and crafting skills available. Gnogmenting is a completely free-form, sandbox system that is unmatched by any other game in its depth, and lets players test every tactic and indulge every creative whim.Bounty Runs!Bounties are powerful adversaries and monsters that roam every corner of the world. When a player defeats a bounty monster, they earn a large reward, regardless of the size of their party! Solo the beasties by yourself, or rampage across the countryside with a group of friends. Bounty rewards are instantaneous and do not require activation.  This feature encourages teamwork and strategy.Live in a Real Home in a Real Village.You are the architect, the farmer, and the rancher. With a wide range of building styles to choose from, players can design and decorate their own houses, as well as choose which crops to plant in their garden, or select the type of animals they'd most like to raise. But players needn't go at it alone! Help your village grow from a tiny hamlet to a thriving metropolis by aiding your neighbors with community projects which will ultimately benefit every member of the village.Features8 Primary Combat Class Builds, with a myriad of meaningful variations\n10 Crafting Professions: Fishing, Mining, Bug Collecting, Plant Lore, Woodcrafting, Smithing, Cooking, Tailoring, Gardening, and Ranching\nGardening and Ranching:  hundreds of different crops, sheep, pigs, chickens, and exotics like ember sheep, shadow sheep, etc.\nBounty Runs!  Now with over 1500 unique bounties.\nReal player housing with dozens of decoration options\nReal Villages that can be leveled up by all members of the Village with better facilities (Forge, Tailory, Kitchen, Woodshop), opening new neighborhoods with housing for more players, mayors, a shared vault, stocking village resources, and more...\nGnogmenting: Combine crafted gear and elder gear from defeating lair bosses and rare randomly found exotic gear for an unlimited number of combinations of functionality and appearance\nAuction House with thriving in-game economy\nHundreds of Magical Spells, Heroic Feats, and Abilities\nMore than 1000 Quests and ChartersPress Coverage“Free for All: Villagers and Heroes adds Bells, Whistles, and more Sand” -- Massively, Feb 26 2014\n“Villagers and Heroes Review – It’s Expansion Time!” -- OnRPG, Mar 19 2014\n“The Stream Team: Checking out Villagers and Heroes' new client” -- Massively, Feb 24 2014\n“Massively’s Third Annual Frindie Awards” -- Massively, Jan 1 2014","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mad Otter Games","platforms":[{"id":0,"name":"PC"}]},{"id":514902,"name":"Chicken Police – Paint it RED!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17a/17a94bcc1b994fa4e24729371d6988b6.jpg","description":"MEET THE CHICKEN POLICE\n\nSonny Featherland and Marty MacChicken were once a legendary detective-duo, called the Chicken Police. But that was almost a decade ago, and time had ruthlessly passed them by. Now Sonny and Marty are forced to work together on a case that is weirder than anything they've ever encountered before!\n\nNARRATIVE-DRIVEN, DETECTIVE GAMEPLAY\n\nChicken Police is a story-rich and dialogue-heavy game combining elements of the visual novels and classic adventure games. The game has more than 30 characters to talk to, with some having to be seriously interrogated. Collect tons of clues, evidence, and highly sensitive personal information from the shady characters of Clawville to use ruthlessly against them!\n\nEXPLORE THE CITY OF CLAWVILLE (again, and again...)\n\nThere are more than 30 places to visit and some of them will change several times during the story. You can return to previous locations on several occasions, to find hidden secrets, meet new characters and gather information about the world and its inhabitants.\n\nA CINEMATIC EXPERIENCE\n\nChicken Police has a weirdly stunning visual style made with the usage of real photos and photo-realistic 3D backgrounds, inspired by classic film-noir movies and influenced by animated features. Its noir mood is enhanced by an original music soundtrack, backed up by professional voice acting for all characters with more than 8 hours of spoken dialogue!\nChicken Police is a satire, which recalls the mood and atmosphere of the 40's film-noir movies, and as the best noirs and hardboiled detective stories, it's so gritty and hopeless, that it can only be served with a lot of cynical humor.\n\nKEY FEATURES\n\n- A thrilling, rich storyline with a classic film-noir twist\n- Professional voiceover with more than 8 hours of spoken dialogue!\n- A carefully crafted, \"\"colorful\"\" world\n- A complex interrogation system\n- More than 30 unique, fully voiced characters\n- A cinematic film-noir like experience with more than 20 cutscenes!\n- Lots of clues, information, and collectibles to find\n- A beautiful original soundtrack","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Handy Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":44763,"name":"Hidden Agenda","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d0e/d0efde5bf21b6b04a1af954f6fd61e65.jpg","description":"Blending the best elements of movies and games, this story based adventure drops you into a tale rife with chilling moral dilemmas. Up to four of you can join in and influence the narrative, but beware – not all of you will be working towards the same objective…\nCompatible mobile device and Companion App required. For more information visit: www.playstation.com/playlinkcompatibility.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2017 Sony Interactive Entertainment Europe.  Hidden Agenda is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":21322,"name":"Tinboy","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ea/5ead0bb866e7bb6730aa710753bfc1c3.jpg","description":"A brilliant scientist creates a humanoid little robot. She then tests her creation by placing it in different environments. Using a special bow, the robot must reach the exit of every environment. Take control of the robot and solve the scientist’s 60 puzzles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Interactive Stone","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":19046,"name":"IL-2 Sturmovik: 1946","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/533/533d11b1cc5b98c6bb742c1e6dec0f75.jpg","description":"Il-2 1946 includes all of the original IL-2 series content: IL-2 Sturmovik™: Forgotten Battles, Ace Expansion Pack, Pacific Fighters™ and alternate histry campaigns of year 1946. What was years ago began as a one-aircraft study sim is now an astonishing anthology, with a whopping 229 flyable aircraft and over 300 aircraft total!\nThe game has been updated to the latest version 4.12.2. This community made update includes widescreen support with correct FOV, many new planes, maps and scenarios.\nNew Aircraft: 32 new flyable fighters and bombers, and four new AI aircraft!\nNew Maps: Large new historical maps of the Kiev region; a map of Manchuria focusing on a border region between USSR, China and Japanese-occupied Korea; a large bonus Burma map; and an online Khalkin Gol / Nomonhan map.\nNew Campaigns: Nine new campaigns with nearly 200 missions add incredible realism and attention to detail.  There are detailed careers for fighter and bomber pilots, for the German, Soviet, and Japanese air forces, offering such varied objectives as flying jet bombers over occupied Europe, to intercepting American B-29 Super fortresses over Iwo Jima and Japanese home islands!\nAlternate History: Three of the nine campaigns are a departure into alternate history, focusing on hypothetical battles between the Soviet Union and Germany in the year 1946, while WWII still rages on.\nNearly 1,000 new Paint schemes: The new planes, as well as many of the other ones in the series, come with a host of historical paint schemes, showing many of the individual aircraft or squadrons that served in WWII.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"1C: Maddox Games","platforms":[{"id":0,"name":"PC"}]},{"id":18758,"name":"SAMOLIOTIK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7dc/7dc126c246fb7e941c04bc9dd5414a64.jpg","description":"SAMOLIOTIK is a stylish shoot-em-up with different enemies, bosses, colour palettes, power-ups, set in different eras. In this game you will fight Adolf Gutler,The Illuminati, and other creatures.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":23341,"name":"Pro Evolution Soccer 2018","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/006/0069de15664d51d22285c18ab516a089.jpg","description":"PRO EVOLUTION SOCCER 2018 - FC Barcelona Edition Pre-Order Bundle\n[PREMIUM EDITION]\nA special edition version dedicated to FC Barcelona and PES fans! Get exclusive content for myClub associated with the club!\n• 1x FCB Special Agent\n• 1x FCB Legend Special Agent\n• 1,000 myClub coins\nIn addition, the standard pre-order items will be included:\n• 2x Premium Partner Agents for myClub\n• UCL Agent for myClub\n• Usain Bolt for myClub\n+ bonus myClub content:\n• 4x Start Up Agents\n• 1x Partner Club Agent\n• 10,000 GP x 10 weeks\n==============================================================\nPRO EVOLUTION SOCCER 2018 Pre-Order Bundle\n[STANDARD EDITION]\nPre-order now to receive exclusive content:\n• 2x Premium Partner Agents for myClub\n• UCL Agent for myClub\n• Usain Bolt for myClub\nYou will also receive bonus myClub content:\n• 4x Start Up Agents\n• 1x Partner Club Agent\n• 10,000 GP x 10 weeks\n==============================================================\nPES 2018  new features:\n• Gameplay Masterclass – Strategic Dribbling, Real Touch+ and new set pieces take the unrivalled gameplay to the next level\n• Presentation Overhaul – New menus and real player images\n• PES League Integration – Compete with PES League in new modes including myClub\n• Online Co-op -A mode dedicated to co-op play is newly added\n• Random Selection Match – Fan favourite returns with new presentation and features\n• Master League Upgrade – New pre-season tournaments, improved transfer system, presentations and functionality\n• Enhanced Visual Reality – New lighting, reworked player models and animations covering everything from facial expressions to body movement to bring the game to life","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PES Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":22415,"name":"Bloop","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90b/90b4ade7b3f51172989be82b443d9f71.jpg","description":"Liquid chemistry has never been so much fun! Ignite your imagination with a whimsical 2D liquid physics-based puzzle game by Studio 2SD. Experiment with valves of colorful liquid, create and move objects to transfer the substances to their designated beakers. Use quick reflexes, problem solving skills and imagination to conquer each of the challenging puzzles, all in the name of science. Solve your way through 42 maps to reveal the story, or put your creative skills to the test with the in game level editor!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2SD","platforms":[{"id":0,"name":"PC"}]},{"id":58765,"name":"Afterparty","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdd/bdd4224a2daa519606f14e15be6977fc.jpg","description":"In Afterparty, you play Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth.\nMilo and Lola are now dead, thirsty, and roaming the streets of Nowhere, the outermost island of Hell.\nWhat adventures will you stumble through in the underworld? Every step is up to you. Time to go on the best bender ever, uncover the mystery of why you've been damned, and drink the big guy under the table.\nFeatures:\nParty as two best friends: Control Milo and Lola with an intelligent conversation system that changes the story and your relationships based on every decision. Uncover their personality quirks and foggy history during the wild events of the night\nDrink for your lives: Hell bars offer a variety of libations, each with different Liquid Courage effects to imbue Milo and Lola with specialized dialogue options and abilities\nDemonic activities: The underworld’s pubs are packed with drunken games to pass the time. Beer pong, dance-offs, karaoke and chugging competitions all mesh with the dynamic dialogue system for a seamless narrative bender\nChange Hell forever: Players’ actions won’t only affect Milo and Lola, but also the people and places of Hell. Finishing a quest on one island might result in the total destruction of another\nFlirt with Satan\nExplore an interconnected network of underworld islands via the River Styx\nAn original soundtrack by scntfc (OXENFREE, Sword & Sworcery)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Night School Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]