[{"id":24182,"name":"The Legend of Zelda: Twilight Princess HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/46e/46e49369d4a3d528db5216a5cadec38b.jpg","description":"Click\nhere for The Legend of Zelda: Twilight Princess HD retail\nbundle that includes the Wolf Link amiibo™ figure.\n\nA dark force, shrouded in twilight, has invaded the vast land of Hyrule.\nTo restore light to the world, team up with the mysterious creature\nMidna and embrace the darkness to transform into a divine wolf. Fight\nthrough labyrinthine dungeons, survive puzzling traps and meet a cast of\ncharacters you’ll never forget in this legendary Zelda™ adventure.\n\nThe Legend of Zelda™: Twilight Princess is a critically acclaimed\nmasterpiece, set in a massive world bursting with life—but also shadow.\nA dark figure from the Twilight Realm has invaded the world of light. As\nLink™, a farmhand turned cursed beast, join forces with the impish Midna\nand trusted (albeit unusual) allies to survive a quest that'll take you\nto the farthest corners of Hyrule and beyond… to the Twilight Realm.\nThis emotional adventure is now on the Wii U™ console with improved\nvisuals and controls—and new challenges. Choose Hero Mode to take 2x\nnormal damage, or tap the Wolf Link amiibo™ figure to unlock the tough\nCave of Shadows.\n\nThe Legend of Zelda: Twilight Princess HD is the best way to\nexperience this critically acclaimed game\n\nExplore a vast Hyrule, a mysterious Twilight Realm, and\nmasterfully-designed dungeons\n\nRestore balance to the world with the aid of the impish Midna and your\ndivine wolf powers\n\nMeet a cast of friendly folk and interesting characters, like the\nentrepreneurial baby Malo and even a yeti couple\n\nEnhanced visuals, additional controls, bonus challenges, and Miiverse™\nfunctionality make the game feel fresh again\n\nPlay in Hero Mode to take 2x the normal amount of damage—and do it\nwithout any heart drops to refill your health!\n\nTap any of the other Legend of Zelda amiibo figures from the Super\nSmash series to unlock other bonuses, like extra arrows or even more\nchallenging gameplay","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"}]},{"id":23216,"name":"LocoRoco Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f30/f30a1c1aaec9167e6ab0c52000a75558.jpg","description":"The peaceful world of the LocoRoco™ are under attack by the not-so-nice Moja Corps! These evil outer space creatures have come to take the LocoRoco from their land of blowing flowers, lively creatures and pastel scenery. You must move the LocoRoco through more than 40 levels of slippery slopes, teetering platforms, and maze-like passages. The LocoRoco have the uncanny ability to fluidly morph to their landscape, so all you need is to tilt, roll, and bounce the happy blob-like creatures to safety.\nTake advantage of LocoRoco in native 4K on your PlayStation®4 Pro system and compatible 4K display. Also enjoy LocoRoco in 1080p resolution on your PlayStation®4 system with an HD display device.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2006 Sony Interactive Inc. LocoRoco is a trademark of Sony Interactive Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":17635,"name":"Blues and Bullets","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d87/d877c5825ba9f0c68aff5585d9836f9d.jpg","description":"Eliot Ness, the former leader of the legendary Untouchables, wished only to spend the rest of his days working in his diner, not dwelling too much on the cesspit of corruption his city, Santa Esperanza, had degenerated into.\n\nBut things rarely go as planned.\n\nWhen children suddenly start to disappear and the police just simply a blind eye, Eliot decides to take the law into his own hands, track down the culprit and bring him to justice by any means necessary, even if he has to abandon his dreams of a peaceful life and again get embroiled in shootouts with the usual array of assassins and hoodlums.\n\nHelped by various characters from some unexpected places, the player must guide Eliot through the increasingly morbid and decadent scenarios searching for clues to solve the cases in the five episodes of this season's Blues and Bullets.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"A Crowd of Monsters","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16876,"name":"Putrefaction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ea/8ea499bdfb734fbe2af2896799515ece.jpg","description":"Putrefaction is a First Person Shooter with horror elements, lots of enemies and weapons. The game heavily inspired by old-school shooters from 3D Realms and id Software.Features\n1) Fast-paced, adrenaline shotting.\n2) Tons of enemies, with different behaviours\n3) Huge variety of weapons, ranging from simple pistols and riflles to exotic and mystical weapons.\n4) Boss battles with HUGE bosses.\n5) Old school searching for med packs without health regeneration\n6) Two game modes: campaign and survivalStoryIn the near feature the new disease started to infect people. The infected experienced horrifying body transformations, making them unable to even walk or talk normally. In response to this threat a special elite force was created, with the task of finding a source of this horrible epidemic and eliminating it. You are playing as a member of this organization, send to check an abandoned base in mountains. From there you must find an underground facility and uncover horrible truth about what's really happening.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kazakov Oleg","platforms":[{"id":0,"name":"PC"}]},{"id":16425,"name":"Red Comrades 3. Return of Alaska: Reloaded","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ef/5ef697b7f02e556e05139850355b77e6.jpg","description":"World stands upon the brink of destruction all because of Pete and Vasily Ivanovich and their irresponsible use of priceless device – The Time Machine.  Backwoods village was somehow teleported into the USA and it threatens to cause irreversible consequences for entire universe!\nIn order to save the world once again Pete and Vasily Ivanovich will have to get through fire, water and through… some other stuff and then again and again.\nThey will get really close to the worst criminals on Las-Vegas streets, enlist in the commandos and complete several missions for the USA government - to get rid of drug dealer's band in jungles of Central America, to fight against Saddam Hussein and even to make a trip to Alaska.\nAs usual, Pete and Vasily Ivanovich will get some help from their old friends from previous episodes. So meet the Anka (this time she is a FBI agent), Furmanov (he is a Mormon preacher now) and Kuzmich who suddenly discovered a rare artist talent. Of course, you will meet many new characters.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Saturn Plus","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14407,"name":"PERFECT ANGLE: The puzzle game based on optical illusions","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f2/2f2ccf4e82723a69f049bb9c7686eb36.jpeg","description":"\nChallenge your mind with puzzles that are based on optical illusions. Find the perfect angle by rotating the camera until order is restored, and discover a story that is full of mystery.\n\nNothing is what it seems! Sharpen your perception by beating over 100 puzzles through scenarios with no apparent structure or logic.\n\n\nDetect the perfect angle in which a chaotic composition reveals the figure hidden behind a game on perspective. Test your visual acuity by accepting a greater challenge each time.\n\n\nOn entering PerfectAngle, you will discover an extremely beautiful place in which every object that you manage to build will bring to memory part of the mysterious life of the protagonist\n\n\nPenetrate the mind of the protagonist immersed in a seductive atmosphere. Stunning graphics, original music and captivating sound effects.\n\n\nOver 100 puzzle levels based on optical illusions.\nOriginal soundtrack\nOriginal script.\nRecord your progress automatically in the cloud.\nTranslated into 11 languages: English, Spanish, French, Italian, German, Portuguese, Chinese, Russian, Korean, Japanese and Catalan.\nVoicing by professional voice actors.\nUnique graphics and setting.\nSimple and mechanical control for relaxed gaming.\nFull support for external controllers including xBox and Steam controller.\nWindows, Mac & Linux.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ivanovich Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":11280,"name":"Space Distant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a27/a27e3ea42187346d11c3caa1f97ba2a7.jpg","description":"Distant Space are present the arcade game of cosmic fights in arcade style of the 80's, this is a game where you can control the spaceship and forced to destroy extraterrestrials, which are moving in the certain order.\n26 unique levels, fights against bosses and ear candy music of that era emphasize style of the Space Distant game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PixelMouse","platforms":[{"id":0,"name":"PC"}]},{"id":11119,"name":"Dyscourse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/531/531580aa0595427175255ebc2efea7df.jpg","description":"Dyscourse is an interactive choice-based narrative adventure game where you journey through a stylized world of choice and consequence. You play as Rita, an unfortunate art school grad turned barista, who is now stuck on a desert island with a crew of oddball travelers after a plane crash. That last choice you just made? It may end up being integral to your group’s survival, or it may lead you down a path to murder and cannibalism!\nStories in Dyscourse are emergent, and choices made in the game directly tie to the survival or downfall of the group. As players get to know their fellow castaways and make critical and interpersonal decisions, drama dynamically unfolds, and your choices author your own unique story.\nWe've designed Dyscourse so that players will end up with vastly different stories forged from their choices - everyone’s playthrough will have a unique story to tell. With over 120,000 words and many hours of replayable content, each playthrough allows players to explore more of the overall “story space” and learn more about the crash and their fellow survivors. There are no ‘good’ or ‘bad’ choices and endings to Dyscourse - how to best survive the island is a decision left up to the player. Choose wisely!\nKickstarter!Yes, it's true. Dyscourse is a Kickstarter success story! Thanks to over 2,000 backers, we hit our $40,000 goal back in November of 2013.\nSpecial Edition!We're offering a Special Edition of Dyscourse which includes:\nThe 77-song Dyscourse soundtrack (Yes, 77 unique songs! We're crazy!)\nDyscourse mid-development documentary video\nDigital art-book of the making of Dyscourse\nDyscourse wallpaper\nIndie Island!Now available! Indie Island is a bonus story for Dyscourse that features 10 prominent indie game developers stuck on an island together. After a GDC-bound flight took a turn for the worse, these ill-fated indies must now survive together, for better or for worse.\nIndie Island contains the likes of Tim Schafer (Double Fine), Edmund McMillen (Super Meat Boy), Phil Tibitoski (Octodad), Alexander Bruce (Antichamber), Ron Carmel (World of Goo), Robin Hunicke (Journey), Ichiro Lambe (Aaaaa!), Adam Saltsman (Canabalt), Will Stallwood (Auditorium), and Rami Ismail (Ridiculous Fishing).LinksVisit the Dyscourse website: http://www.dyscourse.com\nVisit Owlchemy Labs: http://owlchemylabs.com\nFollow us on Facebook: http://facebook.com/owlchemylabs\nFollow us on Twitter: http://twitter.com/owlchemylabs","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":5328,"name":"Zombie Apocalypse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e3/1e30b9e3eab2d72c00f1df9b80694837.jpg","description":"The world as you know it is gone. A zombie infection has swept the globe and the undead now\noutnumber the living, but you have plenty of ammo and it's time for payback!\n\nDestroy as many zombies as you can and try to save any remaining survivors as you blast your\nway through seven danger filled environments. Up to four players can battle the zombie\nhordes with an arsenal of eleven deadly weapons, including mini-guns, flame throwers, grenade\nlaunchers, and a chainsaw for when it's time to get in close... or save on ammo by forcing\nzombies into the whirling blades of a helicopter or the spinning teeth of a wood chipper. Unlock\nseven challenging game modes as hone your zombie killing skills and protect the world from a\nZombie Apocalypse!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":4462,"name":"Lumines Electronic Symphony","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2c/b2c10137a455553ea55933709bdf9814.jpg","description":"The king of music-puzzle games returns with its first new installment in over 5 years. Lumines™ Electronic Symphony marks the return of Q Entertainment’s landmark puzzle series, bringing together addictive puzzle action, new 3D graphics engine, and significant names in electronic music history.\nKey Features\n• New block mechanics give players additional strategic options. Clear huge block combos using the powerful Chain Block, or learn the powers of the Shuffle Block.\n• Star-studded musical line-up featuring the brightest names in electronic music as well as original tracks composed by Q Entertainment.\n• All-new EXP system that rewards player effort by providing an in-depth player profile, deep stat tracking and more.\n• Social experience: How do you stack up against your friends? Whether you’re a new Lumines™ player or a veteran of the series, the new social features will encourage you to play just “one more game.” Another level, another rank, or another reward is within reach.\nSome functions and features may not be available on PlayStation TV.\n1-2 player(s)\n721KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n© 2004-2012 Q ENTERTAINMENT Inc.  © 2004 Bandai/NBGI. Art Assets excluding Q ENTERTAINMENT Inc. and NAMCO BANDAI Games Inc. elements © 2012 Ubisoft Entertainment. All Rights Reserved. Based on the Lumines franchise owned by Q ENTERTAINMENT Inc. and NAMCO BANDAI Games Inc. and is used by Ubisoft Entertainment under license granted by Q Entertainment. LUMINES is a trademark of Q ENTERTAINMENT Inc. and NAMCO BANDAI Games Inc. and is used under license. Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft","platforms":[{"id":0,"name":"PS Vita"}]},{"id":578182,"name":"Thymesia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/829/829dcd5947ea2f62d66ecf2111ff2a3d.jpg","description":"Story\r\nA kingdom once thriving on the power of alchemy enters an age of calamity. After discovering the price behind alchemy, an attempt to stop the use of  it  backfired. Within a few days, the kingdom was in chaos and the streets infested with monsters.\r\nThe key to understanding all of this is in Corvus’  hands, but he  has  lost his memory.  The truth can only be found within his memories, but every time he dives  back in, he only finds more secrets.FeaturesHarness the Plague: Seize the disease from  gruesome bosses and wield them as weapons. Give them a taste of their own medicine. This is the only way to survive this desolate kingdom.\r\nEmbrace the Raven: Shift into your raven form during battle. Throw your feathers like daggers and execute enemies with the swiftness of a raptor.\r\nFight Your Way: Upgrade and modify your basic movements and plague weapons. Build your very own play-style and prepare for the challenges in your way.\r\nShattered Memories: Recover your memories through adventures. With different choices you’ve made and items you’ve collected, you’ll get different endings. Stitch together your own truth.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"OverBorder Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":510156,"name":"Family Game Night","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d51/d51ac59388da7e8c9a6ad1f52193dfd0.jpg","description":"HASBRO FAMILY GAME NIGHT is now available on Xbox LIVE! Featuring six downloadable games, including BATTLESHIP, YAHTZEE, BOGGLE, CONNECT FOUR, SORRY!, and the all-new SORRY! Sliders, HASBRO FAMILY GAME NIGHT has something for everyone! Join your host MR. POTATO HEAD for fun and games with family and friends like never before. Enjoy familiar original Hasbro board games or throw in a fun spin with new versions like CONNECT FOUR Power Chips, BOGGLE Portal Cubes, Reverse YAHTZEE, and BATTLESHIP Super Weapons – which add fresh dimensions and challenges to these legendary favorites! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":263566,"name":"Disjunction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdc/fdc20b0b4aa51f411f8216b6ddef72b0.jpg","description":"The year is 2048, and the world is plagued with economic downturn, environmental disaster, and societal destabilization. In the United States, natural resource starvation and severe climate change have led to massive urbanization, with millions of Americans forced to seek new lives among the sprawls of steel and concrete of America’s cities. These swelling urban populations, coupled with intense civil unrest, have culminated in greatly increased crime rates, with many cities becoming dense hives of vice and lawlessness. City governments and law enforcement do their best to stem the rising tide of crime, but are oftentimes ineffectual due to severe corruption and the increasing sophistication of American criminals.\nDisjunction is a single-player, cyberpunk, stealth-action RPG, set in the dystopian underworld of New York City. The game follows the interconnected narratives of three characters as they unravel a mystery that will change the fate of their city.FeaturesChallenging stealth-action gameplay that allows you to play the way that suits your style, whether it be sneaking through levels like a ghost or going in guns blazing.\n30+ handcrafted non-linear levels.\n3 unique characters, each with 4 Abilities, 8 Cybernetic Upgrades and 16 Talents to customize how you want.\nA reactive story where your choices have real consequences.\nDetailed pixel art characters and environments.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ape Tribe Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":255825,"name":"Sakuna: Of Rice and Ruin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/276/276161d772f7f3f9a4520f6e9698f8c8.jpg","description":"Players take on the role of Sakuna, a proud yet lonely harvest goddess who is banished to a dangerous island with a group of outcast humans. As she tames the island by defeating demons in gorgeous, mysterious natural settings, she will also find a home in a mountain village, proving herself worthy of her title by harvesting rice and bettering the lives of humans. In addition to serving as a love letter to Japanese mythology, Sakuna: Of Rice and Ruin is an ode to the artistry of cultivating rice, and an engrossing simulation of the craft behind the agriculture.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Edelweiss","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":53747,"name":"Chip 'n Dale Rescue Rangers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1fd/1fdad3fb63b7ac79172b980d8cf03c25.jpg","description":"The rescue rangers are tiny heroes. Consisting of two chipmunks, two mice and a fly... these heroes may be small but there's no case too big for them to take on. This game starts out simply enough, with a mission to rescue a small kitten, but soon escalates into a wider plot that pits the rescue rangers against their arch-nemesis, the feline kingpin, Fat Cat.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Capcom","platforms":[{"id":0,"name":"NES"}]},{"id":53506,"name":"Rock n' Roll Racing","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c42/c424d1344fa0ad3c24e7ad384a1f8192.jpg","description":"Rock n' Roll Racing is a vehicular combat-based racing video game developed by Silicon & Synapse (now known as Blizzard Entertainment) and published by Interplay Productions for the Mega Drive/Genesis and the Super Nintendo Entertainment System in 1993. The game prominently features a number of popular heavy metal and rock songs in its soundtrack, hence the game's title. The game was ported to the Game Boy Advance in 2003.\nRock n' Roll Racing was initially developed as RPMII, a sequel to the company's SNES game RPM Racing. At the end of the project, Interplay marketing added licensed music and changed the name to Rock n' Roll Racing. It is also similar in gameplay to Racing Destruction Set where it got its logic/AI engine and the NES game R.C. Pro-Am developed by Rare in 1988.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Software Creations","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"SNES"},{"id":0,"name":"Genesis"}]},{"id":45944,"name":"Danganronpa V3: Killing Harmony Demo Ver.","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35e/35e9ecab4e95b1b114f73070bead2362.jpg","description":"Welcome to a new world of Danganronpa, and prepare yourself for the biggest, most exhilarating episode yet. Set in a “psycho-cool” environment, a new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished. Reimagine what you thought high-stakes, fast-paced investigation was as you investigate twisted murder cases and condemn your new friends to death.\nKey Features\nA New Danganronpa Begins: Forget what you thought you knew about Danganronpa and join a completely new cast of Ultimates for a brand-new beginning.\nMurder Mysteries: In a world where everyone is trying to survive, nobody’s motivations are quite what they seem. Use your skills to solve each new murder or meet a gruesome end.\nLie, Panic, Debate! The world is shaped by our perception of it. Fast-paced trial scenes will require lies, quick wits, and logic to guide your classmates to the right conclusions.\nNew Minigames: Between the madness of murdered peers and deadly trials, enjoy an abundance of brand-new minigames!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PC"}]},{"id":44054,"name":"Global Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/332/332984c456775be846d36001be1d9b03.jpg","description":"Global Adventures is on Kickstarter!\nSupport us on Kickstarter to receive exclusive items!\nAbout the GameIn Global Adventures, your life gets turned upside down after you join the adventurous Treasure Hunters' Association (THA)...\nand head out to explore the Mayan ruins.\nBut what starts as a treasure hunt quickly turns into something more, as your expeditions reveal bits and pieces of information that could unravel the mysteries of history.\nDuring your journey, you will encounter several enemies of the THA – including the Black Flag Gang,\nShinobi Cabal (a ninja group that wants to create an undead army),\nand The Priory (a secret order that seems to have a sinister plan).\nFace off against zombies,\nVampires,\nreincarnations of ancient gods,\nand much more as you journey across continents!\nLike us on Facebook\nFollow us on Twitter","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"PixelSoft","platforms":[{"id":0,"name":"PC"}]},{"id":40205,"name":"Tom Clancy's H.A.W.X. 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/532/5329e6a716cab241b4899ef0084c1238.jpg","description":"Tom Clancy’s H.A.W.X. 2 plunges fans into an explosive environment where they can become elite aerial soldiers in control of the world's most technologically advanced aircraft. The game will appeal to a wide array of gamers as players will have the chance to control exceptional pilots trained to use cutting edge technology in amazing aerial warfare missions.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":30799,"name":"Baldur's Gate II: Shadows of Amn","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c16/c160077f8977cb22f14e56408c1560ef.jpg","description":"Kidnapped. Imprisoned. Tortured. The wizard Irenicus holds you captive in his stronghold, attempting to strip you of the powers that are your birthright.\nCan you resist the evil within you, forge a legend of heroic proportions, and ultimately destroy the dark essence that haunts your dreams? Or will you embrace your monstrous nature, carve a swath of destruction across the realms, and ascend to godhood as the new Lord of Murder?\nBaldur’s Gate II: Enhanced Edition includes the original Shadows of Amn campaign, as well as the following expansions:\n* Throne of Bhaal: Travel to Tethyr in this thrilling conclusion to the Bhaalspawn saga, and delve into the treasure-filled halls of Watcher’s Keep!\n* Fist of the Fallen: Help the Sun Soul Monk Rasaad find peace in his quest for vengeance, and determine the fate of a heretical sect.\n* The Black Pits II: Gladiators of Thay: Explore the tactical depth of high-level Dungeons & Dragons combat. Turn your captors against each other while you dodge traps and battle for your life against Demi-Liches, Mind Flayers, and the legendary Githyanki.\nBaldur's Gate II: Enhanced Edition also offers the following premium content available for purchase:\n* A Price Paid in Blood: Join the Blackguard Dorn in carving a swath of destruction across the Realms, as he struggles to appease the increasingly bloody demands of his dark patron.\n* A Voice in the Dark: Recruit the mysterious Thief Hexxat and take up her mission of retrieving long-lost artifacts from tombs as far away as Zakhara.\n* In Defense of the Wild: Protect the innocent and stand with Neera the Wild Mage against a ruthless school of Red Wizards.\nNote: All translations are text only. Voice-overs are played in English.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"BioWare","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":29279,"name":"Kreedz Climbing","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dff/dff69bf63a244ec69b743f8edf651f3f.jpg","description":"Kreedz Climbing is a special kind of Platformer + Jump & Run + Race + Puzzle in 3D. It is a challenging movement based game that can be very addictive. Whether casually or in strong competition, there is always something to learn and do! The challenge is to beat the course in the fastest time possible. A checkpoint system allows you to return to a saved position if you fail, but you are truly a great \"Ath1337\" if you can beat the courses without them.\nThe best part is that it is totally free to play!Key Features\n- Learn the core 7 disciplines in the Tutorial, then find the rest in the various maps!\nJump, Surf, Bunnyhop, Bungee, Powerjump, DoubleDuck, Long Jump, Raceway, Bhop Raceway, Deathtraps, Flare Targets. There are single discipline and multiple discipline courses!\n- 120+ maps to choose from\nThe sky is the limit in Kreedz mapping. Natural, rural, suburban, city, space, surreal. Each map is totally unique and may even have multiple courses!\n- Single and mixed discipline courses\nOne of the coolest things in Kreedz Climbing is the mix. Some maps may have one course, others have many and the combinations of disciplines and special abilities are limitless. A single course may be one discipline, but may also require mastering many of them to beat.\n- Tag Arena Multiplayer game mode\nSimilar to Hide and Seek, Seekers chase the Runners! Special pick-ups are available to the Runners to help them keep away from the extremely mobile Seekers who have Powerjump and the special Seeker Vision to their advantage. The chasing can get VERY wild!\n- Create your own maps\nUsing Valve's own Hammer world editor, you can create maps for the game. Kreedz Climbing has a very large amount of special functions and entities ready for you that are completely unique to the game. There are a million ways to make a map. If you are openly creative, mapping could be your thing because in Kreedz Climbing you can create anything!\n- Earn Medals to unlock fun items\nAs you beat maps while on a server or alone, you earn medals. These medals allow you to buy special fun items from the Special Item Shop. When your timer is not running, you can goof around in the map all you like, look for short cuts and special jumps and use these items to assist you.\n- Compete alone or with friends online\nKreedz Climbing is flexible. Play it alone, play it alone with friends around, or play it with friends. Co-op maps must be played with 2-4 players using boosting and same time puzzle actions. You can create your own server for your friends to play on with Create Server on the main menu! Please note that port 27015 must be forwarded in order for your server to be visible to others (Visit https://support.steampowered.com/kb_article.php?ref=5452-TASB-6078 for more information).\n- The Art Tool\nEver wanted to draw something on the walls in a game? You can do it! Players use it to draw arrows, showing new players where to go next. Others draw whatever comes to mind. With many colors and sizes, it's a lot of fun!\n- One of the nicest and most helpful game communities\nHands down!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ObsessionSoft","platforms":[{"id":0,"name":"PC"}]},{"id":24170,"name":"Donkey Kong Country Returns","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccd/ccd36642cee0cbb95681a6e3b7715381.jpg","description":"Donkey Kong™ is making a triumphant return, along with his trusted\nsidekick Diddy Kong™, in a brand new side-scrolling platform game from\nRetro Studios. Donkey Kong Country Returns, for the Wii system,\nhas all new levels and all new chest-pounding challenges for players of\nall ages. The game takes inspiration from the original Super NES series,\nfrom barrel blasts to mine carts and then builds upon it by adding\nstunning graphics and new layers of depth to the world and game play. Donkey\nKong Country Returns features the first ever simultaneous\ncooperative game play mode for the series allowing both novice and\nskilled players to actively play and experience the game together. Run,\njump, climb and defeat enemies through diverse environments until you\nretrieve Donkey Kong's stolen banana hoard!\n\nFEATURES:\n\nFeel the power of Donkey Kong by shaking the Wii Remote and Nunchuk to\nperform Ground Pounds, Barrel Rolls. These moves can be used to\ndestroy blocks, defeat enemies and reveal hidden areas. Donkey Kong\nalso has the new ability to climb walls and ceilings.\n\nDiddy Kong has a few new tricks of his own. He can use his Barrel Jet\nto hover high above the ground or defy gravity and fly across small\nchasms. He can also help Donkey Kong with this ability by hopping on\nto Donkey Kong's back. In two player mode, a quick shake of the Wii\nRemote will give him the ability to fire his Peanut Popgun to assist\nDonkey Kong.\n\nThe levels in Donkey Kong Country Returns are beautifully\nrendered and creatively designed with lots of hidden items to\ndiscover. Try to collect all of K-O-N-G Letters and hidden Puzzle\nPieces in each level to unlock something special.\n\nIn cooperative mode, players of different skill levels can play\nthrough the game together.\n\nPrice effective March 11, 2016.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Retro Studios","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"}]},{"id":23630,"name":"Zombidle: REMONSTERED","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/549/5494eb9cb779ee4a70c4461d0b9af87c.jpg","description":"Like the song says, good guys finish last, and in this case, they also finish homeless and on fire.\nJoin up with Bob our local Necromancer and his cohort of evil buddies to raise some proverbial and literal hell across the kingdom of... Good... land... Goodlandia... yeah, that's what we're going with. Use all your evilitude to ruin these poor fella's day and tap your way to become the baddest of all the badasses in your corner of the fiery pit of clicker hell.\nAnd if you think that doing that isn't evil enough, how about some corporate management abuse? Con your zombies and monsters into doing your work for you so you can sit back and reap the reward of their labor, idle game style.Features\n• Various evil baddies to help you on your quest of not being a nice guy.\n• Gallons of skills to enable the ultimatest, deadliest sin: utter slothing.\n• Hordes of peaceful people to annoy and bully around.\n• Lots of towns to pillage and plunder for some phat loots.\n• Purchase some subterranean real-estate without filing the paperwork; yolo.\n• Enjoy new content twice a month, almost, basically whenever we stop being lazy.\n• Already an established troublemaker? You can import your progress and play on desktop with our cross platform technology!\n• Play in most language known to man, including Hodor","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Berzerk Studio","platforms":[{"id":0,"name":"PC"}]},{"id":20745,"name":"The Entente Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/167/1677e6277ef65544847f858381043ddd.jpg","description":"Darkestville Castle Coming Soon\nAbout the Game\nOn June 28, 1914 in the center of Saraevo Gavrilo Princip shot Archduke Franz Ferdinand and his wife. Those shots began one of the bloodiest wars in the history of mankind the First World War. For four long years the earth trembled from gun explosions, the air was whistling with bullets and the sky was covered with smoke and ashes. It was the first war with such amount of troops to take part in it and with military operations going on earth, in the skies and seas, even under the water. Weapons of mass destruction were used for the first time.\nThe Entente WWI Battlefields gives a chance to see it with your own eyes and try to change the history. Choosing one of five available countries of this real time strategy game (France, Germany, Russia, Austro-Hungary, England) players get under command troops with various units starting from infantry and cavalry and ending with battleships. All units were made true from historical point of view by using archive documents and photos. Every nation has its own features, which allow you to use strengths and weaknesses of troops from different states.\nEconomic and military advisors are present in the game to facilitate control over economic and military development. Advisors assist in upgrades, obtaining resources and producing units. There are more than 1000 structures on the map and 80000 units, 3D sound and full encyclopedia of armament that give a chance to feel like high military commander entrusted with the fate of the nations.\n•\tOne of the first games based on actual events of the WW I\n•\tMassive battles (up to 10,000 units can take part in a battle from each side!)\n•\tNon-linear mission structure and authentic historical battles\n•\tVarious types weaponry, armor, vehicles, buildings from that period, which are unique for each nation\n•\tEntente Gold includes two new campaigns with 7 missions each, map and missions editor.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lesta Studio","platforms":[{"id":0,"name":"PC"}]},{"id":19499,"name":"Air Conflicts: Secret Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/214/21456335d6908cb87b0669b2aaacf1c7.jpg","description":"Air Conflicts: Secret Wars is an arcade flight simulation set in a world war I + II scenario.  During the 7 campaigns the player has to fly and fight through 49 missions. Before taking off, the player can choose between different aircrafts, each with different strengths and weaknesses.\nWithin the missions the player gets different objectives like patrolling, sneaking, hit & run, bombing and escorting. Objectives are presented as dialogues between different characters. After some missions the player can upgrade one of his skills in order to maneuver the airplanes easier, have more endurance or have your wingman boosted. Further, the player can choose between two control schemes. Arcade and simulation. The first one makes the game easier to control, while the second one gives more options to control the aircraft.\nBeside the campaign the game also features several multiplayer modes, local and via internet for up to four players.\nKey features\t\t\t\t\t\t\tSeven campaigns, each based upon a resistance movement of the second world war\nAction-packed gameplay delivers the excitement of serial combat in a manner accessible to everyone\nOver twenty different landscapes, each individually detailed with period precision\nPilot more than 16 individual aircraft, in both World War One and World War Two settings\nMachine gun your enemies, dog fight, bomb ground targets and rocket ground troops and enemy vehicles\nMore than 48 varied missions provide combat, stealth and exploratory gameplay\nThe player controls his aircraft with either mouse and keyboard or gamepad\nThe player can choose between two control schemes: Arcade and simulation.\nSeveral multiplayer modes, local and via internet for up to four players\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":18878,"name":"War on Folvos","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/670/670f191e49875d2cfa4bf2cbe955e201.jpg","description":"Choose your side and lead your soldiers, tanks and aircraft to victory.\nThe people of Folvos are about to lose their freedom. Their tiny planet is home an extraordinary new raw material, but they themselves don’t even know about it. The great Vasgalan Empire discovered it and is staking their claim. Clouds of war are shaping over the endless Folvos desert. You cannot wait any longer. Choose your side and take command! Lead your soldiers, tanks and aircraft to victory through Folvos varying landscapes across dozens of battles.\nEnjoy highly developed turn-based system with many tactical options.\nAccessible for beginners, but deep enough for seasoned veterans.\nPlay two campaigns for different sides and a tutorial.\nWin 20 unique scenarios.\nCommand 20 different types of military unit.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lonely Troops","platforms":[{"id":0,"name":"PC"}]},{"id":16317,"name":"Kitty Cat: Jigsaw Puzzles","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7b/d7b995cad5c6e2bcc5ef87f9c89355e8.jpg","description":"Kitty Cat: Jigsaw Puzzles is the puurfect game to cat lovers and jigsaw puzzle game enthusiasts. The game includes 84 challenging jigsaw puzzles with beautiful pictures of sweet, irresistible and adorable cats and kittens. There are 4 levels of difficulty adding to the fun. Puzzles will increase in size with additional pieces to place, and the quicker you solve each puzzle, the better star rating you will get. Are you up for the challenge?KEY FEATURESCute and cuddly cats and kittens\n84 challenging jigsaw puzzles\n4 levels of difficulty\nFun casual gameplay","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16307,"name":"ABC Coloring Town","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce4/ce4ec679f7b535f1ce849249e7b58aa8.jpg","description":"ABC Coloring Town is an interactive coloring book suitable to kindergarten and pre-school children looking for a fun letter- and word-recognition challenge in English, which also teaches basic computer concepts and skills. Travel through a wonderful fantasy village with beautiful forests, lush meadows and crystal-clear rivers on an adventure to visit 26 cozy houses, where each house is a word challenge and contains an intuitive and easy-to-use coloring book with fun options such as paint-brushes, fill- and draw-tools, and a palette of 16 distinct colors to select.\nABC Coloring Town offers a creative playground for children and is a fun way to learn Basic English pronunciation and words. Explore and learn letters from the alphabet as you visit cute houses full of pretty pictures to paint. A total of 78 pictures are included (3 pictures for each letter of the alphabet), and you will never get tired of exploring the adorable village.Key FeaturesInteractive coloring book teaching Basic English\nFantasy Village with 26 houses to visit\n78 pretty pictures to paint\nFun fill- and draw-tools, brushes and 16 vibrant colors to select","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":3199,"name":"Zombie Vikings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d9/2d9758cd1371663c90f508915400d70f.jpg","description":"From the creators of indie smash hit Stick It to The Man! comes a new one to four-player co-op stab-you-in-the-gut-a-thon. Embark on a dead funny adventure with the Zombie Vikings. A putrid posse sent on a mission through the most epic of worlds to retrieve Odin’s lost eye.\n\nPlay as the most fearsome Vikings ever raised from Norse soil – Gunborg, Seagurd, Hedgy and Caw-kaa. Hack through the gingerbread swamps of Molgaga! Cruise through the intestines of the Midgaard Serpent! Fight giant poultry!\nCo-op story brawler for 1-4 players\nSingle-player and online/offline multiplayer\nWritten by Zach Weinersmith (SMBC Comics)\n+25 levels in 8 different worlds. Plus 5 Versus Arenas!\nChoose among four different Zombie Vikings, each with unique power moves\nOver 40 unlockable weapons. Try out Stinknir or Blunt Fish Trauma!\nCollect Viking Runes to gain new cool abilities. Mix up your style of play!\nStitch all your friends together into a giant mega Zombie. Working together is fun!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zoink!","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":341329,"name":"ZACH-LIKE","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd3/cd3d6a28aa19bc39d1f4eef5d82ab86f.jpg","description":"ZACH-LIKE is a book of behind-the-scenes design documents from Zachtronics.\nThe digital version of ZACH-LIKE contains the full contents of the book (in two different PDF layouts), a bunch of terrible games that Zach made before SpaceChem, and some prototypes and early builds of Zachtronics games, both released and... not.\nRead ZACH-LIKE in its entirety, either in tablet-friendly portrait mode or widescreen-friendly \"simulated book\" mode!\nExperiment with omnivators, liquids, robots, and more in an early build of Infinifactory with hideous placeholder art!\nPlay an early version of Opus Magnum where arms stack recursively, and the weird solitaire tactics minigame that was cut from it.\nExplore the lost undersea world of Project Typhoon, the submarine-based sandbox game we stopped making a few months into development.\nGrab three friends and four keyboards and conquer the network in Hack the Planet, a game Zach made specifically for a party at his house.\nEnjoy* the entire back catalogue of pre-SpaceChem Zachtronics games, from Gregor Mendel's Pro Botanist to the infamous Infiniminer.*Any enjoyment other than ironic is not guaranteed.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Zachtronics","platforms":[{"id":0,"name":"PC"}]},{"id":59304,"name":"King and Assassins: The Board Game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/987/9871f9d97302149c3fb21c757b20ecca.jpg","description":"THE TYRANT KING IS PUSHING THROUGH THE MOB! IT'S TIME TO PROTECT HIM... OR END HIS REIGN. CHOOSE YOUR SIDE IN A MERCILESS DUEL!\nThe people are angry... danger abounds. Three assassins are planning to murder the monarch! Get ready for a fight – the hunt is on!\nKing & Assassins is a simple game in which deception and tension are paramount.\nOne player takes the role of the the tyrant King and his soldiers. His objective is to push through the mob of angry citizens who have overrun the board and get back to safety behind his castle walls.\nBefore the game, the player controlling the assassins secretly chooses three of the twelve citizens occupying the board. These three will become the would-be assassins!\nIn every turn, each of the two sides have a certain amount of Action Points at their disposal for the King, his guard and his citizens.\nUse the soldiers and their ability to push back the mob as best as you can because assassins lurk among them!\nAction, deception, daring coups – King & Assassins has all of this and more to offer the boldest players with the courage to fight this incredible duel!\nFEATURES\n• Graphically detailed environment with characters in 3D\n• Play in single-player mode against the computer, square off against your friends in Pass & Play mode or against players from all over the world in Online Duel mode\n• 2 game boards available for a different experience: explore the Market or walk down the mysterious Alley of Shadows!\nTo find more information about Asmodee Digital, please go to http://www.asmodee-digital.com\nHaving an issue? Looking for support? Please contact us: https://asmodee.helpshift.com/a/king-and-assassins\nYou can follow us on Facebook, Twitter, Instagram and You Tube!\nFacebook: https://www.facebook.com/asmodeedigital/\nTwitter: https://twitter.com/asmodeedigital\nInstagram: https://www.instagram.com/asmodeedigital/\nYou Tube: https://www.youtube.com/asmodeedigital","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Asmodee Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":41510,"name":"Lone Survivor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2aa/2aa83eaeec66c9b291f407b3a6e0ee77.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Superflat Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":18696,"name":"Safecracker: The Ultimate Puzzle Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/578/5789c3f47a85ea018ccee2050b929465.jpg","description":"As an expert safecracker, you are hired by the wealthy family of a recently deceased to search his mansion for his last will and testament. Duncan W. Adams was an avid safe collector and an 'eccentric,' to say the least. Adams has hidden the deed to his vast fortunes in one of 35 safes. You must crack them all using hints scattered throughout his extravagant mansion. The stakes are high. Use your expertise, wits, and puzzle solving skills to earn your paycheck!\nA challenging puzzle adventure game with 35 unique safes to crack.\nMany creative, clever, and truly unique puzzles.\nDecipher unexpected clues inside each safe that will help you open the others, ultimately leading you to the master safe.\nMultiple difficulty levels to challenge all types of puzzle enthusiasts.\nExplore a magnificent mansion with 30 lavish, intriguing, and precisely-detailed rooms.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Kheops Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":18548,"name":"Environmental Station Alpha","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/843/84398d9ed078347dd17264a44d529446.jpg","description":"Environmental Station Alpha is an action adventure platformer with a retro aesthetic and heavy emphasis on exploration. In the game the player controls a robot sent to investigate a mysterious, abandoned space station with the mission to find out what exactly took place there. Overrun by wildlife the station is immensely dangerous to explore, and on top of that earthquakes have made navigating the various areas very challenging. Over the course of the game the player must uncover secrets, fight loads of bosses and amass powerups in order to really figure out the fate of the space station. The game also features a wonderful ambient soundtrack to immerse the player into the gameplay.\nThe game's musics were made by Roope 'Noby' Mäkinen ( http://noby.untergrund.net/ )\nThe SFX were made by Joonas 'Kissa3' Turner ( http://twitter.com/kissakolme ) and Niilo Takalainen\nNOTE: The Mac version doesn't have gamepad or Steam Cloud support.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Arvi Teikari","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15715,"name":"Blast Em!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/094/094d05f7ad1b1c2ed024121ed92d3044.jpg","description":"Protect the universe from the evil Alien robots terror-bent on eliminating the Earth and all of Humanity! Take control of the ship and blast the hell out of anything that moves and if it doesn’t move – blast it anyway to be sure.\nCollect coins to get points and use those points to get power-ups.  Choose wisely, the wrong power-up at the wrong time is the difference between a high-score and having to press ‘Play’ again. You were warned!\nKey featuresEvil Alien Robots terror-bent on destroying you and everyone else.\nSemi-procedural game generation. Never play exactly the same game twice.\nSuper hard gameplay.\nSuper addictive gameplay.\nGreat training in mastering your blink reflex.\nSource code available to buy so you can see how it was made.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Xiotex Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4742,"name":"Parasite Eve","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/efa/efaf491f4f237cf82307b60540de58a8.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nOne of them is a police officer. The other is possessed by an ancient evil threatening all life on Earth. The horrifying bond between them will continue until one of them dies.\nJoin NYPD rookie Aya Brea as she tracks down the biological entity known as Eve. Upgrade your weapons and hidden mitochondrial powers to save the city.\nDownload this PS one® Classic today!\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 553 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\n© 1997, 1998 Square Enix Co., Ltd. All Rights Reserved.\nParasite Eve, SQUARE ENIX, and the SQUARE ENIX logo are registered trademarks of Square Enix Holdings Co., Ltd.\nBased on the novel: Hideaki Sena \"parasite EVE\" (Kadokawa Horror Bunko).\nCharacter designed by Tetsuya Nomura.\n\"PS one\" is a registered trademark of Sony Computer Entertainment Inc.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and this item’s use restrictions. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\n\"PS one\", \"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":2061,"name":"Riptide GP2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/473/4736315fa58be917b609d8c947407db7.jpeg","description":"Rev up your rocket-powered hydro jet and put your racing skills to the test as you rip across a dynamic, ever-changing torrent of waves in Riptide GP™2.\nRace through futuristic cityscapes, twisting canals and rivers, open harbors and mysterious research facilities.  Hurl yourself off sky-high jumps and bust out death defying stunts.  Build a collection of powerful watercraft and customize their performance and paint schemes to suit your individual style.  Take your skills online to battle other players around the world -- or trade elbows with friends in split-screen matches right in your home!\nFeaturing dynamic racing on fully interactive water surfaces, a deep career mode with tons of upgrades, customizable riders and skills, online and local multiplayer, and fully integrated controller support, Riptide GP2 is the standard in modern water racing games.\nFrom Vector Unit, developers of Hydro Thunder Hurricane on Xbox 360 and Windows 8.FeaturesSingle Player Career Mode\nCompete in over 60 challenging Race, Hot Lap, Elimination, and Freestyle events.\nUpgrade Your Watercraft\nCollect 10 powerful hydro jets and upgrade their performance and colors to gain an edge on your competition.\nThrilling Stunt System\nLevel up your character to unlock and master 25 outrageous stunts. Wow the crowd, charge your boost and make your competition eat wake.\nOnline Multiplayer\nPit your skills against the world's best in fierce online battles.\nSplit Screen Multiplayer\nTrade elbows with your friends in 2 player, 3 player, and 4 player split screen races.\nVR Challenge\nRace against virtual recordings of your Steam Friends' best performances in \"VR Challenge\" mode.\nFull Controller Integration\nPlay in Big Picture mode.  Seamlessly switch between keyboard and gamepad without having to tweak settings.\nOnline Sync & Backup\nKeep your game synced to the cloud and continue your game across computers with your Steam ID.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Vector Unit","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":830039,"name":"Lost in Play","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/465/465d819b711ed1251bdaed0759ef185e.jpg","description":"Help a brother and sister on an uplifting epic adventure to find their way home. Escaping a horned beast and meeting quirky goblins are just part of the journey!\n\n\n\nLost in Play is a journey through childhood imagination with thoughtfully crafted puzzles and colorful characters. Play as a brother and sister duo on an adventure to find their way back home. Between reality and fantasy, the siblings explore the enchanted forest of a horned beast, start a rebellion in a goblin village, and help a team of frogs free a sword from a stone.\n\nPUZZLES & MYSTERY\nThe bizarre and dreamlike world of Lost in Play is filled with mystery, unique puzzles, and mini-games. Challenge a pirate seagull to a game of clicking crabs, serve magical tea to a royal toad, and collect pieces to build a flying machine. Be a part of this modern point & click game that will reward your curiosity and leave you excited for the next piece of story.\n\nIMAGINATION COMES TO LIFE\nFrom what seems like a normal morning at home to a typical afternoon at the park, you'll soon find yourself on a whirlwind quest as you sneak into a goblin castle, explore ancient ruins, and soar atop a giant stork. Lost in Play takes you on a nostalgic roller-coaster!\n\nAN INTERACTIVE CARTOON\nWith a hand-crafted style similar to animated shows from childhood, Lost in Play is a story meant for all. Whether you’re seeking wholesome delight or just a good time, the family can enjoy this story together.\n\nGAME FEATURES:\n\nA mysterious animated puzzle adventure.\nFilled with magical and magnificent creatures.\nCreated with families in mind. Have your children watch you play!\nNo dialogue. Everything is communicated visually in a universal way.\nInspired by nostalgic TV shows such as Gravity Falls, Hilda, and Over the Garden Wall.\nPlay cards with goblins, build a dragon, and teach a sheep how to fly.\nIncludes 30+ unique puzzles and mini-games.\nCatch a derpy chicken. Maybe.\n\nHappy Juice Games previously worked on \"The Office Quest\" and is a studio that focuses on pushing the boundaries of animated adventure games. We hope you love our game as much as we loved making it.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Happy Juice Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":650646,"name":"NBA 2K22","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1c/a1cf8e234ea9dc6218682e3eab56e418.jpg","description":"NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Visual Concepts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":457730,"name":"Sniper: Ghost Warrior Contracts 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a54/a549f520260d95fd755786786efe43b2.jpg","description":"Sniper Ghost Warrior Contracts 2 marks the most challenging entry to the acclaimed series yet, introducing extreme long-range sniping with targets over 1000m away. Featuring a dramatic single-player campaign set in modern day Middle East, experience high-pressure tactical combat, deep inside enemy territory.\n\nTake on the role of Raven, Contract Sniper Assassin, as he embarks on a new series of contracts in a lawless region of the Middle East, located along the Lebanese and Syrian borders. Tasked with a seemingly impossible task, your mission is to topple an insidious criminal syndicate and bring them to justice.\n\n\nSeries veterans are in for a challenge, as Sniper Ghost Warrior Contracts 2 demands a new level of skill, focus, and precision, with many targets now over a 1000m away - a first for the series.\n\n\nDeveloped by the same studio behind the original game, Contracts 2 pushes new boundaries with its hyper-realistic sniping experience; master a wide arsenal of weaponry based on realistic military equipment; explore vast terrains with an enhanced level of detail; and confront the series’ most lifelike enemies to date.\n\n\nEquipped with all-new equipment, each highly replayable contract can be completed in a variety of ways. Replay the mission with a different approach to complete all objectives, ready to spend your earnings on improved gadgets and weaponry.\n\n\nContracts 2 introduces new levels of fidelity, with optimized visuals, improved FPS, and an enhanced game engine, resulting in the best looking entry to the series yet. Pull off ultra realistic stealth kills, captured in viscerally graphic detail thanks to the cinematic bullet cam.\nFEATURES:\nEliminate a wide array of targets, using a mixture of close-quarter combat, and extreme long-range sniping as a contract assassin\nEmploy tactical decisions and stealth techniques to overcome a variety of challenges across the dramatic single-player campaign\nExplore 5 distinct, extensive maps set in the Middle East conflict zone\nExecute 21 new contracts, in addition to completing a range of side operations\nMaster an expert sniping experience, featuring a wide selection of realistic weapons and equipment\nRevisit each contract with a different approach to complete all objectives and collect maximum rewards\nExperience a new level of fidelity with upgraded visuals and an enhanced game engine","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"CI Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]}]