[{"id":48987,"name":"Between the Stars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/198/1982d277cc6803a7d3623be05a928ca3.jpg","description":"Between the Stars is a roguelike game with action and strategy elements that puts you in the shoes of a stellar cruiser captain. Your mission is to travel to the capital to warn of the imminent attack of the Children of the Sun, the faction that dominates the outer worlds of the known universe. To carry out your mission you will have to cross the galaxy, face new challenges in each jump, make difficult decisions that will affect your ship, your crew and the world around you, improve your ship's equipment and fight in exciting battles to survive.\nFight in intense space battles.Use the special abilities of your ship at the right time to make a difference on the battlefield.Recruit other ships to join you on your adventure.\nUnlock new ships through achievements. Each ship has its own style and special abilities that makes it unique.Choose your captain in each game. The captain brings his fighting style and unique bonuses to the ship, but keep in mind that death is permanent and if he dies in the game you will not be able to choose it again and a new captain will replace it.Captains have an unique look and attributes combination.\nSectors, star maps, enemies and space stations are procedurally generated. None game will be like the previous one! Travel to the capital of the Republic and prevent the army of The Children of the Sun catch you.\nEquip your ship and upgrade your equipment during the course of the adventure.Recruit new crew to replace the casualties and make the right decisions to increase their level more quickly and keep your crew safe.Search among the remains of other ships to get resources, but beware, resource extraction operations are dangerous! Hundreds of different events will test your ability and your crew. The decisions that you make in each event will condition the evolution of the game and may cause your captain to gain attributes.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Isolated Games","platforms":[{"id":0,"name":"PC"}]},{"id":31542,"name":"Indiana Jones and the Last Crusade: The Graphic Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/101/1015fe740ce5654eb97c9140f6da3c3e.jpg","description":"Indiana Jones and the Last Crusade: The Graphic Adventure is a graphic adventure game, originally released in 1989 (to coincide with the release of the film of the same name), published by Lucasfilm Games (now LucasArts). It was the third game to use the SCUMM engine.","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":27571,"name":"Donkey Kong Country","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6df/6df71f3ff0f6d6bbac306cb9adf935ee.jpg","description":"After a dark and stormy night, Donkey Kong finds all of his bananas \n      stolen by K. Rool and his reptilian crew of Kremlings! Armed with \n      chest-pounding muscle, mighty barrel rolls, and awesome vine-swinging \n      skills, Donkey Kong and Diddy Kong set out to face their adversaries! \n      Play solo, compete with a friend, or play cooperatively with a friend in \n      over 100 levels filled with collectibles and hidden bonus levels. With \n      the help of Donkey Kong's quirky family, animal friends, and your fast \n      reflexes, our dynamic duo will prove to be an unstoppable force. Time to \n      save those bananas!\n    This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"SNES"}]},{"id":576497,"name":"Mind Scanners","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f93/f93ee651619bb5b273f1b51528ee872a.jpg","description":"Mind Scanners is a retro-futuristic psychiatry simulation in which you diagnose the citizens of a dystopian metropolis. Locate a host of other-worldly characters and use arcade-style treatment devices to help them. Manage your time and resources to keep The Structure in balance. Remember, you take full responsibility for your patients.\r\nManage your time and resources to aid the citizens of The Structure\r\nDiagnose your patients by analyzing their views of the world\r\nOperate and master a variation of arcade-style devices to treat your patients\r\nSpend your ₭apok and science points to develop new devices\r\nFace difficult moral choices and ethical dilemmas\r\nReport the resistance group Moonrise or join them to help their cause\r\nGain the trust of The Structure if you want to see your daughter again\r\nThe meteor came. And from it, the survivors learned to harness the power source known as Zygnoka. In the next forty years, the megacity known as The Structure was erected inside the impact crater. Here, the people isolated themselves, accelerating their dependence on technology and created a society as a machine of its own.\r\nIn The Structure, order and efficiency is maintained by severe top-down control. In the name of efficiency, new machines and instruments are put to use on the public the instant they are invented. In pursuit of optimisation, a new profession is tasked to maintain the increasingly precarious anomaly levels of the city's inhabitants. These are called Mind Scanners.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"The Outer Zone","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19637,"name":"Obscure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b39/b39e7d26fd64690baea2ec0bbaf15c48.jpg","description":"For some time now, Leafmore High School has been the setting for unexplained disappearances. In this survival horror game, you take control of a group of 5 American students. With your friends, you try to unravel the mysterious happenings at this unremarkable-looking school. The night will be long and survival not will not be easy...\nA few years ago, strange things started occurring in the usually quiet American school of Leafmore. Some students are said to have heard awful screams, and there is talk of mysterious disappearances.\nAfter one of their friends mysteriously disappears, a group of students decide to investigate the disturbing events. One evening after class, they stay behind and are locked inside the school, determined to discover what is going on.\nDown long, dimly-lit corridors and in dark classrooms, Shannon, Kenny, Ashley, Stan and Josh will try to find out why their school has become so terrifying - and will try to stay alive.\n- Discover the game that has become a classic in the survival horror game genre.\n- Every student in the group has a special ability.\n- All kinds of weapons can be used: baseball bats, handguns, shotguns, and much more.\n- Solve puzzles.\n- Play alone or with a friend in co-op mode on the same screen.\n- Soundtrack composed by award-winning composer Olivier Derivière.\n- Compatible with the Xbox 360 controller.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Hydravision Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":10526,"name":"Legion TD 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/451/4510219a4f9038ead999610310cb41c3.jpg","description":"On the planet Nova, fantastic creatures of every nature lived in harmony. But a strange sickness gripped the once-verdant paradise, and strife runs rampant. A few proud legions still stand tall, but each dawn brings a new wave of peril.FEATURES4v4 session-based, multiplayer strategy\nMultiple legions (races) and 100+ unique characters\nMatchmaking, ladders, achievements, reconnecting, player profiles, and stat-tracking\nFrequent content and balance updatesOVERVIEWLegion TD 2 is played by two teams of four players on a symmetric playing field. Players defend their own lane against waves of enemy creatures that threaten their team’s king. The team whose king survives longer, wins. From start to finish, a match lasts around 20 minutes.GAMEPLAYLegion TD 2 is like a tower defense, but instead of building towers, players deploy dynamic fighters that come to life. You can't move a fighter after it is placed, so plan your formation carefully. Each round, your fighters battle a new wave of enemy creatures.\nYour fighters move, attack, and cast spells automatically! After each wave of creatures is defeated, your fighters return fully restored to their original formation. You receive gold for completing the round. Spend gold to deploy additional fighters or upgrade existing ones. Each wave of creatures is stronger than the last, so be prepared!\nHire mercenaries to attack the opposing team. Each mercenary you hire permanently increases the gold income you receive at the end of each round.\nProtect your king at all costs. Your fighters are the first line of defense, but if enemies make it past your fighters, they will attack your king. To win, you must defeat the opposing team's king before your own.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"AutoAttack Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20379,"name":"X: Tension","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/073/07349dcc41f4d1f095f26fb873cbf0d5.jpg","description":"X-Tension is the eagerly awaited expansion pack to X: Beyond the Frontier. The expansion is not limited by a linear plot line but makes use of new ways to expand your empire. You can now take part in missions that are offered to you throughout the game.\nFeatures\t\t\t\t\tMore Ships - You are no longer limited to one ship, but can now buy and pilot all fighters and small transports in the game. As well as capturing new Pirate ships.\nExpanded Universe - The universe has also been expanded with over 40 new sectors to visit, trade and fight inside, allowing you to find new locations to build new stations and trade in new goods.\nThe Version 2 Update - The release of the 2.0 upgrade expanded the game even further allowing you to pilot the larger TL class freighter.\nContinue your quest to explore the universe, trade in over 90 sectors, with over 50 goods, upgrade your ship with dozens of wares available to you by 5 unique alien races and protect yourself from the hostile Xenon.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Egosoft","platforms":[{"id":0,"name":"PC"}]},{"id":14018,"name":"The First Templar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3d/d3d6d4b5c46da432e73345f3fc0a6e2b.jpg","description":"The First Templar follows the story of two main characters – a French Templar, and his companion, a noble lady who has been proclaimed a heretic. Taking control over these two unlikely allies, the player must uncover the mysteries behind the Templar Order, play a role in a grand conspiracy, and discover the secret of the Holy Grail. The heroes face powerful opponents at every turn, including Sacracen, King Philip the IV of France and the Inquisition.\nThe First Templar features both single player and co-op modes. When playing solo, the player can switch between the two characters, leaving the control of the second hero to the game’s AI. At any moment a second player can join in and take control of the AI-controlled hero.\nKey Features\t\t\t\t\t\tExpansive Historical Game World: Return to the 13th century, where European culture is on the brink of collapse. 20 historically accurate locations from around Europe have been recreated for the player to explore\nOne player - Multiple Roles: Instantly swap between playable characters, focusing on the best skills for the job. Drop in/out cooperative online play allows a friend to help out!\nFast Paced Action-Based Play: Unlock furious combos to unleash upon waves of challenging opponents\nRPG-inspired Character Development: Each character has unique abilities and skill trees, which players develop as they explore the game world\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":1091,"name":"Guild of Dungeoneering","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccf/ccf34a116ebff82c41cbe60aaf24a5df.jpeg","description":"Become the ultimate Dungeon Master as you bribe, entice and coax your heroes through their adventures on a quest to restore your guild to its ultimate glory!\r\n\r\nGuild of Dungeoneering is a turn-based dungeon crawler with a twist: instead of controlling the hero you build the dungeon around him. Using cards drawn from your Guild decks, you lay down rooms, monsters, traps and of course loot! Meanwhile your hero is making his own decisions on where to go and what to fight. But will he be strong enough to take on the dungeon's overlord? In between dungeon runs you manage your Guild, building new rooms to attract new classes of adventurer and to expand your decks of cards with more powerful items and events.\r\n\r\nFeatures\r\n•\tRestore your guild to its former glory as Dungeon Master by taking control of your fledgling group of heroes and leading them to victory! (after admitting to a few defeats of course)\r\n\r\n•\tEntice, coax and bribe your heroes to clear the dungeons you build by strategically placing rooms, monsters and loot from the cards you are dealt  \r\n\r\n•\tGet to know each of your hero’s personality and traits, upgrade your existing heroes, and add new heroes while you try out new strategies to keep from sending them to their doom!\r\n\r\n•\tManage your guild well and spend your hard earned ‘glory’ wisely to level up and unlock more rooms and equipment. Improving your guild means you’ll have a better chance at beating the harder dungeons as you progress and take down the ultimate dungeon overlord.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Versus Evil","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":370204,"name":"If Found...","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ba/1ba281ea404d16ddef6cbe30f4c5028d.jpg","description":"If Found… is an interactive visual novel from Dreamfeel about searching for connection.\nAchill Island, December 31st 1993. In the crumbling ruin of an old mansion, a young Irish woman named Kasio destroys her diary. It tells the story of her return home to Achill, her conflict with her family, the friendships she makes, and the challenges she faces. And somewhere within its pages is an explanation for the looming black hole that's about to destroy the Earth.\nThrough unique gameplay mechanics, erase anything and everything. Experience a compelling and intense story about family, community, isolation and identity.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Annapurna Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":316910,"name":"Tools Up!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f0/1f0427f263cbd049c49cb3711a4898d8.jpg","description":"Imagine you and your friends renovating a house - busy work right? Well you can test them out in this hasty and fun co-op game! Tools Up! lets you gather up to four players on your couch and paint walls, tear off wallpapers and move uh… couches against the clock! So be sure not to get in the way!\nThe inhabitants of a mysterious skyscraper left their homes in your hands. All that is left is a blueprint of how the house should look when they come back. Cooperate (or don’t - we don’t judge) with your friends to make their dreams a reality!\nTear down walls, put down tiles and throw everything you need to one another across the apartments, hoping to not make it more messy than it was before. Its so easy you wont be able to mess it up! Or is it... ? Bored with the campaign? We have Party Mode that lets you choose the level you want to master. Be the home improvement you always wanted to see. Be Tools Up Co.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"The Knights of Unity","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":53456,"name":"Oddworld: Munch's Oddysee (2001)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/202/202d74b99a0c0148ff0b3e024e6fd243.jpg","description":"Oddworld: Munch's Oddysee is a 2001 video game, released for the Xbox. It is the third game made by Oddworld Inhabitants. It is the second chapter of the Oddworld Quintology, following Abe's Oddysee, and the third overall Oddworld game.\nOriginally announced as a title in development for PlayStation 2, it was instead released exclusively as one of the launch titles for Xbox. While an \"Oddboxx\" containing the first four Oddworld games was originally intended for a holiday season 2009 release on Steam, the fourth game in the series was not released until December 20, 2010 on Steam, over two years after the first three.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Oddworld Inhabitants","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":44839,"name":"Nowhere Prophet","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d9/0d915d82842d514c621c4ca91135f52b.jpg","description":"Nowhere Prophet is a roguelike deck-building game set in a post-apocalyptic future.\nTake on the role of a powerful leader and mystic. Empowered with the gifts of technopathy, the ability to sense and affect eletrical currents.\nYou are the last hope to a band of outcastes and refugees. Lead them across the randomly generated wastelands. Pick fights with greedy slavers and crazy machines using the turn-based card combat. But always spend your resources carefully. Can you survive long enough to reach the mysterious Crypt?\nThese features make Nowhere Prophet stand outCard-based tactical combat system\nRandomly generated maps and events\nTwo decks to build: Followers and Leader!\nUnlock new content across multiple playthroughs\nStunning and confident art style\nA fresh non-western post-apocalyptic world\nIndian infused electronica soundtrack\nA roguelike deck-building gameNowhere Prophet is a single player card game with procedurally generated maps, a high difficulty and permadeath. At it's heart are two distinct parts of gameplay: Travel and combat.\nTRAVEL\nDuring travel you navigate across a procedurally generated map. Make sure your convoy has enough resources to travel as you pick your route. On your journey you will encounter strange places and even stranger people. You will be thrust into situations that put the fate of your followers in your hands.\nIf you're lucky enough to gain some rewards, maybe for helping someone - or robbing them, then you can invest those to improve your decks. Recruit more followers to have more and different units to put into battle. Equip your prophet or level up and learn new skills to have access to stronger action cards in combat.\nCOMBAT\nYou will have to overcome some enemies to keep your convoy and resources together. And sometimes you may even want to pick a fight for righteousness or just for loot. Once in battle the game changes to the turn-based card game mode.\nPlay convoy cards to put your followers onto the field and position them so you can overcome your enemy. Or play action cards to dramatically change the battlefield. But be careful: If you're wounded you will have to find a safe place to heal. And if one of your followers takes too many wounds, they are lost forever.\nA science-fiction post-apocalypseNowhere Prophet is set on a far off planet called Soma. Your story begins many years after the Crash, a complete technological collapse. Civilization has broken down and the lack of resources made everyone turn either bandit or madman.\nIn this world inspired by Indian culture you lead a convoy of outcastes. These desperate men and woman following your vision of a better future. Under your guidance they travel with you through the wastelands. Your goal is the Crypt, a mystical place that promises untainted technology and safety.\nIf you can survive long enough to find it.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sharkbomb Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":16453,"name":"Sniper Elite: Nazi Zombie Army","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/513/51304be386e26997e7f7d0ba24b08326.jpg","description":"** Please note: a remastered and improved edition of this game is now available in Zombie Army Trilogy.**\r\nFeaturing a co-op campaign for 1 to 4 players, Nazi Zombie Army is a horrifying new stand-alone expansion of the award-winning Sniper Elite series.\r\nIn the dying flames of World War II, a despairing Hitler unleashes one final, unholy gamble – a legion of undead super soldiers that threatens to overwhelm the whole of Europe.\r\nYou are Karl Fairburne – the sniper who shaped world history. You are one of the last living souls in Germany. You must team up or die.\r\nAmerican, German, Russian – previous military allegiances no longer matter. Now it's just the living versus the dead.\r\nOnly a Sniper Elite with nerves of steel and a steady aim stands a chance against Hitler’s Nazi Zombie Army!Key FeaturesA Heart-stopping New Campaign\r\nBattle through blood-drenched levels in a Berlin overrun by Hitler’s supernatural forces.\r\nAdapt to harrowing new enemies – occult commanders, roof-jumping snipers, undead suicide infantry and worse...\r\nTest your sniping skills under extreme pressure, keep your cool, and keep a boomstick handy – just in case.Share the Terror With Four Player Co-op\r\nFor the first time in Sniper Elite history, battle your way through a campaign built for up to four players.\r\nFight back-to-back with a German officer, a scientist and a Russian soldier.\r\nWork together or face annihilation – plan your positions, set your traps and make your stand.New Enemies. Same Award-winning Sniping\r\nSee every putrid lung burst, every rotten bone shatter with the return of Sniper Elite's acclaimed X-Ray ‘kill cam’.\r\nExperience the genre-best sniping ballistics and precise controls that made the series a best-seller.\r\nTake into account gravity, wind, velocity, stability and more under the pressure of the zombie onslaught. You don't want to miss.NOTE: Steam keys will not activate in Germany","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Rebellion","platforms":[{"id":0,"name":"PC"}]},{"id":11946,"name":"Remnants of Naezith","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c14/c1457bcf823ca4b4d25abeb6c12e2fcd.jpg","description":"Feel the acceleration in this fast-paced grappling hook platformer, Remnants of Naezith.\nIt focuses on having freedom of movement, solid character control and not having any speed limitations. The fun of swinging with grappling hooks and the amazing feel of acceleration makes a great combination in this game.\nYou play as Kayra, a human who shares his body with the soul of the ancient thunder dragon, Naezith! With the powers granted to him by the dragon, Kayra will destroy the Remnants of Naezith, enchanted fragments of the dragon's body, to prevent anyone from exploiting their power for evil.\nLEVEL SELECTION\nProceed through four chapters with 20 branching levels in each.\nSECRET LEVELS\nFind the hidden remnants to unlock secret levels.\nLEADERBOARD\nWatch top player replays and improve your skills to ascend.\nGLOBAL RANKINGS\nGet a badge depending on your overall performance and compete worldwide.\nGHOSTS\nRace against other people's best times or your own.\nSPEEDRUN MODE\nTry going through the entire game or a specific chapter as fast as possible.\nCUSTOM LEVELS\nExplore the countless levels made by the community and design your own.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tolga Ay","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4468,"name":"Jak 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a2/2a25bac7804b7192e2ca4b6a57bc8b66.jpg","description":"Jak and his faithful companion Daxter are thrust in the middle of an unforgiving Wasteland where survival of the fittest takes on new meaning. With potent weapons, armor, and vehicles, Jak also discovers that there is an emerging power inside him - the ability to balance Dark Jak and Light Jak. Questions about the mysterious Precursors, the mythical Mar, the fate of the world and the enigmatic Jak himself will be answered, as this most exciting adventure unfolds.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":384557,"name":"Metal Unit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fc/1fc7cafb3e1a3e00724a30e2cb0f5370.jpg","description":"Metal Unit tells a tragic story of human survivors and their battle against monsters and machines to regain their planet.\nThe Earth has been invaded by ancient monsters emerging from underground and alien machines descending from space. Play as Joanna, a new soldier capable of wearing the M-Unit suit. She journeys to save humanity from its invadors and to take revenge on her sister that has allied with the alien cult.\nKey Features:Action Battle System – Players can dash to evade enemies and chain multiple weapon attacks to perform combos. They will develop their own combat style through the use of melee, ranged, sub weapons and more.\nOutside World and Dungeons – Players can choose to explore locations on the surface of the planet or delve inside mysterious dungeons. Traveling around the world will progress the story, while going underground offers bigger rewards at the cost of facing difficult enemies and puzzles.\nTragic Story – The characters in Metal Unit will suffer through corruption, betrayal and death. Players can impact the story by making choices during key dialogues and performing certain actions during the game.\nElements of a Roguelite – Upon death the game will convert all equipped items into permanent research points. This resource can be used to unlock new items and skills. Players will constantly receive weapons of varying utility and need to adapt their strategy to match their current equipment.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"JellySnow Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":299569,"name":"ScourgeBringer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e14/e140f042238c52917ed09d1f58581f78.jpg","description":"Join the community\nScourgeBringer has its own space within our Discord server, join us!\nAbout the GameScourgeBringer is a fast-paced free-moving roguelite platformer. Help Kyhra to explore the unknown and to slash her way through the ancient machines guarding the seal of her past, and maybe the redemption of humanity.\n\nGet the raw feel of a metroidvania through a fast paced rogue-lite\nSlash and shoot your way smoothly with fluid platforming controls\nSharpen your skills with a frantic combat system focused only on attacking\nDash forward with other-worldly adaptive music\nDefy a dozen giant bosses holding the secrets of the Scourge\nExplore the infinite depths of an ever changing dungeon\nUncover mysteries and alternative routes to find mementos of previous explorers\nScourgeBringer is being made with the help of the community!\nYou can follow its development through our weekly newsletter, or join our Discord and maybe get in the alpha test.\nJoining the alpha test will unlock extra rewards within the full game when it will be out on Steam.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Plug In Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":17790,"name":"A Fistful of Gun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3d/e3d4438558614bef9b2c470c6dbf0042.jpg","description":"When the evil railroad baron Clayton Boon decided to build a track to Hell, he didn’t reckon on a crazed shaman raising a posse of embittered psychopaths from the dead to stop him. Now they’ll pursue him across the whole Wild West, fighting their way through hordes of bandits, bears, braves and boogeymen just to find Boon and repay their debt with… A FISTFUL OF GUN!\nSelect one of eleven unique playable gunslingers and seek revenge as a lone wolf or with your friends in local and online co-op. Master the specialized controls of each character, collect gold from fallen foes to purchase upgrades, and imbibe a bit of liquid courage and unleash a tornado of lead across the dusty plains.Features\nMisfits and Outlaws: Choose between eleven different gunslingers each with their own unique control scheme and methods of attack to master. Some characters require the finesse of a gamepad while others are strictly bound to mouse controls to mount their offensive.\nMultiplayer and Co-Op Modes: Gather a posse of gunslingers for chaotic local multiplayer or connect online cooperative modes or square off with other gunslingers at the corral in the white-knuckled versus mode.\nStory and Arcade Modes: Take up arms against those that stand opposed and blast your way through the colorful landscapes of the west against dozens of unique enemies. Grab a horse, forge a river, ride a train – there’s never a dull moment in the lawless lands of the Wild West!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FarmerGnome","platforms":[{"id":0,"name":"PC"}]},{"id":573119,"name":"Severed Steel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6fe/6feb9d26e5581bb52d44b64d903158ad.jpg","description":"Severed Steel is a single-player FPS featuring a fluid stunt system, destructible voxel environments, loads of bullet time, and a unique one-armed protagonist. It's you, your trigger finger, and a steel-toed boot against a superstructure full of bad guys. Chain together wall runs, dives, flips, and slides to take every last enemy down.\nA unique fighter\n\n\nPlay as Steel, a nimble, one-armed sharpshooter on a mission. There is no reloading – pick your shots well and be ready to pry a loaded weapon from your enemies' cold dead hands.\nStylish combat\n\n\nDodge bullets, leap off walls, slide kick, throw weapons – do whatever it takes to come out on top in intense and frenzied firefights.\nFully destructible environment\n\n\nPepper through plaster with sharp 4.7 mm rounds, punch through thick concrete with .50 cal slugs, or make big holes in things with your arm cannon.\nDynamic AI\n\nNo two battles are the same thanks to dynamic, unscripted, squad-based AI.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Greylock Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":61725,"name":"Ball laB","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9c/c9c6523c181ed6c13040d67397c628d3.jpg","description":"Ball laB is a hardcore platformer with minimalist graphics.\nIn the role of the ball you must overcome more than 60 challenging levels.\nCan you do it?Features:\n60 levels\nDifficult gameplay","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Viktor Yurchuk","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":61515,"name":"Due Process","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbd/bbd414b1fa91e64670664b7f609dadf7.jpg","description":"Due Process is a tactical FPS about planning and teamwork that rewards communication with teammates, allows players to draw a \"playbook\" directly onto the map during the planning phases, and presents a novel situation each play session thanks to a bounty of procedurally generated, hand-curated maps.\nPlay As A Bonded Unit\nIn Due Process, the only road to victory is teamwork. Each match begins with a planning session, providing teams an opportunity to gear up, discuss strategy over voice-chat and formalize tactics by drawing directly onto the map - like a playbook. Once the round begins, combat is quick and energetic - with one team on offense and the rival team defending a structure with multiple entry points.\nFresh Scenarios Each Match\nDue Process introduces an evolution of the FPS scenario. Maps are procedurally generated, then expertly curated by the development team for maximum fun - resulting in a novel situation within each match, whether the outcome is victory or defeat. Due Process balances the playing field by making it more about outsmarting your opponent than memorizing a map, eliminating the inherent unfairness of “map knowledge.” With visuals inspired by 90s arcade light gun games like Time Crisis, Due Process uniquely marries neon-retro aesthetics and modern gameplay innovations.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Giant Enemy Crab","platforms":[{"id":0,"name":"PC"}]},{"id":59314,"name":"Anno 1800","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/065/0650c381e12c28053e1c98779d996305.jpg","description":"Anno 1800 is the seventh installment of its franchise of real-time economic strategies. Like its predecessors, it is based around building cities.\n\n###Setting\nUnlike the previous two installments of the series, which were set in the future, Anno 1800 returns to the series' roots and is based on real history. The game is set in the 19th century and explores the first twenty years of Industrial Revolution era. The industrialization and rising capitalism greatly influence the gameplay. The game features units like trains and cannons and takes into account such factors as workers' strikes and environmental pollution.\n\n###Gameplay\nAnno series gameplay is a lot like if Civilization was in real time. In Anno 1800, the player controls an island country and administers its economy, military, diplomacy, and society. He or she discovers new technologies, explores the map, builds cities, factories, and farms, makes allies, and fights enemies. The game reintroduces randomly generated maps and physical trading goods that can be shipped by the routes. Unlike in the previous game, the combat is fully integrated into the gameplay and is not separated from the city building sessions. The game also features new elements such as tourism.\n\n###Modes\nThere are three main modes in Anno 1800: a sandbox mode, a campaign with a plot, and a multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"}]},{"id":28024,"name":"Splatoon 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24b/24b68f500fd138c3146d8856f0dd55b4.jpg","description":"For the first time, take Turf War battles on-the-go with the Nintendo\nSwitch™ system, and use any of the console's portable play styles for\nintense local multiplayer* action. Even team up for new 4-player co-op\nfun in Salmon Run!\n\nTwo years have passed since the original Splatoon™ game was released,\nand two years have also passed in Inkopolis! So expect a fresh wave of\nfashion, not to mention new weapons and gear. Dual wield the new Splat\nDualies or stick to mainstays like chargers and rollers, which have been\nremixed with new strategic possibilities. As always, Turf War is the\nfavored sport among Inklings, but they also dig ranked battles, taking\ndown Octarians in a robust single-player campaign, and battling enemy\nSalmonids in one dangerous part-time job! No matter which way you play,\nsplat at home or on-the-go with Nintendo Switch. Staying fresh never\nfelt so good.\n\nTurf War - Team up in fierce 4-on-4 multiplayer battles* to see\nwhich team can cover the most turf with ink\n\nSalmon Run – 2-4 players* can team up for co-op fun and defeat\nwaves of enemy Salmonids.\n\nNew weapons – Dual wield the new Splat Dualies and avoid\ngetting splatted with the new Dodge Roll move. Mainstays like the\nSplat Roller and Splat Charger have been remixed to include new\ngameplay mechanics, and all special weapons are brand-new.\n\nLocal and Online Multiplayer - In a first for the series,\ncompete in local multiplayer Turf War battles*, whether in TV mode or\non-the-go in handheld or tabletop modes. Online battles also make a\nreturn**\n\nNew ways to play – Play with the Joy-Con™ controllers or the\nNintendo Switch™ Pro Controller (sold separately), both of which\nsupport motion controls for better aiming\n\nFresh Updates - Similar to the Splatoon™ game for the Wii U™\nconsole, updates will roll out post-launch, adding new content and\nin-game events.\n\nSmart Device Support** - An upcoming smart-device application\nfor the Nintendo Switch system will allow players to set play\nappointments with friends and teammates, as well as voice chat with\nfriends during play sessions.\n\nLAN Play - Up to 10 docked systems – eight players and two\nspectators – can connect via wired LAN (additional accessories\nrequired; sold separately). This feature allows players to create\nlocal Private Battle tournaments without the need for an internet\nconnection. Local wireless play is perfect for your regular gaming\nget-togethers, but LAN Play is where it's at when you want to organize\na serious tournament.\n\nCustomize – Change your Inkling's style with different weapons,\nheadgear, clothes, and shoes. Gear isn't just aesthetic; it offers\ndifferent boosts in battles.\n\namiibo - Compatible with all Splatoon™ series amiibo™ figures.\nBy tapping these amiibo, the figure's character will appear in the\ngame and befriend players. Befriend an amiibo character and they will\nremember favorited weapons, gear, outfits and option settings.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":19672,"name":"Rayman Raving Rabbids","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8d7/8d736cac398f1d2dc3023ca9ddb3a05e.jpg","description":"Hordes of crazed out-of control bunnies have invaded, enslaving Rayman and forcing him to participate in 'gladiator' style trials.  Help Rayman win his freedom back by entertaining and outwitting these fury foes. Use the most hilarious fighting moves imaginable. Run races on animals, fight in the arena, mesmerize the bunnies with your dance moves, throw cows, milk pigs or engage in plunger shooting madness!  The possibilities for fun are endless.\nOver 70+ Trials in Unique Stylized Worlds - Pass trials by entertaining the bunnies and unlock new worlds and many collectables such as costumes, music and items for Rayman's cell.\nLoads of Hysterical Fighting Moves - Run races on animals, fight in the arena, dance or engage in toilet plunger- shooting action!\nParty with friends - Experience frenzied competition with up to 4 players in frantic and quirky multiplayer trials.\nDress to Impress - Go punk, pop, rock or hip hop and use your funky dance moves to entertain the bunnies; keep them moving to your rhythm and collect additional disguises. Become more and more popular and unlock additional items.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Game Boy Advance"}]},{"id":10057,"name":"Order of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5e3/5e3e7f513ca7b9ac47aea37e5be17e5f.jpg","description":"October 22, 2009 - Update\nWargaming.net has released free Downloadable Content for Order of War. The DLC will download automatically the next time you launch the game. This DLC contains all the formerly exclusive pre-order items which include:\nHeavy Bomber Squadrons - Addition of German Arado and Allied B-24 Marauder heavy bomber units to air support\nInfantry Mortar Launchers - Addition of infantry mortar units\nOff-Map Heavy Artillery - Addition of heavy artillery strikes to the air support menu\nSurvival Mission Mode - New survival mission mode where you fend off waves of attacking enemies for as long as possible\n\nAbout Order of War\t\t\t\t\tIn the summer of 1944, the Second World War entered its end-game when the Allies launched two major operations that would drive back German forces on both the Western and Eastern Fronts at once.\nTheir names were Overlord and Bagration.  Overlord famously commenced with the D-Day landings in Normandy and ended in the Liberation of Paris, while Bagration - a far less well-known but far larger Russian operation - crushed the invading German forces in the east, leading to their complete withdrawal from Soviet territory.  Had either operation been unsuccessful, history could have been very different.\nIn the ultimate test of military strategy, Order of War will challenge you not only to lead America's finest to victory in the west, but also place you in command of the German forces charged with repelling the Red Army's seemingly unstoppable offensive in the east. Even the keenest military minds will find that it's one thing to make history, but quite another to change it.\n...Do you have what it takes to command?\nKey features:\nExperience WWII warfare on an epic, cinematic stage; that truly captures the intensity and scale of the battlefield.\nTake Command of an entire armoured force consisting of up to 1000 soldiers, tank divisions, armoured vehicles, heavy artillery and air force.\nPlayers can choose between two different campaign modes offering completely different storyline, missions, objectives and environments.\nExperience the unique dynamic camera that allows players to command troops over huge geographical scale whilst maintaining movie-like vistas and detail.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Wargaming.net","platforms":[{"id":0,"name":"PC"}]},{"id":7016,"name":"Jack Lumber","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/040/040edf3ba14f361d40d5cec5949c8da5.jpeg","description":"Lumber Jack is an indie game about a crazy lumberjack who hates the trees and tries to destroy all of them. \n\n###Plot\nA tree killed Lumber Jack's granny, and he is furious and desires revenge. The protagonist uses his supernatural powers to massacre the whole forest. The player's aim is not only to destroy the trees but also to solve skill and logic puzzles.\n\n###Gameplay\nThe gameplay is all about cutting up pieces of lumber. The player has to cut them up in a certain way and as fast as possible - thus he can gain enough points. Lumber Jack lives in a rather mysterious and odd world where strange things occur. He can drink Granny's magical syrups to improve his log-chopping powers, collects beards, shelters the forest animals in his cabin after destroying their forest homes - they appear at the end of each level. There is a pun telling beaver which talks to Lumber Jack; other animals make some cute noises. \n\n###Key features\nThe player can unlock Infinitree Mode which requires chopping as many trees as possible. There are also game challenges centered around certain missions; for instance, the player must build up a stockpile of wood, which is used as a store to buy beards, pictures, and buffs (they allow to make mistakes and fix them).","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1081,"name":"Rez Infinite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5d/d5d517e6a0cb5c2722256bf21ad295f8.jpg","description":"One of the most critically-acclaimed games of all time finally comes to PC, and in style: Experience 360 degrees of mind-blowing synesthesia as you blast through waves of enemies and giant transforming bosses, with colors and sounds that sync and blend to the beat of Rez’s legendary techno soundtrack.\nWhether you choose to play in standard desktop mode or opt for the full immersion of playing in VR, Rez Infinite must be seen—and heard—to be believed.\nKEY FEATURES\nThe Ultimate Package\nFully remastered classic Rez levels Areas 1 through 5, and an all-new free-flying experience in Area X.\nHighest Res Rez\nUnrestricted resolution and up to double the texture resolution of any previous version of Rez makes for razor-sharp visuals.\nEnhanced Soundscapes\nFull 3D audio for Rez's incredible music and sound effects.\nVR Optional\nThe entire game is playable on your desktop, or in full VR with your HTC VIVE or Oculus Rift headset and accompanying controllers (standard gamepads, Vive Controllers, and Oculus Remote and Touch controllers are all supported).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Enhance Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":216364,"name":"Battlerite Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6e/c6e56df048001c742220a9d5107e456e.jpg","description":"A Battle Royale Above the RestExperience the battle royale thrill from above in this top-down, skillshot-based Action MOBA game. Select one of several Champions, each with unique abilities and playstyles. Loot for items, prepare for battle, and fight to survive as the Death Vortex closes in. Will you rise above the competition?\nCritically Acclaimed GameplayBattlerite’s lauded gameplay returns in Battlerite Royale! Wield total control of your Champion with precise WASD controls and land skillshots with cursor-based aiming. Keep your cool in the fast and frenetic action and you may come out on top!\nUse Every AdvantageFind wild mystery potions, meteor spells, turrets, bear traps, and much more to aid you in your fight! Are you the type to keep quiet and hide in a barrel disguise, or would you rather charge into battle with your rocket boots?\nMassive MapExplore the beautiful and diverse Talon Island, a location steeped in lore and mystery. Chase critters and experience a map 30x larger than any Battlerite Arena map. Don’t worry, you don’t have to walk from shore to shore - your trusty mount is coming with you!It’s Dangerous To Go Alone!Take on the fight alone or team up with a friend to prove your mettle. If your teammate falls in battle, find a resurrection shrine and leap back into the fray. It ain’t over ‘til it’s over!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Stunlock Studios","platforms":[{"id":0,"name":"PC"}]},{"id":213624,"name":"Horace","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1bb/1bb3911534ae35629978664a1f32c219.jpg","description":"Eccentric British humour blended with a cinematic narrative that has never been seen before in a platform adventure game!\nHorace is a story-driven, platform game peppered with nostalgic, popular culture references which will bring a smile to any gamer who enjoys the 8 and 16 bit era.\nLearn how to master your strongest robot abilities and reunite Horace with his long-lost family. Adventure across the world - and time and space - to save mankind from total destruction. Run and jump your way through a comical but touching story told by the charming robot protagonist and use your wits to overcome classic 2D platforming challenges, all whilst cleaning up the mess left behind from the Robot War! Experience tons of variety along the way with parodies of classic mini games ranging from rhythm action to FPS.\nAdventure through the charming single player narrative.\nLaugh, cry and cheer! Watch this touching story unfold.\nExplore stunning 2D pixel worlds.\nInspired by the ‘golden age’ of UK software development with hidden surprises to be found.\nMeet dozens of weird and wonderful characters.\nBond with every character you meet and find Horace’s family.\nChallenging platforming based puzzles.\nGain new abilities on your adventure and defy the laws of physics to overcome all obstacles.\nDefeat those that stand in your way in tough boss battles.\nHone your skills and take on 12 thrilling and difficult boss battles!\nRevisit arcade classics from the 90s!\nPlay over 10 mini games, each a witty parody of a classic arcade game and become the ultimate video games champion!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sean Scaplehorn","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":49631,"name":"Closers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e88/e88fd85e2b140e612b1ef0356e4729a1.jpg","description":"Closers is an episodic anime action RPG bursting with spectacular battles and steeped in an epic storyline. Choose your Closer, gather your friends or dive in solo, and use your amazing powers to protect Earth, in mankind’s desperate battle against horrific monsters from another dimension!\nEach and every Closer has their own personality and character arc. You’ll face the same foes and overcome the same threats, but through the lens of each character’s unique combat style and flair.\nEach Closer has his or her own combat style, and with thousands of weapons and gear choices, no two Closers will be exactly alike. Customize your gear and develop your skills to suit your own play style!\nThe action in Closers is fast and furious. Jump, dodge, build up combos, unleash special attacks, and beat down legions of dimensional monsters with an ever-increasing menu of combat skills.\nTeam up with friends or take on the alien hordes solo...or go head-to-head in Closers’ challenging PvP arenas!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Naddic Games","platforms":[{"id":0,"name":"PC"}]},{"id":17788,"name":"Sherlock Holmes versus Jack the Ripper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/666/666db1574d99861bcd1dc94dd15edb6b.jpg","description":"Recognized as one of the best licenses in adventure gaming and lauded by the international press, Sherlock Holmes is back with an investigation that is sure to be the most horrifying of the series. In this great new adventure, the famous detective chases against the most threatening serial killer England has ever known - Jack the Ripper.\nIt’s 1888, London, in the Whitechapel area, and a series of grisly crimes in the heart of the East End leave a gory trail of mutilated female bodies. The police struggle to pick up the scent as the bodies pile up and paranoia sweeps the city. Sherlock Holmes immerses himself in the dark, sordid alleyways of Whitechapel in order to follow the trail of the one that the press calls Jack the Ripper. During a terrifying investigation, Holmes will attempt to lift the veil of mystery that shrouds the motives and the face behind that horrific nickname.\nPresented in full 3D, Sherlock Holmes vs. Jack the Ripper offers players 2 different perspectives available at any moment in the game: a third-person view in the pure style of traditional point ’n’ click adventure games and a first-person view for close-up investigation. Players have the total freedom to choose either of the angles they wish or use them both to immerse themselves completely in this terrifying adventure.\nFeatures Solve one of the greatest mysteries in the history of England and discover who is Jack the Ripper!\n2 mythic characters of 19th century England engage in a horrifying manhunt: the illustrious Sherlock Holmes and the terrifying Jack the Ripper.\nDiscover the hidden side of London and the sinister streets of Whitechapel, all faithfully recreated (e.g. public work house, hospitals, brothels, etc).\nSwitch between playing the role of the famous detective Sherlock Holmes or his trusted friend Doctor Watson.\nInteract with more than 30 authentic characters that help you complete your investigation.\nUse and combine more that 100 objects and collect hundreds of clues so you can finally uncover the real identity and motives of the perverted Jack the Ripper.\n2 points-of-view available at all times: gameplay in third-person or classic first-person point-of-view, a favorite for the enthusiasts of the series.\nA progressive help system puts you back on track whenever you need assistance.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":12908,"name":"TrackMania² Stadium","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc7/cc70444aaa4ba22b2a1f832bf68abd97.jpg","description":"TrackMania² Stadium is the return of the popular Stadium environment enjoyed by millions of players with TrackMania Nations Forever. Now part of the ManiaPlanet environment, Stadium allows for improved services around the game, better graphics and a powerful track editor.\nTrackMania² Stadium is a whacky, crazy and fast paced take on the racer genre. Stadium’s pure gameplay ensures it is easy to pick up and learn, yet the depth has made it an eSports favourite for years, bringing both creative and competitive gamers together in the mix.Key FeaturesA thrilling racing experience: Jump into your car and enjoy high-speed races with super-responsive cars where only your skills as a driver make the difference!\nExtensive solo campaign: Race through over 65 unique tracks in the solo campaign, gather medals and compare your times with players from all over the world.\nEasy to Learn, Hard to Master: Thanks to a pure and focused gameplay, TrackMania² Stadium is very easy to get into, but you’ll have to rely on all your skills to reach the top.\nExperience the Legend: Enjoyed by millions of racers all over the world, the Stadium environment is back, bigger and better, with even more possibilities!\nUnlimited creative possibilities: ManiaPlanet provides all the tools to easily create and share with the TrackMania community. Whether you like to make videos, create your own tracks, car skins, or create a full-blown custom game mode, you’ll find everything you need here\nCompetition for everyone: Trackmania Stadium has been an eSports favorite for many years, and is now coming back even stronger thanks to new Team and Competition management tools, embedded livestream capabilities and much more!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nadeo","platforms":[{"id":0,"name":"PC"}]},{"id":7190,"name":"Mysterium: The Board Game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a73/a7362b567065a463164ba854fbed9aef.jpeg","description":"The official adaptation of the famous board game Mysterium!\n*** IMore: \"If you've played Mysterium, and like it, then this is a no-brainer. Get the game!\" ***\n*** Boardgamequest: \"A solid digital translation of a great cooperative game. Bringing a social game to the digital world is never easy, but Mysterium does an admirable job at it\".***\nMysterium is a cooperative deduction game set in the 1920s in which a ghost guides a group of psychics to uncover a murderer, as well as the weapon and location of the murder, using only visual clues. Choose  your favorite way to play: take on the role of the ghost who gives others clues, or as one of the psychics trying to interpret \"Vision Cards\".\nIn this mobile version, you will find:\n• A faithful adaptation of the original game with gorgeous graphics\n• A game variant with or without clairvoyancy\n• Additional cases and dream cards from expansions in the in-game shop\n• A story mode to discover the background of each psychic\n• Solo play with AI partners\n• Multiplayer support up to 7 players using online (cross-platform: tablet / mobile / computer)\n• Worldwide Leaderboards\nLanguages available: English, French, Italian, German, Spanish.\n-----------------------\nCurrently not supported devices (512Mb RAM or less)\n- iPhone 4\n- iPhone 4S\n- iPad Mini 1\n- iPad 2\n- iPod\n-----------------------\nYou can follow us on Facebook, Twitter, Instagram and You Tube!\nFacebook: https://www.facebook.com/asmodeedigital/\nTwitter: https://twitter.com/asmodeedigital\nInstagram: https://www.instagram.com/asmodeedigital/\nYou Tube: https://www.youtube.com/asmodeedigital","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":4307,"name":"RIDGE RACER Unbounded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbc/bbcb99369022020f42e2006e454133bb.jpg","description":"The latest title in the RIDGE RACER franchise, RIDGE RACER Unbounded gears up to carve its own destructive path with a new breed of arcade racing.\nRIDGE RACER Unbounded brings an unexpected dimension to the series, delivering an original blast of ferocious racing adrenaline. Join the Unbounded street racing gang, lead by Kara Shindo, and test your driving skills against rivals in every street and alley of Shatter Bay. Prove your worth, get respect and expand your turf. Key FeaturesCrash through everything - Cutting edge physics and effects combine to bring direct destruction like you’ve never seen before. Unleash your rage to obliterate everything in your way and carve your own path.\nRace in urban environments - Shatter Bay lives by its own rules and is ripe for being torn apart by the overpowered vehicles rampaging through its many areas, including the commercial zone, refinery, port, and high-rise construction site.\nNew breed of racing machines - Traditional racing machines are out and dozens of badass street machines are in, including the legendary RIDGE RACER Angel and Devil cars.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":20964,"name":"Hyper Fighters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40d/40d820b3dd2b88a919eae1f5f0cdd1e6.jpg","description":"Hyper Fighters brings back the rail shooter as you know it from the arcade: fast, explosive, addictive, and easy to learn: but so hard to beat the number one highscore!\nFourteen trigger-happy arcade-fun stages are now available for one or two players: Shoot dozens, hundreds, or even thousands of enemies out of the sky and water with three ultra modern fighters. This will require triggerhappy fingers and supersonic reflexes!\nFace immense, massive and simply incredible endbosses that are each capable of destroying an entire nation by themselves. Do you have what it takes to destroy them all?\nIt won’t be easy!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team 6 Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2222,"name":"Song of the Deep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4f/c4ff8e9330d00c0da3a64984cc71a827.jpg","description":"Song of the Deep is a metroidvania-style action-adventure game following a girl’s quest into the unknown to find her missing father. Combining discovery, skill, and suspense with an unforgettable narrative, this underwater journey will challenge players to explore, experiment, and skillfully navigate a vast ocean landscape.\nGameplay\nSong of the Deep delivers unique gameplay in a tale of love, heartbreak, and triumph. Explore a fantastic non-linear interactive underwater world filled with more than 200 treasures to collect. Equip your submarine with 30 upgrades and 15-plus abilities to access new areas of the sea, and combine those abilities in surprising ways -- like catching a torpedo with your claw arm mechanism. Outwit, outmaneuver and battle creatures along the way, from lantern jellies to giant bosses like The Watcher.\nStoryline\nMerryn waits all night for her father to return from his fishing voyage. He never does. After a vivid dream showing her father trapped under the sea, Merryn is determined to save him. This unlikely heroine builds a small submarine from spare parts and sets off to rescue him. Along the way, she’ll make friends, discover lost civilizations and ruins, and upgrade her submarine to explore even deeper. The terrain and monsters of the deep are daunting, but Merryn’s courage, intelligence, and love for her father will help her overcome adversity.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Insomniac Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":349870,"name":"初恋日记","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/603/60342a2fd503b8f6006f3b0cd4bfd2a6.jpg","description":"School Years is a series of visual novel adapted from real stories. It is divided into three stages: high school, University and social work to tell a common and tortuous life trajectory.\nHere is the first chapter of the series.In this chapter you will experience the life of a high school student in China. The protagonist lives and studies under the background of examination-oriented education in senior high schools in China with the expectation of the future and the expectation of ignorance of emotions. During his junior year, he has experienced many things which deeply impressed on him. This part of the story is more a pave for the development of the following chapters, but also plays a role of \"appetizer\" and is very exciting. Welcome to experience, thank you.^^","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"YEARS","platforms":[{"id":0,"name":"PC"}]},{"id":51854,"name":"Wildermyth","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/103/10353ba4b9cdc6b67fed15f478f27640.jpg","description":"The Yondering Lands are wild, filled with beauty and magic, but also rife with threats that lurk and muster. Meet your heroes before they are anyone, and grow them into a roster of legends who shape the course of their own Yondering, and the worlds that come after. Forge new stories in Wildermyth where any tale has the chance to live forever.\nBring Your Adventuring Shoes\nExplore the wilderness, claim mysterious sites, and fight back against an oppressive enemy.\nThrive in tactical turn-based combat with deep and surprising advancement opportunities.\nInvest in the stories of heroes through dialogue-rich events, relationships, and personal quests.\nFrom Longshot to Legend\nMeet dynamic characters, all generated with life histories and personalities.\nGuide these heroes as they enjoy triumph and love, or as they endure rivalry and loss.\nPreserve the memory of your favorite heroes to live on as legends, and join your story again.\nUnique as a Thing That's Just Very Unique\nTake advantage of procedurally generated maps, characters, and challenges, to tell memorable stories.\nChoose to let defeated characters die in a deed of epic heroism, or live to fight on.\nEvolve your plans and strategies as unpredictable moments alter your world.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Worldwalker Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15958,"name":"The Last Tinker: City of Colors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eec/eec8b0bf355ae57837f409d49143662d.jpg","description":"Upcoming indie superstars Mimimi Productions present The Last Tinker: City of Colors.\nA joyous action adventure lovingly crafted in the image of all time classics such as Zelda, Jak and Daxter and Banjo Kazooie, The Last Tinker is a colorful journey through Colortown, a world built upon creativity, emotion and collaboration.\nA dark force named The Bleakness has emerged and seeks to tear the colors apart, draining all joy and life from the world.\nKoru, a young boy from the slums of Colortown, is forced to act. He embarks on an epic and one of a kind adventure to combat the Bleakness and to restore joy and color to his home.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]}]