[{"id":2192,"name":"iBomber Attack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/04c/04c9561c97b1db4a1e04e9c2a9db74f2.jpeg","description":"The legendary iBomber series returns but this time it’s time to ATTACK! Jump into your tank and get ready to blast your way around Europe and defeat the enemy in this visceral tour of destruction! With 24 missions full of explosive action to go at, iBomber Attack is a dose of high-octane entertainment that you won’t be able to put down.\nTOUR OF DESTRUCTION\nFrom destroying Navel dockyards, airfields and secret bases to gunning down legions of flame-throwing soldiers, this is 24 levels of non-stop, high caliber, action.\nAWESOME FIREPOWER\nEarn ‘Victory Points’ and collect gold to power-up your tank with Bombs, Bunker Busters, Mini-Guns, Flame Throwers, Rockets, Airstrike's, Supply Drops & Super Boost's.\niBOMBER LIVES\nDripping with the quality gameplay, visuals and sounds that made the original iBomber games so loved, iBomber Attacks ensures the legend lives on!Key Features:Tanktastic action\nSuper smooth game-play\n24 action packed missions\nAmazingly detailed graphics\nCollect Gold to buy Power-Ups\nWin Victory Points for upgrades\nHuge levels to explore and destroy\nThe satisfaction of blowing everything up!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cobra Mobile","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":836447,"name":"New Tales from the Borderlands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/01d/01dbd8a899ba93b6302a3956c534c550.jpg","description":"Take a stand against ruthless corporate overlords in this narrative-driven adventure! Within the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives. Help these three lovable losers as they endeavor to change the world (and maybe even save it)! Face down a planetary invasion, vicious vault monster, and cold-hearted capitalist in this cinematic thrill ride where what happens next is up to you! Meet a motley cast full of misfits, assassin bots, and talking guns in this race to the top! It's time to fight back against exploitation and corporate greed. It's time to make Mayhem your business.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":292845,"name":"Oninaki","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c77/c77fa12eb1cd2fe1de43072d5b1e124d.jpg","description":"Players assume the role of a Watcher named Kagachi, doing battle by “manifesting” the souls of Daemons, which act as the classes found in traditional roleplaying games. Each Daemon has its own unique weapons and skills, and players can shift between them in real time to gain the upper hand in battle.\r\n\r\nMoving between the Living World and the realm of the dead known as the Beyond, Kagachi must save the souls of the Lost, as the story of life and reincarnation in this wondrous kingdom unfolds.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Tokyo RPG Factory","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":42343,"name":"Ravaged Zombie Apocalypse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/554/55437f3c7f7abdc476acf6a2c59307d6.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2 Dawn Games","platforms":[{"id":0,"name":"PC"}]},{"id":29149,"name":"BLACK","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7fe/7fee01c7f226292be9a27cdc45ee3691.jpg","description":"Join the world’s most brutal and enigmatic strike force. The BLACK™ tactical squad operates under the cloak of complete anonymity and deniability to protect the U.S. from threats foreign and domestic. It answers to no one, allowing it to carry out covert operations around the globe. From manipulating politicians to controlling intelligence networks and militaries, BLACK operatives are trained at the highest level in psychological warfare, espionage, and lethal combat. Go deep into the world of clandestine warfare as you use any means necessary to get the job done.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Criterion Games","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox One"}]},{"id":26468,"name":"Madden NFL 11","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9f/e9fec9933b304cfd718c4c5b391b2b12.jpg","description":"Madden NFL 11 reenergizes the game of football with a fun, exhilarating\nexperience that ignites the passion of any NFL fan. A revamped Franchise\nmode puts you at the helm of your favorite NFL team, giving you the\npower to lead the greatest dynasty of all time in the deepest\nsingle-player experience to date. New players can get up to speed\nquickly utilizing the all-new GameFlow system, where the plays are\ncalled for you until you’re ready to go under center. Lead your team to\nglory with Madden NFL 11, the ultimate NFL experience on Wii.\n\nFeatures\n\n• A Completely Re-Mastered Franchise Mode—Four key components—Campus and\nPerks, Legacy, Assistants, and Scenarios—are the foundation of a\nredefined Franchise mode. With assistant coaches guiding you through\nevery scenario thrown your way, and a passionate fan base hungry for\nchampionships, all eyes are on you in your quest to build one of the\ngreatest legacies in history.\n• All-New GameFlow System—Whether\nyou’re a rookie player or a veteran looking for a casual experience, let\nMadden NFL 11 manage the playbook while you execute the plays to\nperfection. Play without the interruption until you’re ready to take\nover playcalling duties when the game matters most.\n• Weather-Based\nGameplay—The schedule in November and December matters more than ever as\nweather affects gameplay like never before. Playing on a wet or icy\nfield, or in the mud or snow, players slip, slide, and struggle to\nmaintain footing based on four types of inclement conditions.\n• A\nDeeper Madden NFL Experience—Players can now take the field wearing\nauthentic practice uniforms, including red QB jerseys in 5-on-5 and\nPractice modes, or suit up with long sleeves and pants when playing\ncold-weather games. Revamped stadiums and updated gameday uniforms\ncomplete the authentic package.\n• Crash the NFL Party—Crown a king of\nthe couch in the four-player party mode featuring custom gameplay tweaks\nand an interactive pick ‘em system, or use the Wii Remote to pick up\nblocks, trip up wide receivers, and create clear paths to the end zone,\nall while your teammate runs the plays.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":22096,"name":"ASTA Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77f/77f284a7e08eaf3659390a32a897c1e5.jpg","description":"ASTA Online DSCORD Open! https://discord.gg/tPf6xZs\nAmong mysterious mythologies and legends stands ASTA. Based on an immeasurably massive fantasy world, ASTA will allow its players to immerse themselves into the vast world of mythical adventures and wars. With superb graphics and a diversity of fresh contents, you will experience the thrills of a new MMORPG that was never precedented.\nAbout this game\nASTA is a free-to-play MMORPG developed using CryEngine3. ASTA provides players thrilling experiences polished with realistic and vivid, yet oriental graphics. In the world of ASTA exists two opposing realms, “Asu” and \"Ora\", and a war between these two awaits.ASTA proudly introducesRichness of contents and worldviews\nOutstanding quality compared to recent Massively Multiplayer Online Role-playing Games\nUnited dungeon matching system and an auction house open to all servers\nUnique concept of graphics and differentiated development techniquesUnique graphics concept and differentiated techniquesA painting animated Graphics\nHarmony of light and color, Dreamy and fantasy background\nHigh technology of CryEngine3\nPlayers have many options to enjoy the ASTA world\nASTA has a stat allocation system; users can decide what stats they want to invest in. Players are entitled to various choices in this game. With an infinite amount of options in character customizations - from the body shape to the length of eyebrows, players are able to create and train their very own characters.\nThere are also numerous kinds of races and jobs in place and each of them has their own storylines/questlines and cinematics.\nPrepare yourself for an epic adventure to save the mythical land of \"Samsara\" from the wrath of an evil god in ASTA!\nAbout Two Realms\nASU\nAsu is one of the realms in Samsara, the world created by three Primacies(three absolute gods). It is the realm inherent with wheel of life and Nirvana as Arita, the goddess exiled from the Heaven had revived\nORA\nORA is another realm in Samsara. It is the world of the dead created when Heuk the god of death was banished to Samsara from the Heaven. When the body and soul of Arita who had reached Nirvana were separated, ORA suddenly revealed in Samsara.Game Features\nReal-time combat system\nOwn housing system\nDetailed character customization\nStat allocation/investment system\nTwo warring factions\nOption to join a realm (Asu & Hwangcheon)\nMassive boss raid\nReal-time PVP battle system\nPVP, RVR systems\nParty, guild, trade, auction systems\nPets and rides\nRealistic Martial arts","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"POLYGON GAMES","platforms":[{"id":0,"name":"PC"}]},{"id":20401,"name":"Tap Tap Legions - Epic battles within 5 seconds!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c6/4c628679ac97750a7250330a6909b891.jpg","description":"Devils destroyed the royal Wedding and taken our queen away. Fortunately, our king fled quickly...\nWell, Knights, soldiers, and even farmers are ready to go! Our king needs his queen tonight!\n• Easy to play! Tap tiles to summon soldiers. Explosive fun!\n• Truly epic battles, fierce engagements!\n• Choose your army for battle! How strategic can you be?\n• 12 kinds of soldier. Upgrade and fight with any combination of soldier you want!\n• 8 cards make things better ...or worse. Don't tap the wrong tiles!\n• 5 special items to help keep you alive!\n• 64 levels to battle through, New ones coming soon! You will love it!\n• Variety of challenging monsters at every stage, INTENSE BOSS LEVELS!!\n.....\nYou think you have the time to sit through this introduction?\nOur queen can't wait! See you on the battlefield!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"YFC games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20153,"name":"Badland Bandits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/166/1665794173faa9ba14146c4c973af049.jpg","description":"Early Beta AccessWith Badland Bandits - Premium you will get:\nPremium Account for 1 month\n5000 Gold\nUnique premium Skin \"Beta\" for Aspid\nUnique premium Skin \"Beta\" for Cerberus\nUnique premium Skin \"Beta\" for Harpy\nUnique premium Skin \"Beta\" for Kondor\nBadland Bandits - Ultimate includes:\nPremium Account for 3 months\n10000 Gold\nUnique premium Skin \"Beta\" for Aspid\nUnique premium Skin \"Beta\" for Cerberus\nUnique premium Skin \"Beta\" for Harpy\nUnique premium Skin \"Beta\" for Kondor\nUnique premium Skin \"Beta\" for Pyranha (tricycle)\nUnique premium Skin \"Beta\" for Mammoth (tank)\nUnique premium combat vehicle BUFFALO! *Early Access is the only opportunity to get this vehicle.\n\"Buffalo\" In Ultimate pack ONLY!\nAspid Beta - In Base Pack\nCerberus Beta - In Premium Pack\nCondor Beta - In Premium Pack\nHarpy Beta - In Premium Pack\nPiranha Beta - In Ultimate Pack\nMammoth Beta - In Ultimate Pack\nSteam GreenlightBadland Bandits got Greenlight!\nAbout the GameIt’s the first time developers have taken a risk to combine magical fantasy style and pragmatic steampunk. Players try the role of merciless warriors who destroy enemies using armored wheeled monsters. Each machine is a result of ingenious military engineering. In addition to tens of weapon and armor types all the machines are equipped with exclusive bonus modules.\nBattles full of adrenaline take place on earth and in the air, under the blinding sun and in bitter frost. Interactive maps and well-detailed physics considering landscapes and peculiarities of all mechanisms supplement rich gameplay.\n*For Mac-players : if you have an issue with the game (black screen) - please turn off Steam overlay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wild Wolf","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19072,"name":"NAM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a3/8a3b877f0e6f4bf2fe306f6a38cd10a0.jpg","description":"You are Alan 'The Bear' Westmoreland, Marine Corps sergeant. The trouble starts on a deadly Viet Cong raid. Here the jungle is your battleground.\nYour mission, survive.\nNAM captures all of intensity and paranoia of jungle warfare. Fire-fights, ambushes, booby-traps, snipers, air-strikes, anti-personnel mines AND MORE.\nFeel the tropical heat and the fear of tunnel skirmishes, paddy killing fields, swamps and thick jungles.\nNAM is the first game of its kind. NAM IS WAR!\nExperience the intense action and real ambience of the Vietnam war.\nDevastating air strikes, mines and ambushes.\n34 single and multiplayer, gut-wrenching levels.\nEmploy true-to-war tactics to survive.\nIncredible 8-player multiplay: 8 Gruntmatch, 6 Capture-the-flag and 5 Fireteam levels.\nTrue US military standard issue weapons and equipment; M60 Machine Gun, M79 Grenade Launcher, M16 Rifles, Flame-throwers, C4 Plastic Explosives, Mine detectors and much more...","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"TNT Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18573,"name":"Metaverse Construction Kit","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/948/948cc086dec4564d0216c60468004298.jpg","description":"The Metaverse Construction Kit is a virtual environment to construct your own 3D creations. Build anything you can think of using the twenty-four structural elements, and the soon to be released mechanical and technical elements. Make your creations in any style with sixty-four material types like organics, metals, minerals, and composites. And when you're done, publish them to the workshop for others to build upon or from, and for players in the parent Metaverse universe to incorporate into their planetary settlements.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Metaware","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17285,"name":"Robot Squad Simulator 2017","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/878/878e0e373a3701847051ba943f65aab3.jpg","description":"Become an elite pilot of special Robot Squad.\nUse specialized, remotely controlled robots, which you will control yourself.\nDeal with the hardest missions which can't be performed directly by people due to the conditions.\nHuman life and safety is in your hands!\nGame features:\n- 4 different robots: 2 terrestrial, aerial and underwater\n- 6 training missions\n- 16 story missions which take place all over the world, in different settings\n- 10 different accessories mounted on robots\n- plenty of gameplay elements like: guards, explosives, mechanisms\n- upgrading parameters of robots and accessories\n- different types of missions: rescue, spy, exploration, military\nCHECK OUT UPDATES AND NEWS:\nwww.facebook.com/PlayWayGames\nwww.twitter.com/Play_Way\nwww.playway.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bit Golem","platforms":[{"id":0,"name":"PC"}]},{"id":13417,"name":"Mr.President!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aae/aaecb1200151adb83f13b0abfb4fae5e.jpg","description":"Mr.President! Can you take a bullet for the soon to be President of the United States of America?! You play as Dick “Rock-Hard” Johnson a bulletproof man, the best bodyguard money can buy. He is sworn to protect the most hated presidential candidate of all time Ronald Rump.\nLiberal media has rigged the election and tarnished his glowing public image, now they are trying to end his life. You need to leap, flip, fling, roll, and many other verbs to get in between Rump and certain death. If Rump dies, Who is going to pay for your Netflix sub? How are you going to pay for your lifetime of student loans or over inflated medical bills? Where will you get the money for another dumb physics game? YOU BETTER SAVE THE MAN OR YOU DON'T GET THE MONEY! It is your American duty to protect, serve, and live by the mighty dollar, because money is the only true sign of someone’s worth.\nRock hard body destruction - Not only can you bounce bullets off of your body but you can destroy structures with just flinging yourself into them!\nOver 50 Assassination Attempts! - You need to overcome 50 challenging assassination attempts from a unworldly threat.\n\nGlobe Trotting Adventure - Follow Rump during his presidential campaign and visit many different locations around the world.\nPro Rasslin Challenges - Can you drop an elbow or headbutt on the presidential candidate?\nA portion of the proceeds will go to charity…. Because there are some people out there who don’t want to watch the world burn.\n-@GameDeveloper_X","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Game Developer X","platforms":[{"id":0,"name":"PC"}]},{"id":10780,"name":"Big Bang Empire","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f71/f718f5e430e5de3a121272efce953480.jpg","description":"The world is full of adventure, just not in your little hometown Tellville. A career in the erotic showbiz is obviously the best way out of there. So sign up for ridiculously funny missions and conquer the blue movie Olympus! Big Bang Empire casts a humorous glance at one of mankind’s favorite pastimes and the business that surrounds it. Create your individual adult movie star, improve your skills, collect sexy items, team up with fellow stars in a studio and show everybody else who's boss! (But don't show it to your boss)\nFeatures:  Humorous comic style\nIndividual character creation\nFunny missions\nPvP against other stars\nGvG against other studios\nSexy outfits and accessoires","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playata","platforms":[{"id":0,"name":"PC"}]},{"id":10733,"name":"Hard Room","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e9/5e9db23d1632dc5da56e92d89b65fb7d.jpg","description":"You are an artificial self-developing intelligence programmed by unknown scientist for the show \"Hard Room\". The greatest minds of the world create robots which have to pass through three dynamically changing locations. And you are the one of these robots. Glorify your creator and prove that you are the best.\nNew vision of a hardcore. Games have never been so cruel to players before. Are you brave enough to experience it ?\nThen move on, 45 levels of hell and remember, every mistake is very expensive","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Evgeny Shcherbakov","platforms":[{"id":0,"name":"PC"}]},{"id":9714,"name":"PULSAR: Lost Colony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b8/4b85c918f6cacdc6853023a8c895ad28.jpg","description":"Team up to operate an advanced starship and explore a randomized galaxy falling into chaos. Each player assumes a role aboard the ship: Captain, Pilot, Scientist, Weapons Specialist and Engineer. Coordination between your crewmembers will be essential in order to survive the perils that await you.\nControl the various stations that run your ship. Reroute power between ship systems, scan alien planets for lifeforms, run powerful programs to change the tide of battle, or start up the warp drive to escape a conflict you cannot win. The strategies you use are up to you—or your Captain.\nEmbark on missions, investigate abandoned stations, and scavenge for components that could aid you in your voyage. Teleport down to the surfaces of alien planets, where you may face extreme environments and dangerous creatures. Trek across the galaxy, and discover what lies on its fringes.\n\nPULSAR: Lost Colony is our attempt to create a fully cooperative space-faring experience, because it’s one of the games we've always wanted to play.Current Features Online drop-in / drop-out multiplayer\nCommand and control an advanced starship\nFive unique classes; everyone plays a role on the ship\nFast-paced and tactical ship-to-ship space combat\nTeleport to other ships, planets or stations to join the away team\nLoot planets and stations for valuable items\nBoard enemy ships to capture them or destroy systems\nAI crew bots\nResearch and Sample Collection\nGamepad support (work in progress)\nShip-To-Ship hailing (diplomacy, trade, intimidation)\nCustomizable AI priority system to enable custom crew bot behavior\nOculus Rift and HTC Vive support (w/ motion controllers)Planned Features The Academy (In game tutorial)\nMeta-multiplayer (daily leaderboards, etc)\nAI crew bot improvements (with advanced specialties for classes and enemies)\nOffline LAN support\nA healthy amount of polish and love to the systems we already have\nOptimization improvements\nChallenge modes\nMore languages\nA large amount of content to explore and interact withFAQIs there an in-game tutorial?\nNot at this time. We are planning on integrating one in the future, however we want to make sure most of the ship systems are finalized before building it. If you want to learn about how to play and use the various ship systems, you can click here to view the manual!Can I stream and/or monetize game footage?\nYes! This is our written permission to do so.Simulation or Game?\nWe like using the term simulation because it helps convey the fact that each starship is a large collection of systems and mechanics working together and reacting to its environment. However, this is a game first and foremost. Because of that, we aren't afraid to go outside the realms of reality if it makes the experience more enjoyable. This is not a 100% realistic simulation, it's a game with simulated elements.Player versus player modes?\nPULSAR was designed from the ground up to be cooperative in nature. None of the mechanics are prepared to handle the specific challenges of PvP combat. We believe that this focus on pure cooperation will enable us to create an experience that is unique and feasible by our small team.Singleplayer?\nWe are focusing on a multiplayer experience at this time. We do offer AI crew bots that can take over unfilled roles, but they are very much a work in progress. The game is very teamwork heavy so the recommended experience is with multiple people. If you looking for a more complete singleplayer experience, you may want to consider waiting until the AI is fully developed.Where can I get more information?\nFor more information, check out these links below:\nClasses\nFactions\nRoadmap\nManual\nForums\nThe game is currently under development. New systems and mechanics are still being added and tweaked, and there is not a large amount of in-game content to see yet.\nIf you prefer to play more complete games and have no desire to be part of the testing / feedback process of a game in development, we highly recommend waiting until the game is more complete before considering a purchase.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Leafy Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":7830,"name":"Dead Man's Draw","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd3/cd3dfcba3aba154985cd423333c65468.jpeg","description":"The critically acclaimed card game is now available on PC! Dead Man’s Draw is a simple and strategic game of luck and skill that boils down strategy gameplay into a single, tense decision: to play it safe or risk everything in pursuit of killer combos and boundless treasure.Key Features Risk vs reward gameplay – Simple and strategic card game puts everything on the line for a single, tense decision\nCreate killer combos – Clever use of each card’s special power is key to victory\nDozens of tournaments – Unique rules add hours of new twists to gameplay\nEighteen game-changing traits – Customize your gameplay with special powers\nBeautiful art without hardware requirements – Enjoy top-tier presentation and intricately detailed graphics without needing an expensive machineHow it WorksPlayers take turns drawing cards in search of the greatest number of points. The simple point values of each card are important, but their special abilities are even more critical. Swords steal cards from your opponent, Mystics reveal the next card, and combining a Chest with a Key leads to a huge bounty of bonus treasure. Clever use of each card’s special power leads to victory, but daring to draw is just as important – though any card could lead to a dramatic bust, it could also propel you to glory.\nTraits and tournaments make every game of Dead Man’s Draw unique. Making your Cannon special ability discard an opponent’s entire suit instead of a single card alters the path to victory for both players. Special tournament rules like collecting the cards from your opponent’s busts force you to approach every turn differently. Dozens of tournaments each bring a unique twist, and each of the 18 traits has a profound effect on gameplay.Upgraded for PCThe original Dead Man’s Draw on iOS was praised by users on iTunes (4.5-star average) and critics alike, getting positive reviews from QuarterToThree.com, 148apps.com, PocketTactics.com, and more. This PC version is better than ever:\nNo microtransactions or in-app purchases – all content is available, and traits can be used without spending gold\nNew Mermaid suit ability – Mermaids now allow you to replay a card in the river, leading to even bigger combos and epic turns\nNew Sirens trait – Steal any card your opponent replays with a Mermaid\nRebuilt for PC – Higher-resolution graphics and a UI specifically built for mouse-driven play","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5501,"name":"Syphon Filter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/063/063d8b138079b6b939d24bab0b23b92f.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® systems!\n\nA terrorist organization steals a top-secret virus known as Syphon Filter, and only special agent Gabe Logan can stop them and keep the world safe.\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PLAYSTATION®Network account that originally purchased the game.  You must have at least 385 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP®system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\nPC Store Customers:\nLog into your PLAYSTATION®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation® Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® (PlayStation®Portable) and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features do not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionality such as multiplayer, versus, and co-op modes are not available.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2006 Sony Computer Entertainment America Inc.\nSyphon Filter is a registered trademark of Sony Computer Entertainment America Inc.\n© 2000 Sony Computer Entertainment America Inc.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":142,"name":"Royal Defense","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/257/2579cd2faf2ff0572b4b663baeb4c513.jpg","description":"The castle needs a hero – hordes of trolls are surrounding it! Build towers, save money, learn spells - don't let the enemy in!\nFollow the exciting story of the dwarven kingdom's eternal struggle against the troll hordes, who want only to crush the dwarves and claim their territory.\nUnique units, a wide range of structures, spells, gold and various resources make this game that you will return to again and again.\nEvery single-screen level sees the player's headquarters assaulted by wave after wave of troll forces.\nTo defeat these monstrous hordes, you must construct defensive towers and units and learn to wield powerful spells. Tap anywhere you like for a handy pop-up menu listing all the units and structures you can build in that location. Tap existing structures to see how you can upgrade your forces with ever-more powerful improvements!\nAll your towers and units have specific stats: Damage, Fire rate, Damage radius, Damage type, as well as various other features, such as enemy slowdown and Damage Over Time.\nEach level also brings new units and structures to help you fight the troll menace. You’ll never be lacking for new and exciting ways of decimating those nasty trolls!\n- 60 different progressively challenging levels\n- 3 unique game settings\n- 17 kinds of creatures\n- 12 kinds of towers and structures\n- Extensive magic system\n- Various upgrades\n- Fascinating gameplay","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"8Floor","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":840781,"name":"Atlas Fallen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/94c/94cc56251973600816cf50fb3323d6c8.jpg","description":"Rise from the dust and liberate mankind from the oppression of corrupted gods.\n\nGlide the sands of a timeless land, filled with ancient dangers, mysteries and fragments of the past. Hunt legendary monsters, using powerful, shape-shifting weapons and devastating sand-powered abilities in spectacular, super-powered combat.\n\nTarget and gather the essence of your enemies to shape your own custom playstyle, forging a new era for humanity in a fully cooperative or solo story campaign.\n\nRise from the dust. Unleash the storm.\n\n• Master the sands to explore a unique fantasy world teeming with secrets, locales and dangers\n• Hunt legendary creatures alone or with a friend in heroic, super-powered combat\n• Unleash your power to create deadly shape-shifting weapons\n• Rise as the ultimate champion with unique custom skills and abilities","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Deck 13","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":564763,"name":"Pokémon Brilliant Diamond, Shining Pearl","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b35/b35a365997998da1d667b4dec99d0253.jpg","description":"The Sinnoh Region of the Pokémon Brilliant Diamond and Pokémon Shining Pearl Games\r\n\r\nExperience the nostalgic story from the Pokémon Diamond™ and Pokémon Pearl™ games in an adventure reborn on the Nintendo Switch™ system.\r\n\r\nAdventures in the Pokémon Brilliant Diamond and Pokémon Shining Pearl games will take place in the Sinnoh region. Rich in nature and with Mount Coronet towering at its heart, Sinnoh is a land of many myths passed down through the ages. You’ll visit many different locations in the Sinnoh region, while striving to become the Champion of the Pokémon League.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"ILCA","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":492294,"name":"Cloud Gardens","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a06/a06acd76e955253c4aae8fe8cad0e138.jpg","description":"In Cloud Gardens players must harness the power of nature to overgrow lo-fi scenes of urban decay and manufactured landscapes. By planting seeds in the right places, they’re able to create small overgrown dioramas of brutalism and beauty, salvaging and repurposing hundreds of discarded objects to create unique structures for nature to reclaim.\nPlayers can dive into a relaxing sandbox mode with no goals, where they are simply left to delight in their own creativity and create beautiful scenes, or take on a “campaign” of six chapters, where the task is to strike a balance between nature and the manufactured by covering each scene with salvaged objects and lush vegetation.\nThis is a chill game where the player is allowed to delight in their own creativity. The player's task is to completely cover the scene in plants. As you overgrow the objects, a meter fills to show your progress. You are given objects to expand the scene. These objects contribute energy to the growing of plants, but you will also have to cover them in foliage to complete the stage, striking a balance between nature and the manufactured.\nWith generative soundscapes by Amos Roddy, composer of the Kingdom Series.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Noio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":376118,"name":"Hentai Girl Fantasy","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89d/89d19f68686b8c2ea9bd642a9a1eb41b.jpg","description":"Hentai Girl Fantasy is a puzzle game, in which all you need is to swop bricks, in order to make the pictures restored.\nBut please remember, this game is aiming to make you relax and enjoy life.\nSo if you cannot get relaxed, you may try “Administrator Mode”.Administrator ModeKeyboard F: Complete LevelGame Featuresartworks100 achievements Relaxing music","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"GirlGame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":331319,"name":"WWE SmackDown! vs. Raw 2007","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/050/0503f3b1d8fb1a6b7896c25dd70da088.jpg","description":"WWE SmackDown vs. Raw 2007 is a professional wrestling video game developed by Yuke's and published by THQ. It is based on the professional wrestling promotion World Wrestling Entertainment (WWE) and is the eighth installment of the WWE SmackDown vs Raw series and is the successor to 2005's WWE SmackDown! vs. Raw 2006 and was succeeded by WWE SmackDown vs. Raw 2008 in 2007. On 31 March 2006, THQ, Yuke's and WWE officially confirmed the game. The game was released worldwide in November 2006 for PlayStation 2 and Xbox 360 and a month later for PlayStation Portable.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Yuke's Co","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"}]},{"id":271414,"name":"Olija","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fc/0fcc689d1c0018846a901914fe4742f4.jpg","description":"Olija is a game about Faraday's quest, a man shipwrecked then trapped in the mysterious country of Terraphage. Armed with a legendary harpoon, he and other castaways try to leave this hostile country to return to their homelands. Through exploration, narration and combat, the player will discover a strange world and its protagonists, including Olija, an enigmatic lady Faraday is bound to. Inspired by the swashbuckler genre and titles such as Another World and the original Prince of Persia games, Olija is a game about facing the unknown in adversity.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Skeleton Crew Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":255293,"name":"SNK 40th ANNIVERSARY COLLECTION","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0d/e0d074836e11b1732f7e3f9b34951bc9.jpg","description":"2018 marks the 40th anniversary of legendary studio SNK! To celebrate\nthis extraordinary milestone, a variety of classic arcade games from\nSNK's golden age are coming back together in one anthology on Nintendo\nSwitch™. SNK 40th ANNIVERSARY COLLECTION is packed full of retro games\nand a treasure trove of features!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NIS America","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":54095,"name":"Teenage Mutant Ninja Turtles (1989)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e6a/e6a509fed4879271d7d7eaba04349d10.jpg","description":"Teenage Mutant Ninja Turtles is a side-scrolling platform game for the Nintendo Entertainment System released by Konami (under the Ultra Games imprint in the USA and the equivalent PALCOM brand in Europe/Australia) in 1989. Alongside the arcade game (also developed by Konami), it was one of the first video games based on the 1987 Teenage Mutant Ninja Turtles animated series, being released after the show's second season.","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"},{"id":0,"name":"Atari ST"},{"id":0,"name":"NES"}]},{"id":45552,"name":"Underworld Ascendant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d85/d85008b968d1038414714a3af9bd7ebf.jpg","description":"Underworld Ascendant is the next-generation  follow-up to Ultima Underworld, the critically acclaimed series credited with creating the ‘Immersive Sim’ genre and influencing such game series as Bioshock, Deus Ex, Dishonored, Elder Scrolls and even Minecraft. OtherSide™ Entertainment, which includes original creators of the  Ultima Underworld series, is innovating upon the series' signature player-authored gameplay in bold new ways.\nReturn to The Stygian Abyss a breathtaking fantasy realm, rife with danger and full of intrigue. Journey through the unfamiliar. Unlock your creative potential. Utilize your environment to stack the odds in your favor. Devise the ideal battle plan or dive in and think on your feet.\nEach decision holds great opportunity and grave consequence. What you leave behind will be engraved on the lives of others. Assuming you survive…\nKEY FEATURES:\nA DEEPLY IMMERSIVE WORLD\nEnter a fully-realized dungeon realm, rendered in expressive detail, where simulated systems make logical sense and creative experimentation is amply rewarded.\nDYNAMIC NARRATIVE\nBecome embroiled in an epic plot, as rival factions vie for dominance in struggles that ebb and flow across the realm. Your choices will alter the outcome in subtle and dramatic ways. Which side will you join? Will you unite or destroy?\nA HERO TO CALL YOUR OWN\nLaunch yourself into fluid, intense combat. Cast powerful magic to defeat the enemy. Use stealth and subterfuge to avoid enemies and obstacles altogether. Freely mix and match across any skills to develop a unique hero, tailored to your style of play.\nUNBOXED GAMEPLAY\nUnlock your creative potential with the Improvisation Engine. Experiment with a wide array of skills and magic. Manipulate your environment – and creatures who reside in it – to stack the odds in your favor. The game sets the challenge, the solution is up to you. Craft your own adventure.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"505 Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":44184,"name":"Spider-Man: Homecoming - Virtual Reality Experience","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/46b/46badb91a6e2440eabbe5f14be9019a7.jpg","description":"For the first time, you can suit up as Spider-Man and see what it’s like to be the world’s favorite superhero.  Learn the ins and outs of your brand new Stark Industries upgraded web shooters and master different web types as you race to complete fast-paced targeting trials – but you’ll have to learn quickly… The Vulture is on the loose and coming for you. Sling high above the city in a dramatic confrontation before pursuing Spidey's deadliest enemy.\nBased on the all-new 2017 film, the Spider-Man Homecoming VR Experience is a fun and thrilling first-person look inside the world of your friendly neighborhood Spider-Man.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"CreateVR","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":42455,"name":"World of Warcraft: Warlords of Draenor","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b3b/b3b509310a178eaad9553a6e60f5bf94.jpg","description":"Garrosh Hellscream escaped justice with the assistance of the bronze dragon Kairozdormu, eventually finding himself in an alternate Draenor in the time before the original Horde had come to Azeroth. Hungry for vengeance, Garrosh provided his father, Grommash Hellscream, with the technology to assemble his ideal army—the conquering force called the Iron Horde. Grommash was quick to unite Draenor's orcish clans under his banner, and the clan leaders became the Iron Horde's warlords. Among them were the bloodthirsty Kargath Bladefist, the cunning Blackhand, the elder shaman Ner'zhul, and the fearless Kilrogg Deadeye. The Iron Horde took command of several vital locations on Draenor, subjugated the ogre city of Highmaul, and built massive fortifications like Blackrock Foundry to outfit the warlords' armies. Once the Iron Horde had Draenor in its grasp, the orcs invaded Azeroth through the Dark Portal, razed Nethergarde Keep, and seized control of Dreadmaul Hold. In retaliation, Khadgar assembled the champions of the Alliance and the Horde, leading them through the portal to stop the Iron Horde on Draenor once and for all. Garrosh ultimately met his end at Thrall's hands, and after an exhausting campaign, the heroes of Azeroth were able to defeat most of the Iron Horde's warlords. Khadgar's offensive dealt a crushing blow to the Iron Horde. Grommash's failure to give his warriors the victory he had promised bred dissent within the ranks, affording the warlock Gul'dan the opportunity to usurp the Iron Horde and summon the demonic Burning Legion to Draenor...","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22563,"name":"Guilty Gear Xrd REV 2","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b24/b24d270347c90921b44297ab6ad17c97.jpg","description":"Get ready to rock again! Guilty Gear Xrd REV 2 includes new fighters, moves, story chapters and more! It’s never been a better time to be a 2.5D brawler in the post apocalypse! Hone your skills with an eclectic cast of 25 insane fighters and prove your mettle as the ultimate fighting master.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Aksys Games","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":21626,"name":"Chernobyl Commando","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d9/1d90d293ea8bfe17d4687562cbc80791.jpg","description":"The terrorists want a war?   Let them have it!\n26 years after a fatal accident in Chernobyl Nuclear Power Plant that covered half of the Europe in clouds of radioactive smoke, a large group of terrorists took over the area, trying to steal all the remaining radioactive waste - and use it.\nUkrainian and Russian forces hit them with all they could, but the enemy was well prepared and the small war raged on.  Two of the best Spec Ops agents move in on their own, hitting the enemy hard before they can escape with the loot.  This is a no-frills, old style, gun-blazing and explosion-roaring attack against multitude of enemies. While sometimes helped by the Army, you are mostly on your own. Hit them hard where it hurts and become a legend for generations to come!Features:Become one of the best soldiers today, facing multitude of opponents  in the battlefield.\nExplore carefully recreated Chernobyl area, and chase your targets to the Middle East - after some of them manage to escape.\nCombat heavily armed enemies powered by sophisticated AI.\nPlay along an AI controlled partner,also helping and being helped by Russian army and US Marines.\nUse 4 different scoped rifles altogether with close combat handguns against your enemies and selected targets.\nLearn to use gravity and wind to your advantage, as the game simulates real-world bullet ballistics.\nAdapt to many challenging tasks as you progress your missions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Silden","platforms":[{"id":0,"name":"PC"}]},{"id":19485,"name":"The Kings' Crusade","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da2/da2a7d34431fe85f6ecfab9e27b5d686.jpg","description":"The crowned heads of Europe launch a new military campaign to re-conquer the Holy Land.  The time has come for you to assemble your armies and take back the land as Richard the Lionheart. Or assume the role of the great Saladin and defend your people against the oncoming invasion.  Lionheart: King’s Crusade gives you the chance to make the dreams of the past a reality.\nThe King’s Crusade is a real-time strategy game that places you in the era of the Third Crusade, spanning the years 1189-1192. Control and upgrade the leaders and their armies, lead your men into fierce battles, complete the objectives of the campaign by guiding various historical factions through political events, collect relics, and unlock new content on your crusade.\nKey features:\nPlay through two single-player campaigns – Crusader and Saracen\nOversee hundreds of soldiers in real-time epic battles\nCommand your forces, conquer territory, and expand your realm on a fully 3D map\nStrategically manage your army between missions\nRewrite the past with famous historical characters serving as the main heroes","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":18151,"name":"Among the Heavens","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb4/cb4e34a676b9a9735b53b9283750eac9.jpg","description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other our strategy games:http://store.steampowered.com/app/411120/\nhttp://store.steampowered.com/app/450190/\nhttp://store.steampowered.com/app/509600\nAbout the GameUp in the sky in a fantasy world, two friends Cid and Markus decided to bring an old tavern back to life in Among the Heavens! Playing as Cid, you will experience fast paced and fun gameplay by serving magical potions, entertaining guests and earning tips in order to add new fancy features to the tavern and build new ones in the future. In this Time Management game you will meet cute and surprising characters, each with their own unique personality, emotions and behavior!\n50 fast-paced levels and 5 different restaurants\nFun 3D animated characters\nAddicting match 3 mini games\nMagical power-ups and fantasy backgrounds","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15569,"name":"SkyTime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f07/f072e56cf3da3dd2b757a121545de94b.jpg","description":"SkyTime - Save your family after a horrible accident.\nSkyTime was publicly chosen to be the number 1 game and has found love from all the people that have played it.\nSkyTime is a 3D platformer in which you slow time, dodge bullets, destroy turrets and overcome obstacles! If you ever played SUPERHOT or Clustertruck, this game combines them both!\nIn SkyTime you are a scientist who lost their family in an avalanche, and are trying to get them back. You create a time machine, but are missing one key component - the reactor core to power it. You steal one from the evil private military company Mortech, and are now being chased.\nCan you outrun them?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sometimes You","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14753,"name":"Taimumari","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/667/6677808b55c05ac8f36c5738bc1f7284.jpg","description":"New DLC Available\nhttp://store.steampowered.com/app/431340\nAbout the GameRetro-style platform game in keeping with the best traditions of games of our childhood! Take control of the Himari, the young female wizard travelling across various ages to settle the balance in time across the whole world!\nFeaturing:\nVarious levels;\nA lot of abilities to learn;\nHardcore action gameplay, which won't leave you bored;\nControl the time and space!\nAll villains are people just like you: learn what's the reason behind them turning into their current state, or just fight them without further ado;\nCharacter leveling system;\nThree difficulty levels;\nSecret stuff and easter eggs;PlotSomewhere in the sky, far away from the ground, another world floats - a fantasy world named Zaria. Citizens of Zaria had to watch the flow of time, but when the ancient crystal fell into the hands of evil, the flow of time was distorted. Kanashimi the High Keeperess sends young wizard Himari to the difficult quest of finding everyone guilty of destroying crystal.\nBut why does not everyone bother about Zaria's origins, and what is this place all about? May you succeed in solving the mystery of this world.\nGo forth to various ages on your uneasy adventure to find the five keepers and to reclaim the power!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"TERNOX","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13070,"name":"Atelier Sophie: The Alchemist of the Mysterious Book","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/45d/45d0d3ba87473bf419389d388f82bb8f.jpg","description":"17th in the Atelier series.\nThe budding alchemist Sophie of Kirchen Bell meets the Mysterious Book, Plachta, and embarks on a wonderful adventure of fulfilling dreams.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gust","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":7950,"name":"Colt Express","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa6/fa611f72dfb9e33272bfc7891a8ac2de.jpeg","description":"The game officially transposed from Colt Express, the famous train robbery boardgame. Plot your scheme step by step and dive into the action to loot the wagons. But watch out, you are not the only Most Wanted Man with the intention to become rich today : you might have to rethink your strategy…\nPlay solo, with friends, family and worldwide in multiplayer!\nHOW TO PLAY:\nAt the beginning of the round, each player will successively plan an action from his action deck, ranging from moving around to luring the train marshal or looting the passengers. When each player’s masterplan is complete, the action starts and the players' set of moves will progressively unfold before you. But getting rich and not getting shot by your opponents are not always compatible objectives, and you might have to rethink your plan on the move…\nFind the right balance between caution and greed to come out as the richest outlaw of the far west!\nPUT YOURSELF IN THE BOOTS OF A FAR WEST LEGEND IN SOLO MODE:\nLive the adventures of 6 outlaws in Story mode through 30 captivating chapters, each with its own plot, set of rules and achievements.\nComplete a bandit's story to unlock new multiplayer modes and comic books about the intricacies of the desperados' life in the Wild West!\nFRIENDLY FIRE IN MULTIPLAYER MODE:\nPlay online with players from all around the world, climb the leaderboard and become the most wanted player feared by every outlaw of the land!\nA TREASURE HUNT IN THE FAR WEST!\nCollect skins for your heroes and environments for your adventures by completing special objectives!\nTo sum up, the game features:\n• A wild west themed universe inspired from the original board game, digitally modernized\n• A tactical and action-packed gameplay, for intense and unpredictable games\n• An extensive Story mode following 6 characters, each with his own objectives and quirks. Available offline and saved the next time you log in.\n• Numerous exciting game variants to unlock in Story mode.\n• An online Multiplayer Mode\n• A worldwide Leaderboard, updated and available in real-time\n• A friendlist, with the possibility to play with your friends\n• Collectible skins and environments to customize your adventures\n• Many Achievements to accomplish, punctuating your exploration of the game\nLanguages available: English, French, German, Italian, Spanish","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Asmodee Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5698,"name":"Transformers: Revenge of the Fallen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba3/ba321ea804560c5331649d249c37386d.jpg","description":"Transformers™: Revenge of the Fallen gets BIGGER with new characters, maps, achievements and Expert mode. Enter battle in single player and multiplayer with 11 new characters from the movie & Generation One series. Three new multiplayer maps take the online battle to new locations. Expert mode makes the single player campaigns more challenging for experienced users – including new leaderboards.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Activision","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":4131,"name":"Heavy Fire: Afghanistan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0f/b0f9299d832a4ec02c6bba1471a6ce39.jpg","description":"FAST, DEADLY AND UNRELENTING COMBAT\nHeavy Fire: Afghanistan is a super fast playing, high intensity on-rails shooter set in modern-day Afghanistan. Whether fighting up close and personal with guns and grenades, raining down fire from a helicopter or laying waste with a main battle tank, Heavy Fire: Afghanistan is an  immediately fun, pickup-and-play experience for hardcore gamers and novices alike.\nEXPERIENCE FAST-PACED ACTION SET IN MODERN-DAY AFGHANISTAN\nYou've battled through some of the most intense combat situations known to man — and it ain't over yet. Afghanistan is teeming with insurgents, and every day brings on new challenges. Today, it's up to you and your men to bring down the enemy. The intelligence reports tell you that enemy forces have been plotting their next move from a shack hidden deep within the forest on a secluded mountainside. You're going to surprise them in their own territory — and you're bringing Heavy Fire.\n\nStay sharp in this blisteringly fast-paced modern day shooter. Protect your team as you move from cover to cover, eliminating threats as they appear! Fight on foot or in a variety of vehicles including tanks, helicopters, and APCs. Utilize weapons ranging from handguns to mounted cannons and grenades to stay alive, keep fighting, and complete your mission.\nFeatures\n24 missions featuring Exclusive Multi-Cover System\nExperience gut-wrenching, fast-paced action set in modern-day Afghanistan\nFight on foot. Fight by tank, assault vehicle, and helicopter\nMore than 60 awards, ranks, and equipment upgrades\nCo-op multiplayer play for up to 4 players on one machine\nHigh quality graphics designed for 1080p\nSteam Cloud, Leaderboards, Achievements & Trading Cards!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Teyon","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]}]