[{"id":19298,"name":"American Conquest","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a1/3a1e0b892dd5b5d479adabae28cd68a6.jpg","description":"American Conquest – Players set sail from Europe to discover new world and conquer its innumerable riches. The game begins in 1492, when Columbus lands in the Caribbean beginning three centuries of war as 12 different tribes and nations battle for survival and conquest. In eight historical campaigns spanning 42 missions you will play the role of great legends such as Pizarro and Washington commanding epic real-time battles containing up to 16000 soldiers on 3D landscapes. Harness new technologies, unique weaponry, improved fighting units, and the delicate world of diplomacy. Play with fire! Conquer America!\nKey features:\n\nEpic real-time strategy with historical background\nCaptivating real-time battles with up to 16,000 units\nCovers the era between 1492 and 1813\n42 versatile missions in 8 thrilling campaigns e.g. Pizarro's Expedition, the War of Tecumseh, the Seven Years War, the American War of Independence\n6 historical battles in multiplayer mode\n9 separate single player missions\n12 different nations and tribes: Spain, England, France, Aztecs, Incas, Mayas, Sioux, Delaware, Huron, Iroquois League, Pueblos, USA\nOver 100 different units and 106 buildings\nTactical formations for infantry, cavalry and artillery using officers, drummers and standard bearers\nRealistic artillery effects, including gunner squadrons transporting and loading canon, as well as detonating canon balls\nFighting morale is influenced by victories, defeats, food supplies, equipment and mercenary pay\nApart from wide range attacks, all shooting units can fight with swords and knives (Cold Steel Attack)\nAll buildings can be attacked, occupied and defended by troops\nFortresses, forts and log cabins provide defensive advantages; units can also be accommodated and trained there\nMap scaling provides an extensive overview of the fighting action through a unique zoom perspective\nHuge maps (30x20 screens, 1024x768 pixels) and fascinating landscapes in four different climatic zones\nDetailed animation of all movements, including loading weapons\nIntricate diplomacy system allows players to build alliances with neutral tribes to trade for warriors and raw materials\nNatural environment can be used strategically: caves as hiding places or ambush starting points, hills extend the shooting range\nMultiplayer mode for up to 7 players via LAN or the Internet: Deathmatch, historical battles, automatic championship system and global rating system, War For America\nDetailed random maps in various sizes and with multiple settings for unlimited gaming fun","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":17891,"name":"Wacky Wheels","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/433/433f759e356dc962b434f48567342d2f.jpg","description":"Play as eight wacky animals in Wacky Wheels. Each animal has its own colorful antics and animations, including a tiger, elephant, raccoon, panda, shark, and more. These animals are incredibly competitive - they hate to lose! They take great joy in bumping, scraping and knocking you off the track. They want you at the back of the pack!\nNothing beats the competitive feel of racing. Feel the thrill as you race past your opponent, slam their car into a water trap, and beat them by a bumper to the finish line. Avoid obstacles, knock opponents, launch weapons, take shortcuts, engage turbo mode, and hit jumps with perfect timing to outrace your opponent every time!Features\nThree Dimensions of Dangerous: High-speed 3D point-of-view racing!\nPig Out: Large variety of race tracks (42 total in the \"Upgrade Edition\")\nDog Eat Dog: Two-player, head-to-head modes via modem connection, serial link or on the same computer.\nRat Race: 60 high score charts - one for each race type.\nLion's Share: Race it out in time trials, standard races, battle zones, and the just-for-fun duck shoot-outs!\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Beavis-Soft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Classic Macintosh"}]},{"id":17629,"name":"Abyss: The Wraiths of Eden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15a/15abbe8e8ff80d7da5a0d6bd93c58be8.jpg","description":"Discover and investigate a forgotten underwater city built in an intriguing Art-Deco style. This former utopia hides many spine-chilling secrets and supernatural forces, the remains of which still lurk in every corner. Face the ancient evil that is hiding in the deepest chambers of the city of Eden.\nDuring your exploration of this Eden beneath this sea, you will solve cleverly designed minigames and find hidden objects or play a special minigame as an alternative. Hold your breath and dive into the game to experience the wonders of the underworld for yourself.\nFeaturesScary and thrilling story in a unique underwater setting\nBeautiful, hand-drawn graphics\nHollywood-quality animations\n40 unique locations with 14 hidden-object scenes\nNumerous original and inventive minigames\nUnique option to switch from a hidden-object scene to a minigame\nIntriguing Art-Deco city design","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":15684,"name":"Radiator 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f4/4f43f55aaf6e6af8023360350cd8c2fe.jpg","description":"A small threesome of experimental games about male sexuality (Hurt Me Plenty, Succulent, and Stick Shift) about punishing, eating, and driving.\nThese small short games attempt to expand eroticism in games beyond a cutscene and fade-to-black. What if sex in games was something we performed as players, instead of something we obtained? What might sex mechanics look like? How can we convey intimacy in games? That's what Radiator 2 tries to explore.\nGRAPHICS: This game certainly has a lot of them\nAVERAGE RUNTIME: 10-45 minutes total, it's up to you\nCONTROLS: Mouse or trackpad, most gamepads supported\nSUBTLETY: Not much\nMORE GAY STUFF BY ROBERT YANG: http://debacle.us/\nHurt Me Plenty: a short game where you spank the heck out of a dude and learn about how BDSM communities formalize consent / caring. Progress through negotiation, play, and aftercare, with your AI-controlled partner. Music by Liz Ryerson.\nSucculent: a short interactive music video game thing where you help a hunk enjoy a delicious shapely treat. It's pretty straightforward, really. (Now featuring new stunning immersive \"cheek physics\" technology!) Music is \"Waste\" by Arca, used with permission.\nStick Shift: an autoerotic night-driving game about pleasuring a gay car. This game is a bit difficult and requires some finesse with timing, but it has a huge video tutorial and cosplay community, just search \"how to drive stick shift\" on YouTube. Music is \"Crybaby\" by Davey and the Chains, used with permission.\n**********\nQ: I've played these games before. What's new?\nA: Hurt Me Plenty has been substantially re-designed. In general though, it's mostly improved shaders and HDR lighting with HD skin effects and hair physics. There's also gamepad support and text localization for several languages.\nQ: How much nudity is in this game?\nA: It is possible to witness some bare butts, and sometimes the characters are in their underwear, but otherwise there is no \"full frontal\" or anything. If this were a movie, it would be rated PG-13.\nQ: Will playing this game turn me gay?\nA: Yes.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Robert Yang","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15589,"name":"Strayed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf4/bf4065d035051cfe0e952bc5c02a06fb.jpg","description":"Strayed is an open-world multiplayer VR survival game focused on player vs player interaction. Explore randomly generated islands, abandoned structures, and the vast wilderness to gather resources for survival. But be aware; There are dozens of other online players with the same goal.Survive\nYou and dozens of other online players all share the same goal: survive by any means necessary.\nYou find yourself stranded on an island with no recollection of how you got there. With no means to escape, you must learn to adapt to your surroundings. With only a rock and a torch at your disposal, you must gather resources to craft tools to improve your chance of surviving. Crafting tools such as hatchets, pickaxes, or primitive weapons will aid you in taking on your surroundings, but be warned, you are not alone.Construct your home\nBuild a place to call home for you and your loot.\nUpgrade your base with new materials you gather while in the wild (Wood, Stone, Metal). Start by placing your core foundation, from there you can expand with floors, walls, doorways and ceilings. Place deployables in your base such as storage boxes, furnaces, or beds to help you store your loot, set a spawn point, or make advancements with your materials.The Islands\nDon’t get too familiar with your surroundings, as everything will regenerate weekly.\nProcedurally generated every Friday, no two islands are the same, meaning you will never play on the same map for longer than one week at a time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Strayed Team","platforms":[{"id":0,"name":"PC"}]},{"id":12177,"name":"Budget Cuts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/647/647eaf122e71515d58c4af589b26219f.jpg","description":"<h3>ABOUT THE GAME</h3><br/>You are an employee at mega conglomerate TransCorp to stamp papers and file files! Unfortunately TransCorp is an expert in the business of manufacturing cost-cutting robots, and soon your job will be in danger. <br/><br/>As another one of your coworkers is being dragged off to the terrifying HR department, a mysterious package arrives at your cubicle. <strong>Will you be able to save your job?</strong><br/><br/><br/>PLEASE NOTE! We would NOT suggest that younger children play this game.<h3>MAIN FEATURES</h3><br/><ul><li>Unleash your inner office spy ninja skills<br/></li><li>Thrilling, oil-splatter filled close quarter combat<br/></li><li>Dexterously zip, sneak or rambo your way forward<br/></li><li>Built for room-scale virtual reality from day one</li></ul><br/><br/><br/>\"‘Budget Cuts’ Showcases an Impressive Grip on What Makes VR Great\"<br/>RoadtoVR<br/><br/>\"Budget Cuts is the future of VR right freakin' now\"<br/>Eurogamer<br/><br/>“It's a rush that I might never have experienced in a game before.”<br/>Polygon<br/><br/>“Budget Cuts reminds me of classic Valve single-player games. That’s a very, very exciting thing.”<br/>Kotaku<br/><br/>“I can’t wait to play more of Budget Cuts, which might be the best, most interesting VR game I’ve played.”<br/>IGN<br/><br/>\"Virtual Reality Sneak ‘Em Up Budget Cuts Looks Ace\"<br/>RPS<br/><br/><br/> Available for Arcades on SpringboardVR","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Neat","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":11524,"name":"Hell Girls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5d/c5de1f5a02e62011658676b770e45d4a.jpg","description":"Show how fast you are. Test your speed and earn points by pressing the keys at the right moment. Unlock new stages and quest.\nPlayer can choose his favorite music, dance and scene and start the party.\nAfter the end, player's performance is scored,\nhow many times it hit the score and how many times not.\nPractice and get as many points as possible.\nCreate your own show in custom mode!!!\nJoin the game and have fun!\nFeatures:\n- Fast dance mode\n- Free fly camera mode\n- Custom mode\n- Different stages\n- Unique music\n- Unique stages\n- Different dance styles","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SakuraGame","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2800,"name":"Rainbow Moon","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ee/1eebae6019401de703e422ebf3b183cb.jpg","description":"The indie role-playing hit Rainbow Moon returns for the PlayStation®Vita system with Cross-Save support and numerous updates!\nExplore a fascinating world and fight nasty creatures in turn-based battles. Visit towns and shop for new equipment and upgrades. Six playable characters await you in an addictive game that lasts more than 40 hours.\n“RPG fans, this one is not to be missed” – Push Square (9/10)\n“...Rainbow Moon is put together fantastically well” – PSXExtreme.com (8.7/10)\n“Rainbow Moon is a lot of fun, and RPG fanatics should play it” – IGN (8/10)\nAdditional features:\n• Complete all optional content to extend game play up to 100 hours and beyond\n• Earn more than 50 trophies, including a prestigious platinum trophy\n• Exchange saved data between your PlayStation®Vita system and PlayStation®3 system\n• Experience a technically perfect game engine that runs at 60 fps with little to no load time\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\nNetwork Features\n340KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\nCopyright © 2012, 2013 Eastasiasoft Limited. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"EastAsiaSoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":742771,"name":"Street Fighter 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ce2/ce2463db40cec363f360c29ddcc56884.jpg","description":"A new era for fighting games begins in 2023!\n\nThe evolution of fighting games starts with our traditional Fighting Ground,\nand then we're turning the genre on its head with World Tour and Battle Hub for a total of three modes where anyone can play to their liking.\nNo one starts off as a champion. You get there step by step, punch by punch.\nTake up the challenge and bring your game to the next level.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":490449,"name":"Escape Room - Der kranke Kollege","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/272/27247c0b97f9dbc8fa70bbf962ec2c1b.jpg","description":"This game simulates a real-world escape room. The player starts in a closed room and has to try to get out as soon as possible. To do so, the player can inspect, combine, and interpret objects to obtain new clues to solve new puzzles. By studying the environment closely, the player will also experience a haunting story...\nfree movement in 3D\nmany objects to inspect\ntricky puzzles\nhint system\na journey into the depths of a well-known friend","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bitbeast Games","platforms":[{"id":0,"name":"PC"}]},{"id":60792,"name":"Coloring Pixels","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a0f/a0f7a487872f894e708d0dcbfe38d5e2.jpg","description":"ObjectiveThe objective is quite simple: each level contains numerous uncolored pixels and it is your job to color them in. Each pixel is numbered; this number corresponds with a color in your palette. Select a color from the palette and paint each of its corresponding pixels. Correctly color all pixels in a level to finish it!\nOver 60 Levels!Coloring Pixels is a great way to wind down, with no obligations and no upfront cost, you can just sit back and relax. With over 60 free levels for you to choose from, you can have hours of fun.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"ToastieLabs","platforms":[{"id":0,"name":"PC"}]},{"id":43930,"name":"House Party","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d92/d92e7eb97e196b4ee48665da0d41f033.jpg","description":"House Party, in its concept and sense of humor, is inspired by the older adventure style games of the 80s and 90s like Leisure Suit Larry and Monkey Island, but it is rendered in a beautiful full-3D first-person context.\r\nYou start the game walking in the door of a House Party already in progress, and your goal is to try to play out to a variety of endings by completing various puzzles and smooth-talking. The game is unique in the sense that your actions dictate the gameplay and story direction heavily. Making certain choices in the game can either cut off or open up more options. You are faced with moral choices that yield different outcomes that drive the way the story unfolds.\r\nIn the game, you'll experience the usual debauchery found at these types of parties in the form of foul language, party games, nudity, fighting, sex, and more, and believe me, it doesn't pull any punches! Each character has their own personality, story and quests for the player. You can enjoy this alongside full immersive 3D gameplay, gorgeous models, and a very sarcastic and dry sense of humor. The AI is very robust, and the characters respond to a large number of stimuli and player choices. There are multiple story-paths and different outcomes based on your decisions.\r\nThe stories are customizable, and Eek! Games offers tools on their website to craft your own story including full dialogues, interactions, and logic dictating how the player's night goes and import it into your game. Users are already creating and sharing stories on the game's forum, and we are excited to see what the player community creates next!\r\nWe are wanting to offer early access. The game in its current state has plenty of game play available and comes with full immersive stories with the option to download new stories from the forum. As the game goes further into development, more official stories and forked story-lines will be worked on, and more content will be added to the game in the sense of what is available for the characters to do.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Eek! Games","platforms":[{"id":0,"name":"PC"}]},{"id":24687,"name":"Spider-Man: Web of Shadows","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/560/560c4a3fc525979b9e1f35e17d267229.jpg","description":"New York City has been invaded by a vicious symbiote infection and only\nSpider-Man can save it. Experience an unprecedented level of game play\nchoice, including for the first time, control over the game's direction\nand outcome. Choose how Spider-Man fights, which powers to upgrade, who\nin the Marvel universe to fight with or against & the fate of NY City\nitself. Choose wisely.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Treyarch","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PSP"}]},{"id":19561,"name":"Geometry Wars: Retro Evolved","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/572/572b6e48e589b7a1513d447480efbc5b.jpg","description":"Steam Big Picture\nAbout the GameGeometry Wars: Retro Evolved is a old school style shooter, but remixed for the 21st century with next generation graphics and deep, modern gameplay. Playing is simple: you are a geometric \"ship\" trapped in a grid world, facing off against waves of deadly wanderers, snakes, and repulsars. Your aim is to survive long enough to set a high score!\nAvoid the spawning enemies, and shoot them down for points. You can also fire smart bombs, which destroy all bad guys on the screen. Save these up for when the going gets really tough!\nThe more bad guys you kill, the higher your score multiplier goes (2x, 4x, etc.). The higher your multiplier, the more you can score. But don't die, as you lose your multiplier and have to build it up again from scratch!\nAddictive \"just one more go\" gameplay, with mesmerizing graphics.\nPixel perfect recreation of the Xbox Live Arcade game.\nSupport for keyboard, mouse, and dual-stick gamepad play.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bizarre Creations","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":18856,"name":"Praey for the Gods","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/17b/17bbbe97070b0335e91f2febf8053ceb.jpg","description":"Praey for the Gods is a boss climbing open world adventure game where you play as a lone hero sent to the edge of a dying frozen world to discover the mystery behind a never-ending winter. Arriving with only the clothes on your back, you must survive the colossal dangers that you encounter. To restore balance and reclaim the land from the brink, you will be faced with questions that not even a God knows the answer to.<h3>Scale Massive Beasts</h3><br/>Overcome impossible odds to climb atop and defeat the massive beasts that are bound to this land.<h3>Climb, Glide, Swim</h3><br/>You can climb on virtually anything you can get your hands on, from ruins and mountains to the massive beasts that inhabit the land. Ascend to the tops of mountains and then glide over the open world to reach previously inaccessible locations. Swim in frigid water to uncover hidden locations that contain secrets and treasure, but don't stay in too long or your swim could become your last.<h3>Explore, Craft, and Survive</h3><br/>You'll arrive on a frozen island with only the clothes on your back -- it's up to you to survive. Make fires, hunt for food, and find the equipment you need to make it through an eternal winter. Nature isn't the only danger, so craft weapons, defeat minions for better gear, and venture into long forgotten caves to discover their secrets. Triumphing over these trials will prepare you for the impossible odds that wait.<h3>Make Your Path</h3><br/>Praey for the Gods is a non-linear game where you choose who you battle and how. The large beasts can be attempted in any order allowing you to set the course.<h3>Unravel the Mystery</h3><br/>Why won't the winter stop? Why has no one returned? Cryptic paintings left behind allude to a story once thought forgotten. To restore balance and reclaim the land, you will be faced with questions that not even the gods know the answer to.<h3>A Beautifully Frigid World</h3><br/>Explore a landscape of unending winter framed by snow-capped peaks and crawling fog. The remnants of an ancient civilization lie before you, but don't let awe turn into carelessness -- snow storms can crop up at any moment and bury you in a blizzard. Luckily, you can leave footprints in the snow and follow your footsteps back if you are lost.<h3>About the Development Team</h3><br/><br/><br/>Praey for the Gods is being created by No Matter Studios a tiny studio of 3. Brian Parnell, Tim Wiese (glasses) and Hung-Chien Liao.  In 2014, the friends began working after-hours on their first game. By January 2016, they had enough confidence in their progress to leave game-studio jobs in San Francisco and move to Seattle. Working in Parnell’s basement, they pursued an all-or-nothing dream to make the game of their dreams.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"No Matter Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17987,"name":"Jet Racing Extreme","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b4/4b4ba35c9611f21f93f9a892992d2ce6.jpg","description":"Get behind the wheel of a super powerful jet vehicle and blast off!\nTry your abilities in an incredibly difficult and extreme simulator.\nWe challenge you to tame your jet monster!\nOnly the true aces will be able to reach the finish line, others will be disintegrated! Remember, this is neither an arcade or realistic driving game, this is an extreme simulator!\nFeatures:\nAdvanced physics\nRealistic destruction model\nFast and dynamic gameplay\nWorldwide multiplayer mode\nVehicle upgrades\nVehicle fine-tuning\nHigh quality sound and visual effects.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Real Dynamics","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16012,"name":"King's Guard TD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b8/2b8cf93b1e2f3b5932cb1f93e941c9fd.jpg","description":"Your Highness, our kingdom is at risk. We’re facing great danger! Not only villagers, but also maidens, warriors, mages, ravens, bats, eagles and dragons are trying to destroy our empire. Guard your throne and stop them now!\nUse your tactical knowledge and skills to tip the scales of triumph in your favor in order to save the kingdom from the invaders. You are their last hope.\nBuild strong towers and lead your defense forces against difficult enemies.\nMighty Towers\nYou can choose from six different towers which can be upgraded. Each tower has different abilities to help you overcome various enemies.\nEngaging Missions\nFight across three different environments in three campaigns that offer an intense tower defense experience with 50 challenging and unique levels.\nKey Features:\n· 3 campaigns\n· 6 powerful towers\n· 8 enemy types from villagers to warriors, to flying dragons\n· 50 unique levels in three different environments\n· Powerful items to use for tactical advantages. Some items allow you to summon meteor rains from the sky, entangle enemies on the ground, unleash an ambush, power-up and sharpen the senses of the tower\n· Epic boss battles. Mighty bosses have unique skills and abilities. Some are fast, have a lot of health, more speed, deflect more damage, and ability to summon units\n· And more…","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FreezeNova","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":14136,"name":"Blitzkrieg Anthology","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/711/7119853fce71c435ad96898f2698dc0f.jpg","description":"FREE DEMO AVAILABLE!\nAbout the GameEnhance the full Blitzkrieg experience!\nhttp://store.steampowered.com/app/235380/\nhttp://store.steampowered.com/app/313500/\nEisenhower, Rommel, Zhukov; Assume your rightful place among the great generals commanding the Allies, Germans or Soviets as they advance through the decisive battles of WWII. Blitzkrieg is the latest development in WWII real-time strategy gaming combining flexibility, historic accuracy and endless playability into one of the most challenging and enjoyable games yet!Blitzkrieg's unique and completely flexible campaign structure puts you in control of deciding how your forces will fare in each of the major engagements that comprise three central Campaigns. Hardcore vets have the option of engaging the enemy immediately in a desperate struggle for battlefield dominance, or more cautious players can choose from pre-defined or unlimited randomly generated side missions as they gain experience, promotions and weapons upgrades as well as wear down the enemy before the central conflict.Historical accuracy is pushed to the edge as each unit is endowed with the actual capabilities and characteristics that existed at the time. Details such as the thickness of a tank's armor down to the range of infantry rifles add a level of previously unprecedented realism. Each campaign has been meticulously researched to provide an accurate depiction of the battles that took place, while still maintaining the flexibility (and fun!) necessary to let you play the way you want.Two robust editors are Blitzkrieg's keys to unlocking endless game play possibilities. The Mission Editor allows you to generate and add your own missions, chapters and campaigns according to the options you want most, from level of difficulty to type of action. The Resource Editor gives you total license to redesign the game, add or modify units, characteristics, colors, textures, sounds and more - unlimited freedom to play the game on your terms.Key Features\tFlexible campaign structure that frees you from standard difficulty and level settings\nHistorically accurate campaigns where you lead the Allies, Germans or Soviets through actual WWII battles in real time\nMission and Resource editors let you create new campaigns, chapters and missions as well as completely modify the game environment and units\nRealistically rendered 3D terrain including over 350 various buildings and objects\nCommand over 200 types of military vehicles and equipment and more than 40 different infantry units that interact naturally, based on their actual physical properties and characteristics.\nBuild bridges, dig trenches and pits, lay mines, resupply and repair units and call in air support when needed\nBattles feature different seasons, climate zones, and weather conditions that affect game play","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":11733,"name":"There's Poop In My Soup","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dcc/dcc58480918459bdace01220e066b903.jpg","description":"Developer\nAbout the Game\nHave you ever wanted to poop on people but were too shy to just go for it?\nThere's poop in my soup lets you do just that, poop in soups, poop on people, poop on poodles, poop anywhere you please, from the streets of New York to Paris to Beijing.\nMake sure to tick off that to-poo list and unlock special poo abilities.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"K Bros Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":6744,"name":"Cthulhu Realms","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fc/2fc0a161335cd2980048f1b123354558.jpeg","description":"Star Realms has gone insane! Introducing Cthulhu Realms! Are you zany enough to play the crazier and creepier cousin of Star Realms?\nDownload and play today to find out why Cthulhu Realms is so crazily addictive!\nHow to Play the Game:\nIn Cthulhu Realms, each player tries to drive their opponent insane or have more sanity than their opponents when the deck runs out.\nEach player starts the game with a small deck comprised of initiates, goons and followers. Five cards from the deck form a row of available cards on the table; with more than two players, place three available cards between each pair of players.\nEach turn, you start with five cards in hand, playing those cards in order to put locations into play, boost your own sanity or reduce that of others, collect conjuring power to acquire new cards, and remove cards from the game. You can use the power of your locations once each turn. At the end of your turn, discard any cards still in hand and all entities and artifacts that you played.\nIf you lose all of your sanity, you're out of the game. If you're the only one at the table who's still sane, you win. Otherwise, the game ends when the deck runs out and whoever has the most sanity wins.\nDarwin Kastle is the designer of the popular Star Realms Deckbuilding Game, and with the digital release of Cthulhu Realms, he once again provides tons of playability for free, and a one-time upgrade to be able play with your friends and more on any device.\nFree Version\n• Drive people insane everywhere - play across devices.\n• Crazyily addictive deckbuilding game.\n• Tutorial teaches you how to make people crazy in minutes.\n• Awesome, comical art.\n• Play VS the AI.\n• 8 silly campaign missions!\nFull Game Additional Features\n• Play the AI on 2 different difficulty settings.\n• 8 more fun campaign missions.\n• Battle your friends face to face with Pass and Play.\n• Play against many more opponents online.\n• Challenge a friend to online Player v Player combat\nCthulhu Realms is also available at your local game store as a physical card game from Tasty Minstrel Games.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"White Wizard Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4645,"name":"Warhammer 40,000: Kill Team","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8fc/8fcc57bb10b802b1911ef3abf0364457.jpg","description":"Jump into the rich world of Warhammer 40,000 in this fast paced 3rd person action shooter. As one of the Emperor's Elite Space Marines you have been sent on a vital mission to assault a gigantic Ork Kroozer headed for an Imperial Forge World. Choose your Space Marine Chapter and weapons class and commence the purging of brutal Orks and vicious Tyranids on board. Team up to form a 2-man Kill Team in same screen co-op mode and benefit from multiple team pickups to help survive the onslaught.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":567,"name":"Tales from the Borderlands - Episode One: Zer0 Sum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/106/10627dbd0a3449397ac4fd1fe363f91e.jpg","description":"Download Episode One of Tales from the Borderlands, a five part episodic game series from the creators of The Wolf Among Us and The Walking Dead: A Telltale Games Series. Set on the unforgiving world of Pandora after the events seen in Borderlands 2, this is a story full of Borderlands’ trademark humor, following two adventurers on their quest for greatness. You’ll play as Rhys, a Hyperion ‘suit’ with dreams of being the next Handsome Jack, and Fiona, a Pandoran con artist looking to score her biggest ever swindle. Thrown together as unwilling partners in an adventure to recover cash they both think is theirs, their journey will take you on a wild ride where gangsters, bandit lords, and Vault Hunters are just some of the obstacles you’ll encounter, in this new take on the award-winning universe created by Gearbox Software.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":516122,"name":"Needy Girl Overdose","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eaf/eaff56855947026b6d311a2d751cbdad.jpg","description":"Turn “Ame-chan” – somewhat of a hot mess of a girl – into an OMGWTF-cute internet angel and jumpstart her career as a live streamer for the most hardcore otakus online!\nAme-chan:\nWhile she may look somewhat low-key and quiet, she’s actually a ridiculously selfish and vapid girl with a tendency to get carried away and a desperate need for approval. She’s, well... kind of a garbage person. Likes: Her S.O./producer, “P-chan”; psychotropics.\nOMGkawaiiAngel-chan:\nAn “internet angel”. Ame-chan’s alter ego, used while streaming. Pretends to be really nice and sweet. Constantly flirts with otaku types.\nAs Ame-chan’s beloved (???) “P-chan”, offer daily commentary and guidance to help foster her into a top-tier streamer. She’ll start out getting few comments and even less followers, but under your direction and guidance she can amass more and more devoted listeners/obsessed fans, turning her into a super-popular streamer – and thus allowing you to squeeze stupid amounts of cash out of her donation-happy otaku followers.\nIt’s not all about streaming – sometimes you just need to take a little break, too! Take Ame-chan on dates, serve her up a little bit of naughtiness once in awhile, provide her with a little something-something to take the edge off when she needs to release some pent-up stress, and use online dating apps to send her on dates with other dudes to help keep her happy and mentally healthy. *NOTE: This is actually a perfectly wholesome game, containing absolutely no explicit sexual references or expressions nor illegal substances.\nYou can see the results of your daily actions and behavior via social media, where Ame-chan will use both public and private accounts to talk about you. People have a tendency to act supportive and friendly on the outside, while talking loads of smack and spreading rumors privately. You’ll sometimes receive long-winded, tedious criticisms and insults, but that’s just par for the course when dealing with a cute girl streaming on the internet. Be sure to take proper care of her.\nThe game features multiple endings, and your streamer will do things like become weird and emo for various reasons, subject her trusty P-chan to harm, and generally get messed up in the head. Begin your adventure and see for yourself whether a happy ending is really even possible for a cute yet disturbed girl on the modern-day internet.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Why so serious?","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":479634,"name":"Frog Fractions: Game of the Decade Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/405/405f4c5ac5beceb4a7a5935d522feca3.jpg","description":"In Frog Fractions, the player controls a frog sitting on a lily pad. The frog must use its tongue to attack oncoming insects and protect its fruit, in the vein of Missile Command. Between waves of bug attacks, the player can purchase upgrades such as lock-on targeting, a cybernetic brain, and a flying dragon.\nAnd it's free! But you can also drop some cash on the ultimate experience, and you can eat bugs while wearing a hat! Just download \"Frog Fractions With Hop's Iconic Cap\" as seen below. Hat not recommended for first-time players.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Twinbeard","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":47341,"name":"Warspear Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2a/e2aa33ba1e2d6b26671685739dac565b.jpg","description":"Opposition between two mighty Alliances is growing! You will have to choose your side in this war, level up your character and Guild, solve the mysteries of a huge open world, fight enemies, learn skills and work on you combat tactics, participate in tournaments, get or craft unique gear and explore dungeons.\nMassive PvP battles\nWarspear Online welcomes all fans of ruthless and almost unlimited PvP. The game offers plenty of places and possibilities to prove your fighting skills, but the most intense battles take place on Irselnort. Capturing enemy camps, defending your own ones and harsh clashes between hundreds of players - what can be better? Only massive battles between Guilds for the right to have your own Castle.Unique system of crafting and improving items\nApart from boss killing, Dungeon examining and trading, there is one more way of getting weapons and gear in the game. You can create various items all by yourself, as well as improve them with the help of runes, crystals and empower spheres, thus increasing different characteristics. The best items are those done with your own hands.Entertaining storyline and rich history\nPixelart faces cannot entirely express all feelings about what happens in Arinar, but the world is still on the edge of destruction and it needs saving. You can become the part of this world and witness the events that change its fate.\nHistory of the world\nArinar is the world of magic created quite a long time ago. At that time, there was the Spear rising over the whole world symbolizing the mixture of balance and order. The war that began many centuries after this put Arinar on the edge of destruction. Elves and people sweared to protect the balance, but failed to do this in combat with barbarians and undead. The Spear was destroyed, which ended with an apocalypse forcing both sides to ground arms. But the time has passed, and four peoples are ready again to start the war for the right to create a new War Spear and determine the fate of Arinar.\n2 Alliances and 4 races: Firstborn and Chosen against Mountain Clans and Forsaken\n16 classes with unique skills\nzones for open PvP, battles between Alliances, castles capturing, Arena, friendly fights\nGuilds, tournaments, holidays, trading with other players\n1500+ storyline and hundreds of everyday quests\nThousands of monsters and bosses for PvE\n8 craft professions\nCustomization: outfits, decorative skins, hairstyles\n100+ expert skills for creating your own builds\nPersonal achievements with unique rewards, Top 1000 rating","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"AIGRIND","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":43621,"name":"Elite Dangerous: Arena","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a66/a66d1fbae87c001aef2611e9b8272131.jpg","description":"Elite Dangerous: Arena is a standalone expansion pack for Elite Dangerous developed by Frontier Developments.\n\n###Gameplay\nThis expansion pack adds a Player versus Player mode. The players can either play with each other in the usual Elite: Dangerous game sessions or engage on special arenas. It is possible to buy the pack without purchasing the base game.\n\nThe core gameplay mechanic used in Elite: Dangerous is free space exploration. You're given a thousand credits and a beginner-level ship which is enough to start making money using both legal and illegal ways. The galaxy in which the players spawn is entirely procedurally generated, yet it takes into account the actual size and the number of star systems of the Milky Way galaxy. The game features several role-playing elements in its gameplay. There is no character class system present in the game. Instead, the players fit the ships to their intended roles. The role name was added into the game purely for descriptional purposes.\n\nFour new fighter-class ships were added to the game. The fast and aggressive Eagles both for Federation and Empire, a devastating Condor, and a heavily armored Sidewinder. The players will fight each other in four areas, which include space stations, asteroid fields, and even mines.\n\nFree for All, Team Deathmatch, and Capture the Flag modes are available.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Frontier Developments","platforms":[{"id":0,"name":"PC"}]},{"id":19505,"name":"Lost Planet: Extreme Condition Colonies Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ca/6cadbe0243479e58bec05791ba6fb4fb.jpg","description":"Lost Planet: Extreme Condition Colonies Edition includes everything that made the original Lost Planet a hit on PC, as well as the following new features:\nNew modes for single-player campaign\nScore Attack - Each enemy and destructible object has points assigned to them, with the player being awarded different points depending on how they defeat the enemy.\nTrial Battle Mode - Take on each of the game's Bosses, one after another\nOff limit Mode - Go wild with over-the-top super-charged weapons with unlimited ammunition and increased speed of movement\nNew online modes\nAkrid Hunter – Get the chance to finally play as an Akrid as your opponents attempt to take you down\nVS Annihilator – Each team attempts to destroy its opponent's VS while defending its own\nCounter Grab – The team with the longest data posts activation time wins\nPoint Snatcher – Take down opponents and collect the most thermal energy points\nAkrid Egg Battle – Steal Akrid eggs from the opponent’s team and bring them safely back to your own base\nEgg Bandit – steal your opponents' Akrid egg, with points awarded for longer capture time\n4 new maps for online matches: Crossfire City, Area 921, Lost Arena, Assault Space\n5 new playable character models\nMultiple new weapons for both snow pirates and the robotic VS suits\nCross-platform Battles – Xbox 360 owners can join forces or play against PC gamers\nNew perspectives - Switch to first person view or the over-the-shoulder view for even more intense action","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":18597,"name":"UFO: Aftershock","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8f/c8f0396b997f21f1326888816ed513fc.jpg","description":"UFO: Aftershock is a combination of tactical squad combat and global strategy that enhances and expands upon its prequel, UFO: Aftermath.\nIt is the year 2054. Fifty years after the disaster. Fifty years after the surface of Earth became uninhabitable. Retreating to the flying haven of the Laputa the remnants of humankind clung onto existence. Then a revolt against the increasingly rigid and corrupt human leadership of the Laputa escalated into a conflict that destroyed the colony. Now, the remaining survivors flee once again. Can they reclaim the Earth from the unknown forces that chased them into the skies?Key features:Intertwining global strategy and small scale tactical missions\nStrategic resource and base management\nEnhanced SAS (Simultaneous Action System) and RPG system in tactical play\nFight your way through multi-level buildings, inside and out\nNew amazing items and technologies to research and develop\nRadical new training and experience system\nNew terrifying enemies and powerful allies\nAdded diplomacy element\nNew gripping storyline\nInteractive destructible environment","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Altar Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":17981,"name":"The Masterplan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69c/69c4f8a95ae760e772d813b6ea63963e.jpg","description":"The Masterplan is an award-winning tactical squad-based heist game set in 1970s. The 2D top-down view gives you a great overview of what's happening at any given moment, allowing you to be a real criminal mastermind. Features hand-drawn 2D graphics and fun group control, granting you total control - at least until someone calls the cops and everything goes haywire.\nDuring the game you'll need to heist your way through 20 unique hand-crafted heists in a persisting career mode, manage your crew from heist to heist by hiring the right goons and by making sure they are properly equipped. A test of a true mastermind will be to execute the plan to perfection, keep the goons alive, and walk away with the maximum loot from each heist.\nDepending on your preference, you can hit your targets loud, or in stealth, or a mix of both. Keep the civilians under control, knock them out, or leave no witnesses. It's all up to you, just make sure you won't be there when the cops arrive - or be ready for a brutal firefight.\nIf you are hungry for more content on top of the campaign, you can test your mettle in the 8 challenge maps, built by the development team, available through Steam Workshop. And with Steam Workshop support, players can also create their own heists!Key Features\nHeist your target silently or go guns blazing - your choice (and your consequences)\nSwitch the game into Slow-Motion on demand, to give you time to plan and to give your orders\nControl civilians and guards at gunpoint with the unique threaten system\nEmploy a variety of weaponry and gear, from pistols and bombs to shotguns and tranquilizer guns\nCarry and hide bodies to avoid detection\nUse disguises to infiltrate forbidden areas\nDisable electrical systems\nManage your crew\nUnlock and rob 20 unique heist locations, each allowing you to choose your own approach and play in a sandbox environment\nDiscover, plan, and execute the greatest heist in the history of mankind!\nAccess and create more heists and content via Steam Workshop","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shark Punch","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14103,"name":"Sakura Shrine Girls","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/684/6841821b7bc80c8dea23b9f163916f42.jpg","description":"Two cat girls appear before Toru, a skeptical priest in training. One of them carries herself with dignity and grace, while the other lives her days without a single care. With them, Toru slowly realises that there is more to this world than there seems.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Winged Cloud","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11542,"name":"My Summer Car","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/92e/92e4dc3a83d141e94cb1351e69815dd7.jpg","description":"MY SUMMER CAR is the ultimate car owning, building, fixing, tuning, maintenance AND permadeath life survival simulator. You start the game with hundreds of loose parts and assemble both car and engine. Not only you need to maintain your car, but yourself as well. Sausages, beer and sleeping will do just fine.\nIf everything goes well, you have a working car which you can use for various 1990's Finnish countryside summer activities. Basically doing stupid things under influence of alcohol. After you have gathered extra money from various random jobs, you can start to tune and upgrade the car with parts ordered via snail mail. You can turn the car into a obnoxious bass-boom disco machine.... or into a rally car to participate rally competitions... or just fix it into perfect factory condition. Of course car also needs to pass the inspection or you might get into trouble with police.\nNot only you have access to one car, but also several other cars and vehicles which you can use. (Mostly useful to get groceries and for towing the project car from some ditch, again).\nWarning, this game is not for fainted heart. Severe car fever is required to play this properly due to it's meticulous approach on car building.\nFull car assembly with over hundred parts\nDetailed driving and engine simulation\nVarious other vehicles, cars and boat to use and drive\nDozens of kilometers worth of dirt and paved roads with AI traffic\nRandom paying jobs to cover food, beverage and fuel expenses\nRally event to participate in\nPermanent death\nSauna bathing\n90's Finnish summer!\nSupport for steering wheel and shifter controllers\nMuch more!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amistech Games","platforms":[{"id":0,"name":"PC"}]},{"id":3496,"name":"Escape Dead Island","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e5e/e5ecb212f4bc7f18c4b2436f5d421465.jpg","description":"Escape Dead Island is a Survival-Mystery game set on the enigmatic island of Narapela after the events of the zombie outbreak of the original Dead Island. The story lets players unravel the origins of the zombie virus through the eyes of the would-be documentary journalist Cliff Calo. There are no superpowers to keep Cliff alive, just a few makeshift weapons against hordes of infected zombies. It will be integral to choosing wisely between stealth and combat at certain moments in the game.\nCliff Calo, son of wealthy media mogul Tom Calo, led a care-free life with little regard for the family business. However, when his father decides to hand over the company to his younger sister Heather, Cliff feels insulted and excluded. Knowing that his father desperately seeks an insight on the unexplained events on Banoi for his broadcasting channels, Cliff and his friends set sail to land the story that will prove his worth.\nBeing a top graduate and highly skilled in martial arts, Xian Mei was the first female recruit to join the People’s Liberation Army as part of their domestic crime squadron. She was sent undercover to the Royal Palms Resort on the Island of Banoi as part of a secret mission. Then the zombie outbreak happened and soon after she was spotted at neighbouring island Narapela…\nThe Island of Narapela is part of the Banoi Archipelago and located only a few miles from Banoi. Narapela is both a place and an adversary that jealously guards its secrets. As Cliff ventures deeper into the island, his adventure begins to become more and more distorted and unpredictable. Tear through a world that reacts to your every move and collect every clue you can: somewhere amid the madness lies the truth behind Dead Island’s apocalyptic outbreak.Game Features\nUnravel the origins of the zombie outbreakExperience an immersive, story-driven Survival-Mystery adventureFind and use specific tools to your advantage to enter new areas of the islandFight off zombies and kill them in unique ways with a vast array of weaponsDiscover the secrets of the Dead Island universeThe missing link between previous Dead Island games and the upcoming Dead Island 2","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":277925,"name":"Ancient Enemy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a2/4a2ff139b294c5d19d7074e24beba9e5.jpg","description":"ANCIENT ENEMY is a strategic card game which demands you make constant tactical decisions as you battle enemies and overcome demanding puzzles. You will face a cast of deadly enemies, each one emerging from a world in which evil has already triumphed. You must gather long-lost powers to vanquish evil and fight one last duel against your monstrous nemesis!\nYou will explore a lost landscape through dozens of atmospheric levels, draw power from the Earth itself, and use your abilities to duel gruesome enemies in unique solitaire-style turn-based combat!\nGather powers from the shattered landscape.\nEquip your character to face specific enemies.\nExplore a path through a dangerous, folkloric story.\nDefeat the Enemy's monstrous lieutenants.\nDuel your way to the citadel, and defeat your foe once and for all!\nANCIENT ENEMY is the latest iteration of inventive card game design from Grey Alien Games, this time in collaboration with famed Scottish game artist Jen Pattison, and renowned games designer Jim Rossignol.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Grey Alien Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42714,"name":"Magic: Duels of the Planeswalkers 2015","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/163/163004f22c5bd859a962b9187c967284.jpg","description":"GARRUK'S REVENGE EXPANSION NOW AVAILABLE!\nWalk in the footsteps of the Multiverse's greatest hunter. Featuring additional campaign levels, challenges, and new cards to collect, you take on the role of Garruk and hunt your prey across the planes!\n-Explore the fan-favorite plane of Alara to unlock powerful new cards -Take on the role of Garruk and use his evolving deck to hunt your prey -Win Battle Boosters through Multiplayer to expand your card collection\n------------------------------------------------------------------------------------------------------------------------\nEarly Bird Bonus: Players who purchased the Complete Bundle, Card Collection Bundle, or any Premium Boosters for Magic 2015 prior to 11/5/2014 automatically get the Garruk’s Revenge expansion campaign added to their account as a bonus!  Simply update Magic 2015 to the latest version, start the game, and the expansion campaign will be there waiting for you!\n--------------------------------------------------------------------------------------------------------------------------\nExperience the world's best strategy game with Magic 2015—Duels of the Planeswalkers!\nHunt bigger game in this all new adventure. Command powerful creatures and wield devastating spells to defeat your opponents in the most exciting Magic yet!\nLEARN MAGIC:\n•Detailed tutorial makes it easy to start playing\n•The quickest way to learn the world's best strategy trading card game\nBATTLE ACROSS THE PLANES:\n•Sharpen your skills as you fight your way across the Multiverse\n•Face ever-more challenging opponents\n•Come face-to-face with legendary Planeswalkers on Innistrad, Theros, Ravnica, and more.\nBUILD YOUR DECK:\n•Craft your ultimate deck from hundreds of cards\n•Open Booster packs to grow your collection and become more powerful\nCHALLENGE YOUR FRIENDS:\n•Enter multi-player mode to test your deck\n•Pit your skills against random opponents or your Game Center friends\nMagic 2015 performs best on iPad 3 or later, iPad 2 or newer required.\n*Premium Boosters purchased individually or in bundles can be opened once you’ve completed the Innistrad Chapter.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stainless Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":19288,"name":"Chantelise: A Tale of Two Sisters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/990/990a1898eee2eb6b8b43e29120db0ffe.jpg","description":"Five years ago, a witch's curse beneath the red moon turned Chante into a fairy. Now she and her sister Elise search for a way to transform her back into a human, and in their travels they come across a particular town, which is home to a number of nearby ruins, as well as a peculiar shopkeeper named Aira, and a strange, mercurial fortune-teller who calls herself Elma. Could this place hold the key to returning Chante to normal? Or will it lead to more answers than our two sisters ever wanted to know?...\nKey Features\n\nA classically-styled action-RPG title for the PC!\nA treasure to find in every single area!\nInventive boss fights to challenge the player!\nFull controller support, including full Xinput trigger and right-stick camera control support!\nFive core dungeons, plus two bonus dungeons! Hours and hours of gameplay!\nFishing! With collectible fish!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"EasyGameStation","platforms":[{"id":0,"name":"PC"}]},{"id":13702,"name":"Leviathan: The Last Day of the Decade","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bab/bab25e8c6829f581e1e97869a4a9029d.jpg","description":"\"Leviathan: The Last Day of the Decade\" is a detective story told by a dweller of a cruel dark fantasy world affected by the pandemic. The world ruled by a 5 noble-born kins under the suzerainty of the undead Plague King.\nA young man spends years to find a clue to bring justice for his mother's murderer. But what if the criminal is protected by the mighty family? And what if he is a man you really love?FEATURES\n— The world of aristocracy full of money and power.\n— Romantic relationship.\n— Daemons from the depths of outer worlds!\n— Mysterious murder and secrets of the past!\n— City streets, full of adventures.\n— Stunning animated 2D graphics.Episodes: Episode I - The First Day of the Decade\nEpisode II - Clues from the past\nEpisode III - Being a killer\nEpisode IV - The Gift\nEpisode V - The Last Day of the Decade\nForum: http://leviathan.club\nFacebook: https://www.facebook.com/leviathangame\nInstagram: https://instagram.com/lostwood_games/\nTwitter: https://twitter.com/LostwoodGames\nYouTube: https://www.youtube.com/user/LostwoodGames\nTwitch: http://www.twitch.tv/lostwoodgames\nVK community (russian): http://vk.com/leviathangame\nNeed help or technical support? Want to help us to make the game better? Mail us: help@thelostwood.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lostwood","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11382,"name":"Oh...Sir! Prototype","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/420/420f423717250266cc745213c725e856.jpg","description":"This is the prototype that started it all! This build was oringially created in 42 hours during the amJam game jam event hosted by Artifex Mundi. The competition’s theme was \"this parrot is no more\" based on the Monty Pythons' Dead Parrot sketch. Oh...Sir! came in second and received an audience award. Subsequently we decided to release this prototype into the world, and much to our surprise players enjoyed it as much as we do! We were thrilled to receive all of their feedback and feature requests and decided to build upon them and create a honest-to-goodness real game called Oh...Sir The Insult Simulator. However we still wanted players to be able to play the original protoype that started it all, so here it is!\nIf you think your best friend's mother is a hamster and your boss smells of elderberries, invite them to play Oh...Sir!, a jolly video game about dead parrots and insulting the *BLEEP* out of your beloved loved ones. A game where your sister can convince you that your hovercraft is full of eels and your hat is silly! You should always look on the bright side of life - even the harshest insult can be classy when said over a cup of tea. So track down a best friend, and enjoy the greatest local 1v1 multiplayer insult simulator game of the century!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vile Monarch","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10764,"name":"Age of Conquest IV","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1de/1deb187048ada791a2c75816db53bb8f.jpg","description":"Age of Conquest is a turn-based grand strategy wargame. Command your armies in one of the many ancient and medieval countries including the Roman Empire, the Inca, France, Russia, Japan or the Chinese Dynasties. From Rome to Asian nations, you create your own warring experience. Wage colossal wars solo, against the AI, or take on your gaming friends in cross-platform multiplayer games. Form alliances and fight co-op style with the AI and other players for ultimate victory.\nRange of functionality is comprised of expansion, diplomacy and managing your nation's finances and economy. You do your best to keep your population happy. You forge alliances and together you take on your enemies. Are you ready for the challenge? Will your place be in the history books or in the mud? Assemble your armies, take on the world and achieve greatness in this epic historical strategy game.\nTurn-based grand strategy game with maps & nations from all over the world.\nChallenging AI for single player games based on a genetic algorithm.\nCross-platform multiplayer & hotseat-Play including co-op team games.\nDiplomacy management of economy & population.\nMap scenarios including Europe, Colonization, Asian Empires, World Conquest and many more.\nMap editor and a central server to host and distribute player-modded bundles.\nEmpires including the Roman Empire, Carthage, Persia, Celts and Inca amongst others.\nHigh score, playing statistics, achievements and multiplayer ELO-ranking.\nEngaging music, sound effects and fantastic graphics.\nThe game includes one map for FREE. Other maps are all available for download as a single purchase or 1-by-1 if desired. Multiplayer games are generally free to join. There is no subscriptions. This game is NOT pay-to-win.\nIf you like this game, please also try our other strategy games. You should be able to find the games in the same marketplace!\nThanks & Enjoy the Game!\nnoblemaster ]:-D","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Noble Master","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":852781,"name":"Omega Strikers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6e/a6e00b3828ec001ccb78a8d03590eccf.jpg","description":"Omega Strikers is a 3v3 competitive game where the objective is to knock out opponents and score goals against the enemy team using explosive attacks and abilities. Matches are fast and intense—the first team to get five goals wins, and you must get at least two points ahead to secure a victory.\nOmega Strikers has an ever-growing roster of unique and powerful Strikers, each of which can be unlocked through normal play. 3v3 unranked, ranked, and private lobbies across a handful of maps are available from day one, with more maps and modes planned. For those looking to dive deeper into the game, cosmetic purchases and battle passes are available via in-app purchase.\nAlways Free-to-Play, Never Pay-to-Win\nIn Omega Strikers, only smarts and skills will earn victory. There are no loot boxes, no consumable power boosts, and no competitive advantages for spenders. All characters can be unlocked through regular play.\nCompete Your Way\nQueue solo or squad up with friends and fight your way up the ranked ladder to become a champion—or use custom matches to challenge your rivals.\nPlay Anywhere\nParty up cross-platform with friends and take your progress anywhere with cross-progression as Omega Strikers rolls out across PC and mobile platforms.\nBig Seasonal Updates\nOmega Strikers will continually evolve as each new season adds new Strikers, additional stages, fresh unlockables, and more ways to play.\nSome content shown may require separate purchase from the in-game store and is subject to availability. Contains in-game purchases.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Odyssey Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":484577,"name":"Roadwarden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/216b292b866abcd42afde82f759c3ac3.jpg","description":"Coverage\"RPGs shouldn't have to focus on combat, shouldn't have to even feature it, and an upcoming example of the latter is intriguing text-based RPG Roadwarden.\"\n-  PC Gamer\n\"You get to pet and name your horse, as well as generally be friendly towards them, something that’s apparently usually frowned upon in this universe.\"\n-  Rock Paper Shotgun\n\"I’ll admit, I’m not much of a text adventurer, but Moral Anxiety Studios new title the Roadwarden has me intrigued.\"\n-  Geek Native\nDo you need some more reading?Then you should try the free demo of THE INNSMOUTH CASE - a detective adventure in the style of an interactive book inspired by the fantastical works of horror legend H.P. Lovecraft.\nhttps://store.steampowered.com/app/1231950/The_Innsmouth_Case/\nAbout the GameWho or what is a Roadwarden?You are a Roadwarden, a brave stranger putting their life in danger to make a difference in a grim fantasy world. While most people would never risk a solitary journey through the wilder parts of the land, you willingly accept the struggle. You guard travellers, connect isolated villages, support merchants, and repel attacking creatures, bandits, or even undead.What's the story about?A powerful merchant guild has called on your services, sending you on a journey into the unknown planes of a mysterious peninsula in the hopes to expand the guild’s influence even further. You are meant to explore this place and gather as much information as possible to reveal the secrets surrounding the area. It’s a dangerous task, but an equally respectable one.\nOther then that, your character will pursue a unique goal selected by you, such as wealth or fame. But do you have the courage to meet all the requirements that define a roadwarden?How to play?Roadwarden is an illustrated text-based RPG that uses isometric pixel art and combines mechanics borrowed from RPGs, Visual Novels, adventure games, and interactive fiction, such as inventory puzzles, dialogue choices, character abilities and progression, hit points. simple survival mechanics. or quests restricted by in-game time.\nExplore and change the world!Discover the secrets and face the vast challenges of a hostile fantasy world – inevitably unveiling its uniquely fierce lore.Grow with the challenge!Create your own background, abilities, beliefs, and personality to shape your very own future as a roadwarden.Classical attitude!Prepare yourself for an adventurous journey, either as a warrior, mage, or scholar and define your character‘s attitudes, like friendly, playful or intimidating, during interactions with NPCs.Get lost in conversation!Immerse yourself in profound dialogues and sidequests with dozens of NPCs to gain their trust and support.Mysteries unfold!Use your savvy and be witty when investigating and drawing your conclusions to understand the true nature of this world.Overcome your weaknesses!The world is full of dangers and nobody can be trusted. Be the roadwarden you want to be and find your path to success against all odds!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Moral Anxiety Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]