[{"id":18846,"name":"Bone: Out From Boneville","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e86/e866b20c0adf1fa3067175aba82727bd.jpg","description":"<p>After an attack by a swarm of locusts leaves Fone Bone lost in the mountains, he sets out to find his cousins, with a little help from a mysterious red dragon, a couple of talking bugs, and a pretty girl named Thorn. But with hungry rat creatures on his tail, will Fone Bone ever make his way back to Boneville?</p>","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18629,"name":"Phantasmagoria","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/776/77610dac53cb8e54d6879191dfc1e572.jpg","description":"I feel its presence, the icy fingers upon my throat.\r\nI hear its eerie sounds, unsettling my every thought.\r\nI try in vain to slumber, my reveries gripped by violent terror. My only salvation, the shock of awakening.\r\nSomething is very, very wrong here.\r\nMaster storyteller Roberta Williams challenges you to experience the ultimate interactive nightmare.\r\nA thrilling storyline designed by a professional writer - Roberta Williams\r\nOne of the first games utilizing full-motion video technology so well\r\nSee for yourself what caused so much controversy around this game!","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":14432,"name":"Iron Sky: Invasion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/093/0931a86b014ea830e491aadd25e97362.jpg","description":"In the near future, mankind faces the greatest threat to its posterity ever in recorded history: an invading Nazi horde, reborn in the depths of space! An armada of Fourth Reich ships, built in secret at a hidden base on the moon, descends upon the Earth to rain terror and destruction.\nBut this is not done without resistance. A cadre of crack space pilots have stepped forth to defend Mother Earth from becoming the new Fatherland of this twisted regime. A lone pilot, entering the hangar to see three state-of-the-art, prototypes ships awaiting him, knows he is the only one who can save Planet Earth. It is up to him and his brothers in arms to ensure that humanity stays free of the yolk of Nazism for good and all...\nSet during the main conflict of the movie, “Iron Sky: Invasion” puts players in the cockpit of an advanced new starfighter, to test his or her might, flight and dogfighting skills against the forthcoming Blitzkrieg-on-high. The main objectives are to defend Earth and its space installations from enemy attacks, blast as many Nazi ships into oblivion as humanly possible, collect and skillfully manage necessary resources, and make it alive to the final confrontation… where the ultimate secret weapon of the Fourth Reich awaits those foolishly brave enough to take up the hammer and chisel of heroism and attempt to carve their names onto the tablets of history.GameplayThe film itself was only the first stage of the assault. Now, after the credits have rolled, the true strike begins with “Iron Sky: Invasion”, the official video game of the movie. The game puts the players in direct control of an advanced space fighter pilot hell-bent on protecting Earth from an invading Nazi fleet from outer space.\nCreated by the architects of the world’s most popular European RTS series, the “Earth” franchise (“Earth 2140”, “Earth 2150” & “Earth 2160”), and the best-selling RPG hits “Two Worlds” and “Two Worlds II”, “Iron Sky: Invasion” packs more firepower than a space-borne missile array, and, as did the film, will supersede the expectations of its genre. The future of space combat begins in 2012.Key Features:\tUnique, genre-busting gameplay – space flight and combat simulation, with elements of real-time strategy\nBreathtaking 3-D universe filled with awe-inspiring effects to match those of the film, courtesy of the powerful GRACE2 engine\nAvant-garde game structure: with no division into single missions, “Iron Sky: Invasion” is one giant, open-world battle\nProtect the Earth’s satellites & bases while repelling the Fourth Reich’s fleet\nReal-time map of outer space\nInnovative energy management: players can transfer the ship’s power between engines, shields and weapons, depending on the needs of the moment\nHigh replayability: many side missions and a challenging scoring system\nNon-stop action of spectacular ship-to-ship dogfights to rival even the greatest space battles of science fiction lore\nResource management: players can scavenge parts from destroyed spaceships, collecting precious elements for enhancements\nMultiple weapons: lasers, homing missiles, and even tactical nukes are just a few examples of the vast arsenal at players’ disposal\nEnhanced combat technology allows players to deploy satellites and drones for offense, and equally, to defend themselves with flares and anti-missile arrays\nAdvanced Artificial Intelligence to challenge even the most crackshot pilot\nMultiple classes of ships: Fighter, Heavy Bomber, and Gunboat\nMassive upgrades: home station docking opens a user-friendly game economy allowing players to access hundreds of ship upgrades\nMany classes of allied ships can help players out in a pinch\nNumerous enemy ship classes, from Valkyrie to the fearful Götterdämmerung\nDiverse enemy attack fleets demand adaptable, dynamic strategies","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Reality Pump","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13285,"name":"A.V.A. Alliance of Valiant Arms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/078/078b9e0242298fd3457a4eaf8f882865.jpg","description":"Special Offer\nEarned by unlocking the 1st One Down achievement.\nAbout the GameAlliance of Valiant Arms (AVA) is a free-to-play military FPS set in a world where the Cold War has boiled over into open conflict, and the whole world is a combat zone! Players take on the roles of Rifleman, Point Man, or Sniper, battling other players in classic PvP modes or joining forces to tackle challenging cooperative scenarios.\nFace-off against other players in classic modes like Annihilation (Team Deathmatch) and Demolition, or test your skills in unique objective-based modes like Escort, Escape and Infection.\nHone your skills against bots in AI Demolition mode, or join up with other players to take on a variety of co-op scenarios and uncover the story behind AVA’s near-future global conflict.\nBuild an arsenal of authentic military weaponry and collect hundreds of rare skinned variants. Modify your weapons to augment their stats, then equip your character with armor, perks, and cosmetic items.\nJoin a clan and compete in ranked championship seasons for epic rewards. The very best clans even have a chance to compete on the world stage at two annual international tournaments!\nWith hundreds of weapons, dozens of maps, and tons of unique gameplay types, there is no shortage of content to engage with in AVA. New weapons, maps, and modes are added to the game on a monthly basis to keep you coming back for more!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Red Duck","platforms":[{"id":0,"name":"PC"}]},{"id":350126,"name":"Solasta: Crown of the Magister","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d6/1d65bc7a33b90263aae066abe32b5754.jpg","description":"Created and written by lifelong fans of pen-and-paper games and utilizing the 5th edition ruleset, comes Solasta: Crown of the Magister.Bring the authentic Tabletop gaming experience to your PC!Roll for initiative, take attacks of opportunity, manage player location and the verticality of the battle field. Set yourself up for the finishing strike and possibly roll a natural 20 at that key moment of battle.​\nIn Solasta, you take control of four heroes, each with unique skills that complement one another. Every hero expresses themselves in the adventure, making each action and dialog choice a dynamic part to the story. Players will create their heroes just as they would in a pen-and-paper game choosing their race, class, personality and rolling for their stats.​\nYou make the choices, dice decide your destiny.\nKey Features:An Epic Team Adventure.\nDiscover the shattered world of Solasta: explore ruins and dungeons for legendary treasures, learn the truth of an age-old cataclysm - and stop it from happening again.\nCreate your very own party of adventurers with our Character Creation Tool in the classic tabletop RPG tradition. Breathe life into your heroes, and see their personalities reflected in their dialogue. Tailor your squad to your preferred strategy and maximizes your party's abilities. The choice is yours.\nDiscover a Mysterious & Dynamic World.\nDelve into long forgotten dungeons to unearth ancient artifacts, but stay watchful of light and darkness: many dangers hide in the dark, but a light can attract monsters. Some enemies have darkvision, some may flee from your torch... Successful adventurers will learn to use it to their advantage.\nFight monsters in squad-level, turn-based, tactical combat. Solasta's dynamic environment offers some interesting tactical options. Bridges can collapse, leaving enemies stranded and vulnerable. Walls and columns can be pushed over - on top of your foes, if you do it right. The world is your playground.\nPrepare to Think in Three Dimensions.\nThe dungeons in Solasta are more than flat game-boards. Climb, jump, or fly around obstacles. Evade or surprise foes from above or below. Push them into chasms or drop things on their heads. Position yourself on high grounds to start the fight with an advantage.\nSize also matters. Escape through narrow passages where bigger enemies won't fit and crawl through tunnels to find secret areas. Take advantage of the environment to find cover suited to your own size. Watch out, though - the monsters are also thinking vertically.\nTrue to the Tabletop.\nBased on the 5e ruleset of the world's most popular tabletop RPG, Solasta: Crown of the Magister brings back the thrill, tactics, and deep storytelling of tabletop games.\nAs you play, you'll feel yourself reaching for your dice and miniatures. It's time to dive into the world of Solasta. Roll for initiative!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Tactical Adventures","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox Series S/X"}]},{"id":18318,"name":"Bleed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c6/8c644fbb45209a83a1837bfca467dc86.jpg","description":"Wryn is a girl with a big arsenal and big dreams -- she wants to be the ultimate videogame hero! Help her take down the Greatest Heroes of All Time in an action-packed bid to claim the title for herself and show the world what a true hero looks like!\nBleed is an action-platformer focused on stylish, acrobatic dodging and fluid, challenging gameplay. There's no filler -- just you and your skills against seven levels of enemies, obstacles, breakneck set-pieces and inventive bosses!Key Features:-Unique control scheme enabling crazy fast action\n7 levels packed with multiple set-pieces and bosses\n4 difficulty levels that remix enemy placement and boss patterns\n2-player local co-op for all modes (requires at least one gamepad)\n3 unlockable characters with their own gameplay twists\nSurvive the entire game on one life in Arcade Mode\nSelect and battle up to three bosses at once in Challenge Mode","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17539,"name":"Data Hacker: Reboot","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eae/eaee57cee121bca50465cb6e09190ec3.jpg","description":"Time, Space and Parallel universes collapse and merge, tethered to threads of reality and sustained by a paradoxical power source.\nNothing is impossible - it is time to become a Data Hacker.\nThe stage is set for a struggle that spans many Worlds and their people; a struggle that is bigger than any man, woman or child. Who knows what trials you will face, what adversity you will defy in your quest for the true meaning of existence?\nData Hacker: Reboot is a Japanese-styled role-playing game that will make you question the very definition and value of life, reality, love and loss. We will laugh. We will cry. We will be gratified.\nAre you ready to take up this quest, and become a Data Hacker?\n\nCore Features:\nBeautifully crafted environments - explore a variety of unique World Fractures on your travels, from Fantasy and Sci-fi to Nightmarish and Surreal!\nAwesome Combat Scenes - Action-packed, classic turn-based battle system complete with voice acting! \"Argh! Huh! Take this!\"\nTotally Epic Sounds - An incredible soundtrack composed by Scott Holmes adds an ocean of depth to environments, battles and cutscenes\nHacking, hacking hacking! - Break down restrictions. Smash through barriers. Manipulate monsters and achieve your goals. Each character has unique hack-style abilities!\nClass-Hybrid System - A dynamic class-hybrid system allows you to create your dream team, with over 58 classes to mix-and-match. Train each character as you see fit, retaining all learned skills!\nEngaging Storytelling - Take control of Thanier as he searches for his recently lost twin sister, recruiting a rag-tag bunch of characters to aid him in his quest.\nRich Backstories - An intricate tapestry of backstories, motivations and goals create the backbone for each character design in the game.\nUnseen forces - Many powers, both dark and light, exist out there in the Shattered Worlds. Can there be peace, or at least a balance in this survival-focused reality?\nThis is not the End - The Multiverse is abundant with practically limitless possibilities - download all DLC packs for free as they become available!\nWhat do the press think of the game? Let's see...\nFirst, there was an Initiation~\nhttp://store.steampowered.com/app/311860\nFollowed by a spread of Corruption#\nhttp://store.steampowered.com/app/329000/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"New Reality Games","platforms":[{"id":0,"name":"PC"}]},{"id":12530,"name":"MIND: Path to Thalamus Enhanced Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc2/cc2e32ab67c6fe2909464d376b1c4be7.jpg","description":"Change the entire environment!Wrapped in a mind-bending tale, the gameplay of “MIND” focuses on changing the very weather in order to solve puzzles: the player will cycle between day and night, modify the levels of fog and rain and even travel in time between seasons, changing the environment to advance the gameplay-driven story —indeed, the mechanics are directly related to who the protagonist is, what has happened to him and everything he is doing: a man trapped in his own mind, he must use all the tools at his disposition to escape to reality. Accompanied by the snarky yet heartfelt narration of this comatose patient, the player will guide him through fantastical forests, dark caverns and deceptive worlds of water and ice that directly relate to his emotional state at each point in his journey.Enhanced Edition FeaturesPlay the game in Virtual Reality for a full immersive experience. VR support only for motion controllers (HTC VIVE and Oculus Rift + Oculus Touch).\nPowerfull new Unreal Engine 4 engine gaining even 70% more performance in almost every level.\nSteam controller, keyboard, gamepad and VR controllers 100% supported and configurable.\n4 secret levels, redesigned interactive ending, narration and also an alternative ending.\nMore than 40 different, creative puzzles seamlessly integrated into the environment.\n6 ways to affect the environment in order to solve the puzzles.\nMore than 25 distinct landscapes into with which you will be able to interact.\nTurn day to night, make it so everything is covered by a blinding fog, summon incredible storms, travel to the past and make use of even more as of yet unknown mechanics.\nMore than an hour of voice acting that, while integrated into the gameplay itself, will tell you a whole story that is not about saving the world but about living through the pain of a father broken by his mistakes.\nFace down imposing enemies by using your creativity and everything you have learnt along the way.\n22 achievements full of Easter eggs and references.\nOST and Artbook included.Who are we?\nDeveloped by Carlos Coronado  Carlos Coronado, Dani Navarro y  Luka Nieto. Aditional code by Jose Ladislao. Voice by Greg Nugent.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pantumaca Barcelona","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3979,"name":"Muramasa Rebirth","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/846/8460e4338ead443da6c6d20835d1d2c0.jpg","description":"From master video game developer Vanillaware comes Muramasa Rebirth, an action RPG that blends the vibrant and beautiful world of Japanese mythology and high flying, fast-paced action!  Enter a world where demon, samurai and other deadly enemies vie to destroy you as you search for the fabled Demon Blades.  Become the possessed princess Momohime, as you travel West, or the fugitive ninja Kisuke, as you travel East, through mythical Japan battling anyone who stands in your way.  Forge and collect 108 blades, each with its own devastating secret art, but beware these Demon Blades are hungry for the souls of the vanquished and legend foretells that tragedy befalls those who dare to use them.  With stunning high-res graphics, two beautifully told storylines, multi-modes of play and much more, Muramasa Rebirth brings the very best entertainment to the PlayStation®Vita handheld entertainment system!\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\n10000KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n© 2009, 2013 MarvelousAQL Inc. Licensed to and published by Aksys Games.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Aksys Games","platforms":[{"id":0,"name":"PS Vita"}]},{"id":473484,"name":"Skully","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67b/67b51328137c82ac4032bbf3ccc48e90.jpg","description":"On a mysterious remote island, a skull washes up on shore and is reawakened by an enigmatic deity. Dubbed Skully, the newly reanimated being has been summoned to intervene in a war between the deity’s three siblings, whose quarrel jeopardizes the island they call home.\n\nFate has bestowed Skully with a second chance at “life” and his adventure will take him across a strange paradise as he seeks an end to the conflict that plagues the isle.\n\nHop, skip and roll your way to victory. Dodge obstacles across the island as Skully, a skull reanimated by the power of magical clay.\n\nAdapt to your environment. Transform into three distinct forms to overcome challenges and defeat enemies.\n\nTraverse a mysterious island. Roll through 18 different levels in 7 distinct ecosystems each packed with unique dangers.\n\nExplore a compelling story. Fully voiced dialogue and cutscenes breathe life into the island’s inhabitants and the charming world of Skully!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Finish Line Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":20987,"name":"Star Wolves","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f3/6f35b76899916d3a1d240216f60bedff.jpg","description":"Star wolves is a 3D space RPG with deep strategy and tactical elements. The game thrusts players into a world of freelance space hunters in the XXI-XXII century A.D. during a time of political crisis for the all-powerful Empire and the three mega-corporations that control all the known worlds. Corruption prospers planet-side and only space can give a man his freedom, but not without a cost: space is not a safe place anymore. Human space pirates, rogue AI computers that rebelled against humanity and empire patrol ships roam space in search of easy prey.\nPlayers begin the game as a bounty hunter with little more than an old, run-down space fighter and a dream, but as they advance in the game and prosper, their piloting and battle skills improve, allowing access to more advance spacecraft. Players can control a party of up to six bounty hunters, each possessing different skills, abilities and personality.\nTeam tactics give players vast opportunities in battles when shear fire power isn't enough. Tactical ruses, planning and executing ambushes or deploying spaceships' special abilities provide cunning commanders the ability to crush enemies according to their style of play.\nSpectacular 3D real-time battle system\nOriginal blend of tactical and action game play\nVariety of missions and mission-types including stealth, hit and run and assault missions\nNon-linear storyline and game play\nSecondary and secret quests along with primary missions\nOver 25 space fighters\nDozens of energy and missile weapons\nOver 40 missions\nA choice of eight game characters, both male and female, to form your party\nOriginal RPG system","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"X-Bow Software","platforms":[{"id":0,"name":"PC"}]},{"id":19541,"name":"Sherlock Holmes: The Awakened - Remastered Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e5/4e54b9a254756febcea3d48d820b7818.jpg","description":"The Sherlock Holmes series returns with this updated version of The Awakened, which brings a whole new dimension to the original title developed by Frogwares.\nKeeping with the traditional Point & Click gameplay style of the original adventure games, The Awakened has been totally rethought, offering players a new third-person view while keeping the original first-person view available also.\nThe game puts the player into an investigation of the myth of Cthulhu - as imagined by author H.P. Lovecraft.  Sherlock Holmes, assisted by the loyal Doctor Watson, investigates strange disappearances which seem related to the activity of a secret sect. The adventure begins in London, in the renowned Baker Street, taking us to investigate a disturbing psychiatric hospital near Bale, Switzerland, on to Louisiana and finally to Scotland.\nKey Features\n2 points-of-view available at all times: new gameplay in 3rd person, giving a new dimension to the original game, or classic first- person point-of-view.\nAn original confrontation between the universe of Sherlock Holmes and the myth of Cthulhu - a fight between the rational and the supernatural.\nRich graphics, biting dialogue, disturbing characters and an excellent sound track create incredible turn of the century atmospheres.\nPlay as the famous detective Sherlock Holmes and his loyal friend Doctor Watson.\nA new help system that shows the interactions available (objects and actions).\nInteract with more than 60 characters in 5 disturbing universes.\nUse and combine more than 50 objects, and discover hundreds of clues and documents to carry out the investigation to its final outcome.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":51179,"name":"Leisure Suit Larry 6 - Shape Up Or Slip Out","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f26/f26930bca5159d29bdca186f258ea2f6.jpg","description":"Shape Up or Slip Out! is the fifth game in Al Lowe's Leisure Suit Larry series and again a classique point&click adventure.\nAll the events from the previous games are forgotten. Larry is single, and his goal is to capture the interest of various ladies. By sheer coincidence, Larry finds himself on a TV Game Show called \"Stallions\". He wins a weekend at the Spa Resort, La Costa Lotta. Naturally, there are some beautiful women in the spa who are just dreaming about such a wonderful, handsome man as Larry! Uh... or is it really so? It is the player's goal to find out!\n-    Includes Leisure Suit Larry 6 - Shape Up Or Slip Out and its VGA version\n(The VGA Version of the game is available through steam. Right click on the game in the steam library -> properties -> betas and choose the VGA version.)\n-    A classique old school point&click adventure with an adult-themed scenario\n-    Explore La Costa Lotta as the best Spa resort Larry has ever been probably and discover its secrets.\n-    Help Larry to relax at La Costa Lotta and maybe find the perfect woman for him.\n-    Larry can die again, as he did in the series before but can continue again right before he died.\n-    Play as one of gaming’s longest lasting legends: Leisure Suit Larry!\n-    Al Lowe’s famously risque humor and bodacious babes that are waiting to “work out” with you!","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18847,"name":"Bone: The Great Cow Race","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f33/f3333bbae45158c409386498c2f16364.jpg","description":"It's spring fair time and The Great Cow Race is about to begin! Play carnival games. Write love poetry. Outsmart a really big bee. Cheat the locals out of their hard-earned eggs. Bang on some pots and pans. Escape from an angry mob. Oh, and dress up like a cow. (Not necessarily in that order.)","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":12109,"name":"Silence of the Sleep","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aca/aca2229c37790cf7ff2c798102feb8c9.jpg","description":"Silence of the Sleep is psychological horror adventure game for PC.\nYou play as a man called Jacob Reeves. A man who has lost his reason to live.\nHe throws himself into a blackness to end his misery, but instead of it being the end he wakes up without a memory of his life before.\nYou will travel through the abstract world of Silence of the Sleep to find the very reason for your\njourney...\nNow that is a good question!\nHere are some info about Silence of the Sleep that I believe are worth knowing:\nSide scrolling 2D with unique, digitally drawn graphics\nUnique music from one end to another\nMinimalistic interface -  I won’t hold your hand through the game\nChallenging puzzles\nNo shooting - Enemy encounters are pretty rare and you can’t kill the enemies, avoid and hide from them to survive\nOriginal gameplay and twisting story - Silence of the Sleep has well crafted balance between horror and adventure, this allows me to build different atmospheres which brings variety to gameplay\nOne man game - Graphics, animation, coding, music... You name it!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Jesse Makkonen","platforms":[{"id":0,"name":"PC"}]},{"id":2408,"name":"Blue Estate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d3/1d3cd86dfbb7e02ffe502a69838b5860.jpeg","description":"Blue Estate is a darkly funny on-rail shooter based on the comic books from Viktor Kalvachev.\nWELCOME TO THE FIRST NEXT GEN RAIL SHOOTER!\nUsing Kinect for Xbox One motion detection capability, Blue Estate offers previously unmatched immersion into the mafia world of Los Angeles, packed with humour, original gameplay and incredible fun.\nIn Blue Estate you will play Tony Luciano, the psychopathic son of the Italian mafia godfather of LA and Clarence, an ex-Navy SEAL, penniless and now a hit-man bent on cleaning up the mess started by Tony. As Tony launches a personal vendetta against the Sik Brother’s gang in an attempt to save his best dancer, Cherry Popz, Clarence wants to end the gang war, taking him to the farthest corners of Jamaica!\nA RAIL SHOOTER GAME TAILORED FOR KINECT FOR XBOX ONE !\nThanks to an intuitive gameplay tailored for Kinect for Xbox One motion detection helps you live out the most extreme rail shooter experiences as you confront unforgettable enemies ranging from the mafia golfer packing grenades to the ultimate crime boss, both as funny as they are unlikely! Bloodshed is always better when shared, so invite a friend to join the massacre, through a nervous cooperative mode!\nThe first next gen rail shooter adapted from the Eisner Award nominated graphic novel, Blue Estate by Viktor Kalvachev.\nOriginal and intense fun gameplay that takes full advantage of the Kinect sensor.\n*2 game modes: STORY MODE - 7 adrenaline-packed missions ! ARCADE MODE - where you combine headshots with combos in a race against time!\n*2 players in local multiplayer: relive all the levels in an intense cooperative mode!\n*A sophisticated scoring system for comparing your scores online and 23 achievements to unlock.\n*Playable with Kinect for Xbox One or with Xbox One Wireless Controller.\nThe downloadable version of this game supports English, French, German, Spanish.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"4EversGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":32734,"name":"Gothic 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/76a/76adfa3770b99bc36a7fa380c0f9b215.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Piranha Bytes","platforms":[{"id":0,"name":"PC"}]},{"id":12116,"name":"AdVenture Communist","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d12/d120a91771b8a7970d359baa3da03852.jpg","description":"Welcome friend, to AdVenture Communist! The world’s fairest communism simulator!\nGrow your modest potato farm into a spudding colony, then expand your industries across the brother land! Invest shocking amounts of resources into elite factories and science experiments to increase your production!\nCommunism never sleeps and neither will your progress, as your workers will go the extra mile to fuel your industries 24/7. It’s so simple, even a Capitalist could do it!\nIt’s time to show the ruling class what you’re made of. Start your farm to factory adventure today - Only in AdVenture Communist!\nPeace, Land, and Potatoes!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kongregate","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":254604,"name":"Spellcaster University","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e94/e944e5ffef976be4b930ddb16febe10e.jpg","description":"In Spellcaster University, you take on the role of the director of a magic university in a heroic fantasy world. Build your school, manage your budget, recruit teachers. Will you make it a high place of black magic, with the best teachers of necromancy and demonology? Or a school in harmony with nature to train druids and shamans? Or why not train adventurous mages, offering them options to learn how to fight and be discreet? But this will require surviving the ruthless attacks of the orc tribes and the controls of the education authorities.Main FeaturesBuild your university with a mechanism of magic decks. Each game will be different.\nManage the well-being of your students by building refectories, dormitories, rest rooms... and ensure their discipline with a dungeon.\nCustomize your rooms with powerful artifacts such as Xar'Saroth's raclette machine or the Soul Devouring Bed.\nTame legendary creatures: dragons, fauns, pegasus, janitors...\nPush your students towards a glorious future. At the end of their course, you discover their future (necromancer, archimage, peasant...) according to the success of their training, and win new bonuses.\nSelect your students: traits, personality, alignment, wealth... each decision will have its consequences.\nEscape the armies of darkness by building your university in isolated environments: lake, mountain, desert, volcano, giant turtle back, etc....\nCollect powerful grimoires to strengthen your university and to confront increasingly hostile environments during a procedural campaign.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sneaky Yak Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":35985,"name":"Silent Hill 4: The Room","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/333/333f5154f79c2e798869ae1ec7623baf.jpg","description":"A room full of nightmares….\nHenry Townshend finds himself trapped in his apartment and the only escape is through a mysterious portal that leads to a horrifying alternate reality. With gruesome sights around every corner and his sanity being tested, he must find his way out of this nightmare. Enter The Room, a thrilling story in the most terrifying game series of all time.\n\nA riveting Silent Hill adventure with shocking plot twists\nFend off new monsters, including ghosts that defy physical reality.\nVisual transitions between 1st and 3rd person gameplay modes - the first in the series.\nExplore new environments, including an otherworldly forest and grisly prison.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Team Silent","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":16404,"name":"Boid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47a/47a6894f677502f6b9446879286f2783.jpg","description":"Boid is real-time strategy at its most primal. No funds to manage or infrastructures to build. It’s a kill or be killed battle of rapid decisions to dominate the gene pool.\nKepler 42-C. A faraway planet of little significance. At least, it was until a malfunctioning drone crashed into its ocean, forever altering the course of life and inciting a battle to claim the planet, one microorganism at a time.\nClaim vital positions to replicate and mutate into seven specialized units, such as the fast and vulnerable Scout, the explosive Kamikaze, and the life-draining Leach. Press your enemies for weaknesses, outflank their ambushes, usurp their bases, and amass an unstoppable swarm to overpower your adversaries.\nThis is more than a battle for your survival. It’s a fight for all life to come.\nFight to claim the planet in an 10-hour, single-player campaign\nAvailable as DLC, the single-player campaign takes you on a journey to claim the planet and teaches you everything you need to succeed in multiplayer. Only the single player campaign is paid in BOID - everything else is free.\nCreate the perfect skirmish with bots and four difficulty levels.\nBots allow for easy practice in multiplayer matches.\nGo online with ranked, unranked, and private 1v1 matches.\nFeaturing a full-on league system\nThe more you play, the more your list of Friends & Rivals grows.\nBOID keeps track of your opponents for easy challenging\nCreate custom maps to share, and subscribe to your favorite creators.\nA fully functional level editor allows you to create your own multiplayer maps\nColor blind mode for heightened game accessibility.\nSuper easy to pick up gameplay, no base building to worry about - it's all about mutation and classes\nRock paper scissors style class system. Do you go for the heavy/strong/slow units or for the fast/weak/rush ones?\nTwitch Integration for multiplayer matches","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mokus","platforms":[{"id":0,"name":"PC"}]},{"id":12140,"name":"The Count Lucanor","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53c/53c5de0a5d4f6342c9bfb2bc71c29937.jpg","description":"Join Hans in a fantasy world and experience a unique adventure, full of surprises and challenges. Get hooked on an immersive tale, where every decision counts and every clue is a piece to solve the puzzle and get the treasure. Unravel the sordid secrets of the castle, meet colorful characters, and remember: horror always lurks beneath the surface.\nWith a retro, halfway-between-8-and-16-bit style and inspired by classic games like The Legend of Zelda, Yume Nikki, Silent Hill or Dark Souls, among others, The Count Lucanor is an amazing mystery and horror adventure set in a fairytale world. The game features important choices, alternative endings, secrets and different ways to solve puzzles. The title is in development for PC, Mac and Linux.\nExploration: Walk the Tenebre Castle and place candles on the ground to light up your path.\nConversation: Talk to NPCs to get important clues and unravel the mystery of the Count Lucanor.\nChoices: Your actions change the course of story, with five different endings and several subplots.\nStealth: Hide under tables and behind curtains to go undetected.\nPuzzles: Use the items you found wisely in order to progress.\nSkill: Avoid traps and enemies in the castle by anticipating them.\nOnce upon a time, there was a poor boy named Hans who lived with his mother near the woods. On his birthday, the boy had no presents nor sweets. He got so upset he decided to leave home for good. Before he left, his mother gave him his grandfather's cane, some cheese and three pieces of gold. Hans walked into the forest in search of adventure. Soon it was night and the boy was really scared, so he tried to go back. But then, a quaint kobold happened to cross his path and Hans decided to follow him to a castle. The kobold told him he would inherit great wealth if he passed a simple trial... guessing his name. Trapped in the castle, Hans will live a spooky mystery, fantasy and horror adventure to become the new Count Lucanor.\nWe’ve hired the greatest composer of all time - Johann Sebastian Bach - to create a soundtrack that will remain etched in your mind forever. Using chiptune tools, we’ve transformed a series of hidden gems of the author to create unique soundscapes for our tale.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":366865,"name":"Orcs Must Die! 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b7/9b7cef5245bdfe624dd222051ff58121.jpg","description":"Orcs Must Die! 3 ushers orc-slaying mayhem to a previously unimaginable scale. All new War Scenarios pit players and their friends against the largest orc armies ever assembled. Mountable War Machines give players the essential firepower to heave, stab, carbonize, and disarticulate the abominable intruders. Orcs Must Die! 3 is the long-awaited successor to the award-winning series.\nWar Scenarios\nAll new War Scenarios deliver on the promise of massive scale first set out in Orcs Must Die. Confront overwhelming armies of orcs on the battlefields surrounding the castles. Thin out waves of orcs hundreds strong before they breach the walls and crash your rift.  \nWar Machines\nYou’re going to need new weapons of death and destruction to handle these hordes. War Machines are traps on an oversized scale. Lay down your mega flip trap and launch dozens of ragdolling orcs. Mount your mega boom barrel launcher and unleash pyrotechnic glory.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Robot Entertainment","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":332787,"name":"Somerville","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4fa/4fa26d7d2a9bd1deed199291668690a3.jpg","description":"A sci-fi action adventure that chronicles the lives of key individuals in the wake of a global catastrophe.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Jumpship","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":28571,"name":"Portal: Still Alive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/865/865723b492b3a79f1f8074ff57e53b32.jpg","description":"Winner of over 30 ‘Game of the Year’ awards, ‘Portal’ now comes to the Xbox LIVE Arcade! As unwilling test subjects in a sinister laboratory, players must break the laws of physics using ‘portal’ technology to solve puzzles and survive. Unlock the full game to experience the complete singleplayer story, gain access to all 14 new bonus maps, and get a glimpse behind the scenes with developer commentary!\n\nPortal: Still Alive is available for PC here: https://www.moddb.com/mods/portal-still-alive-pc","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":38542,"name":"Sam & Max: Episode 205 - What's New, Beelzebub?","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d3/0d362085753275dc706a318003c3e79b.jpg","description":"Sam & Max 205 is an adventure game, which is the last episode of the season two of this game series. \n\n###Plot \nThe story begins right after the events of the previous episode. In this episode, Sam and Max find out that their neighbors have disappeared.\nAll of them are in Hell now, so they are suffering in the netherworld’s boilers. They have to return everyone. In particular, they have to bargain for the soul of Bosco, the paranoid owner of technical equipment store. Sam and Max use the Maimtron 9000, the robot, appeared in a few series before, to get a unique token, which gives them an opportunity to enter the Hell gates. However, it is the most natural part of the task. Then Sam and Max need to find out the location of Bosco’s soul by themselves since Satan and his servant Jurgen are ignoring them. \n\n###Gameplay \nThere are several stories, following each other. All these little episodes are connected with the main task – going down to Hell. The game is focused on dialogues, so for completing rescuing mission, the player has to find necessary information through communication. As usual, at the end of the game, you are expected to engage in a boss fight. Overall, the gameplay is not very complicated, because there you can act intuitively and there is a hint system, which is built in.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":31759,"name":"Tomb Raider","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/44f/44f1fd0d156a5a6ee47ec00b90441b15.jpg","description":"Take control of the most famous woman in gaming, in Lara’s original adventure that started it all. Explore massive prehistoric worlds, fight savage beasts and outwit rival treasure hunters. Fraught with intrigue, excitement and danger, Lara’s adventure takes her from the ancient ruins of the Incans to the lost city of Atlantis in search of the mysterious Scion.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Core Design","platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation"}]},{"id":22092,"name":"Party Hard 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/15f/15ff2ce4c6007591b59ef2a7724c88e3.jpg","description":"You don't get your Christmas bonus and the only logical thing to do is go on a rampage at an Office Holiday Party. Welcome to Party Hard 2, the Stealth Strategy game you've been waiting for! With a brand new engine and art-style, Party Hard 2 expands Hitman-style gameplay of the original game with brand new features.\nSome of the upcoming new gameplay features:\nTake out multiple targets at the same time with a powerful Multi-Kill ability\nScan the room for useful objects and targets with Party Vision\nYou can now pickup up to 3 extra items in your inventory. Why not light up the dance floor with a gas canister?\nThe game is currently in Alpha 1 stage, follow the game's development right here, click that FOLLOW button under the trailer!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Pinokl Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":856178,"name":"Call of Duty: Modern Warfare II - Open Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae0/ae0bb3c16d0660acb18b197d5856baf8.jpg","description":"Pre-order Call of Duty®: Modern Warfare® II and get Open Beta Early Access beginning Sept. 22nd*.\n- Early Access is September 22nd - 23rd on Steam*\n- Open Beta access is available for all Steam players from September 24th - 26th*\nJoin the Modern Warfare® II Open Beta and get hands-on experience with the signature Multiplayer combat coming to Call of Duty®: Modern Warfare® II.\nInfinity Ward is bringing fans state-of-the-art gameplay, with all-new gun handling, advanced AI system, a new Gunsmith and a suite of other gameplay and graphical innovations that elevate the franchise to new heights.\nAdditionally, the Red Team 141 Operator Bundle and FJX Cinder Weapon Vault** will be available to all Vault Edition owners during the Beta.\nModern Warfare® II will launch October 28th with a globe-trotting single-player campaign, immersive Multiplayer combat and an evolved Special Ops game mode featuring tactical co-op gameplay.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"}]},{"id":552923,"name":"Total War: WARHAMMER III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fc/0fcb485572f6074c611521984a033a5c.jpg","description":"Far beyond the world and its petty wars there exists a dimension of pure, malevolent magic: The Realm of Chaos. It is a terrible place, incomprehensible to the mortal mind. It whispers promises of power, but to behold it is to be seduced by it. To relinquish your soul to it. To become it.\r\n\r\nThe four Ruinous Powers rule over this place, ever seeking to slip their bonds and engulf the world in a tide of daemonic corruption. Nurgle, the plague god; Slaanesh, the lord of excess; Tzeentch, the changer of ways; and Khorne, the god of blood and slaughter.\r\n\r\nOn the border between the worlds, two mighty kingdoms stand sentinel: the stern warriors of Kislev and the vast empire of Grand Cathay. But each is beset by its own trials, and now both have cause to cross the threshold and send their armies into the Realm of Chaos.\r\n\r\nThe world stands on a precipice. A single push will plunge it into cataclysm.\r\n\r\nAnd there is one who schemes to achieve just that, an ancient figure who desires nothing less than to wield supreme power. But to succeed, he will need a champion…\r\n\r\nThe coming conflict will engulf all. Will you conquer your daemons? Or command them?","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Creative Assembly","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":51124,"name":"Distraint 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1e/d1e3f590e3ea1b79db7f93c0444a4438.jpg","description":"THE GAME\nDISTRAINT 2 is an upcoming 2D psychological horror adventure game for PC.\nYou are Price, a man who sold his humanity to get a partnership from a leading company: McDade, Bruton & Moore.\nDISTRAINT 2 follows the events of the first game. It's a sinister tale about restoring hope and finding your purpose.\nFEATURES\nDISTRAINT 2 has a dark story but also has its share of dark humor.\nThe gameplay is simple but effective: You move left and right, collect items and solve puzzles to progress through the engaging story.\nSide-scrolling 2D with unique, hand drawn graphics\nCarefully composed music specifically for each situation of the game\nAtmospheric sound design\nMinimalist yet efficient interface so the focus stays intact\nDelve into a complex story full of intriguing twists and characters\nHand made in Finland, no asset flips or cheap tricks! :)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Jesse Makkonen","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2532,"name":"ARCADE GAME SERIES: PAC-MAN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c5/1c59d4da43874ed344592e3c7482c6e6.jpg","description":"First appearing in arcades in 1980, the masterpiece PAC-MAN finally comes to Steam!\nMove PAC-MAN up, down, left, and right to eat all the Pac-Dots, while avoiding the ghosts, to advance to the next stage.\nEat a Power Pellet to turn the tables on the ghosts and rack up a huge score!\nWith simple rules but deep gameplay, it's easy to see why the adorable PAC-MAN took the world by storm!\nPAC-MAN was awarded the Guinness World Record in 2005 for being the most successful coin-operated arcade machine in history.\nThis latest port comes with scanline and sound settings, and the option to play with the Round 256 bug - perfect for PAC-MANiacs!\nExperience the masterpiece that charmed the planet!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":427780,"name":"Cepheus Protocol","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f4/1f432bbd1b14a0b2f807571ab8daded8.jpg","description":"Join our community on Discord!\nAbout the Game\nA mysterious virus of alien origin is sweeping through San Francisco. It is up to the Center for Epidemic Research and Control (CERC) to track down and find Patient Zero before it is forced to enact the Cepheus Protocol. Command your squad, save civilians, and stop the Pangu Virus before it is too late.\nMain Objectives:\nTrain and level a single squad of up to 8 members as you search the city for Patient Zero.\nBuild, train defenders, and safeguard your base from the Pangu Virus’ victims.\nManage your squad as you attempt to control the spread of the virus.\nStrategy:\nTake command of Captain Adrian Winter as she leads an 8-member squad of elite soldiers as you attempt to stop the Pangu Virus from spreading beyond containment.\nChoose how to spend your in-game money on important upgrading to your barracks, improving weapons, or buying new soldiers to fill your ranks. You earn in-game money by completing main and side missions, and eliminating the infected.\nCollect viral samples to better improve your squads’ abilities and expand your understanding of the virus before it is too late.\nEvery life matters and every soldier counts. If Captain Winter dies, it’s game over. Decide whether to leave her at the base or use her advanced skill-set to even the odds while in the field.\nPangu MeteoriteIn the farthest reaches of the frozen Antarctic ice shelve, Chinese researchers discovered a 4.8 billion-year-old meteorite that had microscopic alien organisms deep within the rock. Decades later, after a Special Forces raid to retrieve a sample of the virus that had been cultivated from the discovery, Chelsey Trader is accidentally exposed to the Pangu Virus.\nBecoming Patient Zero, inadvertently, she spread the virus, which infects innocent civilians which are mutated into monstrous beings under her control.\nBuild and Defend Your BaseBuilding: At the onset of the game, you’ll be able to build a base comprised of specialized buildings where new soldiers can be trained and research on the Pangu Virus can be conducted.\nDefenses: As the threat from the virus grows, your base is at constant risk of being overwhelmed as random and planned encounters with the infected threaten to overrun your only means to find a way to stop the outbreak.\nPatrolling: As the infection grows, more and more parts of the city fall to the Pangu Virus. You must send out patrols to each section of the world and destroy toxic gas towers that spread the virus at an alarming rate.\nInfection SystemThe Pangu virus grows stronger by the minute. Complete missions and destroy infection pods throughout the map to lower its spreading rate. Be warned, each soldier under your command is equally at risk of becoming infected.\nTactics on the Battlefield - Combat FeaturesCommand Captain Winter as your powerful hero character.\nTrain soldiers across various disciplines. These include assault, heavy weapons, Spec-Ops, sniper, scientist, and medical.\nUse tactical awareness to slow downtime and get out of sticky situations!\nUse different squad formations to give you a tactical edge over the infected.\nUse different team dynamics by utilizing specialized units in conjunction with their counterparts for maxim effect.\nYou’ll have access to other tools such as carpet bombs, ammo drops, and more!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Halcyon Winds","platforms":[{"id":0,"name":"PC"}]},{"id":21538,"name":"Broadsword: Age of Chivalry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ce/1ce1971099475f3cd1961d7860682562.jpg","description":"Broadsword: Age of Chivalry boasts turn-based strategy gameplay as players move from mission to mission in the Middle Ages.  Command one of four different armies: the English, The French, the Spanish, or the Hapsburgs in this exciting PC game.  Lead different types of units into battle -- from archers, knights, pikemen and catapults with special units per nationality.  Control special 'heroes' units such as Henry III, Joan of Arc and El Cid, among others whose special 'hero' powers can affect the entire battlefield. Set in medieval Europe.  The game features four playable factions, a single player campaign, strategic gameplay, asynchronous multiplayer matches, and cinematic battle sequences.Game Feature Overview\nCampaign 1.  Learn the basics of war and help Joan of Arc drive out the English from her homelands.\nCampaign 2.  Join King Edward III in his campaign against King Philip VI to reclaim the lands that are his by birth right.\nMultiplayer.  The game will feature asynchronous gameplay, e.g. Words With Friends Turn-Based multiplayer.\nFactions.  The game will feature four playable factions (French, English, German, and Spanish).\nWatch your troops fight boldly in full 3D Battle Action!\nTake control of special ‘Hero’ units like Henry III, Joan of Arc, El Cid and others who command special ‘hero’ powers affecting the entire battlefield.\nCommand different types of units from archers, knights to pikemen, catapults and more.\nOptional features such as FOG of WAR, Graphic Detail and more.\nThe player will undertake a chain of missions in the 1st Campaign, that follow Joan of Arc as she liberates France from the English. The campaign also functions as introduction/tutorial to teach new players the game features in the most engaging way. It will begin with the Siege of Orleans and continue through to the Battle of Patay. The second campaign follows King Edward III in his campaign against King Philip VI to reclaim the lands that are his by birth right.Plan your Strategy\nPlay on a variety of maps in distinct weather conditions.\nTerrain has a direct effect on the players’ strategy and combat.\nTurn-based combat keeps the battle moving at the player-preferred pace.\nPlayers construct & upgrade buildings like town centres, mines, mills, and farms to raise units and create resources for their empires!\nPlayers research different technologies like Forestry, ballistics, husbandry and more to take their empire into the next tech level.\nCombat Advisor provides an indication of how the battle might go.Additional Features\nOriginal music from German film composer Jan Morganstern.Multiplayer\nPlayers are able to challenge another human opponent to a match.  It will start with a person picking their faction and then choosing a map.  Once each player has a faction and map has been chosen, the players will enter the game.  Since it is asynchronous, each player will take their turn, moving units and capturing points.Game Mechanics\nMap. The map is a 3D model, where each of the borders of the hexes are on the same plane, at y=0.   The size of the map is between 20-30 hexes wide and 20-30 hexes deep.\nCapital city. Each player begins each match with a capital city.  A player wins by capturing his opponent’s capital and loses if the opponent captures theirs.  The capital city performs several functions: It provides resource each turn, it’s the only place where players can build troops (if they have the correct buildings unlocked), and it contributes to the amount of troops a player can field.\nCapital city upgrades.  A player’s capital begins the game as a town square.  If the player has the necessary resources it can be upgraded to a castle, and then a stronghold. Each upgrade increases resource income, defense, and supply limit.\nResources.  Players must collect resources in order to build units and fortifications.\nGold.  Gold is spent to construct units.\nWood.  Wood is spent to construct buildings and fortifications.\nFood.  Food determines the amounts of units a player can field.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hoplite Research","platforms":[{"id":0,"name":"PC"}]},{"id":21151,"name":"Retention","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50c/50c7a27b4628b5e451462fe0abc9552f.jpg","description":"Don't miss our new games!http://store.steampowered.com/app/448470/\nhttp://store.steampowered.com/app/415960/\nAbout the GameThis game is about a person who kept running through his life, never looking back at the past. He rarely slept, and even with 24 hours in a day, it was not enough for him.\nOnce during a trip, he gets into trouble. Now he's lying on the cold ground, buried beneath his bicycle.\nSlides of various moments fly through his head.\nWill his memories return? Will he be able to stand up again?\nYou must help him.\nFeatures:\n- Opportunity to tell a man by his memories\n- Unique game genre \"Game-Photo album\"\n- User-friendly interface\n- 8 different endings (4 good / 4 bad)\n- Original soundtrack included\n- STEAM Trading Cards support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sometimes You","platforms":[{"id":0,"name":"PC"}]},{"id":18632,"name":"Police Quest Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c3/2c386be0aa57529827896190422110af.jpg","description":"Investigating what seems to be a simple car crash, rookie cop Sonny Bonds uncovers a homicide.  In PURSUIT OF THE DEATH ANGEL, Bonds must track down murderous drug lord Jessie Bains before he strikes again.\nIt isn't long after Sonny Bonds is promoted to the homicide department that Jessie Bains escapes from prison seeking revenge on everyone who put him behind bars.  Bonds must protect not only his own life, but his girlfriend Marie from THE VENGEANCE OF BAINS.\nWith vicious cult killings, a raving madman, and a new drug regime threatening Lytton, Bonds is faced with his greatest fear: his wife Marie is stabbed and lays in a coma.  Will Bonds be able to keep his cool and solve the brutal mysteries of THE KINDRED?\nThe action moves to Los Angeles, where Detective John Carey must find the link between the murder of his partner and a string of mutilation murders.  It's OPEN SEASON when a serial killer is one step ahead of the investigation.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":17095,"name":"Retro Game Crunch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/362/3624537cf8fd13820ed3d384060b8153.jpg","description":"Retro Game Crunch is a series of 7 games, full of the charm and challenge of the 8-bit generation. Each world feels like an authentic NES classic. This genre-spanning collection includes...\nSuper Clew Land – Eat, evolve, and explore in this happy-go-lucky exploration-based platformer.\nEnd of Line – A game about learning how to die. Figure out how to thwart autonomous repair bots in this puzzle adventure.\nGAIAttack – Gaia has summoned four champions to rise up and destroy the pillaging Sky Pirates. A beat 'em up platformer for up to four players.\nParadox Lost – Abby crashes her plane, but stumbles upon a gun that shoots time travel! A metroidvania across three time periods.\nWub-Wub Wescue – A pug must brave the jungle and navigate its treacherous rhythms, all to rescue his master. An early 80’s arcade platformer.\nBrains & Hearts – A two player card game that takes place inside Albert Einstein's dream. Play against the CPU or a friend.\nShūten – A samurai shoot 'em up for one or two players. Owari’s village is trampled as ancient gods awaken. He takes up sword to end them.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rusty Moyher","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17012,"name":"Lucius II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3b/f3b177ac7f7438e9b60fd6b6783077f0.jpg","description":"The story of Lucius II continues where the original left off: Lucius emerges as the lone survivor of the burning wreckage his parents once called home, unscathed from the ruthless slaughter he had unleashed.\nHe had taken the weak and punished the wicked. He had looked through their souls and found the true selves they had been hiding.\nLucius is taken to the psychiatric ward of St. Benedict’s Hospital by unsuspecting caretakers. The Book of  Revelation predicts the birth of a child that would end up ruling the world with an iron rod. The first part of this prophecy has been fulfilled. It is time to take care of the rest. Whispers of a prophecy find their way to the boy's ears. Lucius decides to act again to regain his powers. But little does he know of his new adversaries...\nGame features:\nLucius II has a unique twist where you play the bad guy and wreak havoc as the son of the devil.\n3D Splatter adventure sandbox that continues the story of the original game.\nOver 100 potential victims.\nLucius can now explore a vast five storey hospital and the small town of Ludlow.\nHomage to the classic horror movies. You can find references to different titles all over the game.\nCreate your truly own unique traps by using a complex combination system and various tools.\nEach level is its own sandbox where you can decide when, how and who to kill.\nCreate your own unique Lucius by choosing your favorite supernatural abilities.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shiver Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4409,"name":"Zuma","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/593/5936a7fb9b53cd38341957cbf03be625.jpg","description":"Survive the ancient temples of Zuma, the critically acclaimed action-puzzler from PopCap! Deep in the jungle lie hidden temples bursting with traps and trickery, and it's up to you to uncover their treasures. Fire magical balls from your stone frog idol to make matches of three or more and clear the deadly chain before it reaches the golden skull.\nExplore all the temples — if you're good, you’ll rack up huge combos and special bonuses that'll help you on your way. But think fast and aim smart, or you'll be history in this action-packed puzzle challenge!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":28075,"name":"Cooking Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a85/a85692b735a17d9b5996ac393924b5a9.jpg","description":"Experience the world of restaurant cooking in a highly polished, realistic kitchen. Use ovens, gas stands, pots, pans, bowls and plates, everything you need in a kitchen. Prepare dozens of lifelike ingredients - from vegetables through fish to steaks and poultry - to cook over thirty real dishes - or anything you like.\nThis is your kitchen. You can do anything here. If you really don't want to, you don't even have to cook anything. Throw kitchen knives like darts. Set fire to cardboard boxes, cook a steak on them, and then save the day with a fire extinguisher. Build a tower out of pots and trays. Everything with real-life physics.\nHowever, if you'd rather be a cook, the same physics engine gives you unlimited opportunities. Cut some vegetables, put them in a pot and boil. Use a blender to make a soup. Bake a fish fillet, but remember not to burn it! See your ingredients transform with temperature. The kitchen experience awaits!\nSubtly modify your dishes according to your clients' whims. Use different spices to make them love your cooking, and they will write you a unique review you will not forget!\nDeliver fine dishes and unlock new, more refined recipes as your fame grows. Acquire social media reviews, Michelin stars and rise through the ranks of the greatest cooks - but beware! The Mystery Client awaits, and if you fail to please him, much of your hard work will be lost.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Wastelands Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]}]