[{"id":1169,"name":"Mafia III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a34/a348e613424260bc7e034fb6031c762e.jpg","description":"Mafia III is an action-adventure game that follows the story of Lincoln Clay, a veteran who is seeking revenge for his killed relatives in the city of New Bordeaux. He creates a criminal syndicate to defeat the Italian mob responsible for the death of Clay’s family. While the game is the third part of the Mafia series, it represents a completely new story and characters, not connected to the previous titles.\nThe core gameplay of Mafia III is gunplay with a cover system. The game provides a wide variety of weaponry to choose from; you can also call allies to help you. However, if you’re not fond of shooter mechanics, you’re allowed to use melee combat or stealth tactics to complete missions. Another feature is interrogating NPCs to get more information.\nThe game is set in an open world where you can move on foot or use vehicles. A great part of the game includes driving with realistic mechanics and sounds. There’s also a system of the governmental response to the crimes you commit that affects the playthrough.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Aspyr Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":7819,"name":"SUPERHOT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad4/ad445a12ee46543d4d117f3893041ebf.jpg","description":"SUPERHOT is an artistically minimalistic first-person shooter. The key feature of the project is its time mechanics. If you don’t move the action slows down so you can think over your next steps. This feature brings together shooters and strategies, making SUPERHOT a mix of these genres.\nThe story follows the concept of a \"game inside a game.\" It starts with your friend who sends you a game you definitely need to try. But the further you go, the more you realize there's somebody except you in the game, who wants you to stop playing. So you progress through similar levels killing enemies and trying to figure out what's happening. \nBesides original time mechanics, the game makes you quite vulnerable: a single enemy shot kills you making start the level again. At the same time your weaponry is limited, so to survive you need to pick enemies' guns and ammo or use melee combat. Additional to the campaign mode, there's the endless one and the challenge to make levels more difficult.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SUPERHOT Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":1959,"name":"Goat Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a44/a444a7628bdb49b24d06a7672f805814.jpg","description":"Goat Simulator is a game that mainly can be described as a crazy one. It does not have a specific story, and there is no central villain. It is illogical, besides there are lots of bugs. But playing in it, you catch unbridled pleasure, looking at how the goat is trying to destroy everything around, using a great variety of funny and unforgettable tricks, what makes the game curious, but very rich.\r\n\r\n\r\nYou play as a goat, whose purpose is to cause the highest damage to the world. Destroy the gas station, the car, the cottage in the vastness of the whole of the suburban district, but do it with style and taste, for example, do a backflip, and at the same time, chuck the basket so it will fly out of the window. Thus, after every perfect and crazy action, you will be rewarded with some points and bonuses!\r\n\r\nAlso, you could use the Steam Workshop and create your goats, levels, missions, and more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Eleven","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":29338,"name":"Days Gone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a79/a79d2fc90c4dbf07a8580b19600fd61d.jpg","description":"Days Gone is an open-world action-adventure game set in a harsh wilderness two years after a devastating global pandemic. Play as Deacon St. John, a drifter and bounty hunter who rides the broken road, fighting to survive while searching for a reason to live. \n\nHarsh Open World: Using the power of PlayStation 4 and Unreal Engine 4, Days Gone offers an incredibly realistic and detailed open-world experience. Immerse yourself in vast and hostile environments, and explore their secrets. Search abandoned vehicles, houses, truck stops and towns as you scavenge for resources. But be careful— day and night cycles, along with dynamic weather systems, all affect gameplay and enemy behaviour. \n\nBrutal Sandbox Combat: Perfect your gameplay with an endless combination of strategy and play in every situation. Craft customized items using pieces and parts found in the field, from brutal melee weapons to traps and more. Act wisely, as every choice can be the difference between life and death.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bend Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":42187,"name":"The Sims 4","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e44/e445335e611b4ccf03af71fffcbd30a4.jpg","description":"Enjoy the power to create and control people in a virtual world where there are no rules.\r\n\r\nExpress your creativity as you customize your Sims’ appearances and personalities, and build them the perfect homes. Develop your Sims’ relationships, pursue careers, and explore vibrant new worlds.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":3842,"name":"Battlefield 4","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ac7/ac7b8327343da12c971cfc418f390a11.jpg","description":"The game allows you to gain experience of everything that can happen with the soldiers of the special forces during the most diverse missions. A full arsenal of modern weapons, from dozens of models of knives, small and heavier guns, from boats and helicopters to tanks and warships - all this is either at the player's disposal or meets him during missions. On land and sea, in the city and in the air. The game responds to everyone and everything. Weather - rain and wind change everything, as in life. The wet foliage behaves differently than the dry, gusts of the wind act on everything in the entire space of the map, the shower makes the air less transparent, thickens the darkness. Water is not just a surface, but water, with waves that you swing - in multiplayer, these waves are for everyone, their behavior is calculated exactly as the real waves would behave, players feel them precisely with the same difference for their position, as if they were in the actual sea, on the same wavelength, but in different places. Seven missions, five additions, three variants of the ending. The ability to see the gameplay through the eyes of any of the players, above the entire card, in a third-person mode and in the \"Free Cam\" mode. Multiple multiplayer modes, classes and game factions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":42,"name":"What Remains of Edith Finch","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/34e/34e100b1f648de99f32d477065f04653.jpg","description":"The Finch's family, also known as \"America's most unfortunate family\", believes that the family is being pursued by a deadly curse. Each generation has only one child who survived to give birth to the next one.\n\nThe player begins to act as Edith Finch, who arrives in an orderly abandoned family mansion to find out what opens the key that she received from her mother along with the will. Of course, she is most interested in the question of the family curse, or more precisely, whether she will become a victim of it. In any case, all the relatives known to her, even on American soil, died an unnatural death. Exploring the house, she opens the rooms of each deceased relative. And plunges into the circumstances of premature death of everyone.\n\nLife (and death) of each of the deceased relatives Edith the hero resides in the image of this relative.\nThe essence of the game is to clarify the circumstances of the death of many members of the same family in order to see behind these deaths and biographies something common and native. It is interesting to dive not only in different human images, but also act in the guise of birds or animals.\nIn addition to following Edith, the game has something to inspect, search, discover and solve, play mini-games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Annapurna Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":5703,"name":"Uncharted 3: Drake's Deception","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/589/589fc47c5ae34160d65c4682e21fed66.jpg","description":"The game develops a setting common to the entire Uncharted series. Game played from a third-person perspective, with the player in control of Nathan \"Nate\" Drake. This is a person passionately carried away by historical riddles, promising a reward in the form of hidden treasures.\r\nDrake can run with acceleration, make jumps, swim, climb up. Sometimes he demonstrates something completely acrobatic. For confrontation with opponents, he uses the art of hand-to-hand combat with a variety of attacks, including a battle with several opponents simultaneously. He also has a surprise concerning dealing with firearms. Weapons and ammunition he picks up from the defeated opponents.\r\nFrom time to time, further movement in the game requires the hero to find solutions to puzzles, using his diary and the hints of the game itself.\r\nNathan with his mentor Victor Sullivan travels in search of the lost city. List of locations includes the streets of London, cities and deserts on the Middle East, a château in France etc.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":19365,"name":"Homefront","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/657/657574cd437df9102f511b3be095b0ea.jpg","description":"Homefront is a first-person shooter, set shortly. The game takes place in North America, as the United States are blown apart by a fearsome enemy.\r\nThe protagonist is a former US pilot, caught in the middle of the chaos that erupted in his country. Parts of the states are occupied, and police are rampaging in the streets, confronted by American rebels. The main mechanics of the game are shared with most of the linear shooters of the time, but the setting of the story adds a new flavor to the well-known system. The most prominent feature is combat and weapons, as the developers tried to make them as realistic as possible, allowing players to experience the hardships of modern rebels fully.\r\nHomefront features a multiplayer mode, where players can engage in fierce battles, arming themselves with various weapons and using different vehicles, ranging from AFVs to helicopters, to gain an extra edge over the enemy.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Digital Extremes","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":3892,"name":"Sniper Elite V2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/03d/03d17d237f9541b67a13f9425ced4ca4.jpg","description":"Sniper Elite V2 is a third-person tactical shooter, the second installment in Sniper Elite series and a full-fledged remake of the first game. The game takes place during the Battle of Berlin in 1945. You play as an American military officer and skilled sniper Karl Fairburne on his mission to neutralize German scientists involved in the development of V-2 ballistic missile.  \nThe gameplay encourages the player to kill enemies from a distance, without being noticed. Karl can have numerous different weapons, including machine guns, pistols, traps and others. However, his primary weapon is his sniper rifle. Developers intended to make shooting sniper rifle more realistic than in other games. Several elements affect shots such as the wind direction, bullet drop, and so on.  \nOne the game’s key features is “X-Ray Kill Cam.” It activates when the player makes the skillful shot and shows the bullet trajectory, an impact it made on the enemy’s body and the damage that its organs took.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Rebellion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":21924,"name":"Call of Duty: WWII","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e5/1e5e33b88be978f451196a751424a72e.jpg","description":"Digital Deluxe Edition\nThe Call of Duty®: WWII Digital Deluxe edition includes the Call of Duty®: WWII Season Pass**** and 1,100 Call of Duty®: WWII Points*. Season Pass includes Carentan Bonus Map!\nPre-Purchase Offer\nAbout the Game\nIncludes Digital Edition Bonus Content: 1,100 Call of Duty Points*\nPRE-ORDER AND GET:\n- Multiplayer Upgrade (Weapon Unlock + 2XP)**\n- Zombies Camo***\n- Divisions Pack\nCall of Duty® returns to its roots with Call of Duty®: WWII - a breathtaking experience that redefines World War II for a new gaming generation. Land in Normandy on D-Day and battle across Europe through iconic locations in history’s most monumental war. Experience classic Call of Duty combat, the bonds of camaraderie, and the unforgiving nature of war against a global power throwing the world into tyranny.\nCall of Duty®: WWII creates the definitive World War II next generation experience across three different game modes: Campaign, Multiplayer, and Co-Operative. Featuring stunning visuals, the Campaign transports players to the European theater as they engage in an all-new Call of Duty® story set in iconic World War II battles. Multiplayer marks a return to original, boots-on-the ground Call of Duty gameplay. Authentic weapons and traditional run-and-gun action immerse you in a vast array of World War II-themed locations. The Co-Operative mode unleashes a new and original story in a standalone game experience full of unexpected, adrenaline-pumping moments.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sledgehammer Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":1774,"name":"Grim Fandango Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df2/df20fd77db56ae7b0a26a7ff4baa9ccc.jpg","description":"Grim Fandango Remastered is a rebuilt version of the original 1998 adventure game Grim Fandango. The game is set in the Land of the Dead, which is a unique in-between world on the souls’ way from the mortal world to the spiritual one. All the in-game characters appear in calaca-like style, so the whole atmosphere reminds of the Aztec belief of the afterlife. Players assume the role of a Grim Reaper Manuel “Manny” Calavera, who escorts souls on their travel through the Land of Dead. The story progress depends on the completion of quests and solving various puzzles. Players, in control of Manny, are able to interact with the environment in different ways including dialogues with other characters in order to get some hints and tips about current puzzles. According to game mechanics, players can never fail a mission or the whole game. The Remastered version includes numerous graphical improvements including repainted, hi-res character textures and new, dynamic lighting, which are expected to improve player experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":5159,"name":"Resident Evil 2 (1998)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d64/d646810b629081cc12aec49ed9f49441.jpg","description":"If the suspense doesn't kill you, something else will! Something is desperately wrong in Raccoon City. A muta-genic virus has broken loose and the entire town is infested. Blood-thirsty zombies, hideous mutations now overwhelm the community. When Leon and Claire arrive in town, their nightmare is just beginning...Now, you control their destiny in this survival horror classic.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Capcom","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"GameCube"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":3408,"name":"Hotline Miami 2: Wrong Number","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/003/0031c0067559d41df19cf98ad87e02aa.jpg","description":"Hotline Miami 2: Wrong number is a sequel to Hotline Miami.\n\n1985. There is a Cold war between the Soviet Union and the USA, which gradually turns into a hot war. In Hawaii, there are military operations. In the centre of the event, the squad \"Ghost Wolves\", which includes Dan Smith named \"Beard\", Jacket (the main character of the first part), and two soldiers. The United States, for this moment, are losing. The squad was ordered to capture the most dangerous Soviet zone.\n\nAs for the gameplay, a lot of details are borrowed from the first part, but unlike it, in the Wrong Number, there were levels of difficulty (classic and hard). The difficulty level unlocks after beating the game on classic difficulty. The difference is that all the levels are turned over, and contain more dangerous opponents.\n\nThe game has 13 playable characters. Each of them has their vision of the story, like Jacket and Biker in the original game. Masks from the first part appeared in the game again, and new masks that are giving new abilities were also added.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":624,"name":"FTL: Faster Than Light","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f4/5f4780690dbf04900cbac5f05b9305f3.jpg","description":"FTL: Faster Than Light is a roguelike strategy game set in space civil war in the Galactic Federation. You control a spaceship that has to deliver an essential package of data to the Federation headquarters. This data can help defeat the rebel’s army and finish the war. To do so, you have to travel through eight procedurally generated space segments. Within those segments, the player can encounter other ships and NPCs both friendly and hostile as well as random events.  \nThe gameplay’s key feature is that the player does not control the spaceship itself but rather the ship’s crew. During the game, the player can hire or rescue new crew members from different races. Each team member has its characteristics that affect how well he can handle different systems on the ship or his movement speed and fighting skills.  \nThe game is notable for its high difficulty primarily since ship’s destruction causes save files deleting.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Subset Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":2733,"name":"Broforce","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9cc/9cc11e2e81403186c7fa9c00c143d6e4.jpg","description":"Broforce is a parody run-and-gun game made in a 2D side-scrolling manner. Players are offered to take control of a Bro – one of the soldiers of the special Broforce unit. Actually, players are going to assume roles of several protagonists (all are Bros) while completing game levels. The main idea is to make a parody of fictional movie heroes of the 80s - 90s. During the levels Bros fight against terrorists in the setting of games of the 80s to rescue other Bros. The gameplay features special combat mechanics: each Bro has two different attacks (first is constant and endless, while the second requires recharging) and a melee weapon to climb the obstacles. However, enemies can be also defeated by using distracting maneuvers. Bros also have special abilities like parkour skill or explosion resistance. The level can be completed only if another Bro is rescued, terrorists with their boss are eliminated, and the American flag is set on the enemies’ base. After each mission, the location explodes and Bros fly away by helicopter.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2873,"name":"The Witness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/00b/00b164224ebaf381104d0b215a37afb3.jpg","description":"The Witness is a 3D puzzle game where you explore a mysterious island full of natural and artificial structures. The game is focused on non-verbal communication that should make the player more attentive to the environment surrounding him. To complete the game, you need to solve puzzles in each of the eleven island's regions and get to the mountain in the center of it. While the regions differ a little, puzzles they feature are quite similar and, as a rule, have something to do with symmetry to be solved. Puzzles are activated at the grids you can find around locations. \nThere are two modes in the game. In the walking mode you can explore the island, and in the path-drawing mode you don’t move and focus on solving puzzles.\nWhile the game’s plot is quite unclear and The Witness doesn’t give many details on the hero’s background, its key feature is the visual aspect combined with music, inspiring quotes you can hear and the meditative tone of the game in general. The game features several visual illusions based on depth perception.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NVIDIA Lightspeed Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":16209,"name":"Kingdom: Classic","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e40/e40cc9d1957b0a0ed7e389834457b524.jpg","description":"The game began to be called the Kingdom Classic after the release of the game Kingdom: New Lands, and before that was called simply Kingdom.\n\n**Wise Rulers know their kingdom will fall,\nBrave Rulers do not despair.\nGreat Rulers know their riches can rule,\nAnd spend every coin with great care.**\n\nIn Kingdom, each coin spent can tip the balance between prosperity and decay. Attend to your domain, border to border, or venture into the wild to discover its wonders and its threats. Master the land, build your defenses, and when the darkness comes, stand with your people, crown on your head, until the very end.\n\n_Gameplay_\n\nKingdom is a 2D sidescrolling strategy/resource management hybrid with a minimalist feel wrapped in a beautiful, modern pixel art aesthetic. Play the role of a king or queen atop their horse and enter a procedurally generated realm primed to sustain a kingdom, then toss gold to peasants and turn them into your loyal subjects in order to make your kingdom flourish. Protect your domain at night from the greedy creatures looking to steal your coins and crown, and explore the nearby, mysterious forests to discover curious and cryptic artifacts to aid your kingdom.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Noio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2623,"name":"Resident Evil 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6f/f6f39c5b56413f7f4513b25989a1b747.jpg","description":"Bioterrorism ... Terrorists infect the US President with a vaccine that makes him an aggressive zombie. And one of the heroes of the game will have to kill him. Behind the terrorists, there is a mafia organisation that wants to hide the truth about the impossibility to control the biological weapons developed by it, which turns people into zombies. Bioterrorists opposed by a detachment of special forces - it serves two other characters.\r\nThe action of the game periodically turns from a personal vendetta into a global catastrophe and back. One President-zombie is replaced by whole cities of infected. Zombies and mutants, bioterrorists, special forces and mercenaries - they all act constantly, fight and survive in open territories and secret bases.\r\nIn total, you can play for seven characters, including a woman - the head of terrorists. Four story campaigns, after going through one line of the plot, you can choose another lens and see the events from a different perspective.\r\nThere are many enemies, but ammunition drops out of them after death. The more dangerous is the enemy, the more ammo is dropped. In hand-to-hand combat, various combo attacks help. The complete passage of the game is described as approximately 25 hours of pure action.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Capcom","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":9609,"name":"Euro Truck Simulator 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f5/1f5ddf7199f2778ff83663b93b5cb330.jpg","description":"You play as a truck driver, whose primary task throughout the game is to deliver essential goods to Europe.\n\nThe actions of foreign drivers in the game are close to reality. It means that the computer does not only act following the rules of the road but also takes some other techniques taken from real life, for example, gives a sign that passes the driver to the main road.\n\nThe time in the game is slightly different from the real time (1 minute in the set corresponds to five-ten seconds of real time). The driver can drive in total for 11 hours, after that he needs to go to the nearest Parking to make a nine-hour rest. If you do not, the driver gradually begins to struggle with sleep and yawn. The screen becomes dark, and the player, in turn, loses control of the truck, what can quickly lead to an accident.\n\nIn the game, there are temporary and permanent road signs that limit the speed mode. The maximum speed of all trucks in the game is technically limited to 90 km/h by default (but it can be disabled in the game settings).","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SCS Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28559,"name":"Dragon Age: Inquisition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/260/26023c855f1769a93411d6a7ea084632.jpeg","description":"You have to revive and lead the Inquisition, which aims to eradicate evil in the land of Thedas. War, intrigue, political strife deprived previously influential groups of Thedas the opportunity to act with the same efficiency. Players will have to respond to this threat, as well as explore a vast world, meet old and new characters and gather strength for the growing Inquisition.\r\n\r\nYou play as an inquisitor, and you can choose for your character: gender, race, voice, name and customise his look. Depending on the selected race, the player will receive specific bonuses and will be offered a choice of three classes: rogue, mage and warrior.\r\n\r\nAs in the previous parts of the series, the player controls not only his character but also a detachment of companions collected by him. In total, the game features nine companions. In battle, the player, as before, can activate a pause, during which the game stops, and at this time you can give orders to teammates. Everything is built on the dialogues between the characters, and they can directly change the ending of the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BioWare","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":28199,"name":"Ori and the Will of the Wisps","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/718/71891d2484a592d871e91dc826707e1c.jpg","description":"A New Journey Begins\r\n\r\nEmbark on an adventure with all new combat and customization options while exploring a vast, exotic world encountering larger than life enemies and challenging puzzles. Seek help from discoverable allies on your path to unravel Ori’s true destiny.\r\n\r\nExplore a vast, beautiful, and immersive world\r\nExplore a vast, beautiful, immersive, and dangerous world filled with gripping enemy encounters, challenging puzzles and thrilling escape sequences. Unravel Ori’s true destiny in this emotionally engaging, hand crafted story driven adventure.\r\n\r\nNew combat system\r\n\r\nWield dozens of new spirit weapons, spells and skills offering new dynamic combat mechanics to the world of Ori. Nimbly fight your way through untold danger and ruin with an entirely new arsenal at your disposal.\r\n\r\nCustomize your style of play\r\n\r\nChoose your tools for adventure from dozens of newly acquired attacks, spells, and skills to match your style of play. In addition, utilize an all new shard system to power up Ori’s capabilities.\r\n\r\nEncounter epic adversaries\r\n\r\nFace large epic bosses and seek support from discoverable allies who will provide services and cast optional quests to extend the adventure.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Moon Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"}]},{"id":23322,"name":"Surviving Mars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08b/08b2eee52a9876a48b955e5149affe5b.jpg","description":"Colonize Mars and discover her secrets, with minimal casualties.\nWelcome Home! The time has come to stake your claim on the Red Planet and build the first functioning human colonies on Mars!  All you need are supplies, oxygen, decades of training, experience with sandstorms, and a can-do attitude to discover the purpose of those weird black cubes that appeared out of nowhere. With a bit of sprucing up, this place is going to be awesome!\n\nSurviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock more elaborate ways to shape and expand your settlement. Cultivate your own food, mine minerals or just relax by the bar after a hard day’s work. Most important of all, though, is keeping your colonists alive. Not an easy task on a strange new planet.\n\nThere will be challenges to overcome. Execute your strategy and improve your colony’s chances of survival while unlocking the mysteries of this alien world. Are you ready? Mars is waiting for you.\n\nMain Features:Building a sustainable colony in space:Building on a planet not fit for human life challenges you to build a smart, functional colony. Bad planning isn’t about traffic jams, it’s about survival of your colonists. You really don’t want rolling blackouts in a city constructed in a place without oxygen.Individually simulated colonists:Each colonist is a unique individual with problems and strengths that influence the needs and behavior of the other colonists. Things can get really interesting if your chief scientists develops alcoholism after one too many long nights in the lab.Futuristic Space Dome construction:Retro-futuristic super structures housing colonists, factories and commercial buildings with their own “neighborhood personality.” Create colonies that value science over everything else, while tired workers drink their pay away at a local bar, or attempt a utopia among the stars.Exploration of Mars’ secrets:Inspired by the classic sci-fi of Asimov and Clarke, Surviving Mars holds many secrets. During each playthrough players may encounter one of Mars’ individually crafted mysteries. Uncovering these secrets might bring your colony great fortune, or terrible ruin. What is that sphere that manifested itself outside colony HUB B, and is it friendly?Randomized research tree:Combine static and random research through experimentation, which allows for a different experience for each journey through the game. Attain new scientific breakthroughs by exploring the uncharted terrain of Mars's surface.Unique retro-futuristic aesthetic:A sleek, modern take on the bright futurism of the 1960s. A time of exploration and adventure.Expansive mod support:Craft your own fantastic buildings, parks or even a mystery to share through Surviving Mars’s extensive and convenient modding tools. Share your finest creations with the community to build the perfect society.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9600,"name":"The Forest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1be/1be575aa6de86de328433a63fb534d9a.jpg","description":"The Forest is a survival horror open-world game developed by Endnight games.\n\nAfter surviving a plane crash on a remote island, your son is taken away by local natives. You set out to find him. Find a place to rest in, gather food and defend yourself from the natives. Create weapons and survival tools using the game's crafting system. Apart from the animals that inhabit the island, the cannibalistic natives are also present. They are active at night so the player can raid the caves the aborigines live in during the day and kill them in their sleep. The tribesmen seem to mutate due to an unknown reason. Descending down into the caves, the player finds stranger and stranger mutations.\n\nThe tribe isn't always hostile towards the player. Sometimes the locals send patrols to the player's camp, try to communicate with the player. During combat, the tribesmen hide behind cover, protect their wounded comrades or remove torches during the night to avoid detection.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Endnight Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":11686,"name":"POSTAL 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a2/2a2f9a0035544500e59a171c7038ec3a.jpg","description":"Like original Postal, its sequel was specifically intended to spark controversy. The game is full of gross violence, black humor, obscenities, and biting satire of American life. The plot follows Postal Dude, a typical \"white trash\" and a small town trailer-park dweller, as he is given menial daily tasks, such as buying milk. The way he completes them, however, is what makes Postal 2 one of the most censored and offensive games ever. At the various points of the game, the player may piss over his opponents, use cats as gun silencers (by literally showing your gun up the cat's anus), burn dogs alive, blow up cars (but not drive them, in Postal 2 cars are simply four-wheeled explosives), shoot people and flip them a bird. The game, however, is just as violent as the player wants it to be. Most missions can be accomplished without killing, though it would have spoiled all the fun.\nThe gameplay has changed since the previous part. Isometric view from the original was replaced with the first-person view. The world around Postal Dude is living by itself, regardless of the player’s presence, much like in Grand Theft Auto series. All the town inhabitants are programmed to walk, chat and even fight each other as if they were real people.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Running With Scissors","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":274762,"name":"The Outer Worlds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/704/704f831d2d132e9614931f1c4eab9e86.jpg","description":"The Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division.\n\nIn The Outer Worlds, you awake from hibernation on a colonist ship that was lost in transit to Halcyon, the furthest colony from Earth located at the edge of the galaxy, only to find yourself in the midst of a deep conspiracy threatening to destroy it. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable.\n\nKey Features\nThe player-driven story RPG: In keeping with the Obsidian tradition, how you approach The Outer Worlds is up to you. Your choices affect not only the way the story develops; but your character build, companion stories, and end game scenarios.\n\nYou can be flawed, in a good way: New to The Outer Worlds is the idea of flaws. A compelling hero is made by the flaws they carry with them. While playing The Outer Worlds, the game tracks your experience to find what you aren't particularly good at. Keep getting attacked by Raptidons? Taking the Raptiphobia flaw gives you a debuff when confronting the vicious creatures, but rewards you with an additional character perk immediately. This optional approach to the game helps you build the character you want while exploring Halcyon.\n\nLead your companions: During your journey through the furthest colony, you will meet a host of characters who will want to join your crew. Armed with unique abilities, these companions all have their own missions, motivations, and ideals. It's up to you to help them achieve their goals, or turn them to your own ends.\n\nExplore the corporate colony: Halcyon is a colony at the edge of the galaxy owned and operated by a corporate board. They control everything... except for the alien monsters left behind when the terraforming of the colony’s two planets didn’t exactly go according to plan. Find your ship, build your crew, and explore the settlements, space stations, and other intriguing locations throughout Halcyon.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":11276,"name":"Call of Duty: Modern Warfare 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e9c/e9c042d14515eb3ff7cb4db9fe78e435.jpg","description":"The eighth Call of Duty game overall is the sequel to Modern Warfare 2 and is set in an alternate reality of the modern era. In the campaign mode, the game continues the Modern Warfare storyline about an American spec ops squad Task Force 141 fighting Russian nationalists. \r\nThe player will control different characters on various military missions across the world. The protagonists from the previous part, Soap MacTavish and John Price, appear in certain missions but are sidelined by several new playable characters, most prominently, the Russian former Spetsnaz operative Yuri. Terrorist leader Vladimir Makarov, the villain of Modern Warfare 2, returns as well, and is trying to provoke the start of World War III. The player’s missions this time will be centered around protecting the West against Makarov’s attacks.\r\nThe game introduces a new Survival mode, in which the player repeals wave after wave of eternally respawning opponents. This mode allows for multiplayer co-op for two players. The traditional multiplayer mode was revised as well, adding a new reward mechanic, Pointstreaks, in which the player can choose between three sets of rules, called “strike packages”, to count his or her points.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":58753,"name":"Forza Horizon 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/786/7863e587bac630de82fca50d799236a9.jpg","description":"Forza Horizon 4 is the eleventh game in the Forza franchise of racing games and the fourth in the Horizon subseries.\r\n\r\n###Premise\r\nForza Horizon 4 takes place in a shared open world that is loosely based on the United Kingdom. Up to 72 players can share a server at which they participate in races together. They can also purchase in-game homes, which allow the players to unlock faster cars and driver perks. The drivers are customizable up to their clothing and emotions.\r\n\r\n###Weather and seasons\r\nForza Horizon 4 has a dynamic change of weather and seasons that change on a weekly basis. The weather conditions are synchronized and shared by all players on the same server. The weather and seasons alter the environment and thus the gameplay. Conditions like snow, mud, and ice can influence not only the driving style but also which areas and routes are accessible during which season. Most notably, the players can drive on the ice when lakes and rivers freeze. \r\n\r\n###Cars\r\nForza Horizon 4 features more than 450 vehicles that are licensed by over one hundred car manufacturers. Among the few notable manufacturers that were not included because of licensing problems are Toyota and Lexus.\r\n\r\n###Modes\r\nAlthough the game is oriented towards online multiplayer gameplay, it also has a single player and local multiplayer modes. The game also introduces a level editor mode called Route Creator that allows the players to design and customize new routes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Playground Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":15834,"name":"The Walking Dead: Season 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/471/4712c9ac591f556f553556b864a7e92b.jpg","description":"The Walking Dead: Season 2 is an episodic adventure game based on eponymous comic book series. As it is a sequel to the previous game in the Walking Dead series, the further story progress depends on the events of the first part. The game is set in the world inhabited by walkers, as the story takes place after the zombie apocalypse. In the second season, players are offered to assume the role of Clementine, a young member of a group of survivors leaving Georgia and heading towards a large survivor camp in Michigan. The girl’s moves are controlled in a point-and-click way. The story progresses through short scenes including dialogues with other characters, which can impact upcoming events by selecting certain dialogue options, or short-term action events like defending the camp from walkers. The gameplay also features some sort of exploration and interaction with the environment that can give extra information or various collectible items. On the way through the game players are going to face dramatic turns of the plot caused by their own tough choice.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Telltale Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":22781,"name":"Syberia 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c00/c003705c0eaed100397ae408b7b89e90.jpg","description":"Syberia 2 is a classic third-person point-and-click game from the famous French game producer Benoit Sokal. Play as American lawyer Kate Walker. She abandoned her stressful life in New York and ended up following her recent case into snowy Russian tundra -- Syberia. \n\nContinue the story that grasped players hearts in the first installment of the series. It is impossible to get stuck or die but the mere atmosphere and graphic design creates tension and lets player fully immerse into the game universe where surviving remnants of prehistoric beasts still live. \n\nThe game was ported to a number of systems and gained the new life on new Nintendo console -- Switch.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Microids","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16343,"name":"A Story About My Uncle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/37a/37a9536e92cf8fe3b60045aa75dbd41f.jpg","description":"A Story About My Uncle is a first-person adventure with a heavy focus on moving using a grappling hook and a non-violent approach thus making the plot and landscapes the critical focus of the gaming experience. There is no series of this game: it is the only title in the IP by Gone North also known as Goat Simulator creators. \nThe core gameplay features are the energetic costume giving its owner the ability to jump higher and use the grappling hook, and various updates to this outfit, for example, jetpack boots. While mastering this Spider-Man-like potential, the hero encounters various non-hostile NPCs and environment, the only menacing obstacle in the game is a one-eyed worm, lurking in one of the caves. However, the worst scenario is that it blows you off the cliff. Worm likes to take a nap so getting over him is not a big deal.\nThe plot follows a boy looking for his uncle, Freud. His nephew, after a little research in his flat, has discovered the super costume and traveled to another dimension. There are some optional collectibles scattered across the world. We shall also meet Maddy, who helps us find a missing character","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gone North Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":752,"name":"SMITE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc7/cc77035eb972f179f5090ee2a0fabd99.jpg","description":"Smite is a free-to-play MOBA game developed by Hi-Rez Studios.\n\nGods from multiple mythologies serve as playable characters in the game. Each god has three base abilities, one ultimate ability, and one passive ability. Each character can buy up to 6 passive items that grant stats bonuses and up to 2 active items that give the player new abilities such as teleporting or healing. Such items don't require mana but have a long recovery time.\n\nThe goal of the game is to destroy the opposing team's lane defenders and their Titan. Players are followed by minions that deal small amounts of damage to towers, lane defenders, the Titan or the opposing players.\n\nSmite features a five-class system. Players are free to choose from assassin, warrior, mage, hunter and guardian classes. Each class has it's own specifics and should be carefully chosen according to the situation on the arena.\n\nIn contrast to other MOBA's, there are multiple game modes in Smite. The main differences between them are the amount of gold the players spawn with, the number of players, and the number of lanes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hi-Rez Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20406,"name":"Team Fortress Classic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abd/abdb7e589f0a8ccd36c0582673120b1e.jpg","description":"A world whose atmosphere consists of fire and flying fragments of flesh. The shooting and explosions are just as natural in this world as the birds' singing in the forest. Without a continually working Hastings machine gun, you just do not survive. And it is necessary to forget about steps - running is better.\nThe game has six modes - each mode is different for the purpose of the game:\nCapture the enemy flag on the enemy’s base and bring it to your base.\nSet your flag on the territory of the enemy or in an area not occupied by anyone.\nBring one of the players - an unarmed \"civilian\" (but he does have an umbrella!) - to a safe place, do not let him be shot by enemy snipers.\nGrab the ball (not the flag) and carry it to your base.\nGrab more control points (not territories).\nCapture places that are protected by enemies, or defend sites from invaders.\nThere are only two means to achieve the goal. The first is obvious - to kill as many strangers as possible, but better all at once. The second is to establish interaction with the players on your team. This game is created to play in a team. For a diversity, there are nine classes for players - each class has one unique weapon.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Valve Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":306124,"name":"Borderlands Game of the Year Enhanced","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df9/df988191048e92cf86dabd2987c47b62.jpg","description":"Discover the co-op shooter-looter that started it all, crammed with content and enhancements! Equip bazillions of guns as one of four trigger-happy mercenaries, each with unique RPG skills. Take on the lawless desolate planet Pandora in pursuit of powerful alien technology: The Vault. With new weapons, visual upgrades, all 4 add-on packs and more, enjoy the highly acclaimed FPS/RPG solo or together with friends!\r\nBazillions of Guns: Rocket-launching shotguns, enemy-torching revolvers, SMGs that fire lightning rounds, and tons more.\r\nRadical Art Style: Traditional rendering techniques combined with hand-drawn textures give Borderlands its iconic style.\r\nIntense Vehicular Combat: Behind the wheel, engage in frenetic vehicle-to-vehicle combat.\r\nCo-op Frenzy: Tear through the opposition as a crew of up to 4.NEW:VISUALLY STUNNING: With improved character models, environments, weapons, and textures, Borderlands paired with a 4K display never looked so good.\r\nNEW WEAPONS: There are already too many to count so we added more.\r\nNEW CHARACTER HEADS: Be as beautiful as mom says you are.\r\nNEW GOLD CHESTS AND KEYS: More loot!\r\nAND MORE!PLUS: THE ZOMBIE ISLAND OF DOCTOR NED: Enter the corporate owned small town known as Jakobs Cove and put an end to the rumors of the walking “undead.” New areas, new missions, new enemies, Oh My!\r\nMAD MOXXI’S UNDERDOME RIOT: Celebrate the grand opening of Marcus Bank by taking on hundreds of foes in the only competitive arena around where you’re coming back famous... or not at all.\r\nTHE SECRET ARMORY OF GENERAL KNOXX: Want more of the Borderlands story and more loot than you could possibly figure out what to do with? Add new guns, missions, vehicles and more!\r\nCLAPTRAP’S NEW ROBOT REVOLUTION: This destructive adventure invites you to battle a vicious new threat, a massive uprising of your former friends: the claptraps.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":13194,"name":"To the Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fae/faebf3c8cbf30db3f46bfbecf6ada3d6.jpg","description":"Eva Rosalyn and Neil Watts give people a chance to live their lives \"one more time\" - they are operators of the machine capable of penetrating into the human consciousness and rewriting memory, fulfilling unrealised dreams in minds.\nHowever, they do this only for those who are close to death, because such manipulation irreversibly cripples the body.\nTheir dying client now is old Johnny. First, doctors learn from his memory his past to find out why before his death he wants to fulfil such a strange desire - to go to the Moon.\nThen there is a strong story about meetings and partings, about promises and losses. It ends well, but only in the patient's memories.\nThe gameplay consists of the study of small locations, the solution of simple puzzles and long, saturated dialogues. All this becomes fascinating thanks to the elaborated plot.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Freebird Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":4440,"name":"Deus Ex: Human Revolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/81e/81e6c6819d4322caf375b6735c3043ec.jpg","description":"Deus Ex: Human Revolution is the third entry in the franchise and takes part as a prequel to the original Deus Ex. To save his life, Adam Jensen, a former SWAT officer must fill his body with augmentations. Humanity has battled any threat to it and now live in a cyberpunk world of future. When a new form of augmentations must be revealed, Sarif Industries is attacked by the group called the Tyrants. When Adam tries to save the facility, group leader Namir heavily wounds Jensen and kills Megan Reed. David Sarif saves Adam's life, and he places augmentations in his body making him a supernatural human being, Jensen must investigate the problem of extremists in the modern world.\n\nOne of the key features of the game is a flexible storyline. Based on your actions, the game will actually react to it by hiding some subplots or changing the main plot a little depending on your subject choices. The gameplay on its own is a stealth shooter with a big using implemented use of augmentations and experience system in order to level up your abilities.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Eidos Montreal","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":3371,"name":"Dark Souls II: Scholar of the First Sin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8fc/8fc59e74133fd8a8a436b7e2d0fb36c2.jpg","description":"New take in the Souls series. This time players are offered to overcome the immense difficulties in the kingdom of Drangleic. On the way to becoming human again, the hero must obtain a few greater souls. Gamers will experience player versus environment as well as player versus player gameplay using dedicated server technology. Invite your friends, fight your foes and survive your way through harsh medieval fantasy land. \n\nThe game shares with the first installment in the series the engine and game universe but is not connected in terms of story. Known for its difficulty the game offers players unbeatable challenge. Bad play is severely punished by the game: each time player dies game protagonist loses a bit of maximum health just like in Demon’s Souls.\n\nScholar of the First Sin bundles all previous DLCs for Dark Souls II as well as visual upgrades, new features and content.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":58617,"name":"Borderlands 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f1/9f1891779cb20f44de93cef33b067e50.jpg","description":"MAYHEM IS COMING\r\nThe original shooter-looter returns, packing bazillions of guns and a mayhem-fueled adventure! Blast through new worlds and enemies as one of four new Vault Hunters. Play solo or with friends to take on insane enemies, score loads of loot and save your home from the most ruthless cult leaders in the galaxy.\r\n\r\nA MAYHEM-FUELED THRILL RIDE\r\nStop the fanatical Calypso Twins from uniting the bandit clans and claiming the galaxy’s ultimate power.\r\n\r\nYOUR VAULT HUNTER, YOUR PLAYSTYLE\r\nBecome one of 4 new Vault Hunters, each with deep skill trees, abilities and customization.\r\n\r\nLOCK, LOAD, AND LOOT\r\nWith bazillions of guns and gadgets, every fight is an opportunity to score new gear.\r\n\r\nNEW BORDERLANDS\r\nDiscover new worlds beyond Pandora, each with unique environments and enemies.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"2K","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":18336,"name":"Alan Wake's American Nightmare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b3/0b34647c42271600399b93d19b10f1aa.jpg","description":"Alan Wake's American Nightmare is a third-person shooter game, a follow-up to 2010 Remedy Entertainment title Alan Wake. However, it is not a full-fledged sequel to the game but rather a spin-off. The game’s tone and style are much more light-hearted and comedic than in the original, and the color palette is significantly brighter. \nThe game’s story takes place two years after the original game in a fictional town Night Springs, Arizona. The series protagonist, Alan Wake, must defeat his dark doppelganger, Mr. Scratch to escape the Dark Place. American Nightmare’s gameplay is very similar to that of the original game; however, this time it is much more action-oriented, rather than story-driven. Its combat is centered around the same chief combat mechanic – focusing the flashlight on enemies on making them vulnerable to weapon.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":16113,"name":"Sleeping Dogs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d9/3d9bac98d79bcd2d445f829e8d6be902.jpg","description":"Sleeping Dogs is a third-person action shooter with RPG elements, having Hong Kong as its central location. The city is an open world for the player’s exploration, and many gameplay features revolve around interacting with the surroundings. A huge aspect of immersion would be music, as it is themed according to the geographical location of the city.\nThe main character Wei Shen finds himself in various situations which lead to the development of the main story. Resolving conflicts between local citizens and Hong Kong’s organized crime, the protagonist is offered to join one of the city’s gangs. Due to this, the players need to plan their actions carefully, building trust among both the gangsters and the police. \nThe game features an unlock-based role-playing system, where every consecutive ability or trait is unlocked after the player achieves a specific goal or levels up character’s prestige in each of the three in-game groups. The combat system is heavily reliant on the character’s skill of martial arts, but conventional weaponry is also a favorable choice. Non-story related interactions add flavor to the overall gameplay, as there is a wide choice of how to spend the protagonist’s free time.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"United Front Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]}]