[{"id":17572,"name":"Batman: Arkham Asylum Game of the Year Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd8/fd882c8267a44621a0de6f9cec77ae90.jpg","description":"Batman: Arkham Asylum is the first game in Warner Brothers’ action-adventure franchise Batman: Arkham. The game takes places in fictional Asylum on Arkham Island near Gotham City where dangerous and mentally unstable criminals are kept.  \nThe story follows Batman as he captures Joker after his assault on Gotham City Hall. The game starts when Batman accompanies convoy that transfers Joker to the Arkham Asylum. With the help from Harley Queen and corrupted police officers, Joker manages to escape. He releases his gang members takes over the Asylum. Now Batman must defeat Joker, restore order in Arkham and save Gotham from bombs that Joker planted in it. During the game, the player meets several characters from Batman universe such as Scarecrow, Killer Croc, Poison Ivy, Commissioner Gordon and others.  \nThe gameplay is a mix of action sequences, investigations and puzzle solving. In action sequences Batman has to defeat villains with brute force or stealthy, using his numerous gadgets.\nThe Game of the Year Edition of Batman: Arkham Asylum includes support of 3D displays, two pairs of 3D glasses, and six previously released DLCs.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":45969,"name":"Warhammer: Vermintide 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5be/5bec14622f6faf804a592176577c1347.jpg","description":"Warhammer: Vermintide 2 is a first-person action game with heavy emphasis on cooperative multiplayer, a sequel to 2015 game Warhammer: End Times – Vermintide.  \r\n\r\n###Setting  \r\nThe game takes place in Warhammer Fantasy setting during the early days of the cataclysmic event known as The End Times. It continues the story of the original game. The five protagonists – heroes of Ubersreik, must face the evil forces of Skaven clan Fester and chaos warband Rotbloods.  \r\n\r\n ###Gameplay \r\nWarhammer: Vermintide 2 consists of 13 missions divided into three acts. In each mission can choose one of five heroes and have to go from start to finish of the level, slaying hordes of enemies and to complete different tasks.\r\nEach character has unique abilities, weapons, and progression system and serves a special role in the party. Every character has a melee weapon, ranged weapon, an active ability, several passive abilities and three careers to choose. The careers affect some of the character’s stats, available equipment and set of abilities. From the start of the game, each character has one career, while the other two get unlocked with leveling-up. After completing each mission, each character gains a random piece of equipment such as new weapons or trinkets. The equipment you get becomes better and better during the game.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Fatshark","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":13910,"name":"XCOM: Enemy Unknown","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/238/2383a172b4d50a7b44e07980eb7141ea.jpg","description":"Any alien invasion meets resistance in some form, so in this reboot of the series, players will take the mantle of the XCOM commander, and control the elite scientists and soldiers, in order to stop the threat. After successfully neutralizing scout ships, securing the crash site and retrieving civilians, XCOM personnel, and alien corpses, it’s clear that all of them are genetically and cybernetically altered, which starts the beginning of the arms race with the invaders.\r\nDuring the missions X-COM: Enemy Unknown is a turn-based tactical game, while in the downtime players will direct the organization, form units, oversee the research, expand the base of operations and manage resources. Complex combat consists of units taking turns to perform their actions with a top-down view of the battlefield. XCOM soldiers and aliens can take cover during battles, and miss their shots and attacks if anything affects their accuracy. Over the course of the game, players will be able to gain access to new technology while encountering new varied enemy types.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"}]},{"id":28179,"name":"SEGA Mega Drive and Genesis Classics","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fd/0fd84d36596a83ef2e5a35f63a072218.jpg","description":"Today it is not so hard to play old games. Emulators are available to anyone with almost any computer. And old memories are filling our minds with those amazing games we played in the past.\r\n\r\nWith this collection, you can relive your experiences with those games and play them all over again. The controls are now completely adapt for PC and still look very authentic despite new generation platforms. Some of the titles still support cooperative gameplay through Steam and in the workshop you can find new improvements to the old titles made by players for players. In this bundle, you can find any title you remember from Sega Mega Drive and Genesis - Sonic, Phantasy, Golden Axe, Virtua Fighter and Streets of Rage. Controls are now adapt not only for gamepads but also for the keyboard which means anyone can play it.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":13554,"name":"Fallout","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/14a/14a83c56ff668baaced6e8c8704b6391.jpg","description":"Fallout franchise started in a very different way than we all know it by this day. As Bethesda started to develop Fallout franchise only from the third game, original Fallout was completely different.\n\nThe game starts in 2161, 84 years after a nuclear war destroyed most of the planet and turned into Wasteland. You can either create your protagonist or play as three pre-set options - Albert Cole, Max Stone or Natalia Dubrovhsky. When in Vault 13 water supplies start to malfunction via technical reasons, Overseer sends protagonist in a quest to find a replacement and save the Vault. Having Pip-Boy and some standard equipment, the Fallout world is absolutely open for exploration. \n\nAlthough being a completely different genre of the game, Fallout still uses the same systems as we know today. S.P.E.C.I.A.L. system of characters stats (strength, perception, endurance, charisma, intelligence, agility and luck) affect your skills in a variety from 0% to 200%, as well as definitive straits that you choose only once for whole gameplay. Known to players as Karma, you can choose how to act in most of the situations and determine your reputation with other characters in the game.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Black Isle Studios","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":13627,"name":"Undertale","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ffe/ffed87105b14f5beff72ff44a7793fd5.jpg","description":"Undertale is an independent role-playing game developed by Toby Fox.\n\nOnce upon a time, there were two races on Earth: monsters and humans, but a war broke out between them and the latter won. Seven greatest mages sealed the monsters underground and left one entrance through a hole in the Ebott mountain. A lot of time passed since the war, but a human child accidentally falls down the mountain. Its goal is to get back out.\n\nUndertale uses pixelated graphics and traditional mechanics of RPGs such as earning experience points, having an open world, and so on. As the game goes on, the player has to solve several puzzles and interact with NPCs. The battles in the game are represented using the bullet hell mini-games with the player having an option to choose where they want to spare their opponent or hit the enemy back. Monsters behavior depends on the player's actions: if one decides to use a peaceful approach it will be easier to dodge the enemies attacks and vice versa. \n\nThe game features a branching story and several endings. The ending the player gets depends on whether they spared or killed the monsters they encountered throughout the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"8-4","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":5525,"name":"Brutal Legend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/af7/af7a831001c5c32c46e950cc883b8cb7.jpg","description":"Heavy Metal is a way of life and a world in itself, but Eddie Riggs found the real one, after the accident during a concert left him crushed by the scenery and making the involuntary blood sacrifice to the Ormagöden. The action adventure game with the real-time strategy elements in the open world introduced a star voice cast, compiled by musicians that became prototypes for some of the characters players will encounter during the game. Aside from the main story, players will be able to encounter dozens of side missions that may vary from the defense battles to a race. When using his V-guitar named Clementine, Eddie can cast spells, called Solos, by a simple rhythm game, reminiscent of Guitar Hero. Some story missions are so-called Battles of the Bands, where players will fight the armies in a real-time strategy fashion, and winning by outperforming the enemy band and destroying the stage.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18240,"name":"Brothers: A Tale of Two Sons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b6b/b6b20bfc4b34e312dbc8aac53c95a348.jpg","description":"Brothers - A Tale of Two Sons is a story about teamwork. Having a very curious setup, the story follows two brothers on a quest. With their mother dead and father being heavily ill, the only way to save is to bring water from the Tree of Life. But on their way, they will have to challenge the world and themselves. Villages, mountains and forests, bullies, trolls and wolves will await Naiee and Naia on their journey. \r\n\r\nWith having such setup, the game found a perfect way to portray this world to the audience. The beautiful visual style and something in between adventure and a platformer make the game an exciting experience. Although that is not the most curious thing about the game. With having two brothers involved in a story, the game actually gives you an opportunity to control both of them. You can solve puzzles by simultaneously moving both of the characters. For example, one of your heroes must distract an enemy, and another is supposed to go behind. This amazing feature provides you with one of the most unique experiences as you play two characters at once.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Starbreeze Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":1416,"name":"Mafia II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e5/9e5b274c7e3aa5e30beba31b834b0e7e.jpg","description":"Mafia II is the second game in the franchise about Italian mafia operating in America after World War II. Vito Scalleta returns from the war in Italy being wounded. As he returns and reunites with his friend Joe, he and Henry Tomassino convince Vito to be apart of an Italian mafia in fictional city Empire Bay. Starting to work for Alberto Clemente, Vito must go through every aspect of being a part of the family and become a big thing in it.\r\n\r\nEven though the game has an open world mechanic, you won't probably explore it. Travelling to missions give an opportunity to listen to music of this time in America - Chuck Berry, Muddy Waters, Dean Martin and others, providing the game with a great atmosphere of the USA in its 50s. The gameplay has a variety of missions to offer, in which you can confront your enemies in melee combat, shoot them with different guns like M1911 or Thompson, or stealthily engaging your opponents. The game is pretty strict to the player reaching highest of empathy with Vito and every situation he's in.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"2K Czech","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":23585,"name":"Far Cry 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bce/bce62fbc7cf74bf6a1a37340993ec148.jpg","description":"Far Cry 5 is an open-world adventure first-person shooter developed by Ubisoft Montreal. It is the fifth main installment in the series.\n\nWelcome to Hope County, Montana, where a violent religious doomsday cult appeared. You play as a junior deputy sheriff who gets trapped in the Hope County as all the ways out the county are now patrolled with cultists and all external communication is cut off. It is your job to free the county of cultists.\n\nFor the first time in the series, the game features a character creation screen. A wide range of weaponry which varies from pistols to grenade launchers is available to the player. Various vehicles are also at your exposal: cars, planes, helicopters, and so on. \n\nThe game puts a strong emphasis on building the resistance to the cultists. Players have to recruit the locals in order to have more fighters and gain reputation.\n\nA welcome addition to the game is the so-called Guns For Hire system. It allows the players to choose one of the comrades that will follow them anywhere. For example, hiring a sniper will help the player spot enemy targets in the distance.\n\nThe whole game can be played in both singleplayer and co-op modes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2361,"name":"Psychonauts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c89/c89ca70716080733d03724277df2c6c7.jpg","description":"Double Fine Productions and Tim Shafer are known for making very curious games out of amazing ideas. Psychonauts is exactly about some idea. You have to get inside people's mind and help them fight with their fears or memories from the past.\r\n\r\nWe follow a story of Raz, who runs away from the circus and goes to the summer camp for Psychonauts - people with special abilities. They refuse to teach him but allow him to participate in \"Basic Braining\" course. When his talent becomes clear, he's being invited to an experiment. After receiving a vision, he realises that there's a sinister plan behind the camp and only he can save everyone there.\r\n\r\nThe game exists in two different worlds - a real one and a mental one. If the real world leaves no question about it, the mental world is one of the most interesting features of the game. Twisted minds, memories from the past and deepest fears is something you are about to encounter with. Having a number of abilities like telekinesis or invisibility will help you cure a person's psychological issue.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox"}]},{"id":51329,"name":"Shadow of the Tomb Raider","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f6/7f6cd70ba2ad57053b4847c13569f2d8.jpg","description":"Experience Lara Croft’s defining moment as she becomes the Tomb Raider. In Shadow of the Tomb Raider, Lara must master a deadly jungle, overcome terrifying tombs, and persevere through her darkest hour. As she races to save the world from a Maya apocalypse, Lara will ultimately be forged into the Tomb Raider she is destined to be.\r\n\r\nSurvive and Thrive In the Deadliest Place on Earth: Master an unforgiving jungle setting in order to survive. Explore underwater environments filled with crevasses and deep tunnel systems.\r\n\r\nBecome One With the Jungle: Lara must use the jungle to her advantage to strike suddenly and disappear like a jaguar, use mud as camouflage, and instill fear in enemies to sow chaos.\r\n\r\nDiscover Brutal Tombs: Terrifying tombs, filled with deadly puzzles, require advanced traversal techniques to be accessed\r\n\r\nUncover Living History: Discover a hidden city and explore the biggest Tomb Raider hub ever.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Eidos Montreal","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9830,"name":"Brawlhalla","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/35b/35b47c4d85cd6e08f3e2ca43ea5ce7bb.jpg","description":"Brawlhalla is a free-to-play fighting game with platformer elements. You pick a character from 39 available heroes (this amount is increasing with new updates) and try to knock your opponent off the stage. The controls are simple to make the game easy to master. Every character has two weapons and also can use boosts that drop on the stage. They also have such characteristics as Strength, Dexterity, Defense, and Speed that determine their combat style and can be slightly modified. \r\nBrawlhalla supports online and local multiplayer and cooperative along with multiple modes where you can test your skills and increase the rank. Except for 1v1 duels and different team matches, you can take part in huge arena battles with multiple opponents. Some stages consist of several platforms that can change their position during the fight. Moreover, Brawlhalla holds numerous competitions and tournaments all over the world with money prizes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":3687,"name":"Watch Dogs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/879/879c930f9c6787c920153fa2df452eb3.jpg","description":"In WATCH_DOGS you play as Aiden Pierce. A professional hacker that can do anything that he pleases with the city due to a new electronic system that now controls almost every aspect of the city - ctOS. By using Aiden's phone, you are able to penetrate any device in the whole city and do whatever you want it. For example, you can hack through someone phone and rob his bank account, or gain control camera system and observe things around you. \n\nBut after one heist that goes wrong, Pierce must hide his family. But while riding to safety, his car is shot by a mercenary called Maurice Vega, and Pierce's niece dies. Interrogating Maurice did not lead to any clue who hired him, and when he returns in the city, he falls into a whole war between the hackers, involving his former partner Damien Brenks, hacking syndicate DedSec and other characters in the game. By blackmailing Aiden, he is forced to help the hackers in order to save his family.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":28201,"name":"Metro Exodus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/152/152e788b7504aa2753c86dae912fb34c.jpg","description":"Metro Exodus is the third installment in the Metro series. It is based on the series of post-apocalyptic novels by Russian writer Dmitry Glukhovsky. The game is the sequel to Metro: Last Light and is set two years after its ending.\r\n\r\n###Plot\r\nExodus takes place in the year 2036 in post-apocalyptic Russia. According to the Metro universe backstory, in 2013 the planet was devastated by a total nuclear war. The atomic bombing left many parts of the Earth's surface uninhabitable due to high radiation rates, dangerous mutated monsters, and anomalies abound. The last remnants of humanity survive by hiding in the subway tunnels (hence the name of the series). The main protagonist is Artyom, a former dweller of Moscow Metro. Together with his wife Anna, he escaped the capital to search for survivors in the Russian Far East (thus making the “Redemption” ending of the Last Light the series' canon). \r\n\r\n###Gameplay\r\nThe player controls Artyom from the first person view. Exodus introduces the sandbox open-world, although the game combines it with the traditional linear levels. Unlike in previous games, Exodus is set mostly outside the subway system. Thus, the game also introduces the weather, the day and night cycle and the change of seasons. The player explores the Russian wilderness during and after the nuclear winter and rides a steam locomotive named Aurora through Siberia.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"4A Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":1450,"name":"INSIDE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5a/d5a24f9f71315427fa6e966fdd98dfa6.jpg","description":"INSIDE is a platform adventure game that transfers the atmosphere of a dystopic world. Players assume the role of a lonely boy, who walks through the monochromatic 2.5D environment and solves various puzzles. By the time main antagonists of the character pursue him throughout the whole world. The main storyline follows the unnamed boy through the in-game world locations including a forest, a farm, and a fictional laboratory, where experiments on bodies are held. The gameplay is divided into levels tied to each location. While completing them, the boy, controlled by players, has to swim, run, climb the obstacles and use his supernatural ability to control bodies with his special helmet. In the course of the travel, the protagonist also comes across a siren-like creature, who gives him gear for breathing underwater. The death occurs in several ways ranging from drowning to being shot with a tranquilizer dart. In addition to the basic ending, the storyline features an alternate one, which unlocks after collecting all the hidden glowing orbs.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playdead","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":2743,"name":"Heavy Rain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0af/0af85e8edddfa55368e47c539914a220.jpg","description":"Heavy Rain is an interactive drama telling the story of the investigation of a serial murder’s case. Players assume roles of four people – Ethan Mars, Norman Jayden, Madison Paige, and Scott Shelby – somehow involved in the case of Origami Killer, who is used to leave his victims alone, marked with origami figures. It soon reveals that all Origami Killer’s murders are connected with weather changes (actually heavy rains). In the course of the completion, players will follow the characters on their way to the key of the murderer’s mystery. Heavy Rain is an unusual action-adventure game. All four main characters are controlled from the third-person perspective with only several buttons, as the interaction with the environment is usually done by activating on-screen prompts like holding the trigger, pushing a button, positioning the stick, or all in one. The gameplay consists of multiple scenes, which affect the further in-game progress by the players’ choice and create a branching storyline that can lead to various endings including the death of certain main characters.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Quantic Dream","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":3931,"name":"Saints Row IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e3d/e3ddc524c6292a435d01d97cc5f42ea7.jpg","description":"Saints Row IV is the fourth and the last main entry for the Saints Row franchise. Almost right after stating Steelport as the independent nation in the third game, The Boss (player) is being contacted by MI6 with a mission to eliminate STAG leader Cyrus Temple and prevent him from launching a nuclear attack. And by doing so The Boss earns complete respect and love from America. Five years after, The Boss is being elected as a President of The United States. But sudden alien invasion by Zinyak in the lead destroys everything, while they capture whole crew from the third game and main protagonist as well, putting him in the simulation world.\n\nWith traditional gameplay of the Saints Row franchise being kept untouched, the developers added new features that can be understood as a reference to the Matrix franchise. While The Boss is in simulation, he can some extraordinary powers such as enormously high jumping, super running speed and amazing force which affects the gameplay with different side missions, collectables and walkthrough of the game. And a dubstep gun.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Volition","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"}]},{"id":8488,"name":"Tom Clancy's Rainbow Six Siege","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b34/b3419c2706f8f8dbe40d08e23642ad06.jpg","description":"The gameplay of the game is based on intense strategic battles between the Navigator and the defenders in a limited space. Locations in the game consist of a multi-level object (for example, a multi-storey building), inside which there are defenders, and the area around it, where the attackers begin.\r\n\r\nDestruction is at the head of the game mechanics. The surrounding objects are created with maximum realism, the degree of damage depends on the calibre of the bullets used by the players or on the total power of the laid explosives. Walls can be destroyed, creating new firing positions and shelters. Optimal use of the potential of destruction often becomes a guarantee of victory. Defenders can limit the ability of attackers to destroy, using kits to strengthen the walls and the device of some operatives.\r\n\r\nThe primary game mode - multiplayer, normal or rating. During the game in the last mode, the player is assigned a certain rank, and parameters such as the ratio of kills/deaths and wins/losses are recorded in his profile displayed in the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":4280,"name":"Max Payne 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5bf/5bf88a28de96321c86561a65ee48e6c2.jpg","description":"In Max Payne III we see Max from a new perspective. Taking place nine years after the second game, Payne left the police department in New York and now serves as a private security contractor in São Paulo, Brazil. Guarding the Branco family - Ricardo, Victor and Marcelo, everything turns into a disaster when a local street gang kidnaps Ricardo's wife. In attempt saving Ricardo's wife, another outlaw involves. In the end, Max has to infiltrate the gang to save Fabiana and perform some justice.\r\n\r\nEven if Max is old, he still can put on a hell of a fight. A cover system provides some good tactical advantages and bullet time is now something iconic for the series. Manipulating with time, Max can perform some amazing tricks to kill his opponent. Also, you can shoot from any angle basically, while lying on the ground. If that isn't enough for you, you can obliterate your enemies with melee attacks or blow them up by using explosives. \r\n\r\nAs another feature of the game, no loading screens are involved. Cut-scenes are also interactive, and with that, the process of the game is absolutely smooth which makes the best experience from an intense shooter.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Rockstar Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":50734,"name":"Sekiro: Shadows Die Twice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/67f/67f62d1f062a6164f57575e0604ee9f6.jpg","description":"Sekiro: Shadows Die Twice is a game about a ninja (or shinobi, as they call it), who is seeking revenge in the Sengoku era Japan.\n\n###Plot\nThe game is set in the 16th century in a fictionalized version of Japan. The main protagonist is a member of a shinobi clan. A samurai from the rival Ashina clan captured the protagonist's master, and the protagonist himself lost his arm trying to protect his leader. However, a sculptor of Buddha statues managed to replace the lost limb with an advanced prosthetic arm. The protagonist accepted a new name, Sekiro, meaning “one-armed wolf”. Now his goal is to avenge his clan and to save his leader from the hands of their enemies.\n\n###Gameplay\nThe player controls Sekiro from the third person view and navigates the character as he fights multiple enemies. Sekiro: Shadows Die Twice features an innovative combat system that doesn't use hit points. Instead, the opponents can be killed with a single precision strike. However, the player has to fight his or her way through the opponent's blocks and parries to land the deadly blow. The main character fights with his sword (katana) in the right hand, while his left hand can host a variety of upgrades, such as an ax, a torch, or a shield. The game also emphasizes stealth action. The player has to use a grappling hook to access multiple locations. Sekiro: Shadows Die Twice has no multiplayer.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"FromSoftware","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":2819,"name":"Firewatch","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0be/0bea0a08a4d954337305391b778a7f37.jpg","description":"Firewatch is a mysterious adventure game with beautiful graphics, which tells a story of a fire lookout Henry. From the very beginning, the game sets up a tough atmosphere of loneliness. The main action takes place in Shoshone National Forest of Wyoming in 1989 (a reference to Yellowstone fires of 1988). According to the storyline, right after the appointment to the fire tower in Shoshone forest Henry starts facing strange things. The further gameplay is based on exploring the entire forest and investigating its phenomena. Players’ progress will affect the accessibility of the distant game areas. Sometimes the silence is being interrupted by the protagonist's walkie-talkie, which connects him with his supervisor Delilah. Gameplay also includes mechanics of choice within the dialogue: each optional phrase reflects on Henry’s relations with Dalilah. In addition to the puzzles of the forest, Henry tries to solve his own experiences while wandering. Playing for Henry and his accomplice gamers will have to clear up the mysteries of the past, connected with the fire tower in Shoshone National Forest.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Campo Santo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":2093,"name":"No Man's Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/174/1743b3dd185bda4a7be349347d4064df.jpg","description":"No Man's Sky is a space action-adventure survival game developed by Hello Games.\n\nThe overall visual style of the game is inspired by various science fiction books. Demoscene also served as a source of inspiration for the developers.\n\nThe main feature that the game revolves around is the procedural generation. Each planet you visit is generated from scratch. The information about the planets and their inhabitants is dynamically updated so every player can discover a new species or planet and give it a name.\n\nNo Man's Sky gameplay implies the exploration of space and planets some of which are inhabited with extra-terrestrial life, gathering resources, space battles, maintaining and upgrading the player's ship and completing bounty hunting missions. The main objective is to reach the center of the galaxy. \n\nOn release, it was stated that the game is in fact multiplayer, but the size of its world is so big that the probability of meeting another player is extremely small. It turned out that it is impossible to meet any other player due to the extremely limited multiplayer aspect. As of 2018, Hello Games released the fourth major update which included the full multiplayer experience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hello Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":4223,"name":"The Darkness II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/744/744adc36e6573dd67a0cb0e373738d19.jpg","description":"With a gap of five years, Darkness II is a sequel for the first part of the franchise following the story of James Estacado. After becoming the don of the Franchetti family, he still fights the fact that his girlfriend Jenny died in the first game and fighting against the Darkness itself. Things turn pretty bad when a group of attackers catch James and his men off guard in a restaurant. Being severely injured he still refuses this powers even if they save them. The attack doesn't end so fast, and after an explosion, James is left to bleed out and die. James gives up and embraces the Darkness fighting off his attackers and begins his fight with the Brotherhood and his own sanity.\r\n\r\nThe core feature of the game is to control the tendrils. Being Darknesses spawns, two tendrils will help the player to fight off his enemies. You can execute people, throw them around and throw things at them. Also, you can use it to merely attack or defend yourself in any fighting situation. In case you will want to do the campaign with your friends, the game gives you Vendetass. The plot of it follows four hitmen from Jackie's family to stop the mysterious Brotherhood.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"2K","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":3556,"name":"Alien: Isolation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/daa/daaee07fcb40744d90cf8142f94a241f.jpg","description":"Alien: Isolation is an action-survival horror game played from the first-person perspective for a more intense experience. The game is not a sequel to any of Alien games, but it is directly connected to the original 1979 Alien film, so the gameplay includes historical references, and the game itself transfers the unique atmosphere and the old vision of the future. The action is set 15 years after the film events. Young Amanda Ripley accompanied by Nina Taylor and the android Christopher Samuels reaches a distant space station Sevastopol to investigate the case of her mother Ellen Ripley (the protagonist of the 1979 film) disappearance. On the way to the Nostromo’s (Ellen’s spacecraft) flight recorder, Amanda will face plenty of hardships like hostile androids and Aliens because the Sevastopol station is wholly abandoned. Players have to explore the entire station inhabited with Aliens. Due to the crafting system, players can create the necessary gear to prevent contacts with countless enemies.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":3678,"name":"War Thunder","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d07/d0790809a13027251b6d0f4dc7538c58.jpg","description":"War Thunder is a free-to-play cross-platform vehicular combat MMO with more than 1000 playable aircraft, helicopters, tanks or ships sprawled over huge maps that feature real-life locations and battles that transpired over the course of 20th century, most notably during WWII. \n\n### Gameplay\nAir and land warfare pits 2 sides against each other up to 32 players who must battle over points or achieving total elimination against enemy forces across huge maps. There are also PVE missions including dynamic historical campaigns and solo missions plus the custom events that add limitations or put certain victory conditions.\n\n### Changes\nBack in 2013 War Thunder featured 50 vehicles from the German and Russian trees of air forces and a small selection of maps to choose from. Over the course of the open beta and up to the original release in December 2016, the developers have added over 800 land and air vehicles spawning from British, Japanese, American and other vehicle trees, expanded the map selection, upgraded the interface and tweaked out the graphics and sound for better optimization.\n\n### Recent updates\nNow War Thunder also has naval battles and with the latest update added helicopters to the mix. All the while constantly maintaining the game’s balance, polishing the visuals and the impeccable sound design, fixing bugs and implementing new features.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Gaijin Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":58616,"name":"Assassin's Creed Odyssey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c6b/c6bd26767c1053fef2b10bb852943559.jpg","description":"Assassin's Creed Odyssey is the twentieth game in its series. It is the earliest game in the Assassin's Creed universe chronology and the prequel to Assassin's Creed Origins.\n\n###Plot\nThe events of Assassin's Creed Odyssey's take place in the Classical Era of Ancient Greece, in 431 BC, before the Brotherhood of Assassins was even formed. The plot follows a fictionalized story of the Peloponnesian War between city-states of Sparta and Athens that left Greece devastated. The player can choose to control either a male (named Alexios) or female (named Kassandra) protagonist, both of them being descendants of the famous Spartan king Leonidas. The player enters the plot as a mercenary and can side with either Athens or its rival Sparta. There's also the frame story set in the contemporary age. Its protagonist is Layla Hassan, who was also the main character in the frame story of Assassin's Creed Origins.\n\n###Gameplay\nUnlike most earlier installments of Assassin's Creed, which put the emphasis solely on action, Odyssey has a strong role-playing element in it. Dialogue options and the non-linear plot allow the player to reach several alternate endings. The game also has a reputation system and multiple options for romancing, including same-sex romances. The combat system is similar to that in Origins with the addition of new skills. The game also reintroduces naval battles.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":58654,"name":"Hitman 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/858/858c016de0cf7bc21a57dcc698a04a0c.jpg","description":"Hitman 2 is the seventh game in its series. It is the sequel to Hitman and a prequel to all other entries of the franchise.\n\n###Plot\nAs with all Hitman series, the game follows Agent 47, a hitman for hire and a member of a secret assassins' organization called International Contract Agency. His missions are tied together by a story that continues the plot of 2016's Hitman. The protagonist is searching for an anonymous opponent known as Shadow Client, who was also the main antagonist of the previous game. Hitman 2 also provides insight into Agent 47's mysterious past. The hunt for Shadow Client and his militia takes Agent 47 to new locations, such as a motor race on the sunny streets of Miami and a deadly tropical rainforest in Colombia.\n\n###Gameplay\nAs usual for Hitman series, the player controls Agent 47 from the third person view (switching to the first person when using sniper rifles) in a 3D environment. The game consists of several missions in which the protagonist has to assassinate various targets around the world using non-conventional tactics, stealth, and camouflage. Hitman 2 features an advanced crowd AI and an improved stealth system that allows the player to hide between the trees and in the crowd. The game also features new weapons, such as concussion gadgets that the player can use to knock people out.\n\n###Multiplayer\nThe game introduces a new mode called Sniper Assassin that allows the players to cooperate online.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"IO Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":4502,"name":"Darksiders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8d4/8d46786ca86b1d95f3dc7e700e2dc4dd.jpg","description":"In Darksiders, you play as War - one of the Four Horsemen Of The Apocalypse. Two kingdoms, Heaven and Hell, could never solve their disagreements and battled each other from the beginning of time. \"The Charred Council\" arose in between two sides forming the brotherhood of Four Horsemen - War, Death, Strife and Fury. With these for horsemen on the watch and all the conflicts end, humanity has been born - a \"Kingdom of Man\". Council has created Seven Seals, that must be broken, when \"The Kingdom of Man\" will be ready for an Endwar. When our protagonist, War arrives on Earth, he sees that the final battle between Good and Evil already emerged without breaking Seven Seals. After fighting a demon called Straga, he is summoned by the council. It accuses him of destroying the balance, and that now the Apocalypse is unstoppable. Convincing the council in his innocence, War now has to stop the Endwar.\r\n\r\nDarksiders is a typical hack-and-slash game that lets you produce comboes with two primary weapons - Chaoseater and Scythe - and various gadgets. While defeating his enemies, War can execute them with brutality. The gameplay is undertoned with dark mythology bound with the present days.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"THQ","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":11052,"name":"Titan Quest Anniversary Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/33d/33df5a032898b8ab7e3773c7a5f1d336.jpg","description":"Titan Quest Anniversary Edition is an extended version of the original action role-playing slasher Titan Quest, released in honor of game’s 10th anniversary. The game is set in the world of pre-Roman age and includes 3 locations: Ancient Greece, Egypt, and eastern civilizations. The story begins with a narration about Titans, who ruled the entire world before the Olympians. The idea is that a trio of Telkines managed to break off the communication between Earth and Olympus and started terrorizing the mortal world. The protagonist is a hero, who is expected to defeat Telkines and to restore the conduit linking to worlds. To assume the role of the mythical hero players need to customize their own character: choose the gender and appearance. The further action continues in a traditional hack and slash manner. Players navigate the 3D world through the overhead third-person view and lead the protagonist with the mouse, while special abilities are tied to keyboard buttons. The Anniversary edition includes all possible fixtures and improvements of graphics and gameplay.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":2235,"name":"Batman: Arkham Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc3/fc30790a3b3c738d7a271b02c1e26dc2.jpg","description":"Batman Arkham Origins is an action-adventure game, the third main entry in Warner Brothers’ Batman: Arkham series. Concerning story, Origins is the prequel to the first game in the franchise, Batman: Arkham Asylum. It takes place in Gotham City on Christmas Eve. The notorious crime lord Black Mask places $50 million bounties on Batman and hires eight of the world’s deadliest assassins including Bane, Deathstroke, Killer Croc and others. The story covers some events important for the other installments in the series, like Batman’s first encounter with Joker and incidents that lead to the reopening of Arkham Asylum. \nThe gameplay of Origins is very similar to the previous two installments. It mostly consists of beat-em-up sequences, stealth sequences, and investigations. Like in Arkham City player can freely explore an open world, but this time it is not just Arkham Asylum, but the whole of Gotham City.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox 360"}]},{"id":28154,"name":"Cuphead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/226/2262cea0b385db6cf399f4be831603b0.jpg","description":"Hand-drawn 2D platformer in the style of 30s cartoons. 2D Dark Souls as the fans refer to the difficulty of this one. It took developers 6 years to create and polish their magnum opus. Cuphead is a classic run and gun adventure that heavily emphasizes on boss battles.\r\n\r\nPlay as Cuphead or his brother Mugman that signed a deal with the devil and know needs to bring the master souls of its debtors. Players can go through the campaign single-handedly or with a friend using built-in co-op capabilities. \r\n\r\nThe backgrounds, characters and other miscellaneous staff were painstakingly created using the methods from the era it mimics; Every character and every scene were hand-drawn to mimic vintage American cartoons. Each note in the orchestral soundtrack was composed with unparalleled attention to detail. Cuphead is an addictive mix of bone-crushing difficulty, fun and audiovisual feast that instantly makes you crave for more.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Studio MDHR","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28568,"name":"Assassin's Creed II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1be/1bed7fae69d1004c09dfe1101d5a3a94.jpg","description":"Assassin's Creed II is the second installment in the AC series, the center of which is stealths kills, exploring the world and enemy encounters. It is the straight sequel to the first part of the series and the beginning of the Ezio — the protagonist — trilogy, followed by 'Brotherhood' and 'Revelation.'\nThe events take place in Rome, during the Italian Renaissance (1476-1499), we play as Ezio Auditore and are fighting against Knight Templar, being the Assassins. At the same time, all of the installments within a series are connected with each other by the Desmond storyline: all of the enchanted worlds he travels to are just simulations achieved through using \"Animus\" — a particular device which gets in the DNA and allows its user to drive around their memories. \nThe game involves following mechanics — presuming the player to chase around some target, not moving to close, but not getting far at the same time; exploring quests — the heart of movement mechanics is parkour, and fighting — hero's arsenal involves swords, spears, and other melee weapons as well as ranged ones: bows, crossbows, and javelins.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":262382,"name":"Disco Elysium","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/840/8408ad3811289a6a5830cae60fb0b62a.jpg","description":"Disco Elysium is a groundbreaking blend of hardboiled cop show and isometric RPG. Solve a massive, open ended case in a unique urban fantasy setting. Kick in doors, interrogate suspects, or just get lost exploring the gorgeously rendered city of Revachol and unraveling its mysteries. Tough choices need to be made. What kind of cop you are — is up to you.\r\n\r\nYou play a disgraced lieutenant detective in Revachol West, a shore town where corruption’s out of control, murders go unsolved, and the kids just wanna dance. Kick in doors, interrogate suspects, or get lost exploring a gorgeously rendered city and unraveling its mysteries. All the while, tensions rise around you as Revachol threatens to explode.\r\n\r\nDisco Elysium’s completely original skill system makes your innermost feelings, doubts, and memories an integral part of every conversation. Level up your rational faculties, sharpen your wits, or give in to your basest instincts. What kind of cop you are is up to you.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"ZA/UM","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":10340,"name":"Crusader Kings II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c22/c22d804ac753c72f2617b3708a625dec.jpg","description":"Crusader Kings II is a global RTS which takes place in the Middle Ages of Europe. The players will govern a house of nobility of that time, and ensure that its heritage will last for centuries. The second installment of the series fills the gap in the developer’s continuum of global strategies, allowing for lengthy grand campaigns and world conquests.\nThe main points of interest in the game are your noble house, holdings, and vassals. Players can engage in diplomacy between neighboring households, sign treaties and create a bloodline between two families, forge documents and declare wars. However, the primary competitive objective would not be conquering the world, but instead, winning the prestigious ranks and ensuring that your family will prosper.\nGameplay-wise, the mechanics revolve around interactions with your neighbors and your court. Buildings built, armies trained, but most importantly, your character should be built, too. Education, marriage, religion - everything will affect your lord-protege, and players often come up with different guides on how to achieve success without regards to the luck and skill of the player.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":356714,"name":"Among Us","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e74/e74458058b35e01c1ae3feeb39a3f724.jpg","description":"Join your crewmates in a multiplayer game of teamwork and betrayal!\r\n\r\nPlay online or over local wifi with 4-10 players as you attempt to hold your spaceship together and return back to civilization. But beware...as there may be an alien impostor aboard!\r\n\r\nOne crewmate has been replaced by a parasitic shapeshifter. Their goal is to eliminate the rest of the crew before the ship reaches home. The Impostor will sabotage the ship, sneak through vents, deceive, and frame others to remain anonymous and kill off the crew.\r\n\r\nWhile everyone is fixing up the ship, no one can talk to maintain anonymity. Once a body is reported, the surviving crew will openly debate who they think The Impostor is. The Impostor's goal is to pretend that they are a member of the crew. If The Impostor is not voted off, everyone goes back to maintaining the ship until another body is found. If The Impostor is voted off, the crew wins!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Innersloth","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":58751,"name":"Halo Infinite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e1f/e1ffbeb1bac25b19749ad285ca29e158.jpg","description":"Halo Infinite is the twelfth installment in the Halo franchise, and the sixth in the main series of science fiction first-person shooters. It is the sequel to Halo 5: Guardians and the third chapter in the Reclaimer Saga sub-series that was started by Halo 4. It is also the first game powered by the completely new Slipspace engine developed by Microsoft.\r\n\r\n###Setting\r\nThe Halo franchise is set in the 26th century, when the human civilization, led by United Nations Space Command, wages total war against the theocratic interstellar alliance called the Covenant. The goal of the war is the control of ring-shaped space stations, called Halos, which were built in ancient times by a lost civilization of Forerunners. \r\n\r\n###Plot\r\nThe game follows the series' most famous protagonist: Master Chief, who is a “Spartan” - a genetically enhanced, power armor wearing super soldier. Infinite continues the story of Master Chief and his companions, the Blue Team, as they fight against the AI called Cortana that tries to take over the control of the Halos. AHalo Infinite is set on a forested Halo inhabited by rhinos and other wildlife reminiscent of prehistoric Earth.\r\n\r\n###Modes\r\nIn addition to single player story campaign, Halo Infinite supports cooperative multiplayer modes, both local and online. There's, however, no Battle Royale mode.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"343 Industries","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":1010,"name":"Transistor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1f/d1f872a48286b6b751670817d5c1e1be.jpg","description":"Transistor is a cyberpunk game that uses isometric point-of-view as its primary mechanic. Following the story of Red, she discovers a body of an unknown man with a sword in his chest called Transistor. Sword has possessed the mind and voice of its previous owner and now able to speak with Red, navigating her in a city called Cloudbank, as the Process attacked the city and still searches for Red to kill her and return the sword back to them for unknown reasons. \n\nDespite having real-time battles, Red can freeze the time with her ability called Turn that draws her action bar. Until it is fully restored, no abilities can be used if only you don't have the upgrades. As an addition, Red can retrieve Functions from her fallen enemies - new powers for her weapon with a passive, persistent effect or other. Beautiful design and interesting lore give this game a unique atmosphere being doubled by the soundtrack, done by Darren Korb.\n\n**Key Features**:\n• An all-new world from the team that created Bastion\n• Configure the powerful Transistor with thousands of possible Function combinations\n• Action-packed real-time combat fused with a robust strategic planning mode\n• Vibrant hand-painted artwork in full 1080p resolution\n• Original soundtrack changes dynamically as the action unfolds\n• Hours of reactive voiceover create a deep and atmospheric story\n• 'Recursion' option introduces procedural battles after finishing the story\n• Fully customizable controls custom-tailored for PC","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Supergiant Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":58777,"name":"DOOM Eternal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ea/3ea3c9bbd940b6cb7f2139e42d3d443f.jpg","description":"As the DOOM Slayer, you return to find Earth has suffered a demonic invasion. Raze Hell and discover the Slayer’s origins and his enduring mission to rip and tear…until it is done.\n\nExperience the ultimate combination of speed and power as you battle your way across dimensions with the next leap in push-forward, first-person combat.\nSlayer Threat Level at Maximum\n\nArmed with a shoulder-mounted flamethrower, retractable wrist-mounted blade, upgraded guns and mods, and abilities like the Double Dash, you're faster, stronger, and more versatile than ever.\nUnholy Trinity\n\nTake what you need from your enemies: Glory kill for extra health, incinerate for armor, and chainsaw demons to stock up on ammo to become the ultimate demon-slayer.\n\nBATTLEMODE is the new 2 versus 1 multiplayer experience built from the ground up at id Software. A fully-armed DOOM Slayer faces off against two player-controlled demons, duking it in a best-of-five round match of intense first-person combat. BATTLEMODE launches with 6 handcrafted maps and 5 playable demons – the Marauder, Archvile, Revenant, Mancubus and Pain Elemental.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":28153,"name":"Assassin's Creed Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/336/336c6bd63d83cf8e59937ab8895d1240.jpg","description":"Assassin's Creed Origins is an open-world action game developed by Ubisoft. It further continues the series after Assassin's Creed Syndicate.\r\n\r\nThe story is set in two time periods simultaneously. In 2017, the order of Templars has recovered an ancient artifact that will allow them to seize control over humanity. Assassins plan to get the artifact back in their hands. Layla Hassan relieves the memories of two ancient Egyptians named Bayek and Aya who create the Assassins order.\r\n\r\nLevels are open-ended which allows both stealth or open combat approaches. Players are put in an open world in which they can complete quests in order to either progress through the story, level their character up or upgrade their equipment. The \"eagle vision\" mode was replaced by an eagle by the name of Senu. Players can use Senu to scout the area ahead and highlight enemies.\r\n\r\nThe game features a heavily revised combat system that relies on hit-box mechanics rather than pre-determined animations as it did in the previous titles. Origins focuses on introducing various types of enemies that the players will have to learn about in order to defeat them.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]}]