[{"id":5970,"name":"SAMURAI SHODOWN II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e0/2e03467b69eb929e6f7aed34fd720e76.jpg","description":"■About the opearion guarantee\n*We do not guarantee that this application  will function without interruption or will be exempt from errors on smartphones with iOS7.\nThank you for your understanding.\nDue to the fantastic response from our devoted fans, we have extended the Sale Campaign for \"SAMURAI SHODOWN II\"!\nSpread the word and don't miss out on this unique opportunity to play \"SAMURAI SHODOWN II\" with your friends!\nSAMURAI SHODOWN II, the sword-based fighting game masterpiece has finally cut its way to iOS devices!\nSlash the powerful adversaries standing in your path, and put a stop to Mizuki Rashojin's evil ambitions!\nFeatures:\nThe fan favourite installment in SNK's highly acclaimed series!\nThe 2nd episode of the SAMURAI SHODOWN Series, is still beloved by fans of the series all across the world.\nPreserving the charm of the first game, its sequel brings the characters, world, and game system to the next level.\nAn incredible cast of 15 charismatic master swordmens head to the battlefield in order to fulfill their destiny.\nHaohmaru, Nakoruru, Ukyo Tachibana, Hanzo Hattori, Jubei Yagyu, and the rest of the 11 original characters return.\nGenjuro Kibagami, Cham Cham, Neinhalt Sieger, and Nicotine Caffeine come into play to complete the cast as the newcomers!\nA new and expanded move list! Disarm your rivals by unleashing a Weapon Smash Attack!\nForward Somersault, Backward Flip, Crouch, and even more moves have been added. A Weapon Smash can be performed when your Rage Gauge reaches its MAX!\nFinesse, or brute force? Let your hidden techniques express your fighting style!\nA perfect port of this NEOGEO classic, adding new features for an even better experience!\nIn addition to the original 4 button arcade experience,  a 6 button layout and SP button allow you to easily pull off  strong slashes and special moves by simply using the Touch Screen!\nChallenge your friends via Bluetooth!\nDual with your friends in a match through Bluetooth Multiplayer Mode!","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"SNK","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":2895,"name":"Stardust Vanguards","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a62/a628d55cec6bbfdc671012c2ae080d6c.jpg","description":"Get your friends and bust out the controllers, STARDUST VANGUARDS is a local four-player dueling game inspired by old-school anime space operas, combining arcade-style battling with the ability to summon your own NPC army as support!\nEach battle is unique with the game's random event system, forcing players to respond to dozens of potential surprise attacks by computer-controlled space pirates. The pirates can even win the whole battle themselves so perhaps a temporary truce is in order? STARDUST VANGUARDS brings fast-paced dueling, a dash of strategy, and plenty of bullets to competitive couch-multiplayer fans.Features Lightning-fast local (shared screen) multiplayer dueling that rewards precision\nSummon reinforcements as you earn reinforcement points (RP) by taking out enemies\nRandom event system with dozens of NPC space pirate scenarios. Trivial line attacks, pincer tactics, transport convoys, mercenary squads, fleet blitzkriegs, and more!\nSpace pirates are gunning to win the battle themselves. Will you team up with your rivals to stop them or use the moment to your advantage?\nUnlock 13 different battlefields each offering unique offensive and defensive strategies\nDeathmatch, Team Battles, Conquest (King of the Hill), and Space Ball Mode (soccer style capture the flag)\nCooperative Mode for 1 to 4 players with shared lives across three different difficulties and an endurance mode through all three\nCustom Deathmatch options let you build your perfect battle. Infinite ammo, swords only, reinforcement variables, pirate event regularity, and more!\nRocking in-game soundtrackNote:STARDUST VANGUARDS is a local multiplayer game (with no online functionality) and is recommended to be played with 4 Microsoft Xbox 360 controllers. The keyboard can alternatively be used as an input for one player.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zanrai Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":880,"name":"Robinson: The Journey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e78/e7892a28e3eb05f6798b02406d5e12c0.jpg","description":"A RICH WORLD\nExploring from a first-person perspective, gamers will encounter an array of dinosaurs and creatures that react to their presence within the ecosystem of Tyson III. An emphasis on interaction with their surroundings encourages players to examine each area of the game in detail – creating a dense atmosphere and adding to the sense that Tyson III is a goldmine of undiscovered secrets. The game places narrative at the center, with an engaging storyline unfolding as players explore.\nAN EXPLORER’S PARADISE\nThere’s something to discover around every corner. Wander off the beaten path to collect achievements, find rare items, and interact with the environment. With free movement, you can go wherever you want, choose how to progress, revisit places, and make the most of a non-linear story. There are no cutscenes in Robinson: The Journey, with every aspect of the story unfolding from the player’s perspective to retain a deep sense of immersion.\nA BEAUTIFUL JOURNEY\nRobinson: The Journey features a vibrant game world designed to make players feel truly present in unfamiliar territory, all powered by CRYENGINE to deliver stunning graphics, realistic sound, intense immersion, and a sense of scale that push the boundaries of VR gameplay.\nGRAPHIC FIDELITY AND VR\nBecause VR is still an emerging medium, VR development has brought with it a new set of creative and technical challenges. Robinson: The Journey has been created from the ground up to offer an immersive VR experience. Using the power of CRYENGINE, our team added new features and optimized pre-existing tools to meet those challenges and make Robinson one of the most stunning experiences currently available in VR.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crytek","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":947973,"name":"Halls Of Torment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d1/7d15645c0a34d07eaa3f4d5b2f77f5d0.jpg","description":"PRELUDE AVAILABLE NOWhttps://store.steampowered.com/app/2316660\nAbout the GameHalls of Torment is a horde survival game in a pre rendered retro look reminiscent of RPGs from the late 90s. Choose one of many hero characters and descend into the deadly Halls of Torment. Fight unholy horrors from beyond and survive wave after wave until you face one of the tormented lords. Advance your hero with character traits, abilities, and items. Create a new powerful build during each run. Explore various underground expanses and find new powerful items that enable you to venture even deeper into the abyss.FeaturesQuick and casual runs of maximum 30 minutes\nOld school pre rendered artstyle\nQuest based meta progression\nLarge selection of diverse abilities, traits, and items, all enabling you to create interesting synergies\nDiverse bosses featuring unique mechanics and attack patterns\nItems can be retrieved to the overworld and used to customize future runs\nDozens of interesting characters allowing many different playstyles\nUnlock and explore multiple interesting and challenging underground worlds\nInteractable environments: Use traps and hazards to your advantage!Early Access Content3+ stages unique environment\n7+ playable characters\n11+ different and upgradable abilities\n12+ unique bosses\n30+ unique monsters\n14+ blessings making you stronger for each attempt\n50+ different items to unlock and retrieve\n500+ traits that upgrade characters and abilities\n150+ quests to complete\nThis is the content the early access will start with and will be expanded on until the final release.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Chasing Carrots","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":428354,"name":"Poly Bridge 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35f/35f5abf86a809da1ad699376c6f88028.jpg","description":"The acclaimed bridge-building simulator is back and better than ever!\nNew levels, new mechanics, and a custom deterministic physics engine. Relax to the soothing new soundtrack as you try, and retry, to keep your bridges standing long enough to get to the other side!\nPinch every penny and cut every corner to edge your way up the separate verified Unbreaking and Unrestricted leaderboards. Create, upload, and play a never-ending variety of levels in Sandbox or Workshop. Challenge yourself, friends, and the world with your own puzzles.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Dry Cactus","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":359317,"name":"Coloring Game: Little City","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1d/f1d06ae023cf3f2454889e84963d6bc3.jpg","description":"Coloring Game: Pixelhttps://store.steampowered.com/app/1173830/Coloring_Game_Pixel/\nColoring Gamehttps://store.steampowered.com/app/1026820/Coloring_Game/\nAbout the GameA theme-based sequel of the popular Coloring Game (coloring by numbers). The sequel is dedicated to the life in the Little City.\nThe images have been designed to resemble isometric computer games. Complete the image – and the city will come to life again.\nThe game options are identical to those in the Coloring Game.You have access to 15 free images (>150,000px)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"}]},{"id":251599,"name":"Borderlands 2 VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d40/d4060516a4f6d5fdc2cdb155cef909d9.jpg","description":"Featured DLCBorderlands 2 VR BAMF DLC Pack\nBorderlands 2 VR just got a whole lot bigger for free! Get the Bad Ass Mega Fun DLC Pack and immerse yourself in fresh campaigns and locations, battle more enemies, and pursue an increased level cap!\nAbout the GameThe iconic shooter-looter gets in your face! Virtually immerse yourself in the untamed world of Borderlands. Step into the boots of a treasure-seeking Vault Hunter armed with 87 bazillion guns on a quest to line your pockets with loot. Blast bandits with real-world aiming, punch psychos in the mouth, race across the desert in stolen bandit vehicles and free Pandora from Handsome Jack’s clutches!PUT ON YOUR VIRTUAL BOOTSBecome one of four playable classes: Siren, Commando, Gunzerker and Assassin, each with unique skillsets and combat styles!GET VIRTUALLY LOADEDShoot-and-loot with bazillions of procedurally-generated guns, each with their own capabilities and modifiers. Plus, lust after procedurally-generated shields, grenades, relics, class mods and more for maximum power and mayhem!VIRTUALLY STOP TIMEUse the new Slow-Mo ability to set up your next attack! Plus, with Teleport, glide across Pandora as gracefully as ClapTrap, if he had grace.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":61408,"name":"Kynseed","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec7/ec7038248499012a9c1c0630667190bd.jpg","description":"Kynseed is a sandbox RPG adventure life sim brought to you by developers who worked on the Fable series for Lionhead Studios.\nLive your life in a quirky world where everyone ages and dies, including your pets! Take control of the mystical Kynseed and grow your family legacy over generations as you pass your skills and powers down to your children.\nRun a business such as a blacksmith, tavern, apothecary, or goods store.\nGo adventuring in dangerous regions and battle dark faery tale creatures.\nFarm your land to create various ingredients that you'll come to rely on.\nDevelop relationships with NPC’s who have their own lives and loves, and who will remember your deeds, actions and pranks!\nFind proverbs to unlock the secrets of each ingredient, creature and inhabitant of a place where folk tales are all true.\nGather materials to create better items, craft beers, or to mix cures for a range of bizarre maladies that sometimes afflict the simple people of the land.\nBuy strange artifacts from the mysterious Fae gentleman, Mr Fairweather, which can aid your chores, help you in combat, or let you just mess with the world - but be aware of the life tax he extracts annually!\nIn Kynseed, live your lives the way you choose in a lovingly hand-crafted 2D open world.\nABOUT PIXELCOUNT STUDIOS\nWe are a team of little pigs building a brick house to keep the wolf from the door. With over 30 years of collective experience developing the Fable series and its community, we hope to infuse our games with the same charm, eccentricity, and humour that permeated that series.\nUsing all their experiences from Lionhead, the team is working hard to make Kynseed the sort of game they’d always wished had been made. To help us on this journey, we’ll be calling upon the PixelCount community (that’s you!) to give us feedback, guidance, and flattery. Mainly the latter, if we’re being honest.\nUltimately, we want to keep it real with the players and never feed them a company line. So, for better or worse, you can expect us to talk to you with the same honesty and candor as a coworker: with plenty of cursing and sarcasm.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"PixelCount Studios","platforms":[{"id":0,"name":"PC"}]},{"id":58824,"name":"Xenoblade Chronicles 2: Torna ~ The Golden Country","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35b/35b514c99b084d6b14ceb37181113645.jpg","description":"Guide a group of legendary warriors on a journey through the tragic history that doomed a kingdom and drove a hero down a dark path 500 years before the events of the Xenoblade Chronicles™ 2 game. Defend yourself from Malos and his forces using all the fury of this refined battle system, allowing you to fight as both the artificial lifeforms known as Blades and their masters, the Drivers.\nDoes not include the main Xenoblade Chronicles 2 game.\nBoth the retail and digital editions contain a download code for packs 1-4 of the Xenoblade Chronicles 2 Expansion Pass. Expansion Pass only playable with the main Xenoblade Chronicles 2 game (sold separately).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Monolith Soft","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":52662,"name":"Alone in the Dark 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/782/78291f6f8efc9883ef9c3e7ba1d48f94.jpg","description":"The sequel to the critically acclaimed Alone in the Dark, this new adventure sees our hero, Edward Carnby, in 1923 confronting the many faces of evil in the darkness of Derceto, a house in which entering is the easy part and leaving could be hell!","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Infogrames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"},{"id":0,"name":"3DO"}]},{"id":22808,"name":"Forgotten Realms: Demon Stone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a18/a1865fa805a6731da4518595cd4b5e3e.jpg","description":"Three adventurers that have met by chance find the Demon Stone, an ancient prison, just as it breaks before their eyes. The contained evil is unleashed and the two wicked spirits of a Githyanki general and a Slaad lord once again threaten the world.\nYou take control of three heroes: Rannek the fighter, Illius the sorcerer, and Zhai the rogue. Each of them has his or her own unique set of spells. Switch between them any time you want, using their abilities to your advantage. As you progress through the game, your heroes gain levels, learn new skills and acquire powerful items. You will need them all to have even the slightest chance of defeating the ancient evil you stand against.Switch seamlessly between your party of a fighter, a sorcerer, and a rogue, strategically using devastating combinations of stealth, magic, and power\nIntense storyline developed by New York Times bestselling fantasy author R.A. Salvatore\nTop notch voice acting preformed by Patrick Stewart and Michael Clarke Duncan, and enchanting soundtrack","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Stormfront Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":22259,"name":"Kimmy","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f3/3f345350f3da7eeb09b915789d48954b.jpg","description":"Kimmy is a visual novel style game about a summer spent babysitting in late 1960s Massachusetts. You play as Dana, who stumbles across Kimmy--a tiny girl wandering around alone in her neighborhood. Dana decides to take Kimmy under her wing, worried that she's having trouble making friends, and decides to be her babysitter. Let summer begin! Collect trinkets, play street games, and learn more and more about Kimmy and her mysterious family as summer passes by.\nFeatures:\nA dialogue rich story that takes place over the course of 5 acts.\nOver 10 characters to chat with and get to know throughout the story.\nA painterly art-style brings the characters to life, including multiple illustrated cut scenes.\nAn intimate story about childhood, honesty and growing up.\nRecommendations and Notes\nA single play through takes about 2 to 3 hours.\nPlay multiple times to see all of the conversations.\nHeadphones are recommended.\nContent warning:\nKimmy is a game about childhood, but it does address some more serious issues and is primarily intended for adults. There are conversations between the characters about things like death, profanities and alcohol. Please consider this before playing this game with younger kids.\nCredits:\nDesigned and written by: Nina Freeman\nIllustrated and written by: Laura Knetzger\nProgrammed by: Aaron Freedman\nOST Composed by: Louie Zong\nSound design by: Amos Roddy\nSpecial thanks to Noel Clark for the Kimmy logo design.\nKimmy was originally commissioned by Humble Bundle as a part of the Humble Monthly Bundle, released to subscribers in January of 2017. Special thanks to Humble Bundle for their support in the development of Kimmy!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Star Maid Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21652,"name":"Legends of Persia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8dc/8dc7ade638f7e343129fdf99a192aefe.jpg","description":"Legends of Persia is a highly ambitious Action RPG Adventure which incorporating bloody battles, item usage, character building, and storyline incorporation. The storyline revolves around Keykhosro, the son of the Persian prince Siavosh, who in the name of his father’s blood seeks to take revenge upon Afrasiab, the king of Tooran. Throughout the game, the character will face difficult challenges to overcome, such as defeating massive waves of enemies, encountering difficult bosses, and finally dealing with Afriasiab, his father’s killer.Game Mechanics\n5 attractive locations and more than 200 weapons and items to use, ‘Legends Of Persia’ is packed full of features! The game will also include 3 different hero characters, and lots of unique challenging enemies. Already a thriving and popular game on Steam Greenlight, prepare to get blown away with the addictive gameplay and fantastic graphics!Key Features\n•\tWide Range of Magic spells and abilities to use\n•\tHundreds of items\n•\tMenacing boss battles\n•\t3 characters to choose from.\n•\tExperience the dramatic events between seasons through a brand new original story!\n•\tBuilt from the ground up to support modding (editor will be available soon )\n•\tOngoing free updates ( upcoming updates will be free charge for customers who purchase this game )\n•\tMany expansions available post-release.Story\nAt the height of the glorious Persian king KayKavoos' reign, he had dominance over half the lands of his age. Seeking to cement his legend, he looked next to conquering the heavens.\nLashing a great sky chariot to four mighty birds, the lord of Persia ascended far above the earth.\nBefore the king's ambition could be fully realized, an angel appeared to quell his flight. But as the celestial creature prepared to strike down the Persian king, the glowing spirit of a child materialized.\n“Stay your hand, angel! I am KayKhosro, this great king's yet-unborn son. If you destroy this man for his arrogance now, you destroy me! To rob him of his present would be to rob me of my future.”\nThe angel paused, considered the spirit's words, and sent the zealous King's chariot crashing down to the realm of Earth from whence it came.\n“I am forbidden from severing your bloodline, and have returned your ancestor to his kingdom alive, but the burdens upon you are heavy, indeed.”\nThe angel embraced the spirit child, imparting these words.\n“You will be born into an age of conflict, your ancestors beset upon each other with steel and cruelty, and your people will look to you for guidance. One day, evil will descend upon the borders of Persia, and you must be ready.\nNow, rest, child. Your time has yet to come...”","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sourena Game Studio","platforms":[{"id":0,"name":"PC"}]},{"id":20182,"name":"Whisper of a Rose","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/781/781b2a0eba4711081a48f36fd4082f8e.jpg","description":"Melrose is trapped in a life of hardship. Her parents are mean to her and she gets bullied at school. She can find no one who understands her. To cope with her sorrow, Melrose turns to her imagination. She dreams up a world of unimaginable beauty and happiness, but sadly -- like all dreams -- it ends, and Melrose must return to real life.\nToday is different, however. Melrose is about to meet her godmother and discover that the land in her dreams is real and in trouble.\nOn her journey with the sparky ladybug Diamond, a warmhearted witch and a sassy secret agent, Melrose becomes the main player in an escalating battle between light and darkness that stretches beyond the world of dreams.\nThis game features:\nOver 40 magical lands in an open world\n25+ hours of story-driven adventure\nSummon dream creatures and craft items\n45 beautiful original music tracks\nNumerous side-quests, secrets and puzzles\nLoveable, unique characters\nCustomizable skills\nSupports mouse, controller / gamepad and keyboard controls\nWhisper of a Rose features a wondrous, intricately detailed world. Take your time to explore, relax and have fun!\nThe 2014 Version of Whisper of a Rose with Steam Achievements and Trading Cards.Other Games by RosePortal Games on Steam:Sweet Lily Dreams\nThe Princess' Heart\nUnraveled","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"RosePortal Games","platforms":[{"id":0,"name":"PC"}]},{"id":19693,"name":"The Next Penelope","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/574/574ab1c9a0f421017f5fb8b18989366c.jpg","description":"Set in a futuristic Odyssey, \"The Next Penelope\" is a fast paced action racing game with loud colors, an original story and a challenging risk-reward system.\nIf you've played a MicroMachines game, you'll feel right at home with the controls! (An alternative control scheme is available for newcomers as well.)\nWeapons can be mixed and used at any time, but all these abilities cost vital energy, so the player is very powerful and close to death at the same time!\nAs Penelope is looking for Ulysses through the galaxy, the player is free to explore the planets in any order. Each world features unique situations, races, even bosses, and new permanent abilities to enhance Penelope's spaceship.\nFirst released as an early access, The Next Penelope has known 6 months of additional development with the help of the community, and has now new features such as local multiplayer (up to 4 friends on the same keyboard!), more solo content, new languages and options ...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Seaven Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18767,"name":"The Minotaur","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c21/c216a8910e93af9ff1a23ac637711a3b.jpg","description":"Four humans have been put to test by the Gods of the Ancient Greece, they shall face the minotaurs in the labyrinth. To survive, the must show their wisdom and solve the traps inside the labyrinth, all while avoiding the minotaurs. Their goal is to reach the last room, where the exit will be shown and they can finally be free.\nInspired by the classic MS-DOS game “The Beast”, we have created a game with new graphics and game modes. Playing The Minotaur you will feel the nostalgia for those old school games where your only goal was to get as far as possible or the highest score. The game also has full gamepad compatibility, so do not worry if you don’t like playing on keyboard ;)\nThe Minotaur also includes several game modes:\nArcade:\nIt’s the classic mode, where the player has to fight his way through 30 levels with increasing difficulty, including different minotaurs, minotaur eggs, etc.\nTime Attack:\nSimilar to Arcade, the player needs to finish the level all 30 levels in a certain amount of time. Killing the minotaurs or their eggs will grant extra time.\nEndless:\nIf you think you beat the game, try this mode with the endless levels. Really, this mode never end!\nOne Life\nYou are the untouchable human? Demonstrate that with this mode where you die by one hit.\nLocal Co-op:\nIf you have trouble defeating the beasts, ask a friend for help! Or a family member, or maybe even your dog can help you. Up to four players, so the more the merrier.\nLocal VS\nThis game mode allows the players to fight against themselves. Great for challenging your friends and competing to be the very best, or simply relax by killing your acquaintances.\nTrials:\nPlayers will need to find their ways through a series of hand-made levels. Some of them might even have only four blocks to kill the minotaurs (ง︡'-'︠)ง.\nLevel Editor:\nTired of playing the classic levels? Bored by the challenges? No problem, you will be able to create your own level maps.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17678,"name":"Moebius: Empire Rising","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb8/fb8e03f32371cdb8d6c6c8b104b9fc3b.jpg","description":"This thrilling new adventure game from master storyteller Jane Jensen (Gabriel Knight, Gray Matter) and Phoenix Online Studios (Cognition, The Silver Lining) introduces Malachi Rector, an expert in antiquities whose photographic memory and eye for detail transform people and clues into interactive puzzles.\nWhen a secretive government agency enlists him to determine whether a murdered woman in Venice resembles any particular historical figure, Malachi is left with only questions. Why would the U.S. government hire him -- a dealer of high-end antiques -- to look into a foreign murder? Why does David Walker, a former Special Forces operative he meets in his travels, feel like someone Malachi’s known all his life? And how come every time Malachi lets his guard down, someone tries to kill him?\nMoebius: Empire Rising is a contemporary adventure that merges classic point-and-click puzzle solving with Jane Jensen’s sophisticated storytelling. Travel the world using Malachi’s unique deductive powers to analyze suspects, make historical connections, and uncover the truth behind a theory of space and time the government will defend at any cost.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phoenix Online Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17615,"name":"Metrocide","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae4/ae4808018d88b345a37a3a3dd9256b36.jpg","description":"Metrocide is a relentless single-player stealth action game in which you play as a contract killer: the notorious T.J. Trench.\nYou will have to negotiate a fierce and brutal city replete with gangs, vigilantes, cops and more, taking out the trash one contract at a time. While cop drones circle overhead, you’ll be sticking to the alleyways with a variety of weapons and plantable explosives finding new and unique ways to get away with murder most foul. But one single slip-up will cost you. There are no respawns here – when you’re dead, you’re dead. That’s it.\nYou play as Trench, taking out the trash one target at a time. Play through the three zones of retro-futuristic and cyberpunk-inspired MetroCity earning cash for completing kills in this brutal stealth-action game inspired by such classics as Syndicate and Grand Theft Auto.\nDuck and weave through the claustrophobic streets and alleys as a living city does its best to stop you breathing - permanently.\nThe game came out of the Cyberpunk Game Jam in early 2014, but rather than get submitted at the end of the jam, was kept under lock and key and worked on as a full Flat Earth release.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Flat Earth Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9992,"name":"Eador. Imperium","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/faa/faae90a0b3be749a88165f7c235aebcc.jpg","description":"Hire heroes, build an army, prevail in battles and try to keep your empire intact in the face of grave danger.\nEador. Imperium is a new chapter in Eador series, known for its unique blend of grand strategy, turn-based tactics and RPG elements.Story\nA young wizard pursuing his revenge against the fanatics who have ruined his life. A barbarian priestess searching for a higher purpose for her people. A mercenary facing the abyss about to consume his home. A governor appointed to rule over a defiant province in times of great crisis.\nThreads of their lives will weave a strange pattern, for the destiny of the Imperium is at stake.Features\nAll new and handcrafted story campaign, bringing a fresh approach to the Eador formula.\nNew heroes, new units and unique Shard worlds offer even more strategic possibilities and unexpected challenges.\nThe ultimate Eador game: Imperium includes all original content from Masters of the Broken World (not counting the campaign).","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Snowbird Games","platforms":[{"id":0,"name":"PC"}]},{"id":775904,"name":"10 Minutes Till Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17f/17f838b292fe1ccc1b4824f68ccebb3b.jpg","description":"Wishlist the Full VersionThe full version will include more characters, weapons, enemies, and game modes!\nhttps://store.steampowered.com/app/1966900/20_Minutes_Till_Dawn/\nAbout the GameSurvive the onslaught of an endless horde of monsters for 10 minutes! This is the free version of 20 Minutes Till Dawn.Unique Builds Every RunIn this roguelite survival game, select from a variety of upgrades to create a unique and overpowered builds every run.\nSelect Your HeroChoose from a diverse selection of characters and weapons that offer a variety of gameplay experiences.\nFeatures Over 50 different upgrades too choose from for a unique experience every run!\nWide cast of characters, with more to come post-launch.\nCasual quick 5-10 minute play sessions, for busy gamers.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"flanne","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Web"}]},{"id":401804,"name":"Ys IX: Monstrum Nox","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e0/4e01779807f21e9b21b315e510191c55.jpg","description":"Ys IX: Monstrum Nox takes place in Balduq, northeast of Esteria in the Gllia region under Romun control. Balduq is known as 'the prison city' for its large prison facility inside the town and its architecture featuring high walls as a result of being built upon the fortified era. Furthermore the city is an important nexus for transportation in the region resulting in a wide range of inns, bars and trade centers. In more recent years public facilities such as theaters and baths are starting to be developed too.\n\nIn more recent years rumours of beings called \"Monstrum\" are said to have started appearing creating a huge fuss with its residents. The Monstrum are said to possess unique supernatural abilities, some of them seem to be helping the poor and helpless, others are outlaws up to no good. This dichotomy results in the villagers becoming scared/wary of them.\n\nBalduq Prison, located at the edge of the city, supposedly is the largest prison facility of the Romun empire. Originally it was a fortress built to protect the Romun border, it is more recently that it has been repurposed as a prison facility. Featuring only one entrance through a drawbridge and surrounded by steep rock walls and deep moats it is said to be inescapable. The townsfolk does not hold the prison facility in high regard as the facility also is used to detain critics of the empire as does it detain political prisoners.\n\nSource: https://isu.fandom.com/","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Engine Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":351773,"name":"HyperDot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e89/e8942409f8c12f936445681dc0e94d60.jpg","description":"HyperDot is a minimal action arcade masterpiece with one rule: dodge everything. Evade enemies and test your skills in over 100 trials in the campaign mode, outlast your friends in multiplayer battles, or build custom challenges with the level editor.Features\nCAMPAIGN MODE\nDodge your way through over 100 hand-crafted levels and trials in the single player campaign\nBETTER WITH FRIENDS\nLocal co-op play with an elegant drop-in/drop-out system to get you and your friends in-game fast\nLEVEL EDITOR\nUnlimited possibilities to create one-of-a-kind levels, from stunning patterns to relentlessly difficult challenges\nNEVER PLAY THE SAME GAME TWICE\nExtensive game play customization with more than 1 million enemy, arena, & modifier combinations\nPLAY WITHOUT COMPROMISES\nHigh contrast mode, adaptive controller integration, and even full game play support with eye-tracking technology for optimal accessibility","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tribe Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":62964,"name":"Cat Burglar: A Tail of Purrsuit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f0c/f0cbd9da5021376c52c0f60a14adcbf5.jpg","description":"Cat Burglar: A Tail of Purrsuit is a stealthy puzzle platformer adventure of a cat's quest to get one over on the dastardly dogs.\nBy playing as Kat and clearing each level you will unlock Pet charities and get an opportunity to learn more about these great organizations and how you can help.\nKat must sneak her way through 7 different levels to best the dogs and escape with the LOOTS!\nGAMERS FOR GOOD BACKSTORY:\nGamers for Good was formed in 2012 as a result of a group of Game Devs wanting to work together for a greater cause.\nWe have published 2 charity artbooks supporting causes like mental health awareness and cancer research, As we move into game development we seek to provide answers to the age old question; \"How can I give back as a gamer?\" Specifically as a game developer. we hope to provide multiple replicable examples for the industry.\nWe provide community service opportunities, charitable giving projects as well as gaming related service options.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Gamers for Good","platforms":[{"id":0,"name":"PC"}]},{"id":59010,"name":"Myst IV: Revelation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a71/a714ce16b936ec2213ad8277b25b6347.jpg","description":"Buried lies. Sinister truths. Piece Together a Shattered Past\nAt the heart of every family lie secrets that must come to light.\nUnravel an intricate mystery: Solve elusive puzzles and enlist the help of other characters as you uncover secrets left buried since the original Myst. Live-action cut-scenes draw you deeper into the labyrinthine plot.\nAdventure through rich and vital worlds: Myst's astonishing new visuals will enthrall you with opulent landscapes brimming with life. Interact with the environment that surrounds you and become part of the mystery.\nOriginal music by Jack Wall & music for the portal to Serenia by Peter Gabriel: Drift away on an ambient soundtrack composed by Jack Wall and a special contribution by world-renowned artist Peter Gabriel.\nBring along a guide: Take advantage of the optional multi-layered help system, including illuminating flashbacks of previous Myst episodes and intuitive Zip mode that transports you from place to place.\nRecord your discoveries: Capture clues by taking original photographs of Myst's lush environments, and keep track of your explorations in your in-game journal.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PC"}]},{"id":39354,"name":"Guilty Gear 2: Overture","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b89/b89f83c3cd8127883407b0b7c6070508.jpg","description":"Feature ListPURCHASE BONUS12 selected song tracks come with every purchase of GUILTY GEAR 2 -OVERTURE-!\n▼Soundtrack List\n01 Keep Yourself AliveIII (Sol GG2 Theme)\n02 Ride on Time (Sin GG2 Theme)\n03 Intellect & Reason.and the Wild (Dr. Paradigm GG2 Theme)\n04 昼行灯 (Izuna GG2 Theme)\n05 The Mask Does Not Laugh (Valentine GG2 Theme)\n06 Holy Orders(Be Just Or Be Dead) (Ky GG2 Theme)\n07 Worthless as the Sun Above Clouds (Raven GG2 Theme)\n08 Misadventure (Mirror Match GG2 Theme)\n09 The Re-coming (Sol VS Ky GG2 Theme)\n10 Communication (Sin VS Ky GG2 Theme)\n11 Dignity (Stage 19 BGM)\n12 Diva (Stage 20 BGM)\nSongs are placed in a separate folder, in your Steam install directory:\n...\\Steam\\steamapps\\common\\GG2\\Digital Extras\nAbout the GameThe ultimate melee action [GUILTY GEAR 2 -OVERTURE-] is now on Steam!!\nPushing [Gameplay] and [Entertainment] to the extremes, with a splash of [Competitiveness] -- That's GUILTY GEAR 2 for you.Real Time Strategy (RTS) X 3D Battle ActionTwo completely different game systems carried out in a fast paced real-time environment.\nBe the commander of your troops, and also be the frontline hero of your army, battling enemy forces head-on while giving out commands!A whole new experience with the \"Battle X Command\"!Combine your own blend of Action and Strategy and seize victory into your hands!!\nPlayer-controlled \"Master\" comes equipped with an arsenal of actions available!\nDash across the battlefield with the Blast Drive!\nChain up attack combos with the myriad attack patterns!\nSteps, Aerial Dashes, Special Attacks -- Use them to their greatest potential to score victory!\nCharge your tension gauge to MAX and unleash devastating Overdrives upon your foes!\nMicro-manage your troops and lead them to victory!\nAdvance together with your units, and capture enemy bases!\nOver 50 different units, each with their unique actions and abilities!The battle environment can change from a full-fledged army war to a sudden-death duel between Masters in the blink of an eye!Plentiful Game Modes!Campaign\nExhibition\nTraining\nFreeMission\nOption\nReplay Viewer\nOnline (*) *Currently only \"Player Match\" is available. \"Rank Match\" and \"Rankings\" will be implemented at a later date.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Arc System Works","platforms":[{"id":0,"name":"PC"}]},{"id":23225,"name":"Ravenfield","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be6/be67bcfa3e96c8d2ec271d4a860b6bc7.jpg","description":"Fight upon the Ravenfield together with your Blue allies! Take down those pesky Reds using helicopters, tanks, guns, and active ragdoll physics!\nRavenfield is a singleplayer game in the vein of older team-vs-team AI shooters. The game is designed to be easy to pick up and play, but also rewarding for all skill levels!Key FeaturesEasy-to-pickup, singleplayer mayhem\nFight as infantry, or in ground vehicles, aircraft, or watercraft\nActive ragdoll physics combines tactical strategies with a sprinkle of silly fun\nThe number of combatants is only limited by what your computer can handle!\nDamaged soldiers drop team-colored blood splats, indicating where battles have taken placeDevelopment RoadmapRavenfield is being developed as an early access game, with major content updates scheduled to be released every 4-6 weeks. Additionally, minor updates may be distributed via a beta branch for those who do not fear slightly more buggy releases.\nWhile some content, such as new weapons, vehicles and maps will be released on a regular basis, other key features will be added roughly in the following order:\nCustom map support\nSteam Workshop integration\nAI Commanding\nCampaign mode\nCustom vehicle support\nCustom weapon support","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SteelRaven7","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21408,"name":"GAUGE","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c5/8c5aa1934f40594214e469e64aeb8971.jpg","description":"Gauge is an experimental and minimalistic sport game.\nThe end does exist, can you reach it?\n-----\n- 5 game modes (Normal, Baby, Hard, Time, Touch)\n- 23 Steam achievements\n- Tons of Psychedelic effects\n- Electronic music, jokes and LOLcats\n-----\nRead before playing:\nA very small percentage of individuals may experience epileptic seizures when exposed to certain light patterns or flashing lights. If you, or anyone in your family, have an epileptic condition, consult your physician prior to playing.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Étienne Périn","platforms":[{"id":0,"name":"PC"}]},{"id":21316,"name":"Metal Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c2/4c2462a1efcd1edbfd85c90b954400ee.jpg","description":"Starships dropping thousands of combat machines on the planet's surface. Battles are conducted continuously. New warriors comes again and again to replace the fallens. Millions tons of metal has covered the land. War is never ends on this planet - Metal Planet.\nThe game is set on a distant planet called Metal Planet. Two corporations are fighting for control of a valuable resource capable of transforming matter. You take on the role of a soldier with equipped power armor and powerful weapon.Features: Fight against AI and other players in a multiplayer game.\n4 game modes.\n3-class fighters.\nModules to improve armor and weapons.\nHuge bosses for co-op mode.\nLasers and smart ricochet bullets.\nAnd BFG!\nHurricane shooting, tons of explosives, destructible environments, boss battles and more in Metal Planet.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pavel Bulatov","platforms":[{"id":0,"name":"PC"}]},{"id":20435,"name":"World of Mixed Martial Arts 3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f61/f6123b35fa55fa1c2644e7de287c6a69.jpg","description":"Step into the world of MMA in World of Mixed Martial Arts 3. In this simulation title, you control every aspect of the MMA world. Take control of an MMA company and run it the way you want. Decide who to hire, what matches will take place, and who doesn't make the cut! Train fighters, negotiate contracts, watch matches unfold in real time with detailed commentary, and much, much more! Can you make it to the top of the industry?Features:\nHighly detailed fighters, with a multitude of statistics covering all major elements of MMA, from striking to jiu jitsu.\nAdvanced play-by-play engine where the player can watch fights unfold in real time via detailed commentary.\nIn-game web site keeps you up to date on all the happenings and fighter rankings around the game world. Automatic archiving keeps track of the details for every fight.\nDeal with injuries, fight refusals, upsets, money wrangles, bad calls and more.\nHigh pressure contract negotiations with fighters. Will you play it safe or call his bluff?\nFull detailed and intuitive game editor allows in-depth customization.\nLarge game world featuring 90 separate regions, including North America, Japan, the UK and Asia.\nWatch matches that are being held on other promotion's shows \"live\" as they happen.\nPost-show bonus awards: Knock Out Of The Night, Submission Of The Night, and Fight Of The Night.\nBad Calls. Referees can now make controversial (or just flat-out wrong) decisions during a match. How will you react?\nCompetitive Credibility. This is a measure of the quality of a promotion's roster and is used to simulate the fans' view of the fighters.\nCreative Striking is a new stat that measures the variety of unorthodox, unusual or spectacular strikes that a fighter can use, such as spinning kicks, spinning elbows, flying knees and other crowd-pleasing moves.\nSubmission Knowledge. Submission Knowledge measures which submission holds a fighter has access to. A fighter with a very high score will have moves like gogoplatas, peruvian neckties and rolling kneebars in his arsenal.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grey Dog Software","platforms":[{"id":0,"name":"PC"}]},{"id":19843,"name":"Bullet Life 2010","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f75/f7557ca120bc90c5ea0bbe0abd122bd0.jpg","description":"Bullet Life, originally released in 2010, was the very first video game ever published with the design as a full on 3D Bullet Hell Shooter. This is our first ever game, brought back from the archives. Fly through the skies as and blast your way through enemies with a more stratify based shooting system! Use guns, rockets, hover canons, and more and weave through hundreds of bullets!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"From Soy Sauce","platforms":[{"id":0,"name":"PC"}]},{"id":19358,"name":"Ubersoldier II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/138/138304fd3ef10d6f33e9c0824f855b80.jpg","description":"A tightly knit group of SS generals and officers, involved in the most heinous\nand dark deeds, is seeking a way to save the remnants of the Third Empire. They\nhave conspired to move the leaders of the Reich, together with precious resources\nand classified equipment, to a remote hideout in the Tibetan mountains.\nFeatures:\nFull multiplayer through LAN and Internet with up to 16 players.\n21 weapons, including look-alikes of “Luger Parabellum”, “Tommy Gun”, MG-42, BAR and Panzerschreck.\nDozens of types of brutal enemies, including armor valkyries and telekinetic mutants.\nRPG features, including special abilities and accumulation of experience.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Burut CT","platforms":[{"id":0,"name":"PC"}]},{"id":18707,"name":"Shonen Idle Z","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0c/c0c8b27539b7eba25d1b8259012876c6.jpg","description":"Do you like Anime and Manga? Would you like to be the main character of your own story? With Shonen Idle Z you can create your own character and be the hero! Train hard, increase your martial skills and advance through the world getting rid of the evil Kurowashi and his army of monsters.Features\nCharacter creation: Select your gender, hairstyle, eyes, nose, mouth, hair color and eye color and you are ready to go! (you can select black eyebrows if you are a classic manga lover).\nTrainings: As you grow stronger you will get more powerful techniques! Master them to improve their performance and get even stronger! over 45 techniques will unlock as you grow stronger.\nCollectibles: As you advance through the map you'll find new clothing and befriend yokais to help you out!\nMissions: Achieve milestones to earn rewards and bonuses!\nMonsters: 400 different monsters to combat as you advance through the map!\nBosses: Beat a boss in every zone to set it free!\nParty: Companions to hire and ease your journey to free the world from evildoers.\nOffline mode\nAnd more to come!...Upcoming\nWe are still working actively on the game and there are a lot of things to come.\nMore companions to come! With new ways of getting help!\nNew systems to improve your character.\nA new kind of collectible.\nnew zones.\nand more!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Zakos Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16062,"name":"Hello Charlotte","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93d/93d97fd2fa7fceeec056a2dacabbe235.jpg","description":"Intro Hello, new Puppeteer!\nMeet Charlotte - a puppet you will control. Meet her alien friends, maggot cat and a certain Observer.\nDive deep into horrors of junk food, TV world, religion and romance novels for middle-age women. Keep your puppet safe at all times. Or don't.\nHave fun dying!Description\nHello Charlotte is an episodic game, where each episode can be considered a separate story, as they differ in storytelling style, themes and illustrations, but the characters stay the same.\nHello Charlotte EP1 is a minimalist freeware RPGmaker horror parody game published in 2015. It is available for free download as a demo and on itch.io: https://etherane.itch.io/hello-charlotte-ep1.\nHello Charlotte EP2 is a visual novel-esque psychological thriller puzzle with Memphis aesthetics and a philosophy of its own, published in 2016.Hello Charlotte: Delirium is a spin-off horror game, made to test some of the RPG Maker features: https://etherane.itch.io/hello-charlotte-delirium.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"etherane","platforms":[{"id":0,"name":"PC"}]},{"id":10782,"name":"Quest Hunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a5/0a552a3afb124eacbb84b720a05d6150.jpg","description":"Welcome to the Dark World. The world that is ruled by its own laws. The world where fire is the main treasure, and a shovel is a loyal friend and assistant. There’s enough trouble for villains here but there's double trouble for heroes. As a hero you will have to:\nLevel up and equip yourself.\nClaim some space for your camp from the Dark World.\nAssemble a team of friends and helpers.\nBuild and protect your camp.\nSolve the puzzles of old times.\nDestroy the insidious plans of enemies.\nFind and unearth many treasures.\nSave the princess and the whole world at the same time.\nQuest Hunter is a story-driven RPG with treasure hunt, non-linear dialogues, puzzles and humor! Mysterious world, fascinating plot, interesting puzzles and insidious enemies are waiting for you!Basic FeaturesStory-driven RPG: influence the storyline, choosing the answers in the dialogues. Untangle the insidious plans of your enemies and bring them out into the open. Save the world from the eternal darkness!\nCooperative mode: play the game online with your friends. Fight against evil shoulder to shoulder or make a mass grave in the enemy’s lair!\nRandom generated dungeons: try your luck, see if you can find the way out of the dungeon. Where could it be this time? Who’s waiting for you around the corner?\nQuests and puzzles: move, turn, light, switch over, dig up… In short, solve a variety of quests and puzzles. Search for treasure maps to become the richest man in the camp!\nSkills and super powers: upgrade the character attributes and explore new skills. Become an invincible killing machine and turn your enemies into dust!\nWeapons, armor and items: find, create and upgrade your weapon and armor. Cook potions or make bombs. Take a shovel and a straw hat or a sharp blade and a helmet – it’s up to you to decide!\nMonsters and bosses: mysterious beasts from the darkness – light the torch and they will scatter away. Insidious bandits – give them your money and you’ll stay alive. Cunning bosses – find your approach to them!\nTreasure and trophies: stuff your pockets with trophies of your defeated enemies. Find all stashes and hiding places. Dig up all the treasures of the Dark World!\nAnd remember: you are safe only by the light of the torch!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"2 Zombie Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":10128,"name":"Toukiden 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/134/134ea39817a9ab765cd17ec091c1ac24.jpg","description":"Slayers! Go forth and eradicate the Oni menace! Experience the latest hunting action game featuring a dynamic targeted destruction system!\nThe latest installment in the hunting action series \"Toukiden\".  From the battlefield to the village that serves as your base of operations, the game takes place in a vast \"open world\".  Explore the vast world for yourself, and enjoy hunting action from an entirely new perspective.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":718197,"name":"Electrician Simulator - First Shock","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d1/9d1ce4e41d9545d12f81d17202c691da.jpg","description":"Check other cool simulatorshttps://store.steampowered.com/app/1080020/Electrician_Simulator/\nhttps://store.steampowered.com/app/1031120/Bakery_Simulator\nhttps://store.steampowered.com/app/944250/Castle_Flipper/\nAbout the Game\nSince you were a kid, you wanted to be an electrician like your Dad.\nNow the time has come and he’s decided to teach you the basics of an electrician’s job so that you have an easier start once you set off on your own. Why go on a vacation during the school holidays if you can stay at home with Dad and learn something useful?Remember: This is just the beginning of your adventure as an electrician!https://store.steampowered.com/app/1080020/Electrician_Simulator/\nThis is a free-to-play prologue to Electrician Simulator. KEY FEATURESRepairing sockets and switches\nLaying cables\nFixing devices on the workbench\nPERFORM REPAIRS\nManufacturer’s warranty only lasts a short while and new appliances are expensive. Fix some small electrical equipment for quick cash.\nDAYLIGHT/BULB LIGHT\nBring power and light to varied interiors.\nEND RESULT\nA stunning end result is what you and your clients want. Brighten up those gloomy interiors, provide electricity to dead plugs, or turn the power off completely.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Take IT Studio!","platforms":[{"id":0,"name":"PC"}]},{"id":517383,"name":"Bridge Constructor: The Walking Dead","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/176/17628bec5c40970dc5d1b9b672994d95.jpg","description":"Experience the fun of KILLING WALKERS using the POWER of your BRAIN!\nPrepare for the ultimate mashup experience! Bridge Constructor: The Walking Dead combines the legendary and challenging puzzle gameplay of Bridge Constructor™ with the post-apocalyptic zombie universe of AMC’s The Walking Dead.\nJoin a group of survivors as they fight against hordes of undead walkers and a hostile human community. Build bridges and other constructions through bleak landscapes and ruined structures. Team up with fan-favorite characters like Daryl, Michonne and Eugene, and create safe passage for iconic vehicles from the series.\nUse movable level objects, explosives and baits to your advantage as you lure walkers into lethal traps and guide your survivors to safety. Enjoy the physics-based frenzy and ragdoll animations as walkers succumb to the forces of gravity.\nFEATURES\nAMC’s The Walking Dead meets Bridge Constructor™\nCreate elaborate constructions and lethal traps\nA captivating plot featuring new faces as well as iconic characters and vehicles from the series\nNumerous brainteasing levels and countless brain-eating walkers\nMake use of movable objects and explosives to lure walkers to their doom.\nSave your survivors and smash the undead hordes\nBrutally funny walker ragdoll physics.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ClockStone","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":493453,"name":"Asterix & Obelix XXL: Romastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a5/3a5b7004b89e991953649bd08875bcc5.jpg","description":"The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium.\nPeace reigns in the small Armorican village, where the villagers go about their daily business. Our two heroes, Asterix and Obelix, hunt wild boar, the blacksmith and the fishmonger quarrel, and the village chief strolls around the village square atop his shield.\nAfter a fine day's hunting, Asterix and Obelix return to find their village in flames, pillaged by the Romans! They set off to rescue their fellow villagers, accompanied by their faithful Dogmatix. Their journey will take them to Normandy, Greece Helvetia, Egypt and, finally, Rome, in order to save the villagers from the clutches of the emperor Caesar...\nRediscover the first XXL adventure of your favorite Gauls in this fully romastered version!\nToggle between Asterix & Obelix et travel accross various regions of the world such as Greece or Egypt to set free Impedimenta, Panacea, Getafix and the other villagers.\nFight all the Romans, pirates and Vikings who will stand in your way! Nothing can stop you with magic potion.\nCherry on the boar, 4 NEW GAME MODES are available:\n- Retro Mode: return to the original graphics whenever you wish, for those who are nostalgic for 50 BC!\n- Course mode: collect all coins scattered around within the set time. Jump, whirl, run… and switch to Retro mode from time to time, as some coins are mischievously hidden.\n- Countdown mode: get to the finishing line as fast as possible! The druids say that the best potions are brewed slowly. However, time is your enemy here, so don't dally! Take care, as a number of obstacles will stand in your way.\n- Extreme mode: More numerous and tougher Romans, for maximum difficulty! Will you be up to the challenge of this mode, which only the greatest Gaulish warriors are worthy of?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"OSome Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":485193,"name":"3on3 FreeStyle: Rebound","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/531/531a341a5e351d9e119a95f205ef8d89.jpg","description":"Features   3 Vs 3 Online Multiplayer Mode\n1 Vs 1 Online Multiplayer Mode\nDynamic Practice LobbyFree to Play Basketball ActionThe game’s unique free-to-play approach means that players can dedicate the time needed to master the game and become online street basketball legends.Real-time Online CommunityPlayers can dive into a huge online community of potential teammates and competitors for a personal, competitive experience which makes them feel like they are right there on the court. Allowing for personal interaction, team development, and rivalry, 3on3 FreeStyle: Rebound allows for social and interactive community, while also competitive at the same time.High-flying, Fast-paced Street B-ball GameplayThe straightforward controls of 3on3 FreeStyle: Rebound allow for players to execute their favorite basketball moves with ease within their first time trying out the game. Once the basics have been mastered, players will find each unique character in the game with individual signature basketball tricks which can quickly be picked up, mastered, and unleashed on opponents.Dynamic Art Powered By Unreal Engine 4Inspired by the real-life street basketball courts in the country, the artists have infused their own unique take on the courts using the power provided by the Unreal Engine 4. Interactive environments and characters come to life when a player pulls off a stunning alley-oop or hits an impossible acrobatic shot.Characters With Unique Skill SetsPlayers can pick from a wide variety of diverse street basketball characters with specific skill sets and physical traits inspired by the different kinds of basketball players you will find on the court. Whether the player wants a tall, lanky rim protector, a gravity-defying slam dunk artist, who can bury the outside shot with ease, they can find them in 3on3 FreeStyle: Rebound’s roster of characters.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Joycity","platforms":[{"id":0,"name":"PC"}]},{"id":362901,"name":"Hunter's Arena: Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da6/da6e4c390c9787801ce746348c053756.jpg","description":"They say that after the battle between the gods & demons, the gods won and sealed the demons inside the Demons Tombstone. Humans were no longer a pray.\nBut as you probably guessed, that didn’t last long. Those who were in favor of chaos, destroyed the tombstone and the demons came back to hunt mankind once again.\nBut every hunter is also someone’s pray and so, demon hunters around the kingdom decided to combine their strength to rebuild the Demons Tombstone.\nTheir plan is simple yet deadly. They plan to gather a large group of demons in one place and activate the Demons Tombstone's trap: a deadly magical wall that kills anything that stands in its way. No one is safe. The magical wall needs victims in order to work. Only the last survivor can harness the wall’s magic, re-build the tombstone, seal the remaining demons & bring a new era of hope. The question is, what is YOUR fate?Unparalleled fighting styleEnjoy the movie-like martial art combat system, and outsmart your enemies using attacks/blocks and other amazing moves the game has to offer.\nDeveloped using Nvidia’s latest Unreal Engine 4 Battle Royal Mode Survive among 60 players and 10000 monsters!\nFarming, Upgrading, Raiding, Dungeons and PvP action - try this MMORPG-like experience within just a 30 minutes game session!\nIt’s not just a Battle Royale with an RPG combat system, it’s a full-scale RPG available in a Battle Royale mode.\nUtilize teamwork in party play and backstab your enemies!Character10 Different characters with unique skills. Combat system that rewards kiting and utilizing different play styles that have their strengths and weaknesses against each other.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mantisco","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]