[{"id":20107,"name":"Death Skid Marks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f8/5f8a4f4046ed730aeb73eaa33cdf2990.jpg","description":"Feature List-Trashy humor and art.\n-Original metal/rock/punk soundtrack featuring 50 tracks.\n-Frenetic top down hardcore car combat action.\n-A full run that lasts around 1H30, replay often but die often.\n-Completely random levels, infinite replay value.\n-30 achievements that all unlock new content.\n-32 vehicles to drive.\n-Over 70 different items to buy.\n-Gambling mini-games.\n-16 hitchhikers.\n-11 bosses and around 50 different enemy types (not counting variations).\n-14 different game modes.\n-Permadeath.\nAbout the GameAbout:\nDeath Skid Marks is an ultra-violent top down car combat game where you will kill countless numbers of foes in the most noble quest of all: getting to a kickass music concert. Fight groupies, rednecks, neo-nazis, religious fanatics, the police, robots, aliens, suicide bombers and your own self-destructive urges to play Russian roulette. Upgrade your car with parts and your crew with illicit substances, buy weapons and special items, fight using guns, melee and your driving skills. Travel 666KMs along route 666 and face increasingly impossible odds. Unlock tons of content such as cars and bumper stickers.\nDeath Skid Marks features a unique punk/metal soundtrack, unique art style, cutting edge low-fidelity cathodic screen graphics, random unpredictable runs, unique gameplay and two scoops of stupidity.\nDrive, kill, die and drive again.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Studio Whisky Tango","platforms":[{"id":0,"name":"PC"}]},{"id":19651,"name":"IL-2 Sturmovik Birds of Prey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fff/fffb72757282490b63166d01d9e6d746.jpg","description":"Wings of Prey is based around the large-scale aerial combat and ground military operations of World War II. Players can participate in some of the war’s most famous battles piloting fighters, battle planes and bombers across a range of thrilling missions. There are six theatres of war to engage in – The Battle of Britain, Stalingrad, Ardennes, Berlin, Sicily and Korsun' representing the main airborne battles of World War II in Europe.\nWings of Prey also boasts an all new damage effects engine as well as advanced environmental visuals enriching the game play. Wings of Prey features hundreds of airplanes taking part in air battles. The unique environmental engine also produces highly detailed, realistic landscapes that allow players to see breathtaking ground support actions.\nAuthentic World War atmosphere: Cutting edge technologies with highly detailed visuals bring the epic battles to life;\nEngage in more than 50 missions from famous historical battles over Eastern and Western Europe;\nHistorically accurate aircrafts: Experience over 40 planes including fighters, battle planes and bombers. Learn to master Spitfire, Mustang, Messerschmitt and many more;\nFlexible difficulty level system: from arcade to realistic simulation;\nDownloadable content support: more planes and missions are coming next year;\nSupport of 6-DOF TrackIR, TripleHead2Go, Saitek and Thrustmaster joysticks, mouse and voice headsets;\nRealistic sound effects and original music from Jeremy Soule.\n\nNote! Multiplayer for Wings of Prey is no more supported!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"505 Games","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":17541,"name":"Iron Fisticle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82a/82a365c1d30d90f85f1565c01768f18b.jpg","description":"Iron Fisticle is a challenging twin-stick shooter that requires reflexes, speed and quick thinking to master. It takes the classic arcade arena shooters of the mid 80s and drags them, axes flying, into the 21st century.\nInspired by truly old school arcade games right down to the (optional) scanlines themselves, Iron Fisticle is both a retro game and a reinvention of a classic genre, with multiple routes through the game, bonus stages, a large variety of weapons and enemies, clever boss fights and much more:\n• Classic twin-stick arcade gameplay meets modern accessibility, with controller support, achievements and collectables; endless supply of quarters and blistered thumbs not required.\n• Randomly generated dungeons keep the gameplay fresh and offer a new experience every play-through.\n• Re-live multiplayer as it was designed to be, with simultaneous two player local co-op.\n• Multiple stats upgrades and weapon pick-ups change the way you play and fight in each game, while roguelikes-style persistent character upgrades allow you to explore deeper after every death.\n• Over 150 different items to collect ranging from score boosters to weapons and power-ups.\n• A scoring system that encourages fast paced risk taking while encouraging experimentation and discovery - like all the best classic arcade games.\n• Retro-styled, hand-drawn pixel art graphics running at 60 FPS for a fluid action experience, complemented by excellent chip-tune inspired music and audio effects from Andy Lemon","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Confused Pelican","platforms":[{"id":0,"name":"PC"}]},{"id":13612,"name":"Volt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7e/d7ed2c08958c4e34394819720351a18d.jpg","description":"You were on the way to a recycling process when fortunately for you - and unfortunately for the environment - you accidentally ran off.\nNow your goal is to escape from the facility, which is an extremely difficult task due to the fact that you are a battery without legs. Equipped with a limited number of electric beams, you can connect to walls, move or destroy objects, turn switches, and charge generators.\nYou also have the ability to jump or push off the walls - the rest is up to physics and gravity.\nKey features:\n- puzzle platformer with a lot of explosions\n- over 60 levels divided into 4 industrial-themed zones\n- boss stages\n- unlockable 12-bit levels\n- unlockable batteries\n- unlimited lives !","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Quantized Bit","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9846,"name":"Paint the Town Red","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fff/fff996dc02b62d2a0b7ff6bb2b4918eb.jpg","description":"Paint the Town Red is a chaotic first person melee combat game set in different locations and time periods. The voxel-based enemies can be punched, bashed, kicked, stabbed and sliced completely dynamically using almost anything that isn't nailed down.\nYou'll need to use your wits, speed and anything you can get your hands on in epic bar fights, disco brawls, old west saloon rumbles, college frat house beat-downs and a lot more.\nWe'll be adding more levels to the Early Access versions leading up to release and look forward to creating the best level ideas from the community. Please follow and add to your Wishlist to keep up to date on development and be notified on release.\nCurrent Features\nCompletely destructible voxel-based enemies\nBiker Bar, Disco, Prison and Pirate Cove scenarios with unique enemies, weapons, etc\nArena mode with new challenges added frequently\nOnline Co-op Multiplayer\nLevel Editor and Steam Workshop support with hundreds of user created levels\nLeaderboards\nSandbox level to test features, weapons and mechanics\nVast array of level and period appropriate weaponry\nBoss enemies that present unique challenges and rewards\nFull controller support\nUpcoming Features\nA rogue-like mode with character progression and persistent unlockables\nMore scenario levels set in the past, present and future\nAn endless Arena mode for single player and co-op\nMany more enemy and weapon types","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"South East Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":1515,"name":"Panzer Corps","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bcb/bcbd5c48672981716878cf419cbf3f96.jpeg","description":"Join the Tournament!\nNow out on Mac!\nA new story begins...\nSpecial Offer\nEnjoy Panzer Corps with all its expansions in a single package for the first time, at a spectacular discount! We are talking of the base game plus 17 (seventeen!) expansions here! It is truly a staggering amount of content which will keep you hooked for months.\nGet it here!\nAbout the GameClassic gameplay. New experience.\nPanzer Corps Wehrmacht is the award-winning turn-based strategy game that the press has called “…nothing short of brilliant” and “the spiritual successor to the Panzer General series”, with high rankings and praise around the world. Brought to fruition by a team of experts and a community of hundreds of fans, Panzer Corps - Wehrmacht has evolved into the ultimate strategy classic that will find a home on any wargamer’s shelf!\nSet in World War II, Panzer Corps - Wehrmacht puts players in the general’s tent in charge of the Axis armies, across 26 scenarios in one large campaign tree, carrying core forces through the war. This core force can gain experience and upgrade to new weaponry as it becomes available. With over 800 unit types, divided into 20 unit classes there is a huge amount to explore. Make use of your unit’s strengths and your enemy’s weaknesses and seize victory.\nLooking for a more ‘human’ challenge? Panzer Corps’ multiplayer is deservedly popular, with thousands of games running on the server at any given time. Find an opponent online quickly and easily throughout the world with Slitherine’s award-winning PBEM++ asynchronous multiplayer system. Play historical battles or balanced scenarios created specifically for multiplayer, where both sides have equal chances to win. Panzer Corps supports cross platform multiplayer, so you can even battle owners of the iPad version of the game!\nDeveloped by Flashback Games and The Lordz Games Studio, Panzer Corps - Wehrmacht replicates a classic wargame and upgrades it to 21st century standards for a new generation of wargamers.\nMain Features\n• 800 unit types, divided into 20 unit classes with 20 detailed parameters to identify unit’s abilities, 24 terrain types affecting gameplay in various ways. Panzer Corps will celebrate the glory days of strategy gaming with the aim of attracting new players to the genre;\n• Campaign: all 26 scenarios are combined into a large campaign tree with several entry points at various stages of the war. Depending on the outcome of each battle (decisive victory, marginal victory or defeat), the player will be faced with different challenges and a progress along different parts of the campaign tree;\n• More than 30 nations represented in the game: Germany, Italy, Poland, France, Great Britain, USA, USSR, Norway, Belgium, Netherlands, Albania, Romania, Greece and more.\n• Core units that travel with you throughout the campaign gaining experience and that can be upgraded as new weapon technologies become available.\nAdditional content\nFor players who enjoy the game, there is a lot of quality content which will keep them busy for months.\nThe Grand Campaign consists of 10 campaigns that bolt together to create a staggering 150 scenario Grand Campaign which cover the entire war from 1939 to 1945 in great detail. You can play them all linked together or each as a standalone campaign.\nThe Afrika Korps expansion consists of 24 scenarios, new terrain and units and explores Rommel’s North Africa campaign.\nPanzer Corps: Allied Corps is an expansion for Panzer Corps. Allied Corps includes more than 25 new scenarios, over 50 new regular and special elite units, and modified version of existing units to cover the entire war in detail from the Western Allies perspective.\nAnd if this is not enough, Panzer Corps comes with a bunch of modding options and a powerful editor (PC only), and there are dozens of free user-made campaigns readily available for download from the Internet.\nAll Panzer Corps content is also available on iPad, so this strategy gem can be played everywhere!\nReviews\n96% - GamersHall.de\nPanzer Corps is a solid and loving overhaul of the classic Panzer General. Technical implementation and graphic design leave little room for any criticism.\n93% - GamerTell.com\nEasy to learn, simple interface, hard to stop playing once you start, you don't have to be a serious wargamer to appreciate.\n9/10 - CPU Gamer\nWhen it comes to being Panzer General, Panzer Corps beats the pants off the competition.\n90% - Armchair General\nOverall, PanzerCorps is one of the best “beer and pretzels” turn based wargame releases in years. The game is very polished and stable. It is fun to play.\n90% - PelipPlaneeta.net\n...nothing short of brilliant.\n9/10 - RTSguru\nThis was seriously one of the best games that we have ever played. If you do not pick this up, you are missing out.\n9/10 - Onet.pl\nIf one asked how would Panzer General be like if it was released today? The answer is simple - it would be Panzer Corps.\n9/10 - EntDepot\nPanzer Corps has me dreaming in hexagons nowadays.\nA- - GameShark.com\nNow that the official review is complete, if this were any other game it would go on the shelf next to other games that have been “finished” but I have every intention of firing it up again.ລ","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Slitherine Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":266205,"name":"STAR WARS Episode I Racer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/150/1501efb43366d2d1c712432fb796333d.jpg","description":"Two Engines. One Champion. No Limits.\nClimb on, strap in, and experience the pure adrenaline-pumping excitement of the Podracing sequence from Star Wars: Episode I The Phantom Menace.\nTake the controls as Anakin Skywalker, or any one of over 21 Podracers, and feel the full-force blast of two massive jet engines at simulated speeds of up to 600 mph. Rein in a turbine-driven chariot through 8 spectacular worlds. Negotiate through flaming methane lakes, Tusken Raider assaults, ant-gravity tunnels and much more in a pulse-punding, do-or-die fight to the finish where anyone will do anything to cross the finish line. How far will you go?\n• Relive all the thrill and excitement of the Podracer sequence from STAR WARS: Episode I.\n• Hang on tight - with afterburners on, Podracers max out at a simulated 600 mph!\n• Race in furious competition against 21+ opponents.\n• Take on over 21 tracks on 8 unique worlds!\n• Avoid hazards such as methane lakes, meteor showers and Tusken Raiders.\n• Spectacular 3D environments.\n• Vehicle sound effects and epic soundtrack taken directly from Episode I.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":254576,"name":"Zup! S","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03b/03bf0e748b04993af22507a01152ef1e.jpg","description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60+ Levels\n▪ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic by Ann Sharova","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":37923,"name":"Sam & Max: 104 - Abe Lincoln Must Die!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a3/7a35b68c8642dfd52e24dcc2c438aaa9.jpg","description":"Sam & Max Episode 4 - Abe Lincoln Must Die - The president's lost it. Federally mandated group hugs, a pudding embargo... what's next, gun control? Sam & Max are off to Washington to take care of this bozo, but the political climate will only get stormier... and a new power will rise...\nOne of six self-contained cases with an overarching story arc.\nSimple point & click interface with a low learning curve.\nCatchy jazz soundtrack featuring live performers and over three hours of original music.\nIntuitive gameplay that appeals to new players as well as adventure-game diehards.\nAnd it's funny!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":17141,"name":"Blake Stone: Planet Strike","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81f/81fdabb20d195baddde4d1d768322489.jpg","description":"British military agent Blake Stone finds himself in a life or death struggle for control of humanity's future. After a five-year manhunt for the elusive Dr. Goldfire, the search has ended.\nThe trail has led Blake to the planet Selon, and to the abandoned STAR Institute Training Complex. If the reports are correct, then Dr. Goldfire is alive and has once again created a fiendish army of evil mutants.\nBlake is going to need all his wits, skill, and the best firepower money can buy to put an end to Goldfire's plans. Blake's mission is clear - he must use all his resources to destroy Dr. Goldfire before he can unleash his new army of mutant creatures on the universe.Features\nGo Boldly: 20 brand-new levels  - all with wildly new designs and graphics.\nHmm, Upgrades: New actor traits and improved actor intelligence.\nThe Harder They Fall: All-new alien-like guards and four new bosses.\nSticks and Stones: New hazards, such as barriers and spikes.\nLight 'em Up: Darker, more realistic levels with dynamic lighting conditions and more realistic weapon graphics.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Saffire","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16598,"name":"Atonement 2: Ruptured by Despair","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d45/d4547085e475bd136f8c80449f22fbdc.jpg","description":"The highly anticipated sequel to Atonement: Scourge of Time finally comes to Steam!\nGeneral Features:\nDirect sequel to Atonement: Scourge of Time.\nExplore the alternate timeline, where the final outcome of the first game took a grimmer turn. Characters you’ve known already will not be the same. Friends will become enemies, and enemies will become friends.\nRegenerating energy battle mechanic is back! Carefully manage how you spend your energy as some skills can leave you dry very fast!\nNo level ups or experience points! Similar character progression to City of Chains – gain skill points upon completing quests and choose which battle skills or passive abilities to learn.\nNon-linear gear progression. Equipment system now consists of enchantments that you can find all over the world. Use these to customize your character’s offensive and defensive bonuses to your liking.\nAll enemy encounters are visible, so you can tackle them when you’re ready. Some passive abilities will allow you to bypass battles without needing to fight.\nIn addition to the main party’s story arc, witness flashbacks from a distant past, where you get to control a second party of characters. Any decisions you make during these scenes will have an impact on the present.Story:\nThree weeks have passed since the events of Atonement: Scourge of Time. The world was saved… or so it seemed. Whilst keeping a low profile, Elleria began to notice strange occurrences – ominous dreams, a persistent weakness, and mysterious portals coming out of nowhere.\nBefore long, she and her allies find themselves in an alternate timeline – a timeline where events took a grimmer and more depressing turn, with familiar characters no longer being the same, and Elleria herself being at the centre of it all.\nWanting nothing more than to simply return to her home timeline, Elleria will have to face her fears, her lineage, and herself, in order to overcome treacherous hazards, eldritch secrets, fallen angels, overwhelming odds, and maybe, just maybe, save others in the process.\nTo check out the original Atonement title, please head on over to the existing store page: http://store.steampowered.com/app/385070/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Astronomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":15445,"name":"Pharaoh + Cleopatra","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c6/4c64c662f207fb1ea4b2ca1ca358505b.jpg","description":"Immerse yourself in Ancient Egypt from the age of the great pyramids to the final years of the New Kingdom. Govern all aspects of the exotic Egyptian, culture from religion to trading with distant cities. Cultivate vast farms in the Nile valley and discover the important role this river, with its unpredictable floods, played in the life of the Egyptians. Stone by stone, erect giant monuments - from the Sphinx, to the lighthouse and library of Alexandria.\nManage your city poorly and you shall watch it burn, be pillaged or collapse in economic ruin. Manage it well and ultimately the greatest Egyptian structures will be built in your honor. Your rule will span generations, until your dynasty, your royal bloodline produces a Pharaoh!\nPharaoh includes many features never before seen in a city building game, such as a farming model based on the flooding of the Nile, naval warfare, giant monuments that are assembled over time, unique dynastic progression, and variable difficulty levels. This a massively addictive, huge, but most importantly fun game that is a great choice for anyone looking for a solid city builder title, or an intellectual challenge.\nPharaoh + Cleopatra bundle includes Pharaoh and Cleopatra: Queen of the Nile expansion.\nA city-builder gem, made by the creators of the award-winning Caesar III.\nExtensive help section not only does an excellent job at explaining the game mechanics, but also contains many interesting facts and trivia about life in Ancient Egypt.\nDestroy enemies on land and sea, or simply build the perfect Egyptian city of your liking with the City Construction Kit.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Impressions Games","platforms":[{"id":0,"name":"PC"}]},{"id":14741,"name":"Cloudbuilt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/024/024258c5ee5fed04b56a697df9271576.jpg","description":"Too fast, too furious and packed full of action – are you ready for the rocket-powered world of Cloudbuilt?\nA game of speed, precision and freedom, use all the abilities of your rocket-powered suit to avoid fatal hazards, dodge hostile robots and reach not just the finish line, but the top of the worldwide leaderboards. Carve your own path through a multitude of mysterious floating ruins high above the clouds and show everyone you're the best!\nNow with Steamworks Level Editor tools! Will you create the greatest Cloudbuilt community level ever?\nParkour-style platforming combines with action-packed gunplay as you race against the clock to complete each stage\nOpen level design allows you to carve your own route through any stage, then refine it to get the fastest time possible\nMake your mark on the global leader boards – find new shortcuts and climb as high as you can!\nCreate your own Cloudbuilt stages with the Level Editor and upload them to Steamworks or download levels made by others.\n(Please note: Use of level-building assets from Defiance DLC pack requires ownership of Defiance DLC. Minimum specs of Cloudbuilt are slightly higher than shown for those wishing to use the Level Editor tools)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Coilworks","platforms":[{"id":0,"name":"PC"}]},{"id":11906,"name":"Riff Racer - Race Your Music!","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/358/358dfe7791ae5f6bf72ed4c29dce0c75.jpeg","description":"Full Release!Riff Racer (known as Drive Any Track during Early Access) is now in full release!\nWe'd like to thank all the community who have helped us so far during development of the game.\nWe'll continue to experiment with features as we go!\nAbout the Game\nIncludes 25 fantastic bundled tracks!! Or, race your own music...\nInspired by some of our favourite games like Wipeout, Trackmania, Vib-Ribbon and Audiosurf…\nRiff Racer is a high-octane music based racing game where we create racetracks from the songs in your music library.\nNot a rhythm game, but a fresh twist on music-powered game creation. Action on track is synced to the audio, you literally have to race the music to stay in time and score points.\nYou've seen other music powered games, Riff Racer takes the concept to the next level with our innovative MEGA engine. It takes any audio file, analyses it down to its core components and creates a unique racing experience from the structure of the song.\nVerses, choruses and drops become checkpoints, and the environment and cars are styled to the genre of music you're playing.\nExperiment with your music collection and find out which songs make the best racetracks!\nBe the first to 'create' a race-track from a song and have your name forever enshrined on the track’s leaderboard.\nMultiplayer features - Challenge your friends' ghosts to your favourite tunes and beat their high-scores on the track!\n**Please note Riff Racer does not support live multiplayer***\nScore big for staying in sync, whilst performing stunts, jumps, drifts and rolls!\nRiff Racer has unique environment styles based on different music genres, and a selection of genre based cars and liveries (and some secret cars you have to work out how to unlock!).\nRiff Racer currently supports MP3, FLAC, and OGG file formats.\nRiff Racer has full controller support in that you don't need a mouse and keyboard to play the game, but we only support newer xinput devices such as the X-Box 360 and X-Box One controllers. Older directinput controllers such as the Logitech Dual Action are not currently supported.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FOAM Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":8096,"name":"Ice Lakes","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e67/e67118045a222337f79b5ac143d61d74.jpeg","description":"Ice Lakes is an ultimate ice fishing game with a sandbox approach to wintertime fishing. Rare subject, stunning graphics, realistic physics, fish behavior system, wide selection of fishing gear, single and multiplayer with different game modes in the various locations around the world, changing season, day time and weather conditions that also affect fish behavior makes Ice Lakes the ultimate ice fishing simulator. What makes this a unique fishing game are features like fish fights, VR support, fishing locations and species around the world, which no other ice fishing game has! The game can be played both with or without VR system.Game FeaturesSingle player\nMultiplayer up to 32 players (Online and LAN)\nDedicated servers (alpha version)\n29 fish species\n17 open world maps\n17 competition modes\n16 tournaments\nFish fights\nExtensive statistics about everything\nCharacter customization\nRod movement. Lure the fish to take a bait by rod movement\nChanging weather and time of day\nChange of seasons (fall, winter, spring)\nFish behavior engine. A fish AI and swarm system controlling each species\nFishing equipment. Learn and master the use of dozens of jigs, rods, augers, baits and lures\nOnline leaderboards\nVR SupportGame Description\nIn this game players can roam freely in the beautiful open world maps and explore river, pond and lake locations in diverse environments. Dare to go deeper into the wild where no fisherman has gone before and find the biggest catches. All maps are playable both in single player and multiplayer modes.\nFinding the best fishing spots by learning the depth maps and bottom topology of each location is fun, but requires patience and dedication. Nothing wins the expectation of finding the best location or catching the biggest fish from each lake.\nThe real excitement starts when it is time to throw fishing lines into the water and start fishing! The right equipment for right conditions are as essential as is mastering the location. The realistic fish behavior system, fish AI and fish swarms for almost 30 fish species makes this game a lifelike fishing experience. Fishing gear can be chosen from a wide selection of different jigs, rods, augers and baits. A perfect combination of equipment for different species depends on the season, but especially weather and daytime conditions. Controlling a rod and a jig in the water in a right way and at the right depth in Ice Lakes is a skill of its own. Rod and jig physics guarantees that fish react authentically to player's actions.\nFishing independently without time limits or competitors makes Ice Lakes a relaxing game to play and tune your fishing skills in the comfort of your home. On the other hand, lengthy tournaments and very customizable single competitions will test the player's skills and knowledge, but will reward them with new equipment and limitless fame.Future developmentAfter the release the development of Ice Lakes will continue and is improved based on the wishes of the community. Moreover, the game will get free content updates including more maps, game modes, fish species, equipment and more.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Iceflake Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":7087,"name":"Terminal Velocity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c05/c055292c8d9419424ee03822cfc4086f.jpeg","description":"Take flight in this pure action game that should come with a barf bag! Climb into Terminal Velocity now and you'll never go back to flight simulators that offer combat as an \"option.\" Terminal Velocity is combat! All without the difficult controls presented by all flight simulator style games.\nCreated by the former lead programmer of Microsoft Flight Simulator, Terminal Velocity features a fast frame rate, realistic outdoor environments, and the unique ability to fly through tunnels and into underground caverns. Quite simply, Terminal Velocity is all about action, speed and destruction.Features\nAll-rounder: Fast texture-mapped 3D flight with full 360-degree movement.\nOn Top of the World: 9 totally unique planets, with 3 levels per planet, and dozens of tunnels and over 400,000 sq. miles of terrain.\nShock and Awesome: 7 destructive weapons, power-ups and incredible air-to-air and air-to-ground combat.\nFlight School: Enemy ships cast translucent shadows, bank, roll, do loops, make suicide runs and more.\nFly with Friends: Supports modem, serial cable, and network multiplayer games for 8-player network support and 2-player network support.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Terminal Reality","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":6320,"name":"Unstoppable Gorg","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/462/4627cd7641ab222926970f7540b40743.jpeg","description":"Get ready to experience a revolution in tower defense that will send you spinning. Unstoppable Gorg challenges you to defend the solar system from fearsome aliens by sending satellites into orbit. Unlike other tower defense games, in Unstoppable Gorg you can move your towers by rotating the orbits that surround planets, moons and space stations.\nUnstoppable Gorg is a lovingly crafted homage to vintage sci-fi films from the 1950s. Flying saucers, rubbery aliens, dodgy effects, it's got it all. The game's story scenes were shot on film using models, miniatures and live action actors and then edited together with genuine archive footage to create a classic sci-fi experience that is out of this world.\nKey Features:\nTake on the Gorg in more than 40 challenging levels of revolutionary tower defense action.\nSatellites in orbit replace the towers and grid layout used in other tower defense games.\nMove your satellites around their orbits to create the best defense for each wave.\nExperience a thrilling story inspired by the classic sci-fi films of the 1950s.\nUnlock Steam achievements and earn your place on the leaderboards.\nGlorious 3D graphics and effects for added impact.\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Futuremark","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":2928,"name":"Super Toy Cars","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d13/d13f2c360e927f0fb80dba42738b527f.jpg","description":"Super Toy Cars is a tabletop arcade combat racing game featuring fast and cool looking cars, impressive tracks made of everyday objects and a bunch of power-ups that will let you destroy your opposition. Collect all cars and upgrades to keep up with competition while you progress in career mode or have a quick race either against AI opponents or against friends. You can play up to 4 players locally and up to 8 players online. Go and build your own tracks, share them with friends or play with them in your tracks. Super Toy Cars is big and with lots of options for you to tinkle and play with, but most importantly this game has been carefully crafted to be fun play and fun to race, either alone or with friends.\nThere are 16 different cars in the game each one with its unique handling model. You can experiment with them and play the ones that best suite your driving style and the different situations you'll find in our 12 tracks. Oh, and maybe you'll want to use different cars depending on which type of event you're playing, because we have 48 events in career mode, but not all of them are races! And if you grow tired of the tracks in the game you can always check what other tracks have the community built or even build your own and share it with our in-game track editor.\nFeatures:\n16 different cars with unique handling models\n12 different tracks in 4 different locations which can be played in 5 different event types\nCareer mode comprising 48 events\nUp to 4 player local multiplayer\nUp to 8 player online multiplayer\nTrack editor to build and share your own tracksEarly Access Roadmap\nWe have a roadmap in place for the period the game is going to be in Early Access. We are aiming for a final release date in the first or second week of May. We have roughly 10 weeks to that date and we're planning to do, at least, weekly builds with improvements. We'll be announcing what's new in every build in the announcements section, but anyway here's the planned roadmap:\nMarch, 3rd: Mostly bugfixing and online improvements. Possibly some improvements in the HUD and menus.\nMarch, 10th: Improved menus backgrounds, improved HUD, better and more consistent AI accross the game. Achievement icons.\nMarch, 17th: More effects and particle systems. Bugfixing.\nMarch, 24th: First batch of vehicle paintjobs.\nApril, 7th: Mac version. Second batch of vehicle paintjobs.\nApril, 21st: Linux version. All vehicles have, at least, 2 paintjobs available.\nApril, 28th: Some easter eggs, and other bonuses. Maybe provide a first alpha of a vehicle editor.\nBear in mind that this list is meant to change and adapt to your suggestions and feedback. Although we can't guarantee we'll implement every detail and suggestion we receive, we'll do our best to react to community feedback and make of Super Toy Cars the best game we can with your help.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Eclipse Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":520350,"name":"Five Dates","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/427/42775acebd4e82e8465e41c8912ba2c5.jpg","description":"Five Dates is an interactive rom-com about the unpredictable world of digital dating. With five potential female matches, Vinny explores whether compatibility, chemistry and connection is still possible in a world where physical touch is no longer an option.\n\nVinny, a millennial from London, joins a dating app for the first time while living in lockdown during the coronavirus pandemic. With five potential female matches, Vinny must pluck up courage to video date with wildly different personalities, starring Mandip Gill (Doctor Who) and Georgia Hirst (Vikings).\nThe viewer’s choices will define Vinny’s interactions with each date and their interest in seeing him again. Amidst a branching, multi-directional chain of conversation topics and deep-dive questions, Vinny is faced with digital game dates, awkward scenarios and unexpected truths.\nFrom the publishing studio that brought you The Complex, The Bunker and The Shapeshifting Detective.\n\n- A completely live-action romantic comedy, directed by Paul Rachid (The Complex)\n- Entirely conceptualized, filmed and developed during lockdown\n- Over 7 hours of filmed footage, the most amount of FMV footage in any game\n- Real-time Relationship Status Tracking that influences the story as you play\n- Multi-optional storytelling with 10 different outcomes\n- Starring Mandip Gill (Doctor Who), Georgia Hirst (Vikings), Sinead Harnett (singer) and Taheen Modak (Two Weeks To Live)\n\nOffline single player\nOnline features require an account and are subject to terms of service and applicable privacy policy","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Wales Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":53461,"name":"Phoenix Wright: Ace Attorney − Trials and Tribulations","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76c/76ccafdfdade806abdb7ee8d9bf54bda.jpg","description":"Phoenix Wright: Ace Attorney − Trials and Tribulations is a visual novel adventure video game developed and published by Capcom. It was originally released for the Game Boy Advance in 2004 in Japan, and has since been released for several platforms, including a Nintendo DS version that was released in 2007 in Japan and North America and in 2008 in Europe. It is the third game in the Ace Attorney series, following Phoenix Wright: Ace Attorney (2001) and Justice for All (2002).\nThe story follows defense attorneys Phoenix Wright and Mia Fey, who defend their clients in five episodes. Among other characters are Phoenix's assistant and Mia's sister Maya, her cousin Pearl, and prosecutor Godot. The gameplay is split into courtroom sections, where the player cross-examines witnesses and tries to discover contradictions in their testimonies, and investigations, where they gather evidence and talk to witnesses.\nThe game was directed and written by Shu Takumi as the last game in an Ace Attorney trilogy; he also wanted it to be the final entry in the series, as he felt he had explored Phoenix's character fully. Because he was satisfied with the gameplay in Justice for All, he did not introduce any new gameplay mechanics in Trials and Tribulations. Flashbacks were used as a major theme in the game; this originated in Takumi trying to come up with a way of handling dialogue-integrated tutorials, and deciding to use a flashback to a case from when Mia was a rookie attorney.\nThe game has received generally favorable reviews, with reviewers liking the story, writing, character designs and music, but with some criticizing the lack of new gameplay mechanics. Additionally, the Wii version was criticized for using resized graphics from the Nintendo DS version, without any modifications to make them appear better on a larger screen. The Nintendo DS version was a commercial success in North America, with pre-orders being more than double the amount Capcom had estimated.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Capcom Production Studio 4","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Android"}]},{"id":35818,"name":"Shrek 2: The Game","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfd/bfddaba307534d9e6da0fb1ae0666ad6.jpg","description":"Shrek 2's storyline follows a similar plot to that of the film. Shrek and Fiona are on a journey to the Kingdom of Far Far Away to visit Fiona's parents. Shrek's in-laws are not happy that a crude ogre is married to their daughter Fiona and the battle for acceptance ensues. The game covers things not shown in the film. Plot elements are delivered primarily through a storybook interface (text and illustrations) shown before each level.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Aspyr Media","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":35072,"name":"Tropico 2: Pirate Cove","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1e/f1eac23f3d55564a3e932b8f803c4ad7.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Frog City Software","platforms":[{"id":0,"name":"PC"}]},{"id":28383,"name":"Boom Boom Rocket","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a2/1a2d91f70d5ac9ab2a3531b1beb97ec1.jpg","description":"Set off an amazing display of fireworks with Boom Boom Rocket. As rockets fly against a spectacular cityscape, time their detonation to the beat of the music to unleash some awesome pyrotechnics. Featuring four game modes including two multiplayer modes, and a great soundtrack, Boom Boom Rocket is the explosive must-have game for Xbox Live Arcade. Download the trial version now","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bizarre Creations","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":19498,"name":"Rhiannon: Curse of the Four Branches","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dca/dca5f6afe2078239a83ccad663324dab.jpg","description":"Digital Deluxe EditionPremium version of Rhiannon: Curse of the Four Branches includes these added features:\nIn-game tutorial\nInteractive Map\nIn-game hint system\nImproved navigation\nAbout the GameRhiannon is hearing noises and seeing things she can’t explain. Living in her family’s remote farmstead miles from friends and neighbours and having ambitious, busy parents, Rhiannon is alone. Her parents believe her stories to be an overactive imagination and teenage angst. So the Sullivan’s decide to take their daughter away for a break and have asked you to look after their home.\nThe moment you enter, you suspect that something is not right. Rhiannon’s stories are true and the farmstead is engulfed in supernatural happenings as an ancient myth spills over into reality.\nDiscover dark secrets in this chilling point and click adventure as you encounter an ancient evil lurking in the walls of the home that holds a terrible connection to a timeless struggle between man and magic.\nSet in present day, the plot draws from ancient Welsh myths and legends\nExplore the eerie Welsh farmstead, from the imposing house, to its extensive grounds and buildings\nFirst-person point-and-click with approximately 20 to 30 hours of largely non-linear gameplay\nInvolved multi-threaded plot\nFeatures classic themes such as: magic, paranormal phenomena, and technological gadgets\nInteract with a comprehensive inventory of nearly 200 items\nEngaging and unusual challenges, mostly plot and inventory driven\nA haunting musical score will send chills up your spine\nSolid chapter structure to the compelling and ultimately uplifting story","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Arberth Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16628,"name":"Tormentum - Dark Sorrow","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ae/6ae63d3a127362ec8172868756d4cee5.jpg","description":"TORMENTUM is a dark Point & Click adventure game.\nThe dreamlike, nightmarish atmosphere of the game was inspired by works of painters H.R. Giger and Zdzislaw Beksinski. The game's final look and feel was also strongly influenced by the universes of games such as Demon's Souls or Dark Seed. This unique mixture gave life to a bleak and depressing world.\nThose are however the least of his problems as the airship lowers its flight towards a huge gloomy castle which soon becomes his prison. Thus begins the surreal story bordering somewhere between dream and reality...\nKey features:THE GAME WORLD: 3 realms, differing in architecture and creatures inhabiting them. You'll meet characters with unique personalities who will help you - or try to prevent you from - reaching your goal.\nART: 75 hand-painted stages. The game also features over a hundred additional screens as well as dozens of paintings created by the mad painter residing in the cathedral.\nPUZZLES: During your journey you will come against 24 varied logical puzzles and minigames.\nSTORY: A dark adventure between dream and reality.\nMUSIC: Exceptional soundtrack with over 40 tracks.\nMoreover:Moral choices which will affect the game's ending.\n34 achievements to complete.\n4-6 hours gameplay.\nLanguages: English, German, French, Spanish, Polish, Russian, Italian.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"OhNoo Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":16522,"name":"Written in the Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/734/734e3b691dfea8b2f5e16b2aaaee681c.jpg","description":"As the daughter of a detective, Azure has always been a curious child.\nWhen she finds something, or someone, out of the ordinary, she has a compulsion to watch on and make sense of what she's seen.\nBut on this particular night, Azure's curiosity proves to be her undoing.\nAfter stalking a suspicious figure through the night, Azure stumbles across an odd, black box, bearing alien writing. And within that box she finds a small ring, just her size, with writing matching that of the box. Without thinking, Azure picks up the ring, and the moment she does, footsteps appear behind her.\nPanicked, Azure flees the scene. She runs home to safety, examines the ring, and wonders why she risked her safety for such a small trinket. But the moment she puts the ring on, Azure realizes she's gotten more than she bargained for.\nThe footsteps belonged to a small alien girl, Sienna, who explains that the ring cannot be removed. It is an alien mating ring stolen by the FBI during an intergalactic peace conference. The ring is the key to bringing peace to the planets, and as the daughter of the emperor of Mars, Sienna came to earth to retrieve it.\nBut the ring has already chosen its host, Azure, and is now bound to her forever. And with it, Sienna too has been bound to the human girl, fated to be her lover.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Unwonted Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15964,"name":"Joe Dever's Lone Wolf HD Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0be/0be484b84b5013702620b70eaa6344ad.jpg","description":"The video game where you are the hero\nLone Wolf is back, as a video game with a brand-new story, a deep combat system, stunning graphics and much more! Make meaningful choices and carve your own path through this epic non-linear adventure. Test your strength in dynamic turn-based battles, prove your skill with the lock-picking minigame and accept the challenge of wits posed by the mysterious Shianti Cube!\nThe author Joe Dever has played an active role in the development of the game. The story he has written fits with the original continuity, but it also sheds a new light on Lone Wolf’s world, Magnamund!\nFor Sommerlund and the Kai!HD Remastered edition enhancements\nA seamless experience that includes all 4 acts of the story. Discover what happened at the frontier village of Rockstarn, explore the Sunken Forest and unveil the secrets of the Shianti Temple. Then, take the fight to the enemy storming the fortress of V’taag. Are you ready to write your own destiny?\nImproved graphics. Enjoy new lighting effects, high resolution textures and particles: precious details that can be appreciated only in this HD Remastered version.\nA brand-new Gallery that includes both pre-production artwork and 3D models. Discover how the designers and the artists created the game world!\nBonus content included (access the game local files to retrieve it): Original soundtrack in MP3 format and Digital artbook.Key Features\nA brand-new adventure written by Joe Dever, with a deep and dark redesign of Lone Wolf, his world and his enemies.\nA real medieval tome with hand-drawn illustrations.\nCreate your character and try out different combinations of Kai Disciplines, traits and gear.\nWrite your own story through multiple choices.\nA real combat system, where your prowess really counts –no random number table or dice to throw!\nWield Lone Wolf’s signature weapon, the Sommerswerd, to unleash devastating attacks that can change the tide of any battle!\n3 different difficulty levels to make the fighting experience more accessible -or more challenging!\nPlay again, make different choices and explore new paths and fighting styles!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":15593,"name":"Mindless Running","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0dc/0dce3600ad5f994fbc024b7f0fc8f0db.jpg","description":"Mindless Running - it's a classic runner with story mode. Explore a randomly-generated world while listening to a unique soundtrack.\nOur hero will have to go off on a dangerous journey, go through thick and thin, overcome hardships and obstacles to get to his Granny (who has baked his favourite Pedigree snacks for her beloved grandson ). Due to player needs motivation, during the journey the lives of the hero and his friends will be permanently in danger. See if you can take that!\nDespite a chosen difficulty level it will always be hard as HELL! Test yourself and complete a number of challenging levels to enjoy to the full one of the main features of the game - its system of narrative dialogues in the spirit of modern role-playing AAA projects with a shade of delicate irony.\nEarn as many points as possible while playing normal game mode to unlock Steam achievements! There are no ratings and best scores in Mindless Running - you're too unique and it's no need for anyone to know your results. Anyway you are the smartest and the hottest here.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":15334,"name":"Red Comrades 2: For the Great Justice. Reloaded","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f88/f8826b8705c48a74bc39616ac38e6724.jpg","description":"Darkestville Castle Coming Soon\nSave 50% with first part of Red Comrades http://store.steampowered.com/app/415610/\nAbout the GameSequel to the amazing adventures of two Russian pop-culture legends: Vasily Ivanovich Chapaev and his fellow aide Petka who fearlessly beat off the alien invasion in a first franchise installment.\nIt would seem the peace and quiet are going to last for a long time now... Like fun they are!\nRussia. The year 1917.\nDivision commander Chapaev had gotten wounded and was shot again as he tried to cross over the Ural River and rest under the shade of the birches. One would think it was all over and there was no hope left for Vasily Ivanovich. Like fun it was! All of the sudden the beam from outer space moved Chapaev into the alien ship. He would rather never talk about the experiments these creatures carried out on him. They inserted a chip into his head to turn him into a killing machine - terminator. In order to remove this thing from сcommander's head and to restore his human personality our heroes got into the catacombs beneath village Backwoods and discovered a time machine there. Without a second thought they used it to travel through time and space... to USA of the year 1969! That's where the new story begins...\nVasily Ivanovich Chapaev and Petka embark on even a weirder adventure than before\nStory and puzzles will beat your brains out!\nJokes are beyond the ghostly bounds of propriety\nJudgment day is coming!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"S.K.I.F. Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":11023,"name":"Air Brawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/533/533a29c072237b1888c4d40836981f3e.jpg","description":"Air Brawl provides interesting and creative ways for the player to destroy their enemies.  Instead of just damage, weapons have many different attributes they can afflict on their targets. Some weapons slow the enemy, some disable their steering and some damage them over time. And these are just a few.Class basedThe game features 6 planes with varying roles and loadouts.\n\nThe planes are:\n\nThe Fatbird which excels at close  quarters combat and setting up traps.\n\nThe Sharp Shooter which utilizes high accuracy weapons and high mobility to get the upper hand\nThe Witch Doctor which specialises in dealing damage over time area denial.\n\nThe Viking which overpowers its foes with its high health and strong belief that hammers make great anti aircraft weapons.\n\nThe Cyber Priest which has great supportive abilities. Either healing its team mates or disabling enemies, setting them up as easy targets.\n\nThe Elder which is the newest addition to Air Brawl. It has high burst damage as well as lots of crowd controls like entangling roots or magnetic fields.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Landfall","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10561,"name":"Elisa: The Innkeeper - Prequel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03a/03ad6cde810186fa740811b0c92bf3b4.jpg","description":"Complete Game Now Available!Our complete game is finally available!!! Have a look, you will find a lot of new features and goodies in there!\nhttp://store.steampowered.com/app/576400\nAbout the Game\"If I married all those who said they want me, now I would have so many of those husbands. All men who stay at this inn immediately fall in love with me...\" Elisa\n\nOur visual novel introduces the story of Elisa, a beautiful owner of an inn, struggling with the amorous proposal of honorable Knights, high born Princes and rich Merchants.\nIt will be the Player to decide Elisa's fate and his/her choices may even influence her destiny for the better or the worse.\n\nThe Player is -not- the protagonist of this story, however.\nHis/Her judgements affect every character and their actions, like a god that watches everything from above. For this reason, every decision is a tough choice to make.\nYour choice will change the story forever!\n\n\nOur Prequel summarizes about 20% of our complete story and features 3 main story branches.\nThe choices you make take account for the possibility of gaining special items; It's up to you to dicover them and when to use them.\nThis allows you to influence the outcome of the story in a positive or negative way in specific situations, deciding how the story unfolds.\n\nOf course all of those features will play a much more important role once our story will be available in the future.\n\nThe Prequel is just our first step!\nHope you enjoy it!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Neoclassic Games","platforms":[{"id":0,"name":"PC"}]},{"id":5567,"name":"Fight Night Round 4","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7b/d7bf14ce235e7dbb2f83ffd383ae97ed.jpg","description":"EA SPORTS™ Fight Night Round 4 is one of the most anticipated games of the year. With an all new physics based gameplay engine, unique boxer styles, the fastest and truest representation of the “Sweet Science”, and the most impressive boxer roster ever, Fight Night Round 4 takes video game boxing to a new level. One Clean Punch Away From Victory.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3525,"name":"Blood of the Werewolf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b6/8b64da43fc5396db3a50604aa99643ff.jpg","description":"Special EditionNew Features in Blood of the Werewolf (2.0)\nBlood of the Werewolf now has 3 game modes (all with leaderboards)\nSpeed Run (Story) - You didn't start off speed running Mario and you won't here either. Experience, perfect, and execute THE RUN to compete on leaderboards for the fastest time.\nScore Run - You think you have mastered the platforming? You can zip around the level in minutes? Try getting the highest score by collecting and destroying 100's of strategically placed sigils, time bonuses, and enemies for points\nEndless Run - How long can you last and how far can you get in Selena's Endless Nightmare of procedurally generated platforms and obstacles.Fixes and UpdatesWe spent 6 months in forums, answering emails, and play testing the game to gather as much feedback as possible.\nWe identified the top 20 issues/stuck spots and addressed them.\nPolished/tuned the controls\nNew and updated animations\nNew and updated particles\nCamera tweaks and fixes\nAudio updates and fixes.\nThank you so much. You have made our game better, we now have more fun playing it, and we are grateful. THANK YOU!\nFull Controller Support\nAbout the GameBlood of the Werewolf (2.0)\nBecome Selena, loving mother, devoted wife and -- powerful werewolf. Take revenge on the monsters that have slain your husband and stolen your child, in this love letter to classic platformers. Seamlessly transform from human to werewolf in light of the moon, as you shoot, slash and smash your way to fight Frankenstein.\nIntense Platforming Action, With All Your Favorite Iconic Monsters\n9.2/10\n\"A Love Letter To The Action-Platform Genre. If you want an action-platform game with great gameplay, challenge and a story that is simple but enjoyable, Blood of the Werewolf is the game for you.\"   \"Selena responds with perfection to the button presses.\"\nhttp://corruptedcartridge.com/blood-werewolf-review-love-letter-action-platform-genre/\n9/10\n\"This game propelled me back to those halcyon days when I started gaming, and games were extremely difficult yet ultimately all the more rewarding.\"\nhttp://www.midlifegamer.net/reviews/2014/04/blood-werewolf-review.html\n8.5/10\n\"Overall, Blood of the Werewolf is a great platformer. It provides a wonderful sense of atmosphere, the story is well written and well told, and the gameplay mechanics feel fantastic. You may destroy a keyboard or controller out of rage, but you’ll want to buy another to see this great game to the end. Fans of platformers, especially old-school platformers, should give this game a serious look.\"\nhttp://www.capsulecomputers.com.au/2013/11/blood-of-the-werewolf-review/\n8.4/10\n\"An excellent action-platformer that wonderfully combines challenging but fair gameplay with a colorful and vibrant art style. \"\nhttp://www.worldsfactory.net/2013/11/03/blood-of-the-werewolf-review\n8/10\n\"Scientifically Proven has managed to create a piece worthy of its platforming predecessors, where gore blends with horror creating an atmosphere that will captivate you.\" Dying too often gets frustrating at times, but not that much as to make you want to ditch the game. The beautiful visuals along with the multitude of monsters will keep you company while journeying in an adventure like never before.\"\nhttp://www.softpedia.com/reviews/games/pc/Blood-of-the-Werewolf-Review-396460.shtml\n8/10\n\"Blood of the Werewolf is a beautiful platform game - A classic mold with a ...unique garment that will not make you regret your investment and still promises to steal many hours of your day.\" (translation)\nhttp://www.techtudo.com.br/tudo-sobre/s/blood-werewolf.html\n8/10\n\"Beautiful, rhythmic, and well done\"\nhttp://www.jeuxvideo.com/articles/0001/00019064-blood-of-the-werewolf-test.htm\nBlood of the Werewolf takes players on a ruthless journey of revenge through 3 level filled game modes of white knuckle platforming action while taking on hordes of creatures and iconic monster-movie bosses; Creature, Hyde, Dracula, Mummy, Frankenstein. Selena has access to upgradeable weapons in human form and unlockable wolf powers when transformed. Additional modes like speed run and score rush will test your reflexes and memory, with online leaderboards to keep track of yourself, and friends.\nKeep your wits about you, Blood of the Werewolf will test your limits and offer a challenge you haven't seen since the golden age of games.Features\nExperience a rich, in-depth Story Mode featuring 30+ creatures, 15 button-grinding levels to master and five heart-pounding boss arenas\nScore Rush mode offers the pro a whole new leaderboard driven experience as you compete for the highest score.\nEndless Challenge is a nightmare of procedurally generated levels and monsters that increase in difficulty. How far can you make it?\nShift instantaneously between human and werewolf form when in view of a full moon\nHardcore, classic platforming gameplay with a modern twist; pressure sensitive, full air controls for precision moves\nUnlock a bevy of achievements, pushing you to the limit of your abilities\nUpgrade weapons and wolf powers, for the edge you need against the monster onslaught\nUncover hundreds of collectibles and hidden items to discover throughout the game","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Scientifically Proven","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":428046,"name":"SLAPSHOT Rebound","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca8/ca83e25ed199edaa56fdc4c013b8112a.jpg","description":"Slapshot is an online multiplayer game where you and 5 other players play a game of hockey. The game is physics-based, so teamwork and crisp passing are essential to win. Play with your friends or team up with other Slapshot players!\nFree-to-Play\nSlapshot is free-to-play indefinitely. Cosmetic elements are available for purchase and obtainable through gameplay.\nControls\nYou control your own player's movements with WASD and a mouse. Use the mouse to swing your stick and control the puck. Trackpads work, but a mouse is absolutely recommended.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Oddshot Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":51489,"name":"Rock Band 4","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/deb/deb8300e9df7e3a0be760fdbfc7695a3.jpg","description":"Rock Band 4 offers the unique social play of a full band experience—featuring a next-gen microphone, wireless drums and guitar, and a revamped world tour campaign mode. Add your personal signature to every performance. With Freestyle Guitar Solo, you can string together blistering licks and wow the crowd with your own incendiary solos. With a soundtrack featuring some of the world's biggest acts, plus an ever-expanding catalog of over 1,500 playable songs, it’s easy to put together a keen set list.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":27159,"name":"New Super Mario Bros. 2","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/785/785b3279c7849b56e5055232fe94d5eb.jpg","description":"Bowser has once again kidnapped Princess Peach, but this time, Mario has\nanother objective. The Mushroom Kingdom is bursting with more gold coins\nthan before. Each level is littered with gold as coins rain down from\noverhead pipes, trails of coins are left behind special gold enemies and\ngold pipes transport Mario into coin-filled caverns. It's up to players\nto collect as many coins as possible throughout their adventure.\n\nFEATURES:\n\nThe game records all the coins players collect throughout the game, so\ncompleting a level is only part of the fun. Every level is filled with\ngolden opportunities, such as gold rings that turn enemies into\nvaluable gold versions and a Gold Flower that gives Mario the ability\nto turn almost anything in his path into coins.\n\nCoin Rush Mode allows players to collect as many coins as possible\nacross three levels and challenge friends to beat their record via\nStreetPass.\n\nNew Super Mario Bros. 2 is an all-new side-scrolling adventure game\nfeaturing Mario and Luigi. Two players who each own the game will have\nthe option to play the entire game in two-player multiplayer mode\nusing local wireless.\n\nThe return of Raccoon Mario gives Mario the ability to fly and access\nhidden areas.\n\nPlayers will have the option to either purchase the game at retail\nstores or download the entire game through the Nintendo eShop.\n\nIn-game content available for purchase using stored account funds.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":21460,"name":"Luxor Mahjong","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab0/ab010e284758f22c150480f46eb058c8.jpg","description":"Embark on an epic quest to recover the stolen treasures of Ancient Egypt in LUXOR: Mah Jong. The fun and challenge is unending with 200 unique layouts available in 3 awesome play modes; Adventure, Single and Traditional. Three difficulty settings ensure that any player will find a challenge, and 3 exotic tile sets make LUXOR: Mah Jong a truly custom experience. Can you work your way up from a lowly farm hand to become the Pharaoh of all Egypt?\n200 Unique Mah Jong Layouts\n3 Exotic Tile Sets\n5 Magical Power-Ups\n3 Difficulty Settings\n3 Modes of Play - Adventure, Single, Traditional\nUnique Player Ranking system\nAll New Adventures in the Land of Egypt","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"MumboJumbo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20214,"name":"eXceed 3rd - Jade Penetrate Black Package","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/381/3816d0b00d447a21fe5ad5335e46efce.jpg","description":"eXceed 3rd reboots the eXceed storyline, taking it in a new direction. In this installment, Rayne Lindwurm, a descendent of the Dragon Clan, fights her way through a tournament to become one of the 7 Cardinal Lords who rule her world, Pandemonium. Standing in her way are other competitors and their familiars, including her own older sister and heiress to the mighty Dragon Clan, Celestia Lindwurm.\nRayne must use her Mini-Tiamats, bombs, and the Burn Air Raid homing special attack to fight her way through the tournament and win a seat as a Cardinal Lord. Also featuring a slowdown feature for precise maneuvering through 'bullet curtains', multiple scoring multipliers, localized cut scenes, and memorable bosses, you'll be driven to help Rayne in her journey to power.Key Features:6 action-packed stages\nDynamic difficult balancing, depending on the player’s skill\nMultiple scoring mechanics including bullet grazing and bullet cancelling\nCutscene-driven story-telling\nHigh production values – outstanding graphics, music and gameplay","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Tennen-sozai","platforms":[{"id":0,"name":"PC"}]},{"id":18341,"name":"Tobe's Vertical Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0b/d0b650d52a0b855704eeb3ef48dddeba.jpg","description":"Tobe's Vertical Adventure is an indie, retro, platformer starring Tobe, the overly devoted gamer who's been forced on a treasure hunt by his materialistic crush, Nana. The big headed duo will travel back and forth in the crumbling caves in search of treasures while rescuing fluffy animals, making you scream kawaii ne~ along the way. With 2 unique characters and a total of 4 islands and 16 levels to explore, Tobe's Vertical Adventure shall bring you back to the 16-bit era.\nKey features:\n\nHours of classic platforming action through 16 levels across 4 islands\nPlay as Tobe or Nana, each with a unique storyline and move sets\nCo-op Mode with a friend, as both Tobe and Nana\n16 bit graphical retro goodness\nExperience the story through cutscenes and unlock the collectable soundtracks and artbook\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Secret Base","platforms":[{"id":0,"name":"PC"}]},{"id":5883,"name":"Gunman Clive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2cc/2cc61b51e897437427a126649d4403cd.jpg","description":"In the year of 18XX, the west is overrun by thugs and outlaws. A group of bandits have kidnapped Mayor Johnsons daughter and are spreading havok across the land. Only Gunman Clive can bring order to the west and save the girl!\nJump and shoot your way across 16 diverse and challenging levels and fight massive bosses. Gunman Clive is an old-school sidescrolling platform game set in the old west with full 3D graphics and a unique artstyle.\nFeatures:\nOld school sidescrolling action\nFull 3D graphics\nUnique sketch shaded artstyle\n3 different playable characters\nDozens of different enemies\nEpic boss battlesSupports Xbox 360 controllers","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hörberg Productions","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]}]