[{"id":276685,"name":"STEINS;GATE: Linear Bounded Phenogram","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4a/c4a35ffac64e6550fac6a692910792d7.jpg","description":"A story for every lab member. Discover a new side of each STEINS;GATE character and get a glimpse of their inner thoughts through 10 new stories.\nWhile STEINS;GATE unfolded from the perspective of the protagonist, Okabe Rintaro, STEINS;GATE: Linear Bounded Phenogram features stories told by the rest of the main cast.\nSTEINS;GATE: Linear Bounded Phenogram is available only with purchase of STEINS;GATE ELITE","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"MAGES","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"}]},{"id":274789,"name":"Operencia: The Stolen Sun","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f1/6f100647dc262a70216e418f56dc4322.jpg","description":"Zen Studios’ modern homage to classic first-person dungeon-crawlers takes you to the land of Operencia, an unconventional fantasy world inspired by a faraway land referenced in countless Central European folktales. An old-school turn-based battle system combines with inspiration from unexplored mythology to offer an RPG experience that feels unique yet also familiar.\nAn unknown force has abducted the Sun King Napkiraly, leaving Operencia in a state of perpetual darkness – and eventual doom. From hidden royal tombs and cursed castles to an ascent up the World Tree to reach the Copper Forest of the Land of the Gods, explore diverse settings throughout the far reaches of the land…and beyond. Each location boasts its own unique atmosphere, visual style, level design and puzzles, and many take place entirely outdoors.\nOperencia is home to an intriguing mix of unexplored mythology and fantastical versions of actual historical locations (e.g., Deva Fortress, Balvanyos) and characters (e.g., Attila, Seven Chieftains of the Magyars), all coming together to form one cohesive new gaming universe. Several of your own seven party members take influence from heroes of forgotten tales told hundreds of years ago, such as the brave knight Mezey and Sebastian the Dragon Slayer.\nAlong with a deeply strategic turn-based battle system full of spells and special skills to execute, tile-based movement encourages thorough exploration of each area. For added challenge, turn on Cartographer mode to plot out each of the 13 maps yourself. How many secrets will you find?\nBreathtaking hand-drawn cutscenes and fabulous 2D character portraits bring the story to life in a style not easily compared to any other game. More than 30 colorful roles are fully voiced through top-tier performances authentic to the game’s Central European roots.\nExplore 13 diverse, puzzle-filled levels\nDefeat more than 50 enemy types\nSwitch between 7 fully upgradable – and memorable – characters\nRobust difficulty settings allow you to select options such as limiting saves, implementing permadeath, and disabling auto-mapping to create your own\nStunning visuals powered by Unreal Engine 4\nAn epic orchestral score composed by Arthur Grosz\nFully 3D environments, enemies and objects, plus high-fidelity advanced effects with dynamic shadows and lighting\nAAA Indie production quality and polish with top-tier voice acting, soundtrack, cutscenes and writing","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Zen Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":264744,"name":"Druidstone: The Secret of the Menhir Forest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5f/a5feb03fffd55b85dda949ff4db8a500.jpg","description":"The druids of the Menhir Forest are troubled. Not only has the Archdruid disappeared, a darkness in the form of purple cysts has fallen upon the forest. It is up to Aava, the daughter of the Archdruid and her new-found companions Leonhard, a mysterious man with no past, and Oiko the mage, a dropout from the guild of Red Priests, to rescue the Archdruid and find out the truth behind the sinister events. As if this wasn't enough, a murderous maniac impersonating Leonhard is at loose in the forest....\nDruidstone: The Secret of the Menhir Forest is a labor of love from the makers of the critically acclaimed Legend of Grimrock series. Druidstone is a tactical, single-player, turn-based roleplaying game, which combines the best qualities of modern RPGs with the elegance of tactical boardgames. Every action, every turn counts as you control your party of heroes through handcrafted, challenging missions with varying objectives.\nDruidstone is set in a unique fantasy world, Elo Sphaera, filled with ancient, lush forests, standing stones, snow-topped mountains, deadly creatures and puzzle-ridden ruins. The epic story about love and death is centered around the main characters Leonhard, Aava and Oiko, who will along the way meet up with unexpected companions and villains, each with their unique personalities and abilities.\nGet ready to venture forth and uncover the secrets of the Menhir Forest!Key Features\nA tactical turn- and tile-based battle system where every action, every turn counts.\nUpgrade the abilities of your heroes as you see fit using power gems obtained by completing missions and discovering hidden treasures.\nChallenging, hand-crafted missions with playtimes ranging from 15 minutes to 45 minutes.\nSolve devious non-combat puzzle levels to obtain rare equipment.\nA gripping, fantastic story of love and death centered around the main characters Leonhard, Aava and Oiko.\nA unique fantasy setting combining elements from western RPGs, JRPGs and tactical boardgames in unexpected ways.\nPlay custom missions created by others or make your own campaigns with the upcoming Druidstone Level Editor available as a post release update.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ctrl Alt Ninja","platforms":[{"id":0,"name":"PC"}]},{"id":244828,"name":"macdows 95","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c03/c03c244e7f0471909f4502fa3b616db1.jpg","description":"macdows 95 is an absurd puzzle game based on an imaginary operating system. The main purpose of the game is to fulfill these absurd tasks. On the other hand, when solving puzzles, someone communicates with you from a secret spot.Key Features25 different puzzles\nA heart-warming story\nRelaxing music & sounds\n100% indie - designed and developed by Yunus AyyildizEssentialsa keyboard\na mouse\na working brain","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Yunus Ayyildiz","platforms":[{"id":0,"name":"PC"}]},{"id":216298,"name":"Iris.Fall","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4a/b4ac6738de53fc8922c87f6972e6139c.jpg","description":"Iris.Fall, a puzzle game with an extraordinary art style, has “light and shadow” as its core concept. With a combination of graphics that have a strong black-and-white contrast and an imaginative storyline, Iris.Fall gives players a gaming experience full of wonder.Story background:Iris awakens from her dreams and follows a black cat into a dilapidated theater, traveling back and forth through a strange labyrinth of light and shadow. As the story unfolds, Iris slowly discovers that everything in this theater seems to have some kind of hidden connection to herself…Key Features\n• Unique black-and-white contrast art style\nThe game’s visual style uses a pure black-and-white cartoon style, relying on the transition between light and shadow to create a distinct visual experience, both exquisite and visually impactful.\n• A perfect fusion of gameplay and light & shadow system\nThe concept of “light” and “shadow” runs throughout the designs of the game’s art, story, and puzzles. By switching between light and shadow, players go through the two worlds of reality and shadow, feeling the unique experience of interlacing black and white, light and shadow, 2D and 3D.\n• Immersive story experience\nPlayers become fully immersed in the plot through the stylized suspenseful atmosphere of the setting and the story, making players’ progress in the game more like a spiritual exploration.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Next Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":52995,"name":"Gran Turismo","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ac/5ac568dcf73aedba140bcca2a8a5eb09.jpg","description":"Gran Turismo is a sim racing video game designed by Kazunori Yamauchi. Gran Turismo was developed by Polys Entertainment and published by Sony Computer Entertainment in 1997 for the PlayStation video game console. The game's development group was established as Polyphony Digital in 1998.\nAfter five years of development time, it was well-received publicly and critically, shipping a total of 10.85 million copies worldwide as of March 2013 (making it the best-selling PlayStation game), and scoring an average of 95% in GameRankings' aggregate, making it the highest rated racing video game of all-time. Many publications have deemed it one of the greatest video games of all time. The game has started a series, and has spawned over 10 spin-offs and sequels.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":21704,"name":"Stick RPG 2: Director's Cut","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2c/a2cf13c40045f4ed0755d1a2f3ea5393.jpg","description":"Get ready to enter the 2nd Dimension!\nThrust into a bizarre and unfamiliar city and find your place among strange citizens. Work, Fight, Study, Eat, Drink, Gamble, Train, Sleep, Quest, Collect, Invest, Repeat. Build up your Stats and Net Worth, collect the mysterious trans-dimensional artifacts, solve the mysteries of Paper Thin City and find your way home.\nThe Director's Cut contains tons of new content not available in the online version\nNew Areas to explore and new Quests to complete\nA total of 25 Careers, including Lumberjack, Professor, Escort, Personal Trainer, Light Knight and Dark Lord\n18 new Weapons\n3 new Combat Zones\nAll Cheats Unlocked\nOnline and Offline Saving\nExpanded Romance System\n2 new Mini-games\n30 Trophies to earn\nFull Original Soundtrack in MP3 format","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"XGen Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20711,"name":"eversion","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/975/975cf2f2272bea61fa0c9904fd69c7c9.jpg","description":"The Princess of the Flower Kingdom has vanished! She was taken by the Ghulibas of the north, and it is up to brave Zee Tee to rescue her. On his quest, he - and you - will discover the hidden lands behind the peaceful kingdom, and come face to face with secrets that will set you on edge!\nThis is the high-definition version of indie fan favorite Eversion, now with Steam support! Complete achievements and compete against your friends in Time Attack levels!\nKey features:\nRetro-style platform gameplay\nDimension-shifting gameplay changes the level around you\nExplore eight carefully crafted unique worlds\nHand-drawn pixel art, legitimate indie-style\nSurprising plot twists\nGame length ideal for busy videogame fans\nThree different endings\nExtra entertainment value when played alone at night\nAn unforgettable experience\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Zaratustra Productions","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20560,"name":"Bloodwood Reload","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9b/d9b6fdfe0100108896a1001b7a24e4ac.jpg","description":"In a small village in central Europe something is happening, the forest growing around has something different. Its wood is red color,  unique in the world. This does not pass unnoticed to the world's largest logging company, the White Wood Company, which does not hesitate to send their best expert to take over the exploitation rights. But what apparently seemed a routine work, will become a horrible nightmare when the man of the company begins to investigate the dark past of the village.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Luminy Studios","platforms":[{"id":0,"name":"PC"}]},{"id":15719,"name":"Triennale Game Collection","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/886/8865c116c603902c88c5a4507d230eb1.jpg","description":"The Triennale Game Collection is a free virtual exhibition of video games created for the XXI Triennale International Exhibition by five of the world’s most renowned independent game designers, showcasing these artists’ experimental approach to interactivity.\nThe five featured artists are: Mario von Rickenbach and Christian Etter (Dreii, Plug & Play), Tale of Tales (The Path, Sunset, Luxuria Superbia), Cardboard Computer (Kentucky Route Zero), Pol Clarissou (Orchids to Dusk), and Katie Rose Pipkin (Mirror Lake). These games are self-contained takes at interactive narrative, puzzles, and exploration.\nOver the past decade, more innovative games have been designed than in the previous thirty years of this medium – video games are now more than entertainment for kids or for video game enthusiasts, they reach the accessibility and cultural depth of film, music, and literature. The Collection presents the state of the art of the medium with a glimpse into the future, presenting the work of the most important and original international designers.\nProduced by Santa Ragione (FOTONICA, MirrorMoon EP, Wheels of Aurelia)\nGames descriptions:\n[Game 1] Il Filo Conduttore by Mario von Rickenbach and Christian Etter (Switzerland), is a small story about about a cord, which hangs down from the top, overlooking a handful of delicately arranged objects.\n[Game 2] LOCK by Auriea Harvey and Michaël Samyn (Tale of Tales, Belgium) is a small exploration of the universe, as previously imagined: based on cosmologies which place the Earth, and thus humans, at the center of the universe, Loci Omnes Caelesistis Kyries shifts between a simple diagram and a fascinating machine.\n[Game 3] Neighbor by Jake Elliott, Tamas Kemenczy and Ben Babbitt (Cardboard Computer, USA). The crater is roughly sixty meters in diameter, rocky, hot in the daytime and cool at night, home to cacti that bears edible fruit.\n[Game 4] A Glass Room by Pol Clarissou (France) showcases pictures and animated sequences from Pol Clarissou’s own life. The flickering photographs projected on virtual walls create a narrative that evolves as the player manipulates the device.\n[Game 5] The Worm Room by Katie Rose Pipkin (USA) is a first-person exploration game which exists as a series of endless glass greenhouses that the player may wander through for the same reasons one visits a physical botanical garden; to walk, to take in beauty, to learn.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cardboard Computer","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14427,"name":"Job the Leprechaun","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f8/6f83d304412bd8711a74c55f37a7bcf9.jpg","description":"Do you like Platformer Games?\nHelp Job the Leprechaun to rescue his friend Eri on this retro style one.\nCollect all clovers on stage and find the door to go to the next level.\nA horde of goblins, zombies, caterpillars and many more monsters will try to stop you, use your Magic Hat to kill them all.\nYou are not alone in this adventure, Catalina Cow and and The Elf will help you with their abilities.\nWill peace and quiet come back to Leprechaun Village?Features:38 levels full of monsters and puzzles.\nRetro Pixel-Art and Chiptune Sound.\nFull Controller Support.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Herrero Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13294,"name":"Lucent Heart","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ec/8ec00d5523796a86ef485147c62243ce.jpg","description":"Quick Synopsis\nLucent Heart is a free-to-play MMORPG with an emphasis on relationship building between players. Whether players decide to search for ancient treasures or dance the night away in Thereall City square, a magical and action-packed journey is no less than expected in the lands of Acadia. The Open Beta event will be host to a slew of new content such as new zones and dungeons to explore, new threats to face, new weapons and armor to obtain, but most of all, the highly coveted player housing!\nFeatures\n•\tThe Cupid System; An extensive matchmaking system to help players find their soul mate\n•\tA Marriage System for soul mates including the ability for same-sex marriage\n•\tA new chapter in the Lucent Heart story to dive into with a fresh and compelling social community accepting of all types of players\n•\tA Babylonian inspired Zodiac System that adds new levels of challenge and complexity on the battlefield\n•\tAnd finally, a new highly-anticipated feature; Player Housing. Players will be able to acquire their own in-game houses that are fully customizable, sociable and constantly evolving\nHousing System\nThe new player housing feature allows players to fully customize a room of their own. This customization includes things such as furnishing, wallpaper and even lighting. The more stylish the player’s house is the more style points they will be awarded. Players will also be able to create their own treasure hunt games in their houses and compete in teams with their friends for rewards and high scores!\nFaith System\nPlayers will also be able to explore a new feature called the Faith System. This is similar to the current Astrolabe Tree system found in Lucent Heart in the sense that you are able to learn new abilities that cater to either light or darkness. In order to activate those skills players must acquire either Light or Dark Faith Points by performing tasks for Theia and Cadena. Will players travel the path of light or the road of darkness? We can’t wait to find out!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playcoo","platforms":[{"id":0,"name":"PC"}]},{"id":10334,"name":"One Eyed Kutkh","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80b/80b2197b44ff375bb208e1943defc8c4.jpg","description":"One-Eye Kutkh - an exciting space adventure based on the fairy tales of the Far North.\nA single traveler on his way home crashes on a mysterious planet. To continue his journey, he'll have to get to the ninth heaven, deceive the Sun and the Moon and steal their space-boats.\nGame features\n- The unique graphic style\n- A mix of fiction and fairy tales of the Far North\n- Explore the World Tree\n- Two playable characters\n- The game tells its story through the action\n- Interesting and simple puzzles for everyone: from child to elder\nOne Eye Kutkh  is an experimental project, something in between video game, theatrical performance and an animated film. But most importantly, One-Eye Kutkh is a unique world filled with the atmosphere of the Northern myths. The challenge of the game lies not within obstacles that prevent the player from moving forward, but within the possibility to see the world through the eyes of his heroes.\nWe will be happy if you give our game an hour of your time and are grateful if you tell us about your impressions, good or bad.\nIf you liked \"One Eyed Kutkh\" and you'd like to support developers you can do that by buying DLC. Here's a list of what you'll get for purchasing it:\n- Two digital art books showcasing concept art (44 pages), in-game art (32 pages) and scans from design notebook (80 pages).\n- Original music soundtrack consists of 6 original and one bonus track, a total of 15 minutes.\n- Desktop backgrounds.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sometimes You","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3255,"name":"Onechanbara Z2: Chaos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/552/552fdf9cdae9c84c833f0ed59ce627be.jpg","description":"All DLC BundleAll DLC Bundle Here!!\nhttp://store.steampowered.com/bundle/701/\nAbout the GameKagura and Saaya are schoolgirl sisters raised together by the Vampiric Clan, and rank among their strongest warriors. Aya and Saki are assassin sisters descended from the rival Baneful Bloodline, and represent their lineage with esteem.\nNow, these four must learn to fight together against an undead army. Brought under one banner known as the “Zombie Punitive Force,” these blood enemies will have to reach a mutual understanding in order to save the world as we know it.\nAnd as long as they’re working together, they might as well do it in style…\nOnechanbara Z2: Chaos is the latest entry in the Onechanbara series. The Vampiric sisters and two legendary zombie-hunting sisters of Baneful blood battle through over a dozen stages of high-octane real-time swordplay. Fight off the invasion in gruesome detail, occasionally transforming into a demon for short bursts of added power and speed. Enjoy the gameplay experience with the original Japanese voices or – for the first time in series history – a full English dub.\n--Web-------------------\nhttp://www.d3p.co.jp/anez2_chaos_pc/#top\n--SNS-------------------\nhttps://twitter.com/anechan_d3p\n--YOUTUBE-------------------\nhttps://www.youtube.com/user/D3Publisher","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"XSEED Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":962025,"name":"Like a Dragon: Infinite Wealth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9d/f9d124268f23a61fa3aa71ecefb30cc4.jpg","description":"Two larger-than-life heroes, Ichiban Kasuga and Kazuma Kiryu are brought together by the hand of fate, or perhaps something more sinister… Live it up in Japan and explore all that Hawaii has to offer in an RPG adventure so big it spans the Pacific.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":962020,"name":"Star Wars Outlaws","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/853/853aa2b76ae85fcf2782ace58cf7479f.jpg","description":"Set between the events of Star Wars: The Empire Strikes Back and Star Wars: Return of the Jedi, players will step into the role of Kay Vess, a clever scoundrel in the galactic underworld. In Star Wars Outlaws, Kay is looking to attempt one of the biggest heists the Outer Rim has ever seen, all in an effort to start a new life.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Ubisoft Toronto","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":857636,"name":"Wild Hearts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2c/f2cb7350b37378e9e622d85bd175c294.jpg","description":"Master ancient tech to hunt down giant beasts. WILD HEARTS™ is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself. Take on these creatures alone or hunt with friends in seamless co-op.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Omega Force","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":364882,"name":"There Is No Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ab/3ab64badced3db770504b6ba4aefbfbc.jpg","description":"The entire population of the planet is eradicated by a global catastrophe. Now, the fate of the world as we know it lies on the shoulders of but one man. Battle your way through bloodthirsty demonic forces to bring order to the world… Or become the herald of its destruction.\nA CITY, UNDERGROUND Set out on a perilous journey through an arresting blend of a post-apocalyptic setting and religious themes.\nFUELED BY FURY Slay your enemies with unique abilities, powered by your Rage.\nTRANSFORM THE WORLD Ever-shifting locations, that react and change according to your deeds - along with your character.\nFREEDOM TO EXPLORE Engage the world your way - the non-linear structure of the game allows the player to navigate the world freely.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Zelart","platforms":[{"id":0,"name":"PC"}]},{"id":248450,"name":"Gachi Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a1/2a1f40b4fa3c6e1f112ac1d96287e77f.jpg","description":"Gachi Heroes is a game about the dark fantasies. That's amazing an endlass journey in which you will know yourself with your favorite gachimuchi characters. How deep would you go?\nFeatures:\nA game in which it is impossible to lose!\nEndless unforgettable gaymeplay on the fingertips.\nLots of unique animated backgrounds.\nPowerful soundtrack, from the best cumposers, giving strength and confidence!\nAwesome characters that have become iconic on the Internet!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Lohsoft","platforms":[{"id":0,"name":"PC"}]},{"id":59202,"name":"World of Warcraft: Battle for Azeroth","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/57d/57d6ec9d834061bb0dcc43d240e9cb3c.jpg","description":"Azeroth paid a terrible price to end the apocalyptic march of the Legion’s crusade—but even as the world’s wounds are tended, it is the shattered trust between the Alliance and Horde that may prove hardest to mend. As this age-old conflict reignites, join your allies and champion your faction’s cause—Azeroth’s future will be forged in the fires of war.\nExplore Azeroth as new playable Allied Races, including four you've encountered in your campaign against the Legion. Embark on a quest to earn their favor and unlock each race, adding their strength to your faction. Create a new character and complete the full leveling experience to earn a distinctive Heritage Armor set.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58959,"name":"Katawa Shoujo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1db/1dbd337f5c4c31fede3422e9b395557b.jpg","description":"Nakai Hisao is a normal high school student, currently in his final year of high school. One day Hisao receives a letter from parties unknown in his locker and waits at the written place for the sender. The person who wrote the letter turns out to be his crush; while speaking to her, he suddenly collapses. He awakes in a hospital bed, and is told by the doctors that the reason he collapsed is due to arrhythmia, a rare heart condition that causes his heartbeat to sometimes become irregular. Due to this, his parents have enrolled him in Yamaku, a school for disabled students of all kinds.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Four Leaf Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":40887,"name":"Pro Evolution Soccer 2012","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ba/6ba1348c19767dec1571278d010b4e84.jpg","description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, French.  Could this be the best football game ever? PES 2012's Active AI is always looking to support attacks and provide options for the most satisfying gameplay experience. Off the Ball Control makes you the target man in dead ball situations and Teammate Control gives you control over additional players. These and loads more improvements make for the most complete PES so far.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PSP"}]},{"id":38172,"name":"F.E.A.R. Perseus Mandate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e4/3e4af13ce9875c2851a0b983e37920b2.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"TimeGate Studios","platforms":[{"id":0,"name":"PC"}]},{"id":36758,"name":"Tony Hawk's American Wasteland","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/433/433f36b268f6c746d6bfb6e216b6d4f7.jpg","description":"Travel throughout the vast urban terrain of Los Angeles - Skate or bike Hollywood, East L.A. and other landmark areas without restrictions or repetition\nMore tricks and expanded controls - New on the board tricks like Bert slides, Natas spins handstands, and one-footed grinds and manuals; Off the board tricks include wall runs, wall flips, and charged jumps\nChoose to ride BMX bikes throughout the entire game, with all-new physics, a BMX-specific control system and several BMX-specific goals\nEnter and explore dozens of shops in-game to customize your gear and look - Check out skate shops, barbershops, tattoo parlors, and clothing stores as you accomplish goals and earn cash","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Neversoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"}]},{"id":20928,"name":"Luxor HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ab/6ab6520a1996d967d6031d6cde350dc9.jpg","description":"Experience LUXOR in stunning HD!  Answer the call of the goddess, Isis, in this addictive marble-shooter game. Chains of colored spheres are working their way through ancient Egypt, and it’s up to you to stop them before they reach the pyramids. Wielding your mystical winged-shooter, you must fire colored orbs into the chain to make matches of three or more, and eliminate the spheres from the chain. Clear out the entire chain, and you’ll work your way up to the next level.\nCustomize your shooter to play LUXOR just how you like it with two different types of aim assist and three control system choices to mix-and-match.  Face off with the approaching spheres in four different game modes: Practice, Adventure, Survival, and Challenge of Horace.\nTo help you in your quest, power-ups like Fireballs, Lightning Bolts and Multi-Colored Spheres will fall from the sky—use them to create thrilling special effects as they aid you along your journey!\nKey Features:\n•\t25 all-new backgrounds in High Definition\n•\t88 levels of marble-shooting puzzles\n•\t4 Game modes: Practice, Adventure, Survival, & Challenge of Horus\n•\tCollect Ankh coins to earn extra lives\n•\tCatch falling gems to earn bonus points\n•\tCustomizable controls: Mix-and-match aim assist modes & control systems\n•\tEnhanced special effects designed for the iPad\n•\tPower-ups like Stop, Slow, Reverse and Wild help you along the way\n•\tThrilling music and sound effects","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":20748,"name":"Great Permutator","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19a/19a23b70b09fd4533ebb6aaa310ceae9.jpg","description":"Great Permutator is a puzzle. Hard and tricky. One in which you will have to build a complex system of conveyors and various devices so that the colored boxes can travel across the factory and arrive at right places and in right order. If you are into clever engineering puzzles like LightBot, Manufactoria and SpaceChem, this game is for you.Features50 levels (+15 bonus levels)\n10+ types of action blocks\n16 not-so-easy achievements\nGlobal score leaderboard\nNice pixel art graphics and cool soundtrack\nLevel editor with sharing levels via Internet","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ripatti Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14455,"name":"Winter Novel","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/812/8124451df2e905e3926e63af051d9289.jpg","description":"“Snow, dullness, depression. Constant dissatisfaction with work and superiors and feeling like there is no escape. Is this what life will always be? Perhaps… but I can always hope for change to be just around the corner!…”\nSveta is a young bank intern. She believes that there is no end to the cycle of monotony that has become her life; secretly wishing for change but is too depressed to find the motivation.\nVlad is an unsociable, devil-may-care freelancer without any respect for the status quo who prefers to work alone.\nThey find their lives turned upside-down when they are forced to work together on an urgent, high-profile project that could change the course of their careers.\nCan they work together despite their differences? Will this relationship change their lives for the better?\nFeatures:\nA visual novel with an old-school style – take a trip back to the 80’s with ASCII-art!\nMusic by Sergey Eybog, compositor of “Everlasting Summer” – a compilation of chiptune-style melodies that complement the vibe of the game.\n”Less than 1MB for download?!” Winter Novel has been made in pure C – just like how they were in the good old days.\n30-60 minutes of gameplay – a game for the visual novel fans and curious casual gamers alike!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DeXP","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12428,"name":"Sisyphus Reborn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5df/5df2d677ec0446b9d774834dcd7bda0e.jpg","description":"Sisyphus Reborn is a short atmospheric existential adventure game. Light on puzzles and heavy on atmosphere, the game focuses on exploring philosophical ideas in a short form context.\nYou wake up in a world where everyone digs forever and no one dies. You will never know why or how you came to be there, but now that you are...\nHow do you find meaning in a meaningless world?\nFeatures:\n- Simple Point & Click interface\n- Approximately 30 minutes game length\n- Unique low-res hand drawn art style\n- Atmospheric soundtrack\n- Free!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Myshkin Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10886,"name":"Totemori","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21a/21a66be2ef8d7e8c4007a54f4f351bf3.jpg","description":"Totemori is a free-to-play local-multiplayer brawler where you build towers while trying to topple everyone else’s! Local versus and co-op multiplayer for up to 4 players\nPlay against your friends\nPractice against bots\nCompete in Teams or in chaotic Free-for-all\nPlay with controller or keyboardBuildBuilding blocks fall from the sky\nBuild towers and defend them\nKit out your towers with special blocks to raise their value\nSteal your enemy’s towers to make them work for youBash & RazeHurl boulders at your opponents to knock ‘em out…\n...and toss them off a cliff while you are at it!\nIf all else fails, channel your rage to blow up half the arena!Free to play!Totemori was made as a labour of love project, supported by Mito Studio\nIt’s free because we just want you to play it!Brought to you by Mito StudioMito Studio is the place within Mito where we dream up and experiment with our own ideas besides our daily work. We love tinkering with interesting, useful and even weird concepts and turn the best of them into execution to create something awesome.\nThis is how we play, this is how we learn, this is how we pursue our passion-fueled projects.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Schrolab","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":8662,"name":"Haunt the House: Terrortown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/532/532bb81d835c5eae30da80f048eeb6c7.jpeg","description":"A side-scrolling action puzzle game starring ghosts!\n...What was that sound? Is somebody there?\nLeave the dusty halls of an abandoned clock tower to haunt your way through a town in the dead of night! Possess objects with your ghostly soul, to scare people away from a museum, a hospital, a theatre and a cruise ship. Will you be able to scare everyone out and reclaim what has been lost, before the night is over?\nFeatures\nThree free expansions added since launch! Ghost Train, Mansion House and The North Pole!\nA vibrant town with 5 locations to visit, each with it's own musical style and unique objects\nHundreds of different objects to possess, with several surprising powers each to try\nA beautiful original score featuring world-class live session musicians\nA large cast of townfolk, each with a personality, voice and sense of style\nA secret second goal beyond simply scaring everyone out of town...","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SFB Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":4150,"name":"Big Sky Infinity","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77d/77d77b09526fb53080229fa0bb828750.jpg","description":"Big Sky Infinity is a fast-paced, twin-stick shooter that delivers insanely intense and unique experiences, guaranteed to keep you on the edge of your seat every time you play! It features randomly generated, dynamic gameplay that intuitively adapts based on your performance – so the better you play, the more extreme Big Sky Infinity becomes.\nCollect Starbits and transform your ship into an unstoppable drilling machine, so powerful it can blast through entire planets! And with 12 energetic game modes to choose from, get ready for intergalactic pandemonium like you’ve never seen before!\nPurchasing this content entitles you to both the PS3™ system and “PS Vita” system versions!\nPS3™ system software v3.60 or higher, HD 3D display with compatible 3D active glasses and highspeed HDMI cable (sold separately) required for 3D features.  Visit www.us.playstation.com/support/3D for details.\n1-4 players\n400KB minimum save size\nHDTV screen resolution: 720p, 1080i, 1080p\nDUALSHOCK®3\nNetwork Features\nStereoscopic 3D compatible\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nBig Sky Infinity™ 2012 Ripstone Ltd. Developed by Voofoo Studios Ltd and Boss Baddie. “Big Sky Infinity” is a trademark of Ripstone Ltd. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Boss Baddie","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":294,"name":"Cosmic Express","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a92/a92ed4c81786d1bf65a8f586669c35f3.jpeg","description":"Cosmic Express is a puzzle game about planning the train route for the world's most awkward space colony, from the minds behind A Good Snowman Is Hard To Build and the art of Tyu from Klondike. It's cute, harder than it looks, and guaranteed to give you hours of frustrating fun across hundreds of levels.\nAwards:\nFinalist - IMGA Global, 2017\nFinalist - IndiePlus, 2017\nOfficial Selection - Indie Megabooth, GDC 2017\nOfficial Selection - Google Play Indie Corner, PAX 2016","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Draknek & Friends","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":990374,"name":"Unplagued","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f95/f95ca6a916c2ad5ceab50dbb9e3fc5cd.jpg","description":"Con un equipo de hasta 4 jugadores, purga la plaga que infecta las aldeas medievales creadas proceduralmente.La plaga ya se ha instalado en las tierras y los aldeanos y las criaturas que residen en ellas han mutado en horrores inimaginables.Descubre y recoge ingredientes y encuentra la combinación adecuada para crear la cura mientras viajas de aldea en aldea.- Hasta 4 jugadores cooperativos en línea- Chat de voz de proximidad- Aldeas y zonas generadas proceduralmente- Monstruos terroríficamente interesantes e IA- La Plaga Del Burro","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Euphoric Brothers","platforms":[{"id":0,"name":"PC"}]},{"id":977470,"name":"Elden Ring: Shadow of the Erdtree","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ba/0bae7160eedc1f7d85a8d2db70cf1ec9.jpg","description":"The Land of Shadow.\n\nA place obscured by the Erdtree.\nWhere the goddess Marika first set foot.\n\nA land purged in an unsung battle.\nSet ablaze by Messmer’s flame.\n\nIt was to this land that Miquella departed.\nDivesting himself of his flesh, his strength, his lineage.\nOf all things Golden.\n\nAnd now Miquella awaits the return of his promised Lord.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"FromSoftware","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":973539,"name":"No Rest for the Wicked","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/209/209e902168fcde856bd22a1bda90013e.jpg","description":"From Moon Studios, the award-winning developers of Ori and the Blind Forest and Ori and the Will of the Wisps comes No Rest for the Wicked, a visceral, precision Action RPG set to reinvent the genre.\n\nThe year is 841 – King Harol is dead. As word of his death echoes throughout the kingdom, the crown passes to his arrogant, yet untested son Magnus.\n\nEven worse, the Pestilence, an unholy plague not seen for a thousand years, has returned. It sweeps across the land, corrupting everything and everyone it touches. Madrigal Seline, a ruthlessly ambitious figure in the church, sees the Pestilence as a chance to prove herself in the eyes of her god.\n\nThese forces converge on the backwater Isola Sacra, where rebel groups and the provincial government fight for control amid the isle’s crumbling ruins.\n\nYou are a Cerim – a member of a group of mystical holy warriors imbued with remarkable powers and sworn to defeat the Pestilence at any cost. But the task will prove increasingly challenging as you become entangled in the people’s plight and the vast political struggle of this downtrodden land. Chaos will pull you in every direction as you seek to cleanse the land of wickedness and shape the kingdom’s fate.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Moon Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":846505,"name":"NBA 2K23","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f5/5f5803f27d278c46f524a72956f540e7.jpg","description":"NBA 2K23 Michael Jordan Edition\nThe NBA 2K23 Michael Jordan Edition includes:\n• 100,000 Virtual Currency\n• 10,000 MyTEAM Points\n• 10 MyTEAM Tokens\n• Sapphire Devin Booker and Ruby Michael Jordan MyTEAM Cards\n• 23 MyTEAM Promo Packs (Receive 10 at launch plus an Amethyst topper pack, then 2 per week for 6 weeks)\n• Free Agent Option MyTEAM Pack\n• Diamond Jordan Shoe MyTEAM card\n• Ruby Coach Card MyTEAM Pack\n• 10 Boosts for each MyCAREER Skill Boost type\n• 10 Boosts for each Gatorade Boost type\n• 4 Cover Athlete T-Shirts for your MyPLAYER\n• MyPLAYER backpack and arm sleeve\n• Custom-design skateboard for MyPLAYER\n• One 2-Hr Double XP Coin\nNBA 2K23 Championship Edition\nDIGITAL CHAMPIONSHIP EDITION ONLY AVAILABLE FOR PRE-ORDER – ENDS SEPT 8. INCLUDES 12-MONTH NBA LEAGUE PASS SUBSCRIPTION.*\nThe NBA 2K23 Championship Edition includes:\n• 12-Month NBA League Pass subscription*\n• 100,000 Virtual Currency\n• 10,000 MyTEAM Points\n• 10 MyTEAM Tokens\n• Sapphire Devin Booker and Ruby Michael Jordan MyTEAM Cards\n• 23 MyTEAM Promo Packs (Receive 10 at launch plus an Amethyst topper pack, then 2 per week for 6 weeks)\n• Free Agent Option MyTEAM Pack\n• Diamond Jordan Shoe MyTEAM card\n• Ruby Coach Card MyTEAM Pack\n• 10 Boosts for each MyCAREER Skill Boost type\n• 10 Boosts for each Gatorade Boost type\n• 4 Cover Athlete T-Shirts for your MyPLAYER\n• MyPLAYER backpack and arm sleeve\n• Custom-design skateboard for MyPLAYER\n• One 2-Hr Double XP Coin\n• MJ Themed Go-Kart\n• 10% XP Boost on MyTEAM and MyCAREER Season Progression\nAbout the GamePre-order NBA 2K23 to receive the following digital items:\n• 5,000 Virtual Currency\n• 5,000 MyTEAM Points\n• 10 MyTEAM Promo Packs (delivered one a week)\n• A Boost for each MyCAREER Skill type\n• A Boost for each Gatorade Boost type\n• Devin Booker MyPLAYER Jersey\n• 95 Rated Devin Booker MyTEAM Free Agent Card\nRise to the occasion and realize your full potential in NBA 2K23. Prove yourself against the best players in the world and showcase your talent in MyCAREER. Pair today’s All-Stars with timeless legends in MyTEAM. Build a dynasty of your own in MyGM or take the NBA in a new direction with MyLEAGUE. Take on NBA or WNBA teams in PLAY NOW and experience true-to-life gameplay. How will you Answer the Call?\nTAKE MORE CONTROL\nFeel refined gameplay in the palm of your hands on both sides of the ball in NBA 2K23. Attack the basket with a new arsenal of offensive skill-based moves, while you unleash your potential as a lockdown defender with new 1-on-1 mechanics to stifle opposing players at every turn.\nAN EPIC VOYAGE AWAITS\nEmbark on a swashbuckling basketball journey aboard a spacious cruiseliner equipped with pristine courts, scenic views, and a boatload of rewards for you and your MyPLAYER to enjoy. Plus, there’s even more to explore during shore excursions.\nJORDAN CHALLENGE RETURNS\nStep back in time with era-specific visuals that captured Michael Jordan’s ascent from collegiate sensation to global icon with immersive Jordan Challenges chronicling his career-defining dominance. Lace up his shoes to recreate his otherworldly stat lines and iconic last shots, while listening to first-hand accounts from those who witnessed his maturation from budding star to basketball legend.\nBUILD YOUR SQUAD\nBall without limits as you collect and assemble a bevy of legendary talent from any era in MyTEAM. Dominate the hardwood each Season, and bring your vision to life with a broad set of customization tools to create the perfect look for your perfect starting five.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Visual Concepts","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":805004,"name":"CounterSide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3d/b3df40065f51627e1f7fdc70135317c7_DHhrVjl.jpg","description":"■ Urban Fantasy Collective RPG Counterside ■The Game For Anime Fans!\nWhile the Administration Failure led to Corrupted Objects threatening the very existence of humanity, a chosen few, known as the Counters, fight against these Corrupted Objects to drive them back to the void.\nNow, the ceased clock ticks once more.■ Legendary animated illustration qualitySave the world by commanding attractive characters with mind-blowing animated illustrations.■ Thrilling line battle systemFrom gorgeous girls to astonishing mechanical units to select!\nStrategize with realistic characters in the real-time PVP arena for victory!■ Countless rich scenarios on a whole new level (500,000+ words)Enjoy the vast emotional stories encompassing SF, Noir, and Post-Apocalypse genres.\nFeel the animation-like stories characters are going through in a world that repeats destruction.■ Refined bgm and charming voiceSavor the world of CounterSide through high-quality BGM and immersive voices.■ Vast content and convenient play functionsExperience various contents conveniently with skip and auto-play functions in Story Mode, Arena, Raid, Dive, and more!■ Note CounterSide Global does not support regions where CounterSide is already being serviced by other publishers, including KR, JP, CN, TW, and SEA.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Studio B Side Co.ltd.,","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":759679,"name":"Turbo Golf Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/521/521c48a32b7242e13500d582c6ddb5ef.jpg","description":"Turbo Golf Racing is a fast, arcade-style sports game. Drive Turbo powered cars to chip, putt and smash your giant ball in a thrilling dash to beat your friends to the finish flag.\n\n\nRACE YOUR RIVALS TO THE FINISH\nWelcome to the future of motorsports. Feel the excitement of fast-paced arcade-style racing as you tee off with your friends in a new exhilarating way. Jump, flip, glide boost and dash with supercharged cars and be the first to get your ball in the hole.\n8 PLAYERS ONLINE\nRace with up to eight friends in a Grand-Prix style competition. Hit the boost pads to charge past your rivals, take secret tunnels to outwit them or fire missiles to stop them in their tracks.\n\n\nPOWER CORES\nGet the edge over your rivals by unlocking and equipping Super Cores. Hit your ball further, fly faster or use unique abilities such as ground stomp, gravitate ball and roll. With a wide variety of Power Cores, find your meta to outwit your friends.\nTURBO CHARGE YOUR CUSTOMISATION\nChoose the car and ball that makes you stand out from the crowd. Enjoy endless paint options, change your wheels, spoiler, shield car body and boosters.\n\n\nTAKE TO THE SKIES\nThe sky is the limit when your cars have wings. Launch your Turbo powered car into the air and fly past the competition. Fly through tunnels, glide over fans and chase your ball through the terrain and over obstacles.\nTACKLE THE TERRAIN\nUse the terrain to your advantage, fly over the boost pads, and down the fairway. Avoid the rough and the sand traps. Bend your shots around trees and through canyons. Race to the green.\n\n\nEVER-GROWING CONTENT\nUnlock cosmetics as you level-up and enjoy an ever-growing game with free regular updates that will bring new courses, new power cores and new cosmetics items to play with.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Hugecalf Studios","platforms":[{"id":0,"name":"PC"}]},{"id":724095,"name":"Peglin","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ab5/ab58f8d099d65779e353fa8889fff4e4.jpg","description":"The dragons have been popping peglins and stealing all of your gold for as long as you can remember. Enough is enough. It's time to venture through the woods, conquer the fortress, and delve into the heart of the dragon's lair to take back what's yours and teach those dragons a lesson.\nPeglin plays like a combination of Peggle and Slay the Spire. The enemies are tough, and if you're defeated your run is over, but you've got powerful orbs with special effects and incredible relics that influence both your enemies and the physics you'll use to defeat them.Features:\nCollect and upgrade powerful orbs and relics to defeat the monsters and bosses that stand in your way.\nFight enemies with Pachinko-like gameplay - hit more pegs to do more damage. Use crit potions, refresh potions, and bombs wisely.\nExplore a new forest every time, with different orbs, enemies, and surprises along the way.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Red Nexus Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Web"}]},{"id":708981,"name":"Space Warlord Organ Trading Simulator","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af1/af123c33ea2a76602d5b9b1741adaa48.jpg","description":"Buy, sell, and trade organs in a strange and evolving universe. Dive into the quivering innards of alien capitalism in the sci-fi body horror market tycoon game you didn't know you needed.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Strange Scaffold","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]}]