[{"id":650608,"name":"Nobody Saves the World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b44/b448c0725eb490dda9cfb23b826da68a.jpg","description":"Transform from a featureless nobody into a SLUG, a GHOST, a DRAGON, and MORE in this new take on Action RPGs from the creators of Guacamelee!\n\n\n\nComplete quests to discover and swap between 15+ varied and distinct Forms. Mix and match abilities in unexpected ways to unlock and complete even MORE challenging quests. Explore a vast overworld - on your own or with a friend online - while clearing shape-shifting dungeons in an effort to stop The Calamity and SAVE THE WORLD!\n\n\nKEY FEATURES\nTransform into MANY FORMS: Unlock 15+ distinct Forms, from Rat to Rogue to Robot, each with its own unique gameplay mechanics.\nMix & Match ABILITIES: Combine over 80 Form abilities to create powerful customized builds. Play as an Egg that can leave a trail of slime and shoot fireballs!!! We can't stop you!\nUnconventional QUESTS: Help the strange inhabitants of this world deal with their troubles. Each Form also has its own set of quests, which you can complete in creative ways.\nEvolving Dungeons: As you become stronger, procedurally generated dungeons increase in difficulty and complexity to keep you on your toes.\nOnline Co-op: Invite a friend to play through all, or part, of your adventure together!\nAwesome Soundtrack: New original music by acclaimed composer Jim Guthrie.\nMore to come! Stay tuned…","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"DrinkBox Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":635220,"name":"Nickelodeon All-Star Brawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a53/a53575214f12dadb9f6d7dca9b24cda4.jpg","description":"Nickelodeon All-Star Brawl, is a new platform fighting game featuring fan-favorite Nickelodeon characters. Its roster includes familiar faces from SpongeBob SquarePants, Rugrats, the Teenage Mutant Ninja Turtles, Danny Phantom, Hey Arnold!, Invader Zim, The Loud House, Aaahh!!! Real Monsters, and more.\n\nNickelodeon's new fighting game will feature 20 themed levels, such as Jellyfish Fields from SpongeBob SquarePants and TMNT's Technodrome. It'll also release with both singleplayer and multiplayer game modes, allowing you to put your skills to the test in competitive matches online, and local multiplayer for up to four players.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ludosity","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":51047,"name":"Faerie Solitaire Remastered","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/702/7027dd12aaa05c4d3b574a32d6852353.jpg","description":"Faerie Solitaire Remastered is an indie card game developed by Subsoap. The game mixes solitaire with fantasy and role-playing game elements.\n\n###Plot\nThe magic land of Avalon seems empty. You have to find a Faerie, raise it and repopulate the once prosperous land.\n\n###Gameplay\nThe game features eight different worlds with five levels in each of them. The players have 400 hands to look through. It is possible to purchase upgrades which unlock such abilities as Undo or Clue. A combo system is present in the game. Build up your combo meter by quickly going through your hand and earn much more gold for buying unique powerups and upgrades. The use of powerups requires energy which is generated while playing the game. The players have to be careful with the amount of energy they have at their disposal as it may be impossible to use any powerups at all until the level ends. \n\nThe game features a pet mechanic. The players have to find, hatch, and evolve every creature they find after passing a level. 32 pets are featured in the game and appear after the levels randomly. The gold the player earns can also be used to buy items for their pets. \n\n###Remastered edition features\nIn the remastered version of Faerie Solitaire, all of 40 unique and hand drawn locations got reworked from the ground up. New Steam achievements were also added.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Subsoap","platforms":[{"id":0,"name":"PC"}]},{"id":12120,"name":"Savage Lands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0bb/0bbb4b354fa779acc1f08ad1cf693956.jpg","description":"Savage Lands is a fantasy survival game with heavy emphasis on cooperative multiplayer. \n\n###Gameplay \nThe players spawn in a vast fantasy open world. The game does not give you any main goals or tasks that are necessary to “beat” the game. Instead, you can explore the world at your own pace. One of the main game mechanics is crafting. You can create different tools, items or build structures using recourses that you can find throughout the game world. Players can come across ruined villages. The building in them can be repaired and used as a temporary base. \nThe environments are filled with hostile animals and mythical creatures such as boars, wolves, skeletons. Killing enemies is off the primary way to gather certain materials such as animal skin that you can get from slain deer or boars. The most notable monster in the game is a giant dragon that inhabits a tower in the center of the map. Killing it requires cooperation and the best armor and weapons you can find or create. Aside from wild animals and monsters, the other great menace to the player is cold temperature. Staying cold for a long time makes you lose hope. To get warm, you can use torches, campfires or warm clothes. Any players in the game world can use the campfires, so they often become gathering spots for players. Alternatively, you can craft warm clothes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Signal Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3485,"name":"Secret Ponchos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c16/c167162530a93902a232389086164fca.jpg","description":"Secret Ponchos is a Wild West-themed twin-stick multiplayer shooter. \n\n### Art-style and setting  \nSecret Ponchos universe takes inspiration from spaghetti westerns.\nIts levels are set in classic western environments such as saloons, railroads, small towns, and mines. The game’s art-style is cartoonish; the character models are very expressive and grotesque. \n\n### Gameplay  \nThe players participate in online matches with up to three players in each team. There are eight different characters (named “outlaws”) in the game, each one with its unique abilities, weapons, and stats. Every outlaw has two different weapons with several fire modes such as the rifle that can both fire spread shots and snipes enemies from the long distance, sawed-off shotgun that can stun enemies, the sword with charged attacks and many more. Each character has five characteristics that can be adjusted in the “Outlaw Perks” menu: damage, speed, stamina, fire rate, and health. \nThe game has a rank system tallied as a bounty. Winning ranked matches increases your bounty and lets you progress through 10 ranks, from Petty to Death Bringer. \n\n### Game modes  \nEven though there is a single-player arcade mode, Secret Ponchos is mostly a multiplayer game. \nThere are four multiplayer game modes: Domination in which team with five kill advantage wins, Deathmatch with no respawn, Free-for-all, and Posse leader where you have to protect your team’s leader and kill the opposite team’s leader.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Switch Blade Monkeys","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":15949,"name":"Car Mechanic Simulator 2014","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f8/1f88df2a4ac96e2ff626b6bedce43704.jpg","description":"Car Mechanic Simulator 2014 is a simulation game developed by Red Dot Games. It is the first installment in the Car Mechanic Simulator series.\n\n###Gameplay\nThe game is played from a first-person perspective. The players walk around freely in their shop. There are no levels present in the game. Instead, the player takes jobs from the customers. Each customer has a unique vehicle and a unique car problem which the players have to find and fix. \n\nWhen the client arrives with their car, the player takes the car apart, troubleshoots the issue, and replaces the required vehicle parts. Upon reassembly, the car can be taken for a test drive before handing it over to the client.\n\nIt is also possible to play in endless mode, where there is no limit whatsoever to the number of jobs the player takes.\n\n###Expansion packs\nTwo expansion packs for the game were released.\n\nThe 4x4 Expansion Pack adds 20 new jobs for the repair of 4x4 off-roading vehicles. It presents new challenges to the players, as off-road cars are much different from the regular ones present in the game. It is a separate body frame that is bolted on to the live axles. The pack was offered free of charge for the players that bought the game on steam.\n\nThe 1/4 Mile Expansion Pack just added a single new test track, where the players could check the performance of their tuned out cars. It is basically a drag strip.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"PlayWay","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":19372,"name":"Silent Hill Homecoming","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d85/d8542d232461bc856277378b32345bc8.jpg","description":"In Silent Hill Homecoming, Alex Shepherd has returned to his hometown of Shepherd's Glen to investigate the sudden disappearance of his brother. From Shepherd's Glen to the foggy streets of Silent Hill, Alex will face the darkest of horrors while struggling with his own grip on reality. Alex must unravel the mystery behind his nightmares, discover the truth behind his brother's disappearance, and confront the evil that has taken hold of his soul.\nEnter the next chapter of Silent Hill as you delve deeper in the tormented history of the town and learn of the evil that surrounds Toluca Lake\nFrom the murky fog to the ominous shadows, all-new next-gen graphics bring Silent Hill to life like never before\nSolve treacherous and deadly puzzles to discover the mysterious secrets behind the evil that has cursed the town of Silent Hill\nSilent Hill Homecoming features an all-new soundtrack by acclaimed series composer Akira Yamaoka","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":16295,"name":"DreadOut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/600/60011ddc7be614bb58db876a8e92dc4c.jpg","description":"When twilight fades. Where darkness reigns.\nDreadOut is a third person supernatural horror game where you play as Linda, a high school student trapped in an old abandoned town. Equipped with her trusty smart-phone and an SLR camera, she will battle against terrifying encounters and solve mysterious puzzles which will ultimately determine her fate.\nHelp her overcome the challenges that will stand before her. Survive the Dread!\nWhen a group of high school students went astray from a field trip, they came across something totally unexpected. A town long forgotten trapped in a peaceful state of slumber. What they did not realize was what lurks within. And what seemed like an innocent stroll turns into disaster as the secluded town reveals its dark and terrible secrets. The presence of sinister forces from beyond their realm of existence.\nIt all comes down to Linda. She will experience stirrings of unfamiliar powers, emerging from within her. These new found abilities might just be the only way she can save her own life and those of her friends.\nExplore a haunted environment in an Asian - Indonesian setting.\nBattle against terrifying beings from a supernatural realm.\nSolve mysterious puzzles that block your path.\nSwitch between first person and third person view.\nEngage in a thrilling storyline.\nPlay Act 1 and 2 of Linda's terrifying journey along with Act 0 (previously released as DreadOut Demo).\nGet access to Linda's unlockable wardrobe\nRated 17+ for the following :\nFrequent / Intense horror / fear themes\nInfrequent / Mild Realistic Violence\nInfrequent / Mild Sexual Content or Nudity\nInfrequent Mature / Mild Suggestive Themes","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Happiness","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16096,"name":"R.A.W. Realms of Ancient War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e1/6e18dbf24c543054865fcb6c45b32684.jpg","description":"###The story\nThe continent inhabited by people, elves and gnomes lived in peace. Four kingdoms located on four sides of the world could always find a common language. Now in these lands chaos reigns. For twenty years, the war devoured the lives of everyone it could reach until the King of the North invited the leaders of other kingdoms to come together and end the meaningless deaths. The Temple of Heroes was chosen as a place to negotiate a truce was established. But something happened and all the kings, never returned home with signs of disease and the King of the North just disappeared. \n\n###The gameplay and the plot\nWe have the opportunity to manage the characters of three classes in the genre hack-and-slash RPG. Each of the classes has its own game mechanics. Depending on which of the heroes player chooses - mage, warrior or hunter, the starting location is different. The linear plot and linear hero upgrading might seem confusing at first but the locations themselves and the story, allow you to feel the scale of the game world. Another positive aspect is the possibility of cooperative play, and you can not only play on the network, but also on one computer with a split screen.\n\nThe developer of the game is the French company Wizarbox, which, in addition to creating its own fantasy worlds, was engaged in porting other games on the console Xbox and PlayStation.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Desconocido","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":10252,"name":"Project Highrise","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca7/ca7b282870202c389f037ecf1ace1b86.jpg","description":"OUT NOW!\nJust Updated - 13th Apr\nif you’re not ready to “double down” on the Las Vegas expansion, quite a bit of new content has been added to the base game in version 1.5. Here are some highlights:\nMover’s office – Move things around your tower once you’ve built a mover’s office to coordinate and manage the process.\nNew tenants – New retail and restaurant tenants are now available.\nNew contracts – Take on new contracts from the city to earn extra resources to help build even more prestigious towers!\nFor more details please go here;\nNotable Past Updates\nWe've had big updates before, but have we had 'tall' updates ;)\nOur tallest update yet! 1.4.0 brings in a tall order of lobby options for your highrise.\nMultiple two story lobbies\nMultiple three story lobbies\nLobby art, to make those ceilings look bling bling\nNew Scenario\nMore wallpaper decorations\nIncreased expectancy of community support and love\n(T&Cs apply, this is not a real feature)\nFor more details please go here;\nOur biggest update to date! 1.3.0\nNew Additions including;\nRooftop Restaurants and Penthouse Apartments.\nWinter Holiday Decorations.\nUnlimited Mode.\nNew scenario\nand more!\nFor more details please go here;\n9 NOVEMBER\nWas... Our biggest update to date! 1.2.0\nNew Additions including skybridges and cantilevered floors, plus Improvements and more!\nFor more details please go here;\n19 OCTOBER\nThe Spooky Update 1.1.1 is here!\nHappy fall, everyone! Check out the new decorations we've added :) plus more!\nFor more details please go here;\n12 OCTOBER\nUpdate 1.1.0 is here!\nNew items for your building, completely FREE!\nFor more details please go here;\nÀ propos du jeu\nVotre rôle d’architecte et de promoteur consiste à construire des gratte-ciel de renommée mondiale, des chefs-d'œuvre d’art et d’ingénierie qui feront l’envie de toute la ville. Mais un gratte-ciel est plus qu’une simple construction de verre et d’acier, c’est un écosystème complexe de personnes qui y vivent et y travaillent. C'est une machine complexe qui a besoin de votre aide pour fonctionner harmonieusement et efficacement.\nDès l’instant où le projet sera lancé, toutes les décisions vous appartiennent. En tant qu’architecte, vous devez coordonner la construction de tous les éléments, des murs aux câbles, en passant par les bureaux et les appartements. En tant que propriétaire de l’immeuble, vous devez garder vos locataires heureux et vous assurer qu'ils paient leur loyer à temps. En tant que promoteur averti, vous devez avoir l'œil sur les profits et investir dans l'avenir. Réussissez et vous récolterez les récompenses d’une adresse prestigieuse où tout le monde souhaitera vivre et travailler. En cas d’échec, vos locataires dégoûtés quitteront les lieux en prenant leurs commerces avec eux, laissant votre réputation en lambeaux.\nAllez-vous créer un complexe de bureaux qui attirera les chefs d’entreprises des quatre coins du monde ? Construirez-vous des appartements de luxe dans le ciel, des penthouses pour l’élite et des aires de jeux pour les célébrités ? La cupidité l’emportera-t-elle, vous poussant à construire un immeuble qui échangera le bonheur de vos locataires contre de jolies sommes d‘argent ? Tous ces choix et bien d'autres sont à votre disposition. Le succès est entièrement entre vos mains.\nUne simulation détaillée et complexe de gratte-ciel moderne\nUne grande variété de locataires aux caractéristiques uniques, de restaurants aux bureaux, en passant par les magasins de détail et autres appartements résidentiels.\nUn jeu ouvert de type bac à sable avec plusieurs niveaux de difficulté et conditions de départ qui vous permettent de construire le gratte-ciel de rêve qui surplombe la ville\nUn mode campagne qui teste vos compétences de construction de gratte-ciel dans des scénarios difficiles\nMettez vos talents de gestion à l’épreuve en étant à l’écoute de la population de vos bâtiments et leurs demandes toujours plus exigeantes\nCommandez les services de consultants spécialisés afin d’augmenter l’attrait de votre bâtiment, son efficacité opérationnelle et son influence sur les responsables municipaux","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":6400,"name":"The Witcher Adventure Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22c/22ce391b3096cd46eadae1a890624f39.jpg","description":"Update 1.2.5Update 1.2.5 (28.06.2016) is live!\nMiddleware updates\nPerformance fixes\nVarious gameplay fixes\nMinor fixes\nFriends invites\nAbout the GameThe Witcher Adventure Game allows players to take the role of four distinct characters known from the books and video games: Geralt of Rivia, monster slayer; Triss Merigold, cunning sorceress; Yarpen Zigrin, dwarven warrior; and Dandelion, roguish bard. Each character has unique skills and multiple ways of overcoming obstacles - the choice is yours: ddo you fight your way to victory, call on your charm or try your hand at diplomacy?\nExplore a land of mystery and spin your own, unique tale each time you play. The Witcher Adventure Game is based on the rich universe created by internationally renowned novelist Andrzej Sapkowski. Whether you’re a long time fan or this is your first contact with the universe, The Witcher Adventure Game will pull you in with its deep backstory and high replayability.\nMain features:\n- Art design taken straight from the critically acclaimed Witcher series of video games\n- Play vs. AI and vs. your friends (online multiplayer and hot seat)\n- Clear, simple rules, and intuitive mechanics.\n- 4 unique heroes with different skills and approaches to problem solving\n- Achievement and leaderboard support\n- Digital edition contains over 288 cards and 30 monsters","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":28040,"name":"The Swords of Ditto","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5e9/5e98fdaa7d45048a65d78ef402361fab.jpg","description":"The Swords of Ditto is a compact action RPG that creates a unique adventure for each new hero of legend in the relentless fight against the evil Mormo. Explore a delightful but dangerous overworld, brave menacing dungeons, and improve your hero in a charming village, during your quest to overcome the evil that plagues the island. Unleash the mystical Sword of Ditto and grab a co-op friend for an unforgettable adventure filled with delightful characters, extraordinary loot, and heroic battles!\nUnique Adventures Linked Together: Each adventure becomes its own legend, both distinct from those that came before it and part of a heroic legacy that bind together. The deeds, successes, and failures of each hero's adventure have implications for those that follow including the ability to find weapons and recover loot from history’s fallen heroes.\nSolo & Cooperative Adventuring: Battle Mormo and her evil armies alone or summon a brave friend to take up arms alongside you in local co-op mode. Fear not, even less experienced adventurers will find help from their fellow heroes through the magic of a good old-fashioned revival hug!\nWeapons, Items, & Stickers: Wield the traditional sword and bow combo alongside the decidedly less traditional vinyl record Frisbee, magic golf club, and colossal foot from the heavens to put Mormo and her legions back on their heels. Collect and equip stickers to boost up your hero and add perks to their gear to become powerful enough to banish the wicked sorceress.\nMain Quests and Secret Side Missions: Approach your legend however you see fit by battling through dungeons in any order, completing side missions through dark caverns and deep wells, or confront Mormo right from the start for the ultimate challenge.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Devolver Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":614962,"name":"Tiny Tina's Wonderlands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/13b/13b029c381614a8e557f442cff488bb3.jpg","description":"Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina.\n\nRoll your own multiclass hero and loot, shoot, slash, and cast your way through outlandish monsters and loot-filled dungeons on a quest to stop the tyrannical Dragon Lord. Everyone's welcome, so join the party, throw on your adventuring boots, and be Chaotic Great!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":61051,"name":"Artifact","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/96f/96f0c07b6c156f05cb76b2ffba32bffc.jpg","description":"Artifact is a digital card game coming from the makers of Dota®2 and Steam®. A collaboration between legendary card game designer Richard Garﬁeld and game and technology maker Valve (Dota 2, Steam), Artifact offers the deepest gameplay and the highest-fidelity experience ever seen in a trading card game. It features more than 280 cards in the shipping set, including 44 heroes. Targeted for release on Steam in late 2018, players will be able to buy and sell cards on the Steam Community Marketplace. Artifact will also be supported as a service through expansions, competitive events, and new features.\nAvailable for Windows, Mac, and Linux","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":22055,"name":"Bendy and the Ink Machine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/644/64470b0ae9a1c5facd28ec204c437555.jpg","description":"\"Bendy and the Ink Machine™\" is a first person puzzle action horror game that begins in the far days past of animation and ends in a very dark future.\r\n\r\nPlay as Henry as he revisits the demons of his past by exploring the abandoned animator's workshop of Joey Drew Studios. With twists and turns around every corner, \"Bendy and the Ink Machine\" is sure to thrill you... and decimate your childhood.\r\n\r\nYou'll never look at cartoons the same way again.\r\n\r\nThis first chapter sets the tone for the adventure ahead.\r\nSolve the riddle. Escape the workshop.\r\n\r\nAbove all, fear the machine and survive.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Rooster Teeth Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"}]},{"id":308157,"name":"KARDS","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7f/d7fd65f0e2bc3782c8256ae26b354bc1.jpg","description":"KARDS is an exciting free to play collectible card game set in WWII, full of strategy, tactics, action and fun! Play as any of the major powers of WWII and participate in epic battles against other players, or against the cunning AI. Collect cards and build up your armies of iconic tanks, aircraft, infantry, artillery and more from all theaters and periods of the war. Give orders, use naval support, espionage, sabotage or focus on the most advanced technology. Use Blitzkrieg tactics, strategic bombing or dig in for bitter defensive warfare until you outproduce and outgun your enemies. Kards is easy to learn, but hard to master. Battles are won by cunning, tactics, experience and strategy. Do you have what it takes?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"1939 Games","platforms":[{"id":0,"name":"PC"}]},{"id":21670,"name":"Terra Incognita ~ Chapter One: The Descendant","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0d/f0dbd2f50b08b16e0cf2c1d6e64a85e4.jpg","description":"This game embodies the classic canon role playing game.\n\n###Plot\nThe world of Terra is plunging into chaos, great shocks await it. In this situation, it is time to turn the weapon against the main weak point of Terra - its corrupt royal family.\n\nThe hero of the game must cross the whole world in order to unite the peoples of Terra and gather into his team the best warriors and other necessary people.\n\n###The Hero and the beginning\nThe game begins with a short video about Terra and the hostile forces that attacked this country.\n\nWhen the video ends, a mysterious man with a sword falls from the sky - this is your character that you will control in the game. A man falls next to a young hunter and fisherman named Leon, who was just fishing near his lonely dwelling among the hills.\n\nLeon, as one of the allies you found, is also the first achievement in this game. Leon had just caught a fish for dinner when he noticed a man falling from the sky. The man calls his name - Alexis. Leon and Alexis exchange a few words, Leon invites Alexis into the house.\n\nIn the house of Leon Alexis first meets several creatures with whom he has to fight. Leon himself surprised at the presence of these creatures in his house. Another thing that surprises Leon is that Alexis finds a strange crystal near Leon's house. And through this crystal with Alexis, a mysterious voice speaks.\n\nIn the future, you will travel around Terra, fighting with monsters and meeting more and more different characters that make up the team - these are the achievements for which the game is played.\n\n###State of the game and additions to it\nGame development is not yet complete, but the game itself is already available to the public. As you work on the game, its creators complement the available version.\n\nDuring the work on the game, its creators have already released patches for it. These patches, in particular, brought into play the possibility of several new achievements. It should be remembered that it may be necessary, after adding a patch, to start a new game in order to gain access to these new achievements.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Back To Basics Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":23598,"name":"League of Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/78b/78bc81e247fc7e77af700cbd632a9297.jpg","description":"League of Legends is a fast-paced, competitive online game that blends the speed and intensity of an RTS with RPG elements. Two teams of powerful champions, each with a unique design and playstyle, battle head-to-head across multiple battlefields and game modes. With an ever-expanding roster of champions, frequent updates and a thriving tournament scene, League of Legends offers endless replayability for players of every skill level.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Riot Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15056,"name":"Police Stories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e1/9e11b9a8958de594c9e294fd0e569c7e.jpg","description":"The game is in the development. Visuals and mechanics will be improved.\nPolice Stories is a novelty top-down shooter, where advanced AI of enemies, tactical elements and random occurrences create thousands of unique situations in each level. Never before the pixel game was this realistic and fun.\nYou’re on the side of the lawYou can’t go in guns blazing. Surprise the perps and make them surrender. Keep a close eye on those who yield and don’t forget to cuff them or you may get your back full of holes. Beat the information out of those bastards but don’t overdo that - you need them alive.\nRick Bronx, your trusted partnerKeep your fellow operative close at all times and point him in right directions - this will improve your chance of success and you will less likely be killed. Rick has wide array of special equipment: peek through doors, blast them, blind your enemies and much more.\nEach time is a new timeBe careful - you will never know where the enemy will be and how he will react. It will make each playthrough of levels unique and will provide new challenges.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Morgan Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":3550,"name":"Peggle 2","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/946/94683098e0befd482e5c890bd03cda26.jpg","description":"Peggle 2 is a magical game full of bouncing balls, magical pegs and bricks made of pure compressed joy! Test your luck and skill by clearing pegs, bashing bricks and timing your shots just right to achieve EXTREME FEVER! Discover 5 magical Peggle Masters and use their preposterous powers over 120 levels and trials to shatter expectations and acquire high scores beyond the realm of plausibility ! And then, once you've honed your talents, deploy them against others in 4-player Peg party mode, or against a single opponent in Duel mode.\nVideo output in Full HD 1080p requires 1080p native display.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-2 players\nNetwork Players 2-4\n19MB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n©2014 Electronic Arts Inc.\nPeggle, PopCap, EA and the EA logo are trademarks of Electronic Arts Inc.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":2317,"name":"PAC-MAN 256","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccc/ccccadfc4ff9be3487dc128aa2d99f29.jpeg","description":"PAC-MAN 256 is the maze that never ends. But the Glitch is coming for you…\n- Challenge your friends with local co-op multiplayer mode, up to 4 players\n- Waka waka on PAC-DOTS and stay ahead of the super-villain: The Glitch\n- Take on a new gang of revived retro-ghosts including Sue, Funky, and Spunky\n- Outsmart them with over 20 ridiculous power ups: Laser, Tornado, Giant and much more\n- Spice up your game with 10 different themes\nCherries are red\nGhosts are blue\nMunch a power pellet\nGet Lasers too!\nsupport-pacman256@bandainamcoent.eu","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":60542,"name":"SoulWorker - Anime Action MMO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/789/78906f8b6efecbe9753dc7d5264b2459.jpg","description":"Just Updated\nNew SoulWorker Iris Yuma – Her Rage Knows No Boundaries\nA storm of bitterness and anger about the deaths of her family to the Great Void rages within Iris. Her weapon, Hammer Stol, releases these emotions in combat. With masterful precision and merciless destructive power, Iris executes her enemies. Mercy is a foreign concept to her and her Laser Cannon.\nLog into the game now and head out to battle with Iris!\nAbout the GameSoulWorker – rapid combos set in an all-out anime action MMO!\nSoulWorker has the moves to impress with rapid combat, real anime feeling and 6 unique characters. Play solo or as part of a 4-man cooperative group – both styles are well served in PvE. The quick yet intense dungeons are teeming with demons, demanding perfect timing and well-placed skill combinations.\nExperience this post-apocalyptic anime world with impressive cel-shaded graphics and get to grips with the depths of the souls of each unique character.\nSix Classes and Back Stories\nA SoulWorker’s weapon is the window to their soul. The brave Haru Estia heads into battle wielding her mighty Soulum sword, while Lilly Bloommerchen’s expression of her madness takes the form of a destructive Mist Scythe. Scarred by her sorrowful past, young Stella Unibell defends herself from all attacks with the Howling Guitar. Former superstar engineer, Erwin Arclight blasts back enemies making use of his Gun Jazz. Honorable Jin fights with both fists for justice – yet the shadows of his past constantly weigh on his shoulders.\nSoulWorker’s Key Features:\nAction-laden cooperative gameplay for up to 4 players\n‘Playable anime’ thanks to impressive cel-shaded animations\nUnique battle style with personalised combos\nLarge PvE content with over 100 dungeons\nPvP zone for mass battles on an open battlefield\nDark post-apocalyptic setting with a captivating story","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lion Games Co","platforms":[{"id":0,"name":"PC"}]},{"id":28473,"name":"Medal of Honor: Airborne","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d4/0d4508d6383dd6c63256b41f0aa35e6b.jpg","description":"Step into the boots of Boyd Travers, Private First Class of the “All-American” 82nd Airborne Division, and revolutionize the way the war is fought. From a rocky beginning in Sicily to war winning triumphs in the heart of Germany, fight the epic WWII battles that turned America’s first paratroopers into combat legends. Begin each mission from the air and behind enemy lines, then jump immediately into the action. On the ground, tackle objectives in any order across an expansive, free-roaming environment, using a wide variety of upgradeable weapons to your strategic advantage.\nOpen battlefields\nVertical combat\nAffordance AI\nUpgradeable weapons\n**For instructions on how to switch language in-game after initial launch, see the README file available in game Support file.**","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":1460,"name":"Desktop Dungeons","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f7/2f714a99a31188af3df4de311e515ab3.jpeg","description":"FREE GAME UPDATE! Desktop Dungeons: Enhanced Edition. More ways to die horribly in 10 minutes or less. The award winning quick-play puzzle roguelike is now packed with new content, new classes and a new way to play: Compete against your friends in the seeded Daily Dungeon!\nThe perfect coffee-break game for genius tacticians and chilled clickers alike:\nFight your way through fantasy dungeons in 10 minutes or less. We’re busy people too.\nPrize-winning game design awesomeness (13th Annual IGF Awards)\nClassic roguelike play re-imagined as a unique single-screen puzzle game sort of thing! Reviewers have a hard time with genres.\nExplore unrevealed terrain to regain health and mana. Game hook!\n6 hours of gameplay? Try 6 billion... You can (and will) play Desktop Dungeons for the rest of your life.\nRandomly generated dungeons are different every time you play. Build your Kingdom to unlock hordes of new classes, races and challenges.\nDaily Dungeon allows you to compete against your Steam friends!\nAmazing soundtrack by the improbably astounding team of Danny Baranowsky and Grant Kirkhope.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Finji","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":42233,"name":"Dead Rising 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d0d/d0dc606686338de79d9cbb418adb74bf.jpg","description":"Dead Rising 3 is an action game with survival elements. It’s the third installment in the series, followed by Dead Rising 4. Like the previous titles, Dead Rising 4 follows the story of an or an ordinary guy who needs to survive a zombie outbreak.\r\n\r\nThis time the story is set in California; you take control of Nick Ramos, a mechanic who tries to escape from the infected city. By a lucky accident, he has the immunity to the virus. Together with other survivors you need to search for supplies, craft weapons and find your place among different forces. The game features several endings depending on your actions and moral choices.\r\n\r\nDead Rising 3 has a bigger open world than in previous games and introduced more crafting options, such as crafting combo vehicles. Besides shooting and melee combat, the gameplay allows to complete missions stealthily and distract zombies. Dead Rising 3 also supports a co-op mode for two players.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom Vancouver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":779,"name":"ROBLOX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3af/3af386b6e26be6741b711ae6215ef42f.jpg","description":"Powering Imagination™\nAll the games on ROBLOX are created by gamers like you! Play solo or with friends in a variety of indie games exclusive to ROBLOX. Find Strategy, Platformer, Role Playing, Tycoon, Shooter, Survival games and more! ROBLOX is free to play, although you can buy ROBUX, our virtual currency, to upgrade the look of your ROBLOX avatar or to get optional in-game power-ups.\nCreate your own games for FREE at ROBLOX.com/develop\nXbox Live Gold and an internet connection of 192 Kbps or higher required to play on Xbox One. THE ROBLOX GAME RATING APPLIES ONLY TO THE ROBLOX APP, NOT TO ANY USER GENERATED CONTENT INCLUDED WITHIN THE APP, WHICH IS UNRATED.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"ROBLOX","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":7091,"name":"Sanitarium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d42/d421e190c614680af3782d2cf016cf9e.jpeg","description":"In Sanitarium you play an amnesiac thrust into a morbid, really creepy universe. After a car accident you wake up to find that instead of lying in a hospital, you’re in an asylum with your head wrapped in bandages. Who the hell am I? What am I doing here? How do I escape? There endless questions eating away at you, and so too are the many puzzles you’ll need to resolve throughout this immersive, captivating adventure.\nFeaturing a rich, complex plot set in an intense world where a very thin line separates reason from madness, Sanitarium is a masterwork suitable for point-and-click beginners, experts and everyone who enjoys captivating storylines and horror games. Sanitarium was recently voted one of the scariest games of all time.\nOriginally released in 1998 for PC and Adventure Game of the Year Winner, this timeless point-and-click horror game is a must-have for adventure game fans.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":259932,"name":"Omno","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9db/9db640b04cc4ab7d34acbd2000ff72bd.jpg","description":"Omno is a single player adventure that will take you through lush forests, across a sun blasted desert, over a frigid tundra, and where the power of a lost civilisation will even carry you to the clouds. On the way you will meet strange creatures, encounter many surprises and maybe make a friend.\r\nBesides offering an interactive world, Omno challenges you with puzzles, hidden secrets and obstacles to overcome in 3D puzzle platformer style.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Jonas Manke","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":16186,"name":"Star Saviors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b12/b1207176b8be9421f34fbc8910fba56d.jpg","description":"Star Saviors is an arcade game created by Sharpened Edge Studios.\n\n###Plot\nThe setting depicts a post-apocalyptic scenario after the aliens’ expansion. The game protagonist is the only human being to survive, though he is designed not as a human character but through the technological extensions.\n\n###Gameplay\nThe first-person optics in the game is possible only through different weapons of action. The most utilized war machine is a vessel as the primary part of the action unfolds in the sky. The whole game consists of eighteen levels which differ by the complexity of controlling and by the number of targets. The current potential of a player is limited by eight lives (arcade mode), but the survival mode is also provided.\n\n###Key features\nThe main distinctive feature of the game is the exact precision – the principles of weapons’ working were designed in accordance to contemporary ballistics. There are multiple ways to modify the weapon as it predetermines the total success. Two-player mode is available; the subjects of the game accomplish different functions and are equipped with diverse technologies. The game possesses the downloadable replays and can be constantly entered from any moment.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sharpened Edge Studios","platforms":[{"id":0,"name":"PC"}]},{"id":362928,"name":"Song of Horror","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ba/4baba3d0e9b5b959ee37c40b72a886dd.jpg","description":"Beware the shadows and the darkness which seem silent. Beware the closed doors, the whispering mirrors. Beware the Song of Horror that nests in the cracks of your mind.\nThe famed writer Sebastian P. Husher has gone missing, along with his entire family. Worried, his editor sent an assistant to his house in order to look for him – but he never came back... These disappearances spark a set of events that will soon reveal something dreadful: a nameless, dark entity known only as The Presence seems to be responsible – and it’s still somewhere, out there, lurking in the shadows, waiting for you... You may die, but the horror continues – others will pick the investigation up from where you left it until you all find out the origin of The Presence and put an end to this nightmare.A PARANORMAL ADVENTURE OF UNPREDICTABLE TERROR\nSong of Horror offers a truly dynamic terror experience: its antagonist, the supernatural entity known only as The Presence, is controlled by an advanced AI (Artificial Intelligence) that adapts to your actions and decisions. Experience unbearable fear as this otherworldly being responds to your way of playing and hunts you down in unexpected ways, offering a unique experience to every player and gameplay where tension builds up naturally instead of coming from scripted sequences.\nAs a player, you will live this story through the eyes of a varied set of characters related to the story in their own way. Every character is different, and brings their unique point of view to the investigation, allowing them to approach clues and items differently. Their actions and decisions will shape the world: some of them will know more or less of certain aspects of the story; some will be more effective against supernatural manifestations, but all of them can die if the Presence gets to them – and death is permanent. If they die, you will have to pick the story up with another one, and continue the investigation so their deaths are not in vain. SPOOKY CHARACTERISTICS\nInvestigate a paranormal mystery in a thrilling story of psychological horror\nBeware The Presence, an otherworldly entity with its own AI that reacts to your actions and decisions in a non-scripted, unpredictable horror experience\nChoose between a group of unique characters: each one brings its own point of view and has a different relation to the story and other characters\nYou may die, but the horror continues: death is permanent – when a character dies, it’s gone...\n...but the next one will follow the investigation from where the deceased left it. The world will be shaped by their previous actions.\nExplore haunted, sinister locations to gather clues and items that will help you solve challenging puzzles while enduring the agonizing tension of the game's atmosphere","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Protocol Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":14698,"name":"Broken Sword 3 - The Sleeping Dragon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ada/adafd921942b7fadd62ca606dda2b1cb.jpg","description":"Broken Sword 3: The Sleeping Dragon is an adventure quest game developed by Revolution Software, it is the third installment in the series.\r\n\r\n###Plot\r\nA murder happened in Paris. The victim is an underground hacker that goes by the name of Vernon Blier. It is later revealed that he was hired by the head of a Neo-Templar order called Susarro to decrypt an ancient manuscript which contains a key to world domination. George and Nicole begin their search for answers in different places - while George looks for something in Kongo, Nicole tries to find clues in Paris. In their quest, they visit Glastonbury, a castle in the Carpathian Mountains, the caves of Kongo and even the Egyptian pyramids.\r\n\r\n###Gameplay\r\nBroken Sword 3 is the first title in the series to not feature a point-and-click interface. A direct control system is used instead. There is an action rose in the bottom right corner of the screen. The actions that can be done at the moment are shown there and can be executed using a corresponding key.\r\n\r\nDuring gameplay, the players have to search for items that will help them in their advancement in the in-game world. A number of puzzles are present in the game.\r\n\r\nThe main characters can also engage in branching dialogues with other non-playable characters to find clues on what needs to be done to progress further.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Revolution Software","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":20020,"name":"Euro Truck Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c2/5c2b22f50ab39194c6ece280e3238ac4.jpg","description":"The original Euro Truck Simulator - the game which has become the classic of the genre and is still relevant today. The first truck simulation game in a European setting, with European long haul trucks!\nDrive freight from London to Rome to Berlin to Madrid to Prague - and many more cities - in realistic vehicles. Faithful reproduction of driving trucks on the European road. Pick up a variety of cargoes, and deliver them on time! Highly realistic, meticulously detailed models based on real trucks. Actual working instruments such as flashing indicators, temperature and low fuel warning lights, wipers, and a full set of gauges. Pan the camera around the cabin, just as if you were actually sitting at the wheel.\nNote: Unofficial \"mods\" are not supported by the Mac OS version of the game! (file formats are not compatible with Windows PC version)","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SCS Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14637,"name":"Greyfox RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ff/1ff7063111950a769bcc56aa49b6e1ec.jpg","description":"Greyfox RPG is a role-playing game made with RPG Maker.  \n\n###Plot \nGreyfox centers around the theme of aging and loneliness. The game follows a 35 years old woman who decides to abandon her previous life.\nShe quits her job, her apartment and moves to the retirement community called Greyfox. Upon arriving, she meets local, explores the surrounding and then goes to sleep in her room. While sleeping, she dreams of a Mysterious Woman that she met earlier this day. She turns protagonist old and makes her live an episode of four old people lives and decide their fate. \n\n###Gameplay \nEven though the game’s name presumes that this is a role-playing game, the gameplay shares more similarities with story-driven quests or adventure games rather than RPGs. There is no battle system or character advancement in Greyfox. The game mostly consists of interacting with NPCs and exploring the environments except for a driving sequence in the beginning. The game ends soon after you’ve lived all four days in other old people’s lives. However, there are some optional activities in the game. Upon arriving at the Grayfox, you get some free time before you can move into your room. During that sequence, you can earn money, talk with residents, explore the local area or even steal money from a sleeping person.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lesley Dodd","platforms":[{"id":0,"name":"PC"}]},{"id":13252,"name":"La-Mulana","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1b/a1b4791714063c7c6793a68b3e25827a.jpg","description":"In La-Mulana, the player assumes the role of an adventurer archeologist and explores the ruins of a forgotten ancient civilization.\n\n###Plot\nThe game follows an archeologist named Lemeza Kosugi. He continues the research of the lost city of La-Mulana that was started by his father Shorn. La-Mulana is a magical place that the protagonist believes was the source of all human civilizations. Its architecture consists of a mixture of various ancient cultures, such as Greek, Egyptian or Maya. Lemeza discovers that all human civilizations were created by an alien \"Mother\" with a goal to help it return to space.\n\n###Gameplay\nThe player controls Lemeza in a 2D environment. The main character has to explore the levels that consist of many mazes, platforms, and environmental puzzles. The levels are non-linear, and the player can complete the game in a variety of ways, although there are no alternate endings. Lemeza can use his whip to fight enemies or to break some parts of the environment to clear the way.\n\n###Style\nThe game intentionally imitates the retro style of 16-bit console games from the 90s. It uses a limited color palette and pixelated visuals. La-Mulana is also obviously inspired by the Indiana Jones film series. The main character wears a fedora, fights with a whip and is very similar to Indiana. The game is set to the music typically associated with old adventure films.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"NIGORO","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":2495,"name":"Jade Empire: Special Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f0/1f0f1e699f80b56a44078317d5b08923.jpg","description":"Step into the role of an aspiring martial-arts master and follow the path of the open palm or the closed fist.  In this multi-award-winning action-RPG, your choices and actions will determine the fate of the entire Jade Empire.  Will you prevent the destruction of this beautiful land, or will you crush it beneath your heel?  Are you a warrior who uses his strength and fighting mastery to bring peace, or will you instead use your power to bring pain and ruin?\nThe choice is yours.\nThe Original Award Winning Jade Empire\nAn incredible, engaging story that makes you the noble hero or the treacherous villain!\nA wealth of fascinating characters to interact with.\nBeautiful, mysterious lands to explore, discover, and save...or conquer.\nA rich blend of role-playing and exciting real-time combat.\nNew monsters and enemies.\nNew fighting styles.\nCustomizable, intuitive controls including support for game-pads and keyboard/mouse.\nIncreased graphics resolutions and new visual effects.\nImproved combat AI and difficulty levels.\nNew world map interface.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Aspyr Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":707256,"name":"Sniper Elite 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e0/3e09bb71ce82dad515df4982a2466e67.jpg","description":"The award-winning series returns as Karl Fairburne fights to uncover Project Kraken in 1944 France. The genre-defining authentic sniping, with enhanced kill cam, has never looked or felt better as you fight across immersive maps to stop the Nazi war machine in its tracks.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Rebellion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":327203,"name":"Chivalry 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3e/d3ed3ab5f11f8f6294dd561c16dccdf8.jpg","description":"Return to the ultimate medieval battlefield.\nChivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from clashing swords, to storms of flaming arrows, to sprawling castle sieges and more.\nStorm into battle with your friends with cross-play on all platforms!\n- Charge headfirst into stunning 64-Player cinematic battles inspired by epic medieval action films\n- Experience large-scale conflicts in sprawling medieval environments ranging from Tournament grounds to full-scale castle sieges\n- Pick your playstyle with 4 classes and 12 subclasses, each with their own unique weapons and abilities\nand much more!\nFully Forged for PlayStation 5\nMade to take full advantage of the PS5 hardware, Chivalry 2’s 64-player medieval madness runs in a glorious 4K at 60 FPS with beautifully rendered details,  ray-tracing, immersive haptic feedback, and other significant improvements made possible on PlayStation 5. Chivalry 2 also supports cross-generational upgrades from current gen versions when you upgrade to a PlayStation 5 system.\nOffline single player\nOnline multiplayer (2-64 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOptional In-game purchases\nOnline play required\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nYou can download and play this content on the main PS5 console associated with your account (through the “Console Sharing and Offline Play” setting) and on any other PS5 consoles when you login with your same account.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Torn Banner Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":244700,"name":"OMORI","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2cb/2cb0d8e4cb57e7b03576619be68326c8.jpg","description":"OMORI is a surreal psychological horror RPGmaker game. You must travel between two worlds, both welcoming, both concealing the same secrets. Meet new (old) people, fight new (old) enemies, explore your own memories, and uncover some hidden truths along the way (although you wish you hadn't.) When the time comes, you can only choose one. \n\nWhich world is more real? You decide, I guess.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"OMOCAT","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":241146,"name":"BEAUTIFUL DESOLATION","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b28/b28f18aec9cf472bf0034927cdfcbc11.jpg","description":"WISH LIST NOW!\nAbout the GameBEAUTIFUL DESOLATION is a 2D isometric adventure game set in the distant future. Explore a post-apocalyptic landscape, solve puzzles, meet new friends and make powerful enemies, mediate conflicts and fight for your life as you unravel the secrets of the world around you.FEATURING\nP&C Puzzles and classic adventure gameplay.\nAn 80's retro technology look and feel.\nA story-drive adventure set in a dystopian post-apocalyptic future.\nA unique tribal punk aesthetic and 2D isometric rendered environments.\nAfrican landscapes captured with photogrammetry and scale model elements.\nBizarre creatures, animals and vibrant characters await.\nFIND YOUR BROTHER AND GET HOME...\nMark, a man out of time, searches for his lost brother Don, in a far-flung futuristic era ruled by highly advanced technologies which are both revered and reviled.\nYour surroundings hold echoes of a desolate past, and glimpses of a dark future that has yet to be written by your actions. Be prepared to face many tough choices that will shape this land long after you complete your journey.\nThe inhabitants of this world will help and hinder you, as you make new discoveries and navigate the spectacular African-inspired landscape. Negotiate your passage with local leaders, healers and warriors, or find yourself embroiled in a battle against nanite swarms, enormous scorpions and rocket-equipped robots.\nFrom thriving villages to crumbling cities, petrified forests and bone-dry ocean beds, this strange new world holds a multitude of terrains to uncover, beautifully rendered in 2D isometric art.\nThe score is masterfully crafted by composer Mick Gordon, known for his work on Wolfenstein®, DOOM®, Prey®, Killer Instinct® and Need for Speed®.\nBEAUTIFUL DESOLATION™ is brought to you by THE BROTHERHOOD™, the studio behind STASIS® and CAYNE®.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"THE BROTHERHOOD","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":19096,"name":"RollerCoaster Tycoon 2: Triple Thrill Pack","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e6/9e6d74d2bdaa1e2e89f575480202c99d.jpg","description":"Stretch your imagination further to build bigger parks and higher coasters! Break ground and start from scratch, open the gates to a remarkable Six Flags park, or just create the most gut-wrenching roller coaster imaginable - now you can play your way! Choose and complete different scenarios accordingly to the experience and content you like. Satisfy the visitors by building various attractions and facilities.Wild new rides, exciting new themes, and improved easy-to-use building tools make creating the ultimate amusement park more fun than ever!\nTest your Tycoon skills with 25 amazing Six Flags® coasters and 5 Six Flags® parks based on real-life places\nCreate incredible roller coasters using all-new Roller Coaster Designer!\nThrill your park guests with over 150 different rides and attractions\nCustomize your park with new and unique themes, including Giant Garden, Wild West, Pirates, and more!","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Chris Sawyer Productions","platforms":[{"id":0,"name":"PC"}]}]