[{"id":44234,"name":"Ping","genre":"Action","price":0.0,"description":"How long can YOU last against an onslaught of dots?\nBring diamonds to the center. Ping!\nUse a shield or black hole thing!\nDiamond-matching dots will pop,\nTouch the rest: they will not stop!\nWhen you're done there's art to see-\nCompete for hi-scores locally!\nIncludes 8 modes for colorblind,\nany less would be unkind:\nAchromatomaly\nAchromatopsia\nDeuteranomaly\nDeuteranopia\nProtanomaly\nProtanopia\nTritanomaly\nTritanopia","imageUrl":"https://media.rawg.io/media/screenshots/16f/16f271ddd32fc95fc61cc4996ecd703c.jpg","releaseYear":2017,"developer":"Examined Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":41142,"name":"War of the Immortals","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/cdb/cdb95c1e5a71e1370b317a53fac124aa.jpg","releaseYear":2012,"developer":"Perfect World Beijing","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28328,"name":"SEGA Rally","genre":"Action","price":0.0,"description":"SEGA Rally Revo is the new benchmark in next-gen off-road racing, turning every lap into a new experience. Experience truly deformable tracks for the first time, using proprietary GeoDeformation™ technology. Bumper-to-bumper races on a constantly changing track surface, using fully customizable licensed cars. The genre-defining SEGA Rally arcade brand sets a new off-road racing benchmark with SEGA Rally Revo, made possible by the processing power of next-generation platforms.","imageUrl":"https://media.rawg.io/media/games/2fd/2fdd26947ab24cda80f3a227c58ee74d.jpg","releaseYear":2007,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"}]},{"id":24503,"name":"Band Hero","genre":"Arcade","price":0.0,"description":"Family and friends will come together to ascend the virtual stage and\nrock their way to superstardom with Band Hero. Band Hero brings a new\ngenre of music focused on today's hottest hits and classic anthems.\n\nHeadlined by some of music’s biggest names as playable characters such\nas Taylor Swift and Adam Levine of Maroon 5, Band Hero is the ultimate\nparty game where players of all ages will be able to experience the\nsignature, easy-to-learn but difficult to master Guitar Hero gameplay.\n\nTaking social gameplay to new heights, Band Hero, allows fans to create\nthe band they have always dreamed of using any combination of guitar or\ndrum controllers and vocals, providing a new generation of rockers and\nperformers the chance to experience and interact with their favorite\nmusic.\n\nFeatures\n\n•JOIN THE PARTY AT ANY TIME\nIn Party Play mode you can\njump in/jump out of a song at any time with the click of a button\n•ALL\nNEW SING-ALONG MODE\nSing together karaoke style on any song you\nchoose\n•ROADIE BATTLE MODE\nTeam up with a partner on\na Nintendo DS Lite for an all new level of competition\n•CREATE\nYOUR OWN BAND\nYour band is as unique as you are. Play with any\ncombination of instruments you want, even 4 lead singers\n•EXPAND\nYOUR MUSIC COLLECTION\nImport your favorite Guitar Hero World Tour\nand Guitar Hero 5 Add-On Content straight into Band Hero\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","imageUrl":"https://media.rawg.io/media/screenshots/a3d/a3d869296412a238a00ec7873fb93f2d.jpg","releaseYear":2009,"developer":"Vicarious Visions","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"}]},{"id":23590,"name":"Heroes Tactics","genre":"Action","price":0.0,"description":"The world’s most addictive tactical strategy & defense game – welcome to Heroes Tactics! You’ll need some brains and tactics to lead your unique team of knights, archers, magicians, riders, flyers, and other types of awesome heroes! Strategically lead your heroes through an epic adventure as you invade exotic lands of dragons, skeletons, monsters, and citizens of the underworld. Now, begin this epic adventure to wipe out enemies, defeat other players worldwide in LIVE PVP, and rescue Princess Loralyn! GET FREE prizes everyday!\n▷If you encounter any difficulties or require support please contact us by tapping the in-game “HELP” button to check out our FAQ and chat with us.\nPlay Heroes Tactics NOW!","imageUrl":"https://media.rawg.io/media/screenshots/b08/b08bac81eb3801327bac557521ba0a5c.jpg","releaseYear":2017,"developer":"Camex Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":23210,"name":"Just Ski","genre":"Action","price":0.0,"description":"Don't let the minimalist look fool you, Just Ski is a challenging physics game.  If you don’t desire a challenge and want something more casual, please do not purchase this game.\nStill here? Good.\nIn order to set expectations let me explain what's going to happen during your first 30 seconds playing Just Ski!\nThe game is going to open with a small skier stretching and crouching... stretching and crouching... This is the game trying to show you how the controls work. You will likely dismiss this and click the screen as the \"click to start\" text instructs.\nThe skier will instantly start accelerating to the right and you're going to start to panic ever so slightly because you’re not really sure what to expect.\nAt full speed, your skier is going to approach and then launch off the first jump... You are going to flail the mouse around in a desperate attempt to gain control. You are going to fail and you are going smack the ground hard in epic fashion.\nAt this point one of two things will happen:\n1. You'll be intrigued by the utter lack of control you seemed to have over the skier and at the seemingly impossible task the game has thrown at you.\n2. You will rage-quit in frustration and push for a refund.\nAs the developer I'm obviously hoping for scenario 1. Just Ski! really isn't as difficult as it will feel after that first failed jump.  It will certainly take some time to learn as it requires you to become proficient at an entirely new intrinsic skill, but once that is done I think you'll see the difficulty isn't quite what it once seemed.\nThe controls for Just Ski are simple to understand yet require real work to master because they are physics based.  Moving the mouse up and down simply controls whether the skier is stretching or crouching.  Just like in the real world, this determines how slow or fast the skier rotates while in the air. (Lookup conservation of angular momentum in any physics textbook.)\nOnce mastered, Just Ski will feel smooth and rewarding with just the right amount of challenge to keep things interesting.\nOne last thing. Pay attention to the color of sky and the color of the sun. The color of the sky will change as you get further along the ski path and the color of the sun represents your best run.\n-Have fun and thanks for playing!","imageUrl":"https://media.rawg.io/media/screenshots/b55/b55c56985c93a244a2b4b9f938fe5109.jpeg","releaseYear":2017,"developer":"Farseer Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":22857,"name":"Tales of Monkey Island","genre":"Adventure","price":0.0,"description":"The legendary series returns from Davy Jones’ locker and onto your screen with lush 3D environments, rip-roaring humour, and Guybrush Threepwood himself!\nWhile explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat pirate hunter and a creepy French physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem…\nWho can Guybrush trust? Where can he turn? Everything you think you know will be challenged as Tales of Monkey Island builds to its unexpected finale. Witness how one of the most cherished adventure gameworlds comes back to life in this modern point-and-click classic!\nTales of Monkey Island bundle includes the following episodes: Launch of the Screaming  Narwhal, The Siege of Spinner Cay, Lair of the Leviathan, The Trial and Execution of Guybrush Threepwood, and Rise of the Pirate God\nThe classic adventure series returns with stylish and beautiful 3D graphics!\nReacquaint yourself with Guybrush Threepwood, his wife Elaine, the demon pirate LeChuck, and meet some new faces!\nA swashbuckling set of comedic pirate adventures set on the high seas all in one great DRM-free bundle!","imageUrl":"https://media.rawg.io/media/screenshots/483/4839dddb8e77eedd310f2da9400fdc26.jpg","releaseYear":2009,"developer":"Telltale Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":22027,"name":"Star Story: The Horizon Escape","genre":"Adventure","price":0.0,"description":"Featured DLCIf you really liked our game and would like to support our team, please check out our DLC.\nYou cannot imagine how much this would mean to us! (ಥ﹏ಥ)\nSincerely yours, from Russia with love, EvilCoTeam. (ﾉ◕ヮ◕)ﾉ\nAbout the GameThe archaeological research mission faced some unexpected difficulties. Your spaceship crashed. Can you escape from this planet? But how? No one can help you. You are here all alone. Or not? Do you have a plan? Will you find what it takes to be a hero?\nMeet Star Story: The Horizon Escape - a turn-based adventure game with text-rpg elements. Tune into the story of the aspiring space-archaeologist Van Klik on his mission to the mysterious planet of Horizon!Nonlinearity of the plot development, 24 alternative endings Your choices define the story. Totaly. Some will turn out better than others, some will worse and some will be straight up hilarious. You are to find the real true ending among your possible destinies and become a hero. Or maybe something more...\nText-based gameplay diversityThe core classic. Dive into the stories and find a way to exploit EVERY possible situation. Did you know that if you throw a lockpick at an attack droid, it will decide that you are stupid and will deactivate? Build your character, choose your alignments, learn the lore of the world. You will need it all to succeed.\nGame mechanics The story will throw a mix of dialogues, choices, turn-based battles, puzzles, weapon and resource crafting, technology research and more at you. You will use all you can to survive the challenging world of Horizon.\nTurn-based philosophy The player decides on the speed that he wants to play the game at. Everything is turn-based. There is no time-limit for making decisions, no quick-time events, no rush: you can take any amount of time to make your turn.\nBeautiful world Enjoy the wild and crazy sceneries of the world of Horizon. Deserts, jungles, cities, underground caverns… the list goes on.\nColorful charactersMeet the locals! Who is more to your liking? Side with “Bullet King” and uncover an ancient cryptic artifact. Or choose to undermine his brutal regime and make the local revolutionary your friend. Or screw them and go try to play romance with the alien girl? Or blow up the planet? Or… You get it!\nNeed A break? The Horizon Is Waiting!","imageUrl":"https://media.rawg.io/media/screenshots/47a/47ac364a6cd1033a7758445e29e3e9db.jpg","releaseYear":2017,"developer":"EvilCoGames","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":21679,"name":"BC Kings","genre":"Strategy","price":0.0,"description":"BC Kings features several new elements not commonly found in strategy games. In addition to gathering resources, training an army and defeating the enemy, you will have to solve adventure and role-playing elements as well.\nThe campaign is built around the epic story of the brave hero Mradin, and his trusty old friend Giesnik. As you complete the main objectives, you'll run across several side-quests where you can earn Shell-coins that can be spent on upgrading your main characters. Along the way to victory you'll figure out the biggest mysteries of all time, like the purpose of Stonehenge and the mystery of the Yeti, and much more...\nStory driven campaign with side quests and adventure elements\n63 unique units\n32 unique buildings\n84 technologies to research\n8 devastating magic spells","imageUrl":"https://media.rawg.io/media/screenshots/b1f/b1f1d2eb572883c6373f88a2a7a665b8.jpg","releaseYear":2008,"developer":"Mascot Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21153,"name":"Dusk 12","genre":"Action","price":0.0,"description":"Darkestville Castle Coming Soon\nNew shooter is available on Steam!http://store.steampowered.com/app/435420\nAbout the Game\nThe project to create the perfect soldier ran out of control, and turned itself into an incurable virus. The whole city is now under quarantine as the inhabitants transformed into blood-thirsty assassins. A group of Spec Ops soldiers are now trying to uncover the secrets of those aborted experiments undertaken 4 years ago...\nPlay alone or in squad mode as you control the mutated man or the soldier. Use your superpowers or give orders to your companions to aid you in the combat.\nTake everything you want, break hundreds of objects, use elements of the scenario as weapons.\nSeveral vehicles that you will be able to use for traveling through the scenario and transport your group.","imageUrl":"https://media.rawg.io/media/screenshots/1c3/1c3317de9e90595c633a46f5772e596a.jpg","releaseYear":2014,"developer":"Orion Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20896,"name":"Predator Simulator","genre":"Action","price":0.0,"description":"DISCLAIMERHave you had enough of pointless & boring \"simulator\" ripoffs? It's about time someone made a simulator that's actually a game you can enjoy. Prepare to restore you faith in the simulator games, GameIndica Entertainment brings you the next best simulator since the simulator genre was born.INTROPredator Simulator is an action arcade RPG packed with endless gameplay and new missions for every game session. On a quest to become a true Lionborn, you get to save the planet by wiping out humanity from the face of the earth. Yeah.... didn't you always want to do that anyway? Now is your chance!GAMEPLAYExplore the wild countryside while enjoying fresh farm raised pigs, rooster & chicken wings. Reach the human populated city to start your manhunt and climb up the defcon levels. Eat anything that moves because that what a predator does to survive. Tasty and weak human prey will get you big rewards, but be careful, too much chaos will attract the hunters! You will be classified as a Predaterrorist and face heavy resistance. Be prepared for the worst. Unlock the hidden uncharted territory outside the game world by becoming a true Lionborn, where you can find secret journal entries from the game developer. We hope you will enjoy knowing more about the back story of this game and how it was made.KEY FEATURES+ Play as an apex predator AKA a lion.\n+ Funniest part of the game is the Advanced AI system with real-time Predator-Prey simulation. Unarmed preys will try to run for their lives, armed hunters will try to hunt you down. Although getting them scared will make it easy to hunt them. Various scaring tactics can be used (ex. Attack from hidden corners or behind, jump scare them, roar at them, eat someone in front of them etc)\n+ Kill various species depending on your own humanitarian or animal loving bias.\n+ There are hipsters, rednecks, donut loving cops, cosplayers and even console peasants in the city.\n+ Live tweets from your poor, whining victims\n+ After hunting your prey, eat them and listen to the sweet bone crushing musical notes. It never gets old.\n+ Defcon levels work like wanted levels in any open world game. The higher you get, the more bonuses you get but the game becomes more difficult.\n+ Tons of characters to unlock as you play. Bigger rewards for hunting down higher level victims.\n+ Powerful roar to scare everyone around you. Once you become a true Lion born by acquiring the glorious Fus-Roar-Duh skill, roars become lethal.\n+ Xbox Controller support.","imageUrl":"https://media.rawg.io/media/screenshots/dc3/dc3db6a94c588bc9f909214c6bee577b.jpg","releaseYear":2015,"developer":"GameIndica Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20827,"name":"Mighty Gunvolt","genre":"Action","price":0.0,"description":"Get ready for a blast from the 8-bit past with the all-new 2D action/platforming game, MIGHTY GUNVOLT! A loving nod to the retro side-scrollers of the late '80s, MIGHTY GUNVOLT offers simple controls, cute and colourful graphics, and a surprising amount of complexity and fun.\nPlay as one of three characters: Gunvolt, the star of Azure Striker GUNVOLT; Ekoro, an angel from Japan's Gal*Gun series; or Beck, the hero of Mighty No. 9. Each character possesses unique skills that will allow players to keep challenging each stage in new and creative ways!","imageUrl":"https://media.rawg.io/media/screenshots/35f/35fb4cc1912c120dd5373449680b12c1.jpg","releaseYear":2014,"developer":"8-4","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":19943,"name":"Redemption: Eternal Quest","genre":"RPG","price":0.0,"description":"Redemption: Eternal Quest is a casual-themed RPG/Sim game which combines the feel of an RPG with roster management sim mechanics. You become the leader of a band of adventurers, guiding them through quests and adventures, healing them, watching them grow (or not!) and signing them to new pacts while keeping your gold pouch filled.\nFeatures:\n-- Take leadership over 6 adventurers that you choose, each with different strengths and weaknesses, bonuses - and hidden mysteries.\n-- Completely re-playable – play with certain time or quest limits, or play unlimited seasons in a campaign. Everything is randomly generated every game, for maximum replayability.\n-- Full variable aging and injury/disease engine built in for maximum challenge. Gain experience levels, and increase in ability over the seasons. Variable development curve - some will develop into fearsome warriors, some won't.\n-- Characters form relationships with each other over time, good or bad. Sign them to contracts (or 'pacts') to keep them happy and working for you, or if they’re too greedy, decide when enough is enough and cut them loose. Pacts can include up-front money, yearly money or a percentage of treasure found.\n-- Choose your path: Train your warriors in school and build them up, or draft seasoned hirelings later on to take their place if they don’t cut it.\n-- You set the pace: You can send them on easy missions into realms with limited danger (and maybe limited rewards) but protect your warriors, or send them into more dangerous worlds for more rewards.\n-- Music, detailed graphics and polished UI to draw you into the world.\n-- Engage in unique card-based combat with over 200 different monsters, each with different fighting strength ranges.\n-- Explore ruins, dungeons and open treasure chests, and complete unique grand quests.\nChoose your destiny with Redemption today!","imageUrl":"https://media.rawg.io/media/screenshots/d38/d3890be3da93fefef333a5b0d1b94f63.jpg","releaseYear":2015,"developer":"SimProse Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19632,"name":"Chronicles of a Dark Lord: Episode II War of The Abyss","genre":"RPG","price":0.0,"description":"A year has passed since Anto Calias fused with the essence of the dark god Xe'on and the War of The Abyss began. The forces of The Abyss are relentless in their campaign to annihilate the world of Cora. Magus Lee must unite with allies both old and new to prevent the coming apocalypse...but what will be the cost?\nFeatures\n- The epic saga of Magus Drakhen Lee continues with over 30+ hours of gameplay.\n- All new high-resolution artwork and lush landscapes will immerse you into the world of Cora like never before.\n- New to the series is the inclusion of the Scion Grid for greater skill customization.\n- The Active-Time Battle system returns with new features and enhancements.\n- Professional-quality soundtrack, featuring independent artists such as Morte Mcadaver, Marielle Thomas, zero-project, and two tracks from acclaimed Youtube artist Eric \"Erock\" Calderone.\n- No random battles. Enemies are visible on the map.\n- Screen resolution options up to 1920 x 1080\n- Enemies adapt and change tactics during combat.\n- The choices you make have even greater impact and may even affect the final outcome and much more!","imageUrl":"https://media.rawg.io/media/screenshots/586/586c2df88a4a844e4b01e026f7e581b6.jpg","releaseYear":2015,"developer":"Kisareth Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17876,"name":"Chuck's Challenge 3D","genre":"Board Games","price":0.0,"description":"From the design veteran behind the classic game Chip's Challenge, comes Chuck’s Challenge 3D, a fiendishly addictive puzzler that’s packed with features that will tease the brain and challenge the fingers. It also comes with a level editor that lets you upload and share your levels for everyone to play and rate, all from within the game.\nChuck’s Challenge 3D includes four different game modes:\n• PLAY – through 150 levels, with your best times published online\n• CREATE – your own levels with over 85+ Game Elements & share them with the world\n• SEARCH – download levels created by other players\n• WEEKLY PUZZLE – play the best user created level of the week\nMeet Woop, just your everyday puzzle lovin’ purple alien capable of altering time and space. Woop has summoned all-round puzzle game legend Chuck Sommerville for one purpose - to create a universe of puzzles for him to work his way out of. Take control of Woop and help him navigate his way through level after level of obstacles and challenges that stand between him and reaching the exit portal. Shift blocks, find keys, flip switches, wade through water, hot-foot it through lava and do everything it takes to make it out in one piece and evade an army of hungry creatures who want nothing more than to turn our purple hero into a nice ‘n tasty Woop Sandwich.","imageUrl":"https://media.rawg.io/media/screenshots/e8a/e8aa6a7a53cbad0237a965ca8444721b.jpg","releaseYear":2013,"developer":"Niffler","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":17305,"name":"The Puppet Master","genre":"Indie","price":0.0,"description":"A puzzle game bound to test your ability to think out of the box.\nDeadly rotating blades. Bottomless ditches of death. And a demented woman with an unfortunate affinity for bad puns at the most inappropriate times gunning for your death. As if that wasn't bad enough, your soul has been trapped in a doll courtesy of the aforementioned 3-in-1 mind games playing, cold blooded killing machine, and psycho-lunatic of a lady.\nThe Puppet Master is a puzzle game that is bound to test your ability to think out of the box. While being severely limited in many aspects by the fact that you're imprisoned in half a pound of cotton and felt made into the vague likeness of a human being, you are otherwise granted the Hogwarts worthy ability to transfer your soul into the bodies of other puppets around you. A skill that, if used well, just might save your life.\nAn exhaustive amount of meticulous planning and perfectly timed executions are vital in the survival of the game. Carefully take note of your surroundings, and you might even outsmart the puppet master and get your body back. It's a game of control or be controlled.AMS Game Development Association\nThe Puppet Master is distributed under the AMS Game Development Association, a student run game development club located in the University of British Columbia. Every year, members of AGDA get together and make new games, mixing in our collective talent and creative efforts to make fun, engaging games that are hard to put down. Our goal is to work towards expanding our knowledge of the tools, techniques, and processes used in video game development.","imageUrl":"https://media.rawg.io/media/screenshots/6f8/6f866e34632ab67cf5fc329b139bdc4c.jpg","releaseYear":2016,"developer":"AMS Game Development Association","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17015,"name":"Drizzlepath","genre":"Adventure","price":0.0,"description":"In Drizzlepath you are set on a journey to the top of the Mountain of Fire. This game is what you'd call a \"walking simulator\". It aims to be an atmospheric, relaxed and enigmatic experience. It was made in CryEngine 3 to achieve an immersive graphic quality. If you enjoy games that are about the experience of discovering of the world around you, you will probably love Drizzlepath.\nWhen you download the game, you also have the game's OST in your \"...Steam\\steamapps\\common\\Drizzlepath\\Drizzlepath OST\" folder.\nNote: Drizzlepath is a short game and has no save feature. The checkpoint system in game is for situations like getting stuck in a hole or dying by falling down from high grounds. It only works in game session and resets when you quit game to main menu or desktop.","imageUrl":"https://media.rawg.io/media/screenshots/816/816db551ba161749276160f9f0095288.jpg","releaseYear":2015,"developer":"Tonguç Bodur","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15681,"name":"Void Pyramid","genre":"RPG","price":0.0,"description":"Void Pyramid is a post-apocalyptic RPG set in the space-faring Egyptian empire.\nIn the far future, the maniacal Prime Pharaoh rules the wastelands of Earth. Any who oppose him are exiled to the Void Pyramid. This outer space prison is populated by criminals, beasts, and mutants. No one has ever escaped, but you must try.\nVoid Pyramid is a completely free game with no microtransactions. It will run on nearly any computer!\nChoose to be a soldier, slave, or scribe. Overcome challenges with your unique skills.\nExplore the intricately designed pyramid. Each chamber is packed with foes, puzzles, traps, and treasures.\nDevelop your character however you want with an unusual but intuitive advancement system.\nUse your brawn, wits, and agility stats to kick down doors, bend bars, hack computers, haggle with merchants, dodge traps, scale walls, and more.\nFind numerous solutions to every problem. Explore multiple paths through the pyramid. Experience alternate endings. Fight optional bosses. Discover hidden treasures.\nExperience a unique vision of the future. In the space-faring future, the Egyptian empire has risen again. The Prime Pharaoh’s mutant armies oppress mankind.","imageUrl":"https://media.rawg.io/media/screenshots/69e/69eb553895296d9665d227d86c8748ac.jpg","releaseYear":2016,"developer":"A. Hagen","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":13640,"name":"Inner silence","genre":"Action","price":0.0,"description":"LOOK HERE!https://store.steampowered.com/app/955700/TITAN_HUNTER/?curator_clanid=27125307\nAbout the GameInner silence - cheerful 2D platformer puzzle game, made in retro style.\nWe play for the usual boy who got lost and we have to help him get home.\nYou will to travel through the mysterious world overcoming various dangers.\nThe entire game is based on the special mechanics, where you have to change your gravity, using special buttons.\nFeatures:\nLots of interesting and challenging levels\nDifferent types of traps\nMany mysteries and secrets.","imageUrl":"https://media.rawg.io/media/screenshots/77c/77cc47fe3f7af96197a1ddad1303c254.jpg","releaseYear":2017,"developer":"Indie Games Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13348,"name":"Don't open the doors!","genre":"Action","price":0.0,"description":"\"Don't open the doors!\" is a claymation action adventure in an odd world of talking pumpkins, blue trees and stuff like that.\nThe city is in danger! The doors came out of nowhere. Everything near them began to talk and almost everything tried to eat you. Solving this problem is no sweat: you only have to find the Main super door and blast it with a super megabomb. As a real hero, you'll have to handle it yourself. However, everything is sure to go haywire!\nGame features:\nAn open clayworld: explore it and face different challenges;\nOdd, talking characters: conversations with mushrooms, bugs, pumpkins etc. will be your common practice;\nA destructible environment: with a huge hammer in hand, you'll have no chance to be bored;\nTraps, secrets, bosses. There are no tedious places behind the doors;\nOut of pop corn gun ammo? Search for cornfields. Looking for a healing compote? Pick some berries!\nEverything is made from plasticine. Over 8000 photos and an enormous number of editing hours. The game is entirely hand made!","imageUrl":"https://media.rawg.io/media/screenshots/f2d/f2db1569fd9ab2b0bb31bbd857713f4d.jpg","releaseYear":2016,"developer":"Anton Riot","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11622,"name":"Break Into Zatwor","genre":"Adventure","price":0.0,"description":"BACK TO ZATWOR\nFollow Randy Crow once again on his quest to save his brother from the very same prison he himself was imprisoned in.LARRY CROW\nHelp him use his previous experience to break the system and bring freedom to his beloved brother Larry who was put away into Zatwor for trying to help Randy grasp justice!STAY UNDETECTED\nBe silent and stealthy, use the back door to walk undetected through the most brutal prison in the country!","imageUrl":"https://media.rawg.io/media/screenshots/608/608f6dd62a7b4374399a5b72b3e780da.jpg","releaseYear":2015,"developer":"Zonitron Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11381,"name":"Abandon Ship","genre":"Action","price":0.0,"description":"Be the Captain. Survive on the Edge in a World with Consequences.\nIn Abandon Ship you take command of a ship and her crew, exploring a diverse, procedurally generated world, taking on quests and dealing with random events. Frequently, you will end up engaging other ships in combat, the player having to employ their best tactics in order to out-manoeuvre and out-gun the enemy.\nThe game focuses on “Age of Sail” ships in a Fantasy setting, framed in an Art Style inspired by classic Naval Oil Paintings.Ship Destruction is not the End.\nLife in the world of Abandon Ship can be brutal. Death is permanent. But the game doesn’t end if your vessel is destroyed. You are the Captain, and as long as the Captain is alive, there is always hope. By escaping to a Lifeboat, or even being stranded, alone in the water, there is still a chance to survive and fight your way back to the top.Snatch Victory from the Jaws of Defeat.\nCombat is tactical and savage. Each battle is hard-fought, always on the edge of defeat. Your only chance of overcoming the odds is to employ every advantage you can and utilise all the tools at your disposal.Reap What You Sow.\nExplore a fantasy world that reacts to your actions. Quests may drastically change the environment. Make decisions that create friends or enemies that may later come back to help or hinder you.","imageUrl":"https://media.rawg.io/media/screenshots/49a/49a8cc346a4a1d549d3aa488eb39ab92.jpg","releaseYear":2019,"developer":"Plug In Digital","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9619,"name":"Chasing Styx","genre":"Action","price":0.0,"description":"Chasing Styx is an action-packed, three-headed dog, run 'n' gun, couch co-op, bullet-hell adventure.\nYou are Cerberus, feared guardian of the Underworld. While sleeping on the job, a herd of woodland rabbits hopped into the kingdom of the dead. Hades is not pleased – the boisterous bunnies are distracting the inhabitants from their endless torment. Find your floppy-eared friends and get them back across the River Styx before hell freezes over!\nExplore the far reaches of the Underworld, including a forest bathed in darkness and a cursed bell tower. Levels can be approached in any order and feature multiple routes filled with disgruntled dead, tricky traps, hidden treasures, and screen covering waves of bullets. Defeat armies of the dead and collect their souls to level up and equip powerful attacks and abilities. Two player local co-op is supported so bring a friend to help conquer the fast-paced action and frenetic boss battles.\nFeatures:\nludicrous amounts of bullets\nmultiple difficulties with unique enemy spawns and boss attacks\nalternate modes of play including a boss rush and survival maps\n18 unique abilities used to upgrade your hellhound\nchallenges that unlock silly dog costumes","imageUrl":"https://media.rawg.io/media/screenshots/302/302d8cfae5ad4e8c0b0a9749e1b5a464.jpg","releaseYear":2017,"developer":"ForepawSoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4673,"name":"Labyrinth","genre":"Action","price":0.0,"description":"Special OfferEveryone purchasing Labyrinth during Early Access will be granted 10 card packs when the in-game store is added and the game becomes free to play.\nAbout the Game\nWith Labyrinth, embark on a new adventure: Assemble powerful decks of Heroes to invade rival dungeons and engage in epic player vs. player 3D battles--then, use the loot from your conquests to customize your own dungeon and put together a powerful deck of bosses, minions, and traps to defend your riches at all costs.\nPvP game which marries CCG & RPG\nYour Offense deck forms a party of Heroes to raid a dungeon\nYour Defense deck forms a dungeon with Bosses to defend your loot when you are not online\nTactical position and time turn-based action fused with CCG strategy\nBoss cards define their own uniquely themed dungeon rooms\nWill be Free to Play with hundreds of cards to win, craft, and purchase\nBring 'action' to collectible card games\nWith the inclusion of a turn-based 3D combat system, we are excited to bring more action and tactical thinking to the battlefield, upending many conventions of traditional card games. Every card is more than a means for achieving victory: it's also part of a living, breathing world. This also plays to our studio’s experience in making AAA action games.Design for deep CCG strategy\nThe combination of tactical action with familiar CCG strategy opens the door to a new kind of adventure game. We are happy that the creator of Ascension and Solforge, Justin Gary and his team at Stone Blade have joined us to add their decades of experience playing and designing CCGs to our own. Together we are exploring this new frontier and discovering new possibilities for rich gameplay.Create an expansive world rich in culture--both magical and familiar\nWe are passionate game developers.  We want that to shine through in Labyrinth. In crafting the diverse world of Hylea, whether we are describing the Cosmos and creation story of Starfall or the jewelry of a Giant from the Northern Clans, we strive to have our passion and attention to detail reflect in every facet of story and art.Build a game that will last for decades\nFirst and foremost, Labyrinth is a collectible card game. With their hallmarks of creative play, endless combinations, meta-game thinking and the potential for vast expansion, CCGs offer the best and longest-lasting experiences in gaming. We've captured these proven qualities and folded them into an exciting new game.\nThe Four Disciplines of Magic\nThe disciplines of magic in Labyrinth each correspond to energy drawn from a different source within the Cosmos.  They grant their wielders unique abilities that define a particular style of play.\nPractitioners of Warfare magic draw their power from the Spirit plane, a realm ruled by the eternal souls of ancient warlords. Warriors enhance their strength by channeling the might of their heroic ancestors. Warfare prefers a strategy that dominates through brute strength and outlasts with sheer indomitable will.\nWizards, Sorcerers, and Arcanists draw energy from the Elemental plane, a swirling and chaotic maelstrom of raw energy and matter, inhabited by strange animate essences of Fire, Frost, Air, and Earth. Wizardry combines these primal forces to form hulking monstrosities, or it unleashes their raw power with devastating torrents of magic. Wizards wield the most powerful effects in the game, but at the expense of endurance.\nDevotees of Faith magic draw on the favor of the Celestial plane, a vast realm inhabited by gods and demigods as numerous as the humans of Hylea. Celestial beings are fickle and fundamentally alien-- but when they choose to involve themselves in the struggles of humankind, their favors are often decisive. Faith prefers to maintain control of the entire battle, stalling the largest threats while crushing the weak with the will of the gods.\nUnlike the other three disciplines, Skulduggerists do not draw their power from a far-flung realm, but from within, directly ingesting Stardust to enhance their own innate traits. This grants them incredible reflexes, insight, and intellect. Engineers create wonders of mechanical ingenuity. Rogues gain powers of deception and agility. Skulduggerists prefer a strategy where they stay elusive until the perfect moment, then strike to maximum effect.Hero and Boss Cards\nThese cards form the heart of a player's collection. On a raid, players control a party of three Heroes, each with its own deck. On defense, players may control a number of Bosses that grows with their dungeon. Each Boss also has its own deck.\nHeroes and Bosses all have their own unique special ability that encourages certain play-styles and deck building synergies.  A Hero or Boss card also defines which of the four disciplines of magic that character may use.Offense Cards\nAttack cards form the core of a Hero’s deck. Each of the four disciplines of magic specializes in a different style of attack. For instance, Warfare prefers to close distance and crush its foes with large, devastating strikes, while Wizardry opts to stay at range and roast or shatter groups of enemies with area-effect spells. Each discipline also has its own special resource which further reinforces a particular style of play.\nDefense Cards\nMinion cards are the core of most Boss decks. They represent allies pulled from across Hylea and the Cosmos, and summoned to defend your lair.  Each Boss draws on a different style of magic when summoning Minions. Mechanical Bosses draw on enhanced powers of the mind to assemble autonomous terrors, while Divine Bosses curry favor with the gods to summon strange and powerful beings from the Celestial realm.  Some cards directly enhance the Boss or allow it to perform a devastating one-time attack.\nThe Cosmos of Labyrinth\nA great crack tore open the sky. As the farthest reaches of the realm shook with unnatural thunder, thousands of eyes looked up to see their peaceful night shattered into a shimmering prismatic storm. From a fissure in the heart of the tempest, a white star streaked, trailing fire and glowing brighter as it plummeted. Where it crashed to earth it swept into being an enormous crater that crackled and thrummed with otherworldly power.\nIn time, the crater was filled by the water of the Jarum river, and became a great lake. The first visitors were pilgrims following the path of the star, which they named the Prophet’s Tear. They soon discovered that the site was laced with a powdery substance that granted strange and extraordinary powers. They also found the Keyrifts--tiny bubbles in reality through which they could peer into other dimensions. As word spread of these discoveries, a sprawling city began to spring up around the rim of the crater: the City of Starfall.\nA robust trade in Stardust mined from the crater developed.  Men and women came from distant lands and settled in the city's many colorful ethnic wards. Prosperity brought peace and peace ruled over the city for centuries.\nNow, the age-old pacts and alliances are breaking down.  The earliest settlers have consolidated their power and look to push out rivals.  Newcomers to the city seek to carve out territory for themselves.  As night falls, a silent war begins in the tunnels, alleys, and halls of the ancient city.  A sense grows that it's every Hero for themselves...","imageUrl":"https://media.rawg.io/media/screenshots/436/4360a00c7a4b5c82aebfcfcd2a33dd31.jpg","releaseYear":2008,"developer":"Sokpop Collective","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":3797,"name":"Robot Rescue Revolution","genre":"Casual","price":0.0,"description":"EVERY SINGLE ROBOT SHARES LINKED CONTROLS!\nDodge flamers breathing scorching fires and deactivate paralyzing Tesla machines as you guide wacky robots trapped in treacherous labyrinths to the exit! Plan every escape with precision and execute each action with cautiousness as the synchronized movement of the robots hinders a simple plan! Unravel over 100 levels of challenging robotic fun in this unique and quirky puzzler!\nCOMPETE OR CO-OPERATE WITH BUDDIES\nJoin forces with a buddy and use each other’s robots to help one another escape from these obstacle-ridden mazes in Co-op Mode! Be careful! As soon as one robot goes astray it’s GAME OVER for the both of you!\nAnd if you're feeling a little competitive, then take the logic battle to a whole new level and fight it out to the finish line in Compete Mode! Race on two identical but separate maps and test each other’s quick-thinking skills to see whose robots will escape the maze first all in one piece!\nUNLEASH YOUR CREATIVITY\nStep into the shoes of the developers and become the brain behind the puzzles with the additional feature of Map Editor. Utilize all elements and objects, select from different worlds and then upload your master creations online to share with the rest of the Robot Rescue community for even more puzzles to crack!\nThe Palace of Wisdom:\n“For those looking for a challenging brain teaser with a unique twist, look no further.”\nGertLushGaming:\n“It is worth its price and you can get a lot of pad smashing, swear word creating fun out of it. Worth a look for sure.”FEATURES\nUnique mechanics with simultaneous control over ALL robots\nOver 100 mind-bending levels in three tantalizing worlds!\nBeautiful bright graphics designed for 1080p\nOne-Player and Two-Player modes (compete or co-op)\nMap editor with online sharing, compatible with PSN\nSteam Leaderboards, Achievements & Trading Cards!\nFull controller support","imageUrl":"https://media.rawg.io/media/screenshots/c94/c94d57b85b4043c50ea2a62ad67387c2.jpg","releaseYear":2013,"developer":"Teyon","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":90,"name":"Wayward Souls","genre":"Action","price":0.0,"description":"Wayward Souls is a randomly generated action-RPG with a heavy focus on story. Play as seven different heroes, all with their own abilities and playstyles. Fight through steadily greater hordes of enemies, as you learn about each character and find out what happened in the cursed tower you find yourself in.\nGreatly inspired by 90's era action-RPG's, but with a faster pace and a focus on randomized replay value.\nCustomize each character with their own upgrades and equipment sets that change their movesets and abilities.\nOver 100 different monster types. Over 300 hats (IMPORTANT)\nUnique story events for every playable character.\nMany different areas, room types, rare rooms, encounters, and secrets.\nUnlockable game modes, including Endless Mode.\nHeavy replay value due to randomly generated levels, multiple character types, and randomized enemy groups.Hero Characters and Abilities\nRenee uses her mobility to dash through enemies. Her Power Attack is a kick that stuns, with effects depending on her boots. She frequently finds items that let her blind, stun, or poison enemies. All of these let her perform very damaging backstabs.\nEquipment and Upgrade Examples:\nMirage Dagger randomly gives her short bursts of stealth during her dashes.\nGiantstomper Boots upgrade her kicks to send enemies flying far back. Flung enemies will then damage and stun enemies they crash into. The Giantstompers also interrupt larger enemies that are stun resistant.\nToadskin Cowters poison enemies that hit her, stunning them after a few seconds.\nHer Low Blow Upgrade permanently makes it so defeating large enemies will make her next dagger attack stun whatever she hits, even if her slash hits multiple enemies.\nBlythe combines durability with a big sword that cleaves a wide area. He has a shield to block enemy attacks, and throwing axes for when he needs a faster or more long ranged option than his sword provides.\nDuskhander Sword replaces his default Power Attack's charging slash with a whirlwind spin, hitting enemies over a larger area.\nMagebane Gauntlets reduces the damage of enemy spells, while making his throwing axes destroy any enemy spell they pass through.\nStonebeard Slab is much more durable than the default shield, but makes him move very slowly when holding the shield out to block.\nDrakefire Oil is an item the Warrior can use to make all his sword swings emit a traveling wave of flame, for a limited time.\nAbbie has long ranged magic attacks that do heavy damage. Her Power Attack uses her staff for shots that are longer range and pierce multiple enemies. In a tough situation, she has limited use spells for both offense and defense.\nSalamander's Breath Staff turns her magical shots into bursts of flame that pierce even more enemies, but have very short range.\nTremor Garb gives her a powerful footstomp that creates a shockwave to stun enemies and destroy enemy projectiles.\nManablade Arts lets her summon a sword that does high damage, interrupts enemy attacks, can reflect enemy spells, and has a small chance to stun.\nThe Mage can find powerful one use scrolls such as Fireball or Lightning Bolt, which inflict massive damage and stun to multiple enemies.More characters details soon!","imageUrl":"https://media.rawg.io/media/screenshots/c24/c249677c63bd6a584237e6387141e943.jpeg","releaseYear":2014,"developer":"Noodlecake Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":863783,"name":"Monster Prom 3: Monster Roadtrip","genre":"Strategy","price":0.0,"description":"JOIN THE DISCORD COMMUNITY\nAbout the Game\nHit the road with \"Monster Prom 3: Monster Roadtrip\", a vibrant sequel that twists the Monster Prom formula in an exciting new way. At its core, this is a very similar game: a multiplayer narrative adventure full of colorful characters and fresh funny dialogues. But this time the goal isn't getting a date, but surviving a road trip (although you still can score a date if you play wisely).\nYou and up to 3 friends will face all kinds of wacky conflicts, choosing from options in order to manage your road trip resources. If a resource hits zero... you can kiss your trip goodbye!\nBut fulfill the right requirements and you may reach one of the dreamy destinations that will put an epic end to this experience.\nWhat can you expect from this monstrous road trip?\n- The signature style of the Monster Prom franchise: unique, charming characters and irreverent humor\n- A co-op narrative adventure with survival mechanics\n- You can play with friends both through local and online multiplayer!\n- YES! There's still the option of dating. This time flirting is not the core of the game, but you can still get a date with Polly, Scott, or one of the 10+ available hitchhikers by the end of the game!\n- TONS of beautiful art like you have never seen before in these series (seriously, there's A LOT of art packed in here)\n- Even if it's a co-op game, there's a social competitive aspect that will provide a thrill for the game. Choosing how much to seek your own benefit and how much to focus on the group goal!\n- Several brand new characters, and some beloved characters from previous games will be making a comeback!\n- Radio stations to choose from, with different music genres to build the perfect mood!","imageUrl":"https://media.rawg.io/media/screenshots/461/461540af873745450cdd3d39dfcc695d.jpg","releaseYear":2022,"developer":"Beautiful Glitch","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":699062,"name":"Lunacid","genre":"RPG","price":0.0,"description":"Lunacid is a first person dungeon crawler inspired by old FROMSOFT games like Shadow Tower and King’s Field.\nLong ago a great beast arose from the sea and covered the earth in a poison fog. Now those deemed undesirable are thrown into a great well, which has become a pit of chaos and disease. You awaken in a moonlit subterranean world, having been thrown into the Great Well for crimes unknown. The only way out is to go further down and confront the sleeping old one below. On the way there will be many creatures and secrets to discover.","imageUrl":"https://media.rawg.io/media/screenshots/b05/b05500f0994b35bd545bcbacd7ce1719.jpg","releaseYear":-1,"developer":"Akuma Kira","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":663820,"name":"NBA 2K22 for Xbox Series X|S","genre":"Desconocido","price":0.0,"description":"A WORLD OF BASKETBALL\nNBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and players. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyGM and MyLEAGUE. Anyone, anywhere can hoop in NBA 2K22.\nSTEP YOUR GAME UP\nNew tactical offense meets an overhauled defense for a more competitive and immersive NBA 2K22. Add skill-based dribbling, shooting, dunking, and alley-oops to your bag of moves, and counter them with ferocious new blocks and contests on the other end of the court.\nYOUR JOURNEY, YOUR CITY\nMyCAREER and an all-new City become one in a groundbreaking 2K22 experience. Embark on your personal journey to the pros – a sprawling MyCAREER life – ALL within the City. Forge your own path in college, the NBA G League, or even by jumping straight to the NBA. Be a pro off-the-court by growing your personal brand in the music industry, fashion world, and more. And of course, ball out against the best and fiercest MyPLAYERs in the most vibrant and competitive basketball community in the world.\nYOUR DREAM TEAM\nCollect, craft, and hoop in the ultimate NBA fantasy competition: NBA 2K22 MyTEAM. Build your dream lineup of NBA stars and legends across any era, and explore game-changing evolutions to the MyTEAM experience – each addition introduced over multiple Seasons.\nNEW SEASONS, NEW DISCOVERIES\nIn NBA 2K22, every Season brings fresh opportunities to reap new rewards. Whether in MyTEAM, MyCAREER, or The W, compete against the best and discover what amazing rewards each new Season has in store.","imageUrl":"https://media.rawg.io/media/screenshots/d7f/d7f7a0455f1171b89cfdb6c0b83fb688.jpg","releaseYear":2021,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"}]},{"id":608563,"name":"Sonic Colors: Ultimate","genre":"Action","price":0.0,"description":"The evil Dr. Eggman has built an interstellar amusement park – but he’s powering it with a captured alien race called “Wisps.” Use Sonic’s speed to free the Wisps and gain their amazing powers as you explore six unique worlds, filled with hurdles to overcome. Now with stunning upscaled visuals, additional features a new game mode and enhanced gameplay - it's the Ultimate Sonic Colors experience.","imageUrl":"https://media.rawg.io/media/screenshots/e03/e03546b5b5b7b7de9fc16714c84f8f41.jpg","releaseYear":2021,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":586056,"name":"THE HOUSE OF THE DEAD: Remake","genre":"Action","price":0.0,"description":"Nobody leaves here alive!\nThe House of the Dead: Remake is a remade version of the game introduced in 1997 in arcade platform. A classic arcade rail-shooter receives a whole new entourage and gameplay changes to suit modern gaming standards.\n\nHordes of the undead monstrosities in a fast-paced rail-shooter. \nTrue to the original gameplay. \nWell know arcade classic with modern graphics and controls. \nMultiple endings.","imageUrl":"https://media.rawg.io/media/screenshots/afa/afa033ebee8e18662f3680ed111b98d2.jpg","releaseYear":2022,"developer":"Megapixel studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":560741,"name":"The Shore","genre":"Action","price":0.0,"description":"THE SHORE is a first-person story-driven game with an atmospheric environment and narrations, You will encounter mysterious creatures and unravel the secrets behind them. Strong elements of horror, struggle to survive an unknown world that will make you question your own sanity.","imageUrl":"https://media.rawg.io/media/screenshots/a79/a792798ea5a09767c334aae7d84aeb2e.jpg","releaseYear":2021,"developer":"Ares Dragonis","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":553026,"name":"我的上司有點不正常","genre":"Casual","price":0.0,"description":"game introduction\n\"My boss is weird\" is a game that AVG chooses to play as the core. The game tells about a white man who is suspected to be a peeper for no reason, in order to prove his innocence. In the game, players will face a series of choices, some of which seem small, but lead to different results.\n*Multiple choice narrative experience: one main line and several plot lines enrich the player's experience\n*Card selection interaction: while the game plot is advancing, the players need to make a choice through the cards. Every choice has an impact on your emotional intelligence, good will, physical strength and money. Whether you choose to surrender or fight, it's all at your fingertips.\n*For the first time, comics, games and interactive narration are combined to let players experience different feelings\n*The Japanese sound is excellent.\n*The game currently only has the first chapter content, and subsequent chapters will be gradually opened.\nCharacter introduction","imageUrl":"https://media.rawg.io/media/screenshots/dd3/dd353ad6c76d5d0fb4a32fc3128f22e5.jpg","releaseYear":2021,"developer":"ohiyosoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":428836,"name":"Fault","genre":"Action","price":0.0,"description":"Fault is a next-gen multiplayer online battle arena game.\nPlayers enter a 5v5 online match, where they choose a hero from their unlocked hero pool to play for that match. The hero is upgradeable over the course of the game, growing in strength through acquired experience and purchased items. The two teams compete to destroy their opposing team’s \"core\". The victors receive increased rewards toward account progression as well as increased in-game currency toward unlocking heroes and cosmetics.\nA unique gameplay element that separates Fault from other MOBAs is the introduction of a feats system, which allows a player to gain strength by achieving milestones during a match. Accomplishing a feat earns the hero favor which can be allocated into the factions the player chose at the beginning of the match. Having high favor in factions unlocks additional strength from the legendary items that are linked to the faction. On release (estimated for late 2020), the game will be free to play.","imageUrl":"https://media.rawg.io/media/screenshots/35b/35ba0f6b8be99e14ef66a4ab9beb5ee8.jpg","releaseYear":-1,"developer":"Strange Matter Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":301631,"name":"Misadventures of Laura Silver: Chapter I","genre":"Indie","price":0.0,"description":"Cheb, Czechoslovakia, 1935.\nDuring the interwar period, detective and gun enthusiast extraordinaire Laura Silver and her companion, former police officer Orewell Cooper, are sent to Czechoslovakia to a rather peculiar investigation. Their target? A mysterious creature lurking in the murky waters of Cheb.\nAfter their arrival, they are ready to investigate, disguised as two journalists. However, following a suspicious death in the hotel, their plans are interrupted.\nAlso, who is this lost child sitting out in the cold?Features\n70.000+ words.\nEight hours of total gameplay.\nOver 100 decisions.\nMultiple endings.\nAvailable for Windows, Mac & Linux.","imageUrl":"https://media.rawg.io/media/screenshots/1ac/1acbc0493f0c02c6b240d7766ceb5e1b.jpg","releaseYear":-1,"developer":"Studio Attic Salt","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":294139,"name":"Intruder","genre":"Action","price":0.0,"description":"Intruder is the stealth multiplayer experience. We were inspired by the great single-player campaigns of Metal Gear Solid, SWAT 3, Deus Ex, and Splinter Cell, and aim to bring that gameplay into a team-based multiplayer shooter. Intruder allows for stealth, teamwork, tactics and environmental interactions never before seen in a multiplayer game. Lure enemies into motion-detectors near explosive traps. Watch enemy movement through live security cameras and alert your teammates using the hand radio. Use real SWAT hand signals to communicate silently when enemies are nearby. In Intruder, amazing stories and emergent gameplay come from the players’ actions to provide an experience you will never forget.Key FeaturesTeam-based stealth multiplayer: Guards vs. Intruders.\nImmersive FPS: climb, crouch, crawl, and swim through the environment.\nUse gadgets to trick, trap, distract and outsmart your opponents.\nEavesdrop on the opposing team with spatial 3d voice chat.\nUse ragdoll physics to launch your foes out of windows or to play dead while the enemy walks right past you.\nTruly interactive buildings with working security cameras, spotlights, sliding windows, ventilation shafts, and elevators.\nStealth-based missions with multiple objectives and escape routes.\nPowerful Unity3d level editor plugin to create your own Intruder maps and game modes\nRegular updates and new features based on community feedback!Quotes from Intruder players\n... now on Steam!","imageUrl":"https://media.rawg.io/media/screenshots/726/726cd4aa6efa29853d986f2989f1a754.jpg","releaseYear":-1,"developer":"Superboss Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":277968,"name":"隐形守护者 The Invisible Guardian","genre":"Adventure","price":0.0,"description":"总有一种理想，值得我们为之守护……你是否曾经幻想在抗战年代，独自潜伏于多方黑暗势力之中，成为一名隐形守护者，为抗战胜利奉献青春甚至牺牲生命？\n时代、信仰、忠孝、情义、爱恨、恩仇、人性……万象艰险之中，当你置身于两难境地之时，究竟该如何选择？乱世谍战，守护初心，看地下英雄如何周旋于各方势力！获取情报，扭转乾坤，你的选择诞生百千种生死剧情！踏上隐形的战场，这个使命你能否完成？这个秘密你能否守护？\n人间正道是沧桑，谨以此作品向曾经奋斗在秘密战线的无名英雄们致敬！\n剧情背景\n你叫肖途，两年前的你，还是上海一个名慷慨激昂的爱国学生，在街头奔走疾呼“抗日救亡”，却因年少血气方刚，被逮捕入狱。释放后老师安排你去往日本留学，两年后，你当年的爱国学生形象早已被人们遗忘，老师与组织决定让你打入敌人内部，你要如何机智地扮演好这个“谍中谍”？面对一个个艰难的选择是顾全大局还是心慈手软？\n一起回到战火纷飞的动荡年代，成为一名隐形守护者，亲身体验步步为营的谍战人生。你的每一个选择都将影响结局的走向，上百种分支剧情等你解锁！三大完全不同的大结局让你感慨万千！","imageUrl":"https://media.rawg.io/media/screenshots/94e/94e8ed071749449cf4d5208512088b48.jpg","releaseYear":-1,"developer":"New One Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":63698,"name":"NYKRA","genre":"Adventure","price":0.0,"description":"An existential narrative-driven sci-fi adventure platformer, set in the first born galaxy called \"Nykra\". You experience Keu's journey from afar, as the Heptaverse unravels in front of your very eyes. The story embraces the many layers of the mind, and tackles the hypothetical feeling of having no purpose. But as you read through the alien literature, discover archaic long lost ruins, and delve your thoughts into the unfamiliar languages of the galaxy, you start to realise the 'dark virus' people fear might not be what you expect, at all.","imageUrl":"https://media.rawg.io/media/screenshots/a16/a1637f414ed499b1f7aebdbd3ca772c9.jpg","releaseYear":2021,"developer":"ENDESGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":50054,"name":"Old School Musical","genre":"Action","price":0.0,"description":"Old School Musical is retro rhythm game that will take you back to your childhood!\n\nTib and Rob are the heroes of an eccentric adventure that will make them across numerous worlds searching for the source of all bugs.\n\n- 20 Original Levels\n- 50 chiptune tracks\n- Story Mode\n- Hidden Mini-games\n- Chickens","imageUrl":"https://media.rawg.io/media/screenshots/fe6/fe6d70f49609a1714f7f2c483de1eef4.jpg","releaseYear":2018,"developer":"Plug In Digital","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":47078,"name":"Harald: A Game of Influence","genre":"Strategy","price":0.0,"description":"BE THE MOST INFLUENTIAL PLAYER TO WIN THE KING'S FAVOR:\nHarald is a card game of influence and majority. As the head of a village, each player will try to charm the most influential character of the realm to be noticed by the King and win his favor. But to win you will need to think and wisely use the abilities of each character.\nLEARN HOW TO USE THE CHARACTERS AND THEIR POWERS!\nEach turn, players execute three actions in order:\n- play one card in the King's council\n- play one card in the player's village\n- draw cards to replenish your hand\nThere are six different characters, each with a different function and power. Discover the Wolf/scout, the Lynx/merchant, the Fox/bard, the Bear/warrior, the Goat/seafarer; the Boar/blacksmith. Discover each character's ability and use them in order to overtake your opponents!\nEach animal will give you the ability to make a move at the end of your turn: you can steal cards from your adversary, try to exchange his or your cards with the council in order to play in your favor, return cards to erase their points or just place a good card on the top of the pile! Whatever you choose, decide wisely how to make the most of every move!\nSCORE AS MANY POINTS AS YOU CAN!\nThe goal is simple: get the maximum number of points! In order to win, you need to pay attention to the cards' associations and put together the ones that work best.\nAt the end of the game, each card in the village of a player counts as many points as the number of times the same card appears in the King’s council. Play smartly in both your village and the council and don't forget to keep an eye on your opponents' villages in order to win.\nEXPERIENCE MORE STRATEGY WITH THE BADGER/SCHOLAR!\nDiscover an exclusive card, which introduces a new character, the Badger/Scholar. This card offers you the possibility of protecting a series of characters in your own village. It makes the game harder for your opponents because if they want to destroy those cards, they will have to attack the Badger/Scholar first if he is present!\nFEATURES:\n• Solo mode\n• Online multiplayer mode: includes a mini chat to share emoticons while playing\n• Unlock beautifully illustrated cards based on the original card game\n\nLanguages available: English, French, German, Italian, Spanish\"","imageUrl":"https://media.rawg.io/media/screenshots/437/4378dcdfb369215ad553818f31c77a07.jpg","releaseYear":2017,"developer":"Asmodee Digital","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]}]