[{"id":24356,"name":"NBA 2K11","genre":"Sports","price":0.0,"description":"The greatest basketball player of all time debuts for the first time in\nthis hardware\n\ngeneration and brings his passion for the game to NBA 2K11 with an all\nnew Jordan Challenge mode, historic Bulls teams, and even a MJ: Creating\na Legend mode offering gamers the chance to be a rookie Michael and\ncraft a new career for him. This is on top of improvements to core\ngameplay elements – including an all-new IsoMotion dribbling controls,\ndeeper My Player mode with new My Career feature, all-new breathtaking\nvisuals, and much more.\n\nFeatures\n\n• Jordan Challenge – Relive 10 games from MJ's career\n•\nHistoric Chicago Bulls Teams – Play as MJ's old teams.\n• My\nJordans – Collect the Air Jordan shoes that MJ wore.\n• MJ:\nCreating a Legend – Take control of a rookie MJ.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","imageUrl":"https://media.rawg.io/media/games/39b/39b9302196e95461b7fb06fc09013768.jpg","releaseYear":2010,"developer":"Visual Concepts","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":23391,"name":"Steambirds Alliance","genre":"Action","price":0.0,"description":"Steambirds Alliance is a massively-cooperative bullet-hell shooter! Fly with dozens of friends in an open world full of cruel bosses and endless cascades of deadly bullets. We’ve got a big main world, hundreds of unique enemies, a wide variety of secret missions, and many distinct plane types for you to unlock and master. But fair warning: Steambirds Alliance is a permadeath game - when your plane is shot down, it will be lost to you forever! (However, your pilot will eject and potentially level up if you've fought bravely enough!)\nSteambirds Alliance is brought to you by Spry Fox. We co-developed Realm of the Mad God, the first-ever MMO shmup, back in 2010. At the time, we called RotMG \"the most co-op game ever\", but we fully intend to top that with Steambirds Alliance!","imageUrl":"https://media.rawg.io/media/screenshots/10f/10f4126180bf8ab7ac1364f24722f396.jpg","releaseYear":-1,"developer":"Spry Fox","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":23052,"name":"An Elder Scrolls Legend: Battlespire","genre":"Action","price":0.0,"description":"When you buy this game, The Elder Scrolls: Arena and The Elder Scrolls Chapter II: Daggerfall will be added to your GOG.com account for free!\r\nFor years, you have trained to become an Imperial Battlemage, learning the ways of magic and combat to serve and defend the Emperor. Now, as your final test, you must complete the dreaded Battlespire, facing the challenges that lie within. As you enter the proving ground, however, something doesn’t feel right. You soon discover that Mehrunes Dagon, a Daedra Lord, has invaded and ravaged the Battlespire, killing all in his wake. You are the last hope and although ill-equipped and unprepared, it's up to you to stop Dagon’s plan and restore the Battlespire to Imperial control.\r\nOriginally envisioned as an expansion for The Elder Scrolls: Daggerfall, this installment was instead released by Bethesda as a stand-alone title. Although still within the Elder Scrolls world and brimming with many loved elements, Battlespire is unique in several aspects; rather than open-world exploration, the game emphasises survival, taking players through 7 levels, including various realms of Oblivion. There are also no shops or merchants, leaving players to salvage whatever they can from their fallen foes. Full character and stat customisation are still a key component of gameplay, as is the ability to craft spells on the fly and the game is full of the lore and characterisation for which the series’ is renowned. Can you defeat Dagon and prove you are worthy of serving the Emperor?Traverse the world of Battlespire, from the depths of its sinister dungeons to the heights of its towering castles, in your quest to stop Mehrunes Dagon and his forces\r\nCreate your champion using the unique character design system, with unrivaled power to custom-build the exact type of hero you want, based on the Daggerfall game system\r\nThe custom SpellMaker system allows you to customise your own magic spells on the fly\r\nDo battle with numerous fiendishly rendered original monsters and complete cunningly-crafted tactical challenges and action puzzles","imageUrl":"https://media.rawg.io/media/games/7d4/7d44a49b6d822c915f98023db33e4ad4.jpg","releaseYear":1997,"developer":"Bethesda Softworks","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20882,"name":"Black Sails - The Ghost Ship","genre":"Adventure","price":0.0,"description":"Best played with the lights turned off and the volume turned up, Black Sails is a creepy and mysterious point-and-click adventure game.\nA shipwreck. Having lost all hope, two survivors cling to wreckage, trying to survive a few more minutes in the raging sea. Until another ship appears. Hoping for rescue, they are calling out, but nobody answers. They manage to go on board. Will this be their rescue? Or their grave?\nInspired by a true story, the player experiences a journey into the darkest abyss of the human soul until he cannot tell between truth and fiction anymore.\nHaving been released in Germany a few years ago, gathering much acclaim for its focused story and strong plot, Black Sails is now available with full English localization for the first time ever. We hope you'll enjoy it.\nFeatures\nFull English speech and text\nDense atmosphere\nA mysterious sailing ship to explore freely\nFocused on the fate of two main characters, Anna and Lex\nDisturbing dream sequences\nDecisions affect the characters' relationship and the game's outcome\nClassic point-and-click controls\nHint functionality (but not too many!)\nCreepy soundtrack","imageUrl":"https://media.rawg.io/media/screenshots/465/465ea34cfa77cdf6851479aab61e3fe7.jpg","releaseYear":2015,"developer":"Deck13","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20257,"name":"Agarest: Generations of War 2","genre":"Adventure","price":0.0,"description":"THE THIRD INSTALMENT IN THE THRILLING AGAREST SERIES!\nFollowing the huge successes of the number 1 Steam top selling epic SRPG, Agarest: Generations of War and its prequel Agarest: Generations of War ZERO, Ghostlight are proud to release the massively updated sequel to the series, Agarest: Generations Of War 2!\nThis sequel was previously only available on PlayStation® 3 but now comes to STEAM bringing with it a host of new features, visual improvements and an enticing blend of in-depth strategy and multi-generational storytelling!\nAgarest: Generations of War 2 is set in a parallel world to the previous two Agarest titles and has a completely new multi generational story and universe to explore.  So while existing fans of the series will of course see some familiar features and faces popping up, newer players will not need to have played the previous games to understand and enjoy this instalment of the story.\n…One day, the world was enveloped by a mysterious blinding light causing terrible destruction.  The central continent, from where the light is believed to have originated, fell silent and slowly, demons began to emerge and spread throughout the world like a plague.\nSometime afterwards, a young man by the name of Weiss, suffering from amnesia, encounters the enigmatic Eva who tells him that he has committed the sin of deicide.  In order to atone for his crime he learns that he must become the \"Vessel\" in which the power of the divinity he slaughtered is to be stored.  This power will be used to resurrect the one whose life Weiss stole, for those who betray the divine will pay for their sins in the space which separates salvation and damnation, as will their progeny...\n•\tNew Agarest Universe: Roam freely and watch the story unfold in this newly designed Universe and battle colossal enemies in over 80hrs of compelling gameplay!\n•\tRevamped Battle System:  Engage your ultimate warriors in a new faster paced combat system with real tactical depth and a wealth of character customisation\n•\tHD Graphics: Enjoy the all-new environments, CGs and your favourite animated character portraits in stunning high-definition\n•\tMini-games: Engage in Bathtub, Shiatsu, and Massage mini-games!\n•\tSoul Breeding Returns: See your favourite heroines evolve over several decades through each passing generation\n•\tChoose Your Path:  It’s not just the heroines you unite with but also the choices you make that will significantly change the outcome of the story.\nThis new version has full mouse/keyboard and gamepad support, Steam achievements, higher resolutions and a number of other user interface changes providing PC gamers with the best version of Agarest 2 to date.  Cloud Saves are also supported as are Steam trading cards, backgrounds and icons while a wealth of DLC is included in the game completely free of charge with other packs available to purchase separately following release.  Plus the new DLC system gives you control over how your downloaded content is managed, enabling you to pick and choose how it is added to your existing saves.Included Free DLC\nAdd-On Dungeon 1 Lucrelia – Extra Dungeon\nBonus Point Pack 1 – Contains 5,000G, 50PP and 500TP.\nBonus Point Pack 2 – Contains 100,000G, 100PP and 10,000TP.\nNovice Hunter’s Survival Pack – Contains 4 Grass, 3 Relief Grass, 4 Cure Grass, 3 Blessed Leaf, 2 Fragments of Life and 1 Syrum Dust.\nRight to the Blacksmith Pack 1 – Contains 5 Flame Elements, 5 Ice Elements, 5 Elements of Thunder, 5 Elements of Wind, 5 Earth Elements, 5 Darkness Elements and 5 Elements of Light.\nRight to the Blacksmith Pack 2 – Contains 10 Silver Ore, 10 Platinum Ore, 5 Bauxite, 5 Trogtalite, 5 Magnetite, 5 Dolomite and 5 Pileroth.\nTroglodyte Pack – Contains 1 Rusty Sword, 1 Rusty Bracelet, 1 Rusty Ring, 1 E. O. M., 1 Black Bustier and 1 Big Black.\nSkilled Hunter’s Survival Pack – Contains 3 Recovery Grass, 2 Relief Herb, 3 Magic Herb, 2 Revitalizing Herb, 3 Blessed Fruit, 2 Stone of Life, 1 Marfile Seed and 2 Divine Branch.\nAdd-On Dungeon 2 Graccea – Extra Dungeon\nOvertake Your Rival Pack 1 – Contains 2 Strength Up, 2 Vitality Up, 2 Intelligence Up, 2 Mind Up,2  Agility Up, 2 Dexterity Up and 2 Max HP Up.\nPriscilla Can Do It Pack – Contains 1 Princess Bustier, 1 Imperial Guard, 1 Levitation Stone and 1 Princess's Tiara.\nRight to the Blacksmith Pack 3 – Contains 5 Flame Soul, 5 Ice Soul, 5 Thunder Soul, 5 Wind Soul, 5 Earth Soul, 5 Darkness Soul, 5 Light Soul and 2 Damascus.\nRight to the Blacksmith Pack 4 – Contains 10 Silver Bullion, 10 Platinum Bullion, 4 ATK Element α, 4 DEF Element α, 4 MAG Element α, 4 RST Element α, 2 Unicorn Horns and 2 Moonlight Flowers.\nAdd-On Dungeon 3 Enhambre – Extra Dungeon\nOvertake Your Rival Pack 2 – Contains 2 Strength Up+, 2 Vitality Up+, 2 Intelligence Up+, 2 Mind Up+, 2 Agility Up+, 2 Dexterity Up+ and 2 Max HP Up+.\nRight to the Blacksmith Pack 5 – Contains 4 Strength Element α, 4 Vitality Element α, 4 Intelligence Element α, 4 Mind Element α, 4 Agility Element α, 4 Dexterity Element α, 2 Moon Fragments and 2 Dragon Fruits.\nRight to the Blacksmith Pack 6 – Contains 5 Flame Crystals, 5 Ice Crystals, 5 Thunder Crystals, 5 Wind Crystals, 5 Earth Crystals, 5 Darkness Crystals, 5 Light Crystals.\nVeteran’s Survival Pack – Contains 3 Remedy Herbs, 2 Relief Kraut, 2 Elixir, 1 Elixir of Life, 2 Blessed Flowers, 1 Vessel of Life and 2 Bijou Root.\nRight to the Blacksmith Pack 7 – Contains 10 Mithril Ore, 10 Orichalcum Ore, 2 Keys of the Moon, 2 Keys of the Sun, 2 Crescent Moon Rocks, 2 Imperial Jewels, 2 Magic Crystal Chips and 2 Meteoric Irons.\nRight to the Blacksmith Pack 8 – Contains 3 Cuprum, 3 Argentum, 3 Stannum, 3 Breunnerite, 3 Galena, 3 Aurum, 3 Iron Roze, 3 Hideralzentum and 2 Shining Fangs.\nRight to the Blacksmith Pack 9 – Contains 1 Shining Blade, 1 Ring of Light, 1 Mysterious Jewel, 1 Genbu's Bowl, 1 Seiryuu's Eye, 1 Byakko's Crest, 1 Suzaku's Wing, 2 Generation Crystals and 2 Whispered Dreams.\nRight to the Blacksmith Pack 10 – Contains 2 ATK Element Ω, 2 DEF Element Ω, 2 MAG Element Ω, 2 RST Element Ω, 2 STR Element Ω, 2 VIT Element Ω, 2 INT Element Ω, 2 MND Element Ω, 2 AGI Element Ω and 2 DEX Element Ω.\nRight to the Blacksmith Pack 11 – Contains 1 Kagetsu's Light, 1 Fairy Cloth, 1 Tree Frost Drop, 1 War God's Crown, 1 Blue Ribbon, 1 Divine Crest and 1 Lapis Noster.\nFour Divine Beasts Pack – Contains 1 Genbu's Gauntlet, 1 Seiryu's Sword, 1 Byakko's Bracelet, 1 Suzaku's Ring, 1 Funky Chicken and 1 Chicken Ring.\nUnlock Character Galleries - This will unlock all of the gallery items for the downloadable characters.","imageUrl":"https://media.rawg.io/media/screenshots/45f/45f8e353ba61f1f52370e2384fbd5d4e_5xs2FDw.jpg","releaseYear":2015,"developer":"Idea Factory","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":19392,"name":"Blood II: The Chosen + Expansion","genre":"Action","price":0.0,"description":"In a time of turmoil and decay, a dark organization with a sinister agenda casts its shadow over the world. But as their plot unfolds, an even greater evil pushes its twisted being at the very bindings of reality... Filled with hate and vengeance, Caleb has returned to face the Cabal and its minions once again - and this time he's not alone. Can he hold the Chosen together long enough to reclaim the Cabal and the heart of his one true love? Or will his actions destroy them all?","imageUrl":"https://media.rawg.io/media/screenshots/d96/d963bf46c28be2e56a3f9cf2a0b03bec.jpg","releaseYear":2014,"developer":"Monolith Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16892,"name":"Rescue Team 5","genre":"Adventure","price":0.0,"description":"Join the world famous Rescue Team and set off on an adventure you'll never forget! Once again, people in peril are looking to the men and women of the Rescue Team to save them. Use your time management skills to work quickly to remove the obstacles that stand in your way, to rebuild ruined infrastructure, and most important of all, to free those in danger! As you make your way through a desert wasteland, snowcapped mountains, and a danger-filled jungle, saving lives and rebuilding cities with carefully planned clicks of your mouse, you'll earn over two dozen achievements that bear witness to your heroism! Your journey will end at the foot of a rumbling volcano that's threatening to blow. Can you make it there and save the day in the explosive finale? Join the Rescue Team today and find out!\nUpsell features:\n* Challenging levels\n* Simple mouse-based controls\n* Timed and untimed modes\n* Vibrant, colorful graphics\n* Learn-as-you-play tutorial","imageUrl":"https://media.rawg.io/media/screenshots/6a7/6a72b6d0ee5f205aa7ed49b3390eb210.jpg","releaseYear":2015,"developer":"Rionix","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16586,"name":"VOI","genre":"Casual","price":0.0,"description":"Do you think 1 + 1 = 0 is correct? So what do you think about \"black + black = white\" statement?\nVOI is relaxing minimal puzzle game based on XOR logic;\n0+0=0\n1+0=1\n0+1=1\n1+1=0\nVOI gives you a few draggable geometric shapes (triangle, square, rhombus, parallelogram etc.) to reach target shape. That's all. Do you think that the easy?\n* One page game (no start button, no exit button)\n* Cool music and fx\n* Use mouse wheel to scroll levels","imageUrl":"https://media.rawg.io/media/screenshots/d00/d00662b9bab517b0f8580d88fa8e6678.jpg","releaseYear":2016,"developer":"Yunus Ayyildiz","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15782,"name":"Void And Meddler","genre":"Adventure","price":0.0,"description":"\"One step closer to the blur\" she thought as she poured herself one last shot of whiskey, for the road. \"Sleeping pills and alcohol, perfect cocktail to forget memories you don't even have. How funny.\nOne last drop, close your eyes. A dreamless sleep, and the hope, the curse of being alive in the morning, with the certitude that everyday is exactly the same.\nShouldn't it be time for me to finally chase the past I gave up a long time ago? What a strange last thought, but it's getting dark, too dark to think... Maybe... Maybe tomorrow will bring more answers...\"\nShe fell in the majestic nothingness of the night while the singer on the old radio player was whispering his quiet prayer: \"I'll take the fate the daylight brings\".\nFragments and details, rainy nights and blurry lights are all VOID&MEDDLER focuses on. A single night intrusion into Fyn's life and hopes. Tired of the last two years she spent wandering without a goal and without memories, among disenchanted strangers, and pitiless scavengers, Fyn decided to put an end to all of this. She’ll have a few hours to make things right, and seek strong, pure and substantial memories. In a city where genders and species melt into each other, maybe she’ll find the long lost touch of humanity missing from her life.\nThe idea behind Void & Meddler was to create a game that looks like its creators, two musicians nurtured by noise rock from the 80's, synthwave, road trips and cyberpunk literature. Together, we conjured the narration, we created No Wave, we tamed the weird, we fucked in an orgy of wires, neons and white noise. Distance doesn’t corrupt anything. Amps were set aside for a while, and we dived head first into another sphere we loved, full of code, textures and pixel art.\nEnjoy Void & Meddler, an indie adventure game full of fuzz literature, pixel music and analog dreams.\nEPISODE 2 NOW AVAILABLE WITH THE SEASON PASS DLC.\nEPISODE 3 WILL BE AVAILABLE IN 2017.","imageUrl":"https://media.rawg.io/media/screenshots/2ad/2ad45d0814e93bc95843d529239ec7b3.jpg","releaseYear":2015,"developer":"BlackMuffin","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14050,"name":"Le Havre: The Inland Port","genre":"Strategy","price":0.0,"description":"Le Havre - The Inland Port: Finally on Steam!\nIn the award-winning board game, Le Havre: The Inland Port, you and your opponent compete in order to amass the most wealth by building up the iconic French port of Le Havre. The game can be played locally against the computer, in hot-seat mode or online -- competing against friends or global players in order to advance in the rankings. Drop in and out of play anytime and play an unlimited amount of games with your friends simultaneously, whenever you want.\nThe digital version of the award-winning 2-player board game by cult author Uwe Rosenberg (2013 nominated best for the Golden Geek 2-player board game in 2013, nominated for the International Gamers Award - Strategy Games: 2-player board games and winner of the International Gamers Awards - Strategy Games: 2 player board game).\nUse our convenient matchmaking service to challenge players of your skill level globally or play locally with a friend. You can also defeat one of the different computer opponents with varying difficulty.\nFeatures:\n- A careful conversion of the the award-winning board game\n- Comprehensive tutorial and straightforward rules\n- Drop in and out anytime and save your games in the cloud\n- Beautiful art and sound convey the atmosphere of a French harbor\n- Available languages: German, English, French, Spanish\n- Worldwide cross-platform leaderboards: Can you take the #1 spot?","imageUrl":"https://media.rawg.io/media/screenshots/4e3/4e3ab2d5ecec504e6b1cea42892115dd.jpg","releaseYear":2015,"developer":"Asmodee Digital","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":13840,"name":"TY the Tasmanian Tiger","genre":"Action","price":0.0,"description":"TY the Tasmanian Tiger 2: Bush Rescue In Early Access!TY2 is now available on Steam, in Early Access.\nTo get it, go here!\nAbout the Game\nSTONE THE CROWS! Are you ready to explore the wilds of the Australian Outback in this remastered version of the classic game, TY the Tasmanian Tiger?\nJoin TY on a RIPPER of an adventure to free his family from the DREAMING and stop the nefarious evil genius BOSS CASS from removing mammals from the top of the food chain.\nTo help you on your quest, you've got a BEAUT arsenal of boomerangs, sharp teeth, and the help of a few friends!\nSo don’t be a galah - let's head down under, and have a CORKER of a time! BEAUTY, BOTTLER, BONZA!\nExplore 17 levels of the Australian Outback in their old-school 3D platforming glory\n13 different boomerangs including the Frostyrang, Flamerang and powerful Doomerang\nImproved graphics; including updated shadows, reflections, HD resolutions and 60fps\nSteamworks integration for achievements and leaderboards\nG'day mate! Things can be a bit confusing at times, so let me remind you what's going on...\nYou are TY, the last of the Tasmanian Tigers. Raised by a family of Bilbies, you can only vaguely recall your real parents. You've always thought that all the other Tassie Tigers died a long time ago.\nBut then the Bunyip Elder found you, and told you that your family is alive, but trapped in the Dreaming. Now hold your horses... don't get upset... you see they're not stuck there forever, if you're up for a bit of an adventure!\nYou see, deep in the Outback, there's this kind of glowy portal thing that is a doorway to the Dreaming. And around that portal there are some carvings in the rock, where five ancient mystical Talismans used to lay. Now, all you have to do is find the five Talismans, put them in the carvings, and the portal to Dreaming will open!\nNow, before you go off like a frog in a sock, there's just this one SMALL problem. You see there's this evil cassowary - Boss Cass - who's also after the Talismans. Yes. THAT Boss Cass. The one that trapped your family in the Dreaming in the first place, and told the school board to remove all the meat pies from the tuck shops. And if you didn't think that made him enough of a megalomaniac, he's ALSO trapped a whole bunch of your Bilby mates in cages all across the outback... something about overdue library books... Anyways, if you want to open the portal, you'll have to beat him and his henchmen to the Talismans!\nDon't worry though, you won't be alone! You'll have a bunch of friends to help you along the way, including me - your old mate, Maurie. Now let's get down to brass tacks, find those Talismans, and rescue your family!","imageUrl":"https://media.rawg.io/media/screenshots/65a/65a3a703c7c7ea00674b8e5dea4f01f8.jpg","releaseYear":2016,"developer":"Krome Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13355,"name":"Call Of The Mighty Warriors","genre":"Strategy","price":0.0,"description":"From the genre of Tower Defense, in this game you will battle as an mercenary, hired by one of the kingdoms in war, the king demand you to command the mercenaries and defend strategic points with your experience on the battlefield in extremely dangerous places.\nPlace different towers around each level, your strategy can turn you into a hero of the kingdom.\nLots of levels in extreme places of the planet are awaiting for you, in each level you will encounter different terrains which will test your skills against the enemies of the kingdom.About the Gameplay\nEach level will be more difficult.\nSoldiers will appear often and outnumber.\nThe more you progress on the levels, more different will need to be your strategy to win.\nSome levels will be longer than others.","imageUrl":"https://media.rawg.io/media/screenshots/444/4442d10876138f92679787d8800fef1c.jpg","releaseYear":2016,"developer":"Camaquem","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10832,"name":"Armed with Wings: Rearmed","genre":"Action","price":0.0,"description":"You are the sword; cut down your foes with steel and thunder. You are the wings; explore the skies and uncover unreachable mysteries. Embark on a journey through a vicious world ruled by darkness and imperial tyranny – the lands of Blackmist.\nArmed with Wings: Rearmed is a 2D Action / Platformer rebirth of the original 2008 Flash Game where you command both samurai warrior and eagle.\nDarkness continues to plague the world of Blackmist. The Rebel Army is crushed, the war for freedom is lost and the Tyrant King Vandheer continues to rule with his cold, iron fist. However, the cries of the perished have not been ignored by the divine ones who seek to save the world from darkness. So by their hands the strongest of the fallen is resurrected, wielding celestial power and a sacred title, Armed with Wings.The SwordYour blade summons the power of lightning and thunder. Strike your foes and reduce them to mist.The EagleYour Eagle companion will aid you in solving puzzles on your journey. Discover what lies ahead, distract guards, move objects and collect unreachable items.The WorldThe dark world of Blackmist is a dilapidated ruin full of monsters, mercenaries and mysteries. Journey through 40 hand crafted levels brimming with thoughtful puzzles and challenging adversaries.The KingKing Vandheer resides in his palace waiting for your arrival. Execute the divine order and destroy Vandheer.\nElectrifying combat across 40 handcrafted levels.\nPlay as both warrior and eagle.\nMultiple modes including survival and multiplayer.\nStriking art style and fluid animation.\nXbox gamepad support\nUnlockable characters, weapons and more!\nTry the Free Survival Demo: Rearmed Trials","imageUrl":"https://media.rawg.io/media/screenshots/c0e/c0e2c2b9ebed23d86bef47de47350c33.jpg","releaseYear":2015,"developer":"Sun-Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10596,"name":"City Siege: Faction Island","genre":"Action","price":0.0,"description":"The ultimate 2D Physics War Game - War just got fun, build your army with tanks, guns, spies, flame tanks and helicopters. Then embark on missions of mass destruction and tactical rescues. Bring peace to faction island by destroying all your enemies!\nYour war starts with just a single rifleman, but soon you'll be rolling into battle with tanks, flame throwers and hover crafts. Fight your way through varying missions on Faction Island, all featuring destructable environments and dynamic gameplay watch as buildings fall down crushing your enemies and rewarding you with massive combos.  Expand your army with cash earned from completed missions by buying more heavy weaponry or powerful airstrikes to deliver death from above bringing battles to an indiscriminate finale.\nTake on timed, solo, stealth and all out warfare missions each requiring a different set of gameplay styles and tactics. Group your units create an army of devastating force as up to five of your troops wreak collective carnage upon the unfortunate enemy. Rockets, bullets, ninja stars and fire are all at your disposal but you'll encounter opposing factions with devastating and insane weaponry of their own. Bombs and bullets alone won't win this war strong tactics and skill will surely prevail.\nEnjoy City Siege Factions unique physics engine as each level serves as a destruction sandbox environment once you have successfully completed the mission.  Why not take your heavy weapons in to earlier levels and go for all-out destruction or try and beat your best time and highest score.  Every time you play a level, your units will level up and you will earn more cash to expand your forces, giving you the edge on later levels.\nAt the start of each level you can choose up to 5 units to deploy, you can switch between deployed units at will and can evacuate them and deploy other units from your reserves, allowing you to play each level your own way.  Develop your strategy and take full control of Faction Island.Features\nDestructive Gameplay.\nUsing the power of physics, every level features destructible scenery and buildings.  Set areas on fire, call in air-strikes and generally having fun blowing stuff up - but don't forget there are some real mission objectives to achieve, maybe stealth is the best option from time to time...\nCombo System.\nYour combo resets to 1 every time you fire.  Take out as many baddies with a single shot to score the most points, taking advantage of the combo multiplier.  Use the destructible environments to your advantage and get the biggest combo you can.\nInter-faction Fighting.\nYou have two enemy factions to contend with, the Natives and the Poachers.  Land a shot near an enemy and they will often blame the other faction and start fighting each other.  Incite the baddies to fight each other and save yourself the effort, as well as scoring more points and it all counts towards your combo.\n8 Units to buy and upgrade to build a complete army.\nRifleman\nThe basic unit you start off with.  His slow shooting auto-rifle holds 5 bullets before needing to be reloaded.  Good movement ability and, as with all foot soldiers, can swing on vines.\nMolotov Guy\nHighly explosive and damaging, the Molotov Guy is a danger to everybody on the battlefield - use with caution, will set fire to pretty much everything.  On the plus side he does come equipped with fire-retardant armour.\nSentry\nHeavily armoured, but slow.  Carries a devastating Chain-gun that will make short work of basically anything, although it's accuracy is kinda poor.\nSpy\nThe ultimate in stealth.  This unit blends in until she gets too close to the enemy or gets seen attacking.  Really useful on rescue missions.  Her Ninja stars are great for attacking baddies from behind and destroying certain structures, however, they just bounce off barrels so don't expect explosive combos with this one.\nFlame Tank\nKinda rickety and easily damaged, but it's Flamethrower makes short work of most buildings and bad guys.  Set the world on fire.\nTank\nThe toughest thing out there, although mobility is a little limited.  Also comes with a big, devastating gun firing big, explosive shells for maximum damage.\nHelicopter\nThe ultimate in mobility, equipped with a devastating heavy machine gun.  Group a few of these up for unrivalled power on the battlefield.\nHovercraft\nGlide over swamps, lava and water.  Armed with devastating rockets, but a narrow range of attack.\n8 varying location of Faction Island, each with 3 missions to master\nMercenary Camp\nYour part of the island.  Protect it from the enemy!\nOil Beach\nSums up why you are here - it's the natural resources!  You're drilling on Oil Beach and have a nice pipeline set up.  Defend the area from the Natives (who for some reason are not keen on our presence) and the Poachers.\nNo Mans River\nFight along the river, just watch out for those cunning baddies hiding under water.\nStompin' Swamp\nThat swamp isn't pleasant to be in, making everything except the Hovercraft slow to move.  Luckily there are lots of vines to swing on and get out of it.\nSacred Volcano\nThis area is sacred to the Natives, they come here to worship their Idols, which of course, must be destroyed.\nPoacher's Camp\nThis is where the Poachers have set up camp.  Drive them out and we can make use of the new space.\nNative's Camp\nThese Natives are savage and in need of \"educating\".\nCoastline\nWe need to secure the coast if we are going to completely control the Island and you will need Helicopters and Hovercrafts to do it.\nVarying Mission Types\nSecure the Area\nPretty straight-forward.  Just go in and destroy everything!\nDefend\nYou'll need to defend your base and oil wells.\nDestroy Objectives\nDestroy the enemy Idols and Cages.\nRescue Mission\nThe Natives and Poachers have kidnapped our Scientists and we need them alive!\nSolo Missions\nTake in a single foot soldier - you might need to rescue some scientists or defend a drill.\nSea Battles\nHovercraft or Helicopter only naval battle to secure the coast.\nReplayability and Tactics\nStruggling with a mission?  You maybe just need the right troop or tactics.  Replay earlier missions and earn cash to expand your forces, giving you more options.\nOften a tactical approach to a mission is required.  Select the correct units, scroll around and have a good look at the mission before you start.  And move slowly, thinking ahead.  This is all of course balanced with total destruction missions!\nSteam Features\nHigh Scores and Best Times a for every mission.  As long as you don't die during the mission you will register a score and time - so on some missions the best tactic for a top score or time is to ignore the mission and just destroy everything as quickly as possible!\nAchievements.  Can you unlock all the steam achievements?  Getting 3 stars on every level requires some genuine skill!\nCloud Saves.  Switch computers and pick up where you left off.","imageUrl":"https://media.rawg.io/media/screenshots/f46/f4636e94886757ed36787a793d80ba00.jpg","releaseYear":2017,"developer":"Ish Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":4730,"name":"Dungeon Hunter: Alliance","genre":"Action","price":0.0,"description":"- A unique multiplayer experience on PlayStation®Network: play locally with your friends, or team up online with players across the globe! Do your training and climb the ranks in the online leaderboards.\n- A real quest to complete solo or with others, spanning over 30 levels with an immense world of dungeons, villages and forests to explore, including areas that are randomly generated.\n- Graphics and special effects rivaling classic games (console), smooth animation even during multiplayer sessions, and an immersive dark gothic ambiance.\n- All the ingredients for a great role-playing game: choose your class, optimize your hero's development by assigning experience points to the attributes of your choice, and equip your hero with the best armor.\n- A fun \"hack & slash\" gameplay adapted to your preferences: choose between classic controls or innovative controls thanks to compatibility with the PlayStation®Move motion controller.\n© 2011 Gameloft. All Rights Reserved. Gameloft and the Gameloft logo are trademarks of Gameloft in the US and/or other countries. PlayStation®Move features require PlayStation®Move motion controller and PlayStation®Eye (sold separately).\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","imageUrl":"https://media.rawg.io/media/screenshots/9bf/9bf17af55dba0e49bb9259f62dafd6bc.jpg","releaseYear":2011,"developer":"Gameloft","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":4019,"name":"Fatal Frame II: Crimson Butterfly","genre":"Action","price":0.0,"description":"Twins Mio and Mayu enter a haunted village after falling under its spell.  Mio must follow Mayu with the Camera Obscura to protect her from the evil spirits.","imageUrl":"https://media.rawg.io/media/games/835/835a3253b3259ccdf518eb5b310ba2ee.jpg","releaseYear":2003,"developer":"Tecmo","libraryGames":null,"platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":3710,"name":"Raiden IV: OverKill","genre":"Action","price":0.0,"description":"Special Offer\nSpecial OST with a total of fantastic 27 music and Secret File PDF art-book will be placed in your Steam folder:\n...\\Steam\\SteamApps\\common\\Raiden IV Overkill\\Digital Extras\\\nAbout the GameOverrun and OverKill enemies with the Legendary Roar of Thunder!The series that changed the history of arcade shoot’em ups is back with the crazed action of Overkill mode! Master a variety of new weapons as swarms of enemy fighters try and put you down.\nEverything from fan favorites, such as the Spread Shot and Vulcan Laser, will be available, as well as new weapons and items! Instill fear in your enemies with devastating attacks and earn the acclaimed title of Master Ace!\nGame ModesOverKill Mode - a brand-new mode with new mission stages and a revamped scoring system!Additional Mode - Variation of Arcade Mode with 2 new stagesScore Attack Mode - High Score Mode for all stages including those from Overkill ModeArcade Mode - Arcade Mode that recreates the arcade experience with two difficulties: Light and OriginalWorld Rankings - Ranking mode that will place you among players from all over the world in Overkill Mode, Additional Mode, and Arcade Mode.Reply & Gallery - Watch Reply data and view items in the Gallery??? - A secret mode playable once you clear the gameFeaturesChallenging New Bosses and Stages - With new stages and never before seen bosses, experience the fast, blistering game play action that never gets old.Items, Weapons, and More - Unlock and master a variety of weapons, including fan favorites such as the Spread Shot and Laser, and never before seen weapons and items!Best Graphics to Date - The series has transitioned from its 2D roots to 3D, creating lush environments, devastating explosions and countless enemies, without a drop in frame-rate.","imageUrl":"https://media.rawg.io/media/screenshots/c80/c8057dd78a32e2963dd3cd90d6fbbc89.jpg","releaseYear":2014,"developer":"UFO Interactive Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":1056,"name":"Battlezone","genre":"Action","price":0.0,"description":"Strap into the cockpit of the Cobra – the most powerful tank ever built – and experience first-person VR combat across neon-scarred sci-fi landscapes in an explosive campaign for 1-4 players.\nLoad your tank with a wide range of devastating weapons and power-ups, and blast your way to a colossal final showdown.\nEPIC VR TANK WARFARE\nBattlezone offers unrivalled battlefield awareness, a monumental sense of scale and breathless combat intensity.\nLIMITLESS SOLO & CO-OP PLAY\nExperience a thrilling campaign for 1-4 players where different environments, enemies and missions blend together across a procedurally generated campaign. No two playthroughs will be the same!\nDEVASTATING ARSENAL\nUnleash destructive weapons and awesome special equipment, from laser-guided missiles and rail guns to EMPs and shield boosts\nCUTTING-EDGE UPGRADES\nUnlock more powerful tanks, weapons and special equipment and pick from hundreds of deadly combinations!\nCLASSIC MODE\nExperience where it all started with Classic Mode – featuring original two-track controls and worldwide leaderboards to test yourself against!","imageUrl":"https://media.rawg.io/media/games/a9f/a9fac09535481da3f092b68162dbac20.jpg","releaseYear":2017,"developer":"Rebellion","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":912,"name":"Super Dungeon Bros","genre":"Action","price":0.0,"description":"Embark on a quest from the gods of rock with heavy metal heroes Axl, Lars, Freddie and Ozzie in Super Dungeon Bros, a fast paced, action focused, rock themed dungeon brawler!Super Dungeon Bros BroverviewPlay on your own or with up to 4 friends in couch or online co-op as you raid the deepest dungeons of Rökheim in search of epic loot, hordes of evil undead and the legends of long lost fabled rock stars! Wield wicked weapons with devastating destruction or exploit the punishing puzzles and terrifying traps that will slice and dice foes and bros alike.  Fling your friends onto far off ledges and distant trap triggers, hurl your bros at advancing attackers or unleash your tag team tactics with the ultimate bro-op offensive!\nIf really you’re up for the challenge, test your heavy metal in the deadly daily dungeon or master the way of the wicked weekly dungeon and climb to the peak of the global leaderboards.\nJust remember, always put your BrosB4Foes!Super Dungeon Bros Key FeaturesMultiple WorldsExplore the rock themed realm of Rökheim and dive deep into the worlds of Cryptheim (an underground dungeon complex), Chillheim (a brewery built upon a natural brew geyser) and Bogheim (a sprawling jungle filled with poisonous plants and animals).\nBetter with Bros!Play with up to 4 friends or venture into the deepest depths of Rökheim alone in scary single player.\nOnline & Couch Co-OpRaid the dungeons of Rökheim in on or offline co-op multiplayer with cross platform play between Xbox One & Windows 10 or PS4 and PC/Mac.\nEndless Dungeon CombinationsNever rock the same dungeon twice thanks to the random room generation AI, with unlimited dungeon designs.\nRoguelike PlatformingExploit the punishing puzzles with deadly effect or harness the terrifying traps that will slice and dice foes and bros alike!\nWicked WeaponsChoose from a range of wicked weapons over 4 weapon classes including swords, crossbows, hammers and wands as you plunder the darkest depths of Rökheim in search of epic loot!\nMini MissionsMaintain your game with regular mini missions to increase your wealth and in game arsenal!\nDaily & Weekly DungeonsCompete with friends from around the world in the deadly daily dungeon or master the way of the wicked weekly dungeon to climb to the peak of the global leaderboards.\nRock the Night AwayEpic boss battles and a cast of fiendish foes compliment a totally rocking soundtrack!","imageUrl":"https://media.rawg.io/media/screenshots/b50/b506fe9b08546ba477a561d9ca5f572d.jpg","releaseYear":2016,"developer":"Wired Productions","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":415,"name":"Clash Royale","genre":"Action","price":0.0,"description":"Enter the Arena! From the creators of Clash of Clans comes a real-time multiplayer game starring the Royales, your favorite Clash characters and much, much more.\nCollect and upgrade dozens of cards featuring the Clash of Clans troops, spells and defenses you know and love, as well as the Royales: Princes, Knights, Baby Dragons and more. Knock the enemy King and Princesses from their towers to defeat your opponents and win Trophies, Crowns and glory in the Arena. Form a Clan to share cards and build your very own battle community.\n\nLead the Clash Royale Family to victory!\nPLEASE NOTE! Clash Royale is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Clash Royale.\n\nA network connection is also required.\n\nFEATURES\n● Duel players from around the world in real-time and take their Trophies\n● Earn chests to unlock rewards, collect powerful new cards and upgrade existing ones\n● Destroy opponent’s towers and win Crowns to earn epic Crown chests\n● Build and upgrade your card collection with the Clash Royale Family along with dozens of your favorite Clash troops, spells and defenses\n● Construct your ultimate Battle Deck to defeat your opponents\n● Progress through multiple Arenas all the way to the top\n● Form a Clan to share cards and build your very own battle community\n● Challenge your Clanmates and friends to a private duel\n● Learn different battle tactics by watching the best duels on TV Royale\nSupport\nAre you having problems? Visit http://supercell.helpshift.com/a/clash-royale/ or http://supr.cl/ClashRoyaleForum or contact us in game by going to Settings > Help and Support.\nPrivacy Policy:\nhttp://supercell.com/en/privacy-policy/\nTerms of Service:\nhttp://supercell.com/en/terms-of-service/\nParent’s Guide:\nhttp://supercell.com/en/parents/","imageUrl":"https://media.rawg.io/media/games/a11/a11912ae667ce96c98619f018ead97ae.jpg","releaseYear":2016,"developer":"Supercell","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":972167,"name":"An Arcade Full of Cats","genre":"Casual","price":0.0,"description":"MORE DEVCATS GAMES\nAbout the Game\nPrepare for a gaming journey with a time-traveling twist in \"AN ARCADE FULL OF CATS.\" Join Leo and Fofiño as they navigate a feline-infused version of the arcade era, spanning from 1980 to the year 2000, all while attempting to find their way back to the present!\nEmbark on a quest to discover hidden cats in five distinct scenarios, each representing a catified rendition of classic arcades. Get ready for the ultimate pet'em up!\n\"AN ARCADE FULL OF CATS\" Features...\nTime-Traveling Fun: Explore a charmingly reimagined arcade era, from the nostalgia of 1980 to the dawn of the new millennium, as you assist Leo and Fofiño on their journey back home.\nHidden Cat Hunt: Search high and low for hidden feline companions across five captivating scenarios, each with its unique surprises.\nWhisker-Worthy Arcades: Visit five classic arcades, transformed into delightful cat-themed versions!\nGet ready to traverse time and enjoy endless hours of cat-seeking amusement in \"AN ARCADE FULL OF CATS.\" The ultimate pet'em up and our tribute to the Arcade Era!","imageUrl":"https://media.rawg.io/media/screenshots/cec/cecb470cf89dfe78e8a1ded91298671a.jpg","releaseYear":2023,"developer":"Devcats","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":959748,"name":"Otxo","genre":"Action","price":0.0,"description":"OTXO (pronounced oh-cho) is a violent top-down shooter with roguelite elements. Play as the protagonist entering an inexplicable mansion in search of his lost love. As you venture deeper into the Mansion, more of its secrets will be unveiled to you.\nFeatureless, unnamed, and without memories of how you came here… but you remember why. She’s waiting for you somewhere in this Mansion and you cannot leave until you find her. Cut your way through various unique areas and meet new allies as you delve deeper into the mystery, face your inner demons, and annihilate them.\nWith a massive variety of guns, over 100 abilities, and Focus to dodge bullets at your disposal, kick down doors and eviscerate the variety of enemies standing in between you and your mission.\n◼ Tons of replayability: OTXO will take the player through 8 areas with a randomly laid out selection of rooms out of the over 150 hand-crafted rooms built in the game. No two runs of the game will be the same.\n◼ Customization: Find the setup that’ll help you break the cycle from a whole selection of unlockable weapons and over 100 acquirable abilities from the game’s enigmatic bartender.\n◼ Playstyle: With the slow-mo mechanic, Focus, at your disposal OTXO will make the player feel powerful and in control. However, be careful because the variety of enemy types thrown in your way can quickly turn the tides of the combat if you don’t adapt accordingly.\n◼ Soundtrack: Fully immerse yourself into the brutal noir-esque murder ballet through the gritty pulse pumping soundtrack composed by the developer himself.","imageUrl":"https://media.rawg.io/media/games/e31/e31eafe3db5780ed6d02d6d306aba88f.jpg","releaseYear":2023,"developer":"Lateralis Heavy Industries","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":801512,"name":"Minecraft Legends","genre":"Adventure","price":0.0,"description":"Discover the mysteries of Minecraft Legends, a new action strategy game. Explore a gentle land of rich resources and lush biomes on the brink of destruction. The ravaging piglins have arrived, and it’s up to you to inspire your allies and lead them in strategic battles to save the Overworld!","imageUrl":"https://media.rawg.io/media/games/a52/a52652c3f5e666bf0c16797ba175b034.jpg","releaseYear":2023,"developer":"Mojang","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":668024,"name":"Catto Boi: Journey to Catto Land","genre":"Action","price":0.0,"description":"Catto Boi is called upon to travel to the fabled Catto Land!\nBut as he gets there, he falls asleep and has a dream...\nWarning: This game is not suitable for children under the age of 16 or those who are easily disturbed.\nCheck out the fourth game!\nhttps://gamejolt.com/games/catto-boi-the-quest-for-the-frozen-tuna/626034\nJoin my community Discord!\ndiscord.gg/E6ZuKH9\nJoin the subreddit if that's your thing!\nhttps://www.reddit.com/r/cattoboi/\nCredits: in the game lol\nSystem requirements: https://pastebin.com/uGzjETsK","imageUrl":"https://media.rawg.io/media/screenshots/b33/b3322558bc923b8b1d2bbc8073726b31.jpg","releaseYear":2021,"developer":"Tamago-iku","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":426098,"name":"TrackMania (2020)","genre":"Racing","price":0.0,"description":"Ubisoft Nadeo returns with the biggest and most compelling remake of the legendary Trackmania Nations.\nIn Trackmania you will discover a brand new virtual formula, a sports-oriented stadium, new creation blocks and extra game features.","imageUrl":"https://media.rawg.io/media/games/f30/f302e10098eddb41ccea480b189746bc.jpg","releaseYear":2020,"developer":"Nadeo","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":395195,"name":"Halo 2: Anniversary","genre":"Action","price":0.0,"description":"Celebrating Halo 2’s anniversary, the iconic fan favorite returns, featuring a fully re-mastered campaign and multiplayer with “Classic Mode,” letting you switch instantly between the re-mastered game and the original game from 2004.","imageUrl":"https://media.rawg.io/media/games/fc6/fc63fb73da1edb6e18d4387a971f18a2.jpg","releaseYear":2014,"developer":"343 Industries","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":380902,"name":"BDSM: Big Drunk Satanic Massacre","genre":"Action","price":0.0,"description":"Big Drunk Satanic Massacre is basically a shooter with strong RPG elements - not that rocket propelled gun, though. The game itself takes place in Hell where the main hero, Lou, is to find milk and rescue the hottest Mistress from the clutches of a fat clown. The game consists of four levels / chapters representing different areas of Hell, such as the hellish Big Wac fast food café, Skeleton Slums and the Red Light District.\nEver wondered what it's like to be Satan's son? Nothing special... Unleashed lust, chronic alcoholism and reckless shooting - the usual routine. Save Hell! Wait... What? Yup, that's right - Hell! It's not the place it used to be - Hell's been possessed. Possessed by the most vile dark hideous evil the world has known - people. They've turned your precious homeland into a madhouse, and only you can stop them! What's in it for you? Spectacular locations, battles with epic bosses and a nice mixture of pain and nonsense.","imageUrl":"https://media.rawg.io/media/screenshots/fec/fec8098f8abf31370f688472e828a701.jpg","releaseYear":2019,"developer":"Big Way Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":301536,"name":"A Year Of Rain","genre":"Action","price":0.0,"description":"A desolate realm, kept in flux by the steady rhythm of battle; a proving ground for those with great ambition. War is in peoples' blood. A necessity in their struggle for survival and power.\nA Year Of Rain is the upcoming ultimate team real-time strategy game. Choose your faction, team up and take control of a legendary hero who has unique powers and individual talents!\nChoose one of three rival factions and get immersed in a gameplay mixture of base building, resource gathering, unit recruiting and battling against other players online or in campaign mode against AI. Structures and units can be upgraded in order to enhance efficiency and power. With your carefully assembled army led by a legendary hero, you will be able to fight alongside the noble House of Rupah, the Wild Outcasts or join the Restless Undead. A battle without mercy begins.\nThe team RTS A Year Of Rain combines classic real-time strategy elements with a strong focus on hero units. Both the co-op campaigns and online and offline modes are being designed with a team of two in mind. The classic 2v2 skirmish mode is being developed for competitive matches from the very start. Meanwhile, “Against all Odds“ is an innovation in the genre where two lone heroes face two entire armies, who have full command over units and structures.\nFeatures\nThe ultimate Team RTS. Play together across all game modes.\nAmbitious campaign, designed for co-op experience\nA 2v2 skirmish that is truly designed for team-play\nUnique asymmetric 2v2 multiplayer mode “Against All Odds”: Two heroes face two entire armies!\nUnique factions\nCompelling multi-layered story\nElaborate, stylized art\nPowerful iconic heroes to lead your army\nSoundtrack by award-winning composer Neal Acree","imageUrl":"https://media.rawg.io/media/screenshots/759/759a344a94e78e0e5fc3cb32a9c3bfae.jpg","releaseYear":2019,"developer":"Daedalic Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":275722,"name":"FINAL FANTASY XV MULTIPLAYER: COMRADES","genre":"Desconocido","price":0.0,"description":"Create your own original avatar and fight for the Light as you discover the untold tale of Eos's decade of darkness.\nJoin up to three friends or go it alone in a slew of new quests full of challenge and excitement—and be sure to keep an eye out for some familiar faces, including the prince and his royal retinue.\nEnjoy the wide and wondrous world of FINAL FANTASY XV like never before in MULTIPLAYER: COMRADES!\n*A PlayStation®Plus subscription is required to take part in online multiplayer.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1 player\nNetwork Players 2-99 - Full game requires PlayStation®Plus membership to access online multiplayer\n25GB minimum save size\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016-2018 SQUARE ENIX CO., LTD. All Rights Reserved.\nMAIN CHARACTER DESIGN: TETSUYA NOMURA","imageUrl":"https://media.rawg.io/media/screenshots/d88/d88c09479f1dd0fb2626462d48fbce4c.jpg","releaseYear":2018,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":261225,"name":"Diablo: Immortal","genre":"Action","price":0.0,"description":"Enter the world of Diablo Immortal, a new entry in the Diablo universe. Featuring the fluid hack-and-slash action role playing game experience you know and love, this visually stunning mobile experience is a cut above the rest and puts the Eternal Conflict at your fingertips—anytime, anywhere.","imageUrl":"https://media.rawg.io/media/games/7fd/7fd73ef44936f8eec7732cfc299dff09.jpg","releaseYear":2022,"developer":"NetEase Games","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":64073,"name":"Omen Exitio: Plague","genre":"Adventure","price":0.0,"description":"Omen Exitio: Plague is inspired by the gamebooks of the '80s and '90s, mixing the alien and horrifying universe created by H.P. Lovecraft with an original plot and characters, all guided by your choices, which will lead the protagonist of the story through the labyrinthine mystery represented by a terrible disease and the shadows that lie behind it.\nZanzibar, 1896. Dr. Jake Huntington enlisted in the army to forget the loss of his wife. Yet something sinister and ancient is about to overturn his life forever. Shadows that inhabit the confines of reality seem to converge all in one point: a terrifying disease that threatens to exterminate the entire human race.\nHowever, the disease is just one of the pieces that make up a vast mosaic, and discovering its design may not be that easy. Intrigues, machinations and subterfuges hide the truth, tearing it away from the doctor’s understanding.\nTo connect all the dots, Jake will have to cross a threshold beyond which many before him have lost the way of reason.\nAre you willing to open this door?","imageUrl":"https://media.rawg.io/media/screenshots/3e3/3e34bf51f88cbf6c92a0c9a7a5baa163.jpg","releaseYear":2018,"developer":"Tiny Bull Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":61248,"name":"Big Crown: Showdown","genre":"Action","price":0.0,"description":"Big Crown: Showdown sees friends become foes as they compete for the crown in 4-player local and online multiplayer combat, set over 3 wacky worlds full of medieval shenanigans. Avoid perilous hazards and engage in frantic fights as you attempt to knock your opponents off 15 crazy courses in the ultimate royal battle!\nKEY FEATURES\n• Pick Up and Play Combat: Big Crown Showdown is an accessible and enjoyable experience for players of all ages and skill levels. The one-button combat provides a true ‘pick up and play’ experience whilst still containing enough depth for players to come back for more!\n• Non-Stop Camera: Big Crown Showdown uses a unique camera system that moves along the track in a constant motion, forcing players to keep moving forward into new challenges. There’s no time rest when the camera keeps the action going!\n• Classic Platforming: It’s not all about combat in Big Crown Showdown. The game blends chaotic combat with sections of tricky platforming, challenging players to move fast and react quickly. Every track has a number of deadly obstacles for players to avoid!","imageUrl":"https://media.rawg.io/media/screenshots/a6d/a6da7b8ec3dd6ca677d38f414cfa9115.jpg","releaseYear":2018,"developer":"Hyper Luminal Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":59755,"name":"Beckett","genre":"Adventure","price":0.0,"description":"A single-player, point-and-click style noir that will make you question what it is to exist. It is unlike anything else you will ever play.\n\"If you knew my mind you could never love me,\" spoke Amy. Beckett was defiant, she was everything to him. Time has passed. Amy is dead. A missing persons case leads Beckett down a decaying rabbit hole to the outskirts of reality. Set in a world unlike anything you've experienced, this is an original surreal noir by The Secret Experiment. Take control. Explore. Navigate. Interact. Talk. Defy. Listen. Be careful. This place is unfamiliar. Make it your own.\nThe whole experience lasts around 3 hours. It will be in your head for a long time to come.\nThe surreal noir is to be showcased in The V&A, the world’s leading museum of art and design, who have hand-picked Beckett as an example of design excellence in storytelling and digital media.\nThank you for supporting independent videogames.Praise for Beckett:\"A rare example of total and genuine auteurism in the games world\" - Glixel, Rolling Stone\n\"convincingly uncompromised\" - Alphr\n\"Beckett impresses at every turn.\" - Cubed3\n\"The Secret Experiment has done something extraordinary with its absurdist noir, Beckett. They have managed to conflate exploration of a town with exploration of the protagonist's battered psyche. Shrewd use of text along with compelling visual and sound design results in an innovative and engrossing experience.\" - Russell Lees, creator of The Dark Eye\n\"A powerful experience for those willing to dive into it.\" - Big Boss Battle.Includes:- An original multi-layered story, discovered and reconstructed by the player and their imagination\n- A dynamic narrative that responds to the way you play the story and interact with its world\n- A bizarre and compelling world, filled with hand-made objects and artefacts\n- A unique soundtrack and soundscape composed and aligned to the story and the world it exists in\n- A pick-up-and-play interface, no gamer-skills necessary - just an inquisitive mind\n- Questions about what it is to exist, the fragile nature of reality and the dark-humour that underpins lifeFeaturing:- Morgellon & Ekbom Live Here - a short, interactive play, featuring the voice of John Otway (if you don't know it, you should check out his hit Really Free and its B-Side, Beware of The Flowers).\n- Spectacular abstract environments to be explored and discovered, digitally painted by Herman Serrano (Weird Dreams, Chaos Engine, StarGlider)\n- Illustrations by the incredibly talented Sean Mulvenna, and original screenprints by the fantastic Al White\n- Programming by Gordon Bell (MotorStorm, The Shoot, Need for Speed: The Run)\n- Design, direction, words, music and 'made-things' by Simon Meek (Slabovia.tv & The 39 Steps)\n- Access to the dark recesses of your own mind","imageUrl":"https://media.rawg.io/media/screenshots/d3e/d3e2c6bab385ca51585302e65acc26d5.jpg","releaseYear":2018,"developer":"The Secret Experiement","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58515,"name":"One Deck Dungeon","genre":"Adventure","price":0.0,"description":"Adventure calls... but you don't always have time to spend hours optimizing your character sheet or managing your inventory! One Deck Dungeon lets you jump right in to bashing down doors, rolling dice, and squashing baddies with style. Get a full roguelike game experience, boiled down to its essence, and captured in a single deck of cards and a handful of dice!\nOne Deck Dungeon is a dungeon crawling adventure game for one or two players. Each time you play, choose one or two of these 5 brave heroes:\nMage - There's rarely a problem in the dungeon she can't solve with a spell.\nWarrior - Her favorite dungeon activity is squashing her opponents immediately.\nRogue - Watch in awe as she dispatches monsters with style.\nArcher - Accurate, brilliant, catastrophically deadly.\nPaladin - She seeks out danger and shields her allies from deadly enemies.\nAfter every game, your heroes make progress toward unlocking up to 15 new talents, building up their power for future games.\nThere are 5 dangerous challenges to face:\nDragon’s Cave - The thick-skinned wyvern who occupies this dungeon prefers her heroes on the crispy side.\nYeti’s Cavern - If you can survive the freezing winds and biting cold, an abominable snowman awaits.\nHydra’s Reef - Chop off one head, and another appears! This regenerating venomous monstrosity is a slippery foe.\nLich’s Tomb - Hordes of undead foes, evil curses, and magical wards. What could possibly go wrong?\nMinotaur’s Maze - Abandon all hope, ye who enter here!\nThe Forest of Shadows expansion doubles the content in the game and is available as downloadable content via Steam. It features adventures in all-new lush yet deadly locales. A vast network of mossy underground tunnels and connected forest areas await your heroes!\n5 new heroes - Alchemist, Druid, Hunter, Slayer, & Warden\n5 new dungeons - Lair of Indrax, The Mudlands, Realm of Venom, Smoldering Ruins, & The Vile Roots\nA complete new 44-card encounter deck\nAdditional progression focuses, basic skills, potions, & more!\nIndividual expansion cards are available as downloadable content via Steam:\nCaliana - This faerie has decided that dungeoneering looks fun! Don't let her get bored...\nFanatic - A righteous Sentinel is here to smite evil wherever it may lurk!\nWitch - Her chaotic magic hammer is ready to smash glooping oozes into glooping puddles!\nCinder Plains - The Hellhound awaits those reckless enough to venture here...\nPhoenix's Den - Only the bravest heroes can handle the heat!\nOnce you know your way around the dungeon, a game takes about 15 minutes. It might take a little longer if you're learning, or a lot shorter if you jump into a pit of spikes.Warning: do not jump into a pit of spikes.\nHELLO! Would it be impolite if I were to nom on your armor and weapons? That shiny metal looks oh so delicious. Oh --pardon me, how rude of me not to introduce myself! I am Glooping Ooze, one of the many extremely polite denizens of the dungeons in this area. I even have my own card:\nLike all cards in One Deck Dungeon, mine is full of colored boxes, and HEY! What's the idea with all those arrows. Ugh, adventurers. So rude. So very very rude. I suppose you're rolling all your dice, attempting to fill in as many boxes as possible. For every one you don't fill, I'm going to make you pay for this arrow nonsense, in hearts and time! Precious time!\nIf you manage to get past me somehow, you'll be able to take Armor Crush as a skill, or add that magic icon on the left to your stats, or take the three experience lanterns in the upper-right.\nDespite your arrowful attitude, I welcome you to the world of One Deck Dungeon. Adventure awaits!\nOne Deck Dungeon is an officially licensed product of “One Deck Dungeon” from Asmadi Games.","imageUrl":"https://media.rawg.io/media/screenshots/468/46819eab6c9b61a68dee31c1f5da73fb.jpg","releaseYear":2018,"developer":"Handelabra Games","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":57215,"name":"Teenage Mutant Ninja Turtles: The Hyperstone Heist","genre":"Action","price":0.0,"description":"Teenage Mutant Ninja Turtles: The Hyperstone Heist, released in Europe as Teenage Mutant Hero Turtles: The Hyperstone Heist and in Japan as Teenage Mutant Ninja Turtles: Return of the Shredder is a side-scrolling beat 'em up based on the comic book characters the Teenage Mutant Ninja Turtles, and was also the first TMNT game released for the Mega Drive/Genesis.","imageUrl":"https://media.rawg.io/media/games/87e/87ed46b052ca5aced4036bdf6eac4071.jpg","releaseYear":1992,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Genesis"}]},{"id":54987,"name":"Bubble Ghost","genre":"Action","price":0.0,"description":"Bubble Ghost - Supernatural Arcade-Action that will blow you away!\nPlease don't shake your screen. You'll wake the dead. Within the confines of this game crypt rests the Bubble Ghost - a phantom destined to travel the halls of an eerie castle, forever blowing bubbles. And the only way his wandering soul can be put to rest is if you can help him blow his fragile little bubble through 35 trap-laden rooms of the macabre mansion, without it popping!\nBut just who is this \"puffergeist?\"\nLegend has it that the Bubble Ghost is the long-winded spirit of Henrich Von Schtinker - a mad inventor who met his end while testing his now infamous \"electric bubble pipe\" in the bathtub.\nObviously his death came as quite the shock! But a bigger jolt was yet to come. For on the night following Von Schtinker's demise, a nightwatchman reported seeing a mischievous little spook floating amidst the catacombs of the inventor's derelict old castle \"...blowing a shimmering bubble in front of him!\" And now he needs your hand to complete his \"breathtaking\" journey.\nIt won't be easy. Around every corner, in every creepy room, lurk fiendish \"techno-traps\" just waiting to burst your bubble. Spikes, knives, pins, needles, scissors, shears- plus a host of other gadgets, gizmos and ghouls - all situated in the most inconvenient places.\nYou'll not only need dexterity to gently negotiate the bubble past all of these prickly situations, but ingenuity too. For many rooms in this multi-level madness hold secrets that can keep you from \"blowing it\", eh, so to speak. Classic Digital's Bubble Ghost. See how a single bubble can raise one's spirits!","imageUrl":"https://media.rawg.io/media/screenshots/f96/f96e2f756b3aa3e386e0b9f58c7c10c5.jpg","releaseYear":1988,"developer":"Infogrames","libraryGames":null,"platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Apple II"},{"id":0,"name":"PC"}]},{"id":54742,"name":"Shenmue II","genre":"Action","price":0.0,"description":"Shenmue II is an action-adventure game developed by Sega AM2 and published by Sega for the Dreamcast in 2001. It was directed, produced and written by Yu Suzuki. Like the original Shenmue, Shenmue II consists of open-world environments interspersed with brawler battles and quick time events. It features a day-and-night system, variable weather effects, non-player characters with daily schedules, and various minigames. The player controls the teenage martial artist Ryo Hazuki as he arrives in Hong Kong in 1987 in pursuit of his father's killer. His journey takes him to Kowloon and the mountains of Guilin, where he meets a young woman who is part of his destiny.\nSome of Shenmue II was developed alongside the original Shenmue, which was the most expensive video game ever developed at the time. The Dreamcast version was only released in Japan and Europe; Microsoft secured console exclusivity in North America for Shenmue II, and released an enhanced port for the Xbox console in 2002 and other territories in 2003.\nThe Dreamcast version of Shenmue II received positive reviews, but reviews for the Xbox port were mixed; it has since appeared in several \"greatest video games of all time\" lists. Shenmue II sold poorly and further games in the series entered a period of development hell lasting over a decade. In 2015, Suzuki and his company Ys Net began developing Shenmue III for Windows and PlayStation 4 following a successful crowdfunding campaign.","imageUrl":"https://media.rawg.io/media/games/a7f/a7f16e3ab0fae21f7a6ecb78bf3964af.jpg","releaseYear":2001,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Dreamcast"}]},{"id":53406,"name":"Medal of Honor: Underground","genre":"Shooter","price":0.0,"description":"Medal of Honor: Underground is a video game that is a partial prequel to the World War II hit Medal of Honor. It was initially released for the PlayStation video game console on October 23, 2000. In 2002, the game was re-released in Europe as part of the compilation Medal of Honor / Medal of Honor: Underground. It later was re-released a second time on the North American PlayStation Network for the PlayStation 3 and PlayStation Portable as a 474 MB file for $5.99 on June 11, 2009. It was developed by DreamWorks Interactive and was published by Electronic Arts. Prima released a strategy guide for the game in 2000 featuring the same cover art as the original PlayStation release.","imageUrl":"https://media.rawg.io/media/games/c41/c410cbc2c3bb7e41ba1ee7dc7c7e90a0.jpg","releaseYear":2000,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"}]},{"id":52035,"name":"Indecision.","genre":"Adventure","price":0.0,"description":"A haiku platformer.\nIt isn't for everyone, but you are welcomed to try it. The game won't take too much time to finish.\nIt's short and vague.\nYou just push left, right and sometimes jump.\nhttps://store.steampowered.com/app/952200/stikir/","imageUrl":"https://media.rawg.io/media/games/e38/e384f093751e8052ec153221b814e31a.jpg","releaseYear":2018,"developer":"Bilge Kaan","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45176,"name":"Head Goal","genre":"Sports","price":0.0,"description":"Unbelievably fast soccer and volleyball game. Challenge your friends and prove them who is the best. Do you prefer soccer or volleyball, or maybe both? It's your chance to play on 8 different stadiums. Realistic physics makes Head Goal really fun, you can save your amazing actions on a replay and watch them later. Try the game and invite your friends to see who is the best Head Goal player in the world.\nFeatures:\n8 stadiums\n2 Game Modes (Soccer and Volleyball)\nMultiplayer\nRealistic Physics\nT-Shirts Customization\nReplays\nStatistics","imageUrl":"https://media.rawg.io/media/screenshots/52d/52d4c215c6586626248ce3678ea72259.jpg","releaseYear":2017,"developer":"Unusualsoft","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]