[{"id":19125,"name":"Shadow Hunter","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d1/5d183b089b0541fa7e5b1720b5d37389.jpg","description":"Shadow Hunter is a casual deductive puzzle game with RPG elements.\nAs a Shadow Hunter, you must use your senses to detect dangers and artifacts beneath the endless darkness that spreads throughout the land.  Anti-light, the dimension and dimensional darkness from beyond the void gate, threatens to swallow us all. You must quest to find the Shadow Gate Fragments, to destroy the Anti-light menace.\n16 areas to explore.\nDeductive mini-games.\nRandom events.\nLocal high-score list.\nGreat horror atmosphere.\nTurn-based.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jeff Trier","platforms":[{"id":0,"name":"PC"}]},{"id":18942,"name":"Genesis of Drones","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c8/2c8c6310b59dbd021875d0a2832d2361.jpg","description":"The horde of drones has invaded earth. They are taking over cities and factories to use for their own self-replication. Play as Joe or Gem and rise up to fight the horde. This is an 8-bit style platformer comprised of eleven levels. Nine in the campaign and two unlockable levels. The gameplay is meant to be fast and challenging with a focus on destroying the enemy units (drones and tanks). You will have to fight a more challenging boss at the end of each level in the campaign. There are two weapons at Joe and Gem's disposal, a briefcase for bashing, and they can turn any mobile into a weapon which remotely destroys the drones.\nEach item you are holding = 1 HP so if you have a briefcase and mobile, you can get hit two times before dying. If you get hit once, you lose the mobile, get hit again and lose the briefcase, get hit one more time and you're dead.\nGenesis of Drones was inspired by the games I grew up on. I hope you will enjoy it!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Chris Mailloux","platforms":[{"id":0,"name":"PC"}]},{"id":16920,"name":"GTR 2 FIA GT Racing Game","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdc/cdceb9f71fdb2bfe0e8fc7b13be396c3.jpg","description":"The Game That Revolutionized the Racing Genre.\nThe successor to the international award-winning racing simulation GTR accurately represents the challenges of Motorsport racing. The detailed, photo-realistic depiction of these powerful cars and beautiful circuits, thanks to the graphics technology, and the enhanced driving model will make your adrenaline rise in one of more than one hundred HP-beasts.\nBeginners can start with the driving school where they are taught the basics of race driving by a professional instructor. Thanks to dynamic day, night and weather changes and an impressive damage system, the races of the exciting FIA GT series become a thrilling gaming experience.\nSince the release of GTR2 in September 2006, the game has received widespread acclaim. GTR2 simulates the 2003 and 2004 FIA GT Championship racing series.Key Features\nRealism has been redefined: Authentic physics, dynamic day and weather changes as well as an impressive damage modelGreat variety: Grand touring cars reproduced down to the last detail including all vehicles of the GT and NGT classes and the 24H races from two FIA GT seasonsOriginal circuits: 34 different track variationsTough competition: Human-like AI opponentsScalable levels: 3 different game modes (Novice, Semi-Pro and Simulation)Great fun: 6 game events (Open practice, Race weekend, – Championships, Time trials, 24 Hour Races, Driving school)International competition: Fully integrated multiplayer mode for racing against other human drivers from all over the world.Cars Included: BMW M3 GTR\nBMW Z3 Coupe\nCorvette C5-R\nGillet Vertigo Streiff\nLister Storm\nLotus Elise\nLamborghini Murcielago\nMaserati MC12\nMorgan Aero 8\nMosler MT900\nNissan 350Z\nSaleen S7-R\nSeat Toledo\nTVR T400R\nViper GTS-R\nViper Competition Coupe","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SimBin Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16893,"name":"Sacra Terra: Angelic Night","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8ab9d957102b9742d1898a76bbbc1c8d.jpg","description":"The demons of the Seven Deadly Sins have broken free of their fiery prison and taken up residence in Sacra Terra!  Use your cunning to defeat each demon and rescue humanity from destruction!  As you explore a decaying hospital, unlock the secrets of a medieval abbey, and search eerie catacombs, you'll receive help from a pure spirit known only as Angel.  Who she is and what happened to her is just one of the shocking truths you will uncover as you find well-hidden clues, gather useful items, and solve cleverly designed puzzles!  The Collector's Edition of Sacra Terra: Angelic Night contains a bonus chapter, a step-by-step walkthrough, desktop wallpapers, and concept art.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16863,"name":"Magnifico","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc2/dc27a49bf43b9c85606fd02bb019cedd.jpg","description":"Magnifico is a popular region-based board game where the ultimate goal is to dominate 16th century Europe and is now available for PC!\nPlayers are faced with tough economic and military decisions as they earn Victory Points and attempt to outbid opponents at the auction and get their hands on Leonardo Da Vinci’s most powerful war machines. Every Victory Point has to be earned by careful placement of your troops, construction of fortifications, and invasion of bordering regions. Each new turn brings a chance to acquire Da Vinci’s precious projects and get the upper hand over your opponents.\nCannons, flying machines, bombards, tanks and many more inventions will be available as options at the auction table, but only with a perfect balance of risk and caution will players make the most of them.\nPlay hard or play clever, Europe’s dominance is just one Victory Point away.\nMain Features:\nThe only strategy game with Da Vinci’s inventions and works of art! Build Castles, Tanks, Aircraft and much more!\nBid at the auction for Da Vinci’s inventions.\nUpgrade your infantry, tanks and aircraft with new technologies to increase reliability and combat power.\nFight battles with wondrous technologies but be careful as tanks can explode!\nMany special weapons including the Great Cannon, Submarines, Armoured Ships, Paratroopers and more!\nCompete for control of 16th century Europe on a region based map.\nEarn Victory points for most castles, territories, technologies, being Magnifico and other special actions.\nSingle player mode against up to 3 AI players, selected from 10 AI characters with their own play styles.\nIn depth in-game tutorial and detailed manual.\nAvailable in English, French, Spanish, Italian, German, Russian and Chinese!\nBased on the popular board game “Da Vinci’s Art of War - Magnifico” created by Spartaco Alberatrelli","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Slitherine Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":16633,"name":"Three Digits","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/632/63219ce9a2d31ee3c08f63264037bd71.jpg","description":"Three Digits is the sequel to our first game Two Digits.\nThe objective is simple. You are given 14 numbers less than 1000, and all you have to do is to choose two subsets with the same sum.\nJust try it. See how difficult it is!\nFeatures\n300 puzzles, 14 level sets\nRandom mode, generate your own levels\nBeautiful, calm UI\nSteam Achievements","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cleverweek","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16588,"name":"Abbot's Book Demo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00e/00e6c2bbe7ecc1b132704a60d5f6ba2c.jpg","description":"1680, Vicenza, Italy.  Explore the ruins of an ancient religion that riddle the catacombs beneath a noble estate, where the shadow of a forgotten god has awakened to haunt the dreams of men. A dark tale in the classic, gothic tradition, The Abbot’s Book traces the lives of four generations of a family cursed by the corrupting influence of a mysterious book.\nWhen complete, The Abbot's Book will be 8 episodes of VR narrative content. This demo shows a small slice of the 7th episode.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Abbot's Book","platforms":[{"id":0,"name":"PC"}]},{"id":15898,"name":"Cosmic Sugar VR","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/202/202ae30f1d36aaf9d314c9e4929b7300.jpg","description":"Cosmic Sugar is a simple but elegant GPU driven simulation space. Vive wands become attractors or repulsors which allow you to craft nebulae. The controls are very simple, but it takes some time to explore all of the possibilities. Thanks to East Forest for the trailer music.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"David Lobser","platforms":[{"id":0,"name":"PC"}]},{"id":11700,"name":"The FOO Show featuring Will Smith","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd6/dd66364d76e7f2956b4beaa66d00643b.jpg","description":"This is Virtual Reality! The FOO Show is a 3D rendered, interactive talk show, featuring Will Smith. Every week, starting this summer, Will will chat with interesting people from the world of games, virtual reality, film, television, and more, and you can come along. This week's episode features Firewatch. You can explore the fire watchtower in room-scale (or standing) VR!\nThe FOO Show is just our first program. In the next year, we'll introduce many new shows. If this sounds interesting to you, check out our website at http://foovr.com.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FOO VR","platforms":[{"id":0,"name":"PC"}]},{"id":11536,"name":"Absoloot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c1/0c16b854a8055902d856d5a7e6482d89.jpg","description":"Absoloot is a game with familiar game mechanics that will put you into fun confrontation of four warring sides (Archaeologists from Winfield, Hellocreeps, Kwade Bende, P.R.M.D.).\nThe reason of confrontation is a treasure! Each team tries its best to leave others with no riches. You should attack and protect, run away and chase, explode and get blown up.\nThat game has few game modes (classic and special). You will face with deathmatch, treasure hunting, chasing the king and many other. All of that will be on tens of maps, each of them refers to team locations (saloon, castle, sheep, pyramid).\nEvery fighting side has three heroes that can be chosen for game. Every hero has his own weapon and physical features (speed, health and other), so the choice of one hero or another can be the part of your tactics in different modes of competition. But don’t forget to watch your ammunition and level of health!\nThat game was created for yours and your friends’ fun by playing on one computer the two, three or four of you. Please note that for three or four-players game on one computer you will need gamepads (one or two). Also game supports online-multiplayer to fight with other players remotely.\n5 dynamic game modes\n4 locations different by style and atmosphere\n40+ different maps full of mines and spikes\n12 unique characters\n12 types of weapon (machine-gun, shotgun, rifle, pumpkin-gun, sweet-gun and other)\nBonuses that can affect on game\nMultiplayer for one computer (2-4 players)\nBeta Online-multiplayer (2 players)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Latinas Tomatos","platforms":[{"id":0,"name":"PC"}]},{"id":7062,"name":"Dark Echo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ef/5efdf4767886de1ea89d4ec8e2cbae7a.jpeg","description":"Trapped in darkness, you must use visualized sound to guide your way through threatening environments. The sounds you create will bounce off obstacles, revealing the shape of the surrounding world. It won't be long before your only way of sensing the world attracts a horrifying evil that devours both sound and souls.\nSurvive through 80 levels that will make your heart race and leave you with an irrational fear of red lines. A foreboding soundscape, best experienced with headphones, sets the tone for your journey. Explore, solve puzzles, and most importantly - stay alive.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"RAC7 Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":4406,"name":"The Cursed Crusade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c4/6c48595b9fcca8f22edc3c511b2007ec.jpg","description":"Set against the backdrop of the Old World, two adventurers--both seasoned warriors--will quest across a Western Europe ablaze with the turmoil of a newly begun Fourth Crusade. Denz, a holy Templar, and Esteban, a roguish mercenary, may have different origins, but their motivations are the same: amidst the danger and despair of a new Crusade, to find the means to deliver themselves from a terrible curse that threatens to consume their immortal souls.\nKey Features\t\t\t\t\t\tThe Old World Burns - Embark on a contentious quest for retribution spanning five chapters and over 30 missions that promises to bring fire, death, and destruction to the great cities of medieval Europe.\nA Templar Cursed - Transform the world around you into a flaming red vision of Hell, increasing your strength and your ability to perceive hidden things, all at the expense of your humanity.\nBrotherhood of Steel - Split-screen or online, recruit a friend to assume control of the thief, Esteban, to join in the excitement of shared adventure.\nIntense, visceral 3rd-person action - Easy to grasp yet deep in its execution, a weapon-based combat engine features over 90 combos, dozens of weapons, and a timing-based counter system.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":447808,"name":"Hoa","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e7/9e78f4baf60cb4eafdb73ff70b896fd2.jpg","description":"Hoa is a platform-adventure game featuring beautiful hand-painted art and a calm, relaxing atmosphere. The game follows the main character, Hoa, as she discovers her own story on a journey through a breathtaking and magical world back to her homeland.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Skrollcat Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":388314,"name":"Control: AWE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ce/9ce8bca2fa1bd514bad2574fbc947401.jpg","description":"AWE: Expansion 2. The Bureau studied its most dangerous Altered World Events in this lost sector. The records were sealed, the objects contained, and their powers abandoned. Now, the sector is breached and the objects are loose… AWE brings new story content and side missions as well as new weapons and mods to the world of Control.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":257342,"name":"Simmiland","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/264/26449e92939381a878f7ead89b012587.jpg","description":"Simmiland is a god game.\nWatch how mankind develops!\nWhat the heck is Simmiland?\nIn Simmiland you create a small civilization that you can only influence indirectly by playing cards to the land, such as plants🍃 and minerals ⛰️. Playing a plant on a grass biome tile will result in a wheat plant, but playing a plant card somewhere else will also create something else. Try to experiment as much as you can!\nPlaying cards costs ✨ 'faith' ✨ that you gain from the humans when they periodically pray for you, or when you fulfill their wishes. One may wish for a berry bush and another for a deadly plague ☠️\nOne of the more important cards is the ⚗️ 'inspect' ⚗️ card. This card can be played on items, objects and sometimes just on empty tiles. The inspect card will trigger an invention that will help the humans explore your world further.\nThe way you shape the land and guide the humans will decide which way the humans will develop. They can go as far as to build a rocket! 🚀\nThe metagame\nYou can play Simmiland in 2 different modes:\nNormal mode - your card deck is limited and you will find the apocalypse card at the bottom\nEndless mode - you can play an endless amount of cards, but you won't get any achievements\nIn normal mode you will get achievements. Both achievements and progress will net you some in-game currency which you can use to buy new and more cards to fill your deck, giving opportunity to new possibilities.\nFeatures\nQuick, but relaxing, 10~60 minutes play per game\nAn alternative endless mode where you can shape the land into infinity\n~20 different cards\n13 different biome types\n30+ inventions to discover\n40+ different resources to discover\n20+ different achievements to fiind","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sokpop Collective","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60907,"name":"Thief of Thieves: Season One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8c/f8c4967cc19aa633e633b9bf1bfe4ba6.jpg","description":"Just Updated\nVolume 4 out now! Join Celia for the season finale of Thief of Thieves: Season One where we literally move up in the world. A new city, a new country, and the most complex heist to date. This is the time to apply all that you've learned and see if You too can rise to be a true Thief of Thieves.\nAbout the GameIn Thief of Thieves: Season One you play as a cat burglar using stealth, social engineering and team members to pull off some high profile heists across the world.\nBased on the award winning comic book series by Robert Kirkman , Thief of Thieves: Season One is a story of heists and the people behind them. It’s time for Celia, protege of master thief Redmond, to make the leap from apprentice to master. A botched job takes Celia to Europe, where she joins a new team of criminals for a crime spree. Get to know your team, choose your approach on the field, but be careful – the choices you make may have drastic consequences.\nA new continent and a new team, will you make the cut?Key FeaturesThe story is told via comic frames and gameplay, where Celia makes her way through scenes ranging from cocktail parties to construction yards by using her skills in social engineering and sneaking - never violence\nStunning Visuals – Unique visual style combining hand-drawn 2D comics and 3D environments into one seamlessly flowing story experience\nLiving, breathing characters brought to life by such voice actors like Fryda Wolff (Mass Effect: Andromeda), Stephen Stanton (Rogue One), Emily O’Brien (Death Stranding), Cissy Jones (Firewatch, The Walking Dead: Season 1), Fred Tatasciore (Kung Fu Panda 2), and Elias Toufexis (Deus Ex: Human Revolution)\nA tailor-made story – the choices you make shape the narrative and build the relationships with your team members\nThe full Season One is now available, and all of the four volume story is playable right away.\nThief of Thieves: Season One is based on the comic book series created by Robert Kirkman and published by Skybound Entertainment.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rival Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":50733,"name":"Vacation Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0f/b0f187d05ed54d3e71c8d435b4037976.jpg","description":"Welcome to the Vacation Simulator, a rough approximation of VACATION inspired by real human NOT JOBBING, brought to you by the same robots behind the Job Simulator. Reallocate your bandwidth and get ready to splash, s’more, snowball, and selfie your way to optimal relaxation!\nThe year is 2060.\nFollowing record enrollment in the Job Simulator, robots set out to uncover what else humans did besides ‘job’. After years of balancing buoyancy levels, cataloguing campfire chronicles, and securing ski slope safety protocols, their research led to the creation of a rough approximation of ‘not jobbing’: the Vacation Simulator.Amenities:Experience Vacation Island, your destination for optimal relaxation and/or efficient memory-making!\nCustomize a virtual YOU for picture-perfect selfies!\nWave to interact with a colorful cast of Bots!\nEnjoy RECREATION beyond the theoretical limit in immersion-inspiring destinations!\nSplash in the silicon sea and bask in simulated sunlight, all without getting sand in your… hands!\nGet lost connecting with your roots, nodes, and branches... then get actually lost on a hike!\nElevate your ice-sculpting skills to new heights and reach peak cozy by knitting mittens for a snowhuman!\nExist in a comfortable, all-inclusive VR experience— free of motion sickness AND seasickness!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":49800,"name":"Prehistorik","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a0/3a015b41b9614b8649f22eeedb7c3454.jpg","description":"In this retro classic the main character is a caveman who goes in quest for food, fighting various animals and humorous end of level bosses.\nThe game is a classic platform game where the player walks and jumps his/her way through the levels and whacks enemies in the head with a club.\nclassic platform game\ncaveman's quest for food,\nhumorous end of level bosses.\ncollecting items (including food, diamonds, video games, etc.)","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Interplay Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"iOS"},{"id":0,"name":"Atari ST"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":46633,"name":"Transport Defender","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/222/222e2c97c4fc36c53cc4afedd8b14861.jpg","description":"Defend the transport ship from being captured by enemy waves on the way to the jump hole. Enemies are not going shoot, they don't want to harm the hookers you have stolen. This is an Idle\\Clicker game with the ability to setup configs of auto upgrades, and auto ascension.\nGame features:\n1 mouse controlled turret (it can be upgraded to have 6 barrels, and shoot rockets)\n20+ auto weapons (including some funny weapons, ie. nyan cat launcher)\n200+ ship features you can buy and upgrade depending on your playstyle (idle or active), ie. money per click, or conversion of mouse controlled turret to auto.\n10 abilities\nWeapons auto upgrade configuration\nProjectile\\hit effect colour selection for weapons\nOverdrive system (don't click all the time, fill the bar with extra damage and rest your finger for a minute :) )\nOptions to disable projectiles\\explosions\\floating text\\etc if you can't watch 300+ projectiles on the screen.\nOffline progress (money and money\\cargo generators)\nNo Sound (99.9% of the time, the game is going to be in the background)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Coconut Shavers","platforms":[{"id":0,"name":"PC"}]},{"id":41535,"name":"Forge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62f/62f6baea344248b43bf12f20ac1edf12.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Digital Confectioners","platforms":[{"id":0,"name":"PC"}]},{"id":35221,"name":"Gothic 2: Night of the Raven","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d4/2d4b33c3e4df970766ea97e7fb5b69b9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Piranha Bytes","platforms":[{"id":0,"name":"PC"}]},{"id":30669,"name":"Neverwinter Nights 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b62/b62e47a7a8bf28da08300aa9ec88f809.jpg","description":"Neverwinter Nights 2 is a role-playing video game developed by Obsidian Entertainment and published by Atari, Inc. It is the sequel to BioWare's Neverwinter Nights, based on the Dungeons & Dragons pencil and paper fantasy role-playing game. Neverwinter Nights 2 utilizes an adaptation of the Dungeons & Dragons 3.5 edition rules. Players create player characters to represent themselves in the game, using the same character creation rules as found in the Dungeons & Dragons game. They may gain the assistance of additional party members, and they eventually acquire a keep that can be used as a base of operations. Neverwinter Nights 2 is set in the Forgotten Realms campaign setting—in and around the city of Neverwinter. The story is mostly unrelated to Neverwinter Nights and follows the journey of an orphaned adventurer investigating a group of mysterious artifacts known as \"silver shards\" and their connection to an ancient, evil spirit known as the King of Shadows.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":21741,"name":"Yumsters 2: Around the World","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dac/dacb7fb63f1e6cfb7a3b431b903413f8.jpg","description":"Not only are these Yumsters crazy for strawberries, they can rock the bongos. For the love of fruity music, help them earn money by cleaning gardens to promote their band. To really skyrocket, Yumsters need the best equipment to win the ultimate grand prize at the fairy town music showdown. Get fruitilicious in five vibrant locations of Yumsters 2, a sweet Match 3 puzzler.\nKey Features:\nMatch 3, drag-n-drop\nRhythm-based gameplay\nAdorable characters\nWin the grand prize!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"KranX Productions","platforms":[{"id":0,"name":"PC"}]},{"id":21135,"name":"Midnight Mysteries: Witches of Abraham - Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d1/2d1a55f0ae6ace70a1ae4b142710eca6.jpg","description":"For the past few years, you've been writing bestselling novels based on the stories you've heard told by the ghosts who visit you at midnight. But tonight you have a special visitor, Abraham Lincoln, the 16th President of the United States! Go back in time and find the treasure of the Knights of the Golden Circle, a secret Confederate order, before Lincoln's enemies do! Follow the clues, learn about famous people and places from the American Civil War in this fascinating Hidden Object Puzzle Adventure game.\n*Collector's Edition Includes:\n-Bonus chapter featuring Jesse James\n-Collectibles\n-Unlimited Hidden-Object Puzzles mode\n-Interactive character bios and art gallery\n-Screensavers and wallpapers","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hot Lava","platforms":[{"id":0,"name":"PC"}]},{"id":21121,"name":"One Day For Ched","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05f/05fb19b1560f8cc64bcf661208fc4215.jpg","description":"DIVE INTO THE WORLD OF OLD SCHOOL SHOOTERS! HARDCORE CORRIDOR SHOOTER ONE DAY FOR CHED BRINGS YOU A GAMING EXPERIENCE LIKE NO OTHER!\nFight the monsters, shoot 'em up with your skills and powerful guns. Complete the whole story and find out the secrets of Ched's mind. ONE DAY for Ched makes you feel like you're back in the glory days of gaming, and brings you the ultimate in hardcore gameplay, interesting story and quest elements.\nUse your gaming skills to complete the levels and kill all enemies. Victory will can be yours, but you will have to fight hard. ONE DAY for Ched will never forgive your mistakes!\nFeatures:\nUNSTOPPABLE HARDCORE GAMEPLAY\nFight like you've never fought before! Run like you've never done it in the past! Shoot like it's the last shot in your life! With the game's mechanics, you need to try your best to beat the monsters. Player skills mean everything in the world of ONE DAY for Ched. No saves, no health recovering, no margin for error!\nBEAUTIFUL GAME STYLE\nDive into the story with the original art style of ONE DAY for Ched! Feel the comic atmosphere of the game!\nHIGH GRAPHICS LEVEL WITH LOW SYSTEM REQUIREMENTS\nONE DAY for Ched brings you beautiful graphics that can be run even on the weak PC! Rich level design is the game's calling card, and a powerful effects system makes the action even more epic!\nMANY KINDS OF MONSTERS, BOSSES, WEAPONS AND MAPS!\nEach level has four new classes of monsters (featuring a boss in each level), which can be killed with six kinds of weapons! Every weapon has it's own characteristics and firing type. You can use primary or alternative fire to kill your enemies. Each enemy has it's own strategy, strengths and weaknesses!\nQUEST ELEMENTS AND INTERESTING STORY\nThe storyline of the game is Ched's adventure - a man that wants to free himself of his demons. The Battle is in Ched's head and only you can help him survive!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BS1 & BSL Team","platforms":[{"id":0,"name":"PC"}]},{"id":20436,"name":"Draft Day Sports College Basketball 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/865/8650ea17d662513103e005ebcfe83546.jpg","description":"Take control of your favorite college basketball team as head coach. Build your coaching profile and set out on the long road to tournament glory. In addition to winning games and piling up trophies you're responsible for hiring your staff, researching players, recruiting new talent and of course coaching your team. Look to further your career by improving your coaching resume and prestige to land better jobs. Or take on the role of an assistant coach for a totally different way of playing the game. Get immersed in the incredibly detailed game world which boasts one of the best recruiting engines in any collegiate video game.\nFeatures\nPlay As Head Coach Or Assistant Coach\nRealistic and Immersive Recruiting System\nScout Opponents\nShape Your Strategy Through Practice\nTwo 2D Gameplay Modes\nInternational Recruits\nMultiplayer Play\nImport your college players into Draft Day Sports Pro Basketball 4!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wolverine Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19477,"name":"Eschalon: Book III","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b7/2b74ffe8fa006c5fa754edcaec383fab.jpg","description":"Eschalon: Book III brings the trilogy to a climactic end as you seek to uncover the mystery of your past, the secrets of the Crux stones, and who the Orakur really are. You’ll traverse miles of virtual wilderness and dungeons, filled with secrets and danger, in an unparalleled role-playing experience designed to feel like a true pen-and-paper RPG.\nThe end of a saga! The final Book in the Eschalon Trilogy brings the story to an epic conclusion and all your questions will be answered. Of course, we've made sure Book III can be fully enjoyed even if you've never played the previous games.\nDozens of fan-requested features and updates to the engine and rule set.\nHundreds of graphic updates including re-rendered tiles, new spell effects, and enhanced environment effects. New sound effects and music in crystal-clear HD audio via an updated sound engine.\nExpanded stats for creatures give them new abilities, defenses and vulnerabilities. Combat will require new levels of strategy.\nNew spells and hundreds of new items for you to discover. A huge world filled with secrets, riddles, traps, treasure, and glory awaits you!\nBook III is not a dumbed-down “RPG for the masses”. Rapid button clicking won’t save you here. Eschalon pays honor to the greatest RPGs of the past, with unlimited character development options and freedom to explore the world as you wish. The difficulty of the game does not scale to your character.\n3rd party tools available to modify the game and build custom maps.\nSingle player only, like a great RPG should be.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Basilisk Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17986,"name":"Wooden Sen'SeY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d00/d00dec58ee54888277ca76617020bd4f.jpg","description":"Wooden Sen'SeY is an action-platformer, set in a unique \"Japan Steam Rock\" universe filled with humour.\nYou follow Goro, a village chief, as he seeks revenge through a variety of levels. He will defeat his enemies using his axes to slice, dice, squash and grapple!\nWooden Sen'SeY seeks to offer players a unique gaming experience, inspired by old school gameplay mechanisms, while incorporating contemporary technology and beautiful 3D graphics.Wooden Sen'SeY features\nExotic worlds and beautiful 3D graphics.\nHardcore old school gameplay!\nAwesome music and crazy voice actor.\nA unique environment style for each level.\nSeveral ways to follow the path of the Sensei: dive in or play with finesse!\n\"Dev-Time\" challenge: beat the developers' time.\nA brand new Time Attack mode with 30 “hair tearing” levels!\nSupports USB controller and Leap MotionWho are the developers ?\nUpper Byte, the French indie studio behind Wooden Sen'SeY, is a tiny team with only two members: Cédric, the creative force, and Camille, the insane coder. Their ultimate goal is world domination. But for now, nice polished games, with hardcore old school gameplay and pretty graphics is enough!\n--------\nOops, enough talking...\nLet's Play Wooden Sen'SeY!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Upper Byte","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17948,"name":"Rescue - Everyday Heroes (U.S. Edition)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a40/a40c7b7ce8e6dff302c97c956e89b15d.jpg","description":"An alarm is calling for your team’s attention!\nPut on your boots blackened by soot, assemble your team for the mission and head to the site of emergency.\nIn this realistic mixture of simulation, management and RTS game you take part in exciting firefighting and rescue missions as the head of fire department, assemble your force and gradually develop your station.During complex missions where decisions over life and death are often made, you will get to know what it means to be a true hero of everyday life.\nRecruit personnel with different backgrounds for your US rescue crew, e.g. firefighters and paramedics. You can also purchase new vehicles such as variety of fire engines and ambulances and furnish your fire station by buying various props, e.g. office desks, training materials, gym machines etc. Your team must work together to extinguish fires and neutralize fire sources in real-time by using extinguishers, fire hoses and even foam cannons. Use the cutting device to rescue and recover trapped people from crashed vehicles, assess their condition and render treatment. Each completed mission earns you money that you may invest in the development of your fire station, hiring new personnel for your rescue crew and purchasing additional rescue vehicles. Distribute different station duties such as vehicle maintenance, cooking and cleaning to your crew. Keep up their morale by providing them with free time options. Gain experience and gradually face greater emergencies!Key Features:\nA great variety of rescue vehicles inspired by real US fire engines and ambulances.\nDuring varied day and night missions you will encounter different types of emergencies, e.g. train derailments, burning houses, traffic accidents, air crashes, industrial fires etc.\nIconic map designs based around Los Angeles, New York, Chicago and Miami fire departments with an exceptional level of realism.\nRescue trapped people from damaged cars and render first aid as a paramedic at the supervision of an emergency physician.\nManage the versatile tasks of paramedics and come to know your personal team of everyday heroes.\nKeep up your team’s morale by providing them with free time options, when they are off-duty.\nPurchase new firefighting vehicles and ambulances and recruit new personnel for your rescue team.\nCustomize your vehicles with different striping schemes.\nIncludes innovative and realistic hose setup system for missions, operations inside buildings and radio communication.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Fragment Production","platforms":[{"id":0,"name":"PC"}]},{"id":17714,"name":"Train Fever","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd5/fd5baa53a2457a9a3aed3809bb52eccd.jpg","description":"Train Fever is a railroad-focused business simulation game. In other words, it's a modern-day Transport Tycoon with procedural content and a sophisticated city simulation.\n\"It’s the year 1850, and there are great times ahead! Establish a transport company and be its manager. Build infrastructure such as railways and stations, purchase transportation vehicles and manage lines. Fulfill the people’s needs and watch cities evolve dynamically.\nTrain Fever runs on an engine specifically developed for this game. The engine has a great innovative scope and is specialized in procedural content and urban simulation. A key point is the fact that there is no grid that game objects have to be aligned to, allowing for a great degree of freedom.FeaturesRandomly generated, modifiable terrain with realistic dimensions\nAdvanced passenger simulation\nDynamically simulated urban development\nProcedurally generated buildings\nNo grid - that is, the game world is not limited to 90 (or 45) degree angles\nVehicles from more than 150 years of transportation history\nPassenger and freight transport\nAchievements and experience points\nDetailed 3D graphics\nFreely adjustable zoom factor","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":16152,"name":"GUN GODZ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa8/aa84ba709cab36466066aea4482929f8.jpg","description":"GUN GODZ is a first person shooter about gun, gangster rap and the rich culture of Venus. Players try to escape the jail of a hotel, which is the only building on Venus and is owned by a record-label owner who happens to be the God of Guns. Featuring a fully Venusian soundtrack by Jukio 'KOZILEK' Kallio and a single English track with rap lyrics by Adam 'Doseone' Kidd.\nGUN GODZ was created for the Venus Patrol Kickstarter and was only released as part of a bundle of games including a new Superbrothers game and Adam Atomic's CAPSULE.\nFeatures\nFast paced gun- and melee combat in a stylish presentation.\n12 levels, 4 secret levels and tons of speedrunning options.\nFull Venusian soundtrack by Jukio \"KOZILEK\" Kallio and Adam \"Doseone\" Kidd.\nPlayer health doesn't recharge.\nMost emotional ending in a videogame to date.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vlambeer","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14627,"name":"House of the Dying Sun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5a/a5a83ae4f766fc49e28f49359c7daa2c.jpg","description":"This game supports rebinding controls, but only dual analog gamepads and keyboard & mouse modes are officially supported in desktop mode.\nVR requires a dual analog gamepad.\nHOTAS controllers are not officially supported and are at your own risk!\nHouse of the Dying Sun is a tactical space shooter that puts you in the cockpit of the Empire's most deadly interceptor and in command of the Harbinger Fleet. Hunt down the enemies of your dying empire and upgrade your warships with new weapons and abilities earned during your campaign of terror.Key Features: Classic Space Sim Combat: Fly from the cockpit of the Executor Mk II with gameplay heavily influenced by the titans of yesteryear\nTake Command: Give orders to any vessel in your fleet from a tactical overview, switch to another fighter, or pause time and carefully consider your next move\nReplayable Scenarios: Choose one of four increasingly-brutal difficulties in each of the 14 campaign scenarios.\nPowerful Upgrades: Complete bonus objectives to earn special fleet upgrades such as the Gap Drive or the Kamikaze Chassis. You'll need these to tackle the most difficult scenarios.\nVR & Monitor Support: House of the Dying Sun was carefully designed for both traditional monitors and VR headsets such as the HTC Vive. It also supports 21:9 displays!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Marauder Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":13475,"name":"Ian's Eyes","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c0/2c07b76316cfe58fb00dedc15263bcb8.jpg","description":"Welcome to Wintreal, a small town in the northern US and home to the Blue Norholm Centenary School. Today is Ian’s first day at his new school. Being blind, Ian has always relied on North, his faithful seeing eye dog, to guide him. But not everything is as it seems at Blue Norholm, and it won’t take long until Ian’s blindness will be the least of North’s problems…\nFeatures\nGuide Ian through the game as North, his faithful canine companion\nUse stealth, misdirection an guile to avoid the ghoulish students\nNo violence","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sindie Games","platforms":[{"id":0,"name":"PC"}]},{"id":10343,"name":"Overclocked: A History of Violence","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03b/03b86a07509545b9de21dd956c16b8d6.jpg","description":"Set against the backdrop of a catastrophic thunderstorm raging over New York City, Overclocked explores an archetypical, yet actual condition of mankind: violence. This psychological thriller mixes frightening fictional thriller elements using innovative narrative structures. Overclocked charts the diffuse areas where memories and illusions; dreams and reality; perpetrators and victims; collide.\nArmy psychiatrist, David McNamara, is called to the Staten Island Forensic Hospital in New York City to consult on a case that requires his expertise in forensic psychiatry. Tasked with exploring the minds of five young men and women who were found scared, screaming, and without memory, he makes alarming discoveries as he begins to cautiously explore the psyches of his young patients. Throughout the game, players will switch between six different characters in this chilling interactive psycho thriller.Key FeaturesExperience Overclocked from various perspectives as you play as six different characters throughout the game\nExplore 45 diverse locations with densely animated pre-rendered settings\nInnovative storytelling techniques create a unique gameplay experience\nMeet and interact with a cast of intriguing characters, each with their own distinct personalities\nCharacters come to life with fluid movements and realistic facial expressions created with Emotion FX 2 technology\nCinematic cut-scenes designed using advanced camera techniques pioneered by feature films\nExceptional visuals enhanced by shadow and shader effects, real-time atmospheric particle effects (rain, snow, lightening), and dynamic lighting\nUnique icon-based dialogue system","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"House of Tales","platforms":[{"id":0,"name":"PC"}]},{"id":10152,"name":"Killing Room","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77c/77cb16b3a6ee6870d81d3bd805d8397d.jpg","description":"Special feature for streamers and their audience!Every player has an option to let his audience vote for his reward or punishment. Voting is real time and lets streamers push their show to the next level. Viewers get a chance to directly influence playthrough of their favorite streamers. Interaction between streamers and viewers has never been such fun!\nAbout the Game\nKilling Room is a first person shooter mixed with a rogue-like RPG and reality-show parody. You are an (un)lucky contestant in Killing Room, a popular reality-show in a decadent 22nd century. You know that there is only glory or death – with death winning in 99 out of 100 cases.\nFirst person shooterKilling Room offers classical first person gunplay with many weapons, even melee ones like Scythe or the  audience’s favorite flyswatter.Rogue-likeThere is Permanent death, random generation and very high difficulty in Killing Room so as to ensure that your skills will be properly tested and that every wrong move can cause you a lot of trouble.Reality-show parody We love the  idea behind the Smash TV game of the  Running Man movie/book. The Killing Room therefore aims for this. Your character is in a bad situation but he can become ridiculously rich in few hours. However, everyone will do everything possible to stop him. Killing Room is a cruel reality-show, one full of dark humor and cynicism.Online voting for streamers and viewers You can let a  real online audience decide how you will be rewarded or punished during your playthrough. Just stream the game and share the  provided URL with your followers. This is a completely new way of interaction between a player and his/her audience. We made sure that it brings a great amount of fun for both sides while it is absolutely optional. Playing without a real online audience is still a complete experience.Popularity-drivenYou will be closely watched not only by an online audience. Your actions will be evaluated by an AI audience as well. If you are boring, your popularity will drop. But if you entertain crowds, you can become their hero. Being popular is everything when it comes to TV shows! Literally, it is everything, because if you annoy the audience, they will make you regret the moment you ever entered Killing Room.RPGYour character is defined by various attributes – Stamina, Health, Speed, Defense, Accuracy, etc.   You can invest into boosting these attributes to significantly help you in your desperate effort. But you can also depend on items which can boost your attributes and even give you special effects and bonuses beyond the basic RPG system. There are double-jumps, invulnerability to traps, various maps of Killing Room sets, and tons of other useful things. But if you are a bad boy or girl with low popularity or begrudging online viewers, you can also get trouble items which will cause you…well, trouble...from hardly noticeable penalties to your attributes to serious diseases, the inability to run or losing an eye.Diverse and rich in content and gameplay Guns and melee weapons, 3 different 'worlds' with unique enemies, boss fights, more than 100 unique items, points of interest with rewards and many more awaits you in Killing Room. Also, while our show permanently tries to kill its participants, it is not only about shooting. We have prepared many interesting traps, puzzles and other elements to make sure that our show is in no way boring.\n8 random generated levels\n8 boss creatures with unique gameplay and intro animations\nOnline voting for better interaction between streamers and their audience\n15+ weapons\n25+ enemy types\n150+ unique  Items\nFighting, puzzle and trap roomsFree content patchesWe are going to support Killing Room after release not only by fixing bugs but also with free content updates bringing you more Items, Weapons, Enemies and room variations.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alda Games","platforms":[{"id":0,"name":"PC"}]},{"id":10124,"name":"Machine Made: Rebirth","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/524/524b09a9394de59a20908b17e169e0bb.jpg","description":"Machine Made: Rebirth is a classic fantasy/sci-fi RPG, you will play as Tibby, an angelic girl lost in a world of advanced technology, magic and corruption. Having lost her memories, Tibby must find a way to rediscover her history and her true self to overthrow the evil Machine God that threatens the world.\nThere are a colourful cast of characters, character customization, crafting, special summoned allies, and Memoria, items that will reveal the backstory of Tibby and her people, the Zephyrim, and will help the player to reveal the secrets of her past. These items activate scenes that will show the player Tibby's memories.\nThis game is developed for the classic retro RPG lover, someone who is waiting to sit down with a compelling cast of characters, level them up, and allow the story to unfold as they lead the heroes to victory, romance and truth, ultimately saving the world from destruction at the hands of a Machine God!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Proteus Studios","platforms":[{"id":0,"name":"PC"}]},{"id":5559,"name":"EyePet","genre":"Family","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0dd/0ddf0e1525c221307c884727ba7d6ea1.jpg","description":"Say hello to EyePet™, the newest member to your family.  Grab a PlayStation®Eye camera(required) and your PlayStation®Move motion controller (required) and watch as he comes to life right in your living room.  Give him a shower, play with him or even draw a plane on-screen that magically spring into action.   You've never experienced a virtual pet like this.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":2249,"name":"The Warriors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4db/4dbd2ee4f8be8ef3bb25583d6d02a7a3.jpg","description":"New York, 1979. A battle on the streets. The armies of the night number 60,000 strong, and tonight they’re all after The Warriors – a street gang wrongly accused of killing a rival gang leader. The Warriors must make their way from one end of New York to their turf on the other side of the city. All that stands between The Warriors and their survival are 20 miles and thousands of street gang members. The army of gangs owns the streets and there’s no turning back, they must fight for their lives and learn the meaning of loyalty as danger and uncertainty emerge form the city night.\nExperience The Warriors® for PS2™ with full 1080p up-rendering and enhanced features such as Trophies, Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with 'PS Vita' or PS App.\n1-2 players\n4GB minimum save size\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2005 Rockstar Games, Inc., Rockstar Games, Rockstar Toronto and the R* logo are trademarks and/or registered trademarks of Take-Two Interactive Software Inc. The Warriors® & ©2005 Paramount Pictures. All Rights Reserved. This videogame is fictional doesn’t depict any actual event/person/entity & any similarities are coincidental.  Take Two doesn’t endorse or encourage the depicted conduct. Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is strictly prohibited. Software is subject to license in manual & online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee and/or online account registration (13+).This title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not supportPlayStation®2 peripherals, therefore some functionality may not be available","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Rockstar Leeds","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"}]},{"id":1448,"name":"Clash of Clans","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/761/76129e9a98953bd17583f2a8cb776214.jpeg","description":"From rage-­filled Barbarians with glorious mustaches to pyromaniac wizards, raise your own army and lead your clan to victory! Build your village to fend off raiders, battle against millions of players worldwide, and forge a powerful clan with others to destroy enemy clans.\n\nPLEASE NOTE!  Clash of Clans is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.  Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Clash of Clans.\nA network connection is also required.\nFEATURES\n●\tBuild your village into an unbeatable fortress\n●\tRaise your own army of Barbarians, Archers, Hog Riders, Wizards, Dragons and other mighty fighters\n●\tBattle with players worldwide and take their Trophies\n●\tJoin together with other players to form the ultimate Clan\n●\tFight against rival Clans in epic Clan Wars\n●\tBuild 18 unique units with multiple levels of upgrades\n●\tDiscover your favorite attacking army from countless combinations of troops, spells, Heroes and Clan reinforcements\n●\tDefend your village with a multitude of Cannons, Towers, Mortars, Bombs, Traps  and Walls\n●\tFight against the Goblin King in a campaign through the realm\nPLAYER REVIEWS\nClash of Clans proudly announces over one million five star reviews on the App Store.\nSUPPORT\nChief, are you having problems?  Visit http://supercell.helpshift.com/a/clash-of-clans/ or http://supr.cl/ClashForum or contact us in game by going to Settings > Help and Support.\nPrivacy Policy:\nhttp://www.supercell.net/privacy-policy/\nTerms of Service:\nhttp://www.supercell.net/terms-of-service/\nParent’s Guide:\nhttp://www.supercell.net/parents","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Supercell","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":746,"name":"Destroy All Humans! 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ba/1ba13d8a55d0196976ad852964fa91b0.jpg","description":"Assume the role of the human-hating alien Crypto once again, in the sci-fi action adventure spoof, bound to enslave mankind.\nTake revenge on humanity for destroying your mothership. “Make War, not Love” and take on new enemies such as secret agents, giant creatures, Soviet Forces and even ninja warriors in an expanded open-world.\nAn upgraded arsenal of alien weapons and mental abilities helps you take on the world of free love, cold war and other era icons.\nNew game features include body snatching humans, forcing them to dance to psychedelic music in order to let them forget they saw you, or abducting them to upgrade your abilities.\nThe new co-op multiplayer mode gives you the option to play story mode or several minigames such as Tennis and Duel together with a friend.\nAll Humans must be destroyed!\nAdditional hardware required for Remote Play.\n1-2 players\n3GB minimum save size\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 THQ Nordic AB, Sweden. Developed by Pandemic. Destroy All Humans, THQ and their respective logos are trademarks and/or registered trademarks of THQ Nordic AB. All rights reserved. All other trademarks, logos and copyrights are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox"}]}]