[{"id":19511,"name":"Act of War: Direct Action","genre":"Action","price":0.0,"description":"Tomorrow's War Is NOW\nRipped from today's headlines, Act of War: Direct Action™ is a frightening tale of suspense, international intrigue and geopolitical military conflict. This real-time strategy experience puts you squarely in control of counterterrorist forces and delivers a first look at tomorrow's war.\nThe Situation:\nA crippling energy crisis. Terrorist attacks. Massive strikes. Global instability.\n\nThe Enemy:\nA shadowy Consortium of back-room conspirators determined to throw the world into utter chaos using widespread terror tactics.\n\nThe Heroes:\nA new \"direct action\" operation known as Task Force TALON to counter massive military assaults, rescue hostages, conduct classified spy missions, take prisoners and stop an unpredictable enemy bent on toppling the world's governments.\nCommand ultra-realistic modern military units\nPower-packed combination of high-end cinema, video effects and live action\nIntense multiplayer operations for up to eight players\nReal urban combat, including POW captures and landscape destruction\nGripping storyline by NY Times bestselling author, Dale Brown","imageUrl":"https://media.rawg.io/media/screenshots/157/1576d25275a7bf5a712226de1b2b0030.jpg","releaseYear":2004,"developer":"Eugen Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19141,"name":"NEO AQUARIUM - The King of Crustaceans","genre":"Action","price":0.0,"description":"TWO FISH ENTER, ONE FISH LEAVES.\nThis is a competitive 3D shooting game based on crustaceans.\nYes, you read that right.\nYou get to control unique creatures like lobsters, crabs and barnacles, in a wild water world that exceeds all human sense.\nExperience intense battles that take place in “NEO AQUARIUMS,” dimensionally linked aquariums that promote the evolution of organisms, and use skills that are unique to arthropods, such as “molting” and “self-amputation.”\nYou can even customize your own aquarium by placing the small creatures and pieces of terrain you earn in battle. Use your wild nature and your strategic skills to become the King of Crustaceans!Game Modes\n- Story Mode\nIn this mode, you battle all kinds of aquatic creatures while enjoying the tantalizing story.\n- Free Battle Mode\nYou can play local competitive multiplayer for up to 4 players using split-screen, or you can battle online via Steam network.\n- Aquarium Edit Mode\nHere you can use the parts you earned in Story Mode to customize your own stages. The creatures you place will come to your aid during combat.Message from the creator\nHave you ever really looked at the crawfish and crabs you eat so casually every day?\nTheir hard shells, their sharp claws and spines, their 10 legs that they can amputate in case of emergency, their compound eyes that allow them to see in all directions...\nThey are beautiful fighting creatures, shaped by nature to survive with only their bodies in the hostile environment of the deep sea.\nIn most video games, human beings shoot lasers and fly through the sky as if it’s nothing, but I asked myself the question: “What if lobsters and crabs had these kinds of powers?”\nNature’s strategies sometimes far exceed the creativity of humans.\nIf you reach a deadlock in the human struggles of your daily life, try turning your eyes towards nature; I’m sure you’ll find quite an unexpected battle for survival there.","imageUrl":"https://media.rawg.io/media/screenshots/427/4273f79f666a8d2645e341f96e0d5d51.jpg","releaseYear":2015,"developer":"Nussoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19115,"name":"7th Legion","genre":"Action","price":0.0,"description":"There's no Salvation from this army!\nCan you survive this furiously fast, kill-for-money, real-time blood-fest? There's nowhere to hide as you smash your opponent in'to-the-limit' conflict. And, while you've got a few nanoseconds to spare, you've got to build to survive, mechs, tanks, troops, mounted slavens - a host of murderous military units who will hone their killing skills with experience.\nJust what devastating effect does a 7th legion priest have in battle? what happens when you summon the dark legion?\nThe landscape is isometric and you've got to be ice-cool to survive in the blazing heat of combat. And there's more! Random power ups and a massive selection of battle cards that can turn the tides of war in a flash. But be careful: you don't know what cards your opponent is holding and even when you've got his last trooper cornered he might play the battle card that wipes away your entire force!\nSalvation? They'll be lucky to find a stone to crawl under! 7th Legion\nGame Features:\nJump into over 40 massive missions including indoor and night scenarios.\nBeat the clock in special timed sub-missions.\nManage your force's skill and accuracy using the experience-based ranking/promotion system.\nChange the course of battle at key moments with ranom power ups and battle cards.\nSoundtrack included!","imageUrl":"https://media.rawg.io/media/screenshots/48f/48f286898cf81d09f56343401536ec61_3n6bWlW.jpg","releaseYear":1997,"developer":"Epic Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18957,"name":"Broomball VR","genre":"Adventure","price":0.0,"description":"Experience the thrill of flying from the comfort of your broomstick. Blast your way across the field to score the winning goal before time runs out!\nLearn to Fly, Score, and Fight as you prepare your skills for the game day!\nWe want everyone to know that we are working on polishing the game and adding in a multiplayer mode as well. We are releasing Broomball for free before the update because we want to get feedback on the game mechanics to make sure we can provide the best experience for everyone. We hope you enjoy playing the game as much as we have enjoyed the development process.\nHappy Hunting,\nThe Broomball Team\nWe will also be releasing free tutorials on www.leadingones.com detailing our development process for any developers out there who are interested in getting started with making their own VR games!","imageUrl":"https://media.rawg.io/media/screenshots/6a8/6a8f646dc1eb5bfc5bbe0f62c4dd45e0.jpg","releaseYear":2016,"developer":"Priyam Parikh","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18196,"name":"Destiny of Ancient Kingdoms","genre":"Action","price":0.0,"description":"Destiny of Ancient Kingdoms (DOAK) is a free, action MMORPG based on the legends of Norse Mythology. An epic story-line, action-packed combat and classic multiplayer roleplaying elements await strong warriors who are courageous enough to enter the New World!\nExplore and defend your Kingdom from enemies so that it never falls into a state of chaos and destruction. Our immersive MMORPG will take you from beautiful cities to subterranean paradises, with a few stops in scary, war-torn regions along the journey to discover your destiny.Key features 100% Free-to-Play\nThe breath-taking lands of the New World are 100% free for everyone to experience.\nObliterate your Adversaries:\nObtain rare equipment by destroying antagonizers in powerful PVP battles that will satisfy your need for an enthralling combat experience, because every attack feels viciously visceral, requires consideration and looks spectacular on your screen.\nExtensive Multiplayer Functionality:\nGuilds, Teams and Arenas are perfect ways to make lasting friendships that will stay with you throughout your journey. You must be part of a guild to make your own luxury equipment, build guild towers to expand your guild map or have the right to compete to be crowned as King.\nRule your Kingdom with an iron fist:\nBecome the first to claim the throne as King of your Kingdom. Change the fate of your citizens by throwing rabble-rousers in the Kingdom Dungeon or by cutting out the tongues of foul-mouthed miscreants. The King can also reward hardworking players by releasing additional experience for completing Kingdom Tasks successfully.\nStart a revolution:\nThe King can be impeached by the residents of the Kingdom for being a tyrant who rules the Kingdom recklessness. If the impeachment fails, then you can always make a monkey of the King in the King’s Scramble arena to claim the prestigious title of King for yourself.\nSafeguard your Kingdom’s Honor:\nKill players from other Kingdoms to gain honor points that can be used to acquire powerful items for your character to help solidify your Kingdoms place as the dominant kingdom on the the World Ranking.\nA Brand New World to Explore:\nThe New World is a perfect escape for anyone who is in need of a well-deserved holiday. There are 66 different maps to explore, with a unique blend of fun activities to complete, treasures to discover, and monsters to defeat on your adventure.\nSafeguard your Kingdom’s Honor:\nKill players from other Kingdoms to gain honor points that can be used to acquire powerful items for your character to help solidify your Kingdoms place as the dominant kingdom on the the World Ranking.Story BackgroundThe New World is in a state of turmoil after a mysterious dark lord returned to the world to resurrect and reclaim control of his wicked army, the Night Devil Legion. They seek to take revenge on the foolish mortal Kings who had forsaken them, by releasing the all-powerful Energy of Chaos that mutated the natural environment and caused the population to completely lose their minds. The insanity spread through the world causing many people to become unnecessarily violent with each other. This disruptive behavior made it easier for never-ending disputes to develop between the Kingdoms, which eventually lead to an all-out world war breaking out .\nYou are destined to liberate your Kingdom by destroying the malicious dark lord who is orchestrating the war from the shadows, thus preventing the Energy of Chaos from further infecting the minds of the people of your Kingdom.\n","imageUrl":"https://media.rawg.io/media/screenshots/951/9517aee2e5bd28326b6f8e636abbe4df.jpg","releaseYear":2016,"developer":"Utopia Dream Entertainment Alliance (Pty) Ltd - South Africa","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16442,"name":"Lords of the Realm","genre":"Strategy","price":0.0,"description":"The year is 1268, the English throne lies empty, and power-hungry lords are ready to wage war for newfound power. Your people now look to you to lead them to glory and prosperity. Manage your lands, strike bargains, betray alliances and ultimately destroy your rivals in this classic combination of turn-based and real-time strategy, and become the undisputed Lord of the realm!Medieval Strategy on a Sweeping Scale\nYou begin as the ruler of a small county, but lead wisely and keep your people secure and thriving, and soon you’ll broaden your horizons.\nManage your farms, make trade negotiations, build castles, flatter and deceive your opponents and then march your armies into the lands of your rival nobles. Unify the land under your rule, and prove you have what it takes to be King.Key Features\nFight for the crown in England against up to five AI opponents.\nStrengthen your kingdom across seasonal turns, mastering quandaries like crop rotation, taxation, trade, transport and even thievery!\nFortify your lands and design castles with moats, towers, drawbridges, keeps and more.\nConquer your rivals in challenging real-time battles that test your tactical acumen.\nMultiplayer notice: LAN and online play are unavailable.","imageUrl":"https://media.rawg.io/media/screenshots/459/4594917a5192c471b301b4ae5bd696de.jpg","releaseYear":2015,"developer":"Impressions Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14325,"name":"Disoriented","genre":"Indie","price":0.0,"description":"A first-person puzzle game. Simply walk to the door.Features30 Unique levels from easy to very hard.\nSwitch camera to get a better view of the puzzle.\nCreate your own check point, anywhere.","imageUrl":"https://media.rawg.io/media/screenshots/0e9/0e9514dead2004e9774cfc3ec7494591.jpg","releaseYear":2016,"developer":"BrickCream","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12081,"name":"Totally Unbalanced","genre":"Action","price":0.0,"description":"[BUNDLE] OtakuMaker Studio Pack are Here!OtakuMaker Studio Pack - All Games : http://store.steampowered.com/bundle/426/OtakuMaker Studio Pack - Part #1 : http://store.steampowered.com/bundle/432/OtakuMaker Studio Pack - Part #2 : http://store.steampowered.com/bundle/433/OtakuMaker Studio Pack - Part #3 : http://store.steampowered.com/bundle/1053/OtakuMaker Studio Pack - Strategy #1 : http://store.steampowered.com/bundle/436/OtakuMaker Studio Pack - Shoot'Em Up #1 : http://store.steampowered.com/bundle/1054/OtakuMaker Studio Pack - Adventure #1 : http://store.steampowered.com/bundle/434/\nAbout the GameTotally Unbalanced is a platform game where you control a totally unbalanced ball\nBadges : INTRODUCTION\nTotally Unbalanced is a platform game developed with Unreal Engine 4 addressed to hardcore and casual gamers.\nThe goal of the game consists in completing levels in the minor time possible. The game is separated in chapters that contains at least 10 levels with various,different and fun puzzles. Select your favorite skin and jump in this new epic adventure!GAMEPLAY\n- Roll, Jump and overcome many obstacles.\n- Complete puzzles various and complex.\n- 21 relaxing in-game soundtracks and 5 soundtracks in main menu.MULTIPLAYER :\n- Online Multiplayer with stats and ranks.\n- The \"Sumo Arena\" where 4 players fight to stay on the arena!\n- The \"Ball Race\" mode where 16 players run toward the end of the map and try to arrive first.\n- Get UnbalancedPoints when you win or survive and rank up.\nUPDATES :\n- New Chapters.\n- Big Updates every 1/2 weeks.\n- New Skins.\n- New Songs.\n- Optimizations for poor hardware.\n- Workshop with user-created content (skins,models) and maps.\n- Modding support\n- Multi-platform supportLet's play!","imageUrl":"https://media.rawg.io/media/screenshots/c2b/c2b1575d91268add545cbb701b45f7b7.jpg","releaseYear":2016,"developer":"Isojumper","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12040,"name":"IL-2 Sturmovik: Battle of Stalingrad","genre":"Simulation","price":0.0,"description":"Important infoDigital Deluxe Edition includes the game itself and both unique premium DLC planes:\nand TO PLAY THE GAME YOU NEED AN ACCOUNT AT https://il2sturmovik.com\nUSE YOUR KEY TO ACTIVATE THE GAME ON YOUR PROFILE\nCLICK HERE TO OPEN THE ACTIVATION GUIDE\nAbout the GameIL-2 Sturmovik: Battle of Stalingrad is the continuation of the legendary IL-2 Sturmovik series that has set the standard for PC combat flight games for more than ten years. This new entry into the series will offer virtual pilots an even more accurate simulation of the most famous air battles of World War II. Better quality of content, bigger scale , new physics, more realistic aerodynamics and new game elements set this title apart from all which came before. We have only one goal - To give you a New Higher Level of Immersion!\nKey Features:\nPLAY:\nRobust Single-Player Campaign that features a challenging and innovative AI system. Includes an extensive in-game achievement system that allows players to unlock historically based airplane modifications and upgrades as your campaign progresses.\nRealistic graphics and unique visual effects: clouds, lightning, tracers, explosions and huge smoke plumes - all of them fully realized to recreate the aerial combat scenerey of war time Stalingrad.\nFlexible Quick Mission mode that allows you to create your own custom combat scenario in just a couple of minutes.\nClassic Multiplayer gameplay with dedicated player controlled servers with your favorite settings for team battles and dogfight duels.\nFLY:\nRealistic sounds and physics, detailed aircraft systems modeling, advanced aerodynamics and state-of-the-art flight modeling gives you a real sensation of flight.\nBecome an ace fighter pilot or try your hand at flying attack planes and bombers where you can destroy tanks, trucks, AAA batteries, artillery units and even armoured trains.\nControl your plane with either joystick or mouse keeping a highest level of simulation fidelity and accuracy.\nFor those that won’t make it back to base, each plane comes equipped with a handy parachute!\nCOMBAT:\nHone your skills versus AI or join multiplayer where you can fight in the air or on the ground, manning T-34-76 or Pz III Ausf L tanks.\nControl a plane or tank all by yourself or have your friend aim a tank gun or a bomber turret.\nUnique and detailed damage model lets you use the pros and cons of various aircraft and tanks to your advantage.\nAdjust the tank aiming sights for distance and view the tank interior just as a plane cockpit!\nLEARN:\nAction takes place on a 358 х 230 km map - The largest and most detailed recreation of the Battle of Stalingrad theatre ever modeled in a flight simulation with unique structures, buildings and landscapes.\nSingle-Player Campaign scenario follows the real chronology of the battle starting with Operation Uranus on November 19th, 1942 and continues to the complete liberation of the city on February 2nd, 1943.\nTen Legendary aircraft of the era have been thoroughly re-created using original drawings and blueprints from the Central archive of the Russian Ministry of Defence.\nPrecise simulation of the flight model allows everyone to learn the special character and limits of each and every plane in the game. Use each of their special abilities and performance characteristics to complete your mission and survive the brutal fight.\n\n\n","imageUrl":"https://media.rawg.io/media/screenshots/bba/bba05750402df32e81e0adad7809dd75.jpg","releaseYear":2014,"developer":"1C Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11933,"name":"D: The Game","genre":"Adventure","price":0.0,"description":"The story begins in 1997. It's the dead of night in the city of Los Angeles, and there has been a mass murder at a general hospital on the outskirts of downtown. The perpetrator is the director of the hospital, Richter Harris. He has shut himself up in the hospital and taken a number of patients as hostages, leaving the police helpless and unable to move in. Richter's only daughter, Laura Harris, after hearing the situation, rushes to Los Angeles from San Francisco, and drives alone to the tragic scene at the hospital ground. Upon entering the hospital Laura finds herself transported to an old mansion, while the disembodied voice of her father pleads with her to leave. Nevertheless she must press forward to save her father and herself.","imageUrl":"https://media.rawg.io/media/games/a14/a14f3e47a97981a9d3b86d6123632f3e.jpg","releaseYear":1996,"developer":"WARP","libraryGames":null,"platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":11628,"name":"They Came From The Moon","genre":"Casual","price":0.0,"description":"What if alien life is closer than we think?\nNot in faraway galaxies or on planets still unknown to the human race... What if it was shining into our eyes every night for the past 4.5 billion years?BantaraThey call themselves the Bantarans for Bantara is the native name of the Moon. Similar to humans, and yet so much different. Bantarans are known to have not one heart like the humans, not even two hearts like the Doctor, but even three hearts functioning perfectly within their bodies. But where are they? And why haven't we ever seen them? There's a catch... The Bantara mother carries the Bantara baby inside of her for about 4000 years... That's how much it takes for those three hearts to become perfectly synchronized. But their lifespan reaches more than 100 000 years. How come? There are absolutely no known bacteria nor viruses on the Moon leaving them with the perfect chance to evolve very fast...1969, human year\nUntil 1969 - human year. That's when us, humans, had made our big achievement and landed on the Moon's surface. We gloated for a while and then simply gone away leaving behind a neovirus that is not detectable by human technology. That was the end of the life as the Bantarans knew.\nAfraid, desperate and almost hopeless, the Bantarans decided to run for their lives... And their target was Earth... They didn't hate, they didn't want revenge, they simply wanted the humans to help them. But they were, as us humans would say, naive.The Landing\nAs soon as they have landed and made contact, we started protesting against helping the aliens for they might be our enemies. Typically. Human scientists were forced to lock the Bantarans inside laboratories and conduct experiments, but there was one person who has restored the faith in humanity. Dr. Oliver Pendaka declined to commit genocide and released the Bantarans making it possible for them to flee further inside the laboratory.\nThere still might be hope for the Bantarans from the Moon. Save the race of our night light!","imageUrl":"https://media.rawg.io/media/screenshots/3f4/3f41c400a2f342b4d2d33ef513784e3e.jpg","releaseYear":2016,"developer":"Zonitron Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11621,"name":"Absconding Zatwor","genre":"Action","price":0.0,"description":"RANDY CROW\nRandy Crow was an ordinary guy living an ordinary life. Nice family, 2 brothers, a dog... But then one night he went to the gas station to buy cigarettes and witnessed a brutal murder of a station cashier. By the time the police got there, it was already too late - the killer was long gone and Randy was the only guy around...ZATWOR\nThat's when they took him and locked him up for good. The prison they took him to was Zatwor - the most brutal prison in the country.WILL YOU HELP HIM?\nAware of his innocence, Randy decided to run away! In his way is only the best security system in the world. Will you be his juror and help him in proving himself not guilty?","imageUrl":"https://media.rawg.io/media/screenshots/2d1/2d177647dcd729411df9c4a63d506095.jpg","releaseYear":2015,"developer":"Zonitron Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10272,"name":"Cuit","genre":"Strategy","price":0.0,"description":"In CUIT, it is only you and your mind. A challenging and relaxing puzzle experience, ready to test you from top to bottom.\nYou are given a circuit. Interact with the buttons to navigate a current from the battery to a special target - Just make sure to avoid all the explosives, or you will have to start all over again. Sounds easy? Try it. And guess again.CUIT is challenging. Really challenging  The term \"challenging\" is very overused these days. But to finish CUIT, you'll have to do your very best of logical thinking. But don't worry: CUIT is a perfect pastime for everyone, who likes to challenge their mind every now and then. No need to be a superhero.\nCUIT doesn't require any prior experience in binary logic, circuits or computer engineering CUIT teaches it.\nCUIT is more than just a puzzle game: Create and share your own levels and playlists with the world and explore the wildest and most insane creations of the community - In CUIT, you are not restricted to only puzzles: With it's native support of logical operations, you can basically create functioning computers within it - The only limitation is your mind.\nLevel up through 4 tiers and 60 ranks, solver over 100 levels, earn the golden trophy's for each and unlock new backgrounds, special puzzles and gather all Steam-Achievements. Create your own mind-bending levels and watch others loose their head over it. Come in - relaxe - and have fun!\n-Over 70 Levels\nIntegrated Level-Builder\nIntegrated Steam-Workshop Support\nSoundtrack with 10 tracks by 'AK' (Aljosha Konstanty)\nSteam Acchievements\nRanks and Tiers\nLevel-Challenges\nOver 30 logical gates\nSpecial Level-Creator-Features","imageUrl":"https://media.rawg.io/media/screenshots/591/5916cf1a01ed79b2ca54d6f56c7c9d86.jpg","releaseYear":2017,"developer":"Class-X Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10244,"name":"Heroes of Shadow Guard","genre":"RPG","price":0.0,"description":"Experience both sides of dungeon crawling in Heroes of Shadow Guard!  Navigate deadly labyrinth dungeons and design your own in this ground-breaking cross-platform MMO. Place the walls, guards, traps, and more before heading out to raid opponent labyrinths in classic first-person turn-based combat.  Unlock new heroes, new gear, and new labyrinth guards. Conquer 2 full single player sagas, climb the multiplayer leaderboards, and challenge friends to custom matches.\nBuild your own Labyrinth Dungeon - decide the layout, guards, traps, and more.\nRaid other player labyrinths in 3D turn-based combat.\nChallenge friends or faction members to Custom Matches.\nPlay the same account on your PC, Android, and iOS devices.","imageUrl":"https://media.rawg.io/media/screenshots/f85/f851820573050cd4e96cbe776fe3d064.jpg","releaseYear":2016,"developer":"Iron 27","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9639,"name":"The Guild 3","genre":"RPG","price":0.0,"description":"We find ourselves in middle Europe of the year 1400. The dark middle ages, once dominated through nobles and clergy, ends and a new era begins: the age of the free cities of trading and of the free mind!\nIn The Guild 3 you create a family dynasty which can last for centuries. While the world around you and your dynasty rearrange itself again and again - all non-player figures make their own decisions - you have to prove your skills in handicrafts and trading, at social occasion and finally in politics and in malicious intrigues.\nThe Guild 3 is a unique mixture of economic simulation, strategy game, historical life simulation and role playing game in real time 3D, with atmospheric voice recording and medieval soundtrack.\nBeautiful world that looks and feels alive, with day and night cycle and the four seasons Spring, Summer, Autumn and Winter, each with specific influences to the world.\nMany \"Story Quests\" offer hours of game fun!\nMultiplayer experiences with up to 16 players and more at once!\nKnown and Secret Societies, e.g. the Freemasons and the Alchemists Guild! Join one of the societies, support your fellows and get supported, get access to special powers of your society and try to mold your city and whole scenario map according to your societies philosophy!\n12 unique scenario maps that comprise one or more cities and their surroundings, based on original historical locations in central and northern Europe.\nMighty scenario editor that allow you to design your own scenarios.","imageUrl":"https://media.rawg.io/media/screenshots/6c4/6c439ca1b33541a8957504c5431f6c15.jpg","releaseYear":2022,"developer":"Purple Lamp Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":2829,"name":"Siralim","genre":"RPG","price":0.0,"description":"Siralim is a deep RPG with light roguelike elements that allows you to summon and customize hundreds of creatures to fight in strategic battle. Fight your way through randomly generated dungeons and complete randomized quests. Find rare treasure and use it to upgrade your castle, empower your creatures, craft powerful artifacts, learn new spells, and much more.Features Randomly generated dungeons and quests - no two dungeons are alike!\nCapture and summon over 300 unique creatures to fight for you. Each creature has its own unique abilities which directly affect the way you play the game.\nCast over 100 powerful spells to turn the tide of battle.\nFight in challenging battles that reward thoughtful strategy rather than mindless button mashing.\nUpgrade your castle to add new rooms, to unlock new creatures, and to entice new citizens to live in your kingdom.\nCraft and enchant equipment to augment your creatures' power or to grant them new abilities. There are over 500 different crafting materials to collect and use.\nCreate eggs that will someday hatch into extremely powerful creatures.\nFight in your kingdom's battle arena for fame, fortune, and glory.\nInfinite playability. There is no level cap, no restrictions, and the game never ends. Want to play until your character is level 937? Go for it.\nA roguelike overworld where you can see your enemies approaching before battle begins.\nEver-expanding: we frequently release major content patches that give you access to new creatures, items, and other things to do.","imageUrl":"https://media.rawg.io/media/screenshots/8e5/8e5b9710cfa1921aa16cd3f68259eab9.jpg","releaseYear":2015,"developer":"Thylacine Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"}]},{"id":1991,"name":"#KILLALLZOMBIES","genre":"Action","price":0.0,"description":"In the distant future, #KILLALLZOMBIES is thrusting civilians into a sport of survival were a ravenous zombie population is unleashed in the name of sports entertainment. With the potential of a collective horde of over 1,000 zombies, television spectators vote upon how many and what kind of zombies or obstacles they want to uncage to make survival all the more harder for you to accomplish.\nFeaturesHordes of zombies to fight on interactive changing arena\nLive stream interactions enabling spectators to affect gameplay while watching the broadcast on Live from Twitch\nThree modes to play: Survival, Local Co-op and Defend the Vault\n100+ Powerful perks and Twitch chat commands\nDangerous zombie bosses!\nMultiple weapons and ammo types","imageUrl":"https://media.rawg.io/media/screenshots/675/6757ce7a1264aa9efe8a6f9fcf45e172.jpg","releaseYear":2014,"developer":"Beatshapers","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":449,"name":"Double Dragon IV","genre":"Action","price":0.0,"description":"The next entry in the side-scrolling action game series Double Dragon is finally here!\nThe story picks up after the elimination of the Black Warriors in Double Dragon II!\nExperience all-new exhilarating action with the original old-school graphics!\nUse the art of Sou-Setsu-Ken to rescue the kidnapped Marian!\nPlus, new enemy characters including ninjas, karate masters, and sumo wrestlers,\nnone of which have been seen in Double Dragon before!\nThere are lots of extra modes, too! Cool new features fans have been waiting for!\nPlayable enemy characters, VS Mode, Tower Mode, and even more!","imageUrl":"https://media.rawg.io/media/screenshots/0bc/0bcda1bb33d59f84b01e33d8cd964b7e.jpg","releaseYear":2017,"developer":"DotEmu","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":971384,"name":"Heroes of the Three Kingdoms","genre":"Action","price":0.0,"description":"游戏简介\n《三国群英传》是由宇峻奥汀（Odin）公司出品的一款策略战棋游戏，也是三国群英传系列的第一部作品  ，于1998年发布。\n游戏按即时制展开，双方行动和交战同时进行。游戏进行的大致流程是“内政经营模式”到“大地战略模式”，然后到“战争发生”，再循环到“内政经营模式”。\n游戏特色：\n搜索地图，开发人口\n武将智力、武力达85以上可进行地图搜索，开发人口后可增加人口，增加金钱，预备兵役上限会增加，武将可以多放一些，开发到一定程度，可以达到10个以上。每年年初发钱，也可以从别的城市调兵来。人口多，金钱多，兵就多。\n筑城防守，征兵御敌\n守城时可为己方武将防御加成，通常武力相差5点以内会比较明显，受攻击时回避概率更大。\n文臣武将，皆有所用\n武将战斗后需要在城里休息才能回复体力和技力。而派遣智力较高的文将当做太守时，武将的回复速度会更快。\n兵种相克，权谋为上\n游戏内设有多种兵种，且兵种互相制约。\n招降武将时需要符合历史史实，若是武将所属君主尚未战败，则该武将也无法被招降\n注：游戏暂不支持窗口模式","imageUrl":"https://media.rawg.io/media/screenshots/6ac/6ac0e965444ae2b8c8375b6ad87b8fe6.jpg","releaseYear":2020,"developer":"USERJOY Technology CO.,LTD.","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":962381,"name":"Little Kitty, Big City","genre":"Action","price":0.0,"description":"You're a curious little kitty with a big personality, on an adventure to find your way back home. Explore the city, make new friends with stray animals, wear delightful hats, and leave more than a little chaos in your wake. After all, isn't that what cats do best?\n\nWill you make your way home or will you explore what the big city has to offer first? I mean, getting home is obviously your main priority. Obviously. Well, it's one of your priorities. Maybe more of a guideline... It's definitely on your To-Do list somewhere! But first? Exploration!","imageUrl":"https://media.rawg.io/media/games/c11/c119d11961d785498ccb8e1ed9b006ca.jpg","releaseYear":2024,"developer":"Double Dagger Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":554699,"name":"Dordogne","genre":"Adventure","price":0.0,"description":"Dordogne is a narrative adventure game in which you play as Mimi, a young woman visiting the house of her recently deceased grandmother who left her letters and puzzles to solve. To do so, Mimi will revisit her childhood memories and reconnect with the little girl who marveled at everything.","imageUrl":"https://media.rawg.io/media/games/fbf/fbf8f847b4e86ec02f9b2b91f93650c3.jpg","releaseYear":2023,"developer":"UN JE NE SAIS QUOI","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":457861,"name":"Pokémon Unite","genre":"Action","price":0.0,"description":"Team up and take down the opposition in Pokémon’s first 5-on-5 strategic team battle game! Join Trainers from around the world as they head for Aeos Island to compete in Unite Battles! In Unite Battles, Trainers face off in 5-on-5 team battles to see who can score the most points within the allotted time. Teamwork is key as you and your teammates defeat wild Pokémon, level up and evolve your partner Pokémon, and knock out the opposing team’s Pokémon to prevent them from scoring points.","imageUrl":"https://media.rawg.io/media/screenshots/b4b/b4b13242c7dedfa1b16bb15929dfac50.jpg","releaseYear":2021,"developer":"The Pokemon Company","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":326260,"name":"Monsters of Little Haven","genre":"Adventure","price":0.0,"description":"The main focus in «Monsters of Little Haven\" interactive novel is a story of Little Haven village. At the heart of the action are a twelve-year-old Kenneth and his younger sister Esme, children of the Murphy family, who hit the trail of a mysterious monster following series of entangled events\nThe nonlinearity of the story allows you to learn a variety of secrets surrounding the Murphy family. The main goal is to find the approach to all of them.\nFeatures:\nA unique atmosphere and a visual imagery following the peculiar mood of the novella.\nEight alternative endings of the game, radically varying from one the other.\nWhile making decisions one has an opportunity to learn the history of the Murphy family from various perspectives.\nA unique soundtrack for each of the endings and a great attention to sound work on the whole.","imageUrl":"https://media.rawg.io/media/screenshots/69e/69e773ea9c0566e42ede2d71be377c49.jpg","releaseYear":2020,"developer":"Nikita Kaf","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":62101,"name":"KOEWOTAYORINI / 声之寄托","genre":"Adventure","price":0.0,"description":"“喂喂，求求你啦！救救我！”\n——你接到这样一个电话\n发出这样的求救，给你打电话的人，是一名被监禁的少女\n如果你挂断了电话，少女就会被残忍杀死\n她将希望寄托给了声音，寄托给了这通电话，寄托给了在电话另一边的你\n你能否不辜负她的期待，成功将其救出呢？\n◆玩法◆\n少女会用电话向你说明现在的状况，你要仔细听他的话，并记录好情报。\n你可以利用这些情报，通过【呼叫少女】和【网页搜索】选项，来引导少女逃走\n◆特点◆\n本游戏为关卡制，总共13关！全通关两小时左右！\n搭载超过６００条语音！\n根据你的选择，结局会发生变化！\n遇到难题的时候，可以看提示！","imageUrl":"https://media.rawg.io/media/screenshots/9c6/9c603cdfc40ee500d54db524bce2d0a5.jpg","releaseYear":2018,"developer":"あみそ組","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":60935,"name":"Valthirian Arc: Hero School Story","genre":"Action","price":0.0,"description":"BECOME THE GREATEST PRINCIPAL\nOversee the development of your hero school, build structures, upgrade facilities, and manage the day-to-day activities of your students\nDEVELOP YOUR STUDENTS\nTrain your warrior, mage, and ranger students to hone their abilities and unlock powerful sub-classes such as paladin, scholar, harlequin and more!\nHELP THE CITIZENS OF VALTHIRIA\nDeploy students on timed errand missions across the world or head out to take on quests with your own squad to experience the adventure first-hand\nMASTER MIGHT AND MAGIC\nUse powerful skills and cast explosive spells in real-time combat with a party of four students\nCRAFT A WIDE VARIETY OF WEAPONS AND ARMOR\nGather materials from enemies and develop recipes to craft more powerful equipment to enhance your student’s abilities\nEXPERIENCE A GRAND RPG STORY\nForge alliances with one of five rival queendoms to influence the fate of all Valthiria and experience different endings","imageUrl":"https://media.rawg.io/media/screenshots/eb0/eb0a3d2930f9cabd422322e6682037ec.jpg","releaseYear":2018,"developer":"Pqube","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":60730,"name":"Iron League","genre":"Action","price":0.0,"description":"Welcome to the Iron League, a real-time arena teamfight game!\nExperience the spectacular arena battle with users all around the world!- Iron League is a real-time MOBA game that supports various modes such as Quick match, Rank match, and Beginner's game. Grasp the thrill of victory with your strategy and tactics!\n10-minute-a-round, endless teamfight!- One round in the League ends in about 10 minutes. Overwhelm your enemies with short and breathtaking battles!\nExplore 5 unique arenas with 30+ memorable characters!- To win on 5 different types of arena with unique strategic objectives, you need to be creative. Display your prowess with heroes of distinct class roles: range-dealer, tanker, supporter, warriors, and assassins!\nIron League awaits your challenge.","imageUrl":"https://media.rawg.io/media/screenshots/b30/b30d03cc957f3a13f86aab66007e8c44.jpg","releaseYear":2018,"developer":"DEXINT GAMES","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53816,"name":"Felix the Cat","genre":"Desconocido","price":0.0,"description":"Felix the Cat is a video game released in 1992 for the Nintendo Entertainment System and in 1993 for the Game Boy by Hudson Soft. It is based on the cartoon character Felix the Cat.","imageUrl":"https://media.rawg.io/media/games/700/700d194c8fcfe5bad9bb90611bbc8ba1.jpg","releaseYear":1992,"developer":"Hudson Soft","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"NES"}]},{"id":51936,"name":"Dungeons Forever","genre":"Action","price":0.0,"description":"Dungeons Forever is not just any old platforming puzzle game. It's a possibly endless platforming puzzle game! The levels are created by you, me and everyone else!\nBuild levels using the editor and upload them online for the whole world to play! Every level has been created by the community and is downloaded at random,  so every time you play you can expect a completely new set of levels!\nAnd best of all, its free! No Ads, Micro-transactions or hidden costs, The only payment I ask for is you create some sweet levels and help hit that Forever goal!\nFeatures:\nA large variety of tiles and enemies to create levels from\nA constantly changing variety of levels created by the community\nLike, 30 hats you can find only in Loot Boxes! ( It's just cosmetic! )","imageUrl":"https://media.rawg.io/media/screenshots/c1d/c1d7a1b5aa827ac39a2c5300b3a12301.jpg","releaseYear":2018,"developer":"Timedrop Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":48076,"name":"Stonies","genre":"Adventure","price":0.0,"description":"Stonies – Become a Stone Age Leader\nExperience the earliest era of human history and explore the Stone Age game Stonies. In this exciting game, you will teach your prehistoric kin to hunt, make fire, and build their own village with countless different buildings.\nLead your Stonies through the undoubtedly most fateful epoch of human history. Discover a world full of dangers, challenges, and gripping tasks. Help your Stone Age game people progress from primitive cavemen to settled villagers in this extraordinary life simulation.\nFell trees, smash rocks, and harvest fruit\nProduce weapons, wooden figurines, carving rocks and other great items\nExpand your village and build numerous huts and buildings\nExperience a graphically unique Stone Age game with many original animations\nExtraordinary Experiences in Prehistoric TimesCraft hunting weapons such as wooden spears and hunt down rabbits and deer to ensure the survival of your clan. Stonies is a one-of-a-kind life simulation - an amazing tycoon game awaits you. Complete exciting missions with your tribe. Dive into the prehistoric times and explore the rugged wilderness with your cavemen. Teach them countless skills, such as working leather and wood, and expand your tribe’s primeval power in this Stone Age game.\nTo the Stone Age!Play the gripping mix of life simulation and tycoon game now and accompany your Stonies through their prehistoric life. Prove your skill as a Stone Age leader in Stonies.\nNote: Stonies can only be played online. Existing browser game or app accounts cannot be linked to Steam.","imageUrl":"https://media.rawg.io/media/screenshots/091/0910f3bf23fe316e6e43604cbc579722.jpg","releaseYear":2017,"developer":"KING Art","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":46495,"name":"Octopus Bar","genre":"Action","price":0.0,"description":"Enter this hidden izakaya bar hidden deep in the magical forest, where the octopus serves you, fish float into the sky, and a frog enjoys the your company. In this world the impossible is now possible and you are invited to discover the games and enjoy this whimsical scenery.\nYou will be asked by the Octopus to do simple task:\n. Chasing and catching a chicken for him to cook.\n. Feed your frog friend the chicken and why not give him a little tickle!\n. Shoot all the balloon fish with your ninja star crossbow.\n. Find and shoot all the hidden “teru teru bozu” ghosts.\n. Set the dragon free and enjoy watching him fly through the night sky.","imageUrl":"https://media.rawg.io/media/screenshots/310/310a9a2ca1a39138289ac8d94298d104.jpg","releaseYear":2017,"developer":"Thomas Meduri","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46155,"name":"Runner3","genre":"Action","price":0.0,"description":"The rhythm-music platformer gameplay of BIT.TRIP RUNNER and Runner2 is back and better than ever!\nThe Timbletot is determined to rid the multiverse of all its love and happiness. CommanderVideo, a lover if ever there were one, refuses to let this happen. He’s ready to jump, double-jump, wall-jump, slide-jump, slide, kick, float, fly, and dance his way to victory, all across a medley of thrilling, challenging, and joyous levels!\nFeatures:\nCharles Martinet! - Charles Martinet, known best as the voice of Mario, returns for his role of \"The Narrator\"\nHero Quests! - Runner3 is filled with oddball characters in need of your help. Lend them a hand and they'll reward you generously!\nVehicles! - Players will encounter wild vehicles that stand no chance of ever being deemed street legal. Eggplant planes! A celery car! Cans propelled by carbonation! And so much more!\nBranching Paths! - Every level in Runner3 offers branching paths of varying difficulties. Take the hard path and earn yourself some gems; opt for the normal path and line your pockets with precious gold bars. The choice is yours!\nItem Shop! - Players will be able to spend gold and gems earned while playing on costumes, capes, accessories, and more. There are no in-game purchases in Runner3--keep your dang money!\nRetro Challenges! - A series tradition, every level in Runner3 has an accompanying \"retro\" level. These levels will also offer a series' first: free movement! Control the Commander in ways you never have before!\nNew Playable Characters! - The Commanders are joined by friends new and old, including Dave of Woah Dave! fame, Unkle Dill, Frank 'N Stein, Awnty Rewty, and more!","imageUrl":"https://media.rawg.io/media/screenshots/bf7/bf773c19650f1f2195041ecc974ae264.jpg","releaseYear":2018,"developer":"Choice Provisions","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":46032,"name":"NOKBAK","genre":"Action","price":0.0,"description":"Nokbak is a first-person multiplayer arena shooter... with a twist! Built for 3 to 8 players, players don't shoot to kill, but rather find themselves frantically trying to knock each other off of an arena in the sky. Set in a future where dinosaurs never went extinct, they've now evolved and developed their own professional sporting leagues, the most prominent being NOKBAK.\nWhat makes NOKBAK unique is that anyone can win at any point in the game. We capitalized on the idea that it's not over till it's over. We mean it. Bounty Mode, a game mode in which you earn every KO'd player's points, is a core mechanic of this game and insures that even the player in last place can make a comeback. Even the top scoring players will have to watch their back! As players' scores grow exponentially, things get crazy quickly, even more so with lots of players.\nFirst to 50 points wins a place as one of the top three NOKBAK MVPs!","imageUrl":"https://media.rawg.io/media/screenshots/e2c/e2cfa7c1c6fc07f1a7b2ad2ce67315a6.jpg","releaseYear":2017,"developer":"BYU Animation -  Class of 2017","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44558,"name":"Crusaders of Light","genre":"Adventure","price":0.0,"description":"40 Person Raids at Your Fingertips\nThe Desolation Wall has fallen after 700 years of peace, it’s now up to you and your allies to battle the demon hordes occupying your land!\nAdventure in this Vast 3D Fantasy Open World redefining the MMORPG experience on mobile. Start your journey by selecting either Ranger, Warrior, Mystic, Paladin, Elementalist Classes, each with their own distinct strengths and characteristics.\nBATTLE SYSTEMS\n•Join up to 40 guild mates as you take on bosses and collect loot in Dungeon Raids\n•Prove yourself in Arena Battle with 1v1, 3v3, and 5v5 modes and participate to unlock powerful gear sets\n•Show-off your superior skills and defend your glory as you take part in large scale battles\n•Put your survival instincts to the test as you take part in Battle Royale mode\nIMMERSIVE GAMEPLAY\n•PC quality graphics to immerse you in this impressive MMO game on mobile\n•300+ hours of gameplay including hundreds of paths for your hero\n•Vibrant fantasy world with the ability to reach the coveted legendary status of level 55\nCUSTOMIZATION\nThousands of available weapons, armor, clothes and more\n•Collect rare items providing specific advantages which players can combine to become powerful\n•50 unique mounts from a flying carpet to a fire breathing dragon\nSOCIAL\n•Chat with players around the world utilizing the integrated voice system\n•Take in-game selfies, share personalized heroes, and your favorite moments with friends on social media\nNotes:\n• This app is free-to-play and offers in-game purchases.","imageUrl":"https://media.rawg.io/media/screenshots/29c/29c892d644dbe5e951ef343ad8c8c409.jpeg","releaseYear":2017,"developer":"NetEase Games","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":41330,"name":"Arctic Combat","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/ac4/ac45c41e6f61b7fd4f05540cca5e4e9c.jpg","releaseYear":2012,"developer":"NHN Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40922,"name":"Carmageddon: Reincarnation","genre":"Racing","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/8fd/8fdcd9366893dd52d0d38ad1ad81dff1.jpg","releaseYear":2015,"developer":"Stainless Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":37138,"name":"War Rock","genre":"Action","price":0.0,"description":"War on a massive scale! Experience fast-paced, large-scale multiplayer tactical combat with explosive vehicular warfare. Choose between 5 professions and take to the battlefield for close quarters combat, vast vehicle battles and terrifying PVE Zombie Survival encounters. Enlist in War Rock for free today!\nKey Features:\nCHOOSE YOUR PROFESSION\nChoose between five Professions, including Engineer, Medic, Sniper, Assault and Heavy Trooper, each specialized for a different role on the battlefield. Every Profession features a fully customizable load-out of weapons and gear, plus many unique skins and costume pieces that allow you to create your perfect soldier.\nBATTLE HOW YOU WANT\nCompete in a variety of intense game modes that put strategy and teamwork to the test. Choose between hardcore tactical combat, large-scale battles with ground and air vehicles, and AI Zombie survival, across a list of more than 90 individually-tailored rotating maps.\nTOOLS OF WAR\nAlways bring the right tools for the job! Choose between dozens of powerful weapons and gear items and support your team on the battlefield with a range of tactical Vehicles. Dominate every battle any way you want with unprecedented freedom.\nRISE THROUGH THE RANKS\nMake your mark on the War Rock community through Achievements, Ranks, Leaderboards, or fight for dominance in the extensive Clan War system. With regular updates and community events there is always a new challenge waiting to be conquered.","imageUrl":"https://media.rawg.io/media/screenshots/902/902cdf773311dae75edca26fb3bd9e8c.jpg","releaseYear":2005,"developer":"Dream Execution Technology","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":34713,"name":"Rise of Nations","genre":"Strategy","price":0.0,"description":"Rise of Nations is a real-time strategy game developed by Big Huge Games and published by Microsoft Game Studios. Players lead one of 18 civilizations through 8 ages of world history, starting with the Ancient Age and ending with the Information Age. Players can win by destroying other civilizations, with a territory advantage, by building and protecting a Wonder, or by having the highest score. A remastered version of his classic is available on Steam under the name Rise of Nations: Extended Edition.","imageUrl":"https://media.rawg.io/media/screenshots/bf1/bf19c2deb4c037f52f6e86f5b66d05ad.jpg","releaseYear":2003,"developer":"Big Huge Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":30813,"name":"Maniac Mansion: Day of the Tentacle","genre":"Adventure","price":0.0,"description":"The sequel to \"Maniac Mansion\" features over 4,000 lines of recorded dialogue and the voice of Richard Sanders, Les Nessman of \"WKRP in Cincinnai.\" A free hint book is included with the game. Challenging puzzles for beginning and advanced players. Simple \"point n' click\" icon interface. Simultaneous control of three different characters. Re-write history. Visit exciting places and exotic time periods. Save the world!","imageUrl":"https://media.rawg.io/media/screenshots/f6b/f6b30c8c391dfe473a4f8cd58358f91d.jpg","releaseYear":1993,"developer":"LucasArts Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28413,"name":"Sonic's UGC","genre":"Action","price":0.0,"description":"The Ultimate Genesis Collection","imageUrl":"https://media.rawg.io/media/screenshots/159/159102c68cee88ad4f986541b59c1e49.jpg","releaseYear":2009,"developer":"Backbone Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28007,"name":"Kirby: Planet Robobot","genre":"Platformer","price":0.0,"description":"Harness the power of a mysterious mech to stop ruthless invaders from\nmechanizing Kirby's home world. Smash through tough obstacles, lift\nheavy objects with ease, and scan enemies to shape-shift into new Modes\nwith powerful abilities in this supercharged action-platformer!\n\nThat's right—Kirby's Robobot Armor can shape-shift into different modes\nby scanning enemies to copy their moves—like the new Jet Mode. Not to\nmention, Kirby™ can copy abilities the old-fashioned way too—by inhaling\nthem! After saving the world, team up with three friends to defeat foes\nin Team Kirby Clash, an RPG-styled 4-player brawl where you choose from\nvaried roles and level them up.","imageUrl":"https://media.rawg.io/media/screenshots/5b9/5b9d36a817c8537e6b2722122b7878aa.jpg","releaseYear":2016,"developer":"HAL Laboratory","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"}]}]