[{"id":15073,"name":"Pixel Puzzles 2: Space","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/913/9138c86a3a2ae8c4926dfc930dbc7998.jpg","description":"Pixel Puzzles 2: Space is a traditional style jigsaw puzzle game, featuring 25 images in a universal style, with each puzzle piece uniquely shaped in a way no physical puzzle could be.\nUse satellites to help solve puzzles. Launch the floating payloads to utilize power ups or build a rocket and save the stranded spaceman from the barren rocks beneath his moon boots.Features:25 puzzles in a range of sizes from 60 to 350 pieces.\nBeautiful images of space.\nAuto saving, never lose your progress.\nPeaceful puzzling atmosphere.\nTraditional puzzle gameplay.\n55 Steam Achievements.\nPuzzle piece rotation.\nInteractive play environment.\nPower ups to help solve puzzles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":11555,"name":"Clickteam Fusion 2.5","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cd/6cd13ed3dcb6b44b8bc995850f2861e6.jpg","description":"Game and software creation has never been easier or quicker than with Clickteam Fusion 2.5! Discover the tool used by so many multimedia professionals, game creators, and creative people from all walks of life.\nWith CF2.5’s amazing event editor system you are able to quickly generate games or apps without mastering a traditional programming language.\nWithin your first hour you will have learned the basics of the tool. Compile a windows app with a mouse click, Or target additional platforms like iOS, Android, Flash and XNA (Windows Mobile phone and Xbox) with the purchase of our optional exporters.\nHarness the power of Clickteam Fusion 2.5 today.Steam Games #MadeWithFusion\nAmazing Features from the Original Drag and Drop Programming Tool-Make your first game in under an hour!\n-No need for previous programming knowledge\n-Easy to use and intuitive physics engine\n-The original and world famous Event Editor makes programming a breeze\n-Used by professionals and students alike\n-Shader effects available\n-Inserting assets is as easy as drag and drop\n-Publish games and apps for multiple platforms\n-Complete creative flexibility\n-Hardware accelerated games and apps\n-Outstanding, friendly community supportBuild for many platforms with optional exporters\nGenerates HTML5 on the fly and runs automatically in your browser\nOpen extension SDK for endless functionality       Use hardware acceleration & shaders on powerful Windows machines\n100's of additional objects provide additional functionality to the tool\t\tBuild directly from CF2.5 to any of your Android devices and build APKs\nAccess the Android OS with our simple permissions management system\t\tBuild games for all iOS touch devices including iPad, iPhone and iPod\nMaximize control options with the Accelerometer and Multitouch interface objects\nBuild Games for Xbox and Windows 8 Mobile\nMultiple Control options for Multiple Platforms\t\tProduce quality Flash content in record time\nFully Customizable SWF Generated Easily","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Clickteam","platforms":[{"id":0,"name":"PC"}]},{"id":9608,"name":"McOsu","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70c/70c722f160157609082175176073d3c2.jpg","description":"McOsu is an open-source practice client for the PC rhythm game osu!, developed from scratch by McKay42. While it is playable without an osu! installation or account, it does not support osu!'s online features and ranking system and lacks some gameplay elements from the main game such as health.\n\nMcOsu allows the player to individually override the difficulty values of the map he is playing (circle size, approach rate, overall difficulty and even game speed/song BPM). It also includes a multitude of features that can help with practice; a target practice mod, mid-song pause skipping and scrubbing, an enhanced hit error bar, a powerful console and more. In addition, it includes many quality of life features (improved aesthetic customization, HUD scaling, changing game options including mods and value overrides while playing...)  and many experimental features such as a 3D first-person mode, a VR mode, and various mods which can make notes wobble or flash in rainbow colors.\n\nMcOsu is developed separately from osu! and peppy is not involved with its development in any way.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"McKay","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":28062,"name":"Tiny Echo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/470/470a3a2d47be030494fa96c0edbb67db.jpg","description":"Might and Delight invites you to the ethereal otherworld of Tiny Echo and poses the\nquestion – what lives do the little spirits of the undergrowth live?\nTake a walk into a never before seen realm and explore a tranquil and mysterious world\nteeming with shades trying to make it through another daily cycle.\nUncover new locations and characters by solving puzzles in this lovingly crafted world as\nyou play the role of Emi tasked with delivering messages to the spirits.\nTiny Echo is a quintessential Might and Delight title with the perfect blend of aesthetic\nelegance coupled with a soothing soundtrack composed by Mount West.\nMain features\nGuide the courier Emi through a quirky hand-drawn world.\nUncover the unique traits of each character in order to complete your delivery.\nSolve puzzles at a meditative pace.\nTake a dive into the wordless narrative as you progress in your postal round.\nRelax with an atmospheric soundtrack composed by Mount West.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Might and Delight","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14384,"name":"Energy Balance","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a2/3a20693563095340c6652b987290a31b.jpg","description":"Don't miss our new games!http://store.steampowered.com/app/448470/\nhttp://store.steampowered.com/app/415960/\nAbout the GameDuring a mission your spaceship encounters an unknown anomaly and all systems fail. You have to balance the energy in order to get them running again and to get home safely.\nEnergy Balance is a number puzzle. You have to swap power units in such a way that their sums form correct chains both vertically and horizontally. The game is easy to learn, but very hard to master. So, are you ready to peep under the hood of an alien spaceship?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sometimes You","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2037,"name":"Trials of the Blood Dragon","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e3/9e36d34eedd5cbaf02463ed1d19da516.jpg","description":"2019 - NOW\nIn a world where Blood Dragons, beasts of unknown origin, roam free.\nIn a time where the future is not what it used to be, there's a man.\nNo, wait..\nThere's a boy.. and a girl.. Yes, a boy and a girl.\nThey are Roxanne and Slayter, the offspring of the legendary Rex Power Colt. They‘re as tough as their father, as smart as their mother and the best there ever was at being the best. 12 years on from Vietnam War 2, they're going to Vietnam War 4 to save the day, save freedom, and save the world.\nDiscover an epic single player experience with the unique combination of competitive, precise, physics-based Trials gameplay- and rather less precise gun toting, balls swinging, neon-drenched Blood Dragon action.\nJourney through a colorful story with warzones in Vietnam, settling scores in Miami, confronting TV heroes in Tokyo and the odd detour into Space. Hell, you’re gonna go to Hell and back. The future is back. Are you ready?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":24493,"name":"New Super Mario Bros. Wii","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/19a/19a1814d28ea396b3fd46404b1638a98.jpg","description":"Run and jump to your way to fun with Mario™ & friends!\n\nPlay together with up to 4 friends or family members\n\nRediscover legendary 2D gameplay loved by millions\n\nFun, simple controls—just like classic Mario games\n\nDevelopers at Nintendo have dreamed of creating a simultaneous\nmultiplayer Super Mario Bros.™ game for decades. The Wii console\nfinally makes that dream come true for everyone. Now players can\nnavigate the side-scrolling worlds alone as before or invite up to three\nothers to join them at the same time on the same level at any point in\nthe game for competitive and cooperative multiplayer fun. With the\nmultiplayer mode, the newest installment of the most popular video game\nfranchise is designed to bring yet another type of family entertainment\ninto living rooms and engage groups of friends in fast-paced Super\nMario Bros. fun.\n\nNew Super Mario Bros. Wii offers a combination of cooperation\nand competition. Players can pick each other up to save them from\ndanger or toss them into it.\n\nMario™, Luigi™ and two Toads are all playable characters, while many\nothers from the Mushroom Kingdom make appearances throughout the game.\nPlayers can even ride different Yoshi characters and use their tongues\nto swallow enemies, items and even balls of fire.\n\nIn some areas, players use the motion abilities of the Wii Remote™\ncontroller. The first player to reach a seesaw might make it tilt to\nhelp his or her character reach a higher platform – or might make it\ntilt incorrectly just to mess with other players.\n\nNew items include the propeller suit, which will shoot players high\ninto the sky with just a shake of the Wii Remote, and Mario’s new\nability to transform into Penguin Mario.\n\nAt the end of each stage during the coin battle multiplayer mode,\nplayers are ranked based on the number of coins they have collected.\n\n*MSRP: Manufacturer's Suggested Retail Price. Actual price may vary. See\nretailer for details.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"}]},{"id":19373,"name":"Cibele","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d53/d536a8a449966ec8b944b2a53c2bef52.jpg","description":"Cibele is a game based on a true story about love, sex, and the internet.\nYou play as a 19 year old girl named Nina who has become close with a young man she met in an online game. Her relationship with him heats up, becoming more and more intimate with each phone call and private chat.\nThe game unravels in three acts.\nThe player plays as Nina, going into her online game, exploring her desktop, chatting with her friends and going about her daily life as she plays her online game. It is a narrative game which strives to help the player walk in Nina's shoes as she plays her online game, becoming more and more intimate with her lover as each act unfolds.\nFeatures\n3 full acts.\nBased on a true story.\nMultiple short films offer an intimate glimpse into Nina's life.\nA richly illustrated and scored game world to explore called Valtameri, with multiple maps.\nA fully interactive desktop that changes over the course of the game, offering a glimpse into Nina's life outside of her online game.\nRecommendations and Notes\nThe game takes about 1.5 to 2 hours to play through in full.\nIt's recommended that you play it in one sitting.\nHeadphones are recommended.\nThe game is intended for mature audiences.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Star Maid Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16714,"name":"Cultures - Northland","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d7/0d7f8913a8fa983548d53f938ee55921.jpg","description":"Buy Cultures - 8th Wonder of the World:http://store.steampowered.com/app/351870/\nAbout the GameThe Vikings are back!\nLoki, known from the Nordic sagas as a versatile god of lies and weaver of many intrigues against his divine \"colleagues\", has been banned from Asgard by Odin as a punishment for the trouble caused by the Midgard serpent. Now Loki is plotting revenge and searching for a possibility to sneak back into Asgard and pay Odin back. Out of spite, he abuses our four human heroes--Sigurd, the Frank, Hatschi, the brave Saracen, Bjami, and Crya--with his intrigues and traps. Embark on adventures and quests to help your allies wrest free from Loki's insidious machinations, whether it's a plague of serpents or the demon wolf Fenris dropping by for a rather unexpected visit. Ensure the health and safety of your people as you start with but a humble town and work your way up to a large city. Cultures - Northland offers the best combination of strategy and adventure!\nThree difficulty levels that make the game fun for anyone\nExplore unknown territories and establish trade routes with other tribes\nWatch as your inexperienced fighters grow into fearless heroes of great renown\nSolve challenging quests and adventures","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Funatics Software","platforms":[{"id":0,"name":"PC"}]},{"id":15243,"name":"DRAGON: A Game About a Dragon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb1/fb1f136f3d4398cd0f0fffe4611796d7.jpg","description":"Be a dragon in this beautifully hand-drawn adventure!\nDragon's girlfriend has been whisked away by the mean king and only you can help him find her!  Use your dragon powers to charge into battle and face off against knights, soldiers, and other authoritarian elements so you can get your ride-into-the-sunset ending.  Hey, dragons deserve those, too.\nFly, breathe fire, hoard treasure, and watch trashy talk shows all day just like a real dragon.  Step into a tongue-in-cheek world that's guaranteed to bring a smile to your face!\nIf your claws need to pack more of a punch, just level them up.  If you think you're good enough to throw down with bosses without it, more power to you.  Collect gold and treasures to increase your strength so you can take on bigger enemies... or jump in headfirst and defeat them on your skills alone!  It's all about the freedom of choice.\nPlayers from all eras will have fun with DRAGON: A Game About a Dragon.  Please enjoy this charming and lighthearted tale of friendship, greed, and love, all from the perspective of the dragon.FeaturesYou are the dragon: No more heroics, you're just here to steal treasure and hook up with princesses.\nHand-crafted, artisan-designed levels: Each stage has its own individual theme and aesthetic that makes it fun and unique!\nExplore and uncover secrets:  Find hidden treasures to increase your power and unlock special abilities!\nEscape the constraints of linearity:  Not in the mood to fight enemies?  Take the puzzle route with no monsters at all!\nA brilliant musical score:  Enjoy a soundtrack composed by Zack Parrish of Valdis Story fame!\nPlay the game in your language:  DRAGON: A Game About a Dragon includes English, Japanese, German, and Hawaiian Creole English!  Yes, seriously.\nBuilt-in controller support:  Play a game inspired by the 16-bit era the way God intended.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Games With Dragons In","platforms":[{"id":0,"name":"PC"}]},{"id":10015,"name":"Mortal Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed9/ed9f608f16ecc30b6f1e4db054649163.jpg","description":"Experience true open-world freedom in Mortal Online - a unique first-person, medieval fantasy, massively multiplayer online role-playing game.Choose your path!Choose from many different races, decide your own style of play and whether to focus on PvP or PvE, both sharing the same game world.\nChoose a profession and devote your life to combat, crafting, magic, trading...\nDiscover countless skills, resources and tools, master a few or dabble in them all, or be the first to explore new areas to find hidden treasures and unique secrets.Live or die!This game is not for the faint of heart. With \"full loot\" mechanics, dying means that you risk losing everything you're carrying with you.\nDanger is everywhere, safety must be earned. Learn to master real-time, aim-based combat where you decide every move your character makes, and where your skills really matter.Not quite like any other MMORPG...There are no character levels, only skill levels.\nThere are no PvP zones, only a single open and realistic world where you are free to choose your own path.\nThere are no separate server regions, every player inhabits the same huge world.Strength in numbers!Build your own house, or create a guild with your friends to build a keep.\nExpand even more, build a whole city and surround it with defensive walls, or band together to siege and conquer your enemies' fortresses!\nWith enough power, violence or diplomacy, you and your allies will be able to rule an entire nation.\nThe possibilities are endless!Unlimited free trial!Mortal Online offers a free-to-play mode with a skill cap at skill level 60. In order to unlock the maximum skill levels and fully master your Mortal destiny, a paid monthly subscription is needed, but unlike many other games there are no microtransactions. Unsubscribing will re-apply the skill cap, but your skills will be maxed again when you re-subscribe. Every player gets one free character slot, and you can purchase additional slots up to a maximum of four.Feature listTaming and mount breeding\nLock-picking\nPlayer Housing and City Building\nSiege\nTerritory control system\n500+ skills to master\nBreeding\nThievery\nGlassblowing\nMounted combat\nArchery\nMagic\nSeveral in-depth crafting systems with millions of combinations\nAlchemy\nButchery\nMetallurgy\nMining and woodcutting\nPublish your own books\nArmor dyeing\nSocial skills such as bribing and persuasion\nAuction houses\nAnd much more!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Star Vault","platforms":[{"id":0,"name":"PC"}]},{"id":57967,"name":"Warcraft II: Tides of Darkness","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f94/f9474e5b82d28d3a686b3d7c551d8f5d.jpg","description":"Warcraft II: Tides of Darkness is a fantasy-themed real-time strategy (RTS) game published by Blizzard Entertainment and first released for DOS in 1995 and for Mac OS in 1996. The main game, Warcraft II: Tides of Darkness, earned enthusiastic reviews, won most of the major PC gaming awards in 1996, and sold over 2 million copies.\nLater in 1996 Blizzard released an expansion pack Warcraft II: Beyond the Dark Portal for DOS and Mac OS, and a compilation Warcraft II: The Dark Saga for the Sony PlayStation and Sega Saturn. The Battle.net Edition, released in 1999, provided Blizzard's online gaming service, Battle.net, and replaced the MS-DOS version with a Windows one.\nPlayers must collect resources, and produce buildings and units in order to defeat an opponent in combat on the ground, in the air and in some maps at sea. The more advanced combat units are produced at the same buildings as the basic units but also need the assistance of other buildings, or must be produced at buildings that have prerequisite buildings. The majority of the main screen shows the part of the territory on which the player is currently operating, and the minimap can select another location to appear in the larger display. The fog of war completely hides all territory which the player has not explored. Terrain is always visible once revealed, but enemy units remain visible only so long as they stay within a friendly unit's visual radius.\nWarcraft II 's predecessor Warcraft: Orcs & Humans, released in 1994, gained good reviews, collected three awards and was a finalist for three others, and achieved solid commercial success. The game was the first typical RTS to be presented in a medieval setting and, by bringing multiplayer facilities to a wider audience, made this mode essential for future RTS titles. Warcraft: Orcs & Humans laid the ground for Blizzard's style of RTS, which emphasized personality and storyline. Although Blizzard's very successful StarCraft, first released in 1998, was set in a different universe, it was very similar to Warcraft II in gameplay and in attention to personality and storyline. In 1996 Blizzard announced Warcraft Adventures: Lord of the Clans, an adventure game in the Warcraft universe, but canceled the game in 1998. Warcraft III: Reign of Chaos, released in 2002, used parts of Warcraft Adventures' characters and storyline and extended the gameplay used in Warcraft II.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"}]},{"id":46089,"name":"WRC 7 FIA World Rally Championship","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/184/184390765c900fc3ec1ef0a6febe3dfb.jpg","description":"Take on all the challenges of the 2017 World Rally Championship: the official cars and drivers, 13 countries, 52 Special Stages, every surface, more powerful cars, more demanding physics, longer races, and an eSports mode to keep you on the edge of your seat all year round. Choose among cars from prestigious manufacturers such as Hyundai, Toyota, Citroën, and Ford, perfectly recreated for a realistic driving experience. 55 official teams are available, including a large selection of WRC 2 and WRC Junior drivers. The 13 Epic Stages offer an unprecedented gaming experience with special stages that last more than 15 minutes: the ultimate endurance test for both drivers and WRC fans!\n– New physics bring to life all the power of the WRC 2017 cars.\n– Completely overhauled tracks provide an ultra-realistic driving experience.\n– Local split screen multiplayer.\n– New online challenges each week.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":44295,"name":"West of Loathing","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d11/d116eb848dad9bc60d63d1b209f5d3c8.jpeg","description":"Say howdy to West of Loathing -- a single-player slapstick comedy adventure role-playing game set in the wild west of the Kingdom of Loathing universe.  Traverse snake-infested gulches, punch skeletons wearing cowboy hats, grapple with demon cows, and investigate a wide variety of disgusting spittoons.\nTalk your way out of trouble as a silver-tongued Snake Oiler, plumb the refried mysteries of the cosmos as a wise and subtle Beanslinger, or let your fists do the talking as a fierce Cow Puncher.  Explore a vast open world and encounter a colorful cast of characters, some of whom are good, many of whom are bad, and a few of whom are ugly.\nFeatures:\na sprawling open world, chock full of danger, quests, puzzles, and mysteries\nlush hand-drawn black and white graphics\nfull stick-figure customization\nthousands of jokes, gags, and goofs\ncrunchy turn-based combat (but only if you want it)\nliberal use of the Oxford comma\nover 50 hats\ndisreputable saloons\nseveral gulches\na drunk horseNOTE: characters are not literally colorful (the game is in black and white)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Asymmetric","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19508,"name":"The Baconing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0e/f0e52df2fe9ec39251697e024b7b2df1.jpg","description":"Prepare yourself for the ultimate sci-fi adventure by entering the hilarious and sizzling world of The Baconing created by Hothead Games.\nYou are DeathSpank, a hero and the ultimate Dispenser of Justice. You must defeat the Anti-Spank and his army of Cyborques, before they cast an evil shadow over Spanktopia.\nDiscover exciting new worlds and battle hordes of enemies as you search to unlock the secret within the Fires of Bacon.\nKey Features\n\nExplore unique locations such as The Forbidden Zone, Rainbow’s End and Hell’s Half Acre in a pop-up book style adventure.\nOver 100 quests, challenging boss fights and mind bending puzzles to complete\nUnleash devastating attacks on the enemy with the all-powerful Weapons of Justice\nControl the battlefield with tactical precision by using your Shield  Bash, Perfect Reflect and Charged Attacks\nPlay local co-op with a friend and choose from one of four amazing sidekicks\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Hothead Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17052,"name":"Shattered Planet","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/179/1793e559ab5bba7de04c2443c7e162eb.jpg","description":"Explore a dangerous planet that's different every time and try to survive!\nThe Galactic Union's job for you is clear: research the alien wildlife -- for science! However, in this case, researching may include lasers, explosions, hungry aliens, space sushi, and other similarly delicious-or-terrifying hazards. In-between missions, use scrap metal you've collected to upgrade your stats.\nWhether you survive or die, you'll come away better than you started!\nFeatures:\nCompletely procedurally generated levels\n200+ items, from swords to cookies to grenades\nAlien monsters to fight or befriend\nEveryone gets the same Daily Challenge - compare your progress with your friends\nClass system - each clone skin has a different advantage\nPet cloning - maintain your companions' DNA in their own clone vats","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kitfox Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16374,"name":"Age of Wonders II: The Wizard's Throne","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e9/2e99c6f892346d04f74c4c5df8c101aa.jpg","description":"Age of Wonders II is the wildly anticipated sequel to the award-winning strategy phenomenon. Delivering an invigorating mix of Empire Building, Role-playing, and Warfare, Age of Wonders II brings s turn-based strategy to new heights.\nAwakened to join an immortal group of Wizards in the Circle of Evermore, you must restore balance to a world on the brink of collapse.\nKey features:\nExplore a world full of mythical creatures and mysterious lands. Build an impressive force as an all-powerful Wizard through dangerous perils and exhilarating challenges.\nDictate the fate of the world from within your Wizard's Tower, a transmitter of power used to channel your ground-shaking spells.\nImmerse yourself in a legendary story during a single-player campaign with 20 scenarios full of intrigue, action, and suspense.\nReign supreme over one of 12 distinct and races such as Elves, Frostlings, Draconians, Dwarves, Halflings, Humans, and even the Undead.\nConquer your enemies  with over 130 unique units such as steam cannons, airships and mammoth riders.\nSpecialize in 7 spheres of magic including Air, Fire, Life and Death.\nEnlist the aid of more than 30 loyal champion heroes who possess the unique ability to wield over 100 mighty artifacts.\nResearch and cast powerful enchantments, fierce combat magic, and world altering spells.\nConfront rivals in Multiplayer via a LAN or over the Internet for up to 8 players - options include Play by Email, Hot Seat, and the exciting Simultaneous-Turn System allowing all players to move at the same time!","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Triumph Studios","platforms":[{"id":0,"name":"PC"}]},{"id":7344,"name":"Shop Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6aa/6aa8cfccfa7f8d7acbe1a6e24dfb45dd.jpeg","description":"Become the ultimate shopkeeper by managing the best fantasy item shop across the Kingdom of Aragonia!\nHire and train unique workers, craft hundreds of legendary items, gear up your heroes for battle, trade with your friends and work together to reach the top!\nThe #1 spot in the rankings is always contested! Do you have what it takes to be the ultimate shop tycoon?~~~~~~~~~\nFEATURES\n~~~~~~~~~CUSTOMIZE your dream item shop and shopkeeper avatar\nMANAGE skilled workers to help you build a prosperous shop empire\nCRAFT hundreds of original items to sell to visiting heroes\nCOLLECT dozens of rare blueprints and master them all\nFUSE ordinary items together to construct extraordinary equipment\nRECRUIT powerful heroes to wage war within the Arena\nUNLOCK strategic hero powers to conquer challenging quests\nEQUIP your heroes with epic gear and prepare them for battle\nRAID treacherous dungeons with your city to earn exclusive loot\nTRADE legendary items and resources with your friends\nTEAM up and invest with others to build the ultimate metropolis\nENJOY regular events and updates with new content and improvements~~~~~~~~\nSUPPORT\n~~~~~~~~Experiencing any problems? Got some suggestions? We would love to hear from you! You can reach us at https://cloudcade.helpshift.com for immediate assistance.\nA persistent network connection is required to play.\nPLEASE NOTE! Shop Heroes supports cross platform gameplay on Steam, iOS, Android and Facebook. Please contact support to sync your Steam progression with any other desired platform(s).\nUse of this application is governed by the Terms of Service available at http://cloudcade.com/tos/\nCollection and use of data are subject to the Privacy Policy available at http://cloudcade.com/privacy-policy/\nLike Us: http://facebook.com/shopheroes\nFollow Us: http://twitter.com/shopheroesgame\nhttp://shopheroes.com","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"cloudcade","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Web"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":6819,"name":"Knight Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c01/c01602fe0619c5295f8e3849ac435ccd.jpg","description":"Knight Squad is an insane 1 to 8 players chaotic arena friendship destroyer. Take on current friends and future frenemies in any of the incredibly fun game modes, ranging from Last Man Standing to Medieval soccer. All of that using only weapons from the middle age… and laser guns… and miniguns.Features1-8 Players game packed with crazy party action\nA bunch of levels are available for each game mode. You're not enough players to fill in the spots? No worries. Bots will jump in. Select their difficulty depending on the amount of challenge you'd like and you're ready to go!\nOnline Multiplayer\nPlay against other players around the world and compare your skills!\nA Bunch of Versus Game Modes\nTeam Capture the Flag, Last Man Standing, Capture the Grail, Soccer, and more!\nFetch deadly new weapons and power ups on the battlefield\nGrab your weapon of choice : sword, bow and arrows, crossbow, bombs, laser gun and more!\nChallenges\nTake on the very difficult challenge levels and make your way to the top of the leaderboard!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Chainsawesome Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":1943,"name":"Dungeon Punks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2c/f2c5d1df42a1025b52f070846cf1b19f.jpg","description":"Dungeon Punks is an arcade beat-em-up RPG that evokes the classics like Golden Axe, and mixes in tag-team fighting gameplay inspired by the Marvel vs Capcom series. Adventure awaits whether you’re going solo, playing with friends, or beating each other to a pulp in one of the many battle arenas! Total mayhem is bound to break loose as you blast your enemies senseless with crazy magical spells and custom combo attacks.\nAdventure solo, or with up to three players\nChallenge friends to a battle to the death across 11 different PvP battle arenas\nTag-team fighting: take control of two characters at once!\nExplore twelve stunning areas, each with epic boss battles\nRecruit six mutant heroes, who each learn unique skills and abilities\nFind rare magicked loot than can electrify, burn, and sicken your foes\nBlast your enemies senseless with crazy magical spells and custom combo attacks\nSummon creatures to your aid, like a fire-breathing baby dragon\nTame and ride wild beasts...including a laser-blasting unicorn!\nWant more of a challenge? Try the extra-hard New Game Plus mode\nDiscover an unusual fantasy world of magic, mystery, and corporate greed\nImmerse yourself in an epic adventure of flying boats, unwelcome visits from the Feds, corporate espionage, and a bunch of mutants with licenses to kill on a mission to take down the bigwigs of the resurrection insurance industry, all in a medieval setting.\nIf you enjoyed other arcade style brawlers like the Teenage Mutant Ninja Turtles Arcade, Golden Axe, Castle Crashers, or Dragon's Crown you're going to absolutely love Dungeon Punks.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hyper Awesome Entertainment","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":471,"name":"Bardbarian","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/076/0766f642380c17584d0784148e82c14b.jpeg","description":"Thanks to Young Horses, Slick Ent Inc, and Team Meat for allowing us to do these amazing crossover exclusives for our Steam launch.\nWhat is Bardbarian?\nBardbarian is a game! A game we've been lovingly working on for far too long and are ready to unleash on Steam with (hopefully) some love from the Greenlight Community.\nWhat genre is the game?\nIt is a mixture of Tower Defense, RPG & RTS with some 'Shmup and Snake elements.\nWhat's the Story?\nYou play as Brad the barbarian, who is awoken to the sounds of his town under siege. Today is different though; Brad has grown tired of fighting all the time. The usual grind for XP has grown dull, and he has decided to pursue his dreams of making music instead of shedding blood. Fashioning a lute out of an old axe, he steps out to save his town in the most bizarre of ways.\nWhat's Gameplay like?\nMove Brad around the battlefield and dodge incoming enemy attacks and projectiles. Brad is constantly playing his axe-lute and generating notes, standing still will cause him to \"jam\" and generate notes even faster. These notes act as your in-game resource; you can spend them to perform solos to summon units to follow and fight for you, as well as solos to boost their performance.\nNavigate your party through the hordes of enemies, dodging and attacking, preventing them from destroying your town's prized decorative crystal. Survive waves to progress, collect loot, and unlock new units. Upon death you are able to visit the town shop in order to upgrade Brad, the town and your followers, in hopes to make it further next time.\nFeatures!\nBeautiful, hand-drawn artwork from start to finish\nAn awesome Rock/Metal original soundtrack by Maximum Satan\nBizarre genre-bending hybrid gameplay\n12 unique units to unlock\nCustomize your party loadout; Over 200 possible combinations\nCollect loot from your fallen enemies and upgrade Brad, the town, and your units\nA difficulty curve that will punish you for making mistakes, and you will\nOver 8 enemy types to make you regret everything\n4 Epic boss battles to crush your spirits\nEndless and Survival modes with leaderboards for when you're feeling competitive\nEaster eggs and references galore, can you spot them all?\nThere's a dinosaur boss\nThere's also a Ratcoon, look at those sad little eyes\nSteam/Greenlight Exclusive Features\nFull controller support + KB+M\nRevamped UI\nCamera Control\nSteam Cloud Saves\nRebalanced for Desktop\n3 Exclusive Indie Crossover Units\nSteam Achievements/Leaderboards","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bulkypix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":677165,"name":"Ghostrunner 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d27/d27010266d135dc7407364e1733484bc.jpg","description":"Ghostrunner 2 is a hardcore FPP slasher set in a post-apocalyptic, cyberpunk world. Featuring everything fans loved about Ghostrunner plus incredible boss fights, new interactive story, thrilling motorbike levels, improved skills, and more cyber ninja action.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"One More Level","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":40432,"name":"Resistance 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc7/bc7af8abde264d391a9ad148f944e20f.jpg","description":"Set in a brutal, alternate 1950s universe, America has been successfully conquered and destroyed by the deadly Chimeran race, forcing the last remaining human survivors to seek refuge in hiding. Players must take on the role of Joseph Capelli, the last surviving Sentinel from a clandestine military program, as he comes out of hiding to journey across a land of ruin in a heroic fight for survival against the merciless Chimera. \n\nIn addition to an epic single-player campaign, Resistance 3 will offer two-player online or split-screen co-op through the single-player campaign, and a new, focused progression-based multiplayer experience.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":17624,"name":"Burgers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7a/e7a348046848983d04d2f1f00c6dc2e2.jpg","description":"Experience the story of a small group of German soldiers sent to a small town to investigate strange activities. The task was supposed to be fast and easy. Instead, they would face the Unimaginable\nFind out how they had to fail their country to save the world\nInspired by Contra, Metal Slug, Castle Crashers and all of those good old coop games\n+Level up. Unlock new characters. Earn points. Purchase Weapons. Show off what you have\n+Enter the Arena. Test your skill against challenging Fights\n+Customize spawns for your own Arena\n+Be a lone Hero or team up with friends and start having fun blasting","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"storm_sharks","platforms":[{"id":0,"name":"PC"}]},{"id":3213,"name":"Curses 'N Chaos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d1/4d1d076e03e9e6ef9eb3c9b425aab725.jpg","description":"In this 2D Arena-Brawler world, there is only one law: fight or die! The Wizard King has cursed Lea and Leo, the fiercest fighters in the land! Now living under the shadow of death, they're hounded by ghouls and hunted by the grim reaper itself!  To lift the curse, you must concoct the legendary Elixir of Life! But there's only one way to get the ingredients...FIGHT MONSTERS!\nBut punching and kicking is not all you can do! Assisted by Allison the Alchemist, you can craft potions and summons to heal, create weapons and even marshall elemental powers at your command!\nPut up your dukes! Bring a friend along! The Wizard King's undead knights and monsters are not ready for the mayhem you'll unleash on them!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tribute Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2851,"name":"Unmechanical","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/140/140d147d8fce0e88594c34762f71d40c.jpeg","description":"Unmechanical is a puzzle adventure that combines tricky puzzle solving, alluring exploration, and an engrossing atmosphere. Set in a fantastic world of flesh, rock and steel, your journey to freedom requires you to solve a great variety of puzzling challenges, and while it’s easy to pick up and play, later challenges may prove very difficult indeed.Key features:Intuitive and simple controls, applied to a great range of interactions.\nA carefully created world with unique environments and an engrossing atmosphere.\nMore than 30 unique puzzles, including logic-, physics-, and memory- oriented challenges.\nUncover a dark secret through strange clues and fantastic events.\nOver three hours of puzzle-solving, exploration, and adventure.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Teotl Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":420000,"name":"Tiny Bunny","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d69/d6973b48a043bd48a351cb1fa190b212.jpg","description":"Tiny Bunny Is A Non-linear Horror Visual Novel.We're planning to release the game as 5 episodes; The first & second of them is already out for you to enjoy.\nEverything falls into slumber when winter comes, but not this forest.\nThere's something wandering its snow-covered paths, lurking behind black trees and taking whatever it considers due.\nIt leaves behind bizarre rumors of voices, calling you into the thicket, of faces, looking into your windows, of mysterious prints in the snow and... a bunch of \"child missing\" posters.\nThose, who have heard the voice of the forest, are beyond help. Their only option is to sink deeper and deeper into the cold embrace of horror to face their final choice in that icy darkness: to stay alive or to stay human?\nThe story takes place in a quiet, unremarkable village lost among the Siberian forest. The protagonist, Anton, had recently moved there with his family and was almost immediately forced to witness and participate in a chain of unsettling events.\nIt's a place where children go missing. The police are powerless, search teams are combing out the forest, but they find no traces. Why, then, is Anton repeatedly coming across prints, bloodstains, and scraps of clothing? It almost feels like someone is putting up a show just for him.\nHe is haunted by nightmares at first, which grow more and more frightening and bloody every night. They also grow increasingly real ... and beckoning.\n✔ A fascinating horror story that will remain in your memory for a long time.\n✔ Every choice you make affects the story.\n✔  Stylish  graphics made in black& white.\n✔ Original scary soundtrack will pierce you to the bones.\n✔ Disturbing, oppressive atmosphere.\n✔ Horrifying secrets.\nWarning! This game contains offensive language and scenes of physical and psychological violence. Proceed with caution!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"RUzura Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":47283,"name":"Orbital Racer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/957/957a04d0dafc5f0bd7e68b57d2c65108.jpg","description":"In space no one can hear you drift...\nOrbital Racer is a single-player racing simulator set in space. It combines the freedom of movement of 6DOF space simulators with the thrills of racing.\nThe game offers two distinct game modes:ACTIONThis mode is all about fast, satisfying gameplay. Just jump into the cockpit and use your speed and available powerups, including explosive missiles and mines to beat your opponents.SIMULATIONThis mode puts much more emphasis on realism. All ships behave according to Newtonian laws of physics with plausible thruster forces. This makes flying much more challenging but also uniquely satisfying as you'll be sliding sideways at the limits of controls most of the time.\nOther main features of the game:\nfully customizable controls\n8 distinct locations, all based on real places in our Solar System\na total of 24 tracks\na full, playable flight school for Simulation mode.\n3 different ship models, each with additional 3 variants\na challenging yet flexible AI\ncustimizable races\na compelling career mode","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Paweł Dywelski","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":22060,"name":"Super Rude Bear Resurrection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a5/6a5d512a0aae9f12cc8f8b05d46ec631.jpg","description":"Super Rude Bear Resurrection is an ultra-tight, masocore platformer that anyone can beat! Every time you die, your previous corpses stack up and you can jump on them, push them around and use them as platforms or meatshields. Each death makes the game slightly easier, but it's possible to beat the whole game without dying at all!\nRude Bear is a gangsta bear from East London who's been summoned back in time to medieval England to defeat his mortal nemesis, The Wizard. Face challenges so lethal, you'll (probably) need to be resurrected thousands of times to stand any chance of winning, and defeat the fearsome Guardians of each world.Features:\nSightseeing - Run, jump and die your way through sprawling levels, facing fiendish challenges across seven diverse worlds, from ancient ruins to convulsing flesh dungeons.\nUnlimited Rudeness – Enjoy an incredible 73 song Grime soundtrack by Deeco – with a unique track in every level.\nSuper Streamable – Twitch Mode lets your viewers affect the gameplay, spam emotes onto your screen and talk through your Fairy companion.\nGotta Go Fast – Built from the ground up with speedrunners in mind. From ghosts and quick menus, to slow-mo Practice Mode and RNG toggle.\nRampant Replayablity – Discover Bonus levels, unlock absurdly difficult achievements, and beat your friends' scores in Marathon Mode (including Boss Rush!)\nInsanely Tough – Crank the difficulty even higher by turning off corpses and checkpoints, or take on the ultimate challenge and try to beat the entire game with just one life.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Alex Rose","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18722,"name":"Ruzh Delta Z","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d0/1d0d70a901a5478c8b7798de54176238.jpg","description":"Ruzh Delta Z is a frenzied shoot-em-up which draws inspiration from classics such as Gradius, DoDonPachi, and R-Type. Shoot your way through perilous stages and wreck thousands of rogue vessels in your quest to become the ultimate pilot.\nFeatures\nIntense non-stop shooting action\nBullets, bullets, and more bullets\nNail-biting classic shmup gameplay\nTons of rogue vessels to destroy\nImmersive chiptune soundtrack","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pribuni","platforms":[{"id":0,"name":"PC"}]},{"id":18264,"name":"Xotic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6f/c6ffa32deff621743247a5d058d7d482.jpg","description":"Xotic is an arcade-style first-person shooter where you rack up huge scores by shooting enemies, detonating chain reactions, and discovering secret power-ups and point multipliers. Armed with a weaponized symbiotic creature called the Macroterra, you must cleanse the evil presence and re-plant the seeds of life on a planet ravaged by the minions of the Orb.\nDestroy the insidious scab plants and new life will grow in their place, diminishing the Orb’s control of the planet.  Trigger scab plant chain reactions to earn score multipliers and chain bonus points.  Collect Orb essence to boost your score, or grab them in mid-air to earn an aerial combo bonus.  Seek out and destroy the hidden Orb brains and collect all of the Orb essence in each level for even more points.\nEarn experience points to upgrade your weapons and skills, including “Absorbtion” which pulls points towards you automatically!  Unlock the secrets of “Hard Hologram” technology to deploy mobile shields or aerial landing platforms.\nXotic is a unique arcade shooter experience unlike anything you’ve played before.  Get it now!\nKey features\n\nArcade-style scoring and point combo mechanics\nUnique “Hard Hologram” technology\nExceptionally colorful environments and effects\nUpgradeable weapons and skills\nSteam Leaderboards & Achievements\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"WXP Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":15323,"name":"Foxhole","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d4/9d4787c3d42848def5f1c229b644c21a.jpg","description":"Foxhole is a massively multiplayer game where you will work with hundreds of players to shape the outcome of a persistent online war. Players ARE the content in this sandbox war game. Every individual soldier is a player that contributes to the war effort through logistics, base building, reconnaissance, combat, and more.\nDiscuss on r/foxholegame or chat with the community on our discord server.\nKey Features\nPlayer Directed Warfare - Every soldier is controlled by a player. Players ARE the content\nSandbox warfare, where players determine the narrative of a long term war\nPlayers drive every element of war, from weapon manufacturing and base building to strategy and combat.\nEmergent strategies and tactics make every part the war feel unique\nYour presence stays active in the world even after you've gone offline\nPersistent Living World  - Join hundreds of players in a shared, war torn universe\nConquer and relinquish territories in a back and forth, high stakes conflict.\nExecute long term strategies that take days of planning, changing the tide of the war with minimal casualties\nJoin an alternate timeline universe where the great wars never ended and the world has been in conflict for over a hundred years.\nPlay as a persistent character throughout the war, gaining notoriety and influence among your faction\nRealistic Tactics & Combat  - Tense and cerebral battles that keep you on the edge of your seat\nCapture and setup supply lines to keep your front line well equipped\nAmmunition, resources, and information are limited, requiring players to work together to survive\nDynamic battle conditions: Use the time of day and terrain features to gain an advantage\nTop-down, tactical combat where skills and strategy matter more than stats or XP points","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Clapfoot","platforms":[{"id":0,"name":"PC"}]},{"id":59064,"name":"Defiance 2050","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/899/899d3562d248b260d64804775c9ad457.jpg","description":"Content Roadmap: Plans for ParadiseDiscover what’s coming in Defiance 2050!\nLearn more\nAbout the Game\nJoin your friends and become an Ark Hunter in a massive cooperative online shooter like no other. Choose from an array of fully customizable weapons and classes, explore a unique futuristic open world, and engage in epic fast-paced third-person shooter combat.\nSeek fame and fortune as an Ark Hunter in a compelling sci-fi narrative\nFight it out through fast-paced third-person shooter combat in a massive open world\nBattle alien races alongside hundreds of other players in massive dynamic world events\nCraft a perfect Ark Hunter via thousands of unique class, weapon, and upgrade combinations\nTest your arsenal against other players in instanced battlegrounds and giant 64x64 open world battles\nJoin up as a 4-person squad and challenge punishing story driven instances\nRace from battle to battle across a devastated Earth using dozens of futuristic vehicles","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Trion Worlds","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":22577,"name":"Omnom Necropolis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0b/d0b141ec5a3ac13f7c3822fb76dfbd21.jpg","description":"Take the control over hungry graveyard worm. Unlock doors, use switches, teleports and much more! Collect bonuses, fight for the best time and score! And all of this in that creepy atmosphere, addictive logic game.\nThe task is clear - eat all brains, pumpkinks, eyeballs and skulls but be sure this won’t be so easy! Over hundred challenging levels were designed to tease your brain. Are you ready for this?\naddictive Puzzle Game\ndead Simple Rules\nthink Fast Gameplay\n120 Exciting Levels\ncreepy Atmosphere","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"postpunkpl","platforms":[{"id":0,"name":"PC"}]},{"id":21945,"name":"Drawn To Death","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f8/2f89ddb6efb0cf9b0768aabc711c243b.jpg","description":"Drawn to Death is a multiplayer shooter game. \n\n###Gameplay \nThe shooter arena is set in a teenager’s notebook. The actions demonstrate the adolescent nature of a child’s illustrations.\nThe player performs from the third person perspective; he aims to fight off the enemies and discover the stage full of secret cages. The players have a variety of characters to choose from. Each one of them has its special attacks, tendencies, and attitudes. Before the game starts, the players can try a tutorial. Once they do that, they learn the mechanics of the game and the protagonist’s abilities. While playing, it is possible to add weapons, upgrades like skins and taunts, and improve the fighting skills. As time passes, mystery boxes appear on the way; there the player can find various items such as weapons or different upgrades. There are four player types, involving the classic Deathmatch. \n\n###Key features \nThe game has its juvenile nature which widens throughout the scene. The unlocked weapons include a lizard flamethrower, a monkey throwing feces, and even a child’s hand which interacts in action. The shooting mechanics are quite childish as well, including a dash, a double jump, a kick, and other special moves. During the game, the characters make vulgar jokes accentuating the game’s details.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":19304,"name":"Dangerous High School Girls in Trouble!","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56e/56e70d7aba5ad0808da726b44f3cba7e.jpg","description":"\"Well behaved women seldom make history.\" - Laurel Thatcher Ulrich\nThis is the game where good girls get better by being bad!\nIn the 1920s, young women had a chance to change society--by misbehaving. Gather a gang of girls. Explore. Battle petty townsfolk with quick, naughty games: Fib, Flirt, Taunt... Win boyfriends and other useful prizes. Expose the town's depraved secret before it entraps your girls.\nExplore four beautiful game boards, dozens of character cards, and thousands of dialog cards (worn and aged from decades of neglect) which comprise the zany world of an American small town in the 1920s.\nEncounter nearly a hundred individual personalities. These denizens form the core culture of intolerance and repression your girls can overcome with wit, charm, and brazenness.\nConflict using a variety of naughty mini-games: Taunt, Flirt, Fib and others to stand up against bullies, cozy up to boyfriends, and evade oppressive expectations.\nConquer increasingly more powerful faculty and townsfolk as the story develops from the curious, to the weird, to the absurd, finally to collapse down a frozen crevasse of all too real inhumanity. Only the victorious will emerge, smirks on their faces, heels on the throats of the wicked, and their futures assured of freedom.\nAcquire dozens of prizes to swing games in your favor and help others along your journey. Gain experience and level up the talents of your gang members. Win boyfriends willing to sacrifice themselves for affection.\nWind your way through an epic of literary satire in an fantastical world where nothing is real but all is true, during a mythic time of social upheaval. Help the young women trapped in this world transform it for the betterment of all -- by misbehaving.\nThe approachability and accessibility of a board game.\nThe humor of social satire at a zany point in history.\nThe challenge of verbal battles woven intricately with the story.\nThe epic sweep of an RPG unlike any game previous.\n20 hours of leisurely entertainment that can be enjoyed a little bit at a time.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Mousechief","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14106,"name":"Sakura Swim Club","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e10/e10bf651ad387a164a5bf486bf69caa4.jpg","description":"In Sakura Swim Club, follow the story of Kaede, just your average high school guy. Upon transferring to a new school, he meets two beautiful girls in the swim club. Things haven't gone well for the swim club lately, but with Kaede's help, that all changes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9984,"name":"Slash It 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afc/afc5af85634df58c7a8c54b26e1ef4e4.jpg","description":"Slash It 2 is a 2D colorful arcade game. The goal is to press letters, numbers and type words in the right time and direction.\n6 Game modes, Hiscores & Steam Leaderboards\n300+ Achievements\nTrading Cards","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4058,"name":"Grand Theft Auto: Liberty City Stories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/212/21215abf004beda8b6c67255028a6696.jpg","description":"Forced to fight for his life in Liberty City, Toni Cipriani must use any means necessary to secure his place in the leadership of the Leone family.\r\n©2002-2006 Rockstar Games, Inc. Rockstar Games,  R*, Grand Theft Auto and Liberty City Stories marks/logos are Take-Two Interactive Software trademarks.  All Rights Reserved.  This videogame is fictional; doesn’t depict any actual event/person/entity; & any similarities are coincidental.  Take-Two doesn’t endorse or encourage engaging in any conduct depicted in game. Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is strictly prohibited.  Use of software is subject to license in the game manual & online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee and/or account registration (13+).\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\r\nAccess to special features require internet connection, may not be available to all users, and may, upon 30 days notice, be terminated, modified, or offered under different terms.\r\nThis title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionalities may not be available.\r\nThis item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated systems associated with this Sony Entertainment Network Account. Please see software description for device compatibility.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Rockstar North","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":1712,"name":"TEMBO THE BADASS ELEPHANT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb7/cb7c4cf7438f832be279a5ef81aca468.jpg","description":"Shell City is plunged into a state of emergency after coming under attack from the devastating forces of PHANTOM. Terrifying war machines, emblazoned with skulls, tear through the city leaving a trail of destruction in their wake! As the National Army struggle to contain PHANTOM, General Krenman sees the mammoth task at hand and calls upon the only thing that stands between Shell City’s obliteration and its salvation; the peanut chompin’, villain stompin’, PHANTOM romping BADASS Elephantidae…TEMBO THE BADASS ELEPHANT! Aided by his faithful avian companion Picolo, it’s up to TEMBO to jump, smash, punch, swing,  and butt stomp his way through the PHANTOM hordes as he aims to bring about the end of their tyrannical onslaught. Featuring 18 cleverly designed 2D side-scrolling levels, a whole host of deadly enemies and a unique comic book style art, TEMBO THE BADASS ELEPHANT is the heaviest action adventure of the year…weighing in at about seven and a half tons of fun.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]