[{"id":19805,"name":"Attack of the Labyrinth +","genre":"Action","price":0.0,"description":"NEW content in Attack of the Labyrinth +:\n- 3 more secret levels\n- new enemies\n- 4 hidden characters\n- Right stick firing\n- player Level up system\n- AI path finding\n- re-balanced\n- boss HP bars\n- New Map System\n- Custom Keyboard Controls\nKILL MONSTERS. DESTROY EVIL. GET RICH.\n\nThe forces of evil have invaded the land. A labyrinth of evil has appeared in the kingdom and legions of monsters are pouring out of its vile depths. The king has called upon a small party of heroes, the Champions of Virtue, to vanquish the demon within and free the land from a grim fate!\nAn action arcade game for 1-4 players. With the help of ancient magics and piles of gold, you must find the hidden relic in each area to reach the heart! Who can vanquish the evil within the Labyrinth, and who can escape with the most riches?\nGOT WHAT IT TAKES TO BE A CHAMPION?\n- Arcade shoot-em up action\n- Up to 4 players locally\n- play as a Knight, Wizard, Archer or Dragon!\n- dungeons are randomly generated\n- battle through 10 levels of the labyrinth to reach the heart of evil!\n- collect upgrades to help you mow down the forces of darkness!\n- Find powerful scrolls to aid your quest","imageUrl":"https://media.rawg.io/media/screenshots/1c7/1c78e376285c64a8da24d2eccfc84576.jpg","releaseYear":2015,"developer":"Timedrop Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19295,"name":"A Vampyre Story","genre":"Adventure","price":0.0,"description":"Once upon a time...\nDeep within the walls of a gloomy castle in the equally gloomy land of Draxsylvania, the young, gifted opera singer Mona De Lafitte is held captive by her tormentor, vampire Baron Shrowdy von Kiefer. Ever since she was transformed into a vampire by Shrowdy and whisked off to Draxsylvania, her greatest wish has been to return to Paris, continue her singing career, and one day become a star at the Paris Opera.\nWhen Shrowdy fails to return from a nightly foray, she at last sees an opportunity to flee. Together with her only friend and confidant, a cheeky bat named Froderick, she escapes from her prison and tries to find her way back to Paris. During her flight through Draxsylvania, where she encounters some strange inhabitants and some even stranger challenges, Mona must learn not only to accept her vampire nature, but also to use the abilities she has acquired to her advantage.\nFeatures:\n- A classic point-and-click comic adventure created and directed by Bill Tiller\n- More than 30 hand-drawn locations in 2D\n- Rendered using a real time 3d 'multi-plane' camera\n- More than 25 characters\n- Mona's vampire abilities and restrictions create interesting gameplay","imageUrl":"https://media.rawg.io/media/games/9c5/9c551139a785b9763f8f2f557455a284.jpg","releaseYear":2008,"developer":"Autumn Moon","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16561,"name":"Hordelicious","genre":"Action","price":0.0,"description":"Get ready to rock! Hordelicious is a semi-hardcore wave based arena shooter. Survive against endless hordes of enemies with over 45 randomly looted weapons and a plethora of items and upgrades to choose from!\nYour original mission was to explore the new planet we found. We knew about the life forms of the planet, but what we didn't know was that these creatures actually worship the planet itself.  Now we have disgraced their holy ground with our human feet and angered the creatures of this planet. You have to forget our original plans and fight your way out of there!Features:\n- Over 45 unique weapons\n- A plethora of items of upgrades\n- Epic boss battles\n- Achievements to unlock\n- Levels with multiple variations","imageUrl":"https://media.rawg.io/media/screenshots/b43/b43abe15d16ea8a27a7b58f1ece460a0.jpg","releaseYear":2015,"developer":"Marko Silvasvuori","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15759,"name":"Counter Agents","genre":"Casual","price":0.0,"description":"Counter Agents is a spy-themed, head-to-head multiplayer game where your objective is to sneak around guards, steal the briefcase, and make it to an exit point before your opponent. Take on the solo-player challenges, compete with your friends in multiplayer mode, and enjoy creating your own maps with the brilliantly simple level editor!\nCounter Agents originally started as a student program prototype project during the Fall of 2015 and gradually took shape to what it is today. The original goal was to take an arcade game dating 1983 or earlier and build off of existing mechanics to create something new and unique. The game we were inspired by was 005 (1981), one of the very first stealth games. Of the various 005 game modes, we loved the scenes where you had to avoid policemen with flashlights. We took this idea and created a customizable multiplayer experience with more 3D levels. Keeping the project alive between projects, we have playtested, iterated and polished Counter Agents tirelessly over the past year. Now we’re excited to finally bring it to Steam!\nKey Features:\nThree game modes include Single Player Challenge, Multiplayer (1-4 players), and Level Editor. The goal of each mode is to find and steal a briefcase and escape, all while avoiding guards, detectives, and other players.\nTop-down view of a 3D environment. There are 3 floors that promote clever level design and strategy.\nLevel editor has a simple UI with a drag and drop mechanic so that anyone can create complex designs. Players can post levels to the online community for anyone to play and rate.\nAll original music and audio by our composer, Lance Montgomery.\nCounter Agents will be completely free! No in-game purchases, and no priced DLC. We promise that all updates and bonus content will not have a price.","imageUrl":"https://media.rawg.io/media/screenshots/966/9663c24b8d7a491149e973c7a07eb4df.jpg","releaseYear":2016,"developer":"Jeff Jackman","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15099,"name":"Hot Squat","genre":"Simulation","price":0.0,"description":"Welcome to Flynn Fitness, home of the Hot Squat. Prepare to undergo a rigorous test to not only your legs, but also your will to do as many squats as you possibly can. Compete against your friends, yourself, and the world to get the highest squat count. Strive to get every challenging achievement that will prove to yourself and others that you are a better squatter than they are. Good luck on your journey to get huge, you’ll need it.\n•\tCompletely free! (No micro-transactions, no paid DLC)\n•\tSteam Leaderboards\n•\t11 Challenging Steam Achievements\n•\tExercise and burn calories while having fun\n•\t80’s / 90’s aesthetic\n•\tEndless - you will always have a challenge\n•\tA bumping song to keep your energy high","imageUrl":"https://media.rawg.io/media/screenshots/0ee/0ee5d092df880bc9cfbb9956c8b4916e.jpg","releaseYear":2016,"developer":"Bean Boy Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14752,"name":"Bitardia","genre":"Action","price":0.0,"description":"This story is based on Russian imageboard culture.\nYou are a nerdy /b/tard, who always stays at home.\nOne day someone sends you a link to a weird website, upon going to which you are teleported into a mysterious island, populated by several hostile fractions. You need to choose between the two conflicting forces in order to get rich, to overcome your nature or just to survive. You can loot caravans.","imageUrl":"https://media.rawg.io/media/screenshots/134/1345a898441522b17b240cdb23adce41.jpg","releaseYear":2015,"developer":"varlamov5264","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14210,"name":"Rumble Fighter: Unleashed","genre":"Action","price":0.0,"description":"Rumble Fighter is a free-to-play fighting MMO game with real mixed martial arts and fast-paced beat-em-up action! Brawl with your friends and train to become the top Rumble Fighter!\nStory\nA long time ago, the Dark Lord broke the peace treaty with the Gods, and commanded his dark forces to conquer the unsuspecting Rumble Fighter world. The vulnerable Rumble Fighter world was almost immediately taken over by the dark forces. When all hope was lost, a miracle happened! Powerful heroes chosen by the Gods arrived to defend against the dark forces.\nThe raging battle between the dark forces and heroes went on for so long that it seemed like it would never end. However, the heroes prevailed and finally sealed the Dark Lord. Peace would finally return to the Rumble Fighter world.\nHowever, the great heroes did not have time to enjoy the peace. Dark forces that scattered after the battle are actively attempting to break the seal and rescue the Dark Lord. Thus, the heroes are still out there fighting for the Rumble Fighter world.\nThe heroes united together under an association called \"Guardians.\" Every member dedicates each day to training and hunting for dark forces.","imageUrl":"https://media.rawg.io/media/screenshots/db0/db020ea37b41fca2f88000c0a99e8abe.jpg","releaseYear":2016,"developer":"NIMONIX","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13547,"name":"High Profits","genre":"Simulation","price":0.0,"description":"Get Naked!!The SUMMER OF LOVE event is landing July 28!!! Shed those scratchy clothes, smoke what you got, and let your freak flag fly. Play with sexy new strains and earn sweet summertime goodies for your stash. Free love, man!\nAbout the GameEver wanted to make money from your own Grow-Op? High Profits is your go-to weed growing game.. Gorgeous Graphics, Chill Music and Quirky Characters make this Pot Growing Game Highly Addictive!\nAdd cash to your stash, track your earnings, diversify your pot portfolio and Make Profits!\nClick away, become a virtual Millionaire, Billionaire, Trillionaire, Decillionaire or even a Duodecillionaire!\nAnd if you earn enough and are brave enough, you may be able to purchase enough plutonium to travel back in time and compete in the legendary Game of Stoned!\nFEATURES\n• Pile up your cash or spend it like a madman, there’s no wrong way to play!\n• Join Limited-Time Events to double your enjoyment with new grow-ops! Past events include Jamaica Me Hazy, Summer of Love, and 420!\n• Grow that marijuana and make green all the time - whether you’re in-game or not!\n• Blaze through your money by upgrading your cannabis supply speeds and improving your firm\n• Smoke away the charts by becoming the richest bud dealer\n• Share your successes with friends and brag about your loads of money\n• Upgrade those Event Buds to win exclusive Bronze, Silver and Gold SWAG\n• Grow that Mary Jane that never complains!\n• Puff Puff for your firm to make that bonus cash\n• Turn that Green to Gold and Fertilize those crops with some elusive Guano\n• Grow your cannabis and make money as a dealer from your couch","imageUrl":"https://media.rawg.io/media/screenshots/ab4/ab49eec7b4f41d0eee6651db3fb2f452.jpg","releaseYear":2017,"developer":"Double Coconut","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11180,"name":"Major\\Minor","genre":"Adventure","price":0.0,"description":"The Power to Manipulate Reality\nThe Struggle Between Two Worlds and Their Plagued Co-Existence\nA Political Battle On The Verge Of Revolution\nA Mysterious String Of Murders, Claiming Family and Friends\nAt The Heart of It All -- Is You\nA wave of murder and suicide has been hitting the country, all under circumstances more than mysterious. You play as one of the \"Lucky Two\", winners of a contest who have the honor of touring with an international pop idol. But as you arrive in Tokyo for the launch of this world tour, events quickly escalate. You have no choice but to delve deeper into dangerous territory -- all in the name of uncovering the truth of these enigmatic deaths. A truth that involves the dissonant connection to another world; and the inhabitants within who seek salvation. You are The Savior -- and it is your job to deliver a brighter future to this world.\nFeatures:\nLength Of Several Novels\n30 Characters to Interact With\nForge Friendships With An In-Depth Affection System\nSMS System: Send and Receive Text Messages To/From Characters\nMany Choices Leading to Different Experiences\nMultiple Endings\nSteam Trading Cards\nController Support\nSteam Achievements\nSteam Link and Steam Overlay Support","imageUrl":"https://media.rawg.io/media/games/3aa/3aa83e2419e9060293e85355c5d47bab.jpg","releaseYear":-1,"developer":"Tall Tail Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11122,"name":"Football Club Simulator - FCS","genre":"Strategy","price":0.0,"description":"The real-time club simulator\nWhat is it? Simple, really…\nFootball Club Simulator gives you total control of your team through an elegant and powerful interface.\nThis means that the player gets to make all the decisions of the Club as Head Coach, Manager, and Chairman.\nIn addition, you can try out your strategy in the “Interactive match” while giving orders to your payers in real-time.\nA football & strategy videogame\nLet your inner football strategist out!\nYou realize in just minutes that your decisions are making the difference and you are leading your team to glory. And all this in real-time!\n1. During the Season\nMake new signings to strengthen the squad or expand the stadium for more ticket sales and revenues.\n2. Each week in training\nDecide on what tactics to implement and choose the starting eleven…\n3. Crucially\nGive orders to your players in real-time during the match. You’ll love the feeling of being in control that Football Club Simulator offers you.\nThe “Interactive match”\nExperience the game from the dug-out\nIn the “Interactive match” you’ll see your players doing what you’ve been working at training sesions during the week and playing to your tactics. And this it´s only the first step of your victory.\nMost importantly, when the key moment arises, you can give orders to your players in real-time. They’ll instantly carry out, giving you the chance to lead your team to glory.\nWhen you make the calls in the “Interactive match”, you will see stunning moves and incredible goals.\nEnjoy them both as they happen and while watching the replays.\nThe “Plays chalkboard”\nFootball is not only about winning, its about winning in style…\nWe all know exactly how we’d have our teams playing if only we had the chance.\nThe “Plays chalkboard”, another Football Club Simulator exclusive, has put this within your reach.\nFreeze the match, study the players’ positions and draw in the movements, actions, passes and shots you want them to make.\nThe “Command system”\nNever forget… You are the Boss!!!\nThe “Command system” offers you a wide range of orders with which to change the flow of the match.\nIn defense\nTell your players to clear the lines, play the offside trap, up the intensity or keep hold of the ball as part of your strategy.\nIn attack\nPick the right moment to instruct your players to play the ball into the hole, open it up out wide, move it around or go route one.\n“Real-Time orders” at match day\nCommand your team in real-time\nIn each half of the match; you'll have 20 seconds to run each order.\nYour technical team has already got this covered.\n+40', +60', +80'… Train specifically so that you can add up minutes to carry out each order on match day. Another step towards victory.\nThe “Real-Time shot”. Hit It!\nDo not hold back! Hit it!\nWe proudly present the thrilling real-time command.\nWhen one of your players has a clean sight at goal, do not hold back, give the order \"Hit it!\" and he'll shoot. Rise up your chances of score!","imageUrl":"https://media.rawg.io/media/screenshots/03f/03f4e42a8fb16a4fe6ed9626989b6d58.jpg","releaseYear":2016,"developer":"The Football Club Simulator Company","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10802,"name":"Bold New World","genre":"Simulation","price":0.0,"description":"Bold New World - a unique game in medieval style.\nYou have to play for a hero who came to the captured city.\nYou will need to save the city from invaders. And that you are a hero, only you alone can do it!\nIn the game you will have:\n- Unique battle in melee weapons\n- Beautiful graphics\n- Big medieval town","imageUrl":"https://media.rawg.io/media/screenshots/d1f/d1fef1450577e138ec66c58a0db14b1c.jpg","releaseYear":2017,"developer":"Limed","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10374,"name":"Heroes of Havoc: Idle Adventures","genre":"RPG","price":0.0,"description":"Victory is only a tap away!\nNow is Your Time… gather your fighters, unlock their powers and guide them to become legendary heroes! When Havoc reigns, only YOU can save the Realm in this fantasy adventure from the world of Might & Mayhem!\nWelcome Master, to Heroes of Havoc, the RPG that combines clicker controls with amazing 3D graphics! Sending your heroes into battle couldn’t be simpler. Just give the command and your epic party will march into combat, slaying monsters, earning XP and collecting loot while you upgrade your heroes and reap the rewards.\nCONQUER the Realm and BATTLE through an endless campaign, daily challenges and special missions\nCOLLECT over 50 heroes with over 200 unique abilities\nCRUSH your opponents in the ONLINE PvP arena, rise through the seasonal LEADERBOARDS to win unique heroes and gear.\nEVOLVE and UPGRADE your heroes to unlock their skills\nDEFEAT epic bosses in the Elite Campaign and add them to your squad\nLOOT enemies for powerful equipment and relics that bestow your heroes with new powers\nPlay Your Way\nEngage the enemy by levelling up your fighters and equipping new loot during missions, or put your phone down, kick back and eat a sandwich. Your team does all the work, saving the Realm while you savour the sweet taste of victory… YUM!\nBuild the Ultimate Team\nSelect your chosen warriors for each mission, each of them bringing up to 6 skills into battle. There are over 50 heroes to collect, letting you strategically mix and match from different classes with more than 200 unique abilities to destroy your foes.  That’s a total combination pool of (50!)/(4!*46!) which is frankly math on a level we don’t understand and can’t even attempt without a calculator!\nSimple Mechanics Meet Superior Graphics\nHands down the best visual fidelity in the genre, Heroes of Havoc gives you a simple, immersive RPG experience that never sacrifices quality.","imageUrl":"https://media.rawg.io/media/screenshots/910/910877616f32b1dfd4bb69ea955c15a7.jpg","releaseYear":2016,"developer":"Kiz Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10024,"name":"The Keep","genre":"RPG","price":0.0,"description":"An old-school dungeon crawler with real-time combat.\nThe idea behind The Keep is very simple, to bring the essence and dark atmosphere of RPGs from the past for newcomers and fans of the genre alike.\nIn The Keep you will embark on a quest to explore caves and mines filled with monsters to slain and puzzles to solve underneath and surrounding tower of evil sorcerer. It won’t be easy, you will die. A lot!FeaturesAn old-school first-person dungeon crawler with a modern twist.\nExploring and puzzle solving—the caves and dungeons are full of surprises. There will be deadly traps, elaborate mechanisms guarding secret passages, trapdoors and treasures with powerful weapons and supplies.\nReal-time combat—a battle against enemies with a gesture based combat, but swiping horizontally or diagonally is not enough. Defeating enemies means that you have to break their defences hitting the upper or lower body or focusing on their head.\nEvery enemy requires different strategy and every weapon class offers unique combos.\nRune magic—you can rearrange runes on a 5×4 board and then chain them together to cast powerful elemental magic (Fire, Ice or Lightning). Runes are scarce but there are a lot of spells, so be careful to pick the right combinations.\n3 difficulties. The Keep will offer something for newbies in the genre, seasoned adventurers and for those who like to tackle with proper challenge—every difficulty level will have a Permadeath option.\nStorylineMany have been mesmerized by the blue depths of the Crystals. Those who tried to control them became their slaves. The weak were killed and the strong broken. With ancient knowledge of magic rediscovered old terrors found their way into the Realm and a new nefarious wizard came into being.\nWhile the Council hides behind thick stone walls and ignores the Darkness sweeping across the Realm a young warrior comes to face the wizard. He is certainly not the first one to do so...\nEnter the Keep as an unsung hero on a quest to destroy the nefarious wizard Watrys. Explore the subterranean depths in this first-person dungeon crawler featuring real-time combat, a unique rune magic system, exploration, and puzzle solving. This game will awaken memories of what made old-school RPG dungeons so much fun to play while you fight, hunt for hidden treasures, and avoid deadly traps. Get to know your enemies, find their weaknesses, and crush them. Experiment with magic to discover powerful spells. Only the strongest will survive.\nTo defeat the seemingly undefeatable Watrys, you will need to level up your character and find powerful armor and weapons.\nDo you have what it takes to stand against such evil?\nThen don’t procrastinate and enter. The Keep awaits you...","imageUrl":"https://media.rawg.io/media/screenshots/233/2332cc01a636a78db20252b33bdbc8af.jpg","releaseYear":2014,"developer":"CINEMAX","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"macOS"}]},{"id":9012,"name":"Space Rangers: Quest","genre":"Adventure","price":0.0,"description":"SPACE RANGERS: QUEST is a new text adventure in the world of Space Rangers with a touch of nostalgia. Save the Coalition from the new threat!\nChoose a space ship and sail on a journey. You are to research the origin of the threat and defend the organic life. But do not expect to be laureled – a life of the ranger is full of danger. You will be getting hard-earned credits, doing the dirty and sometimes illegal work. But if you manage to get space maps, then you will gain access to the entire galaxy full of possibilities. Intelligent and over-intelligent races, battles vs. pirates, holograms and hallucinations, battle controlled robots! Never say never and just be on guard.FEATURES\nCLASSIC TEXT QUESTS. A classic sci-fi saga both in the form and contents, easy written and humorous.\nINGENIOUS PUZZLES. A space ranger shall be smart and intuitive to find the way out of challenging situations. Dozens of unrepeatable situations – from combat to especially hard-to-crack puzzles.\nSPACE BATTLES. It is kind of stupid to leave a dock without guns – humongous space monsters are quite unlikely to attack you, but numerous pirates from every system definitely can. Shields ready?\nROLE-PLAYING. By completing tasks you can earn not only credits to get fuel or repair a ship, but also to do multiple upgrades. Spend them all, or deposit for future – this is the question. So use them wisely!\nRANDOM EVENTS. Every system always means a new acquaintance, but it is quite hard to tell what it brings.\nUNKNOWN TWISTS and Turns of Supposedly Well-Known Events. An attentive ranger will find out much more than what was in the galaxy news.","imageUrl":"https://media.rawg.io/media/games/bfb/bfbc409e5d6484a603bada218f772c63.jpg","releaseYear":2016,"developer":"SNK","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":6254,"name":"Proto Raider","genre":"Action","price":0.0,"description":"Proto Raider is a single screen auto-running puzzle platformer covered in ASCII beauty.\nThere's so much to do when exploring this colorful and imaginative world. Grab your scuba gear and go for a dive, chill out and ride some waterfalls, or maybe go sailing! Be careful though, as with all wondrous actions come with consequences. You just might drown, get poisoned, burnt to ashes, or turn into stone!\nIn order to complete quests and collect treasures, you'll need agility, weapons, and special items that give you various superpowers. Most of all, you'll need courage my friend. Fearsome monsters and bosses lurk in this world... and YOU will have to defeat them, grab the key, and go!","imageUrl":"https://media.rawg.io/media/screenshots/f54/f54d34678c62e0d8bdb33b604137daeb.jpeg","releaseYear":2015,"developer":"Puzzle Lab","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":4383,"name":"Datura","genre":"Adventure","price":0.0,"description":"From Plastic Group, the creator of the innovative Linger in Shadows™, Datura™ is a new form of interactive play taking inspiration from the world of film narrative to immerse players in a gaming experience never seen before.\nNavigate your way through a mysterious forest by controlling your character’s hand using the PlayStation®Move motion controller or DUALSHOCK®3 wireless controller. Datura™'s experimental narrative and unique style of interaction enable players to experience the world with more than just their eyes, creating the illusion that you can actually touch trees, faces and other objects.\nAs you travel through the game, you will find yourself confronted with a series of choices, and while some may be clear, others are much more ambiguous. It is through this element of choice that Datura™ explores the aspects of consequence. What is right, and what is wrong? That is for you to decide...\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n©2012 Sony Computer Entertainment America LLC. Datura is a trademark of Sony Computer Entertainment America LLC. Developed by Plastic/Santa Monica Studio.","imageUrl":"https://media.rawg.io/media/screenshots/1c5/1c5c574f1c04bf0434443199348f9d9e_cnD2pUD.jpg","releaseYear":2012,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":1289,"name":"Doodle Kingdom","genre":"Action","price":0.0,"description":"Check Out More Doodle Gameshttp://store.steampowered.com/app/348360\nhttp://store.steampowered.com/app/598940\nhttp://store.steampowered.com/app/608760\nhttp://store.steampowered.com/app/538060\nAbout the GameIt's time to get MEDIEVAL!\nFrom the creators of the award winning puzzle games Doodle God & Doodle Devil, comes a new fantasy brain-teaser where you can create your own Kingdom with Castles, Knights, Warlocks and Dragons! Great for gamers of ALL ages.\nDaring adventure awaits you in this fantasy world where you can breed and raise four different types of Dragons, return the family castle to prosperity or defile flowering lands as a Necromancer.\nNew Game Mode: Arm your Knight to fight through the hordes of monsters and mighty bosses in a new runner-style combat game!\nThe famous Doodle series puzzle game play has been completed re-imagined in this ALL ages fantasy adventure.\nCreate a New Kingdom Today!\nCRITICS LOVE THE DOODLE SERIES\n“It's addictive. Insanely so! Lots of fun.” – 148Apps\n“Wonderfully unique concept. Deeply satisfying!” – GameZebo\n“Giving it huge thumbs up!\" - TUAW\n“Discovering each new element was an utter delight.\" -AppSafari\n\"You'll have to use your creativity…ruthlessly addictive.\" - Slide2Play\nFEATURES\n- All ages puzzle game play for the entire family\n- Intuitive one-click gameplay encourages thoughtful, creative play.\n- Breed and raise four different types of Dragons\n- Quest as a fearless Knight, Powerful Warlock or fantasy Dragon\n- Play the new “runner” combat mode\n******\nLIKE: www.facebook.com/doodlegod\nFOLLOW on Twitter:  www.twitter.com/doodle_god\nMore than 500 detailed reviews in gaming press, including:\nMetacritics list of Reviews - 70/100\nKingdom of magic! - 3.5/5\nThere's no denying Doodle Kingdom's addictive quality. - 80/100\nBreed dragons and create an empire in Doodle Kingdom","imageUrl":"https://media.rawg.io/media/screenshots/917/9172a9606559ba19417af6a65a7c3aee.jpeg","releaseYear":2013,"developer":"8Floor","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Web"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"}]},{"id":991790,"name":"Dragon Age: The Veilguard","genre":"Action","price":0.0,"description":"Dragon Age™: The Veilguard Deluxe Edition\nObtain a variety of weapons and armor, including curiosities from a forgotten era, with the Deluxe Edition. You’ll receive cosmetic weapon and armor sets for the Warrior, Mage, and Rogue classes as well as cosmetic armor sets and weapons for each of your 7 companions. That’s 3 armor sets for Rook, 6 weapons for Rook, 7 companion armor sets, and 7 companion weapons — saving Thedas never looked so good.\n6 Weapon Appearances for Rook. Cosmetic only.\n1 Warrior Armor Set Appearance for Rook. Cosmetic only.\n1 Mage Armor Set Appearance for Rook. Cosmetic only.\n1 Rogue Armor Set Appearance for Rook. Cosmetic only.\n7 Weapon & 7 Armor Set Appearances for Companions. Cosmetic only.\nAbout the Game\nEnter the world of Thedas, a vibrant land of rugged wilderness, treacherous labyrinths, and glittering cities – steeped in conflict and secret magics. Now, a pair of corrupt ancient gods have broken free from centuries of darkness and are hellbent on destroying the world.\nThedas needs someone they can count on. Rise as Rook, Dragon Age’s newest hero. Be who you want to be and play how you want to play as you fight to stop the gods from blighting the world. But you can’t do this alone – the odds are stacked against you. Lead a team of seven companions, each with their own rich story to discover and shape, and together you will become The Veilguard.\nUnite the Veilguard and defy the gods in Dragon Age™: The Veilguard, an immersive single-player RPG where you become the leader others believe in.\nSAVE A BATTERED WORLD\nEnter Thedas, a vibrant world of rugged wilderness, treacherous labyrinths, and glittering cities. The world is teetering on a knife’s edge while corrupt gods unleash havoc across the continent. Nations war, and factions splinter. Who will you trust? From the Arlathan Forest to the back alleys of Minrathous, this is a broken world. Your actions will affect the fate of Thedas forever.\nDramatic Single-Player Campaign — When corrupt Elven Gods threaten Thedas, lead the charge to save it. Rook isn’t afraid of a fight, no matter the odds. No matter the cost.\nVibrant & Diverse Environments — Enter a vivid fantasy world, and experience imaginative new locations as well as some you’ve heard of but never seen.\nLarger-than-life Foes — Battle darkspawn, demons from beyond the Veil, dragons that rule the skies, and unique enemies as you advance your quest and fight for Thedas’s future.\nUNITE THE VEILGUARD\nUnite a team of 7 companions, each with rich lives and deep backstories. These are characters to befriend and even fall in love with. Among them, an assassin, a necromancer, a detective, each and all bringing their own expertise and unique abilities to the fight. You are never alone — decide who to take into battle, and together face down demons, dragons, and corrupt gods.\nRecruit Distinct Companions — Your team is full of individuals with grim and wondrous histories, their own personal struggles and motivations, and rare skills that’ll help you survive. You’ll fight alongside Harding: The Scout, Neve: The Detective, Emmrich: The Necromancer,  Taash: The Dragon Hunter, Davrin: The Warden, Bellara: The Veil Jumper, and Lucanis: The Mage Killer.\nRich Companion Stories — Deepen relationships with each companion and learn more about them on your adventures in Thedas. Your choices in these stories will impact how they develop, and completing them might unlock powerful abilities. Create memories with your team that will deepen your experiences in Thedas and give you more to fight for.\nBECOME THE LEADER OTHERS BELIEVE IN\nSelect from different races and combat classes, customize your appearance, choose your character’s backstory, and begin your journey as Rook, Dragon Age’s newest hero. The choice is yours. On your adventures, you’ll gain new abilities and discover unique, powerful artifacts to enhance your own combat style. Brace yourself: there are tough decisions to be made, allies to inspire, and a fight that needs every sword, staff, and bow you can muster.\nBe Who You Want To Be — Craft your personalized Rook with a robust character creator. Choose from a diverse set of appearance options for Human, Qunari, Dwarf, and Elf lineages.\nChoose Your Way To Play — Select from 3 classes (Warrior, Mage, and Rogue), each with 2 distinct weapon types and unique abilities you can select between. Experience new strategic depth as you combine fast-paced attacks, parries, and dodges with the companion ability wheel to exploit enemy weaknesses and seize victory with devastating combat combos. Customize a combat style that works for you.\nDeep RPG Progression — Level up your Rook and companions with their own skill trees. Choose perks and combat abilities as you climb towards more powerful specializations.\nWARNING: See important flashing images and other health and safety information at .","imageUrl":"https://media.rawg.io/media/screenshots/d33/d3386bb608c067644c84209aff2d7680.jpg","releaseYear":2024,"developer":"BioWare","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":600906,"name":"Alex Kidd in Miracle World DX","genre":"Action","price":0.0,"description":"The legendary Alex Kidd returns with Alex Kidd in Miracle World DX!\n\nSince his first appearance in 1986 with Alex Kidd in Miracle World, the iconic Alex Kidd makes his return to smash rocks, collect coins and tackle bosses once again in Alex Kidd in Miracle World DX!\n\n\nReturn The Kingdom of Radaxian to its former glory and destroy the evil Janken the Great!\n\nComprising of all levels from the original title as well as brand new levels which expand the lore of Alex Kidd, experience Miracle World like you’ve never seen it before with new animations, graphical detail and gameplay improvements.","imageUrl":"https://media.rawg.io/media/screenshots/40e/40ec9c2169f29ced1f0524c065fef266.jpg","releaseYear":2021,"developer":"Merge Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":493459,"name":"City of Gangsters","genre":"Strategy","price":0.0,"description":"Start a crime syndicate from nothing, and grow it into a well-oiled money machine. Build speakeasies and illegal distilleries. Manage production chains and resource distribution. Smuggle goods from out of town and bribe the police to look the other way. Grow a powerful crew and keep your rivals under your thumb. Eliminate competition and rule the city. But most importantly, keep the money flowing.\nThe year is 1920, the start of Prohibition in the USA. With congressional action, a huge segment of the national economy becomes illegal overnight: bars and saloons are ordered to close, distilleries and breweries go quiet, distributors shut down. But a new era is dawning: a gilded age for smugglers, black markets, illegal manufacture, and organized crime.\nThis is where you come in.  You’re a new arrival in the city at the dawn of Prohibition, with ambitions of striking it big. Behind many of the city’s facades, people are building makeshift distilleries, secret loading docks, nighttime speakeasies. Work your way into this network, and the world will be yours.\nBut think beyond making a quick buck or two. You gotta be thinking ahead. You gotta be thinking bigger. Much bigger.\nWell-organized crime\nGet started in the booze biz by hocking some homemade hooch. Start your own stills, and find raw materials to supply them. Learn new techniques to make expensive drinks, or smuggle imported booze to fuel your growing operation. Soon you’ll be supplying entire neighborhoods, and opening your own swinging speakeasies.\nYou gotta know a guy\nOn the black market, social currency matters as much as the greenback. With cops and feds sniffing around, trust is everything and personal introductions are worth their weight in gold. So work your connections to find profitable new friends, and get people who owe you favors to put in a good word.\nYou can’t do it alone\n​​​​​​​You will need plenty of hands to open new fronts, do delivery runs, and protect your product from envious rivals. Your outfit’s ambitions are only limited by the number of people working for you. Keep them paid, armed, and organized, and who knows how far and how fast you’ll rise.\nThe walls have ears​​​​​​​\nBut proceed carefully, because everyone is always observing what you’re doing, and family members stick up for each other. Whether you send your people to harass someone, or to help them, you can be sure they’ll remember it down the line.\nGetting territorial​​​​​​​\nAs your outfit grows, convince locals that your goods and theirs will be looked after. Territory under your control will provide a safety net, an income base, and a wealth of opportunities for further growth and expansion.\nThis era belongs to you​​​​​​​\nYou’ve grabbed the opportunity by the horns, and the city is yours for the taking. But you only have a few years to make your mark on history, to build the largest, most profitable crime syndicate, take over your competition, and rule the entire city.\nBecause after 1933, it will be all over, alcohol will be legal again. And doing business fair and square, well, everybody knows that’s not where the real money is.","imageUrl":"https://media.rawg.io/media/screenshots/f2d/f2db3c491307ae5b5efb92242dcd024c.jpg","releaseYear":2021,"developer":"SomaSim","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":491367,"name":"Ashina: The Red Witch: Prologue","genre":"Adventure","price":0.0,"description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1259140/Ashina_The_Red_Witch/\nAbout the GameThe story is about Ash. An ordinary girl who takes a journey through a mysterious spirit world filled with strange creatures. Ash must find her way back home...before something else finds her.\nAshina: The Red Witch is an exploration-based story-adventure game. Use items to solve puzzles as well as talking to various other characters to help dig into the story even further. Take control of Ash and discover the events before the first chapter of this story driven adventure game. Enjoy the prologue of Ashina: The Red Witch!","imageUrl":"https://media.rawg.io/media/screenshots/96d/96dd1c6585eeeded9849762c579181c7.jpg","releaseYear":2020,"developer":"Stranga Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":351751,"name":"Heal","genre":"Adventure","price":0.0,"description":"Guide an old man through the dark and atmospheric world of Heal in this abstract 2D puzzle-adventure point-and-click game.\n____________________\nI often wonder...\n... does he find my tone familiar?\nI want to believe he does...\n... and so I keep talking to him.\nI only want to see him again...\n... even if it was one last time.\n____________________\nHeal is an experimental game from the creator of DISTRAINT -series:\nhttps://store.steampowered.com/developer/jessemakkonen\nHeal doesn't have any text, dialogue or speech. The narrative is driven by a strong and obscure atmosphere.\nSide-scrolling 2D with unique, hand-drawn graphics\nAtmospheric music and audio design\nNarrative driven by the atmosphere\nAbstract world filled with challenging but player-friendly puzzles\nHand made in Finland, no asset flips or cheap tricks! :)\nNOTE: This game is still early in development, some information and footage may still change before the release!","imageUrl":"https://media.rawg.io/media/games/0c6/0c60cbea1609645111721d50197e1bb2.jpg","releaseYear":2020,"developer":"Jesse Makkonen","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":341613,"name":"Higurashi When They Cry Hou - Ch.7 Minagoroshi","genre":"Adventure","price":0.0,"description":"June, 1983.\nThe summer heat has arrived earlier than it does most years.\nBy day there are cicadas, and by night, the higurashi.\nHinamizawa, a small village in the Japanese countryside.\nWhile there are fewer than two thousand people there, every year, 'something' happens.\nFor the past 4 years, someone has died, and someone else has gone missing.\nThis series of deaths and disappearances is connected to the local resistance against a now-abandoned dam construction project.\nA murder during the construction, covered up by the local authorities, is being re-enacted year after year.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there... isn't.\nSomeone who wasn't supposed to be there... is.\nSomeone who was alive last night is now dead, and someone who is here right now isn't alive.\nThere is no way to avert this tragedy. There is no choice but to give up trying.\nBut even so... please don't give up.","imageUrl":"https://media.rawg.io/media/screenshots/6c4/6c47aa373e7dd4d429a7bd38f79a5fac.jpg","releaseYear":2019,"developer":"07th Expansion","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":286547,"name":"Fromto","genre":"Simulation","price":0.0,"description":"Fromto is a horrible, childish 2D sandbox racing game with in game track building.  All players race an unfinished track in turn. When everyone fails all players must ‘work together’ to modify the track before they try again. Think strategic, build sneaky routes and trick your opponents with nifty traps and obstacles. Experiment endlessly with tons of track parts and win in unthinkable ways. Play with up to four friends (online or offline) in this action packed living playground. After you ruined all your friendships you can dive into the single player speed run challenges.\nFeaturesUp to 4 players Online/ local multiplayer\nSingle player challenges\nHot seat mode to play multiplayer with one controller or keyboard\nSuper high replayability\nOnline leader board for single player challenges.\nRecord/ replay your gameplay.\nFun to watch!\nlots of different cars\nVery tuneable gameplay settings. (crate/ shop/time/ score/ damage settings)\nFull controller support\nNifty secrets\nMany, many track parts\nDestructible terrain\nUnseen art style partially made by young children.\nUnlock cars, obstacles and levels as you progress.\nAmazing soundtrack","imageUrl":"https://media.rawg.io/media/screenshots/47f/47fc1c5888eb3fd76f24f37ce707fd88.jpg","releaseYear":-1,"developer":"Studio Erikson","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":282931,"name":"Wet Girl","genre":"RPG","price":0.0,"description":"Story Background\nThe daughter of a nightclub owner ask you for help to oppose their competitor. You will sneak into the nightclub and spray the dancing girls inside.\nGameplay\nThis game adopt first-person perspective. Control the role movement and spray from the proper angle. Spray the girls'clothes wet completely, and you will complete the task.\nFeatures\nThe unique first-person spray game\nSweet, Sexy Girl's hot dance\nWet body temptation","imageUrl":"https://media.rawg.io/media/screenshots/4f7/4f7eaa5ffdead7650a549cdc5432cf42.jpg","releaseYear":2019,"developer":"Wet Girl","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":54379,"name":"Diddy Kong Racing","genre":"Racing","price":0.0,"description":"Diddy Kong Racing is a racing video game developed and published by Rare for the Nintendo 64. It was released on 21 November 1997 in Japan and Europe and 24 November 1997 in North America. The game is set in \"Timber's Island\" and revolves around Diddy Kong and his friends' attempt to defeat the intergalactic pig-wizard antagonist, Wizpig, through winning a series of races. The player can take control of any of the featured characters throughout the game. Diddy Kong Racing features five worlds with four racetracks each, and the ability to drive a car, hovercraft, or pilot an aeroplane.\nDevelopment of the game began after the release of Killer Instinct 2, and was intended to be a real-time strategy game known as Wild Cartoon Kingdom during early stages. As time progressed, the game shifted from a Walt Disney World-influenced racing game to a unique title named Pro-Am 64, in which Nintendo had no involvement with. Due to the delays of Banjo-Kazooie, Rare felt that they needed a stronger intellectual property to attract a wider audience for a game scheduled to release before Christmas 1997, thus making the decision to revolve a game around the character of Diddy Kong.\nDiddy Kong Racing received critical acclaim upon release. The graphics, audio and gameplay were the most praised aspects of the game, however minor criticism was directed at its repetitiveness. The game has sold 4.8 million copies since release and stands as the Nintendo 64's eighth best-selling game. A cancelled sequel, Donkey Kong Racing, was in development for the GameCube, however it was abandoned after Microsoft's purchase of Rare for £375 million in 2002. An enhanced remake for the Nintendo DS titled Diddy Kong Racing DS was released worldwide in 2007.","imageUrl":"https://media.rawg.io/media/screenshots/c06/c0604dd30811b9691c17f6c6398d9489.jpg","releaseYear":1997,"developer":"Rare","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":51164,"name":"Beavers Be Dammed","genre":"Simulation","price":0.0,"description":"Do you like beavers? Do you enjoy hijacking timber from a sawmill owned by an evil lumberjack? Do you love accidentally pushing your friends into fiery pits?\nHave we got a game for you – Beavers Be Dammed!\nBeavers Be Dammed is being actively developed by a team of six students. We need your feedback to make Beavers Be Dammed the great game we want it to be for the players. Get in touch with us via the community hub, social media or e-mail to tell us what you think and we *will* get back to you!\nIn Beavers Be Dammed your objective is to steal wood from sawmills before the time runs out. To bea-very specific, you and a beaver buddy gnaw your way into the mill, locate the timber and maneuver those heavy logs towards the drop-off point. BEAWARE! You will be dodging sharp saw blades, avoid being cooked by feisty flamethrowers and more hazards in this crazy humorous party game experience.\nPlease note: there is no \"single player\" version of this game, Beavers Be Dammed is specifically designed to be enjoyed by two players locally.\nReal couch co-op\nBeavers Be Dammed offers a unique local multiplayer co-op experience because of the way you have to interact with the other player. Teamwork is crucial especially while dodging dangerous hazards under time pressure.\nEasy controls, hard to master\nWith full controller support, the controls in Beaver Be Dammed are easy to pick up but hard to master as you progress.","imageUrl":"https://media.rawg.io/media/screenshots/377/3776ff9c99d477890e3330d260276fd7.jpg","releaseYear":-1,"developer":"Wallflower Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":45905,"name":"Poker World","genre":"Simulation","price":0.0,"description":"Become the World Poker Champion - play poker around the world in the most famous poker cities.\nPoker World is brought to you by the makers of Governor of Poker. In this great offline poker game, you're battling and bluffing your way through several continents and famous poker cities. Ever played poker in Macau? Or visited the majestic Monaco casino? Or went all in in the Bellagio in Las Vegas? This is your chance. And you'll play poker with only one goal: to become the best poker player in the world.\nIn Poker World, you start your first poker tournament in the United States. By winning tournaments you progress and build up your reputation as a poker player. You will be able to join bigger and more exciting poker tournaments, get better poker sponsor deals and buy cool items to show off your poker status. And don’t be surprised if you get challenged by the best players in the world. You'll play heads-up poker against these World Top players and climb your way to the top.\nTRY POKER WORLD - SINGLE PLAYER POKER FOR FREE, SHOW OFF YOUR SKILLS AND BECOME THE WORLD’S BEST TEXAS HOLD'EM POKER PLAYER IN THIS GREAT OFFLINE POKER ADVENTURE!\nGreat game features:\n- MORE THAN 30 HOURS of Texas Hold'em Poker play;\nOVER 60 POKER CITIES in the world where you can participate in challenging poker tournaments. Every tournament varies in buy-in, number of players and poker winnings;\n- COLLECT STATUS SYMBOLS to build up your reputation in the poker scene and get access to certain tournaments;\n- SIGN SPONSORSHIPS to earn more chips and tickets for special tournaments;\n- WORLD TOP 10: beat all World Top players and win tickets for special tournaments;\n- PLAY ANYTIME, ANYWHERE: Poker offline, no internet connection required:\nThere is no internet connection required to play this great game. And one other big advantage: you don't have to wait for real world players like you do in live multiplayer poker. Slick, fast gameplay!\n- THE BEST AND MOST FUN POKER AI IN THE WORLD\nThis poker engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players. Refine your card tactics to match the style of your opponents! The offline players will play better in each new city and poker tournament!\n- BIG FREE WELCOME PACKAGE: 20,000 free poker chips;\n- MORE FREE CHIPS: Collect FREE chips every day with your daily bonus;\n- EARN MORE CHIPS: Watch videos and earn free bonus poker chips in this poker paradise;\n- GREAT HD GRAPHICS: The poker game is beautifully designed and includes HD poker graphics for a great poker experience.\nMillions of poker players have already enjoyed our Governor of Poker games.\nPlay this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker World NOW.","imageUrl":"https://media.rawg.io/media/screenshots/c53/c533c0a69d723dce3f1fdf3bad7be4d3.jpg","releaseYear":2017,"developer":"YoudaGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":30426,"name":"Unreal","genre":"Action","price":0.0,"description":"Your prison ship has crash-landed on the fastest, sleekest, most dangerous 3D world ever created. Look around, crystal clear water shimmers, shadows dance and shift, alien architecture fades into the horizon. Discover the secret of this mysterious planet and find out what caused a peaceful race to be enslaved by vicious merciless aggressors.\r\n\r\nOver 47 eye-popping single player missions.\r\n\r\n20 multiplayer levels with 5 different game types.\r\n\r\nRuthlessly intelligent enemies, each with unique personalities.\r\n\r\nAn arsenal of over 13 deadly weapons...all guaranteed giblet action.","imageUrl":"https://media.rawg.io/media/screenshots/d07/d0704592263d3911d215cd5564258634.jpg","releaseYear":1998,"developer":"Digital Extremes","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":27284,"name":"Mario & Luigi: Dream Team","genre":"Adventure","price":0.0,"description":"Mario and Luigi embark on the adventure of their dreams in a hilarious\naction RPG that combines the resort world of Pi'illo Island with the\nwild landscapes of Luigi's imagination, where anything can happen. Meet\na host of hilarious characters as you strive to rescue Princess Peach\nand help Prince Dreambert free his petrified Pi'illo people from the\nbat-king Antasma's curse.\n\nFeatures:\n\nSpawn hundreds of Luigis that mold into different forms like bouncy\ntowers, wrecking balls and giant hammers for special attacks or to\npass obstacles.\n\nPoke, tickle and move a sleeping Luigi on the lower touch screen to\nalter the dream world on the upper screen.\n\nMaster two worlds by switching between controlling both brothers when\nbattling in the real world and controlling Mario and an army of Luigis\nin dream-world battles.\n\nWith the Nintendo 3DS system turned sideways like a book, experience\nlarger-than-life Giant Battles with a gargantuan-size Luigi on one\nscreen and the enemy on the other screen.\n\nFind new items and gear to customize Mario & Luigi to fit your play\nstyle.\n\nTo help players through the adventure, the game offers various support\nfeatures, like a Hint System that offers tips on surviving a\nparticular engagement, or an Easy Mode to make a particular battle\neasier.","imageUrl":"https://media.rawg.io/media/screenshots/aab/aab0f8e6eacd762fbd7dc18c9de65765.jpg","releaseYear":2013,"developer":"Good-Feel","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":21757,"name":"Cuban Missile Crisis: Ice Crusade","genre":"Strategy","price":0.0,"description":"The year is 1967. The Cuban Missile Crisis that led to World War III continues. Use of nuclear weapons resulted in global cooling which changed history and aggravated the struggle for survival. Inspired by the takeover of Europe and Africa the Soviet government decides to start an uprecedented military operation called Ice Crusade. Soviet expeditionary forces march over the Arctic and attack unguarded Amerian cities and towns. Deserted areas of Mexico and icy American megapolises become the new battle-grounds.Features\nCuban Missile Crisis: Ice Crusade is the follow-up (stand-alone) to the RTS Cuban Missile Crisis which shows a new span of the military confrontation in alternative history.\nTurn-based tactical mode and a real-time strategy in one game.\nNew battle-grounds: southern part of the USA and northern Mexico.\n2 new campaings – USSR and USA. 10 scenrios and over 25 strategic missions.\n22 new military units including T-60, Hunter, Chieftain, Grand MLRD, Akatsia self-propelled gun.\n2 new super units – Convair-49 and Tyulpan 240mm self-propelled mortar.","imageUrl":"https://media.rawg.io/media/screenshots/c2f/c2f4510a5df6241bf50b0013e3cdbf6a.jpg","releaseYear":2015,"developer":"G5 Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21744,"name":"BANZAI PECAN: The Last Hope For the Young Century","genre":"Action","price":0.0,"description":"In the not-so-far year of 20XX, demonic revolution has begun.\nWhen her boyfriend gets kidnapped by the queen of a succubus force, Pecan’s adventure for love, justice and divine punishment begins! She transforms into the Buxom and Brave Banzai Pecan, with the strength of ten-thousand men and the power of a Goddess hell-bent on Justice! She will stop at nothing until she regains her love and justice! Bask in the glory of the old-school age of arcade-hard action! Battle 'til you drop!\nThe Legend of the \"Young Century\" Savior is born! REGAIN JUSTICE, PECAN!\n- IF IT MOVES, BEAT IT SENSELESS! Time your Strikes and throw out a arsenal of hand-to-hand combat with burning frenzy!\n- WHEN IN DOUBT, DODGE, AND THEN COUNTER! Use the Dodge function to flow your evasive moments, waiting to counter!\n- FEEL THE FIRE IN YOUR BODY AND UNLEASH DIVINE RETRIBUTION! When your rage burns in your body, unleash your Banzai Shinken moves to obliterate all that stand in your way!\n- ADD INJURY TO INSULT! Dazed enemies? FINISH THEM OFF IN STYLE!","imageUrl":"https://media.rawg.io/media/screenshots/24b/24b106e8ed9b82bff2f39954a2af9e05.jpg","releaseYear":2015,"developer":"SERIOUS*IMPACT WORKS","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21467,"name":"Arena Wars 2","genre":"Action","price":0.0,"description":"Arena Wars 2 is the sequel of the award-winning Arena Wars series and combines revolutionary RTS fights with RPG elements. Join the Battlefield of the future and prove your skills in fast paced multiplayer matches as well as against the advanced AI. Stunning maps, highly detailed units, powerful upgrades and skills as well as a best balanced gameplay offer intensive fights in a spectacular Sci-Fi scenario. Thanks to an easy accessibility and different AI levels, Arena Wars 2 is the perfect RTS game for all kind of gamers.Key FeaturesGameplay balanced in perfection – award winning mix of RTS and “Capture the Flag”\nFast paced matches on challenging maps\nState of the Art graphics  thanks to the powerful Delta Engine\nFantastic Units equipped with modern Weapon systems and spectacular skills\nOutstanding & non-cheating AI available in 5 different difficulty levels will challenge every player\nUnit-Upgrades, Power-Ups, and Items delivers countless possibilities for the “BEST STRATEGY”\nComprehensive Replay-Function enables to follow or to save thrilling combats in order to share the spectacular moments with the entire community\nDiverse Game modes – Singleplayer, Training, Multiplayer/Coop (1 vs 1/2 vs 2)\nVarious achievements available across the battlefields","imageUrl":"https://media.rawg.io/media/screenshots/86f/86f94f5d87d32a3d8ed79c0e433e4102.jpg","releaseYear":2012,"developer":"exDream","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21412,"name":"Metal Dead","genre":"Adventure","price":0.0,"description":"Metal Dead is a hilarious comedy/horror point and click adventure filled with laughs, blood, insanity, and of course... hordes of the undead.\nThis twisted tale centers on two metal-heads in the midst of a zombie invasion. After crashing their car in front of a medical research facility, they become trapped and are forced to use their wits to puzzle their way to freedom. Along the way, they must deal with a cast of characters who range from mildly deranged to completely insane.\nNominated by Adventure Gamers for 'Best Writing - Comedy' and 'Best Independent Adventure Game'. Also named one of the best Independent Adventure Games of the year by {LINK REMOVED}IndieGames.com!","imageUrl":"https://media.rawg.io/media/screenshots/fe7/fe7d9b51a865ba32c4f7883a02495d1d.jpg","releaseYear":2014,"developer":"Walk Thru Walls Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21370,"name":"Clans","genre":"Action","price":0.0,"description":"Your goal is to confront and destroy the Demon and locate the lost\nCrown of Peace. You will roam your once-beautiful land, routing out\nthe Demon's hateful minions, solving the mysteries of the fortress,\nand moving ever closer to your final encounter with the Demon. Summon\nyour courage and raise your sword for a fight to the death.\nFeatures:\n7 Levels: At the Gates; Underdark, a cavern realm of molten lava;\nChambers of Torment, the dungeons of the fortress; The Commoners Quarters;\nGarden of Eternity, the fortress courtyard; The King's Quarters; The Dragon's Den\nWage war with swords, axes, magic, and explosive weaponry through nine quests, seven\nlevels and five sublevels of the ultimate hack-and-slash action.\nFight for your clan and your world as one of four unique characters each possessing\ndistinct skills and abilities.\nCasts spells, unravel puzzles, interact with extraordinary characters and destroy evil incarnate.\nWhen you launch Clans, you will see a window pop up:\n\"Please insert the CLANS CD! Hit OK when done, or Cancel if you don't want any music.\"\nThis is an olde school Diablo type game, back in the days when games were run with the CD inserted. The interesting feature of this particular game is that the\ncontents of the original CD contained only the music for the game. What this means is that you can put ANY music CD into your CD player and the game will play it! If you don’t want to have music playing, simply hit ‘Cancel’ and the game will launch. Have fun!\nThe original CD audio has been added to the game files. If you want to hear the original soundtrack, you will have to navigate to your Steam directory where the game files for Clans reside. You will find a folder called \"Clans music\", and the audio files are in there. Then you will have to burn an audio CD and put into your CD drive.","imageUrl":"https://media.rawg.io/media/screenshots/ff0/ff02ea7bcb3c46803a4baf06749981d7.jpg","releaseYear":2014,"developer":"AppTout","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":20534,"name":"Colortone","genre":"Adventure","price":0.0,"description":"Special Offer\nhttps://store.steampowered.com/app/1107370/Demoniaca_Everlasting_Night/\nAbout the Game\nYou’ve been caught into trap and now you must get out of it. You don’t have any super capacity with exception to your own brain. You can only pass the room with the help of your brain, because you will have to solve the puzzle in order to open an exit. And remember - the puzzles get ever more complicated in the course of a game.Game features:Brain upgrade at every level\nUnusual puzzles\nTrade maps","imageUrl":"https://media.rawg.io/media/screenshots/d4e/d4e336fef05ddb9cd3bb052e61ee0727.jpg","releaseYear":2015,"developer":"Kirill Kupryakhin","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20146,"name":"Zoombinis","genre":"Adventure","price":0.0,"description":"Play Zoombinis and guide the little blue creatures through fun and increasingly challenging puzzles on their way to a new home.\nZoombinis is a re-creation of the classic, award-winning 1990's puzzle game Logical Journey of the Zoombinis. The small blue creatures, each with distinct personalities and appearances, are escaping imprisonment by the evil Bloats who have taken over the Zoombinis' home. Players take on the role of guide and help the Zoombinis reach the safety of Zoombiniville.\nUse logic, analyze data, spot patterns and hone problem solving skills. Players face a series of increasingly difficult challenges that stand between the Zoombinis and freedom. Twelve perilous puzzles each with 4 levels of increasing difficulty, a great story, and many fun and memorable characters make for an engaging and challenging experience.\nWe challenge you to get all the Zoombinis to safety!\nThe Challenges\nAllergic Cliffs\nStone Cold Caves\nPizza Pass\nCaptain Cajun's Ferryboat\nTitanic Tattooed Toads\nStone Rise\nFleens\nHotel Dimensia\nMudball Wall\nLion's Lair\nBubbleWonder Abyss\nMirror Machine\nFeaturing\nBeautiful new backgrounds\nThe original voices for the Narrator, Stone Guards, Pizza Trolls, Captain Cajun, and the Innkeeper\nRestored music from version 1.0 of the original game\nImproved celebrations and achievements\nBONUS Original Game Soundtrack\nBONUS Digital Wallpapers\nBONUS Mobile Ringtones (Android/iPhone)\nBONUS Digital Poster","imageUrl":"https://media.rawg.io/media/screenshots/5c8/5c8e00f0a2a1df9fc0c1481f2a8ae947.jpg","releaseYear":2015,"developer":"TERC","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":19973,"name":"The Secret Order 3: Ancient Times","genre":"Adventure","price":0.0,"description":"Travel back in time to find the mythical Kingdom of Aeronhart.  Prevent the chaotic artifacts from killing your father… and destroying the universe itself!\nThe Secret Order 3: Ancient Times continues the thrilling, story-driven series with a new, suspenseful narrative that successfully blends the fantasy and detective noir genres.\nPlayers take control of Sarah Pennington, daughter of the Master of the Order of the Griffins, must once more face the dangerous power of the artifacts that she reclaimed during the events of the last game.\nThe scepter and mask have become unstable, threatening the life of Sarah's father and the safety of the entire world. The only way to prevent the very fabric of reality from unraveling is for Sarah to travel back in time to the mythical realm of Aeronhart, to find one King Amadon, who ordered the creation of the artifacts. Amadon may be the only one who knows how to destroy these chaotic objects. Sarah must once again embark on an epic quest aboard the Royal Griffin, exploring  breathtaking locations from ancient times, solving difficult riddles, facing adversaries, and discovering the deepest secrets of the of the Order along the way.\nWill the young disciple prove herself up to the task? Will she manage to solve the puzzles, distinguish enemies from allies, and reach the heart of the ancient kingdom?\nCan Sarah stop the artifacts before they kill her father?\nFeaturesEmbark on a grand journey against all odds to save your father!\n60 minigames and hidden object puzzles waiting to be solved!\nExplore 57 stunning locations!\nUnlock all 27 challenging achievements!\nContinue the story in an extra adventure!","imageUrl":"https://media.rawg.io/media/screenshots/309/309aec87372fb85d7e6c9bbf296aa8d0.jpg","releaseYear":2016,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":19763,"name":"Legend of Numbers","genre":"Strategy","price":0.0,"description":"In this numbers world, use simple match and merge functions to navigate the numbers and your own wisdom to create a legend for them!  Come explore the hundreds of fun, exciting levels just waiting to be played!\nFeatures include:\n● Easy and fun to play match-3 game that is all new and one of a kind\n● Ability to solve different problems in a way that inspires your wisdom and imagination\n● Magical boosters that help you overcome challenging levels\n● Hundreds of levels to begin playing now with more levels added on a regular basis","imageUrl":"https://media.rawg.io/media/screenshots/16e/16ed6c984538ada6caccbd096db1d8c6.jpg","releaseYear":2016,"developer":"YFC games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19069,"name":"Sword of the Samurai","genre":"Action","price":0.0,"description":"Enter Japan in the age of warring states. At the center of this role-playing, action-adventure simulation of combat, statesmanship and intrigue, you are a samurai warrior struggling for honor. More important than life itself, honor is crucial to achieving your ultimate goal: unifying feudal Japan under your noble rule.\nGame Features:\nComputer-controlled opponents make decisions based on your actions - and on the actions of other rival characters.\nFurious melee action against multiple warriors takes place in castles, villages and rice paddies.\nVindicate yourself in duels against rivals who would like nothing better then to diminish your Honor.\nFeel the drama and immediacy of real-time battles involving infantry, cavalry and muskets on battlefields that vary with every conflict.\nUntie all 48 warring provinces in common allegiance to you, and earn the title of shogun, military ruler of all Japan.\nFun and Easy to control!\nFour skill levels, plus other starting options\nAn ingenious system of menus, animation and text windows - pioneered by MicroProse in Pirates! - conveys the detail of text with the fun of graphics and animation.\nAuthentic Japanese music and graphics powerfully evoke the mood of Sixteenth century Japan.","imageUrl":"https://media.rawg.io/media/screenshots/648/648a0c1dd5fbc729d0007ff47346a996_CdMKibm.jpg","releaseYear":1989,"developer":"MicroProse Software","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]