[{"id":19194,"name":"Ship Simulator Extremes","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/558/5585c4ba030cc8b1bec7004dcd7da68d.jpg","description":"Just UpdatedAhoy! Ship Simulator Extremes is celebrating its 2nd anniversary! To celebrate, all players will now receive the Customs vessel DLC for free!\nIn the Customs vessel DLC, users get the chance to experience the day-to-day activities of a maritime customs officer. Responsible for upholding the law and making sure there is no smuggling going on in the harbor, you embark on two exciting missions piloting a brand new customs vessel called “Zilvermeeuw”. Inspect vessels for illegal cargo and apprehend & chase vessels that want  to avoid inspection.\nAbout the GameVSTEP and Paradox are proud to announce the next installment of the acclaimed Ship Simulator series. With over 550K copies sold, the series returns to take you into the most extreme conditions on earth…\nEver wonder how it feels to sail a half-million-ton supertanker through the perfect storm? To take on illegal whale hunters in the Antarctic?  Or to feel the rush of being part of the Coast Guard as you evacuate a cruise liner in distress? Ship Simulator Extremes has players take on exciting missions all over the world as they pilot an impressive array of vessels and live the stories of real ship captains. With missions based on actual events in realistic environments at locations all over the world, the new Ship Simulator game is sure to take you to extremes!\n\nKey Features:\nFrom the very hot to the very cold, sail to the most enchanted regions in the world. Explore the Antarctic or take in beautiful Bora Bora. Includes famous harbors and locations from around the world.\nWide range of vessels to captain, including hovercraft, Coast Guard interceptors, mammoth tankers, tugs, cruise liners, and many others.\nIncludes exciting storylines and missions from all over the world.\nSave the environment campaign: sail famous Greenpeace ships and take on ecological missions based on real events!\nRealistic water and weather system. Sail calm waters or take on the most extreme weather ever witnessed at sea.\nOnline multiplayer mode. Sail online with your friends.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"VStep","platforms":[{"id":0,"name":"PC"}]},{"id":17595,"name":"Pajama Sam: No Need to Hide When It's Dark Outside","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cba/cbacf036f4d93eecc45db7c83a90e3f7.jpg","description":"Sam is an ordinary kid who, with the help of his red cape, turns into \"superhero\" Pajama Sam. In No Need to Hide When It’s Dark Outside, Pajama Sam journeys into the land of darkness (his closet) to face his fears. Help Pajama Sam figure out who or what is behind the darkness and realize that there is no need to hide when it’s dark outside!\nGame Features:\nThink, listen, explore--fun learning encourages critical thinking, fosters listening and memory skills, and reinforces good social skills.\nCartoon-quality learning adventure where you choose where the characters go.\nExplore exciting locations and collect information to complete the adventure.\nThe adventure changes each time you play!\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":16884,"name":"Zafehouse: Diaries","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e85/e8500290f4048f50507e84e8e65904cf_EI7R2iG.jpg","description":"Stuck in a remote, abandoned town, you must lead five survivors with conflicting motivations, fragile relationships and fiery prejudices to safety from the roving undead. A sophisticated engine generates new survivors, towns and content so every adventure is a different experience, and you can use built-in editors to add yourself and others to the game.Features Deal with the volatile relationships of your survivors by strategically assigning them to tasks, siding with them on difficult decisions or seeding rumours about their past\nThe undead aren't the only threat - negotiate, bargain, trade with or fight merciless lynch mobs, zombie hunters and bitten survivors\nExperience a fresh story each time you play as the procedural engine crafts new survivors, towns and content\nBuilt-in editors make it easy to add yourself and your friends to the game. Create your own survival horror story in your hometown\nUnique diary interface records each action, choice and disaster. Save your heroic story and share it with others\nZafehouse: Diaries is a fresh take on the zombie / survival horror genre. If you're sick of mindless shooters or generic-looking top down affairs that just don't get what the zombie genre is about, this is the game for you.About Screwfly StudiosWe're a two-man developer based in Australia, dedicated to creating deep, innovative strategy games for PC. Zafehouse: Diaries is Screwfly's debut title and the spiritual successor to the highly-regarded Zafehouse.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Screwfly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16707,"name":"Cinders","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2df/2df5092c1fb16152125cd2fcb2db8df3.jpg","description":"Cinders is a mature take on a classic fairytale with a heavy emphasis on player choices and role playing.\nCinders is a witty young woman living with an overbearing stepmother and her two daughters, as if she was reenacting a certain well-known fairytale. But unlike its protagonist, Cinders is not afraid of taking fate into her own hands. Even if it means breaking the rules…\nThe game takes a look at four women and what made them who they are. It’s a story about balancing freedom and dreams with circumstance and harsh reality. About growing up and finding out the true meaning of independence. Distancing itself from the judgmental simplicity of the original, Cinders tries to explore the more complex nature of oppression, responsibility and innocence.\nWith 120 decision points, over 300 options to choose from, and multiple endings, Cinders gives you total control over the main character’s personality and how her story unfolds.LinksOfficial website\nTwitter\nFacebook\nTumblr","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Crunching Koalas","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15297,"name":"Lucy -The Eternity She Wished For-","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8a/d8a00ad260e675c454b0604080d8c5ae.jpg","description":"Switching the languageIf you want to change language settings, you can do it by going to the STEAM Library, right clicking on the game and then selecting Properties. Under Properties, click on Language tab, and you'll be able to choose the language you like.\n*Please note that if you load the previous save files after switching to other languages, in-game texts may not be displayed properly, due to different font usage. Therefore, we highly recommend that you start a new game if language setting has been changed from STEAM Properties.\nAbout the GameIn the near future, androids have become the way of the norm. Emotionless husks of metal have become a part of human society, much to the dismay of the boy. The robot he found at the dumpsite though, this one was different. It laughed, it cried, it smiled, it has dreams, just like a human…\nLucy -The Eternity She Wished For- is a Visual Novel, about a boy and an android. You play as the boy, who faces decisions and moral dilemmas in this near-future world. This is a story that has touched many hearts and continues to have a strong impact on those who partake in this compelling journey.\nAbout Developers:\nProject Director / Scenario : S.R\nCharacter CG / UI Design : Defender\nIf you have any question or request regarding our product, please contact at mvizlab@gmail.com :)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Modern Visual Arts Laboratory","platforms":[{"id":0,"name":"PC"}]},{"id":13238,"name":"Botology","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/567/5674a7cd143bc5d2192a6bf8e9e2903b.jpg","description":"A company is currently in development of robots for the new generation - Botology, conduct tests for a new system for the remote control of robots. The purpose of the company is to help future potential buyers explore the remote space systems. The consciousness of the robot's operation is connected with a mechanical prototype of sensory organs. However, risky tests can and will lead to difficult, unforseen consequences.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Black Lime Studio","platforms":[{"id":0,"name":"PC"}]},{"id":12220,"name":"ePic Character Generator","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c37/c375fb8953df76d633de94fb433235b5.jpg","description":"The program is an excellent tool to anyone who wants to create realistic character avatars in no time. You can simply choose what items to display on your character, save as an image on a preset or transparent background and use it for anything you would like to. You don't have to worry about lighting or finding the right camera angles, as everything has been prerendered and postworked for you, so creating characters are really just a matter of clicking some buttons! Using the Portrait package you can even create hand-drawn style images very easily.\nThe software is mainly used by role-players to illustrate their player and non-player characters, but don't have the resources to create or buy many unique characters that fit their needs. The option to save the images as tokens and cards simultaneously even reduces the work needed to use the pictures in a session moments after they've been created. The characters can be saved and loaded using our custom file format, which enables an easy way to manage character progression, as changing little details are quick and convenient.\nThe generated images can be used in commercial products as well. You may find card games, board games and books illustrated with the images created by ePic Character Generator.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Overhead Games","platforms":[{"id":0,"name":"PC"}]},{"id":11948,"name":"Narcissu 10th Anniversary Anthology Project","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95a/95aa1fcb575bbd530d814843a419c209.jpg","description":"\"Life is like a waiting room, except people don't leave in the order they enter.\"\nSo when it is time to leave, where will it be? And will you be able to smile in the end?\nNarcissu is a thought provoking visual novel series about terminal illness, living, dying, and the relationship between those leaving and those left behind. There are no miracles, no heroes, no villains in this story. Just life and the characters finding their own ways of facing death in an indifferent, relentless, ever-impartial reality.\nPraised by fans for its moving story and high production quality, the original games have been download over a million times and spawned a manga and light novel, and has been localized in several languages across the world. This anthology finally brings the games that were never released outside of Japan in any form to the world for eager fans, as well as updating artwork, voice work, and a brand new written chapter exclusive to this anthology: \"Sumire\".\nFurther breaking new grounds, this anthology builds on the massively popular music which has captured the hearts of thousands of Narcissu fans by adding 2 video game legends to the musical roster: Chris Huelsbeck of Turrican fame, and Hiroki Kikuta of Secret of Mana fame.\nThe story is told in 5 games and produced through a successful Kickstarter campaign.  The original games (Narcissu 1st&2nd) of the series are available for free on Steam. This anthology series will contain an additional 4 scenarios in the series.\nThe core of this anthology are the following included games:\nNarcissu - The story that started it all. Two terminally ill patients meet on the 7th floor hospice. Neither like the 7th floor, nor their own homes. And so they set off on a journey.\nNarcissu 2 - A prequel to the original, telling the story of a patient named Himeko through Setsumi's eyes.\nNarcissu 2 - Himeko's Epilogue, details the final moments of Himeko's story.\nThese stand-alone chapters are available as DLC:\n] Narcissu: A Little Iris - A side story set in medieval Europe, exploring what it means to desire to live, or die.\nNarcissu: Zero - The origin story of the 7th floor hospice and its rules.\nNarcissu: Sumire - An entirely new chapter in the series, it tells the tale of two girls who cross paths: one dying and the other desiring death, both filled with profound regrets about their respective lives.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"stage-nana","platforms":[{"id":0,"name":"PC"}]},{"id":10299,"name":"Steel Division: Normandy 44","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/363/3633e867ff59c664079387d0b02328e4.jpg","description":"Deluxe Edition\nThe Deluxe Edition of Steel Division: Normandy 44 comes with the following extras:Art Book: A detailed look at the art and making of Steel Division: Normandy 44Tactical Guide: A digital book getting you up to speed with the terrain and tactics of the game.Six Exclusive in-game aces: Historical personalities you can deploy on the battlefield Ernst Barkmann (Germany, Panther A tank)\nJoseph Priller (Germany, Bf109A fighter plane)\nDick Winters (The USA, Paratrooper Battalion)\nWilfred Harris (The UK, Sherman Firefly tank)\nLeo Major (Canada, sniper scout)\nKurt Knispel (Germany, Tiger II)Battle Log:Major maps of the game and how to fight themDeluxe avatar and icon for the Paradox forumsUnique ringtones and text message soundsWallpapers: Artwork from Steel Division you can use to decorate your computer desktopStreaming Overlays: Steel Division themed overlays for those who stream on Twitch or YouTube.\nAbout the GameSteel Division: Normandy 44 is a Tactical Real-Time Strategy (RTS) game, developed by Eugen Systems, the creators of titles like Wargame and R.U.S.E. This new game puts players in command of detailed, historically accurate tanks, troops, and vehicles at the height of World War II.  Players can measure their tactical skills against several opponents in big multiplayer battles or against enemies in a challenging single-player campaign. Steel Division: Normandy 44  allows players to take control over legendary military divisions from six different countries, such as the American 101st Airborne, the German armored 21st Panzer or the 3rd Canadian Division, during the invasion of Normandy in 1944.\nMain Features:Command Over 400 Historically Accurate Units: Whether fighting for control in intense multiplayer battles with up to 10-vs-10 players going head-to-head, playing alone or working with friends in ranked matches, players will need to coordinate their selection of historically accurate infantry, tanks, aircraft, and support vehicles to counter enemy units in this Tactical RTS game.Real-world Tactics: Battles rage over three distinct phases, where different units unlock over time, mimicking the movements of real-world armies and adding variety to the ever-changing theatre of war. A dynamic front line illustrates the ebb and flow of the conflict.  Pin down your opponent's infantry to gain the advantage and force a retreat, or push through with a perfectly executed plan.Real-world Setting:Using the latest version of Eugen’s IRISZOOM engine, players can smoothly zoom from a tactical aerial view all the way down to a single unit, and see 400 different real-world vehicles and units designed with careful historical detail and accuracy. Maps are designed based on actual aerial reconnaissance photos of Normandy in 1944, requiring real-world tactics and strategies to cover and control.Outplan, Outsmart, Outgun:From battlegroup customization to troop positioning and maneuvering, winning battles requires cunning and strategy, not just raw firepower. Each unit lost presents a growing tactical disadvantage, and players will need to fight to gain -- and keep -- the upper hand.\nFrom commanding historically accurate infantry, tanks, and vehicles, to troop positioning and real-time engagement with the enemy, players will need to be clever and resourceful in order to win. Every unit counts as the battle presses on, and raw firepower alone will not be enough to claim victory. Whether viewing the entire battle from an aerial perspective, or following a single tank into a firefight, players will need to cleverly manage the dynamic front line in order to execute ambushes and advances.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Eugen Systems","platforms":[{"id":0,"name":"PC"}]},{"id":4461,"name":"Little Deviants","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c1/7c1acb2f3f27b0a5cea47657d436f8ea.jpg","description":"Touch, Tap & Tilt to save Little Deviants™ from the Evil Botz.\nJoin the Little Deviants™ in a series of madcap adventures that allow you to have fun discovering and experimenting with the new PS Vita functions - including rear touch, front touch, six-axis motion senors, rear camera, and microphone.\n- Augmented Reality: Turn your world into an augmented reality shooting gallery\n- Touchscreen / Rear Touch Pad: Make full use of the PS Vita system including front and rear multi-touch\n- Microphone: Sing with the Little Deviants™ for top score\n- Motion Sensor: Move and tilt your PS Vita system to guide the Little Deviants™\n© 2012 Sony Computer Entertainment Europe.\"Little Deviants\" is a trademark of Sony Computer Entertainment America LLC. Developed by Bigbig Studios.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item.One-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":2152,"name":"Riptide GP: Renegade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/293/2930de17e9983febe2df673c62524a37.jpeg","description":"Experience the future of illicit hydrojet racing, where armored riders kick out death-defying stunts over massive waterfalls, dodge cops through public waterways, and boost at breakneck speeds across surging waves.\nYou are a hydrojet rider, framed and cast out from the Riptide GP league, forced to race illegally through city waterways, flooded ruins, and churning factory machinery in an effort to reclaim your reputation and your title.  Play through the single player career to unlock new vehicles, playable characters, and customization features as you take down bosses and build your crew.\nThen, take your skills online for the ultimate test as you battle opponents around the world in 8-player online matches.  Challenge your friends for leaderboard supremacy in the ghost-racing challenge mode. You can even play locally in split screen races with up to 4 players!\nRiptide GP: Renegade is the first game in the acclaimed Riptide GP series to be redesigned from the ground up specifically for modern desktop PC and console hardware.  Featuring thrill-ride race tracks packed with shortcuts, secrets, and interactive obstacles, Riptide GP: Renegade is the action-arcade water racer for a new generation.\nFEATURES\n• Thrill-Ride Environments - Blast across floating factory platforms, brave hurricane-strength waves, and infiltrate a military base in the midst of battle.  Every race track is packed with interactive set pieces, dynamic obstacles and secret shortcuts.\n• Deep Career Mode - Battle your way through a variety of races and boss fights to reach the top of the underground hydro jet racing circuit.  Earn cash and experience to upgrade and customize your hydro jet, unlock new stunts, and increase your rider's performance.\n• Online Multiplayer - Compete online in thrilling 8 player matchups against the best players from around the world.\n• Split Screen Multiplayer - Challenge your friends in local split-screen multiplayer championships.  Play with up to 4 players on a single machine!  (Additional gamepads controllers required))\n• Challenge Mode - Take command of the leaderboards and test your skills against ghost recordings of your friends' best performances.\n• Transforming Vehicles - Collect and upgrade a garage full of blisteringly fast hydro jets that transform while you ride them. Win money to upgrade and customize each one.\n• State of the Art Water Racing - Riptide GP: Renegade brings dynamic water racing to a new level of excitement with breathtaking water physics, splash-tastic spray effects, and more!   Every race is different because the surface you race on is always changing.\n• Full gamepad integration\n• Steam Complete - Compete with your friends on leaderboards, unlock challenging achievements, and keep your game going from device to device with cloud data syncing.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vector Unit","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":367125,"name":"Travellers Rest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfe/bfef585a0686a1296e33735d7d1b2360.jpg","description":"Travellers Rest is a tavern management game where you can brew your own beer, run a farm, and build relationships. You are an innkeeper, on a journey to transform a run-down tavern into a bustling social space. Based in a cheerful fantasy setting, Travellers Rest is home to people to meet, places to explore, and lost magic. Along your journey you’ll discover new things to brew, farm, cook, and build to create your perfect fantasy tavern.\nCrafting and progressionBrew beers, distil spirits, and make wines. Create the perfect crisp larger or the wildest sour. Travellers Rest will allow you to discover and craft a whole array of food, drink, and items. Along this journey you'll gain experience to level-up and further customise your character. Spend your points in six technology trees relating to nature, building, cooking, brewing, socialising, and magic!\nTavernBuild and manage your own fantasy tavern! Fully customise it with furniture, cosmetics, decorations, and entertainment for your guests. Increase your tavern reputation over time to earn rewards and unlock more options to make your dream tavern.\nCustomers and communityEvery day will bring new customers to your tavern. Serve them drinks, food, and provide a room for travellers. Send budding adventurers on quests or spread rumours. Get to know your regulars and visit them in the nearby village. Meet the locals and become part of the community!\nFarming and explorationYour tavern will be surrounded a whole world to explore! Farm and forage for your crafting ingredients and trade with local merchants. Explore the world for rare items to create unique brews and food.\nManagementPlan and manage your tavern to meet customer demands. Prepare for the weekend rush or a big visitor, such as a famous bard or royalty. Create specific food and drink for the current season or the latest craze.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Isolated Games","platforms":[{"id":0,"name":"PC"}]},{"id":359354,"name":"The Almost Gone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a5/8a5779acb49ef1bb00616129afe10c0a.jpg","description":"Trapped between life and death, frightened and alone, you must unravel the dark and poignant truth that led to your fate. Dig beneath the beautifully rendered façades and interiors of an ordinary suburban lifestyle to discover a breathtaking tale crafted by an award-winning author.\nPiece together this compelling story by revealing objects and memories, decipher these clues and reveal more of the story and its dark secrets. From your own home to eerily deserted streets, beautiful apartment blocks to sinister abandoned hospitals, you must search forensically for clues. Each new reveal takes you closer to the life you once had, to the people and places that surrounded you, in your seemingly carefree childhood. Why are you here? Why are you trapped? Will you ever get home?\nExperience a stunningly immersive story written by award-winning author Joost Vandecasteele\nExplore every nook and cranny of each beautifully rendered diorama\nPlay through five compelling chapters, with each revealing more secrets and twists that will lead you to the truth\nFrom an unassuming sitting room, to a tent in a forest, from a police car in a tree to an abandoned hospital, a seemingly innocent suburbia is yours to discover","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Playdigious","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":290899,"name":"Into the Radius VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7da/7da9c0478861a2286e7e57dd5c6f2bc2.jpg","description":"Into the Radius is a single-player survival shooter for VR veterans. Stalk the Pechorsk Radius zone filled with surreal landscapes and dangerous anomalies. Use stealth, climbing or realistic firearms to explore, scavenge for loot and recover strange artifacts in an unforgiving dystopian environment.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"CM Games","platforms":[{"id":0,"name":"PC"}]},{"id":284018,"name":"Seek Girl","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df7/df72322748430b838b2862a00b4e8d18.jpg","description":"Introduction to the game\nThis is a \"collection game\" which unlocks \"collection\" girls by tapping cute little people who jump out of the hole. The unlocked girl will be sealed in a bottle and you can meet her again at any time. Every beautiful girl has her own unique movements and voice to make you have a more authentic experience!\nGame features\nLeisure Play + Girl Animation + Passionate Voice\nEvery girl has her own elf guardian in her heart. When you capture his elf, you can get her girl's heart.~","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"XCGame","platforms":[{"id":0,"name":"PC"}]},{"id":41294,"name":"Sins of a Dark Age","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3d/a3d7feb02b859bd7f04a1142db044087.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ironclad Games","platforms":[{"id":0,"name":"PC"}]},{"id":28979,"name":"Ace Combat 6: Fires of Liberation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bb8/bb8d7099b25e8dd8e43914f235655a28.jpg","description":"With over 10 million copies sold worldwide,  the ultimate flight action series soars onto  the Xbox 360!   Witness high definition graphics rendering  the world around you into super realistic war  zones, made possible only by next generation  processing power. Lead not only aerial combat  units but also naval and ground combat units  to victory.   Massive conflicts unfold on a “living battlefield”  integrated by the “Dynamic Operation System”  where up to six independent aerial, ground,  and naval battles can break out at once as  allies and enemies clash in real-time.   The long awaited Online-Mode has finally  arrived! Prove your supremacy on a global  scale in the intense Xbox Live multi-player online mode!  For the first time in the Ace Combat franchise, several modes  of online play with various rules are available,  including death match style missions,  team death matches and co-op games.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":22433,"name":"16 Bit Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/04a/04a01f5348a4f5a30b3225fb2ff7e3f9.jpg","description":"It's FREE!\nFight in turn-based multiplayer battles up to 9v9 with the old school graphics you've been missing!\nEnter battle as a Warrior, Mage, Rogue, or Healer of either gender, and use a card to transform into any of 16 characters, combining their stats and abilties with your class's!\nElemental properties for every character; collect gems that let you choose yours, and cast its magic!\nGain Charge during battle to do more damage, boost specific stats, and more-- or just save your turns for later and pummel an enemy all at once!\nA rockingly awesome soundtrack!\nJourney through eight intense Trials to gain cards and gems for use in the Arena!\nEnjoy the 2-player tactical-RPG-style Card Game-- a great additional game on its own, it lets you earn cards and gems too!\nIn the mood to just chat for a bit?  Hang out in the lobbies, the Card Game, or even the audience of the Arena!\nWins in large battles are recorded to the server and periodically posted, so people can see where you rank!\nUpdated just before the Steam release with new backgrounds and other improvements!\nPlay as a Champion (boss) and take on 9 enemies at once!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"16bitarena.com","platforms":[{"id":0,"name":"PC"}]},{"id":20601,"name":"Hitogata Happa","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/224/22476dd59df77791186caaf4cbc41336.jpg","description":"Shoot 'em up with the 3rd  game in the Gundemonium Collection series. Hitogata Happa is considered one of the hardest doujin style shooters ever! – Unlike the first two games, Hiitogata Happa is a vertical scrolling upward shooter, the action in this game is a visual mish-mash of weaponry that will give your senses a total overload. Threatened by an invading army who is terrorizing the land, Rosa enlisted the magic of a witch, Kreutzer – who has charmed her own army of magic dolls, each with extreme power and crazy weapons.  Use these dolls to take revenge on the invaders as you blast through six, intense stages. Choose from twelve playable characters (four unlockable), each with their own special abilities, and unlock secret game features.\nKey features:\t\t\t\t\t\t6 stages of vertical-scrolling bullet insanity\nSweet old-school retro anime-style art\n8 playable characters, and 4 unlockable characters\n2 unlockable special modes\n13 Steam achievements\nFull online leaderboards\nNew arranged soundtrack by Woofle\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Platine Dispositif","platforms":[{"id":0,"name":"PC"}]},{"id":20588,"name":"Genesis Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/768/768ecce1fb3e4e703d853170520f72e9.jpg","description":"Build your house of dream, create different things such as: blocks, interior, exterior, clothes, weapons, food and etc. Customize your character. Arrange your world and travel to beautiful locations with your friends. Explore dangerous dungeons but be careful. Master the farming of the game with a lot of types of plants. Sell produced items to other players or buy from them. You can play with your Facebook friends together and send them ingame telegrams.\nGenesis Online is waiting for you!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shumkov Dmitriy","platforms":[{"id":0,"name":"PC"}]},{"id":20434,"name":"Total Pro Golf 3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/741/741e1ee16cd03bc18150d56a6f37c43d.jpg","description":"Total Pro Golf 3 puts you in charge of your career looking to make it as a professional golfer on one of the world's most prestigious professional golf tours.\nEarn your tour card and play on one of six different tours, earn sponsorships, meet in-game achievements via \"Challenge Mode,\" play in major tournaments, chase the Wolverine Cup, and enter special annual team play events.\nIn addition to managing your golfer on the course it’s up to you to manage your golfer off the links. Schedule practice times with your coach, decide what events to participate in, and when to take a break from the grind of travel and tournament play. Choose your golfer’s equipment and other items that will affect how well you perform in events over the course of a season.\nTrack the history and in-depth statistics of your tour performance with a detailed almanac feature and view your trophies and awards over the course of your career. Play rounds on beautiful 2D courses where your strategic decisions make the difference between winning the tournament and missing the cut.FeaturesGolf career management simulation - manage your very first qualifying round to retirement off the senior tour.\nOne-Click or Tri-Click play options for playing out a round of golf.\nShot shaping options allow you to strategically work your way around the course.\nFast gameplay - play out rounds hole-by-hole or sim an entire round in seconds.\nWin event trophies, major tour events, and tour awards.\nSix international professional golf tours to move between your golf career.\nFull customization of golfers, tours and sponsors.\nRPG elements allow you to manage your golfer on and off the golf course.\nHire coaches to improve specific aspects of your game and a caddy that can assist you in strategy and reading greens.\nSign lucrative sponsorship deals with equipment, apparel, and shoe manufacturers.\nWeekly news reports to keep you up-to-date on golfers around all six tours.\nMassive almanac that details every bit of history for every golfer, course, and tour.\nIn-game player awards, rankings, and achievement challenges.\nManage your weekly schedule over a tour season - when you practice, what events to play in, when to take a break from the weekly grind of life on the tour.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wolverine Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18682,"name":"BoxesWithGuns","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de1/de18a92877523eb5f2a86fe940b46b2f.jpg","description":"BoxesWithGuns is a 2D neon vertex endless shooter game. Try to survive as long as possible by avoiding collisions with the enemies that spawn. One game equals the length of the background music track playing. Collect dollars and customize your spaceship by adding new boxes and weapons. Upgrade existing weapons to increase your chances of survival. For temporary boosts, power ups spawn randomly.\nBased on the current music playing in the background, the attached weapon systems get enabled or disabled. The blur and bloom effects and pixel destruction are influenced by the music as well.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Thomas S.","platforms":[{"id":0,"name":"PC"}]},{"id":18279,"name":"Puzzler World","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/378/3789605af52118062922b9bed34e4c30.jpg","description":"Puzzler World brings over 1200 puzzles of 8 popular puzzle types to your PC. Conceptis picture logic puzzle fans will be happy to know that in addition to Crossword, Wordsearch, Fitword, Sudoku, Codeword, Spot the Difference and Silhouette puzzles, Puzzler World also offers 83 Conceptis Link-a-Pix available in sizes of 10x10, 20x20 and 25x25.\nPuzzler World is split across two game modes: Quickplay, for a fast puzzle fix, and Challenge, for advance gaming where you can prove your puzzling prowess and tackle a wealth of puzzles and unlockable bonus games on offer.\nSuccessful players can win Hint Tokens to spend on tips and solutions as well as unlock exciting Bonus Games from six additional games to discover; Hangman, Chain Letters, Equate, Jigsaw, Picture Quiz and Missing Piece. The game also boasts a Handwriting Recognition feature which allows players to teach the game their own unique alphabet and handwriting style.\nKey Features:\nChallenge: Play for Bonus Games and Rewards, or beat your personal best time.\nFamily Favourites: Including Wordsearch, Crossword, Sudoku, Spot-the-Difference, Silhouette, Codeword, Fitword and Link-a-Pix\nQuick Play: An instant way to improve your puzzling skills.\nBonus Games: Unlock additional bonus games in Challenge mode including Hangman, Equate, Jigsaw, Picture Quiz, Chain Letters and Missing Piece.\nHandwriting Recognition: You can write in your own handwriting style which the game will learn to recognize.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ideas Pad","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"}]},{"id":17601,"name":"The Mysterious Cities of Gold","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7da/7da76af459d974d91f621e2b2aad6510.jpg","description":"Play Esteban, Zia and Tao through numerous tricky levels full of puzzles, traps and infiltration phases in a wide variety of diverse gorgeous settings. Explore every nook and cranny of China, and escape Zarès’ hostile men, searching for the local City of Gold.\nFaithful to the story-line and art style of the famous Mysterious Cities of Gold anime cartoon, Secret Paths lets you dig deep in this wonderful cross-media universe. You get to play with all the main characters, and each hero has his own set of qualities that you will need to use smartly when approaching the different challenges. Pick between them wisely - Their personality matters!Key featuresGorgeous graphics completely faithful and loyal to the original Mysterious Cities of Gold art style that we all love.Numerous tricky levels: Expand the Mysterious Cities of Gold cartoon universe by playing the levels that unlock for free at the same pace the episodes air on television.Beautiful settings: Explore various environments, from the deep asian forests, to the heart of the Forbidden City, to the mythic Chinese City of Gold. Collectibles: Unlock high-quality cinematic cut-scenes extracted straight from the Mysterious Cities of Gold cartoon and bunch of exclusive artworks and virtual items.Think before you act: Use the specific skills and attributes of the three friends to your advantage when facing the multiple traps, puzzles and hurdles thrown in your way. Infiltration: Escape arch-enemy Zarès and his men by untangling the riddled paths to discover the secret of the Mysterious Cities of Gold.\nMade by Fans for Fans: the developers behind the Mysterious Cities of Gold are true fans of the anime, who have grown up watching the first season of the cartoon in their childhood some 30 years ago!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Neko Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16994,"name":"Angvik","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/415/41540b10a92dcb2802216dc94f64d01e.jpg","description":"Angvik is a platform action game set in a joyful but unforgiving land. The castle has been taken over by a barbarian and no one else has the courage to confront him, so take up your father’s gear and set off on a wondrous journey! And you’re not alone: you’ll find many birds and items to aid you along the way, and you’ll encounter all sorts of creatures to fight as well. But watch your step! You have only one life, so if you die, you stay dead.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Alastair John Jack","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11318,"name":"theBlu","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29c/29cccc2e38596c58efb67f7526c506ba.jpg","description":"theBlu: is a deeply immersive VR series that allows audiences to experience the wonder and majesty of the ocean through different habitats and come face to face with some of the most awe inspiring species on the planet. The series, which is directed by Jake Rowell (Call of Duty, Final Fantasy, Superman Returns), has been designed as beautiful moments in passing or a collection of memories that powerfully tap into the vast potential of VR. The debut episode, featuring an incredible close encounter with an 80 foot whale, is already recognized as one the most iconic room scale VR experiences to date (a Sundance Film Festival 2016 selection).\nDive into more DLC experiences:\nReef Migration\nWitness the magnificence of an undersea migration on the edge of a coral reef.\nLuminous Abyss\nVenture into the deepest region of the ocean to discover the iridescent abyss.\nHammerhead Cove\nSun lit Caribbean waters welcome you to a realm where one creature reigns supreme.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wevr","platforms":[{"id":0,"name":"PC"}]},{"id":10633,"name":"Cold War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43f/43fbad9e5e2910a858a5ee04c4c7638f.jpg","description":"Steal weapons. Improvise gadgets. Evade capture. Uncover the conspiracy.The Story:On the run and fighting for your life, you are freelance journalist Matt Carter. Twelve hours after arriving in Moscow for a routine story, you've been stripped of all possessions, beaten unconscious and thrown into the KGB's political prison. Caught in the midst of an international conspiracy that aims to control the U.S.S.R., you are now on your own behind the \"Iron Curtain\". Using only recovered weapons and improvised gadgets, you must now evade and eliminate special Soviet forces and defeat the conspiracy or risk being either killed or sent to a remote Siberian prison camp.Key Features:Spy on your enemies through walls with the powerful and deadly X-ray camera\nComplete missions in multiple ways: Stealth or Brute Force - the choice is yours\nInteractive non-linear world: Accomplish objectives in multiple ways - find hidden paths, combine in-game elements to create weapons and traps, or silently eliminate opponents\nExplore authentic recreations of real Soviet locations including: Lenin's Mausoleum, Chernobyl, the Kremlin and the KGB's Lubyanka prison\nCollect and combine objects to create useful and deadly gadgets. You never know when a screw or a dirty old rag will come in handy.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mindware Studios","platforms":[{"id":0,"name":"PC"}]},{"id":5241,"name":"Crash of the Titans","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a22/a221cced70b0992acd7351491e4a982b.jpg","description":"Crash's enemies are now his weapons!\n\n\n\r\nIn Crash® of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their action and use their fearsome powers against all manner of enemies. To view the manual, please visit: http://www.activision.com/support.\n\n\n\r\n© 2007 Activision Publishing, Inc. Crash, Sierra and their logos are either registered trademarks or trademarks of Sierra Entertainment, Inc. in the U.S. and/or other countries and Activision is a registered trademark of Activision Publishing, Inc.    All rights reserved.  Developed by Supervillain Studios, Inc.  All other trademarks and trade names are the properties of their respective owners.\n\n\n\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. If you do not wish to accept all these terms, do not purchase or use this item.  This item has been sublicensed to you by Sony Computer Entertainment America.  One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Radical Entertainment","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":4318,"name":"Dyad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5f/a5fce256e55a8175fb6533eab51a22ca_hmI2m4S.jpg","description":"Experience a mind-bending, psychedelic sensory overload in Dyad!  Blast through a reactive audio-visual tube creating a harmonious synthesis of color and sound as you Hook, Graze, and Lance enemies to master Dyad's 27 unique levels.\nEmbark on an interactive transformative journey through Dyad's Game Mode campaign to prepare yourself for Trophy Mode's tactical freakout variations. Or choose to sit back and chill with Dyad's hallucinogenic Remix Mode. Transcendence awaits!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Right Square Bracket, Left Square Bracket Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":1207,"name":"Shu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb7/bb7c6b70e7df7d9ac5e29674a3561afa.jpg","description":"When the great and terrible Storm destroys Shu's village, he embarks on a desperate journey to survive. On his travels he'll encounter stranded villagers; survivors of the devastation that need his help. In return for his assistance, these peculiar characters will grant Shu unique special abilities that he can use to traverse the treacherous path ahead.\nShu and the villagers' only hope is to work together, in search of sanctuary - and a way to stop the Storm. Can you outrun the end of world?\nGame features:\n- 15 lush, expansive levels, set in 5 diverse lands\n- A plethora of collectibles and secrets to discover\n- 10 recruitable characters, each with their own unique power\n- An incredible original soundtrack\n- Compete in time trials to see who is the fastest out of your friends - or the world","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Coatsink","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":969106,"name":"One-armed cook","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/815/81590f56772750b75098a16b3f45b021.jpg","description":"Experience the challenge of cooking, but now with only one arm! Grab a friend and you'll have two arms in total.\nOne-armed cook is a chaotic co-op cooking game for up to 4 people. Work as a team or cook on your own, set your own pace, and don't let the stress of a full restaurant catch up to you. The goofy physics-based aspect of the game gives one-armed cook a new twist.Take orders from customersWith many different dishes for the customers to order\nyou will never run out of something to do.\nPrepare and cook your foodSimple and intuitive recipes make the experience much more fluent But should you ever be in doubt, you can always check the recipe book\nMess around. have fun with friends and create chaos with the physics","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Duhndal","platforms":[{"id":0,"name":"PC"}]},{"id":840783,"name":"Honkai Star Rail","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e2f/e2f795d9656be698e8c6ab6ffdff027b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"miHoYo","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":804850,"name":"Asterigos: Curse of the Stars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a32/a32694acd6a88dc463e58082d49d272a.jpg","description":"Discover the long forgotten secrets and hidden paths in this high fantasy world, featuring exhilarating battle encounters, interconnected maps full of places to explore, and an immersive story where every choice matters. Play as Hilda – a brave young warrior from the Northwind Legion who embarks on a journey to the cursed city in order to save her lost father. The gameplay elements inspired by soulslike games alongside a lighter, dynamic combat system, create a fresh take on the modern action RPG genre, providing you with a harmonious difficulty and exploration balance.\nExplore the magnificent city of Aphes inspired by classical Greek designs and unveil the truth behind the city’s curse.\nCombine and change your weapons on the go. Equip two different types of weapon at once and become unpredictable in combat.\nBattle more than 60 different enemies and encounter 22 bosses in the main story and side quests.\nDecide the fate of Aphes. Every decision you make in Asterigos matters and will affect the story.\nFind over 100 collectables, complete numerous side quests, and forge your destiny in the NewGame+ mode.\nWelcome to Aphes – a city-state full of magic and wonder inspired by ancient Rome and classical Greek designs. From the mist-covered bazaar streets to gloomy sewers, the enigmatic forests at the city’s outskirts to deep chasms full of glittering crystals, the landscapes of Aphes are full of beauty and dangers.\nChoose from a variety of ranged and melee weapons on the go and combine them as you wish! The talent system allows you to pick and expand your combat style by choosing two out of six completely different weapons: sword and shield, dual blades, spear, hammer, staff or even magic bracelets. Equip a magical staff to obliterate your foes from the distance or switch to a gigantic battle hammer to squish them in a close combat.\nWhilst Aphes might distract you with its breathtaking views, this city is not for the faint of heart. Fight your way through 60 different monsters and encounter 22 unique bosses – each with its own unique battle mechanics.\nEvery choice and every decision you make matters. Your journey in Aphes will lead you to discover the truth behind the city’s curse, letting you piece together its history through conversations, discovered documents and cinematics, as well as Hilda’s own diary, which she’ll update with sketches and observations.\nThe world of Asterigos is full of secrets and untold stories. Find over 100 collectibles, complete numerous side quests and build on your legacy in the New Game+ mode!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Acme Gamestudio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":795479,"name":"Warhammer 40,000: Boltgun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/96e/96ed69295a50e926d42412a7b4413d08.jpg","description":"Load up your Boltgun and plunge into battle headfirst! Experience a perfect blend of Warhammer 40,000, classic, frenetic FPS gameplay and the stylish visuals of your favourite 90’s retro shooters.\nPlay a battle-hardened Space Marine on a perilous mission across the galaxy, as they battle against the Chaos Space Marines and daemons of Chaos.\nIn glorious boomer shooter style, unleash your devastating Space Marine arsenal as you blast through an explosion of sprites, pixels and blood. Run, jump and charge across huge levels to shoot, shred and slice the worst heretics across the galaxy!\n•\tDive into a visceral combat experience, complete with viciously satisfying gunplay, high mobility and buckets of blood to reward your skills\n•\tDominate the battlefield with the awesome firepower and heavy metal of a Space Marine’s devastating arsenal\n•\tExperience the ultimate homage to retro shooters, blending stylish visuals with fluid, modern FPS gameplay","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Auroch Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":490417,"name":"Hyrule Warriors: Age of Calamity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/086/0865a7072a225181f3fa492171bad5f6.jpg","description":"See Hyrule 100 years before the Legend of Zelda: Breath of the Wild game and experience the events of the Great Calamity\nJoin the struggle that brought Hyrule to its knees. Learn more about Zelda, the four Champions, the King of Hyrule and more through dramatic cutscenes as they try to save the kingdom from Calamity. The Hyrule Warriors: Age of Calamity game is the only way to firsthand see what happened 100 years ago.\n\n- Battle hordes of Hyrule’s most formidable foes -\nFrom barbaric Bokoblins to towering Lynels, Ganon’s troops have emerged in droves. Playable heroes like Link, Zelda and more must use their distinct abilities to carve through hundreds of enemies to save Hyrule from the impending Calamity.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Omega Force","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":471018,"name":"Bomb Rush Cyberfunk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca7/ca7ca88681ad87eccd12e2acc65a2f6d.jpg","description":"Team Reptile brings you Bomb Rush Cyberfunk, 1 second per second of highly advanced funkstyle. In a world from the mind of Dion Koster, where self-styled crews are equipped with personal boostpacks, new heights of graffiti are reached. Start your own cypher and dance, paint, trick, face off with the cops and stake your claim to the extrusions and cavities of a sprawling metropolis in an alternate future set to the musical brainwaves of Hideki Naganuma.\r\n\r\nFacts:\r\n- In the game you can choose a character from your crew and explore the three-dimensional streets freely.\r\n- Each stage is a neighborhood that represents one time of day.\r\n- You can grind, slide, jump, trick and airdash to move around\r\n- The goal is to get your name up, your name up on the wall. Every stage has many spots to find where you can paint graffiti.\r\n- You will encounter a lot of weirdos.\r\n\r\nFAQ:\r\n- Will the game have online multiplayer?\r\nThe experience is focused on single-player, no further comment as of yet.\r\n\r\n- When will the game be released?\r\nNot this year, it's unlucky.\r\n\r\n- Remember the future?\r\nNothing for nothing.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Team Reptile","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":362871,"name":"WWE 2K20","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/981/981198d4ab755dbc59647065db8b0ae6.jpg","description":"WWE 2K20 Digital Deluxe\nThe Deluxe Edition provides the VIP experience with this additional content:\n20th Anniversary of SmackDown Digital Bonus Content\nWWE 2K20 MyPLAYER Kickstart\nWWE 2K20 Accelerator\nAdditional digital content to be announced at a later date\nAbout the Game2K invites players to Step Inside the squared circle with WWE 2K20, available October 22. Your favorite WWE Superstars, Legends, Hall of Famers and NXT’s best will join the festivities and celebrate the rebirth of the WWE 2K franchise! WWE 2K20 will feature key gameplay improvements, streamlined controls, and the most fun and creatively expansive entry in the franchise to date.  WWE 2K20 will also feature a brand-new 2K Showcase focused on the story of the Four Horsewomen/Women’s Evolution, the return of 2K Towers, an all-new MyCAREER that prominently features both male and female playable characters, and Mixed Tag Matches featuring male and female competitors.\nStay tuned for more details to come on WWE 2K20.  Pre-Order today and Step Inside.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Visual Concepts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":349634,"name":"Electronic Super Joy 2","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/903/903db82941d4bc2f6a3e2cce51bbc998.jpg","description":"Electronic Super Joy 2 is a brutally hard platformer, set in a world of brain-smashing electronic music. Run, jump, smash, & slice your way through 55+ weird & different levels, with giant monsters, swarming missiles & secret areas.\nEnjoy 4 brutally difficult Boss Fights, including stealing Mega-Satan's Butt, earning Slime-Daddy's love & murdering Santa Claus (he's gone insane & is eating all the reindeer).\nDescribed as \"Basically just Geometry Dash\"\nMentioned by my Mom as \"What's a video game?\"\nQuoted as being \"Mostly about Butts!\"\nPraise for the first game in the series, Electronic Super Joy:\n\"Oh dude, I'm FEELING Electronic Super Joy\" - Game Grumps\n\"This is probably the best story I've ever seen in an indie game\" - RageQuit, Rooster Teeth\n\"An epic sexy soundtrack to this epic sexy game\" - Markiplier\n\"Visually Stunning\" - Destructoid\nPlot\nThey say Mega-Satan has a butt made of Pure Gold... that grants wishes. This is the story of your quest, for the Devil's Golden Butt.\nKey Features\nPlay through 55+ pulse-pounding levels!\nGroove to 38 tracks of amazing music!\nLoad your shotgun & fight through a DOOM-style FPS!\nTwist your way across the World Map, with 55+ levels, plus side challenges, secret levels, alternative pathways & collectibles.\n8+ hours of gameplay!\n4 HUGE Boss fights!\nFar too many dad jokes & bad puns!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Michael Todd Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":330884,"name":"Assassin's Creed Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b86/b86c1a368a97b1fb0b757429f7659c70.jpg","description":"Explore three distinct civilizations and periods throughout history including the Ming dynasty's downfall in China, the Sikh Empire in India, and the aftermath of the Red October revolution in Russia.\nTHREE UNIQUE EPISODES\nEmbody Assassins Shao Jun, Arbaaz Mir, and Nikolaï Orelov in a 2.5D reimagining of the Assassin’s Creed universe. Slay from the shadows, master the art of parkour, and take the leap of faith in a collection of stunning, living paintings.\nMASTER THREE DIFFERENT COMBAT STYLES\nEach Assassin is equipped with a powerful range of weapons and distinct gadgets, making every experience unique, with a wide assortment of abilities in your arsenal.\nSTEALTH TAKES ON A NEW DIMENSION\nThe thrill of being a Master Assassin in 2.5D. Scout, sneak, and hide to avoid detection. Fool your enemies by using whistles and disguises. Find your target, kill, and escape.\nIncludes: Assassin's Creed Chronices: China, Assassin's Creed Chronicles: India, and Assassin's Creed Chronicles: Russia\n1 player\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Ubisoft Entertainment. All Rights Reserved. Assassin’s Creed, Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":56191,"name":"Resident Evil Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/628/628f219b556759a67365019347fceb6d.jpg","description":"Resident Evil Zero, known in Japan as Biohazard Zero, is a survival horror game developed and published by Capcom. It is the fifth major installment in the Resident Evil series and was originally released for the Nintendo GameCube in 2002. It is a prequel to Resident Evil (2002), covering the ordeals experienced in the Arklay Mountains by the special police force, S.T.A.R.S. Bravo Team. The story follows officer Rebecca Chambers and convicted criminal Billy Coen as they explore an abandoned training facility for employees of the pharmaceutical company Umbrella. The gameplay is similar to early Resident Evil games, but includes a unique \"partner zapping\" system. The player controls both Rebecca and Billy, switching control between them to solve puzzles and use their unique abilities.\nDevelopment for Resident Evil Zero began on the Nintendo 64 in 1998. The partner system was created to take advantage of the short load times possible with the capabilities of the N64 Game Pak. The cartridge format also provided limitations, as the storage capacity was significantly less than that of a CD-ROM. The team had to approach the design differently from previous series entries to conserve storage space. Resident Evil Zero was designed to be more difficult than previous Resident Evil games. Inspired by Sweet Home (1989), the team removed the item storage boxes present in earlier games and introduced a new item-dropping feature. Development slowed when the team encountered memory storage problems, and so production was moved to the newly announced GameCube. The game had to be rebuilt, with only the concept and story carried over.\nResident Evil Zero received generally positive reviews. Critics praised the graphics and audio for building a haunting atmosphere. Opinions on the new partner and item systems were mixed. Some found the changes were an improvement and added new layers of strategy; others believed the changes were cumbersome or non-innovative. The controls were panned as outdated and Capcom was criticized for not evolving the series' tank controls. The game was ported to the Wii in 2008, and a high-definition remaster was released in January 2016. These re-releases received mixed reviews due to lack of improvements made to the original. Resident Evil Zero is commercially successful, having sold over 2.5 million copies across all platforms.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"},{"id":0,"name":"Wii"}]}]