[{"id":10702,"name":"Block'hood","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a2/0a216673337c1d08649244f44fb4b3fa.jpg","description":"Block’hood is a neighborhood-building simulator that celebrates the diversity and experimentation of cities and the unique ecosystems within them. Budding city planners will have access to 200+ building blocks to arrange and combine and to create unique neighborhoods and discover the implications of their designs. The game will embark on a story of ecology and understanding as additional resources are always needed to unlock new blocks, configurations, and combinations to create more prosperous neighborhoods. Throughout the design process, players will need to avoid the decay of their city blocks by making sure each unit doesn’t run out of resources and become a strain on the complimentary units around them.\nEnvision Your Neighborhood: Consider what Blocks are necessary for your neighborhood to thrive. There are no boundaries of what you can create with an expanding library of 200+ blocks.\nGenerate Resources: Each Block you create has inputs and outputs and by understanding how each block is dependent on other blocks, you can create a productive network. Optimize your production and generate abundant resources for the dozens of intricate symbiotic relationships in your neighborhood\nAvoid Decay: If blocks don't receive the inputs they need, they will decay over time and slowly become abandoned or destroyed. Once a block is abandoned or destroyed, you will have to remove it and avoid it from making other blocks decay further. Be careful as seeking an utopian neighborhood carelessly, can lead to dystopia.\nUnique Modes: Neighborhood designers can enjoy the new Story Mode, Sandbox Mode, and Challenge Mode with modes for unique and engaging experience for players of all types.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plethora-Project","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":8586,"name":"Magnetic: Cage Closed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96c/96c989aa53a2962534a42b00ac991b0b.jpg","description":"You are a prisoner trapped in a strange facility, filled with deadly traps and whispered secrets. At first the facility and its inhabitants all seem like a mystery to you, but soon you begin to understand: Your only chance to survive is to master the Magnet Gun and stay out of harms way. If you make yourself useful they will let you live a little longer, and sooner or later you will get your chance. As the Warden keeps on telling you: “There is always a way out…”\nUnique Tool - The magnet gun is a unique tool that can transform the environment, launch you through the air or assist with complicated box puzzles\nDiversity - The challenges in Magnetic come in many forms, and blend logical puzzles with skill based movement in a unique combination\nNo playthrough is the same - Each choice has an impact on what comes next. New secrets and paths are just waiting for players to find themMagnetic: Cage Closed Collector's EditionThe Magnetic: Cage Closed Collector's Edition comes with a comprehensive Digital Artbook, Full Digital Soundtrack, and Two New Devious Challenge Maps.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Guru Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":7886,"name":"Dog Sled Saga","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/622/622afe476ac4f5dc118add14f3c5da35.jpeg","description":"As a rookie musher, foster a dogsledding team whose skills will grow if they're treated right. Week by week, get to know your dogs' unique traits, and carve your story into the trails of the Mount St. Something region.\nDog Sled Saga has a pick-up-and-play dogsled racing. Each dog's speed is hindered by hunger. Lob a limited supply of food to them to keep at full speed. Hazards on the track await.\nBy the time you reach the top league, you’ll need to:\nBudget monthly league expenses\nHire and fire dogs\nLeverage fame to earn sponsorship deals\nBring on employees for multitasking\nBreed puppiesand more.\nFeatures:\nPick-up-and-play racing\nDeep team management simulation\nUnique dogs with varying attributes and conditions\nTrue pixel-grid art style with frame-by-frame animation\nMulti-platform save sync via Drive\nGamepad support","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dan FitzGerald","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":5716,"name":"Eventide: Slavic Fable","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c63/c6387838c2fe9dd44831bac2530f8250.jpg","description":"\"Eventide: Slavic Fable is an exciting adventure game inspired by Slavic mythology.\nSet in a contemporary heritage park where mythical Slavic creatures co-exist with humans, the adventure begins when the protagonist, a famous botanist, receives an alarming invitation from her grandmother, the park's curator. The protagonist is tasked with saving an endangered plant, but this turns out to be the least of her concerns. Her Grandma is kidnapped by the mysterious Boruta, who is plotting to conquer and destroy the world using the park's ancient magic.\nThe protagonist must seek alliance with the creatures living in the park, in order to defeat the villain, save her Grandma, and prevent worldwide calamity. Will she be able to stop Boruta and his evil forces?\"\nFeaturesVisit 38 diverse locations to save your Grandma - and the world!\nChallenge yourself in 43 HO scenes!\nExplore an ancient, mythic world!\nSolve the mystery of the magical Fern Flower!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":1613,"name":"Sébastien Loeb Rally EVO","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f40/f40756e709ad519d5ddf4e14bf7f3315.jpg","description":"Special EditionBuy the Special Edition and obtain the Full Game + Season Pass with 4 DLCs and 24 events!\nAbout the GameSébastien Loeb Rally EVO brings off-road racing to a whole new level of simulation and engagement. It will enable you to drive the best rally cars from the past up to the present day in the most exciting off-road events across the globe.\nSébastien Loeb Rally EVO stems from a desire to give the gamer a driving experience that is more realistic than any other. Thanks to the support and feedback of the 9 times world champion Sébastien Loeb, this title will enable you to fully experience rally and rallycross racing like you never have before!\nThe flagman starts the countdown, the headlights switch on, foot on the accelerator and go! Step on the pedal as far as it will go, shoot past on asphalt, mud or snow and try not to lose control, drift by pulling down as hard as you can on the steering wheel and try to aim for the best time!\nIf the adrenaline rush of simultaneous competition is more your thing, challenge other opponents by launching yourself into a Rallycross race and fend off any attempt to stop you from reaching first place!\nIn Sébastien Loeb Rally EVO the most famous Hill Climb in the world also awaits you. Break a new record on the 12.42 mile course with its infamous 156 turns!\nIf you have never competed on a rally or rallycross track and you want to test your driving skills on asphalt or dirt road, before launching yourself into a race, take it out for a spin on the Test Drive! This game mode enables you to put your skills to the test and practise freely inside a quarry that is all to yourself!\nThe varied weather conditions and tracks make the gaming experience very challenging. Carefully select and customize your cars which will enable you to reach the finish line. Each car has different features, just like in real life!\nListen carefully to your co-driver. Each instruction is accurate and timely and if followed accordingly, you will be the first to cross the finish line!THE CARS THAT MADE RALLY HISTORY AND MORE... 16 of the world’s biggest manufacturers and 58 designs. A garage in which each class is inspired by the official categories, from the past up to the present day.\nThe cars’ real life manoeuvrability is replicated in the game as well as the way they adapt to a given track, weather conditions and different competitions.RALLY AND RALLYCROSS Over 180 miles of track length, 8 rally tracks, 64 special stages and 5 rallycross circuits!\nEach single stage and circuit is based on real tracks, thanks to the use of GPS data.\nThe game also reproduces in the most detailed and thorough way imaginable, the most adrenalin fuelled hill climb in the world: The Pikes Peak Hill Climb. 12.42 miles uphill, one of the most challenging routes a driver can face. The whole track has been recreated thanks to the use of GPS data, photography and footage. With Sébastien Loeb Rally EVO you can live the thrills and risks that lie behind every curve, driving racing cars of over 850-horsepower.SEASTIEN LOEB – THE CHAMPIONThe greatest driver in the history of the sport, winner of 9 world championships, world record holder of the Pikes Peak (8 minutes and 13 seconds), it’s the one and only Sébastien Loeb.\nSébastien Loeb Rally EVO is the only videogame in the world that has that has an entire game mode all about the world champion: The Sébastien Loeb Experience.\nIn ‘Loeb Experience’ mode, you can relive his entire career in 8 different ‘Eras’, from the beginning to the unforgettable 2013 record at Pikes Peak on board of his Peugeot 208 T16 PP. Go over each single event and drive every car that made him a rally legend.\nDeveloped together with the champion, Sébastien Loeb Rally EVO presents: co-driver notes completely true to life, an upgraded differential simulation that is much more lifelike and accurate, realistic handling in every situation and a force feedback that it is different for every car and type of terrain in the game.GAME MODESDifferent game modes will have you discover the best rally tracks in the world. Show your worth on mud, snow and dirt roads in a variety of events. Career mode gives you the chance to relive the same sensations of a rally driver and to compete to become a member of the Sébastien Loeb team, have the champion be your mentor and learn all the secrets to becoming the perfect driver!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Milestone","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":997,"name":"Kingdom Rush Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f75/f75cf84b5e41b317179fb08630cdcecb.jpeg","description":"The most addicting tower defense game returns in an all-new prequel adventure - welcome to Kingdom Rush Origins!\nKingdom Rush Origins is the third installment of the award-winning Kingdom Rush saga, loved by millions and earning accolades from gamers and critics around the globe. Take a trip back to the beginning, before Vez’nan ever thought to threaten the kingdom with the gem of power, and experience even more of the lightning-fast, exceptionally captivating gameplay that made the franchise a cornerstone of essential tower defense games. In this exciting prequel, command your elven army and defend mystical lands from sea serpents, evil sorcerers, and wave after wave of gnoll tribesmen, all with the help of brand-spankin’ new towers, heroes, and spells to fend off every last baddie.\nKingdom Rush Origins packs in a treasure trove of new content and features while keeping the signature look that millions have come to love.Key Features Re-enter the world of Kingdom Rush: visit mysterious elven forests, magical faery realms and even floating ruins of an ancient metropolis!\nUnleash the power of the elves with brand new towers and troops! Elf Archers, Mystic Mages, Stone Druids and the Elven Infantry make up the backbone of your army.\nDiscover new specialized tower upgrades with over 18 abilities! Vanquish your enemies with elven marksmen, runed bears, magic-wielding wizards, and even giant animated trees.\nTake up arms against new enemies enemy types and engage in epic boss battles! Face hordes of Gnolls, giant spiders, and the terrible Twilight army.\nMaster and upgrade legendary heroes and their awesome powers and spells!\nRain lightning, summon reinforcements, and use each hero’s unique power to obliterate scores of enemies!\nImmerse yourself in hours of gameplay with over 70 achievements, with three difficulty modes for the newbs and veterans alike.\nPlay different game modes - Classic, Iron, and Heroic - and prove your mettle as a master tactician.\nStudy your enemies and your towers with an in-game encyclopedia.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ironhide Game Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":923014,"name":"Metroid Prime Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2f/f2f9f11997ee841550ba2b8ccf3c51e9.jpg","description":"Suit up for an iconic adventure\nIntergalactic bounty hunter Samus Aran receives a distress signal from a wrecked frigate in orbit around planet Tallon IV. Upon investigation, the frigate reveals itself to be a Space Pirate research vessel home to terrifying genetic experiments using the mysterious Phazon substance. There, Samus encounters her nemesis, Meta Ridley, whom she pursues to the surface of Tallon IV. It’s up to her alone to explore the planet’s interconnected regions, investigate its dark secrets, and end the intergalactic threat posed by Phazon.\n\nExperience this critically acclaimed first-person adventure like never before with remastered visuals, audio, controls, and more.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":721077,"name":"Souldiers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a1/7a13e94294e95d3800d803e2e89bc42a.jpg","description":"While out fighting for the glory of your kingdom, you and your fellow soldiers are whisked away to Terragaya, a mystical land on the fringes of the afterlife. Your task is to locate the Guardian and move on to the next world. The hitch? You and your compatriots never actually died.\nBattle your way to the heart of the mystery: Outwit cunning enemies, solve nefarious puzzles, upgrade your character and explore every corner of a dazzling, intricate 16-bit world. Souldiers is a handcrafted retro epic for the ages.\nFeaturing:\nGripping melee combat: Slash, parry and dodge your way through an ever-evolving roster of enemies, upgrading your skills and equipment to find a combat style that’s perfect for you.\nAn interconnected world: Discover a sprawling handcrafted landscape filled with treasures, tough-as-nails bosses and secret pathways.\n16-bit sensation: Terragaya comes to life with vibrant world-class pixel art packed to the brim with details.\nSmart moves: Solve environmental puzzles and leap from place to place using an ever-expanding moveset.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Retro Forge","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":672323,"name":"Storyteller","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b64/b64cc4668924cb63ce5cd667054ba4e3.jpg","description":"Experience some of history's greatest stories like never before. Storyteller is an award-winning reactive puzzle game that lets you build the story.\n\n\n\nStoryteller's charming animations and comic-panel design allows for a unique puzzle mechanic. Use your wits to retell iconic tales — or experiment and find something new.\n\n\n\nPlay with a library full of characters and themes, featuring heroes and villains, dragons and vampires, infidelity and remorse, love, lies, madness, and more! Use the blank canvas to manipulate secrets and desires, slay monsters or terrorize people with them, betray lovers or bring them together. You know how the stories go — but this time you are the author.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Netflix","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":650649,"name":"Outer Wilds - Echoes of the Eye","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51a/51aa7f938f4937a1a085abd1b407921f.jpg","description":"A strange satellite photo that can’t be explained. A new museum exhibit that marks the trailhead for one last journey into the wilds. Should you pull at the thread and unravel the solar system’s deepest secret, or is some knowledge better left in the dark?\n\nWelcome to the Space Program!\nYou're the newest recruit of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system.\n\n\n\nMysteries of the Solar System...\nWhat lurks in the heart of the ominous Dark Bramble? Who built the alien ruins on the Moon? Can the endless time loop be stopped? Answers await you in the most dangerous reaches of space.\n\n\n\nEchoes of the Eye\nThe hearthian space program has detected an anomaly that can’t be attributed to any known location in the solar system. Grab your flashlight and prepare to illuminate the darkest secrets of the Outer Wilds...","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mobius Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":614952,"name":"Terra Nil","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91d/91d1068d4c8e55019375562ada13a619.jpg","description":"Terra Nil, from eco-warriors Free Lives (Broforce) and recycled publisher Devolver Digital, presents players with the task of environmental rejuvenation.\nThe phases of wasteland reclamation\nBegin with the water system, slowly purify the soil, and cultivate pioneer greenery. Embark on more ambitious tasks, restore biodiversity, fix the climate, introduce wildlife, and finally recycle all the structures you used to get there, leaving the environment pristine.\nUnique, procedurally generated maps\nEach region of the game has its own flavour and procedural generation palette. Yet even within a region, no two playthroughs will be the same.\nPicturesque landscapes\nNavigate sprawling, verdant, hand-painted environments where everything but the rocks move and breathe. A meditative soundtrack and stunning audio palette will accompany your efforts.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Free Lives","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":576508,"name":"Shores Unknown: Arrival","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/387/3873e4dad2efab0da657e6df50739f5f.jpg","description":"Discover new and upcoming games with our Soon to Bloom collection of over 20 playable demos.\nThe full version of Shores Unknown is available on GOG.com. You can purchase it here\nShores Unknown: Arrival is a free demo which offers save data carry-over to the full game. Arrival sees you at the end of your trek to the northernmost shore in the Empire, searching for the reason why you were sent to such a remote village. Problems arise when visitors of unknown origin are spotted through the distant fog that blankets the sea, and soon you find yourself under threat from the dreaded Inquisition.\nA turn-based tactical RPG rendered in a rich, low-poly aesthetic. Build your own team of mercenaries, forge alliances, wage battles, and journey beyond the seething wall of fog known only as the Murk in this decision-influenced, narrative-driven adventure. What dangers await you on Shores Unknown?\nTHE SHORES BECKON\nShores Unknown takes place in a land ruled by the iron-fisted Crown, and policed by the fearsome Inquisition, from whom it is said there is no escape. To the south lies the Empire and perpetual war, while to the north there is only the Murk — a seething wall of fog from which no ship has ever returned. In the midst of these grand forces, both natural and otherwise, our heroes must find a way to survive and to pursue their dreams of liberty.\nPlay as the newly-made leader of a mercenary company, fresh off an assignment gone awry. Now on the wrong side of the Crown, allies and loyalty are paramount. Forced to venture through the maw of the Murk in a search for truth, players will explore unknown lands, forge new alliances, and wage battle against those who would see to their end. What dangers await on Shores Unknown?\nGAME FEATURES\nGridless tactical turn-based combat: take your time to assess the situation and command your characters in the Order Phase, then watch your strategy come to life during the Action Phase as the characters maneuver around the battlefield and carry out their orders.\nAdaptive character advancement system: characters learn new skills and unlock new classes depending on their equipment and combat choices.\nDeep party customization options allow the player to build the perfect mercenary team of their choice, allowing full control over equipment and skills used by each character.\nVibrant world rendered in low-poly stylistic full of little details to immerse yourself in. Explore the various locations of the game, interact with dozens of characters and uncover the secrets of the Shores.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Vallynne","platforms":[{"id":0,"name":"PC"}]},{"id":359291,"name":"Builder Simulator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9e/d9e43238b52453907b5b759dbcb4d792.jpg","description":"Builder Simulator  is the perfect game for those who want to build a house, from the ground up, one brick at a time. On easy, the game will guide you step by step and allow you to learn by showing you full instruction, but on hard you will get no help - instead rely on your builder skills and make everything yourself.Builder Simulator will let you:Create your own projects - build houses, shops and industrial buildings.\nUse different tools - use specialist equipment as it's meant to be.\nTake care of building materials - do not let the construction site run out of materials needed for work.\nCreate your own materials - Mix water and cement to create concrete, but make sure your proportions are right.\nDo It Yourself - do everything yourself, don't worry about incompetent workes messing your work up.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Builder Studio","platforms":[{"id":0,"name":"PC"}]},{"id":351769,"name":"Explore Fushimi Inari","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d04/d045caef21648cd855b4fe2e4857ebc7.jpg","description":"With photos and memories from a few years ago, I set out to achieve a detailed, realistically designed recreation of the renowned Japanese shrine, Fushimi Inari Taisha. I feel like the real place has a very culturally unique significance, I personally had a great time exploring it a few years ago. I've designed this environment to be experienced from a first person perspective, with the aim of allowing the player to be immersed in the same kind of atmosphere as the real place.\n(Engine / Photo Comparison)\nThe map is very extensive to explore with shrine gates laid out over the entire mountainside. I've tried to include a lot of variance in different parts of the mountain, with lots of points of interest to discover and many branching/intertwining paths to encourage you to make choices with your exploration. Take photos with the in-game camera, customize the soundtrack, walk around at your own pace. There is a checklist of locations to find as well as some hidden areas, and also a small ending.Explore the Shrine in VR! (DLC)If you own a VR headset, you can immerse yourself even more in the world with the VR compatible version I've built. I was happily surprised with how well the scene runs in virtual reality, the quality is almost on par with the desktop version and it still runs great. Everything from the desktop version is here, with some advanced DSLR camera controls, locomotion/teleportation movement options, and optimized UI/game menus.\nI feel thankful that higher fidelity 3d environments have become more achievable by everyone, and not only AAA game developers. I had a blast creating this project and feel like it's really improved my skills with unreal engine. hope you enjoy exploring\n- Matt","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Matt Newell","platforms":[{"id":0,"name":"PC"}]},{"id":301619,"name":"Peekaboo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae2/ae2fd7a8ba82033860980e065a1a8ddd.jpg","description":"Peekaboo — Hide and Seek On the Network\nPlayers are divided into two teams: props and hunters.\nProps able to take shape of any object.\nOn each map a lot of unique objects: from small items like fast food and fruit, to large ones — like boxes and furniture.\nPlayers armed with special guns — hunters — must find players of opposing team in a limited time.\nEach side has unique skills that help to win the round.\nFor now, up to 12 players can take part in the match at the same time.\nWhen the prop is disclosed, it goes over to the side of the hunters. Everyone is constantly involved in the gameplay, no one is idle!\nAt the moment, the game have two maps and possibility to choose the time of day — day, evening or night.\nThat will completely change an atmosphere of the match. During the day you will hear the birds singing. At night you'll see the light in the windows. In the park will appear fireflies and light breeze...\nWe are actively working on creating new maps!Peekaboo Using a Nice and Colorful Graphics in a Unique Low Poly Style\nPlay on open servers with other experienced hunters. Or invite your friends to private servers and have fun together!This Game is For You and Your Friends","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Redaster Studio","platforms":[{"id":0,"name":"PC"}]},{"id":65163,"name":"Monster Crown","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5d/d5d9b1d326174b0fca86303d6ebf7cd1.jpg","description":"Monster Crown - Dark Monster Catching Game with True Crossbreeds\nMonster Crown is an in-development indie title for the die-hards, the monster catching completionists - the battle masters.\nFeaturing a brand new dynamic breeding system and a deep story in a world filled to the brim with optional content. Offer contracts to dangerous beasts and breed them to create new species. Travel across Crown Island with your Monsters as you work toward stopping an underground plan to revive the sadistic Philosopher Kings and return them to their thrones\nFeaturing\n200+ Monsters to Collect\nCountless Combinations to Breed\nA Sprawling, Wild World\nA Deep, Dark Story\nOnline Battling/Trading","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Studio Aurum","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":62654,"name":"NALOGI","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/01d/01d88963a37d82638f3d6a9786cc1d48.jpg","description":"NALOGI - bright satirical game in the genre of RPG. Classic combat turn-based system as in JRPG. Beautiful anime characters, humor, a lot of dialogues and stories. Casino, church, gangsters, bureaucracy and arbitrariness of the authorities. Win and destroy the system or pay taxes! Features:   Turn-based combat system\nUnusual plot\nNALOGI\nCombinations of tricks and spells\nBeautiful and juicy anime girls\nAchievements!\n+ Trading cards (after Valve approval)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"CUTE ANIME GIRLS","platforms":[{"id":0,"name":"PC"}]},{"id":30469,"name":"Diggles: The Myth of Fenris","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d45/d454d021c8a62fea9e6f859d8c57e1ae.jpg","description":"DIG*GLE (n): an underground dwelling dwarf whose main function is to mine resources, harvest mushrooms and bat the enemies to survive. They are hardworking, but enjoy leisure time activities such as bowling, the disco, a trip to the pub and perpetuating the species. The Diggles dynasty has been chosen by Godfather Odin to rid the world of Fenris, the hound of hell.BUILD YOUR CLANOdin made sure no Diggle is the same. Develop each of them with a varied set of skills and combat techniques so you can grow your clan. Give Diggles some free time, make sure they are fed and entertained and soon your tunnels will be full of angry babies. But don’t get too comfortable - there are other unique clans down there.DEVELOP YOUR COLONYMake sure your clan has everything it needs in your new colony. With over 50 production sites to master, you will be busy exploring the technology tree, crafting with 20 production tools, and gathering seven different resources.DWARVES WITH ATTITUDESnarky Diggles always end up in some story. Watch for yourself - all quests are featuring hand-crafted cutscenes full of humor, dwarfy attitude, and their gnomish problems. There are many stories to be told in more than 40 quests. Digging into the mud was never this fun.IT'S BEEN ALMOST 20 YEARS. WILL IT RUN?We are happy to bring back to life the story of Diggles (or Wiggles, or Гномы - depending on localization that is closer to your gamer's heart). The game received its portion of technical care and now runs on modern operating systems without any extra shenanigans. The story, visuals, and gameplay are untouched - with all its charm and flaws. Enjoy playing the game on Windows 7 or later, without legacy DRM, no FPS lock, and with few extra DirectX11 settings.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"General Arcade","platforms":[{"id":0,"name":"PC"}]},{"id":26188,"name":"Resident Evil: The Darkside Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/032/0322d8688637ff99a68e6cbed6b7e393.jpg","description":"Leon Kennedy and Claire Redfield fight the undead in this thrilling\nco-op arcade shooter that relives classic moments from Resident Evil 2\nand more, only for Wii.\nCapcom brings the Resident Evil series\nback to Wii with the sequel to the highly successful, million-selling\ntitle, Resident Evil: The Umbrella Chronicles, Resident Evil: The\nDarkside Chronicles.\n\nUnlike the evil enemies you fought against in the previous story, in\nResident Evil: The Darkside Chronicles, players will fight against the\ncharacters’ own inner demons. Two of the most popular characters in the\nseries and heroes of the beloved Resident Evil 2, Leon Kennedy and\nClaire Redfield, will be making their return. As unconventional heroes,\nthe two start out the game as ordinary individuals who are thrown into\nterrorizing situations where their own fear is their biggest enemy.\nFeaturing a brand new storyline that will fill in missing pieces of the\n“Chronicles” series, Resident Evil: The Darkside Chronicles leads\nplayers into a horrific world where the lines between good and evil are\nblurred and the fight begins with your dark side…\n\nThe game’s on-rail, arcade shooter gameplay first featured in Resident\nEvil: The Umbrella Chronicles has been radically upgraded in Resident\nEvil: The Darkside Chronicles. One of the major additions is a\nsub-screen which will allow for weapon configuration and use of recovery\nitems regardless of time progression. A horde of new features including\na new system that allows players to modify the difficulty level\naccording to their playing skills will bring accessibility and fun to\nboth the hardcore and casual gamer.\n\nContinuing in the survival horror tradition, Resident Evil: The Darkside\nChronicles will increase the thrills and chills with an enhanced\ntwo-player co-op mode where players will be able to follow their\npartners on the same screen. Their conversations and interactions have\nalso been improved to create a more intense co-op experience.\n\nA more terrifying experience than ever before, Resident Evil: The\nDarkside Chronicles combines a shaky and realistic handheld camera\nexperience with an eerie soundtrack and creepy sound effects utilizing\nstate-of-the-art technology.\n\nFeatures\n\n• Two-Player Co-op Shooting: Invite friends and family to experience the\nhorror alongside you in 2-player co-op mode.\n• Revisit Classic RE\nLevels: Experience environments and areas from classic Resident Evil\ntitles such as Raccoon City from Resident Evil 2 and the hidden Umbrella\nlaboratory from Resident Evil: Code Veronica, as well as scenarios that\nwill be all new to Darkside Chronicles.\n• Fan Favorite Characters\nReturn: Play as Leon S. Kennedy, protagonist of Resident Evil 2 and\nResident Evil 4, his partner Claire Redfield, who appeared in Resident\nEvil 2 and Resident Evil: Code Veronica, and others still to be\nannounced.\n• Customizable Weapons: Players can upgrade and customize\ntheir weapons for each battle scenario. Each playable character can be\nspecialized for a specific combat style.\n• Dynamic Difficulty: In\naddition to the initial settings of Easy, Normal and Hard, the game’s\ndifficulty level will adjust automatically based on the player’s skill\nlevel so that both old and new fans can have a fun and challenging\nexperience.\n• Collectibles Galore: For true Resident Evil devotees,\narchive items such as characters, enemies, old documents and movies can\nbe found throughout the game.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"}]},{"id":24442,"name":"No More Heroes 2: Desperate Struggle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/07a/07ac3210d7bb25ce4edae3fc30b02356.jpg","description":"The action takes place 3 years after Travis got the meaningless ranked\n1st title. Travis still lives in the same motel until he receives a\nmysterious parcel. Bishop, the only best friend Travis had, is dead.\nCoincidentally, the beautiful and cold Sylvia reappears in front of him\nto report the new assassin ranking of #51. Armed with a second beam\nkatana Travis is back to start his long journey that will lead him to\nthe path of revenge…","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"}]},{"id":20767,"name":"Little Big Adventure - Enhanced Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d32/d329b98212a68eb99611e477cd9efc56.jpg","description":"Originally released in 1994, Little Big Adventure (also known as 'Relentless: Twinsen's Adventure') is an action-adventure RPG designed by Frédérick Raynal.\nYou play as Twinsen, a young hero living on Citadel Island on a world under the heel of the dictator Dr. FunFrock. You’ve been having strange dreams in which your planet is about to be destroyed. These dreams don’t make Dr. FunFrock particularly happy, and he locks you away in an insane asylum. As Twinsen, you’ll need to escape from your cell and discover your incredible destiny as a descendant of a long line of magicians in charge of protecting your planet’s secret!\nBoasting an epic story, challenging puzzles and tons of characters and dialog, Little Big Adventure is a certified masterpiece. Enjoy this new PC version including brand new features:\n• New gameplay: adjustable throwing and jumping distance (visible trajectory), simplified sections, etc…\n• Streamlined, easy-to-use interface with enhanced graphics specially redesign for this version\n• Tutorials at the start of the game\n• Dynamic ON/OFF hint system\n• Zoom feature to provide an overview of the scenes\n• Automatic save system, with return to the last checkpoint when you lose a life\n• 5 languages available: English, French, German, (voices and text) - Italian and Spanish (text only, voices in English).\n• Over 15 hours of gameplay\n• A rich and varied blend of platform, combat and puzzle gaming\n• An entire planet with dozens of different locations to discover\n• Full controller support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"}]},{"id":19934,"name":"Dreamscapes: Nightmare's Heir - Premium Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/521/521fa73c2b3dfa4705040163138b4ce5.jpg","description":"Laura doesn’t suffer from nightmares anymore. But, despite the fact that it has been 2 years since she came out of the coma, she is haunted by the promise of Sandman to take revenge. Laura and Tim go to ski resort hoping to distract Laura from heavy thoughts.\nThere, on the edge of the world, misfortune befalls her. Tim goes out of the house in a fit of lunacy and falls off the cliff. He did not die, but is in a coma. It is not hard to guess that the fall off the cliff and coma are caused by intrigues of the Sandman.\nIt would seem what might be easier for Laura, having the absolute Power, to awaken her husband? However, being received the Power, Laura has made a commitment not to use the Power for her own benefit.  This means that she can’t help Tim to wake up. And she has 2 choices: watch how her beloved slowly dies in the hospital, or have recourse to the help of an old friend again who once helped her when she was in a coma.\nWhen Laura met an old friend (the player), she stops the time to pass by the doctors unchecked and infiltrate in Tim’s ward, and then she immerses the player into the subconscious of Tim, whose body is almost seized by the Sandman.\nThe Sandman operates under the old scheme: by sending nightmares, he suppresses the will of the victim to resist.\nWill the player have time to wake up Tim before the Sandman turns him into his heir?\nContinuation of game series;\nOriginal game world;\nMore than 40 gaming locations;\nThe world changes during walkthrough;\n12 mini-games;\nMore than 30 3D videos and cut-scenes;\nUnique meta-game on search of beholders (variation of Hidden Object’s mechanics);\nMeta-game on search of diary’s pages with prehistory of game events\n2 game modes (normal and advanced);\nAchievements system","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shaman Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18343,"name":"SOL: Exodus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/018/018f2a08b24222e2a29104b99699104c.jpg","description":"By the year 2500, Earth had become toxic and unsafe for human life.  Pollution and overpopulation had ravaged the planet, forcing humanity to the stars.  Colonies and settlements soon sprung up across the solar system, but man had not left its thirst for war behind.  Then, they learned their sun was dying, and everything changed.  Only when faced with threat greater than each other did the nations of man finally come together.  The United Colonies of SOL (UCS) was born, its first and only mission: to locate a new home for mankind, safely beyond the doomed borders of our solar system.\nSuit up and take on the role of the Lieutenant Commander, ace fighter pilot and 2nd in command of the UCS Atlas, as you search for a new home, battle a mysterious enemy, and rescue humanity from a fiery end.\nKey features:Experience an action space shooter like no other with Unreal™-powered visuals.\nEight epic missions take you across breathtaking landmarks of our solar system, including Pluto, Neptune, Triton, Uranus, Saturn, and Titan.\nUtilize the advanced weaponry of your UCS HADES space fighter, including dual gatling guns, tracking missiles and MAG cannon.\nEngage a variety of enemy fighters, bombers, drones and more as you protect civilian transports and defend installations from attack.\nTake down massive capital ships by hacking into them and revealing their weak points or turning their weapons on one another.\nLearn the origins of your shadowy foes as the plot unfolds through full voice-acted dialogue\nReplay missions to earn higher ranks and perform heroic actions to earn upgrade points which can be used to improve your fighter.\nTop your friends on Steam leaderboards and compare your medals with dozens of achievements to unlock!\nFully remappable controls support USB gamepads, joysticks, and mouse/keyboard control schemes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bit Planet Games","platforms":[{"id":0,"name":"PC"}]},{"id":14174,"name":"1... 2... 3... KICK IT! (Drop That Beat Like an Ugly Baby)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6a/b6ae4ade4d8e890bd0a061a4c09f7495.jpg","description":"Battle your favorite drum 'n' bass track, or relax as you fly through that trance album. \"Ugly Baby\" takes your MP3 music library and creates floating cities for you to explore. Ten years after the events in Dejobaan's award-winning AaaaaAAaaaAAAaaAAAAaAAAAA!!! -- A Reckless Disregard for Gravity, technology has advanced to the point where individuals can create architecture with colossal 3D printers.\nYou've taken to building giant, kilometers-long aerial sculptures inspired by your own music, and are now BASE jumping from them for sport. These jumps are all about style and timing. Buzz those girders, groove along that building, and finish with a twist for extra points, all the while listening to your own soundtrack. Ugly Baby is currently available as a playable pre-release on Steam.Key features:Play different floating worlds built from your MP3 library\nExecute stunts such as buzzes and grooves.\nTweak a city's DNA to warp them and create your own experiences.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Dejobaan Games","platforms":[{"id":0,"name":"PC"}]},{"id":11317,"name":"Vanishing Realms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3c/c3c0eadeda7dd31ab7c13bc30f5509aa.jpg","description":"Vanishing Realms: Rite of Steel is an immersive Role Playing Game designed from the ground up for Virtual Reality play.  Use one-to-one motion controls and movement so that you are fully in control of combat.  To swing, duck and block, you don't hit a button, but physically move to perform these actions as if you were there - because you are!\nTreasure chests, weapon shops, a horde of undead foes, mystic writings, banished gods, lost artifacts, ancient tombs and moonlit forest - it's all here waiting to be discovered in a beautifully hand-crafted VR realm.\n\nBattle life-sized monsters in stunning, face-to-face melee and magical combat.  Hold weapons directly in your hands, learn to block enemy strikes, seek openings in their armor and defenses and strike back.  The longer you play Vanishing Realms, the more you'll hone your physical skills.  You'll take on more powerful and advanced enemies as you move deeper into the world.\nExplore, Discover, Collect, Solve, Play.  Directly interact and move freely through a rich and varied fantasy world.  Vanishing Realms combines the long tradition of hand-crafted game design with the intuitive and immersive experiences made possible through Virtual Reality and hand-held tracked controllers.\nSurround yourself with Adventure.  Pause to take in the moonlit vista before you.  Rest beneath a gnarled apple tree - it's good to see the night sky again.  How long have you been fighting and exploring in this place? Rummage in your backpack, take a few bites of bread and cheese, drink a healing draught, think of all you've seen and...is something moving over there...on the tree line, beyond the rock outcropping?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Indimo Labs","platforms":[{"id":0,"name":"PC"}]},{"id":10790,"name":"Zula - Europe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b03/b0382142dca1159f1dbf8e8e508187e6.jpg","description":"Zula is a free-to-play online first person shooter. In Zula you will discover real unique locations as Istanbul, Northern Iraq and other places of the middle east, as well as indoor maps. Ten maps are available for now, all of them have their own particularities and offer a unique challenge. You will totally immerse yourself in the world of Zula thanks to very realistic graphics.\nAs player, you will be able to choose between two different factions of fighters: Zula, a group of vigilantes misunderstood as an organized crime syndicate and Gladyo, an international paramilitary force that has infiltrated almost every military organization worldwide.\nThe game has various game modes as for example Team Deathmatch, Capture the Flag, Free for All or Wanted, and new ones are on the way! Sixteen playable characters, inspired by popular TV heroes and with a unique background story, are available. In order to achieve an authentic feel, all character outfits and equipment are based on exact paramilitary specs. Moreover, you will have the choice between more than 150 weapons and new ones are regularly added to the game as well as items.\nEnjoy all special features of this incredible shooter and do not forget about the mission system in which you will earn fabulous prizes.\nPlay with your friends, improve your character skills, create a clan and participate in tournaments.\nZula offers you a realistic experience like you have never seen before, so don’t miss your objective, come forth and prove your bravery!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Madbyte Games","platforms":[{"id":0,"name":"PC"}]},{"id":5662,"name":"Splatterhouse (1989)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ca/9ca8199da63b2d65738e1380b2cfb48a.jpg","description":"When Jennifer is kidnapped by evil Dr. West, Rick is plunged into darkness, and finds that nightmare creatures are waiting for him. Left for dead in West Mansion Rick makes a pact with the Terror Mask to save Rick’s life in return for blood. Transformed into a brutal killer Rick pursues Dr. West on a journey through time and terror, battling hordes of the undead and risking his soul to save the woman he loves. Welcome...to Splatterhouse®.","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":3544,"name":"In Space We Brawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6d/c6db9e54e1bcb35ed2102fb1973ee928.jpg","description":"In Space We Brawl is a frantic couch twin-stick shooter in which you challenge friends in fast-paced space battles for up to 4 players.\nChoose a spaceship and a weapon: there are more than 150 available combinations! Will you humiliate your friends with a fast ship? Or will you choose shields and armor instead? Prove your skill with laser cannons and plasma swords, flame launchers, guided missiles...\nDon't be afraid to experiment! With its single player missions, the Academy will turn you into a true ace.\n8 different areas of the galaxy await, each with its own dangers: black holes, exploding asteroids, even alien nests!\nThe local multiplayer of In Space We Brawl is both exciting and unforgiving. Play in a free for all or in teams, you can even put a bounty on your rivals' heads! Are you ready to brawl?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Forge Reply","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2943,"name":"The Treasures of Montezuma 4","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e65/e65f6f53060001d7a079a2370a4eae12.jpg","description":"Darkestville Castle coming soon\nSpecial offer for Steam owners of Montezuma 4!\nOnly for the owners of Treasures of Montezuma 3 and 4 on Steam we grant an additional 50% discount for the Treasures of Montezuma 5 till the 31st of March!\nhttp://store.steampowered.com/app/443370/\nAbout the Game\nFree the gods’ powers and fulfill your destiny in the Treasures of Montezuma 4!  This new tile-matching puzzle game is overflowing with mystery and excitement!  Follow the story of Anna, who travels to an Aztec ruin to uncover an ancient secret. The journey is loaded with tons of levels, three all new game modes, and an epic boss battle that you will never forget!\nWith three all new game modes to play through, your trip to the jungle is going to last awhile!  You are not alone on this journey – the powerful totems will help you in your advantage unleashing their powerful magic! Each adventurer will have his own place of worship and power fulfillment – the Ziggurat that you can raise and grow. Learn the hidden powers of gods, upgrade your character all the way to level 100 and grab every achievement you can along the way!  Unlock the secrets of Emperor Montezuma today!\n-  Three all-new game modes\n-  98 Story Mode levels and 69 Quest Mode levels\n-  Epic boss battle in Story mode\n-  Seven powerful totems and eight unique bonuses\n-  Build and decorate a Ziggurat\n-  Upgrade your character to level 100\n-  Tons of in-game achievements","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":1459,"name":"Soul Axiom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2f/c2fed76b6866bc74d6ad24d5d1a62168.jpg","description":"IN A NUTSHELLFrom the studio that brought you Master Reboot comes a first-person story-driven adventure puzzle game, set in the beautiful, haunting cyber-world of Elysia. Collect unique hand powers, discover multiple endings and choose your own destiny as you unravel the mystery of your digital afterlife.THE GAMEExplore Soul Axiom’s rich environments and immersive story to unravel the mystery of your life, and your digital afterlife. You will be taken on an intriguing voyage of discovery, through beautiful, haunting locations, facing challenges that will lead you into danger on your mission to unlock your identity, your story, your mystery. But beware: some mysteries are better left unsolved.SYNOPSISTake your first steps to paradise by uploading your soul to Elysia, named by critics as “the single most important development in the history of the human race” (Era Magazine, 2027). As the latest state of the art Digital Soul Provider, Elysia is a sprawling server where your memories and dreams become reality. Our patented SoulSync system allows you to choose the memories you want to enjoy for eternity; whether you are a living user or you simply wish to leave a lasting testament of your life that the whole family can relive at their leisure.\nIn Elysia, death has no dominion. In Elysia, life has no boundaries. Cast off your mortal shackles and discover the secret to immortality in your digital afterlife.\nDiscover Elysia. Then, now and forever.THE FIRST 5 MINUTES OF THE GAMEWhen you begin the game you are free falling through a storm. Lightning sporadically illuminates the sky, showing brief, vivid flashes of memories. Your memories. You struggle to take a breath as you plummet, out of control, into the eye of the storm, towards your certain death.\nSquinting, eyelashes battling the rain, you catch a glimpse of a large object that you are hurtling towards. You brace yourself for impact, for death, confused and terrified and –\n\nYou are on the deck of a ship, rain pummelling the wooden boards around you. You look up to see four shadowy figures on the bridge, gazing into the distance, with an old man at the helm.FEATURES• Psychological Adventure with Exploration & Puzzle elements: Interact with a variety of cryptic logic and action puzzles, find clues and explore memories to unlock the secrets of your identity.\n• 20 to 30 Hours of Gameplay: The game is packed full of content with 6 chapters, 40 unique locations, over 100 puzzles and 63 Steam Achievements, expect over 20 hours of captivating gameplay.\n• Collectible Hand Powers: Harness the abilities of Elysia. Discover new powers that will assist exploration and puzzle solving by phasing, building, destroying or corrupting the digital world around you.\n• Multiple Story Endings: A tense, but thought-provoking narrative with multiple outcomes, and leaves you yearning to explore all avenues of the lore.\n• Unique visual style: There is a beautifully simplistic emphasis on striking shapes, strong colors, and beautiful effects and lighting to elicit a variety of emotions within The Elysia.\n• Dynamic adaptive environments: Use your abilities to manipulate your surrounding environments. Collect your powers and re-visit memories to unlock previously hidden areas.\n• Haunting Soundtrack with 50 original compositions: Provides the perfect musical backdrop which subtly enhances the game through well-crafted association with the memories you explore.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wales Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":694432,"name":"Genkai Tokki: Moero Chronicle","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e97/e97a6bbdcfe0107ca907654eec8ff67d.jpg","description":"Io is a simple young man with only one problem he cant talk to women! Any attempts at conversation are destroyed by his perverted mind, except when he talks to Lilia, his best friend and a Monster Girl.\n\nHowever, that becomes the least of his problems when hes tasked with going to the dangerous region of Monstopia. There, Monster Girls have begun rampaging, causing wanton pain and destruction. Have the Monster Girls simply gone mad, or is there an even greater evil afoot? Find out in this moe-filled dungeon RPG!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Idea Factory","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"}]},{"id":397479,"name":"Axiom Verge 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6dc/6dc4ec76604e76d9be069242be228a14.jpg","description":"The long awaited sequel to Axiom Verge, Axiom Verge 2 expands on the universe with completely new characters, abilities, and gameplay.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Thomas Happ Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":331090,"name":"Gal*Gun: Double Peace","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec9/ec976c121303bf5ee8a3277e8e965301.jpg","description":"When Houdai is shot by cupid angel Ekoro, he becomes immensely popular and suddenly every girl at the academy becomes hot for him. But being irresistible is hardly a dream come true! Every love letter, shout of adulation, and advancing kisses drains his energy! And worse - if he doesn't find his one true love by the end of the day, he will become cursed and forever alone!\n•Gorgeous anime-styled rail-shooter action. Use your targeting cursor to fend off the advancing girls!\n•Story Mode: Play through the story and see if you can successfully confess your feelings to the girl of your dreams.\n•Score Attack: Play specific levels to achieve the highest scores.\n•Collection: Take a look at your achievements, image gallery and information on all the lovely ladies at the Academy!\n•Choose your own love interest. Your choices will change the story and the path you take throughout the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Inti Creates","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":263580,"name":"Lost Saga NA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69b/69b6dcf58a16bf81283941f04df9d6b9.jpg","description":"Part fighter, part brawler and made from pure awesomeness, Lost Saga is an action-packed beat-em-up styled game that will take your skills and push them to their max! Switch from over 60 heroes on the fly, letting you create an endless amount of combos!\nGame Modes\n•\tDeathmatch – An 8 player free-for-all where you fight for the top spot!\n•\tTeam Match – A 4v4 styled Deathmatch mode where coordination counts.\n•\tPrisoner – Hog-tie your enemies and free your allies in this team oriented mode.\n•\tChampion – A classic 1v1 arcade-styled fighter!\n•\tPower Stone – Protect your team’s stone, while destroying your enemy’s!\n•\tBoss Raid – Transform into a massive boss and destroy all of your foes!\n•\tFaction War – Opposing forces clash together! Which team will you side with?\n•\tFaction Elite – The best teams from Faction War compete amongst each other!\n•\tCrusade – Journey with your friend into an epic labyrinth of doom!\n•\tAdventure – An evil claims the land, travel with your friends to rid the corruption! (Coming Soon).\nKey Features:\nOver 60 Unique Heroes\nAn ever-growing roster of Heroes that range from the legendary King Arthur, to the infamous Robin Hood, there's no telling which Heroes you'll choose to master first! Pick between melee, magical, or ranged heroes to duke it out with your friends and enemies!\nHero Switch Combos\nTired of being limited to one combo skillset? In Lost Saga, every Hero has their own skills and combos. Swap your Heroes in and out in mid combo, unleashing a dizzying amount of chain combos! What kind of combinations will you create?\nCharacter Upgrades\nLevel up each of your characters and choose what each of their strengths will be! Create a lightning fast Kage Ninja or create a rampaging Barbarian, the choice is yours!\nMix and Match Gears\nYou are what you wear! Each character has four basic Gear (armor, helmet, weapon and trinket) that form their basic skill set. You aren't limited to those skills though, as you can equip gear from other Heroes, creating your own custom tailored Hero!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"IO Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":58297,"name":"STAR WARS: Episode I Racer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2be/2be684e719a764934155037f0b54ab48.jpg","description":"Two Engines. One Champion. No Limits.\nClimb on, strap in, and experience the pure adrenaline-pumping excitement of the Podracing sequence from STAR WARS™: Episode I The Phantom Menace.\nTake the controls as Anakin Skywalker, or any one of over 21 Podracers, and feel the full-force blast of two massive jet engines at simulated speeds of up to 600 mph. Rein in a turbine-driven chariot through 8 spectacular worlds. Negotiate through flaming methane lakes, Tusken Raider assaults, ant-gravity tunnels and much more in a pulse-punding, do-or-die fight to the finish where anyone will do anything to cross the finish line. How far will you go?Relive all the thrill and excitement of the Podracer sequence from STAR WARS™: Episode I.\nHang on tight - with afterburners on, Podracers max out at a simulated 600 mph!\nRace in furious competition against 21+ opponents.\nTake on over 21 tracks on 8 unique worlds!\nAvoid hazards such as methane lakes, meteor showers and Tusken Raiders.\nSpectacular 3D environments.\nVehicle sound effects and epic soundtrack taken directly from Episode I.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Dreamcast"}]},{"id":51112,"name":"Veritex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb0/bb0f50518ff126011cfb57767d0bbea3.jpg","description":"Veritex is an Indie startup game made by Veritex Studios LLC.\nVeritex is a multiplayer survival game based around the concept of super powers (Spells), and massive world bosses. The goal is to get players to fight it out and see people build up mega bases and fight it out on the map.\nSome of the features already implemented:\nChat System\nTribe System\nStructure System - Thatch, Wood, Stone, and Metal.\nResource Gathering System\nCrafting System\nStructure system with working structure types:\nThatch\nWood\nStone\nMetal\nTribe system\nCrafting system\nResource gathering\nAnimals:\nChicken\nCat\nDog\nWolf\nPig\nCrocodile\nCow\nFox\nBear\nGoat\nBoar\nRabbit\nPig\n10km x 10km open world map filled with different animals, and different resources you can gather.\n30 different craftable items such as different armors, weapons, structures and more.\nFood Spoilage\nCooking\nTemperature System\nWeather System\nMelee Combat System\nSmelting System","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Veritex Studios","platforms":[{"id":0,"name":"PC"}]},{"id":44828,"name":"Offensive Combat: Redux!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d6/4d66ca5326ceefbee7b03ec4cfaf7972.jpg","description":"Offensive Combat: Redux! is a fast-paced, frenetic online FPS game that lets you show your skill and play as a number of different unique characters including Commandos, Aliens, Geckos, Chickens, Orcs, Pirates, Disco Stars, and more! Gear up with dozens of insane weapons and take on Killer Robots in single player mode. Test out new weapons in the Weapon Range, then explore the maps to get yourself ready for multiplayer.\nTeam up in Team Deathmatch and Capture the Flag, or jump into the chaos of a free-for-all round of Deathmatch. With 6 very different maps at launch and multiple modes, Offensive Combat: Redux! is a unique, funny, FPS game that you won't want to miss!\nEarn XP to unlock weapon upgrades, better melee weapons and fun grenades. Earn coins to spend on new avatar parts, or pwn your opponents for random loot drops of avatar parts. And best of all, there's No Micro-Transaction BullS**t!Features6 Maps (with more in the works)\nWeapons, Weapons, Weapons - Assault Rifles, Sniper Rifles, SMGs, Shotguns, Handguns, Melee Weapons\nHundreds of Avatar Parts - Show your unique character as you chose from more than 40 character heads, chests, legs, arms and feet and more than 1,000 combinations at launch\nPower-ups – find time-limited power-ups in game including Chainguns, Armor, Double Damage, Rocket Launchers, and more\nMultiple Pwns- Teabag your enemies after you kill them for extra rewards and random drops\nMultiplayer Game Modes\n-Deathmatch (2-12 Players)\n-Team Deathmatch (4-16 Players)\n-Capture the Flag (4-16 Players)\nSingle Player Modes\n-Killer Bot Mode\n-Map Exploration Mode\n-Weapon RangeCurrent Map List-Burninator - A lava filled citadel in ruins. Grab some armor and get to the top of the map for the best vantage point\n-Courtyard - An Asian temple with Dragon Statues and Koi ponds that keeps you moving\n-Dry Run - A desert themed town that features plenty of sniping spots and three paths that make this a favorite for Capture-The-Flag games\n-Probetown - The Aliens have landed in suburbia and they're beaming you up to pick up power-ups like armor and the Chaingun!!\n-Slums - A run down section of a city that features sniping spots and close quarters choke points as well as all of the power-ups and ammo crates\n-Turbine - A futuristic energy plant with multiple towers and lots of places to battle it out","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Three Gates","platforms":[{"id":0,"name":"PC"}]},{"id":40201,"name":"Pro Evolution Soccer 2011","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ba/0ba168668c0c1bde5459d05b1883420a.jpg","description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, French. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   Pro Evolution Soccer has always been regarded as the quality soccer title, but PES 2011 has undergone the most important improvements made to date. Key features include total freedom over every action, a complete overhaul of all animations and the Master League mode is now online!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":20235,"name":"GASP","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/445/44509a8b66b56f5ae50cba731c4dfecc.jpg","description":"This game takes place in the same universe as our upcoming tittle Secluded; you take control of a lone astronaut that lands on the surface of a planet, miles away from the other members. And it’s your job to meet up with the other astronauts.\nThis game is based on constantly moving, as your suit leaks oxygen at random times. You must also avoid hazards that accrue on the planets, such as falling debris and asteroid strikes. This game is Free to play and experimental in some ways. We want the player survive in their own way and not have the game hold their hand through the experience, the games objectives are randomized so the locations change each time you play, and once you die that's it.\nFEATURES\n. Gravity Effects\n. Randomized Endings\n. Asteroid Strikes & Hazards\n. First Person Experience and Future VR Plugins","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dark Day Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":17856,"name":"Grandia II Anniversary Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8da/8da2a8e6081116a9016852b31f92faf1.jpg","description":"15 years after the stunning Dreamcast debut of Ryudo and his epic adventure, Grandia II is back and better than ever! The classic Japanese RPG returns with enhanced visuals, new difficulty level, and features both keyboard and gamepad support!\nTake the role of a hardened mercenary with a heart, and go on an epic adventure filled with magic, new friendships, and surprising storyline twists in search of a weapon once wielded by a deity. It’s the classic tale of a band of adventurers destined to save the world, but things are not always as they seem…\nGrandia II is famous for its great characters, mature storytelling, memorable music and fantastic battle system, and there's no better way to experience one of the most beloved console RPGs of the 32-bit era than this special Anniversary Edition!\n* Visual upgrades to textures, lighting, and shadows\n* Original Japanese voice option\n* Additional difficulty level\n* Gamepad support\n* Steam Trading Cards\n* Steam Achievements\n* Steam Cloud Save Support\n* Selectable Video Options\n* Remapable Keyboard & Gamepad Support\n* 100 Save File Slots\n* Dreamcast VMS Save File Support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GAME ARTS Co","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]}]