[{"id":343597,"name":"Sonic Adventure 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4f5/4f57124f7c0285150626cd1411c45b6e.jpg","description":"In the fight between heroes and villains, will you choose to save the world or conquer it?  The hunt for the Chaos Emeralds is on and battle lines have been drawn between Hero and Dark. Experience two unique adventures featuring both long-time heroes and new and returning villains as they battle for the fate of the world!   Sonic Adventure™ 2 makes its return on Xbox LIVE Arcade with a full cast of playable heroes and villains, exciting two-player competitive modes, Chao Gardens, and more than 30 action-packed stages, all remastered in HD!","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Sonic Team USA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"GameCube"},{"id":0,"name":"Dreamcast"}]},{"id":10270,"name":"100% Orange Juice","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c68/c68b8a31313d8945d675fa8862198d14.jpg","description":"100% Orange Juice is a digital multiplayer board game populated by developer Orange Juice's all-star cast. Characters from Flying Red Barrel, QP Shooting, Suguri and Sora come together with all-new characters to duke it out... with dice.\n\nThis is a world where dogs, people and machines fly through the air. In that world, a small patch of darkness was born. Infinitesimal at first, it gradually began to envelop everything...\n\nA youth named Kai, led by the mysterious life form known as Marie Poppo, begins a journey that will span worlds. The black, bottomless darkness of desire slowly eats away at both Kai and the world itself...\n\nLet Marie Poppo lead you into a mysterious world to play. Grab your deck of cards and let the games begin!Features:Dice, cards, stars, battles and pudding\n4 Single-player campaigns\nPlayable by up to 4 players online\nCountless battle combinations\nUtilize each character's unique combat attributes\nMore than 50 different cards to collect\nCharacter abilities in the form of Hyper CardsNew Steam Features:Full HD support\nRedesigned multiplayer experience using Steam's lobby system\nSpectator mode\nAvatar customization\nNew character skins to unlock\nVAC enabled\nCustom language support","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Orange_Juice","platforms":[{"id":0,"name":"PC"}]},{"id":49225,"name":"DRAGON BALL FighterZ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/96b/96b9420bbd4bd1b79bf2a67f7779733a.jpg","description":"Pre-Purchase Offer\nPre-order and receive early character unlocks to SSGSS Goku and SSGSS Vegeta, 2 exclusive lobby avatars, and 3 stamps.\nFighterZ Edition\nThe FighterZ Edition includes the game and the FighterZ Pass, which adds 8 new mighty characters to the roster.\nUltimate Edition\nThe Ultimate Edition includes:\n• The game\n• FighterZ Pass (8 new characters)\n• Anime Music Pack (11 songs from the Anime)\n• Commentator Voice Pack\nAbout the GameDRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its all-powerful fighters.\nPartnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay.\nHigh-end Anime Graphics\nUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force.\n3vs3 Tag/Support\nBuild your dream team and sharpen your skills to master high-speed tag combinations.\nThrilling Online Features\nRanked matches, interactive lobby, crazy 6-player Party Match... There is something for every taste!\nExclusive Story Mode\nDiscover a never-seen-before scenario featuring Android 21, a brand new character whose creation was supervised by Akira Toriyama himself.\nSpectacular Fights\nExperience aerial combos, destructible stages and famous scenes from the DRAGON BALL anime in 60FPS and 1080p resolution!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":19640,"name":"Assassin's Creed: Director's Cut Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b1/4b11e8fc75e054939c29e7319a643600.jpg","description":"Assassin’s Creed is an action-adventure game that follows the confrontation of the Assassins and the Templars. It’s the first installment in the series, followed by several standalone titles and DLCs. Director’s Cut Edition is the extended version of Assassin’s Creed with more investigation options and several new missions. \n\nThe game’s world is split between the modernity and the time after the Third Crusade when the main action is set. You play as Desmond Miles, a descendant of an assassin named Altair Ibn-La'Ahad. You need to step into the war over the Apple of Eden. With the Animus machine Desmond’s mind is sent to the past and you take control of Altair. The game missions are in fact a series of assassinations you need to carry out.\n\nAssassin’s Creed is set in an open world with three main cities: Jerusalem, Acre, or Damascus. In every city you get information about your target and can complete side quests. You upgrade Altair with new weapons after each successful assassination. The protagonist is also very skillful and has the Eagle Vision ability to highlight all visible characters either they are targets, enemies, allies or neutrals. This option is only available when the health bar is full.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PC"}]},{"id":18712,"name":"Dear Esther","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc6/bc6b163403504d0c041253749e233ed3.jpg","description":"Dear Esther is a game that questions the very concept of a \"game\" as an entertainment. It is more of an art project that was originally started as a mod on the Source engine (the one Half-Life 2 is based on). The player assumes the role of a nameless and faceless character, a man, who wanders around a cold island at the shores of Scotland. When you enter certain parts of the island, the main character reads aloud his letters from the past, revealing his tragic story. All other characters, including the protagonists’ wife Esther, are only mentioned by the narrator and do not appear in the game. There's very little actual gameplay, and your goal as a player is to explore the island and discover as many parts of the backstory as possible. The goal of the game is to follow the story, immerse yourself in the experience and pass it through your emotions.\n\nDear Esther is famous for its visual design and sound: there are gorgeous natural landscapes (the caves in particular), ambient sounds, and music. Melancholic mood and darkened landscapes befit the story that is all about loss and grief.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sumo Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1854,"name":"Costume Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b4/2b47c5edfeea2970eeb44d1f8cbd562d.jpg","description":"Costume Quest is a Halloween adventure from Tim Schafer's Double Fine Productions. In this charming role-playing game, choose your hero and trick-or-treat through three beautiful environments full of Double Fine humor and story. Complete quests, build your party, and collect costumes along the way that allow you to transform into powerful champions and take down the evil Repugians. This heroic holiday tale will capture the imaginations of kids and kids-at-heart.\nContinue the Costume Quest adventure with the Grubbins on Ice DLC pack, included free in the PC version! Face new enemies while collecting additional quests, costumes, battle stamps and creepy treat cards. Help the monsters overthrow Araxia to bring peace back to Repugia!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":43734,"name":"State of Decay 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/20a/20a1892c6dbe9b820a2f0d79f9ed47a2.jpg","description":"State of Decay 2 is an open-world zombie-themed survival game with RPG elements, the second installment in State of Decay series.  \n\n###Gameplay \nIn State of Decay 2, you take a role of zombie-apocalypse survivor. After the tutorial, you can choose one of three maps to explore.\nThe goal of the game is to clear the maps from Plague Hearts – sources of Blood Plague disease that makes zombies more aggressive and dangerous. The world is entirely free to explore. Throughout it, you come across survivor’s bases that you can upgrade with different facilities such as kitchens, gardens, workshops and many more. During the game you are also going to meet new survivors, that would join you and become playable. Each survivor has its progression system with numerous stats to upgrade and abilities to unlock. The death in the game is permanent for every survivor. The game offers many unique items and weapons, both ranged and melee, to fight zombies and hostile survivors. The ammunition for firearms is limited therefore frequently it’s better for players to avoid combat and use stealth and distraction items rather than brute force. One of the game’s most notable features is the full-fledged cooperative multiplayer support that allows groups of up to four players to go through the entire game.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Undead Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9880,"name":"Oxygen Not Included","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/000/0002b2686a50b30762fb6040a8d9187f.jpg","description":"In the space-colony simulation game Oxygen Not Included you’ll find that scarcities of oxygen, warmth and sustenance are constant threats to your colony's survival. Guide colonists through the perils of subterranean asteroid living and watch as their population grows until they're not simply surviving, but thriving...\nJust make sure you don't forget to breathe.\n\nBuild Extensive Bases and Discover What it Takes to Survive:\nEverything in your space colony is under your control, from excavation and resource allocation right down to plumbing and power systems. Resources will begin depleting with your first breath, however, so be sure to dig fast if you want to live.\nI\nt’s Mind Over Matter with Stress Simulations:\nKeep the psychological impact of survival at bay with fun leisure activities, great accommodations and even better food for your colony. Duplicants each have different and potentially destructive ways of reacting to stress, so be sure to always keep them happy. Whatever the cost.\n\nAvoid Boiling with Thermodynamics:\nTemperature control is a constant concern in space; too cold and you'll freeze, too hot and you'll fry. Keep tabs on ambient environmental temperatures and your colony's heat production to maintain a nice, cozy atmosphere for your colonists.\n\nEnhance Efficiency through Complex Gas and Liquid Simulations:\nCreate interlocking pipe systems to swiftly deliver fuel and liquid to critical areas of your base. Plan well and be rewarded as your colony transforms into an imperishable, well-oiled machine.\n\nTake Charge with Power Grid Simulations:\nChoose from a multitude of power sources including coal, hydrogen, natural gas or just plain old elbow grease. Manage power runoff, circuit overloads and meltdowns to keep your colony running smoothly.\n\nAlways Keep Yourself Breathing:\nEnter the Oxygen Overlay and watch air moving through your base in real time. Monitor carbon dioxide accumulation and oversee oxygen generation processes to mold your colony into a veritable deep-space oasis.\n\nWaste Nothing through Extreme Recycling:\nMake use of every last resource for a base that truly exemplifies efficiency. Recycle waste into precious fuel, process unbreathable gas into air or harness the natural bodily processes of wild creatures for food. If you’re clever, you might even be able to run a base off colonist farts.Explore Diverse, Procedurally Generated New Worlds:\nSummon new worlds with a push of a button. Experience tons of untamed space rocks, then suffocate to death in them!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5403,"name":"Flower","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bc/4bc75319da5601d337452ca0462255ab.jpg","description":"Flower is a puzzle game developed by thatgamecompany. It is a spiritual successor to thatgamecompany's Flow.\n\nThe players control the wind that picks up flower petals. You begin having only one flower petal in the air and your goal is to collect more and more petals as you go. Flying close to different flowers will get you more petals. The game's world is highly interactive as sometimes when you get more flower petals, world side-effects could occur. For example, dead flower fields can come back to life again, blossoming with vibrant colors or a windmill can begin to turn with the wind. There are no text or dialogues in the game. The developers put a strong emphasis on that Flower was not supposed to be a challenging game. The focus was that the game should arouse positive emotions using visual representation, music, and emotional clues.\n\nThere are six levels in Flower. Each level begins with a flower in a pot by the window of the flat in some unnamed city. There are no enemies and time limits in the game. It is impossible for the player to lose.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":10108,"name":"Portal Knights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/999/9996d2692128d717880d2be9f9351765.jpg","description":"Leave the familiar world behind and step into the fantastic unknown with Portal Knights, a cooperative 3D sandbox action-RPG! Level up your character and craft powerful gear to defeat your enemies in real-time tactical combat. Explore dozens of randomly-generated islands and restore peace to a world torn apart by The Fracture.\nCraft your adventure. Forge your hero. Become the ultimate Portal Knight!Key Features\nTravel between randomly generated 3D sandbox worlds.\nTraverse unique environments, meet unique NPC characters, discover creatures and resources for crafting. Explore caves, lakes and dungeons filled with surprises.\nTactical action combat.\nStrike your foes and dodge their attacks in fast-paced 3rd-person battles. Outwit each enemy’s unique AI and choose from an assortment of weapons and spells to defeat them!\nRPG character classes including warrior, ranger and mage.\nPlay as a Warrior, Mage or Ranger and customize your appearance, abilities, and gear. Unlock powerful talents as you level up!\nRandom Events.\nAdventure in ever changing landscapes. Complete new quests and earn exclusive items in random events across the worlds.\nMine and gather resources from across the lands to craft your arsenal and supplies.\nUpgrade your crafting stations and expand your recipe list to 100+ items, including crafting trees for each class.\nBuild your home using dozens of materials and furnishings.\nHarvest resources and build grand structures, craft unique furniture, adopt a pet companion and more!\nEpic boss battles.\nFace off against the Portal Guardians, the most formidable beasts in the realm, in their twisted arenas.\nJoin your friends in 4-person cooperative multiplayer or 2 player split screen.\nWork together on the same island to build structures, explore dungeons, and overcome the toughest perils or play separately on different islands.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":12073,"name":"The Secret of Monkey Island: Special Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/656/65654f69256420c0126eb506c1a72d7f.jpg","description":"Back by popular demand, The Secret of Monkey Island™: Special Edition faithfully re-imagines the internationally-acclaimed classic game (originally released in 1990) for original and new audiences alike. The development team at LucasArts is bringing the game into the modern era with an all new re-imagined contemporary art style, a re-mastered musical score, full voiceover, and an in-depth hint system to help players through the game’s side-splitting puzzles. Purists will also delight in the ability to seamlessly switch between the updated hand-drawn re-imagining and the original classic version.\nThe game's twisty plot leads our naive hero on a hilarious, swash-buckling search for the fabled secret of Monkey Island. Tales of pirate wealth lure him to the port of Mêlée with high hopes, no money, and insatiable curiosity. If clever enough, he will win the confidence of Mêlée's pirates and find himself blown by the winds of fate toward the terrifying and legendary Monkey Island -- an adventure that would chill the bones of even the most bloodthirsty buccaneer.\n\nRelive the swashbuckling humorous misadventures of the wannabe pirate Guybrush Threepwood\nGo on a daring adventure in your attempt to become the most infamous pirate in the Caribbean\nWin the heart of the beautiful governor, Elaine Marley\nAlong the way, confront the evil ghost pirate, LeChuck\nPlay it again for the first time\nAll new re-imagined contemporary art style, hand-drawn to feature animation quality\nRe-mastered music score presented in full orchestrated detail\nComplete voice over using the original Monkey Island™ franchise cast brings the story and characters of the original adventures to life like never before\nScene-for-scene hot swap allows for seamless transition between special edition and classic modes anywhere and at any time\nIncludes all new features\nAll new intuitive game interface and controls provide a more interactive gameplay experience\nIn-game puzzle hint system keeps the puzzles fresh and fun\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10390,"name":"Pixel Puzzles Ultimate","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab0/ab012b3fe017ab1dad34c7936200d24c.jpg","description":"Pixel Puzzles Ultimate, Bringing puzzles to the digital age.\nWith more than 17 FREE puzzles included, Pixel Puzzles Ultimate has a large range of puzzles in various sizes for you to try out and enjoy.\nWith piece counts from 96 to a mega 1000 pieces. Pixel Puzzles Ultimate brings you full size professional puzzles to the digital market place. No longer will a puzzler be left looking for that last piece, never again will the kitchen table be covered in tiny wooden shapes.\nFrom square to rectangle to huge panorama pictures, with a massive variety of separately themed puzzle packs containing only the best images possible, each having a unique cut like no other jigsaw could. Pixel Puzzles Ultimate gives you the choice to play only the types of puzzles you really want to build.\nIt's a new way to puzzle, customize the game the way you want, with a full range of options to tweak the game as you see fit. Multiple themed play environments, all fully customizable for you to fine tune the jigsaw puzzling experience you’re looking for.\nPixel Puzzles Ultimate, the definitive jigsaw puzzler for the PC platform.FEATURES:Full range of sizes from 96 to 1000 pieces.\nBeautiful puzzle images.\nAuto saving, never lose your progress.\nPeaceful puzzling atmosphere.\nTraditional puzzle gameplay.\nMany customization options.\nMultiple interactive play environments.\nPower ups to help solve puzzles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":447,"name":"LEGO Harry Potter: Years 1-4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/694/6940fa3fbe0d836e4a272c468e65e480.jpg","description":"Build the adventure from Privet Drive to the Triwizard Tournament and experience the magic of the first four Harry Potter stories – LEGO style! Explore Hogwarts™ School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures like never before with tongue-in-cheek humor and creative customization that is unique to LEGO videogames!\nKey Features:\nThe Magic is Building!\nConnect the bricks from the Privet Drive to the Triwizard Tournament and experience the magic of the Harry Potter™ adventures – LEGO style.\nPlay as Harry, Ron, and Hermione as well as other favorite characters.\nExplore Hogwarts™ castle, Diagon Alley™, the forbidden Forest, the village of Hogsmeade™ and more.\nCast a spell with a friend and play through the first four stories as a team with Co-op play.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":548036,"name":"Loop Hero","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cef/cef4c326dd57a8f39d696379eaa84411.jpg","description":"The Lich has thrown the world into a timeless loop and plunged its inhabitants into never ending chaos. Wield an expanding deck of mystical cards to place enemies, buildings, and terrain along each unique expedition loop for the brave hero. Recover and equip powerful loot for each class of hero for their battles and expand the survivors' camp to reinforce each adventure through the loop. Unlock new classes, new cards, and devious guardians on your quest to shatter the endless cycle of despair.\r\n\r\nInfinite Adventure: Select from unlockable character classes and deck cards before setting out on each expedition along a randomly generated loop path. No expedition is ever the same as the ones before it.\r\n\r\nPlan Your Struggle: Strategically place building, terrain, and enemy cards along each loop to create your own dangerous path. Find balance between the cards to increase your chances of survival while recovering valuable loot and resources for your camp.\r\n\r\nLoot and Upgrade: Strike down menacing creatures, recover stronger loot to equip on the fly and unlock new perks along the way.\r\n\r\nExpand Your Camp: Turn hard-earned resources into campsite upgrades and gain valuable reinforcements with each completed loop along the expedition path.\r\n\r\nSave the Lost World: Overcome a series of unholy guardian bosses over a grand saga to save the world and break the time loop of the Lich!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Four Quarters","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":16003,"name":"Baldur's Gate II: Enhanced Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0a/e0abaefbcc99ef995be57d857806f2d2.jpeg","description":"Baldur's Gate II: Enhanced Edition is a role-playing game, a remake of 2000 title Baldur’s Gate II: Shadows of Amn and its expansion Throne of Bhaal.  \n\n###Setting and plot \nThe game takes place in Forgotten Realms, one of the most popular settings in Dungeons & Dragons franchise. The game’s plot is almost identical to the original game; however, the remake adds a new character, new quests, and some new locations. The new characters from Baldur’s Gate: Enhanced Edition also appear in this game.  \n\n###Gameplay \nThe gameplay is based on 2nd Edition Advanced Dungeons & Dragons. The game begins with character creation where the player can choose appearance, race, class, ability scores, and alignment. The game mostly consists of exploring the game world, interacting with NPCs, completing the quest and fighting with various enemies. The battle system in the game reconstitutes that of Dungeons and Dragons table. During the game, you can come across numerous characters that would like to join your party helping you in battles and with some quests. \nThe Enhanced Edition brings some new features aside from new characters, quests, and locations. The game now supports wide-screens and high resolution. The cross-platform multiplayer allows up to six players on different platforms play cooperatively.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BioWare","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":10180,"name":"Wizard of Legend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b25/b258a515226ab56c46ac8619cacb8f26.jpeg","description":"Become A Wizard Of Legend!\nWizard of Legend is a fast paced dungeon crawler with rogue-like elements where you assume the role of a powerful wizard intent on overcoming the Chaos Trials to become the next Wizard of Legend.Story\nEvery year in the City of Lanova, the Council of Magic, comprised of the most powerful wizards in the world, holds the Chaos Trials to determine if there are any worthy of becoming a Wizard of Legend. The contestant that successfully navigates all of the challenges and demonstrates superior wizardry earns the right to become a Wizard of Legend!Gameplay\nBattle your way through each challenge by defeating powerful conjured enemies! Collect valuable spells and relics and build up your magical arsenal to fit your playstyle! Achieve mastery over magic by chaining spells together to create devastating combination attacks! Face each council member in combat and earn your right to become a Wizard of Legend!FeaturesFast Paced Spell Slinging Combat\nUse powerful spell combinations to destroy your enemies\nProcedurally generated levels mean a new challenge every time\nTons of spells and items to fit your playstyle\nA variety of unlockable wizards to discover\nLocal multiplayer allows you to play with or against a friend\nGamepad and controller support for most major devices","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Humble Bundle","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":17169,"name":"The Ship: Murder Party","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a46/a46801970d3b30d7fc63d6db72b3dc0e.jpg","description":"The Ship: Murder Party is a first-person shooter video game made with Valve Corporation Source engine. The first playable concept of The Ship was released as a modification for well-known and famous video game Half-Life 2. \nThe year is 1920. The setting is a cruise ship where each player has the mission to secretly murder other player when nobody is watching. Also, despite the killing the player has to be aware of their own hunters. \nThe story is about a man called Mr. X, who has handed free tickets for players in his cruise ship. Of course, the player's characters don’t know that once they are on the ship they will have to kill other passengers and if a passenger chooses not to do so the Mr. X will kill him or her immediately by feeding him or her to sharks. \nThe Ship has single-player and multiplayer modes. In single-player, the player gets the role of second class passenger named Charlie Panther who is welcomed by Mr. X talking about his requirements for the passenger which includes killing other people on the ship. In multiplayer mode each player gets a nickname and has the objective to kill certain person on the ship.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Outerlight","platforms":[{"id":0,"name":"PC"}]},{"id":326236,"name":"Spiritfarer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/727/727f889060e688bbdcba7b2a5d26a603.jpg","description":"What will you leave behind?\r\nSpiritfarer  is a cozy management game about dying. You play Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. Farm, mine, fish, harvest, cook, and craft your way across mystical seas. Join the adventure as Daffodil the cat, in two-player cooperative play. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?Features:\r\nEnjoy beautiful hand-drawn art and animation.\r\nBuild, manage, and improve your own ferry.\r\nFarm, mine, fish, harvest, cook, weave, craft! An endless variety of activities await you!\r\nMeet, take on board, care for, and forge relationships with a cast of memorable characters.\r\nRun, jump, and glide your way through elegantly constructed platforming levels.\r\nExplore a fantastic and imaginative world. Seek and gather resources to craft upgrades for your ship and gifts for your passengers.\r\nExperience moving, emotional stories filled with unforgettable moments.\r\nUnwind for hours into cozy and relaxing gameplay. 30 hours to finish, hundreds more to experience everything Spiritfarer has to offer.\r\nMake the adventure your own with rich customization options for your boat, character, even the cat!\r\nPlay as Daffodil the cat in optional local co-op.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Thunder Lotus Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":58085,"name":"Jurassic World Evolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ea6/ea6d85ea0239943ff31a86097fb3fbc3.jpg","description":"Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in an uncertain world where life always finds a way.\nBioengineer dinosaurs that think, feel and react intelligently to the world around them. Play with life itself to give your dinosaurs unique behaviors, traits and appearances, then contain and profit from them to fund your global search for lost dinosaur DNA.\nControl the big picture with deep management tools or go hands-on to confront challenges on the ground or in the air. Expand your islands and choose your own journey in an all-new narrative featuring iconic characters from across the franchise and decades of Jurassic lore at your fingertips.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":10715,"name":"Hearts of Iron IV","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b6/2b6e8f8efaa2499e9a3a09dc76028d44.jpg","description":"Death or Dishonor!Death or Dishonor is a new Country Pack for Hearts of Iron IV, and expands upon players’ ability to experience history’s greatest conflict from any point of view. This new pack focuses on the countries caught between the Soviet Union and Nazi Germany during World War II -- faced with the tough choices of starting a conflict with a global superpower or compromising their ideals to strike a deal for their own survival.\nIncluding new National Focus Trees for Hungary, Romania, Czechoslovakia, and Yugoslavia, Death or Dishonor adds new unique events, nation-specific art and music, and much more, giving players all-new ways to experience -- and change -- the course of history.\nDeath or Dishonor includes:Four New Focus Trees:Experience the war from the difficult perspectives of Hungary, Romania, Czechoslovakia, and Yugoslavia.Equipment Conversion:Update your arsenal by converting older units -- or make use of captured enemy vehicles and gear.New Music and Art:3 new thematic musical tracks from composer Andreas Waldetoft, new art content for the four focus nations, and new troop voiceovers.New Diplomatic and Puppet Interactions:License military technology to bring other nations’ weapons to the field or sell your advances to the highest bidder. Fascist countries get new subject levels like Reichskommissariat, with access to licenses, industry and strategic resources. The instated governments are held in an iron grip, making it harder for them to break free.\nColonel EditionThe Colonel Edition includes the following items:\nHeavy Cruiser Pack (cosmetic):Seven heavy cruisers available for both Axis and Allies - Exeter, Prinz Eugen and Mogami amongst others.\nSoviet Tank Pack (cosmetic):Eight tanks for when playing as Soviet, ranging from light all the way up to Super Heavy.\nUS Tank Pack (cosmetic):Eight tanks for when playing as USA, ranging from light all the way up to Super Heavy.\nBritish Tank Pack (cosmetic):Eight tanks for when playing as United Kingdom, ranging from light all the way up to Super Heavy.\nGerman Tank Pack (cosmetic):Eight tanks for when playing as Germany, ranging from light all the way up to Super Heavy.\nFrench Tank Pack (cosmetic):Eight tanks for when playing as France, ranging from light all the way up to Super Heavy.\nWallpapers:Wallpapers made with art from the game.\nColonel Forum Icon:A icon that can be used on Paradox own forum.\nField Marshal EditionThe Field Marshal Edition includes the following items:\nHeavy Cruiser Pack (cosmetic):Seven heavy cruisers available for both Axis and Allies - Exeter, Prinz Eugen and Mogami amongst others.\nSoviet Tank Pack (cosmetic):Eight tanks for when playing as Soviet, ranging from light all the way up to Super Heavy.\nUS Tank Pack (cosmetic):Eight tanks for when playing as USA, ranging from light all the way up to Super Heavy.\nBritish Tank Pack (cosmetic):Eight tanks for when playing as United Kingdom, ranging from light all the way up to Super Heavy.\nWallpaper (cosmetic):Wallpapers made with art from the game.\nGerman Tank Pack (cosmetic):Eight tanks for when playing as Germany, ranging from light all the way up to Super Heavy.\nFrench Tank Pack (cosmetic):Eight tanks for when playing as France, ranging from light all the way up to Super Heavy.\nAvatars:Unique portraits from the game to use as avatars on Paradox Forum.\nField Marshal Forum Icon:A icon that can be used on Paradox own forum.\nArt Book:Art from the creation of Hearts of Iron IV.\nExpansion Pass #1:Includes the first 3 expansion and it’s related content, to an estimated value of  $49.99.\nExpansion Pass #1Includes the first 3 expansion and it’s related content, to an estimated value of  $49.99.\nSabaton Soundtrack is included but excluded from estimated value.\nExpansion 1 - Together for Victory\nExpansion 2 - Death or Dishonor\nExpansion 3 - TBD\nGame BookThis is how you access your game book content.\nThe player must connect his/her Paradox account and Steam account.\nGo to accounts.paradoxplaza.com\nLog in\nClick Settings\nClick  ”Connect” your Steam account and follow the instructions.\nWhen the player logs into his/her Paradox account in the mobile app – the content is unlocked.\ndirect link to the mobile applications:\nhttps://itunes.apple.com/us/app/pages/id1064064762?mt=8\nhttps://play.google.com/store/apps/details?id=com.pdx.hoi4\nAbout the GameVictory is at your fingertips! Your ability to lead your nation is your supreme weapon, the strategy game Hearts of Iron IV lets you take command of any nation in World War II; the most engaging conflict in world history.\nFrom the heart of the battlefield to the command center, you will guide your nation to glory and wage war, negotiate or invade. You hold the power to tip the very balance of WWII. It is time to show your ability as the greatest military leader in the world. Will you relive or change history? Will you change the fate of the world by achieving victory at all costs?\nMain Features:Total strategic war: War is not only won on land, sea and in the air. It’s also achieved in the hearts and minds of men and women.Authentic real-time war simulation: Let the greatest commanders of WW2 fight your war with the tools of the time; tanks, planes, ships, guns and newly discovered weapons of mass destruction.Assume control of any nation:Choose from the greatest powers striving for victory, or the small nations trying to weather the storm.\nTurn the world into your battlefield: Experience the full WWII timespan in a topographical map complete with seasons, weather and terrain. Snow, mud, storms can be both your strong ally and a ruthless enemy.Negotiate or force your will:Experience the advanced politics and diplomacy systems, form factions, engage in trade for resources and appoint ministers to your party.\nIntense Online Combat: Battle in both competitive and cooperative multiplayer for up to 32 players. Featuring cross-platform multiplayer.Give your nation a unique edge: Experience the flexible technology system, where all major powers get their own unique identity. Develop detailed historic tanks and planes through research and army experience.\nEveryone will receive:Poland: United and Ready:A Free DLC adds a unique focus tree for Poland, new 3d models for tanks and planes, 2d assets, and extra leader portraits for the ultimate in historical accuracy.Forum Avatar Forum avatar for the Paradox forum.Wallpaper","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11839,"name":"Pathologic 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c4a/c4a948e3d1ab733f21641844c6df3e43.jpg","description":"Pathologic 2 is an open world survival horror game set in a town that’s being consumed by a deadly plague. Face the realities of a collapsing society as you make difficult choices in seemingly lose-lose situations. The plague isn’t just a disease. You can’t save everyone.\r\nGet to know it, winning the affection of the locals and gaining allies, or try to carve your own path alone. Explore the Town, its inhabitants, and their traditions; fight both the plague itself and its victims; try to make a difference before the time runs out.\r\nFigure out who killed your father while fighting a deadly plague. Find your alleged twin sister. Was she the one who had brought the plague to this town? The local kids are hiding something. Try playing by their rules.\r\nYou only have 12 days.\r\n12 days in an odd town ravaged by a deadly disease.\r\nTime is of the essence: if you don’t manage it carefully, it’ll simply run out. You’ll have to choose how to spend the priceless minutes you have.\r\nSurvival thriller. You’ll have to manage your bodily functions, offsetting hunger, thirst, exhaustion, and so on. But it doesn’t boil down to scavenging resources. Surviving on your own is hard; you’ll have to win over allies.\r\nAn uphill battle. Managing your bodily parameters may seem bearable at first, but as time goes by, it becomes harder and harder. Your own body is only waiting for an opportunity to give up and betray you. Things are changing from bad to worse and the odds are stacked against you.\r\nA duel with an enemy you can’t kill. Your main foe is the plague itself, an incorporeal and malevolent entity that you have to defeat… without having the means to. It’s more powerful and more treacherous than you can imagine.\r\nLoot, murder, mug, steal, barter, beg… or don’t. You need resources to survive, but it’s up to you how to obtain them.\r\nThe fights are short, ungraceful, and vicious. They don’t have to be lethal though. Many people—yourself included—would prefer to exchange their wallet for their life.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ice-Pick Lodge","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":39277,"name":"Aliens vs. Predator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fbc/fbced95c523be0444ce6d2fa83b1afc0.jpg","description":"The game is based in part on the series of films \"Alien\" and \"Predator\". Heroes represent three races: a human, an Alien and a Predator. Each hero is available in the single-player campaign in unique own missions and side missions in the locations of another characters. Playing an Alien, you can be three different creatures because Aliens have several forms in the process of growth.\n\nThe gameplay allows, among others, the following possibilities:\n- quickly change the modes of vision,\n- find opponents by sound, it is quite voluminous for this,\n- move on the walls and ceiling,\n\nEach character is limited in the choice of weapons, based on the characteristics of his race. Similarly, other processes also depend on this - for example, the health of an Alien increases from tearing the bodies of people or Predators, and from biting off their heads. In the game there are other active creatures - androids, various kinds of Aliens.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":35613,"name":"Sonic Adventure DX: Director's Cut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74c/74c68a8de3d4983ff932dd456ac2dc66.jpg","description":"An ancient evil lurking within the Master Emerald has been unleashed from its slumber by the devious Dr. Eggman and is on the verge of becoming the ultimate monster using the 7 Chaos Emeralds. Only Sonic and his friends are heroic enough to put a stop to Dr. Eggman and his evil minions.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"GameCube"}]},{"id":17945,"name":"Knights and Merchants","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b15/b15b55537e4fbaefe6e4b60ae4ce8d0d.jpg","description":"KNIGHTS and MERCHANTS recreates the era of the Middle Ages. Apart from the purely fictitious geography of our world, all game elements and scenes are based on the Anglo-Saxon period, 1200 A.D. And we haven't used imaginary elements like fabled creatures, either. The player takes on the role of an ordinary captain in the Palace Guard. A conspiracy against the king catapults the captain into a situation where he finds himself responsible for the defence of the last royal province. This is all that remains of the shattered kingdom, which has been split into numerous small principalities and fiefdoms. And now even the king himself, ensconced in his capital, is threatened by enemy armies. This is the starting point of your Middle Ages adventure. Now you must win back all those provinces which once belonged to your king.THE SHATTERED KINGDOM:After many battles, a former kingdom has been divided into many small principalities and earldoms. The kingís troops were pushed back into one last royal province, and the rulers of the other provinces waged terrible, destructive wars against one another. The whole land fell into a state of chaos and now the former royal capital itself is under\nsiege by the armies of the rebel lords. You belong to the last remaining group of loyal kingís men, and have been commanded to go to the king in view of the imminent\nattack.THE PEASANTS REBELLION:Build a prosperous settlement with a complete economy. Arm your troops and meet the enemy on the battle field! Master these tasks and the King’s subjects will be able to live in peace and freedom again.GAME FEATURES:Middle ages simulation and Real-time strategy\n2 campaigns \"The Shattered Kingdom\" and \"The Peasants Rebellion\" with a total of 34 missions\nSkirmish Mode and 10 Multiplayer-Maps\nAbout 25 different types of buildings\nMore than a dozen different types of characters\nOver 10 different troop types, including archers, scouts, knights, bowman and barbarians\nMultiplayer battles with up to 6 players in LAN or through the Internet\nNew Musical Score","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Runesoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":1488,"name":"METAL SLUG 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df1/df1a27300bf1e4696734b437d81b0fcf.jpg","description":"METAL SLUG 3 is a game in the shoot 'em up genre, a sequel to the METAL SLUG 2/METAL SLUG X and overall a third installment in the series. Initially released for arcade platform, the game shares gameplay mechanics with its predecessors, where the player takes control of a squad of four soldiers and faces continuous waves of enemies throughout each level.\nThe game’s plot follows the previous events, where the main characters succeeded in overthrowing a maniac and bringing relative peace. This time, however, it is revealed that our heroes' nemesis is back for more, with new allies and new soldiers to try and stop the protagonists. As the levels progress, the player faces different enemies, each with unique patterns and abilities, and also finds new weapons and upgrades for his character of choice. Another feature of the series is its vehicles, including tanks, planes, helicopters and even a spaceship. Each of those can be used to the various extent and provide significant bonuses to character’s firepower, defense, or movement capabilities.\nThe game is made using pixel graphics, and even though it was initially released in 2000, the sceneries and the details are still as stunning. Each character’s looks are refined, explosions are made colorful and as realistic for a 2D game as possible, and the locations themselves would look like art.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"DotEmu","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":369157,"name":"Yakuza: Like a Dragon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a59/a5993b9f84944570a31cb6ad08bfe502.jpg","description":"RISE LIKE A DRAGON\r\n\r\nIchiban Kasuga, a low-ranking grunt of a low-ranking yakuza family in Tokyo, faces an 18-year prison sentence after taking the fall for a crime he didn't commit. Never losing faith, he loyally serves his time and returns to society to discover that no one was waiting for him on the outside, and his clan has been destroyed by the man he respected most.\r\nConfused and alone, he embarks on a mission to discover the truth behind his family's betrayal and take his life back, becoming an unlikely hero for the city’s outcasts on his journey.\r\n\r\nLEVEL UP FROM UNDERDOG TO DRAGON IN DYNAMIC RPG COMBAT\r\n\r\nExperience dynamic RPG combat like none other. Switch between 19 unique Jobs ranging from Bodyguard to Musician, and use the battlefield as your weapon. Take up bats, umbrellas, bikes, street signs, and everything else at your disposal to crack some skulls!\r\n\r\nENTER THE UNDERWORLD PLAYGROUND\r\n\r\nWhen you're not busy bashing heads, relax by hitting up the local arcade for some classic SEGA games, compete with locals in a no holds barred go-kart race around Yokohama, complete 50 unique substories, or just take in the scenery of a modern-day Japanese city. There’s always something new around the corner.\r\n•\tBecome Ichiban Kasuga, a yakuza grunt betrayed by the man he trusted most\r\n•\tCrack skulls in dynamic RPG combat\r\n•\tRecruit up to 7 party members from the outskirts of society\r\n•\tSpend time with party members to develop their abilities and unlock powerful combo skills\r\n•\tFind, forge, and upgrade equipment to take on the strongest foes\r\n•\t19 Unique Jobs (+2 DLC Jobs)\r\n•\t100+ Combat Skills\r\n•\tOver 15 Hilarious Mini-Games\r\n•\t50 optional Substories breathe life into the city of Yokohama, Japan\r\nRussian and Brazilian Portuguese subtitles available in early 2021 via patch update.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":4108,"name":"Demon's Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ac3/ac3a89bfbda76082402e42b933c5825a.jpg","description":"Demon’s Souls is an action RPG, the first installment in the Souls series, known mostly because of the Dark Souls trilogy. Demon’s Souls is also set in a grey-colored dark medieval-themed world that is attacked by the demon fog. You take on the role of a knight that entered the fog trying to save the kingdom from demons. He was eventually killed and reborn, and now needs to travel the entire kingdom to gain power and set the world free.\n\nYour character is fully customizable and can be upgraded with souls you get through battles. Demon’s Souls combat system is quite complicated as you can’t gain experience killing ordinary enemies to defeat the boss later. Here you need to work out unique tactics for every monster type. As a result, the gameplay is quite challenging with frequent deaths.\n\nHowever, there’s a way to simplify the game a little. Some of your actions, for example, killing or helping NPCs, affect the gameplay. This parameter is called tendency; when it’s white, the enemies are easier and the rewards are fewer. When it’s black, it produces the opposite effect.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"FromSoftware","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":43078,"name":"Portal Stories: Mel","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e5/9e5b25a276f9248c36c0fd78288738ce.jpg","description":"Portal Stories: Mel is a singleplayer mod for Portal 2 developed by Prism Studios.\n\nThe game is set in 1952. Mel, an Olympic champion, arrives in an unnamed small town in Michigan where the headquarters of Aperture Science is located. Mel was invited to participate in a test of Aperture Science Short Term Relaxation Vault. Mel arrives at the vault, gets into it and falls asleep. But something goes wrong and instead of several minutes, Mel sleeps for several decades. Upon coming to, she finds that the Aperture Science facility is devastated. Mel has to get out of there.\n\nThe gameplay of the mod is not different from Portal 2's. The players solve puzzles using the portal gun which allows for opening two two-sided portals on suitable surfaces and moving different objects. Almost every object from Portal 2 is present in the mod with one new addition: water. It is used to extinguish a fire. The game consists of 22 puzzles and takes from 6 to 10 hours to complete.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Prism Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":22734,"name":"Beneath a Steel Sky","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6b/f6b3338889ec877c9d3d89fc4f665152.jpg","description":"After being brutally abducted from his village in the wasteland, his village obliterated, and his kinfolk butchered, Robert Foster escapes a helicopter crash and finds himself alone save for the circuit board of his best friend, Joey, the AI he built as a child. Foster soon resurrects Joey and together they find themselves in Union City, where oppressed citizens live and work in soaring tower blocks, under the strict control of a brutal, fascist, AI dictatorship – whilst the corrupt, covetous and rich live below, shielded from the choking pollution.\nIn the melting pot of Union City, a not so impossible future, mankind’s worse nightmares are waiting to emerge from beneath the steel sky. It's Man against Man. Man against Machine. Man against Time.\nStrangers in a strange land, Foster and Joey must survive long enough to discover the sinister truth behind his abduction - why they specifically came for him - and defeat the evil before it’s too late. It’s a terrifying threat that only you can liberate… Maybe.\nFeaturing Revolution's Software innovative Virtual Theatre system, Beneath a Steel Sky is a gripping cyberpunk science fiction point and click adventure game. Art directed by award-winning comic book artist Dave Gibbons (Watchmen), Beneath a Steel Sky is widely considered as one of the best point and click adventures ever written.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Revolution Software","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"iOS"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":63904,"name":"Steel Rats","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43c/43cfdb7fdc48d99b4a4c2525b411daf8.jpg","description":"Become one of the Steel Rats, a biker gang sworn to protect their city against an invading army of alien robots - Junkbots. Wreck and ride through hordes of enemies, switching between four unique characters as you wreak havoc with the ultimate killing machine; your flame spewing, saw bladed, motorcycle.\nRide in style through the retro futuristic world of Steel Rats. Set in an alternate version of 1940’s USA, gear up and mount your chromed stallion and save Coastal City from the invading horde of Junkbots. Your motorcycle is your weapon designed to crush your enemies in awesome and stylish ways whilst traversing up, down left and right, over rooftops and through enemy-infested tunnels.FeaturesRace, shoot, stunt all for the price of one!\nNow for something a bit different. Steel Rats blends genres in a way no game has before, infusing 2.5D stunt bike, racing action with precise platforming and intense vehicular combat.Drive and destroy!\nYour motorcycle is your weapon in the fight against an invading horde of alien Junkbots. Combine up close melee combat and precise, deadly shooting with a ludicrous vehicular arsenal including wheel-mounted saw blades, harpoon guns, flame spewing exhausts, and handlebar mounted mini guns. We’re sure you’ll find some juicy ways of using these tools to wreak havoc on your enemies.Ride with style\nStart your engine and master the realistic physics based controls of your bike to perform stunts and skillfully destroy Junkbots with a barrage of special abilities and weaponry. The more creative the destruction the better, ride up walls, backflip of the side of buildings and unleash havoc mid-air whilst riding upside down.Dash and explore!\nDiscover the secrets of Coastal City and reveal the mystery of the Junkbot invasion. Explore each level, find every collectible, unlock new areas and dominate the leaderboard.Meet the Gang\nChoose which of the four members of the Steel Rats you want to play as and switch them up any time you want. Each character has a unique ability and weapon equipped to their custom built ride, allowing you to unleash some serious  damage on the Junkbot horde.\n\nA hardened biker hailing from Boston. Proud leader of the Steel Rats, riding his armored bike straight into the fray.\n\nBorn in Brasil, she grew up on the streets of Coastal City. A bold racer, leaving her enemies in a wake of fire.\n\nA teenage, japaneese-american savant. Brilliant mechanic and prodigious engineer.\n\nA long time performer of a travelling German stunt circus. A madman who likes to live (and ride) on the edge.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Tate Multimedia","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":4192,"name":"Pid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d93/d93e93149d781484bfc9c6ae7b48e1d4.jpg","description":"Pid is a puzzle platformer that follows a boy named Kurt who lives in the era of interstellar traveling. Accidentally he missed his planet on the way from school, and got stuck in the place that seemed to have no way out… Now he needs to find out what happens and return home.\nThe gameplay is based on platforming mixed with Kurt’s ability to use so-called beams to pass through levels. These beams create tunnels without gravity that help to come over obstacles, solve puzzles and even fight enemies. More items become available on higher levels. The game only supports co-op on the same console, with no online multiplayer.\nWhile Pid has really hardcore gameplay, its visual style is calm and relaxing. The in-game world is full of secrets and collectibles that balance the gaming experience a little. Almost every NPC has something to tell you, so don't ignore dialogues that will shed some light on Pid's lore.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Might and Delight","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19151,"name":"The Ship: Single Player","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/506/5063f823789894332d3e0d16703854d1.jpg","description":"The Ship: Single Player is as its said a single-player mode for the first-person shooter video game The Ship: Murder Party. It starts with a main antagonist named Mr. X, who welcomes passengers in his cruise ship by giving everyone free-tickets. When on a ship, he tells his requirements for everyone. Basically, he tells the main protagonist whos name is Charlie to kill certain passengers but there is a hunter who hunts for Charlie so he has to be aware of his surroundings. Also, he has to kill the target secretly as nobody could see that. Charlie meets a young man named Jimmy the Bellboy in a third class cabin where the man tells Charlie about Mr. X. It turns out, that Mr. X plans to destroy the ship after the hunt is over. Jimmy offers to get Charlie off the boat for 100,000 dollars, but first Charlie has to deal with the hunter of his. \nThere are various weapons in the game like  flare guns, fire axes, firearms, knives, swords  and crowbars as well as various traps which the player has an option to use if needed. If the player is seen with a weapon, he is instantly brought to prison.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Outerlight","platforms":[{"id":0,"name":"PC"}]},{"id":3226,"name":"Prototype 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/445/44507fdd60a8ec02b1c3c64a293ca754.jpg","description":"###The succsessor\nPrototype 2 - developed by Radical Entertainment is a science-fiction adventure shooter with a third-person view in the open world. The publisher was Activision, and the game was released on April 24, 2012, on PS3 and Xbox 360, and then, on July 24, 2012, on PC. Later, in August 2015, it was released on consoles of the next generation - PS4 and Xbox One.\n\n###The setting\nThe action takes place in a city called New York Zero, where an epidemic is raging, and its territory is divided into zones. The player will try on the role of Sergeant James Heller, who serves in the Middle East. It all begins at the moment when his wife calls and says that the epidemic has begun again in the city and they are at the epicenter with their daughter. Returning home, James discovers that his family is dead and now his task is to find someone who, in his opinion, is the culprit of these deaths.\n\n###Key features\nCruel and bloody Prototype 2 is the second game of the series. It seems that, compared to the first part, the gory feel is becoming bigger. The game is allowing you to run and jump almost anywhere and do whatever the player wants - anarchy! But despite the fact that the game takes place in an open world, a player can feel some linearity of events. According to lead designer Matt Armstrong, this was done purposefully so that the player would feel the development of the storyline and wouldn’t be afraid of too many options, and have the opportunity to open new territories gradually, thereby more effectively upgrading his character and immerse in the game’s universe.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Activision","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":18708,"name":"Pathologic Classic HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/55d/55dd16f70b86426359334a785a1888e6.jpg","description":"The original Indie Cult Classic returns fully restored, and more evocative than ever.\r\nPathologic Classic HD is the Definitive Edition of the original Cult Classic Psychological First-Person Survival game. The game represents a unique and unforgettable experience as it transports players in a weird town which crouches, ominous, in the far reaches of an ancient steppe. It was once a small drover settlement, huddled around a monstrous abattoir—but something about the butchery it was near has changed it. It has developed an odd social structure over the course of several generations. It could have quietly continued along its weird way, but a sudden outbreak of an unknown and inevitably lethal disease has decimated the citizens. Prayers did not help. Science did not help. So, finally, they have turned to outsiders for help: three of them enter the town in hope of finding a cure or—failing that—an explanation. The first outsider was a ruthless investigator, assigned by local authorities. The second is a far-sighted Ripper who has used his extraordinary abilities to gain a reputation as an ingenious surgeon, who has come to the town in search of his father's terrible heritage. The third—and last—outsider is an eccentric girl rumored to have mystic healing abilities; she may become the town's salvation were it not for the constant fear that plagues her, the memory of the horrors of her recent past.\r\nOn the surface, Pathologic is a first person horror adventure game where you control one of three \"heroes.\" Dig deeper, however, and you’ll find an experience that will affect your emotional and psychological state. In the world of Pathologic you’ll find yourself in situations where morals and good deeds are meaningless in the face of raw despair and endless need. Talk to the denizens of the town and decide for yourself if you wish to ease someone else’s pain or save every bit of precious medicine to protect yourself from the invisible and inexorable plague. Become witness to the miasma of horror as the plague begins to overcome the town.\r\nBrand New in-house English script: For the first time ever, the game has cast off the major issue that had previously disallowed international audiences from accessing it.\r\nBrand New Voice-overs.\r\nNew content: A certain amount of text that had previously been cut from the international version of the game have now been restored\r\nUpdated textures and higher resolutions support.\r\nNew visual effects.Newly Included Fan-Made Polish translation: thanks to the hard work and generosity of Jakub Derdziak & Aldona Derdziak.\r\nAn Italian translation, kindly donated to us by the original translators of the game, Stefano Gaburri and Claudio Todeschini.\r\nAn indie cult classic.\r\n12 days in a plague-ridden town. Time is running, and mostly it’s running out; numerous events unfold, whether you’re there to witness them or not.\r\n70+ hours of real-time gameplay without grinding or repetitive quests. As time goes by, more and more things happen, inviting you to participate and change the course of events.\r\n3 playable characters with 3 unique storylines. The Bachelor’s, the Haruspex’s, and the Changeling’s plots are interconnected, but every side of the trilemma is represented separately via unique events, quests, dialogues, and subplots.\r\nThe plot is critically acclaimed and often regarded as the high point of the game. It’s not just about the fate of the dying town—it’s about an ideological conflict, represented by a multitude of characters and factions, each with their own idea of what life, death, and miracles are.\r\nAn open-world game. While the plot is there to grab you, the town has no artificial boundaries: you are free to explore it from day one, carving out your own story.\r\nSurvival is tough. The dying town demands that you constantly keep an eye on your status, maintaining a full belly and decent immunity. That will require tough choices.\r\nCommunicate, barter, rob, or steal. There are many ways to acquire your bare necessities, each of them with its own benefits and drawbacks.\r\nThe atmosphere of bleakness and despair without cartoonish evil or bad guys. Playtime is over—there will be no jump scares or simple solutions. You will have to do it the hard way.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ice-Pick Lodge","platforms":[{"id":0,"name":"PC"}]},{"id":29180,"name":"Ni no Kuni II: Revenant Kingdom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b92/b924c4beeed6617201d5d91511cfcf8e.jpg","description":"Re-enter the animated world of Ni no Kuni in a role-playing masterpiece!\r\n\r\nRe-enter the animated world of Ni no Kuni in the sequel to the role-playing masterpiece developed by LEVEL-5. \r\n\r\nExplore a beautifully crafted world and experience the gripping story in an all-new RPG adventure. LEVEL-5 reunites with Yoshiyuki Momose on character design and Music created by Joe Hisaishi in the production of the next Ni no Kuni tale.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":15857,"name":"STAR WARS Empire at War - Gold Pack","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c3/6c3cea606428109394ef18fbf7f3d8b5.jpg","description":"A collection of strategic games in the world of Star Wars.\nDuring the Galactic Civil War, you can lead the rebels, dominate the Empire, or become a criminal at the head of a powerful criminal group.\n\nBeing in more than eighty terrestrial and extraterrestrial locations, you can control everything from one unit to the Death Star. Each decision affects the next fight, each battle affects the entire Galaxy.\nAmong the locations and heroes there are names familiar from the films - Tatooine, Obi-Wan Kenobi, Luke Skywalker, Darth Vader, Boba Fett, Han Solo and Chewbacca, R2-D2 and C-3PO and others.\n\nIn addition to playing for the Light and Dark sides of the Force, you can play \"against all and only for yourself\" - in the role of Tiber Zann you can lead a group of criminals to the top of the criminal world of the Galaxy. This option is provided by the addition to the game - \"Forces of Corruption\". In the arsenal of criminals are well-known methods: piracy, kidnapping, extortion and bribery. And with the help of such an all-powerful key as corruption, you can achieve complete control over the Galaxy.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Lucasfilm","platforms":[{"id":0,"name":"PC"}]},{"id":440079,"name":"DiRT 5","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c7/9c7dd09596246993169b356d7c1facf0.jpg","description":"DIRT 5 is the bold new off-road racing experience created by Codemasters. Blaze a trail across the most iconic routes in the world. Drive the widest roster of cars from rally icons, to trucks, to GT heroes and lots more. Play through a star-studded Career, four-player split-screen, innovative online modes, livery editor and more new features, DIRT 5 is the next generation of extreme racing.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Codemasters","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":9768,"name":"GameGuru","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f24/f24122a8e3d30ec3e99472e3e826d0cb.jpg","description":"Welcome to GameGuru, the easy game maker. Our mission is to create the easiest and most enjoyable game creator. Join us and our great & enthusiastic community on this journey.  Imagine creating a world that you and your friends come together and play... and creating it could be a matter of minutes with no technical jiggery-pokery needed at all! Of course, you can happily spend hours, days..even weeks creating your masterpiece, the great thing about GameGuru is, you won't be held up by learning strange alien languages or using complex modelling tools. The time you spend with GameGuru is all about creating and having fun whilst doing it.\nWith GameGuru you can make a multiplayer game in just a few minutes.  Providing your friend has a copy of GameGuru, you can host a level and your friend can join in. Up to 8 players are supported.\nGameGuru comes with over 20 ready-made game levels and demos for you to play and enjoy. They will show you the sort of games that can be created and how they were done, plus you can adapt these pre-made game levels and put your own unique spin on them. You’re then ready to go and design your own unique games!  We believe there is nothing on the market which is as easy to use and as quick to allow you to share your creations with others.\nGameGuru offers you an easy yet comprehensive game creation process that is open to non-programmers and designers/artists, or anyone who aspires to become a game creator. It also has powerful editing tools for those who want to take their game creation to an even greater and more complex level. The power is there at your fingertips.\nAs a welcome bonus, we have also included an expansion pack with over 2.8 GB of additional game assets for you to get started, completely free! In fact, all the art you see in the screenshots above are included in GameGuru and you are free to include them in your games, no strings attached.  We do sell additional content DLCs, but with over 6,000 megabytes of game assets already crammed into GameGuru, the DLCs are entirely optional.\nYou just need to follow these easy steps – welcome to the world of game creation!\nCreate your virtual 3D world – Game Design\nConstruct huge game levels with the easy to use Level Editor. Sculpt your initial game design, add content and then play your game with one click of the Test Game icon:\nDesign your game and levels adding hills, mountains, water, paths, terrains until you have created the world you want for your game\nAdd all your environmental items, pick animated 3D objects including buildings, trees/vegetation, man-made objects/barriers with pre-set customizable properties\nSet the mood by controlling all aspects of the 3D rendered scene with easy to use sliders and combo box choices, including sky/ambiance, day/night scenes, lighting settings.\n\nDecide what your game is – Game Plan\nHave you ever wanted to create the game only you can dream of? Now you have the tools to do exactly that, possibly for the first time ever! You can create games very quickly and easily, or add more and more depth as you wish to create a unique game experience:\nCreate your dream game, whether it’s Modern-day FPS Action, Horror/Zombies, Sci-Fi/Fantasy, Cartoon/Zany, Medieval/Historical and many more - you choose!\nGive your game objectives, missions, weapons, puzzles, collectables from a suite of pre-set objects supplied, or create/buy/customise new objects.\nAdd characters to your game from the stock media or design your own with the Character Creator.\nNow make your game come to life! – Game Crafting\nUsing the editing tools you can add more depth and details to your game, make the scenes more complex and improve the objectives of your game to challenge experienced gamers:\nUse the 3D editing mode to fine-tune your game design\nAdd all the game-play aspects you want in your game and make adjustments\nUse the assets supplied free with GameGuru or import your own\nUse the editing tools to make your characters and objects unique, give them additional behaviors using the powerful LUA scripting language.\nCreate, share & sell your game – The final result!\nOnce you have your finished game you can make it available to your friends and other gamers. GameGuru is unique in what it can offer, all at no additional cost:\nBuild your final game - ready to play and share\nSave your standalone game as an executable file to use as you wish\nPublish your game and sell it to others, all royalty free\nMake, share and play multiplayer games with other GameGuru users\nOur mission\nOur mission is to develop an affordable game creator that's easy and fun to use, taking away some of the traditional difficulties of games development and allowing both new and experienced users the ability to create games quickly. We're a UK Indie development team with over 20 years of experience and we're an Intel Black Belt developer.\nGameGuru is being designed by gamers for gamers and we want to design and create it along with our active and enthusiastic community. As the product is community lead, the software is in constant development and growing all the time, and we invite you to share the journey with us and help shape GameGuru into an awesome creative tool.\nOur Vision\nOur vision is to produce The Ultimate Easy To Use 3D Game Creator for the PC - A solution that is easier and more affordable than it’s competitors, with a strong community lead development to keep it growing and improving.\nWe'll embrace new and exciting hardware, acting as champions as we pioneer new experiences and in the process creating fresh new game creating communities. We'll keep expanding the gaming possibilities of GameGuru as we move forward.\nDeveloping game creation tools is what drives us - we're super passionate about finding ways to make the whole game creation process as easy as possible.\nThe Technical Stuff\nFor those who want to understand more – here are the main elements of GameGuru:\n3D Game Engine & Editor\nEasy to use, drag & drop style\nBirds eye view & 3D fly editing systems\nGame world – Construct levels for your games\nTerrain editor – With easy to use controls you can create unique environments\nInfinite vegetation system – Vegetation is auto generated, just paint it on the map\nRendering engine – powering the shaders to make your games look great\nLevel of detail – The game engine supports Level Of Detail technology (LOD)\nCascade shadow mapping – Real-time dynamic sun shadow\nLightmapping – Add fast shadows to your levels with the shadow baking system\nAmbient Occlusion Mapping – A feature of the lightmapper\nSky maps – Choose from a wide range of high-resolution sky maps\nOcclusion Culling System – Fast rendering from a special object culling system\nWater plane – A reflective water plane adds a visual touch to your levels\nLight Rays – Let the light flood your game scenes with cool god rays\nShaders for all – shader technique modes to best suit your PC’s capabilities\nImport your own .x / .3DS files\nConnect to the Asset Store to extend your library of game assets\nPhysics\nGameGuru uses the Bullet Physics engine to create realistic physics events\nRag-doll deaths of characters\nGame Characters & Weapons\nCustomize character in-game properties\nSimple Character Creator\nA.I scripts control characters - Scripts are coded using the LUA language\nGameGuru comes equipped with a range of stock weapons and ammo packs\nModern day weapons – Colt 1911, Shotgun, Uzi, Magnum, Launcher and Rifle\nExplosive Munitions – RPGs, grenades and landmines\nAmmo pick-ups – Reload weapons during game-play with ammo pickups\nAnimated – Fully animated weapons with improved handling and realistic sounds\nJet-pack - A special Jet-pack object lets you fly around your game world\nMultiplayer on Steam (GameGuru is required by all users to play multiplayer games)\nBuild games with multiplayer features\nCreate death-match levels\nMake Team death-match levels\nBuild Co-op Multiplayer games\nUp to 8 players can play your game\nPlay with friends\nBuild Games\nSave standalone single player games as executable files\nDistribute your games royalty free\nGame Creator Store\nOnline Store – Easily add game ready assets to your project\nModel Packs – Collections of media are supported by the store\nSell – Artists and musicians can sell their own media to the community via the store\nAlmost 10,000 game ready assets now available and growing\nSteam wallet supported\nDevelopment Road Map\nGameGuru is in continual development, a list of forthcoming features can be found here:https://www.game-guru.com/feature-vote\nOur road-map is to continue developing GameGuru until our community is satisfied we have all the main game elements included. With GameGuru released we will continue to improve and develop it further. All existing customers will receive lifetime updates free of charge.\nChoosing Your Game Engine\nGameGuru is not designed to compete with professional development tools such as Unity, Unreal and Cry-engine which are ideally suited to producing commercial apps and games. GameGuru is a recreational game maker, not a professional tool, and is still very much in development.  GameGuru is unsuitable for serious game development projects at this time, and we highly recommend you visit the forums and ask many questions before you make a decision on the game making tool for you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Game Creators","platforms":[{"id":0,"name":"PC"}]},{"id":4185,"name":"Kingdoms of Amalur: Reckoning","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bad/bad95aa1f2edbbad2ae93981291b6560.jpg","description":"Kingdoms of Amalur: Reckoning takes place in a fictional region called Faelands which is one of the Kingdom of Amalur. There the immortal Fae of the Summer lives, but immortality means only that after death you will become something else in another body. There are five different regions of Faelands and four playable different races with three different class trees. The player starts as a \"Fateless\" being before the choosing between three classes. \nThe combat of the game is timing based and similar to other action-role-playing games with addition of QTE elements during cutscenes. While in combat, player gains fate points and with required amount of them player can enter Reckoning Mode, which is a slow-motion berserk-like mode which lets player to quickly kill all the enemies. Not only a player has the ability to jump or swim on the water, but also can communicate, rob or kill NPCs, which has its consequences. It is said that Kingdoms of Amalur: Reckoning mixes up ideas from games such as God of War and The Elder Scrolls series.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":44029,"name":"My Time At Portia","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/176/1765390b699b432edc3a208d544c6ba0.jpg","description":"My Time at Portia is a simulation open world RPG game set in a post-apocalyptic world. Humans are few and relics from the past are everywhere. You are starting a new life in Portia, a town on the edge of civilization. After taking over your father's abandoned workshop, you can take commissions from the town folks in order to grow your workshop and build your prestige. In order to fulfill commissions, you will spend lots of your time collecting materials from the relatively large open world.  Cut down tree, pick up herbs, mine in ruins, even plant your own garden and raise farm animals. There are vast areas for the player to explore around Portia. Deserts, islands, reefs, highlands, marshlands, and more! Each area bringing their own unique items and monsters. There are two different types of dungeons in this game. Players can gather relics and ores from the abandoned dungeons, and fight off monsters to gain look in the hazardous dungeons.\n\nBut My Time at Portia isn't just about grinding away in your workshop and the mines. Meet the wide range of NPCs each with their unique personality and behaviors. Make friends, date, and even marry someone who will help you around your workshop. Kids are even on the table! Learn more about the Old World as you go along. Will you turn over your relics to the Church of the Light where they can be properly disposed of so as to prevent another apocalypse, or will you work with the Research Lab to harness the ancient technology to rebuild society?\n\nMy Time at Portia delivers an enthralling life simulation game that balances character, building, and discovery and allows you to choose your own path through life.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]}]