[{"id":20836,"name":"Blackwell Deception","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c83/c83ad360753c3d5a14778cd11b72dda3.jpg","description":"Street psychics. Their blinking neon signs are everywhere, promising love and wealth and happiness. They make a fortune preying on the gullible and milking them dry. So when these victims begin dying and leaving confused spirits behind, it can only take a genuine psychic (and her wayward spirit guide) to clean up the mess.\nFrom seedy downtown nightclubs to penthouse apartments to a luxury yacht on the Hudson River, Rosa and Joey will unearth the truth about the underground world of street psychics. Including some secrets that Joey would rather be left buried.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"PC"}]},{"id":19619,"name":"Freedom Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e63/e63f02564e2bf7867ba40347d79a8f1f.jpg","description":"From a distant corner of the galaxy, an evil alien race sets in motion a sinister plan to conquer the Earth. They unleash a powerful catalyst — Energy X — that imbues the planet's worst miscreants with super-powers to bring the planet to its knees. Now Earth's only hope lies with a new breed of heroes... The Freedom Force!\nCommand a squad of comic book heroes in the defense of Patriot City. Choose from over a dozen heroes or create your own comic champions. Fight for freedom in over 20 action-packed missions. Restore order in a completely interactive 3D world. Take your heroes online and join the fight in multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"2K Australia","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19457,"name":"Disciples II: Rise of the Elves","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b4/7b49a66ff8ef74067ccfa31d23da9f21.jpg","description":"The award-winning series Disciples introduced a milestone in the game's very successful history; the introduction of a new race: The Elves. The Elven Race added a new dimension to the game and added countless hours of gameplay.\nNow that series has expanded further with Disciples II: Rise Of The Elves. This version features all of the campaigns found in the original and a brand new campaign that continues the storyline of the Elven Race. It also includes 14 new skirmish maps to test hone your skills.\nKey features\n\nNew campaign that continues the Elven Storyline\n14 new skirmish maps to test gamer's skills\n5 playable races to choose from; the Empire; the Undead Hordes, the Mountain Clans, the Legions of the Damned, and the Elven Alliance\nThe Elven tech tree allows players to choose between Noble or Wild Elves increasing replayability\nOver 200 individually animated unit types and over 100 different spells\nScenario editor to create your own adventures\nBattle friends and enemies in multiplayer over LAN, Internet or Hot-Seat play\n","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Strategy First","platforms":[{"id":0,"name":"PC"}]},{"id":10016,"name":"Of Guards And Thieves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc3/cc31552c3267d4101e31d7661deaef4a.jpg","description":"Of Guards and Thieves is a multiplayer stealth game in which high-powered guards face off against fast and elusive thieves in a contest of wits. Outsmarting the enemy and shooting your way through to the goal are equally valid strategies. A game with simple rules, emergent gameplay and high replayability, Of Guards and Thieves is sure to be a showstopper in your gaming collection!\n\nAsymmetric Stealth multiplayer tactical action.\nLots of Classes, unique Gadgets and Weapons.\nInnovative Dynamic Lighting System.\nInteractive Environment.\nCompetitive and Fun game modes.\nLeveling System with experience points.\nRich and Deep Tactical Teamplay!\nMap Workshop with hundreds of user-made maps to explore!\nDedicated server - Enjoy the game on our 24/7 dedicated servers, bigger game, less lag, more fun!\n28 unique Classes.\nMore than 46 unique Weapons and Gadgets.\n56 unique profile Avatars.\n50 unlockable levels.\n... and more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Subvert Games","platforms":[{"id":0,"name":"PC"}]},{"id":10005,"name":"SEUM: Speedrunners from Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76d/76d4a32df624f52f320644a61e264076.jpg","description":"SEUM: Speedrunners from Hell is the world’s only competitive heavy metal first-person platformer.\nSlice every last millisecond as you race and blast your way through deadly arenas. Teleport, jump, fly, bounce and drop in a hundred merciless and fast paced maps for the ultimate prize: Your soul!\nMarty was having a late morning breakfast and minding his own business. The demon knocking on the door wasn’t part of his morning routine. Before Marty was able to open, the hell breed smashed in the doors. A fierce brawl commenced and Marty lost his right arm – but at least the demon also lost his head. Unfortunately, whilst the brawl erupted more demons entered his garage and stole his last batch of limited edition Walrus Ale (tm). Now Marty has become furious! He ripped off the demon’s arm and did some DIY to re-attach his arm back to himself. This demon is no looker but gee it casts some nasty fireballs. Marty’s (after)life now has a single purpose: Go to hell and get his beer back!  \\m/\nLike a bastard child of Quake 3 and Super Meat Boy, SEUM: Speedrunners from Hell is truly hardcore and focuses on speed and fast reaction. Race and jump over platforms and bounce pads and shoot fireballs to reach an exit portal in the minimal amount of time. Reverse time and gravity. Compete with all players for the top time in the online high scores. Only the toughest players will receive the Uber Skull medals!\nIf mind blowing speed and pumping adrenaline through your body is too boring, then search for the beer cans deeply hidden in each level. Who knows which secrets can be discovered by finding all of these delicious refreshments?FeaturesCan’t get much more old school than this!\n100 levels, each more devilish than the last, with secrets around every corner.\nShoot fireballs, reverse gravity, teleport and dodge obstacles to solve challenges.\nLeaderboards in each level so you can see how you fare against your friends (and enemies).\nAn original soundtrack that'll make you rampage through the levels with blazing speed.\nLevel editor\n666\nWarning: SEUM has been known to cause leaning disease. Symptoms are irrational leaning forward towards your screen when making difficult jumps. Smashing monitors with your head is not a way to beat the game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":3424,"name":"STARWHAL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/222/222aec69920a997bf84e959080fca823.jpg","description":"The local multi-player space narwhal fighting game that has rocked the internet is finally ready for its big debut in a fully loaded release!\nFlop it out with 1-4 players in a retro, epic narwhal battle in space! The heart-piercing action is furious and unrelenting. STARWHAL will change your life.\nInspired by countless couch-gaming gatherings over the decades, we wanted to bring something competitive, creative, and immediately fun to the table. Our original prototype was conceived and developed in 48 hours with focus entirely on these areas. From that came the phenomenon that is STARWHAL.\nSTARWHAL is a simulation of dreams in an ocean of the mind.Features:4 player local multiplayer mayhem - 90+ costumes, 25 arenas, and 4 game modes to duke it out with friends or AI players.\n32 single player Obstacle and Target challenges with leaderboards, ghost replays, and achievements.\nSuccessfully made it through Steam Early Access, shaping the game around the feedback from fans around the world.\nNew radical graphic effects!\nYou can be a space narwhal wrapped in a burrito.What people are saying:\"Starwhal is one of the best multiplayer games of the year, chaotic and intensely competitive\"\n-IGN\n\"If Jacques Cousteau were here, he'd sh*t all over the floor.\"\n- Wiley Wiggins on STARWHAL\n\"Get a friend. Play this NOW. I'm laughing so hard\"\n- Sean \"Day[9]\" Plott\n\"This game is awesome\"\n- Achievement Hunter\n\"This large hairless intergalactic aquatic mammal simulator will bring out the 'Ooo!', \"Aaa!' and 'So CLOSE!' in everyone\"\n- Ross Kenry O'Donovan (Distinguished Conductor of the Steam Train)\n\"Starwhal brings bloodthirsty neon space whales into an entirely new dimension, capturing the spirit of local co-op deathmatches like only a neon space whale can. We couldn't recommend it more.\"\n- Polaris","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Breakfall","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22158,"name":"Kingdoms and Castles","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a30/a30b57e4ba735dbc2641885379d00778.jpg","description":"Kingdoms and Castles is a game about growing a kingdom from a tiny hamlet to a sprawling city and imposing castle.\nYour kingdom must survive a living and dangerous world. Do the viking raiders make off with your villagers? Or are they stopped, full of arrows, at the castle gates? Does a dragon torch your granary, your people dying of starvation in the winter, or are you able to turn the beast back? The success of your kingdom depends solely on your skill as a city and castle planner.\nStrategically layout your town to improve your peasants' happiness and to attract new residents. Tax them just enough to fund your castle. Make sure your peasants are fed in the winter and healed of plagues. Build churches to keep them from despair and taverns to keep them happy. You can even throw festivals if you've built a town square! Send out wood cutters to collect wood, set up stone quarries to build your castes, and farm the land efficiently so your town can grow and thrive.\nThe new land you're settling is at risk of viking invasion. These raiders seek to kidnap and kill your peasants, steal your resources, and burn your town to the ground. Use a powerful castle building system where castles are constructed using blocks which can be placed anywhere. Towers and walls are dynamically created based on how you stack and arrange them. Archer towers and other weapon emplacements have longer range the higher their tower. Try different layouts to best protect your kingdom and express your glory as a king or queen.\nAnd it all takes place in a beautiful dynamic world with a stylized procedural cloud system and season cycle from summer to winter.  A realistic tree growth algorithm simulates the forests. Depending on your needs, wood cutters can clear cut or responsibly manage your forests.\nKingdoms and Castles is the first Fig funded game to be released. Its crowd funding campaign succeeded with 725% of its goal and was supported by 1,400 backers. Supporters of the game could both pledge and invest during the Fig campaign.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Lion Shield","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12030,"name":"sZone-Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f69/f697eb040835dbcef9e23fee3926a066.jpg","description":"This is a story of human pride. Time is at hand when, in their utter desire to study the world, people will start destroying it. Tests of high-energy heavy particles accelerators will result in billions of microscopic black hole rupturing the structure of time and space. This will become the point of no return. A counter-strike from nature itself will follow and the Earth as we know it will cease to exist.\nThis is a story of human strength and true heroes. Three generations after the apocalypse, not only did humankind survive in the man-made hell – it continued to develop. Gradually, the infrastructure restored, wars stopped, people were returning to normal life. However, the crippled nature was barely starting to fight back...\nSo-called anomalous activity zones started appearing all over the planet, like terrifying scars left by the man-made catastrophes. The vast territories of post-apocalyptic world live their own life, which looks like nothing you have seen before. Bloodthirsty mutated monsters, inexplicable phenomena, mysterious anomalies are but the tip of the iceberg.\nOne of the Zones was formed in the vicinity of Ukraine, in an area combining the unmistakable atmosphere of Soviet times and the fast pace of modern life. In order to contain the dangers of the Zone, the government decided to fence the perimeter, and introduce quarantine in the area. Local residents found themselves trapped and left to their own devices. However, forbidden fruit is always the most enticing. And this was when the \"stalkers\" came in. Mystical artifact hunters, former military men, explorers, adventurers, armed gangsters, mafia and just those who love getting away with shooting live targets – they swarmed in like locusts in Egypt to lead mortal combat with monsters and humans alike.\nThis is a story about YOU.\nThere is a non-stop battle between stalkers' clans, between aliens and locals. You can support any side or remain a free shooter. You can give a dota tion to your mates as a leader or take every loot to yourself. And if you don't want to lose your life in a proxy war, there is a PvE server and safety zones. You can shape your own story in the Zone.\nWho will you become?\nOver 40 square kilometers of lands to explore, from closed science villages and abandoned military facilities, to the forests of Tunguska and snowy deserts of Terra Nova.\nDeadly mutants, anomalies and hundreds of main story quests.\nHuge choice of artifacts, gear and weapons.\nRepair broken things or assemble new gear from scratch.\nImprove dozens of skills and abilities.\nBe a doctor, a scientist, a hunter, a soldier or an engineer. Take part in mass PvP, bring death or salvation to those around you.\nThis is the Zone. Come to hell and make it your home.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cybertime System","platforms":[{"id":0,"name":"PC"}]},{"id":2271,"name":"Guitar Hero Live","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/380/380bed1fdb7b588a048e2953dcbb3a67.jpg","description":"Guitar Hero® is back!\n\nDownload Guitar Hero Live (touch version) at a reduced price on your iOS device now!\nPlay Guitar Hero Live on the go on your iPad, iPhone, or iPod touch or enjoy a living room experience on your TV*! Rock out to two FREE trial songs, then continue your tour by buying the GUITAR CONTROLLER BUNDLE or purchasing the DIGITAL touch only version.\n\nOne game, two ways to play!\n\n1. Guitar Hero Live puts you on stage rocking reactive live-action crowds.  Guitar Hero Live is all about the dream of becoming a rock star.  You will play with REAL band members, playing to REAL crowds, with REAL reactions to your performance.  Play well and the crowd will love you! Play poorly and your fans will turn on you!\n\n2. GHTV is the world’s first playable music video network that lets you play along to official music videos and more! Jump into one of the GHTV channels anytime, 24 hours a day, 7 days a week and get rocking!\n\nGuitar Hero Live for iPhone, iPad, and iPod Touch (available at your local or online retailer)\nBuy the all new iOS GUITAR CONTROLLER BUNDLE to gain access to a huge library of Guitar Hero Live and GHTV songs as well as the brand new re-invented 6 button BLE guitar controller. The new controller makes the game easier for beginners and adds new levels of challenge for expert players!\n\nThe GUITAR CONTROLLER BUNDLE and DIGITAL versions include:\n* Over 40 Guitar Hero Live tracks to play and master\n* Access to the GHTV channels featuring over 200 songs at launch\n* iOS touch gameplay so you can take your game on the go!\n\nSupported Devices:\n* iPad 4, iPad Air, iPad Air 2\n* iPad mini, iPad mini 2, iPad mini 3, iPad mini 4\n* iPhone 5, iPhone 5c, iPhone 5s, iPhone 6, iPhone 6 Plus, iPhone 6s, iPhone 6s Plus\n* iPod touch 6\n\nGame Requirements:\n* Internet Connection\n* iOS8 or higher\n* Minimum storage of 3GB\n* BLE for Guitar Controller\n* A Game Center account is required to play GHTV\n\n*TV play requires Lightning Digital AV adapter and HDMI cable or Apple TV, all not included.\n\nACTIVISION MAKES NO GUARANTEES REGARDING THE AVAILABILITY OF ONLINE PLAY OR FEATURES, INCLUDING WITHOUT LIMITATION GHTV, AND MAY MODIFY OR DISCONTINUE ONLINE SERVICES IN ITS DISCRETION WITHOUT NOTICE.\n\n© 2015 Activision Publishing, Inc. ACTIVISION, FREESTYLEGAMES, GUITAR HERO and GH are trademarks of Activision Publishing, Inc. The ESRB rating icons are registered trademarks of the Entertainment Software Association. All other trademarks and trade names are the properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Activision","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":484852,"name":"Roboquest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ea/9ea42d0a6990dd4831826e8b52533769.jpg","description":"Roadmap\nAbout the Game\nRoboquest is a fast-paced FPS Roguelite, playable in solo or 2-player co-op. Jump into the steel shoes of a high-powered, hyper-mobile robot and fight like you’ve never fought before.\nRun through randomly generated environments on an unrecognizable Earth. Scorched canyons and vivid cities packed with secrets, upgrades, and enemies.\nDestroy every laser-shooting evil bot and boss that stands in your way, choosing from an arsenal of handcrafted weapons to do so.\nGather powerful technology to help you push forward. Upgrades, abilities and customization for your character and basecamp. They’ll stick with you after each defeat, to make the next run a little easier.\nThe year is 2700. Humans live scattered through the desert, struggling to survive. It’s looking pretty bleak.\nUntil a young scavenger girl named Max stumbles across something that may help. An old Guardian robot, lying abandoned in the sand. She reactivates him, knowing that with a Guardian by her side, she may be able to give mankind a fighting chance…\nTogether, the two begin to explore the mysterious canyons that surround them, searching for answers and a way to survive.\nThere’s just one problem. The canyons are crawling with evil bots, determined to stop them from advancing. But who’s controlling them? And what are they guarding within?\nTight controlsPlay the Guardian as if he were an extension of your own hands. Controls are fluid and highly responsive. Nothing gets in the way of your battle dance.Extreme mobilityYou’re fast. Like, really fast. Mastering movement is vital for progression - jump, dodge and annihilate enemies before they even know what’s hit them.Run, fall, run againThe feature that makes a Roguelite so challenging. No checkpoints. Prepare to keep fighting until you master a level, with persistent rewards to push you further each time.Choose your pathThe game serves up fresh, organic 3D environments at random to keep you on your toes. Each run will feel different from the last. Be ready.\nCharacter loadoutFrom the very first fight, you’ll be able to choose from several loadouts of Guardian, each with their own playstyle and abilities.UpgradesEvery loadout comes with its own bundle of unique upgrades for the Guardian, so you can further customize how you play.Custom loadoutIf you want even more choice than that, you can always create and customize your own loadout. Bring down the bots any way you like.\nGamepadRoboquest fully supports gamepad use (some parts of the game and some interfaces might require the use of a mouse for the duration of the demo and during development).SecretsUncover secrets spread out across the game, to gain rewards and piece together parts of the story.Join the community on Discord!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"RyseUp Studios","platforms":[{"id":0,"name":"PC"}]},{"id":23501,"name":"Underhero","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa8/fa88903fbc88f11a3d1e01763eb43c58.jpg","description":"DESCRIPTION:\nUnderhero is a 2D side-scroller RPG adventure game with timing-based combat. It tells an intriguing and mysterious story, full of silly characters brimming with personality, quirky dialogue, and lots of weird humor.STORY:\nInspired by Paper Mario games and RPGs in general, it tells the story of a world where the chosen hero has failed and an underling of the main villain takes his place as the new “hero”. Join the magical hilt Elizabeth the IV and the little Masked Kid, as they travel the world to restore Elizabeth’s long lost power, so they can defeat the tyrannical Mr. Stitches and save the world once and for all!FEATURES:\nA sidescrolling RPG adventure full of beautiful pixel art and cartoony aesthetics.\nTurn-based combat with a twist: there are no turns! All you have is your reflexes and your timing. We call it timing-based combat.\nAttack to the beat of the music to chain rhythm combos! Groovy~\nEnemies consider you their ally, so you can talk to them!\nA wonderful original soundtrack composed by Stijn van Wakeren.\nAn always evolving HUB world full of characters.\nMini games and side-quests!\nLight puzzle elements.\nSome good old platforming.\nFun and intense boss battles!\nA satire of RPG tropes.\nA story shrouded in mystery…","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Paper Castle Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":21403,"name":"Pixel Puzzles 2: Anime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed9/ed940d71bb94a322c29c45b413bb7139.jpg","description":"Pixel Puzzles 2: Anime is a traditional style jigsaw puzzle game, featuring 25 hand drawn images in a Kawaii style, with each puzzle piece uniquely shaped in a way no physical puzzle could be.\nUse Pixel Pixie's dust powers to help solve puzzles. Ghosts, rotations, locations - the pixel pixie can help with it all, because no pixel puzzling anime experience would be complete without a fairy addicted to dust!Features:25 puzzles in a range of sizes from 60 to 350 pieces.\nAuto saving, never lose your progress.\nChearful kawaii atmosphere.\nTraditional puzzle gameplay.\n27 Steam Achievements.\nPuzzle piece rotation.\nInteractive play environment.\nAwesome hand draw anime artwork.\nPower ups to help solve puzzles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":14355,"name":"Space Pilgrim Episode II: Epsilon Indi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/108/108f54e2ec16b3cc351a197444cac591.jpg","description":"One year after the events of Episode I, Captain Pilgrim is once again carrying a shipload of passengers between star systems. This time her guests include a mysterious priestess, a wayward youth and a robotics genius.\nLittle does she know that this latest journey will set her off on another hazardous adventure, involving a shadowy government organisation known as the Jackals ...\nFeatures:\nIn this second episode, continue the adventures of Captain Pilgrim and her cynical co-pilot Sabina White as they are pulled into a fresh web of danger and intrigue, encountering new friends and foes\nExperience a larger and more expansive story which reveals many new elements of the Space Pilgrim universe\nAcross the four episodes in this saga you will travel to space stations, colonies, cities and islands across an immersive and intricate futuristic universe, interact with dozens of unique characters and enjoy 10+ hours of gameplay (Please note: this purchase is for episode two only)\nMouse, keyboard and controller support","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":8433,"name":"Halo Wars 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7da/7da8472b0003bd6fc435302ea4e3deb7.jpg","description":"It’s the Halo experience you’ve dreamed of – controlling entire armies of Marines, Warthogs, Scorpion tanks, and Spartans on the battlefield from the Commander’s point of view. Halo Wars 2 is a real-time strategy game playable in native 4K Ultra HD graphics with HDR on the Xbox One X and Windows 10. Halo Wars 2 also supports Xbox Play Anywhere: Buy once, play on both Xbox and Windows 10.\nAll-new, Action-packed Story – The heroes of Halo Wars awake to find themselves - and the galaxy - in more danger than ever. Following the events of Halo 5, the all-new story is told in action-packed missions set on the legendary Halo destination known as the Ark. Players will command overwhelming firepower in large-scale battles against a terrifying threat facing the UNSC and all of humanity.\nBuild Your Halo Army – Construct your bases, prepare your vehicles and amass your troops. Lead them into huge battles across campaign skirmish matches against the AI, and with and against friends in up to 3v3 matches on Xbox Live. Learn new strategies as you play as different leaders across Blitz and Multiplayer game modes.\nWith Halo Wars 2, you’ll be able to explore and battle in the Halo universe like you never have before.\nOnline multiplayer features require Xbox Live Gold membership (sold separately).\nPHOTOSENSITIVITY SEIZURE WARNING: A very small percentage of people may experience a seizure when exposed to certain visual images, including flashing lights or patterns that may appear in video games. Visit Xbox.com for more information.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Creative Assembly","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":58606,"name":"Pokémon: Let's Go, Pikachu! and Eevee!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6a6/6a68e7e64bf02c9e9b0f090491df93e9.jpg","description":"Pokemon: Let's Go, Pikachu! and Let's Go, Eevee! are two versions of the same game based on the Pokemon franchise. They are the first Pokemon games made for Nintendo Switch. Both of them are loose remakes of the 1998 game Pokemon Yellow that was released for Game Boy. Both games are set in the region of Kanto in the Pokemon universe. \r\n\r\n###Gameplay\r\nAs usual in the Pokemon games, the players use their Pokemon (small monsters) to fight against other Pokemon, either wild or controlled by other characters. Unlike in the classic Pokemon games, however, Pokemon: Let's Go, Pikachu! and Let's Go, Eevee! are based on a mechanic similar to Pokemon GO. Using the Switch Joy-Con, the player throws Poke Ball at the wild Pokemon. \r\n\r\nAt the beginning of the game, the player only has one Pokemon, either Pikachu for the former version of the game or Eevee for the latter. Unlike in most Pokemon games, the player's Pokemon don't have to stay in the Poke Balls all the time. Pikachu and Eevee perch on the player character's shoulder, and the player can choose another pokemon to follow his or her main character.\r\n\r\n###Characters\r\nThe two games only feature 151 playable classic Pokemon as well as their various forms, but not the whole Pokemon roster. The player can connect his or her Switch to the smartphone to upload the Pokemon he or she already has in Pokemon Go. The characters' appearances are customizable, including their gender.\r\n\r\n###Multiplayer\r\nBoth games allow cooperative multiplayer for two players. They can share a single Nintendo Switch by taking either of its Joy-Cons.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":13861,"name":"UnderRail","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6a/b6a73cc59cb3c56702521a8a3134e85e_ZYSDZDA.jpg","description":"Underrail is an old school turn-based isometric indie role playing game that focuses on exploration and combat.\nThe game is set in a distant future, when the life on the Earth’s surface has long since been made impossible and the remnants of humanity now dwell in the Underrail, a vast system of metro station-states that, it seems, are the last bastions of a fading race.\nThe player takes control of one of the denizens of such a station-state whose life is about to become all that much more interesting and dangerous, as our protagonist is caught midst the conflicting factions of the Underrail as the violently struggle to survive in the harsh underground environment.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Stygian Software","platforms":[{"id":0,"name":"PC"}]},{"id":10558,"name":"The Culling","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/559/559e4c7b865d533ad3079d50f770d013.jpg","description":"**IMPORTANT NOTICE** The Cullings servers will be shut down on May 15, 2019. This means online matches, the culling store, and all online features will no longer be available.                                                             \n\n\nWelcome to The Culling. As a contestant on this deadly game show you must explore, scavenge items, craft weapons, and build traps that will enable you to slay your fellow contestants and emerge victorious before the end of the round. Only with cunning, skill, and a little luck will you be able to prevail and survive the match.\nUnlike add-on modes in open-world survival games, The Culling redefines the Battle Royale genre by providing a tightly focused stand-alone experience that delivers incredible thrills and endless story-worthy moments.\nFeatures at Early Access LaunchGame ModesThe core of The Culling is an online 16-player battle royale, played solo or in teams of two. Matches last approximately 20 minutes, with deadly poison gas slowly constricting the arena in the final stages. The winning player (or team) is the last left alive.\nThe new, fast-paced Lightning Round mode pits 8 contestants against each other in a smaller arena with a 10-minute  timer, where everyone has immediate access to some of the most powerful weapons in the game.\nWith no respawning on death, you have to make every action count. Play too cautiously and you won’t be prepared for the final clash at the end of the match, too aggressively and you might not make it past the first few minutes. We leave the balance, and the killing, up to you.Weapons and CombatThe Culling focuses heavily on melee combat. Use jabs, charged swings, blocks, and shoves in a system that’s simple learn, but requires practice to truly master.\nThere are 32 melee weapons in the form of blades, axes, bludgeons, and spear. Weapons are divided into tiers based on damage, from the lowly crafted stone knife to the mighty Sledgehammer. Different weapons types also apply different wounds, which factor into combat strategy. All melee weapons can be thrown, adding the potential for ranged combat in any encounter.\nThere are a variety of ranged weapons, including bows, blowguns, and even firearms. A gun isn’t a guaranteed kill, however, as ammunition is in short supply and ranged players can be disarmed by melee strikes if they don’t keep their distance.TrapsPlayers who thrive on outwitting their enemies can sample from a collection of traps in the form of snares, mines, remote-detonated explosives, caltrops, and punji sticks. Matches are fast-paced, so sneaky players must lay their traps in hot spots (such as near an airdrop landing pad) or use themselves as bait to lure opponents in.ItemsA wide range of utility items are at your disposal, with everything from backpacks to smoke bombs, run speed stims to stun guns, player tracking devices to bandages. You start each match empty-handed, so you must explore to survive. Inventory space is extremely limited, forcing you to think carefully about how you intend to play and what you want to carry.CraftingThe Culling utilizes a unique crafting system that is very simple to use (no bulky UI-heavy inventory management) but still offers a wide range of recipes. Players can craft rudimentary weapons, a wide range of traps, and a handful of useful items, including bandages, satchels, and even body armor.PerksEach contestant chooses 3 perks before the start of a match. There are dozens of perks available, and they range from combat bonuses (increase the backstab potential of your blades) to crafting skills (reduce your trap placement time), to general utility (begin the match with a tracking device in your inventory).\nAll of the perks are available to all players from the start with no unlocking required. You can use perks to define and enhance your personal play style, whether it be focused on ranged, melee, or trap-based strategy. Advanced players will find helpful synergies between their perk load-out and their airdrop selection.AirdropsPlayers select a personal airdrop to call in during the match. Air drops are deadly care packages containing a predefined variety of weapons, traps and items. Be careful, because calling in an airdrop draws attention to you and can be stolen by other players.Game Show EventsThe Culling is the most popular game show in the history of the world, and for good reason. The show’s producers have devised events that take place at random during the match. If you choose to participate in these events, the rewards can improve your chances of winning, but don’t be surprised when other players arrive to challenge you.FUNCFlexible Universal Nano-Compound, or FUNC, serves as the primary in-game currency. You spend FUNC to craft, call in personal airdrops, and open certain types of item chests. FUNC is gained through combat and exploration.Character CustomizationPlayers can customize every aspect of their appearance: Hair, Clothing, Skin Tone, and Gender. There are hundreds of unlockable items.\nThe Culling also features customizable Taunts, Victory Celebrations, Culling Cards, and Weapon Skins.\nIn all, there are more than 1,500 cosmetics to unlock.AudioThe Culling places a heavy gameplay emphasis on audio. Making noise by sprinting through the jungle crafting items, slamming doors, and engaging in combat will draw the attention of nearby contestants.\nUsing audio cues to locate opponents and using the crouch mode to conceal your movements add tremendously to the game’s suspense and immersion.MapsThe Culling features two maps: The Island, set in a tropical paradise, and Cul County Correctional, a former prison facility converted to game show duty. The maps have been carefully tuned to provide just enough space for 16 contestants, but also to ensure than no one is safe for long. They are populated with landmarks, buildings (full of lockers and crates containing items), hidden caches, and hazards.\nMany of these elements are random, meaning map knowledge is important, but offers no guarantees. When the match starts, you can choose to immediately set about crafting some basic survival tools, or sprint to the nearest building in the hopes that it will contain valuable items.Tutorials and Offline Training ModeThe Culling can be intimidating for new players, so we’ve included a basic tutorial and a training range to help you get your feet wet.\nIf you’re still not ready to face players online, there is an offline practice mode against basic AI-controlled bots that will allow you to practice in a low-pressure situation.Player XP and LevelingAs you compete online in The Culling, you earn XP, which levels up your character and awards you Cull Crates full of new cosmetics. The better your performance, the faster you progress.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Xaviant","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":8946,"name":"Super Sanctum TD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c9/8c9805b8c5e84ab0ff79c37daa26337c.jpeg","description":"Super Sanctum TD is a retro-styled Tower Defense game that focuses on strategy, customization and replayability. Build advanced mazes and construct powerful towers to prevent alien hordes from reaching the Core! When the aliens swarm your maze and everything seems lost, use active abilities like Air Strike and Freeze to tilt the battlefield to your advantage!\nStrategy and skill are leading principles of Super Sanctum TD. Carefully choose your loadout of towers and active abilities before each level to make sure you can handle everything that will be thrown at you. Each battle is rewarded depending on your performance, and you can use these rewards to gain access to Perks that let you tweak and specialize your strategies even more!\nCarefully plan your maze to master the game on all difficulties.\nTowers like Gatling, Flamer and the Automatic Crowd Pummeler, all with their own individual strengths.\nIntercept enemies from reaching the Cores with active abilities like Smart Bomb and Gravity Shift!\nVast perk system that lets you specialize specific towers, abilities, and more!\nProve yourself as the ultimate Core defender by defeating the game on all difficulties and game modes.\nSquare up against the best for a spot on the leaderboard by putting your deadliest strategies to the test in Survival Mode!\nSuper Sanctum TD has recently recieved a major overhaul with a revamped UI, new perk system and rebalanced gameplay!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Coffee Stain Studios","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4329,"name":"BloodRayne 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bae/bae9665e880bcbbf24cba67ecb506da2.jpg","description":"BloodRayne is a dhampir, born from the unnatural union of vampire and human. Blessed with the powers of a vampire but cursed with the thirst for blood and a weakness to sunlight, Rayne is challenged with her most personal battle yet as she hunts down her siblings. They have banded together and pledged to carry on their father's legacy of creating a new era of vampire supremacy where humans are mere cattle. Rayne's siblings have created 'The Shroud,' a mysterious substance that will render the sun's lethal rays harmless to vampires. Now only BloodRayne stands between an unsuspecting humanity and a horrifying vampire dawn.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":877,"name":"My Name is Mayo","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/300/300e0eeea1fe9e374209d0838605a031.jpg","description":"If you are looking for a next generation gameplay experience and an engrossing open world environment...!!! Well, this is not that game... This is the touching story about a Mayo Jar.\nThis is a clicking adventure that simulates the real-life tapping of a Mayo Jar! You will unveil its story and (maybe) you will learn from it, while you unlock 50 achievements!!Key Features\nUnlock Random Facts!\nDiscover the 4 different stories!\nUnlock 50 unique achievements!\nCollect the hand-made Steam Trading Cards!\nCompete with your friends and the world with the online leaderboard!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Green Lava Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":282807,"name":"Dragon Quest Builders 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ff/0ff66c8eb89b99211cc7af2a72ba73f5.jpg","description":"PRE-PURCHASE AND EARLY PURCHASE OFFER\nPre-purchase now or early purchase the game till Monday, 6th January 5pm GMT inclusive, to receive this exclusive bonus content including:\nMedicinal Herb Decoration: a recipe for a decorative Medicinal Herb\nDragon Quest Logo Decoration: a recipe for the famous DRAGON QUEST logo.\nChimaera Wing Decoration: a recipe for an ornamental Chimaera Wing\nSigil Blocks: five recipes for blocks which have either a Sun, Moon, Star, Water drop or Heart symbol\nLo-Res Luminary Recipes: a set of recipes for building the Scions of Erdrick\nLegendary Line Art Recipe: a recipe for a painting of the Scions of Erdrick\nThis bonus content will be available when DRAGON QUEST BUILDERS™ 2 releases.\nAbout the Game\nDRAGON QUEST BUILDERS 2 is the critically acclaimed block-building RPG from DRAGON QUEST series creators Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama – now for Steam players!\nThe Steam version includes all the Season Pass content previously released on console versions:\nHotto Stuff Pack, Modernist Pack, Aquarium Pack, Designer’s Sunglasses, Legendary Builder Outfit, Dragonlord’s Throne, and more!\nDon’t let the name fool you, despite the 2, this is a completely standalone experience featuring new characters, an expansive world, unlimited building combinations, and a storyline that’s sure to satisfy long-time fans and newcomers alike!\nEmbark on an epic journey and became the master Builder! Customized your character and set off to revive a forsaken world alongside a mysterious companion named Malroth. Then, take your builder online and join your friends to collaborate and create something truly magnificent.\nThe evil Children of Hargon are determined to eradicate all creators and have outlawed the building, cooking, and creation of all things. To spread their destructive dogma, the calamitous cult captures the builders of the world. All hope seems to be lost until you, a young apprentice builder, manage to escape from the clutches of evil.\nAfter washing up on the shores of the deserted Isle of Awakening, you encounter the spirited Malroth, a mysterious youth with no memory of his past. With the help of your fearless new friend, you embark on a grand adventure to gather the skills required to become a full-fledged builder, but the road you build is paved with peril. Only you can defeat the Children of Hargon, uncover the secrets of Malroth’s past, and unravel the riddles of this mysterious land.\nBlock-building RPG – Prove yourself as a Builder and a Warrior, help the people of the realm to rebuild their destroyed lands. The more you help the more you’ll receive hearts and recognition. Prepare for a cure of creativity and friendliness!\nCreative open-world – Construct big structures in this fantasy block world with a large variety of options.\nExplore, gather, and craft – Each island contains its own set of unique materials to help you grow, craft, and cook new creations. Along the way you’ll improve your skills and grow as a builder as you learn new recipes and blueprints.\nBattle fearsome foes alongside your partner – Accompanying you on your quest is the mysterious Malroth, an aggressive amnesiac with a fondness for fighting foes. His powerful attacks and skills on the battlefield are truly indispensable!\nDash, swim, and glide across an expansive world – Run across open fields and explore charming villages, treacherous mines, and spectacular castles. Dive into the watery depths to discover hidden treasures, climb the highest mountain to catch the sunset, and glide home to rest up for your next day of adventure.\nPlant, water, and grow! – Work together with your villagers to till soil, plants seeds, and raise a multitude of crops. Be sure to customize the way you build your fields to support the kind of crops you’re growing. Harvest anything from the humble cabbage to sweet sugar canes!\nDesign and Build with Friends Online – Big projects require big help! Up to 4 players can team up online to build anything you can imagine on the sandbox Isle of Awakening.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":27969,"name":"The Legend of Zelda: Ocarina of Time 3D","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c91/c916af1fa182bc2d674b4d9270bb7713.jpg","description":"The Legend of Zelda™: Ocarina of Time™ 3D takes the Nintendo 64™ classic – one of the most critically acclaimed games ever made – and returns it to the Nintendo 3DS system with the added depth and realism of stunning, glasses free 3D visuals. In this game, Link™ sets off on a legendary journey through time to stop Ganondorf, the Gerudo King of Thieves who is seeking the Triforce, a holy relic that gives its holder ultimate power. The graphical upgrades and three-dimensional depth breathe new life into the expansive world of Hyrule. An improved and intuitive interface, coupled with the easier navigation offered by playing in a world with 3D visuals, give players better control as they solve puzzles, travel through time and explore this immersive world. Whether you're a first-time player or a regular visitor to Hyrule, The Legend of Zelda: Ocarina of Time 3D is a new adventure for everyone.\n\nFEATURES:\n\nA Zelda classic now in glasses-free 3D. Amazing 3D visuals and a complete graphical overhaul bring one of gaming's most beloved and celebrated franchises to life, putting the awe-inspiring world in the palm of your hand for you to explore whenever you like.\n\nNew controls using the Nintendo 3DS system's technologies. The Legend of Zelda™: Ocarina of Time™ 3D retains the analog control of the original with the Circle Pad on Nintendo 3DS, but greatly improves ease of use with a touch-based inventory system.\n\nSwitching items has never been simpler or quicker. Players can also use the first-person shooting (camera-controlled) feature utilizing the gyro sensor.\n\nPrice effective March 11, 2016.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":15825,"name":"Stronghold Legends","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa2/fa2d4e461385ee36412a58e25f4a8107.jpg","description":"Lead the siege as fantasy characters throughout history! Stronghold Legends: Steam Edition takes the beloved castle building series and plunges it into myth and legend with three unique factions and new Steam-exclusive content. Play as King Arthur and command his Knights of the Round Table, ally with the demonic Vlad Dracula or relive the heroic saga of Siegfried of Xanten in 24 story missions. Build and destroy castles using powerful spells, mythical beasts and legendary hero units!\nKey Features\nRemastered for Steam - Steam multiplayer, Workshop support, achievements, new maps, a digital art book, trading cards and DLC campaigns.\nBecome Legendary Heroes - Unique fantasy setting with campaigns following the exploits of King Arthur, Siegfried and Vlad Dracula.\nCommand Mythical Beasts - Three playable factions with access to frost giants, creepers, werewolves and more!\nCast Powerful Spells - Hero units ranging from the wizard Merlin to fire breathing dragons and the Knights of the Round Table.\nBattle AI Lords - Skirmish multiplayer against computer-controlled opponents and human players.\nBesiege Players Online - Deathmatch, King of the Hill, Economic War and Capture the Flag game modes.\nSteam Edition\nInspired by medieval folklore and introducing magic to the series for the first time, Stronghold Legends adds new environments, units, challenges and gameplay with each single player campaign and bonus trail. Catapult werewolves over castle walls, incinerate troops using dragon fire or command mighty ice giants to obliterate enemy defenses! Go online with up to four players in competitive multiplayer over Steam or skirmish offline against computer-controlled opponents.\nCreated exclusively for Steam, Stronghold Legends: Steam Edition comes with full Steam multiplayer, achievements, new maps, a digital art book, trading cards and all DLC campaigns. The Steam edition also updates Legends with full Steam Workshop support! Sculpt an icy tundra to wage war on, a scorched earth battleground using the evil terrain type or conjure up a magical kingdom fit for King Arthur himself.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":11755,"name":"Runaway, A Road Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/794/7940e3fec37400fd87fc2d5b92360bd4.jpg","description":"New York, 2000...\n...Without knowing how or why, Brian, a student on the verge of graduating from college, is attacked by Mafia gangsters.\nDuring his desperate getaway, in the company of a mysterious striptease dancer, he ends up meeting a wide range of unusual characters. But which ones are trying to help him and which ones are planning to blow his head off?\nYou will have to be very ingenious to figure it out, without forgetting that nobody is who they seem in this explosive mixture of murder, money, ambition, santeria rituals and deception...a whole lot of deception.\nApproximately 100 settings that are visually rich, containing 30 interactive characters.\nCharacters with soft edges, real-time lighting and shading effects, camera changes, panoramic shots and more.\nHigh-quality stereo sound, an original soundtrack with over 24 songs.\n3D characters with a cartoon look and high-impact visual features that include 2D and 3D in an unmatchable style.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Pendulo Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":384491,"name":"Surviving the Aftermath","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f38/f38e2ecafb89450d772a746c5ebec59b.jpg","description":"NO PLACE LIKE HOME\nBuild and manage a colony of survivors after a world-ending event. Construct more than 50 unique buildings to handle everything from resource collection and farming to exploration and security. Don’t forget to construct the Gate to venture into the savage world beyond your colony.\n\nSURVIVING EARTH\nExplore a vast procedurally generated world featuring six different biomes filled with exploitable resources, bandits, and more. Each environment has different conditions that will affect your colony’s survival. Stay vigilant: Natural disasters will put your survivors to the test.\n\nSURVIVAL IS MY SPECIALTY\nRecruit over 46 unique Specialists, each with their own skills and motivations, to manage your colony’s resources and production. Send them beyond the Gate on scientific missions, scavenger runs, and to fight bandits.\n\nEXPECT THE UNEXPECTED\nLife in the aftermath requires you to make moral choices. You may not be able to control everything in your colony, but how you respond to situations and emergent events will shape the character of your new civilization.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":288586,"name":"Atomicrops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7da/7da01b56a37d5f6e7a2193bec2da398a.jpg","description":"**Atomicrops is an action roguelite farming simulator.** Cultivate ultra-GMO crops, scavenge the wastelands of the post apocalypse, recruit a herd of helpful farm animals and maybe even find love all while battling with swarms of mutated beasts to defend your farm; the last farm on Earth. \r\n**In Atomicrops, you've got to shoot to till.**\r\n\r\n• **_FARM_** - Reap a bountiful harvest to sustain humanity… and make a huge profit. Spend your money on gun and equipment upgrades to increase your yield.\r\n\r\n• **_MARRY_** - Woo and marry a kindred spirit from the local town to fight and farm alongside you. \r\n\r\n• **_KILL_** - Fight bizarre post-nuclear pests starving for a piece of your crops. Turn your enemies into fertilizer to maximize your harvest quality. \r\n\r\n• **_UPGRADE_** - Explore the far reaches of the biomes to find useful relics of farms long past. Discover rusty farm equipment, antique gardening tools, and tomes of how-to garden guides to increase your farming power. \r\n\r\n• **_BEFRIEND_** - Recruit an entourage of pig pals, chicken chums and cow colleagues to automate farming tasks. Cultivating atomicrops is a tough job, you'll need all the help you can get.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bird Bath Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":17609,"name":"Knights of Pen and Paper 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31a/31a7f68a8d5b9f9fbcae0205942a7245.jpeg","description":"Digital Deluxe Edition\nThe Deluxiest Edition of Knights of Pen & Paper 2 includes the following bonus items and expansions:\nFist of +1 Fury\nHere Be Dragons\nBack To the Source (free update)\nEpic Mount\nArt Book\nExclusive Grinding Farm Location\nSoundtrack-  14 Songs\nAbout the GamePrepare to join Knights of Pen & Paper 2 in a turn-based, retro style, pixel-art adventure full of danger, intrigue, and semi-appropriate cultural references!\nAssemble your party and control your group of pen and paper role-players as they are guided through their adventures by the Game Master.  All the fun of pen and paper RP, none of the lost dice!\nNow including races like Dwarf or Elf, assemble the party of your choice, choose quests and combat encounters, delve into dungeons, craft powerful items, and complain loudly to the GM.\nMain features\nPlay a group of pen and paper gamers playing a pen and paper role playing game\nPunch a Panda! Explore your anger management issues in the FREE Fist+1 Fury expansion!\nCreate your own characters, how about a Rocker Dwarf Warrior or a Cheerleader Elf Monk\nMore contemporary geeky jokes than you can stuff in a CAVE! Gotta catch them all!\nLots of monsters, equipment, a crafting system, and things to customize\nThere's no paying your way to victory here!  Start with all of the content, unlock it with the blood, sweat, and gold coins, of your party!\nCustomizable hot keys, Steam Controller and Gamepad support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Paradox Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"}]},{"id":10328,"name":"fault - milestone one","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45b/45bed11eb22c8f78dffc798fdce10855.jpg","description":"Steam Exclusive OfferCustomers who buy the game will get this Steam exclusive, a digital shikishi of Ritona!\nAbout the GameThis version on Steam is the Director's Cut version that has additional content and features from the original Japanese release, all thanks to our Kickstarter backers. You can switch to Japanese by pressing the J key on your keyboard, or back to English with the E key.\nfault is a series of Science Fantasy Cinematic Novels using a unique 3D Camera system for a visually immersive reading experience, which follow the story of a princess named Selphine and her Royal Guardian Ritona. When a sudden assault devastates their homeland of Rughzenhaide, the two are forced to escape… but somehow end up teleported into an unknown forest full of vegetation they don’t recognize. The atmosphere is thick and heavy. There is no sign of life, which is very unusual for such a lush forest. Something is wrong about the land… But they are too startled to notice what.\nWho were the attackers and what was their goal?\nWhere did Selphine and Ritona end up?\nWill the two make it home safely?\nAnd more importantly, what has happened to their homeland?\nFollow Selphine, the bubbly, happy-go-lucky Princess and her sharp-witted but slightly misanthropic Royal Guardian Ritona, on their journey of a lifetime back to their homeland of Rughzenhaide.\nfault's episodes are called \"milestones\" and scheduled to be released periodically, created by ALICE IN DISSONANCE, brought to you by Sekai Project.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"ALICE IN DISSONANCE","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10190,"name":"Planet Explorers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b0/2b09efb2019731ec8514f37efa2c1219.jpg","description":"In Planet Explorers, it is the year 2287, one of the first colony ships sent out by Earth arrives at the planet Maria, in the Epsilon Indi Star System. During its landing sequence, something appears in front of the massive ship that causes it to lose control and crash into the planet. Some of the colonists survive in lifeboats, but what they find is an unforgiving land filled with creatures ready to outlast the visitors from Earth. Now the survivors must explorer, gather, build, create, fight, and ultimately, build a new home.Game Modes\nPlanet Explorers features single and multiplayer modes.\nIn single player there are 3 distinct selections\nStory Mode – Story mode is the main meat and bones of the game, it is the action-adventure-rpg-somewhat-4X segment, offering npcs, missions, colony building, farming, training, diplomacy, and of course, a storyline that you can follow or ignore. This story features a 17X8km world map with many unique character, landscapes, biomes, locations, and over 140 types of potential enemies. Even though we’ve made it seem like a very action oriented game in the trailers, in reality, players can choose to not fight so much as to just plant a farm, make some food, keep the colonists alive, negotiate with the sentient aliens, and defend the perimeter from the local life forms. That can still eventually arrive at the ending. And yes, there is an ending. Story mode also features coop with other players.\nAdventure Mode – This mode is based on a procedural map generated from a seed. It comes in a 40X40 kilometer map. Players will be able to complete random missions, defeat bosses, dive through dungeons, and explore different landscapes. This mode also features survival and versus.\nBuild Mode – In this mode, there are no enemies and an infinite amount of building material. It also currently comes in a 40X40km map. Players will be able to build whatever they want in this mode, including everything in the Creations Editor. Think of this as the perfect testing ground to test everything you build. Or…it’s your place to build your garden without ever worrying about the pesky aliens.\nMultiplayer allows Local Area Network and player hosted servers. We also have many official servers in the lobby.\nCoop – Coop comes in many selections, such as adventure mode, story mode, build mode, etc. This is pretty much an open world sandbox.\nVersus – This mode allows teams of up to 16 players to battle against 16 players from another team. We allow full terrain manipulation in this mode. It's a point based system where one team wins if they reach a certain point level based on kills, built objects, resources mined, etc.\nGame Features\nCurrent\n30+ hours of storyline\nCoop storyline\n140+ types of enemies\n40+ unique mainline NPCs\nAble to dig\nAble to build\nAble to plant farm\nAble to build colony\nAble to have followers\nCreation Editor to create vehicles, weapons, objects, vtols, boats, armor, and more\nDay/night cycle with realistic moon cycles\nWeather system\n15+ types of mineral types\n200+ unique items\nResource scanner\nRealtime AI pathfinding\nMultiplayer COOP\nMultiplayer VS\nRealtime water physics\nMultiple boss types\nStory Editor\nAI robot follower\nNegotiation with aliens\nWar with aliens","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pathea Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2614,"name":"No Time To Explain","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/944/9447500d4c125409af277e5c7897ae74.jpg","description":"No Time To Explain is a game about shooting the ground, putting on weight and setting your body on fire. Blast yourself through time and alternate realities to rescue your future-self from a giant crab sent by your evil time-twin from another dimension!\n1-4 players\nDUALSHOCK®4\n720p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 tinyBuild GAMES","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":16532,"name":"Dreaming Sarah","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/865/865964417247f8fa694bf60c36e2818b.jpg","description":"Inspired by the horror game Yume Nikki, Dreaming Sarah is a surreal adventure platformer game with puzzle elements, an engaging environment, an incredibly diverse cast of characters, and of course, a young girl named Sarah.\nSarah has been on an accident and is in a coma. It's up to you help her wake up by exploring her dream world while collecting items, talking to weird characters and exploring the world around her!\nKey Features:\nExplore different areas, like a forest, a haunted mansion and even the moon.\nCollect gameplay-changing items, like an umbrella that helps Sarah glide around, a manifying glass that changes her size and a necklace that turns her into a fish.\nSolve puzzles by paying attention to the scenery, taking notes and exploring the world around you.\nGet up to two different endings depending on what you have found or done.\nVisit old areas to find new things that appear as you progress in the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Asteristic Game Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10231,"name":"HackyZack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f9/5f92f1e461108cbd2112c649efae5c04.jpg","description":"You are Zack. Zack's just a regular kid. Juggle balls with unique properties through platforming puzzles to a goal at the end of each stage. Help Zack fill his treasured book of stickers to unlock optional challenge levels, where you race against the timer to destroy targets as fast as possible.<h3>Key Features</h3><ul><li>Precision-platforming puzzle-stunt game.<br/></li><li>Multiple ways to conquer 100+ levels.<br/></li><li>55 unique stickers to collect.<br/></li><li>Unlock and play as 8 different characters.</li></ul>","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spaceboy Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":6961,"name":"Ittle Dew","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d00/d00f68d5356c19db25522afdb43fb13d.jpg","description":"Adventuress Ittle Dew and her sidekick Tippsie crash onto a strange island, filled with loot and mysterious inhabitants. It quickly dawns on the duo that this might become their biggest adventure yet.\nIttle Dew boils down the classic adventure formula until there is only fun left. Experience devious puzzles, timeless gameplay and lots of exploration!\nLots of secrets and shortcuts to explore\nCombine your tools in ingenious ways\nBeautiful hand-drawn HD wobble graphics\nSpeedrunners welcome, with Leaderboards for all the ways you can break the game","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ludosity","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":481913,"name":"Black Myth: Wukong","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/779/77988e89f7862afeede524420aa251b0.jpg","description":"A world unseen, where new sights rise with every stride. Enter a fascinating realm filled with the wonders and discoveries of ancient Chinese mythology!\n\nAs the Destined One, you shall venture through breathtaking landscapes in the classic tale of Journey to the West, creating a new epic of uncharted adventures.\n\nHeroic Monkey, might and fame, adversaries rise, to test his name. One of the major highlights of Journey to the West is its diverse cast of adversaries, each with unique strengths.\nAs the Destined One, you shall encounter powerful foes and worthy rivals throughout your journey. Fearlessly engage them in epic battles that know no surrender.\n\nSpells unbound, knowledge's flight, infinite abilities take their height. Spells, transformations, and magic vessels in all manifestations, complementary yet adversarial, have long been iconic combat elements in Chinese mythology.\nAs the Destined One, aside from mastering various staff techniques, you can also freely combine different spells, abilities, weapons, and equipment to find the winning formula that best suits your combat style.\n\nWithin beings of every kind lies the story of a life. Beneath the ferocity and craftiness of your foes lies an engaging tapestry of their origins, personalities, and motivations waiting to be revealed.\nAs the Destined One, you will uncover the stories behind a variety of characters, delving beyond your battles with them, to taste the love and hate, greed and fury they once had and still carry with them.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Game Science","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":316865,"name":"Blood: Fresh Supply","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ea/4eaa50ded253689639fb29870e945d6a.jpg","description":"Battle an army of sycophantic cultists, zombies, gargoyles, hellhounds, and an insatiable host of horrors in your quest to defeat the evil Tchernobog. Squirm through 42 loathesome levels filled with more atmosphere than a Lovecraftian mausoleum. Begin your journey armed with a simple pitchfork and earn more effective implements of destruction like aerosol cans, flare guns, voodoo dolls and more!\nIncludes the original Blood and addons: Plasma Pak and Cryptic Passage\nBlood: Fresh Supply Enhancements:\n• Updated using Nightdive Studio’s KEX Engine\n• Vulkan, DirectX 11 and OpenGL 3.2 support, play with unlocked framerates!\n• Antialiasing, Ambient Occlusion, V-sync and Interpolation support\n• Support for high resolutions including 4K monitors\n• Fully customizable keyboard and controller pad support\n• Extended modding support, including support for already existing mods\n• Completely rewritten netcode supports up to 8 players:\n◦ Play online in co-operative mode, kill each other in “Bloodbath” or split the difference in classic 4v4 team-based “Capture The Flag” mayhem\n◦ Battle it out in local split-screen action\n• Roll your own soundtrack with full CD and MIDI music support\n• Look fully up and down with a new 3D view, or stick with the classic BUILD-engine style!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"}]},{"id":8777,"name":"Five Nights at Freddy's 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d15/d158c70eb8835a26a64509d29f42cc8d.jpeg","description":"Welcome back to the new and improved Freddy Fazbear's Pizza!\nIn Five Nights at Freddy's 2, the old and aging animatronics are joined by a new cast of characters. They are kid-friendly, updated with the latest in facial recognition technology, tied into local criminal databases, and promise to put on a safe and entertaining show for kids and grown-ups alike!\nWhat could go wrong?\nAs the new security guard working nights, your job is to monitor cameras and make sure nothing goes wrong after-hours. The previous guard has complained about the characters trying to get into the office (he has since been moved to day-shift). So to make your job easier, you've been provided with your very own empty Freddy Fazbear head, which should fool the animatronic characters into leaving you alone if they should accidentally enter your office.\nAs always, Fazbear Entertainment is not responsible for death or dismemberment.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":359247,"name":"Main Assembly","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7e/c7e62762b8ff89369eca84e37e5bb328.jpg","description":"Take on the role of a drone with the ability to design and build robots for your everyday needs! Find unique ways to overcome various challenges in singleplayer or jump into the Sandbox and craft and play alone or with other players.\nChallenge yourself and your friends to create the most exciting looking robot using a freeform crafting tool and modular parts! Change your robots color palette to make it your own!\nPut your personal touch on your drone through different paint jobs and collectible cosmetic items earned by playing the game!\nBy using the nodes in the powerful visual programming interface, you can set up controls for your robot. After getting the hang of it, you can dig deep into it and use Sensors to make logic for different types of automation.\nYour robots will take damage if they crash, fall, or take a hammer to the face! Advanced destruction systems enable bending chassis and damage that effects robot behavior. But don’t worry, you can iterate to improve and respawn your robot as many times as you like.\nJoin in on the multiplayer fun to create and play with others in an open sandbox environment. Load any robot you create in singleplayer or build completely new ones under the watchful gaze of your friends.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bad Yolk Games","platforms":[{"id":0,"name":"PC"}]},{"id":50694,"name":"Freddy Fazbear's Pizzeria Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9da/9da2dffc794c58618685f62478a92a91.jpg","description":"Presenting a fun Five Nights at Freddy's adventure with a lighter touch for the holidays, Freddy Fazbear's Pizzeria Simulator puts you in charge of developing your own restaurant! Design pizzas, feed kids, and get high scores!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":16551,"name":"35MM","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69e/69e6eb7ca5e0cddaf1df2cf0350d0dcd.jpg","description":"Post-apocalyptic story about two travelers who set out on a long journey in the wasteland, left by people after the global epidemic. The disaster destroyed much of the world's population, the infrastructure went wrong and the common life remained only in memories. The times when a human has adapted the environment for himself have end and now, in order to survive, he will have to adapt to changes. You will have to play the character whose path runs through the deserted towns and cities in Russia, fields and forests of a vast country and even a secret underground facility. Who are we, where are we from and where do we go – we will be lucky to know it only at the end!\n\nThis adventure story will let you explore in more detail a number of interesting locations of post apocalyptic Russia, filled with a variety of items and secrets. During the journey you will collect supplies, food, batteries and weapons, solve quests and move forward on the plot, which has several  variation in the final, depending on your actions.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Носков Сергей","platforms":[{"id":0,"name":"PC"}]},{"id":14722,"name":"Romero's Aftermath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae8/ae8aaf1250f9c31da10999d79f604a50.jpg","description":"AFTERMATH END OF SERVICE NOTICEDear Players,\nWe began Aftermath as a passion project 2 years ago that aimed to expand the Infestation/WarZ zombie survival universe and give players not only a harsh open world survival experience, but also let players build their own bases, claim land and store items. We ultimately chose to make the game free-to-play from the beginning in order to allow any curious player to try it without having to plunk down hard earned cash given how questionable early access titles can sometimes be. This free to play model worked for quite some time due to word of mouth, almost 2 years in fact, however, with the population dwindling we fear that we cannot keep servers online for much longer.\nNot long ago we made the decision to restrict new user registrations as well as halt the sale of in game currency to avoid potential disappointment from new players as the game had not been updated in the last 4 months. Unfortunately the economics of the game are not able to afford us the luxury of continued development and support for Aftermath. With sadness we’ve made the difficult decision to close Aftermath. It wasn’t an easy decision for us, as we’ve been quite emotionally invested in Aftermath, but sometimes these kind of decisions have to made in order to move forward as a company.\nWe as a team would like to thank you for all of the support you have given us over the past 2 years and the fun experiences we were all able to share - be it fighting over supply drops, herding zombies for liberation events, collecting resources, crafting, building forts and more.\nAbout the GameSurvive against the odds in a giant sandbox MMO world featuring lush forests, dry desert plains, peaceful meadows and the eerie zombies that inhabit the world.\nScavenge for guns, supplies, survival items and crafting materials in various zones including cities, farms, military bases, abandoned outposts, forgotten rest stops and hundreds of small encampments left behind by survivors before you.\nBuild and protect your shelter, harvest crops, learn crafting blueprints and store your items on our server in your Global Inventory or hide them in a stash box in the world.\nBe a civilian, a trader, a protector of peace, a ruthless bandit or combination of them all.  Customize your character with hundreds of visual cosmetic items including Headwear, Facewear, Shirts, Jackets and Pants.  Swap your cosmetic items at any time on the fly, unlock weapon skins and show everyone in a safezone that you know where to find the rare items.\nTHE FOLLOWING FEATURES ARE AVAILABLE RIGHT NOW :Gun Skins\nUnlock permanent skins for your guns via special Cosmetic Crates that can be found in the world.  These skins display to other players and can be changed at any time.  Skins can also be traded if you already have the skin.  There are even rare permanently skinned guns rumored to be available to those who hunt far and wide.Crafting\nFill in the gaps during your looting adventure by crafting useful things you couldn't find.  Break down rubbish items in the world into their core crafting components and repurpose them into high end upgrades to your gear or fashion a new silencer for your gun.  With over 40+ crafting recipes to be unlocked you'll find that almost anything you need can be crafted, provided you've found the right components.  Loot or craft all the items a survivor would need in a zombie apocalypse as well as a few novelty and lethal crafting options that may be above and beyond the usual survival requirements.  Craft shelter, weapons, attachments, armor, ammunition, medical supplies, food, purify water and set up traps for players or set up a nice peaceful garden to harvest.Town Liberation\nYou've looted the city and killed the zombies, but what should you do next?  Liberate the town of course!  Now players have the option to repair generators and fill them with gasoline from a nearby gas pump.  Once all the generators are repaired and enough zombies have been killed then supply drops with epic loots will begin dropping all around the town!  Beware though, other survivors will likely be wanting the supply drops as well.  It is up to you to decide if you share the spoils.Supply Drops\nSupply shipments containing large caches of weapons, ammo, medical supplies and rare guns have been spotted randomly on the map.  Be lucky enough to find one of these alone and you'll walk away armed to the teeth with enough gear to arm your friends as well!Radio Tower Control\nDisable zombie sense of smell, sight and sound for a short period of time in key areas to move unhindered and unnoticed by the local zombies.  Find a radio transmission chip and insert it into the console at a functioning radio town in a town to take advantage of this new gameplay.Hundreds of Character Customizations variants\nCustomize your character at any time in game simply by opening the customization menu.  Change out your hat, mask or scarf, upper body and legware to match your surroundings.  Don't stick out like a sore thumb in the middle of the jungle with a desert camo outfit.  Adapt your clothing to fit to your surroundings without taking up bagspace.Place-able Barricades\nFind fortification in any situation with placeable barricades.  Available both through looting as well as crafting - these essential placable barricades can be the difference between life and death by blocking damage and visibility between you and another survivor attempting to shoot you.  With 7 different barricades to choose from you'll have one for every situation including cleverly placed barricades to enable access to an area not normally accessible.Base Building\nEver dreamed of owning a little piece of land overlooking your favorite location in a game?  Now you can with our totally renovated base building system!  Place down your statue to claim your land and build unhindered anywhere on the land that you own.  Place defenses, harvestable crops, cooking racks, water wells, living quarters for your friends and your own personal storage locker!  Owning a base has never been better!Grouping\nGroup with your friends or even make new friends with other players in game.  You can't be back stabbed while in a group so feel free to team up with anyone!  Beware they might lead you to some of their not so friendly \"friends\" but that's all part of the adventure.  Take on challenges like the new Town Liberation's or raid an enemy base in style in all matching cosmetic outfits!Stat Tracking\nWe now make it easy for you to track your stats in game like time played as well as kills and deaths simply by typing /stats in game chat.Harvestable Crops\nLive off the land and prosper by hiding gardens around the land for your own personal food stash or protect them inside your base.  Once food has been harvested you can choose to eat it on the spot, cook it or use it in a crafting recipe to possibly get even better results.Variety of  Guns\nWant to play a game where you don't have all the best items the very first hour you play?  We have variety of weapons to find right now.  We have items ranging from crafted and assembled homebrew weapons as well as high grade factory weapons including rare collectors edition versions of guns and different tiers of weapons featuring different recoil, spread and damage ratios.  The rarer the gun, the better the gun.  Show off your guns and skins in a safezone or trade with other players!Melee Weapons\nAs much as everyone always wants to be armed to the teeth with the best assault rifle, everyone has to start somewhere and sometimes the best you've got is a kitchen knife.  We've got you covered from simple household weapons to crafted makeshift weapons as well as heavier duty fire axes and maces that deal brutal damage but swing slow.  We're sure you'll be able to find your niche weapon for beating off zombies.PVP Servers\nUp the anty with a bit of extra excitement in your zombie apocalypse.  Head into a PVP server where it's no holds barred item drop PVP and test your mettle against other survivors if you happen to cross paths.  Town Liberations are enabled on PVP servers to add a bit more risk to the reward of open world \"anything goes\" pvp.  Find unique solutions to player disputes on PVP servers not normally possible on PVE.  Expect players to be ruthless.PVE Servers\nTired of always feeling like everyone is out to get you for all your precious items and every shadow and sound is terrifying?  We understand that you might feel more like going on an adventure and turning up the ambiance without the constant fear of someone stalking you.  PVE offers a more casual experience for players that just want to practice surviving and looting in the world without PVP combat.Totally new respawn system\nNow featuring five new respawn options so players really have control over where they are in the world.  Upon your unfortunate death you can now choose between proximity, sleeping bag, base, group or safezone now.  This really helps players meet up with their friends across the map quicker by taking a quick and dirty respawn or allows you the convenience of being across the map and still returning back to your base in a pinch, provided you're okay with dying :)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Free Reign Entertainment","platforms":[{"id":0,"name":"PC"}]}]