[{"id":3879,"name":"Angry Birds Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af4/af4fe9b3d55dd021d97350d3461cfd8e.jpg","description":"Squawk! Play the worldwide phenomenon in a whole new way:  with new features and gorgeous graphics, now optimized for the PlayStation®Vita system! Whether you're a champion pig popper or a fledgeling bird flinger, Angry Birds Trilogy offers fun, challenging, and addictive gameplay for fans of all ages!\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\nNetwork Features\n60KB Minimum\nTouchscreen\nRear Touch Pad\nDual Analog Sticks\nLocation Data Acquisition Service\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\nAngry Birds™ Trilogy\n© 2009-2013 Rovio Entertainment Ltd. Angry Birds and game characters are trademarks of Rovio Entertainment Ltd and are protected by international copyright laws. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Housemarque","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":433,"name":"Fate/EXTELLA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/adf/adfd1f6dc069e95bed9cebb376d8d75c.jpg","description":"EXTELLA — A new world unlike any ever seen.\nAcross the virtual realm of SE.RA.PH, Masters of digital magic commanded their Servants, great heroes and villains of history and lore, to fight in the Holy Grail War. The prize was the \"Holy Grail\" itself — aka the Moon Cell Automaton, a lunar supercomputer with the power to grant any wish.\nThough the war has ended, with the Servant Nero and her Master on top, all is not well. Not only is Nero's rival Servant already leading an uprising, but a new challenger waits in the dark, ready to tear through reality itself to strike at her heart.\nNero prepares to defend her new throne. Beside her stand her Master and a few loyal allies. Ahead lies not only an ocean of enemies, but an ancient secret far more terrible than any war…\nFate Heads for a New Stage!\nThe famous Fate EXTRA series strikes a path to a new stage with Fate/EXTELLA: The Umbral Star. Many of the fan favorite characters including the ancient Heroic Spirits (Servants) summoned by the Holy Grail, will make their appearances. This game has been reborn as a high-speed action battle where you go against the enemy and their army. You can also take the time to enjoy the deep story of the Fate series.KEY FEATURESA Variety of Fate Universes Collide\nNot just Fate/EXTRA Servants, but characters from Fate/stay night, Fate/Apocrypha, Fate/Grand Order, Fate Zero and other Fate series will make appearances. You can enjoy the game in Japanese audio with English subtitles. Chinese, Korean, and Japanese text is also available.\nA Brand-New Story from the Series’ Author, Kinoko Nasu\nAs the original creator of Fate/stay night and the scenario writer of Fate/EXTRA, Kinoko Nasu has created a completely new scenario for Fate/EXTELLA. The universe and characters of Fate will evolve.\nA Large Story Told from Different Perspectives\nIn Fate/EXTELLA, the story will be told from the independent perspectives of three heroine Servants. Various side stories are also included, creating a structure that will shed light on the main story.\nA New Way to Battle\nAs the first action game in the Fate series, players will finally be able to control a Servant and perform various moves, including a powerful form change ability to transform Servants. Engage in intense battles on the ground or in mid-air to annihilate the enemy forces!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"XSEED Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":938003,"name":"Cities: Skylines 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa5/aa581a715c1afd3d3abdef4669e73852.jpg","description":"If you can dream it, you can build it.\r\nRaise a city from the ground up and transform it into the thriving metropolis only you can imagine. You've never experienced building on this scale. With deep simulation and a living economy, Cities: Skylines II delivers world-building without limits.\r\n\r\nLay the foundations for your city to begin. Create the roads, infrastructure, and systems that make life possible day to day. It's up to you – all of it.\r\n\r\nHow your city grows is your call too, but plan strategically. Every decision has an impact. Can you energize local industries while also using trade to boost the economy? What will make residential districts flourish without killing the buzz downtown? How will you meet the needs and desires of citizens while balancing the city's budget?\r\n\r\nYour city never rests. Like any living, breathing world, it changes over time. Some changes will be slow and gradual, while others will be sudden and unexpected. So while seasons turn and night follows day, be ready to act when life doesn't go to plan.\r\n\r\nAn ever-expanding community of Builders means more opportunities to build a truly groundbreaking city with mods. They're now more easily available in Cities: Skylines II.\r\n\r\nThe most realistic and detailed city builder ever, Cities: Skylines II pushes your creativity and problem-solving to another level. With beautifully rendered high-resolution graphics, it also inspires you to build the city of your dreams.\r\nDeep simulation\r\nAI and intricate economics mean your choices ripple through the fabric of the city. Remember that as you strategize, problem-solve, and react to change, challenges, and opportunities.\r\nEpic scale, endless possibilities\r\nCities: Skylines II lets you create without compromise. Now you can build sky-high and sprawl across the map like never before. Why not? Your city is you.\r\nCities that come alive\r\nYour decisions shape each citizen's life path, a chain of events that defines who they are. From love and loss to wealth and wellbeing, follow their life's ups and downs.\r\nA dynamic world\r\nPick a map to set the climate of your city. These are the natural forces you'll negotiate to expand your city amid rising pollution, changeable weather, and seasonal challenges.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Colossal Order","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":840782,"name":"Stranded: Alien Dawn","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7d2/7d2ff2d1b5e173abd590ae867938f5af.jpg","description":"Brave a new world in Stranded: Alien Dawn, a planet survival sim placing the fate of a small marooned group in your hands. Forge your story through compelling and immersive strategic gameplay as you make vital decisions to protect your survivors from starvation, disease, extreme weather and more. From basic camps to fortified bases, create a stronghold to defend the survivors from attacks by alien creatures that roam an expansive and deadly alien world. Experience an epic and unpredictable journey.\r\n\r\nDiscover an expansive, living 3D world with remarkable flora and fauna\r\nManage your survivors’ needs, health and happiness\r\nConstruct and evolve your own unique base, and devise cunning defences to protect it and survivors from being attacked\r\nPlant, grow, harvest and hunt down food. Stockpile useful resources and salvage material from fallen space debris\r\nResearch technologies to expand your horizons.\r\nProvide heat, light, devices for relaxation and more to keep survivors on top of their game, ready to face the next challenge.\r\nReact to fluctuating weather and environmental events\r\nLearn to play with the integrated tutorial system","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":823653,"name":"生死狙击2（国服）","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52b/52bae73545430c9882043702a951dda5.jpg","description":"特色玩法 选择自由涵盖萌趣大头、全新变异与大地图团竞等特色玩法，同时继承IP经典巷战玩法，构成模式丰富、选择自由的射击游乐园，兼具趣味性和竞技性，探索更多枪战可能。\n极致视听 低配畅玩革新美术与音频品质，融合奇观、赛博、国潮等风格元素，塑造近未来主题化场景体验。影视级别的视听呈现，支持五档性能兼容，次世代战场低配也畅玩，带来超预期享受。\n爽快操作 公平竞技采用真人动捕、实枪音效等多维打磨丝滑爽快的操作手感与真实沉浸的临场氛围。人人都能轻松上手公平竞技，自由装配套路百变的战场利器，提供更纯粹的射击体验。\n传承经典 热血延续沉淀《生死狙击》九年IP精髓，继承特色玩法和经典地图，回归人气角色与热门武器，极致还原竞技快感，延续超五亿玩家的枪战热血。","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"浙江无端科技股份有限公司","platforms":[{"id":0,"name":"PC"}]},{"id":712831,"name":"Bloons TD Battles 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/22b/22b6d64d620f40ce01726b10ac31a01d_3EKIGL9.jpg","description":"Battle through a series of challenging Arenas and prove that you have what it takes to enter the fabled Hall of Masters and seize your glory!\nFrom the creators of Bloons TD 6 comes a brand new installment of the top-rated head-to-head tower defense game. Gather your Hero, choose your team of powerful Monkey Towers, and prepare to battle one on one against other players and relentless waves of Bloons!\nCompetitive Tower Defense!\n* Outwit and overwhelm your opponent in intense head-to-head play\n* Balance the strength of your defenses while preparing a Bloon offensive that blitzes your opponent\n* Countless strategic combinations can lead you to victory\nSkill Based Gameplay!\n* Match with players of similar rank as you work your way through 9 unique arenas\n* Reach Hall of Masters to battle the best on a dynamic elo-based leaderboard\n* Earn and display unique badges each season based on progress\nLock and Load!\n* Select from familiar Heroes and brand new Alts with unique upgrades\n* 21 Monkey Towers with 15 unique upgrades each to customize your build\n* Brand new Bloon send system optimizes economy building and attacks\nBuild Your Bling!\n* Win in style as you customise your loadout from hundreds of cosmetic items\n* Flex with unique animations, emotes, bloon skins, and more\n* New content added every season!\nAnd of course tons of content and new feature updates are planned to make Bloons TD Battles 2 even more awesomer. What are you waiting for? It’s time to Battle!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":709170,"name":"Blind Fate: Edo no Yami — Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b0/2b014ce59c8c077d02ae25aae1e1f92c.jpg","description":"Wishlist the Full Gamehttps://store.steampowered.com/app/1294880/Blind_Fate_Edo_no_Yami/\nAbout the GameBlind Fate: Edo no Yami — Prologue is a free introduction to the game's world, offering a better taste of its plot, levels, and boss fights, as well as a glimpse into Yami's past.\nIt’s a new, dark and machine-filled Edo period, and the Shogunate rules over Japan with its just, but pitiless hand: you.\nYou follow orders. You obey. You kill... Until they kill you.\nThe prologue finds you at the City of Ghosts, a once glittering Japanese metropolis, where the tide of battle has clearly turned against you: defeated by an overwhelmingly powerful opponent, you plunge into the darkness below the derelict skyscrapers, only to reawaken and see the familiar reality in a “different light”... But just how real is the world around you?\nLearn to survive, relying solely on damaged sensors and the advice of your Tengu mentor. Grow stronger and follow the path of blind rage in the insane and fantastical world of cybernetics and ancient mythology.— A world of data and liesThe Mask of the Oni creates a simulation of the world around you, but tread carefully: old data will only show you the deceiving echoes of the past.\n— Swords sing unseenEven blind, you are unstoppable. Use different sensors to detect your enemies and identify their weak spots, then crush them with lightning speed.\n— Robotic folktales of JapanDiscover the story of dozens of robotic versions of Japanese folktale creatures! Find their weaknesses and destroy each one with a devastating finisher!\n— Long-lost mechanical loreYour sensors pierce the curtain of the past. Use sound, smell, and heat to explore the world, uncovering centuries of lore and guiding Yami on his vengeful, story-driven journey.\nThe Dojo awaits...\nFollow the way of the Cyber-Samurai and join our Discord community!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Troglobytes Games","platforms":[{"id":0,"name":"PC"}]},{"id":485166,"name":"Streamer Life Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/606/6060f0eaae3d15ff4de8db2a7adaadc2.jpg","description":"Become one of the most popular people in the world, starting from scratch. Improve your character and buy yourself new equipments. Move from your bad neighborhood and settle in new neighborhood with stronger internet infrastructure. Create the computer with the features you want and start streaming. You can chat with your followers and collect donations.\r\nStream the games you play. You can invest with the money you earn and increase your money. By following the new games and events. Buy new games. By playing the right game at the right time. Let new people discover you. Prove yourself to people and win tournament prizes by participating in tournaments of popular games.\r\nYou can interact with your environment and do some different work to earn additional money. Research the rubbish around us and find useful things. Sell ​​in pawn shops and earn extra money. Earn money by doing additional jobs around.\r\nBuy pets and have fun with them","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Cheesecake Dev","platforms":[{"id":0,"name":"PC"}]},{"id":471017,"name":"Hellish Quart","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/679/6792d78b32cef811ae71b92d47e7102d.jpg","description":"A historical fighting game about sword dueling, in which the blades really clash using physics, and the characters use motion captured fencing techniques. Play as one of many 17th century warriors and use sabers, rapiers, broadswords and many other blades in single player campaign, arcade, or local multiplayer with friends.\r\nphysical Sword Fighting Using Active Ragdolls\r\nsuper realistic, motion captured fencing animations\r\nbeautiful, historically accurate 3d scanned graphics\r\n\r\nHellish Quart uses active ragdolls and all damage your blade can do is calculated with realtime physics. Four gamepad buttons represent 4 attack angles. Different button combinations give special attacks and combos. If you are not attacking, your character will automatically try to hold guard against your opponent's attacks. The blades really block each other and that's what's keeping you alive. To win, you must use proper timing, measure, technique, speed and wits - just like when fencing in the real world.\r\n\r\n\r\n\r\nHellish Quart has a historical setting. The game takes place in 17th century Polish–Lithuanian Commonwealth. The character models are made using 3D scanned clothes, based on fashion from the period, and the single player campaign (when done!) will be firmly rooted in realities of life in the region. You will duel Zaporozhian Cossacks, Polish Hussars, Tatars, Turkish Janissaries, Swedish Reiters, French Musketeers and more.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Kubold","platforms":[{"id":0,"name":"PC"}]},{"id":428664,"name":"A Space for the Unbound","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c18/c180a02a53ce8c8cf23f11f182184103.jpg","description":"Check out the free prologue chapter here!https://store.steampowered.com/app/1201280/\nAbout the GameHigh school is ending and the world is ending with it\nA Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\nFollow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.\nSet in a small town inspired by 90s era rural Indonesia, A Space for The Unbound presents an endearing story-driven experience with a vibrant environment waiting to be explored.\nKey Features Throwback to the 90s! Let us take you to Indonesia in the late 90s.\nExplore rural Indonesia and enjoy its relaxing atmosphere with a hint of supernatural events.\nChat and interact with other townfolks and listen to their personal stories.\nDive into people's minds Inception-style.\nListen to beautiful music composed by Masdito \"Ittou\" Bachtiar","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Mojiken","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":364972,"name":"The Big Con","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5cf/5cf71497ee9fd1251eb96a9ba8d44a45.jpg","description":"Hustle through the 90s in THE BIG CON, an adventure game where you’re an awkward teen hustling to save her family video store from gangsters.\r\nPlay as Ali, a high school junior gone AWOL from band camp to seek revenge on the loan sharks that threaten her mom’s video store. (Fighting with your mom is YOUR job. No one else gets to do that.) Maybe you’ll profit from the latest collectible plushie craze, and make an interesting friend or two along the way.A Con-Artist Adventure GameSneak around, wear disguises (and too much plaid…), pickpocket, solve puzzles, and rip people off to save the day as you and con your way across a weird and funny America.Hustle Your Way Through the 90sPlay as Ali, a teen con artist in the 1990s, on a journey to save her family video store from loan sharks.A Coming-of-Age ComedyFight with your mom, be awkward, seek revenge, invest in some quality collectibles (they’re bound to pay off later, right?), and make an interesting friend or two along the way.FEATURES  Narrative adventure game with puzzles and open exploration\r\nPickpocket, sneak, wear disguises, and con people\r\nTalk your way into deals, hearts and trouble\r\nMeet NPCs from all walks of life, rip them off, and sometimes help them if you feel like it\r\nCall home and argue with your mom\r\nRide the Hormipillar as much as you want\r\nMade by a crew of devs with credits ranging from Shadow of the Tomb Raider (Jill Murray), to Jazzpunk (Dan Rodrigues), Guacamelee 2 (Saffron Aurora, George Degenkamp) and Runbow (Dave Proctor)","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mighty Yell","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":331807,"name":"Double Dragon II: The Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2a/e2af1fcbd58c3a1ce69f6b4907fab687.jpg","description":"Double Dragon II: The Revenge (Japanese: 双截龍 (ダブルドラゴン)II ザ・リベンジ) is a side-scrolling beat 'em up produced by Technōs Japan originally released as a coin-operated arcade game in 1988. It is the first sequel to Double Dragon, released during the previous year. The sequel involves Billy and Jimmy Lee in a mission to avenge their girlfriend Marian after she is shot to death by the Black Warriors leader Willy, who is retaliating against the Lee brothers after his defeat at the end of the previous game. Double Dragon II was initially developed as an upgrade kit for the original Double Dragon, but evolved into a stand-alone game due to an increase in memory size, resulting in the developers reusing assets for both games.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Arc System Works","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Atari ST"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":327246,"name":"Commandos 2 - HD Remaster","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abc/abc14abd760982ce10c59837c6bde58d.jpg","description":"Relive the real-time tactics masterpiece that defined the genre like no other: Originally developed by the legendary Pyro Studios, Commandos 2 - HD Remaster is a true homage to one of gaming’s most celebrated masterpieces. Experience Commandos 2 Men of Courage like never before in high definition with reworked controls, UI and tutorial.\nTake control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of notoriously demanding missions set in World War II. Go covert into various environments based on authentic World War II locations and lead your team of commandos against overwhelming odds, operate covertly and turn the tide of war.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Pyro Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":295102,"name":"Hell is Other Demons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e8/7e844422c865c45bbf64de3474b84a09.jpg","description":"A Fast-Paced Bullet Hell Platformer with Big Pixels\nThis arcade shooter is driven by quick, creative gameplay that rewards fast decision making and faster reflexes.\nA Hell of a Campaign\nJump into the hooves of a demon out to kill a bunch of other demons as you progress through an extensive campaign and dominate wonderfully over-the-top bosses. Accumulate an arsenal of powerful weapons and upgrades as you take on varied and brutal challenges.\nEndless Challenges\nFans of classic, high-score based arcade games will find a cozy home in Arcade Mode, which offers unlimited, procedurally generated action and infinite replayability. Nothing is stopping you from topping your high score except thousands of bloodthirsty demons.\nThe Best Bleeps and Boops\nHell is Other Demons’ bold colors and chunky pixels are backed up by a heavy synthwave soundtrack composed by Rémi Gallego, of The Algorithm, and retro sound effects by Magnus Pålsson, composer of the VVVVVV OST.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cuddle Monster Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":284699,"name":"Microsoft Maquette","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c46/c46095e6535eea0ef62ff41bd96dac56.jpg","description":"Microsoft Maquette  is a general purpose mock-up tool for spatial prototyping within virtual reality. It was built from the ground up to empower anyone to create fully immersive concept sketches in VR from inside your headset. Maquette includes a set of tools for importing, creating, composing, and storyboarding content in 3D space, complete with a library of primitives and UI icons. Among many other features, Maquette has fast and approachable UX, a text tool for annotations and spatial UI mockups, and easy selection and nested-grouping of content. Maquette has a complimentary Unity addon for importing Maquette content into Unity, which preserves materials and grouping hierarchy. Maquette's development process is guided by users' needs, so we want your feedback!﻿\nMaquette's Website\nhttp://www.maquette.ms\nFeedback Hub\nhttps://support.maquette.ms/hc/en-us/community/topics\nBringing Maquette Content into Unity\nhttps://www.maquette.ms/unity-addon","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Microsoft","platforms":[{"id":0,"name":"PC"}]},{"id":241052,"name":"BLOCKPOST","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/821/821a1e17cb131982bedce51a51feaab2.jpg","description":"Procedural cubic 3D-shooter in the best traditions of the genre. The game is a rich cocktail consisting of the most popular and functional gaming solutions. Customization of characters, opening cases and improving the existing arsenal — all this is available in the game now.\nAmong other things, the main features of the game are:\n• 7 game modes with unique sets of locations (maps)\n• More than 20 game locations\n• More than 100 types of firearms\n• Clan (team) system\nJoin the gaming community of tomorrow!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Skullcap Studios","platforms":[{"id":0,"name":"PC"}]},{"id":223378,"name":"Ace Attorney Investigations - Miles Edgeworth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a3/0a30bb59b5abac2f51e7545bf1580fee.jpg","description":"Description\n*********************************************\nBefore purchasing please be sure to check your device’s capability\n*********************************************\nAn exciting new chapter in the Ace Attorney series!\nAce Attorney Investigations: Miles Edgeworth takes the Ace Attorney series from the courtroom to the crime scene, leaving the legal battle behind while bringing the action to various crime scenes. This time around, the player takes on the role of famed prosecutor Miles Edgeworth, a memorable rival of charismatic legal eagle Phoenix Wright. Edgeworth actively investigates crime scenes in order to pursue the truth behind each case. By solving the challenging puzzles presented him, Edgeworth will work with the police to bring criminals to justice.\nGame Summary\n•\tGuide Miles Edgeworth through various locations, examine and analyze clues, work directly with characters on the scene, find contradictions in suspect statements, and get to the truth by presenting decisive evidence.\n•\tInvestigate crime scenes to search for evidence and confront other characters to find contradictions in their statements, to get closer to the truth.\n•\tHigh resolution graphics optimized for modern devices.\n•\tUtilize the all-new “Logic” system, where Miles can choose two pieces of information out of the various pieces he has collected and “combine” them to discover new information.\n•\tReproduce the crime scene using the in game hologram and discover new information.\n•\tExperience the famously eclectic cast of characters of the Ace Attorney universe.\n•\tPurchase price includes the complete game\nRecommended Specifications:\nSmartphone and tablet with 2 GB RAM or more (Intel CPU is not supported)\nCompatible OS:\nAndroid 4.4 - 7.1.2\nCompatible Models:\nPlease check the following URL to see if your device is compatible.\nhttp://www.us.capcommobile.com/ace-attorney-investigations-compatibility\nIt is possible to purchase the game on an incompatible device.  Please be sure your device meets the minimum requirements. Please note that we can not issue a refund.\nYou can search for other great Capcom games by entering 'capcom' into the search field of the Google Play.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capcom","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DSi"}]},{"id":60533,"name":"Idol Manager","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/930/9305c117592f89420ff452ffcda105f9.jpg","description":"Follow The DevelopmentDon't miss the news! Follow us on social media for regular project updates\n@IdolManagerGame | Tumblr | Website | presskit()\nAbout the Game\nYou take on the role of manager at a small (but growing!) talent agency. As you cultivate and train the newest generation of young pop stars, you'll have to decide who to hire and who to fire, who gets promoted when things go well and who gets reprimanded when things get sour. The personal lives of these young celebrities are a part of your business, and the life of a pop star isn't always a happy one. Their crowning personal achievements can be your greatest commercial successes, but their emotional meltdowns and PR nightmares can spell financial disaster for your company.\nIt's not just the idols you have to worry about. The world is full of gossip magazines, super fans, and rival groups, all thirsty for a scoop on the latest scandal. There's a lot of people who want to tear you down and are willing to play dirty, but try not to let it get to you. It's not personal, it's business.FeaturesDecide how to deal with crises including gossip, vandalism, stalkers, or threats directed at your agency and the pop idols you manage.\nManage relationships between the different idols in your group, as you deal with cliques, internal feuds, and bullying.\nGrow your fanbase by varying your tactics and appealing to a wide variety of demographics.\nProduce singles, hold concerts, organize huge TV events and overseas tours to capitalize on your group's popularity and bring in revenue.\nDevelop your agency's building. Start with simple offices and dance rooms to produce content and train your idols, and end with your own cafe and theater to create a steady stream of revenue. Hire and train staffers to help deal with logistics and keep your agency running smoothly.\nDiscover substories - chains of events and visual novel segments, many of which are triggered by your play style. Each substory can play out in multiple different ways based on your decisions, often causing serious consequences for your playthrough.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"GlitchPitch","platforms":[{"id":0,"name":"PC"}]},{"id":49868,"name":"Crash Bandicoot: The Wrath of Cortex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/014/01448cb1ddc74e6a2bf032c4ffc7922e.jpg","description":"Crash Bandicoot: The Wrath of Cortex is the sixth game in the Crash Bandicoot series, however it is the first game to not be developed by Naughty Dog.  Instead the game was developed by Traveller's Tales and published by Universal Interactive Studios.\nThe story begins when we see Dr. Neo Cortex's space station and Uka Uka awakes the Destructive masks who each have a power over Earth, Fire, Water, and Air.  If they unleash their power then Cortex will be able to power his secret weapon which could be capable of crushing mountains, demolishing entire cities, and even destroy Crash.  Crash with the help of his sister Coco Bandicoot and Aku Aku need to find a way to stop Cortex and the destructive masks before Cortex's weapon is powered.   The Wrath of Cortex is the first game to feature Crunch Bandicoot, one of Cortex's creations who turns good by the end of the game.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"}]},{"id":49537,"name":"Achievement Clicker","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bf/2bf5c5ad3aa9b4fce2081c2c792a838b.jpg","description":"Achievement Clicker is a simple clicker game. All you need to do is click the trophy to get points and earn amazing achievements\nFeatures:\n- Nice Achievements\n- Cool OST\n- Simple Gameplay\n- Discord Rich Presence","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"OfficialAndy","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":45589,"name":"Nightork Adventures 2 - Legacy of Chaos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec3/ec3b2a57047c98e2bf9d38453f80683f.jpg","description":"When the gods created the universe, they wanted to create a perfect world, free from struggles, war and malice.\nThey created another world, which they connected with the first one.\nThe malice flowed from the first world into the other plane.\nNow peace ruled for thousands of years in the universe.\nBut in the same time, the amount of evil energy grew in the dark reality.\nThrough the excess of it, soon nightmarish creatures were formed.\nThe gods didn’t predict their existence and also didn’t notice them for a long time.\nWhen they saw, what happened, the creatures already become numerous and powerful.\nNow the armies of heaven were send out, to defeat the darkness.\nA several hundred years long war started, which leaved its tracks into the world of the mortals.\nThis age was the 'Age of Chaos', which was determined by war and destruction.\nFinally the gods achieved victory over the demons and closed the gate between the two worlds.\nTherefore they accepted that the darkness couldn’t longer flow from the one world to the other.\nSo the first world became a normal world with good beings and also evil beings.\nBut no one suspected that the demons waited in their dark dimension to be freed...\nBut now the sun in the Sho'Lar system has darken and a moon has exploded.\nDemon ships have warped out of the destructed moon and devastated the planets in that system completely.\nNo one knows, how the demons could get in our world again, but we all be aware what will happen, if this spawn of darkness is not send back to its world.\nLegions of evil would devastate planet for planet, city for city would be razed to the ground and no being would survive their bloodlust.\nIn this new age of dread, the intergalactic king called all adventurers to find the cause for the appearance of the demons and to send them back to their world.\nAnd one of these adventurers is YOU...\nNightork Adventures  2 - Legacy of Chaos has the following features:\nPilot your spaceship through procedurally generated dungeons.\nFight against evil demons, to save the galaxy in 30 missions.\nCustomize your ship, by modifying weapons, armor and so on.\nUse special skills to improve your fighting abilities.\nYou can shoot projectiles in three different colors: red, green and blue.\nEach enemy ship has a specific color.\nYou have to complement the enemies to white color.\nE.g. if an enemy is yellow, shoot it with blue projectiles.\nBuild your own levels with the included level editor.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Warptear Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":43444,"name":"Castaway Paradise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/972/9728dab527fc76f573bb360f1cd437af.jpg","description":"Featured DLCThe Summer is magic!!!\nAbout the GameYour adventure starts when you get stranded on a tropical island. This is your island, your adventure! Do whatever you like! It's the ultimate Sandbox sim! Do you like Animal Crossing or Harvest Moon? Castaway Paradise is the game for you!\nFUN ACTIVITIESYou can spend your days doing fun activities such as catching bugs and fishing. Try to make a bigger catch than your friends and make your collections complete!GROW PLANTSFarm your own home-grown fresh crops! Rake the ground, plant the seeds and give them some water. You can also decorate your island with beautiful plants and flowers or grow fruit trees.CREATE YOUR OWN OUTFITEndlessly combine outfits, hats, dresses, shoes and other clothing to reflect your personality, or create a funny outfit just for the laughs!DECORATE YOUR ISLANDAfter the devastating storm, the island needs some renovation! You can place items from a lot of different theme packs and make the island your idea of paradise!HOLIDAYS AND EVENTSThroughout the year, special events and holidays will occur like Christmas and Halloween. Around the winter holidays for example, the island will be covered in snow, and you can help the villagers by decorating all the houses and the rest of the island.HELP THE VILLAGERS OUTBefriend the quirky villagers and help them by engaging on quests for them. They will reward you with great gifts! You can also just chat with them to get to know them better.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stolen Couch Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":37249,"name":"Genesis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f86/f86cbaae8be0dcb467346038e23a9810.jpg","description":"Early Beta AccessThis is a open beta version, please let us know your advise, thanks!\nAbout the GameGenesis is a controller exclusive next generation online-competitive MOBA. Utilizing Unreal 4 Engine, it boasts stunning graphics and smooth control. Genesis differentiates from classic MOBA games by opting for joystick control which is highly optimized and extremely intuitive. Set in a futuristic sci-fi world where gods and men clash to claim dominion, players can experience the joy of Genesis in its PVP or PVE game modes.  The game will initially feature a rich roster of 30 heroes and a wide selection of hero, weapon and item cosmetics. Genesis is slated to be published on PC and PS4 in the spring of 2019.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Elements of Design","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":31572,"name":"MegaRace 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2af/2af992651696279995b407100af4a2fd.jpg","description":"MegaRace 2 is the sequel to 1994's combat racing smash hit and is once again developed by Cryo Interactive. The sequel included several upgrades such as fully rendered 3D cars, new weapons, and track shortcuts.\nMegaRace 2 also features the return of eccentric MegaRace host, Lance Boyle (played by actor, Christian Erickson, of \"Hitman\" fame). In MegaRace 2, Lance is joined by a stunning female co-host whose name keeps changing. MegaRace 2, was the first entry in the series, to allow players to fire weapons in reverse at cars behind them. The game was also the first to introduce in-game cash prizes for winning races.\nThis in-game currency could be used to purchase new cars and weapon upgrades. Each race contained multiple paths for the player to cross the finish line. MegaRace 2 was released for PC in 1996.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Cryo Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28597,"name":"NHL 14","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/18a/18a3d9d3ddebe3f7af215af8d53613d0.jpg","description":"The Games on Demand version supports English, French, German, Czech, Finnish, Russian, Swedish.  Download the manual for this game by going to https://help.ea.com/en/tag/manuals and selecting your title from the Product drop down menu.  Unlock the highest level of hockey aggression, speed and skill. NHL® 14 brings together the best technology from EA SPORTS™ to deliver the most authentic hockey experience ever. Deliver hits with the cutting-edge NHL® Collision Physics, built from FIFA’s revolutionary Player Impact Engine. Drop the gloves with the new Enforcer Engine, powered by EA SPORTS™ Fight Night technology. Dangle defenders with new One-Touch Dekes and experience a new level of speed and control with the second season of critically-acclaimed True Performance Skating. Huge hits, real fights, and unbelievable speed and skill. This is NHL® hockey at its greatest, powered by a generation of EA SPORTS™ innovation.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":28491,"name":"Feeding Frenzy 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e92/e925675403902177874a4f7ab463e6c7.jpg","description":"Local Multiplayer 2-4, HD (High Definition). Chomp your way through an underwater mystery! Play solo or with friends to dodge predators and eat your way up the food chain to save the sea in this Feeding Frenzy sequel. Play wild, wacky Party Games. Stay alive in Time Attack! Sixty spectacular levels, brand-new fish and underwater scenes await!  There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"PopCap Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":24939,"name":"Point Blank","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/522/522b45ce44c5613db7c7d81c3906a851.jpg","description":"Test your hand eye coordination as you tap the touch screen furiously to\naccomplish your goals! Using the stylus as your shooting instrument, you\nwill be tested in four different difficulty levels in over 40 different\nstages!\n\nFeatures 5 different modes:\n\n• Arcade: Play through four different levels of difficulty\nwith varying numbers of stages\n• Wireless VS: Challenge\nyour friends utilizing the wireless feature with only one game card and\nfind out who's the quickest draw\n• Brain Massage: Play\nthrough various stages while the game analyzes your abilities and gives\nyou feedback accordingly\n• Freeplay: Select any stage at\nany time to challenge your best score\n• Classic Coin-Op Games:\nNew stages adapted from Namco's classic coin-op arcade series","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Zepetto","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":23504,"name":"Aztez","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/718/718af421f50fdb4bface99d3fbf30628.jpg","description":"Brutally satisfying beat-em-up combat, set in the Aztec empire. Choose your fights in a turn-based metagame.\nAztez is a unique hybrid of beat 'em up and turn-based strategy set in the world of the Aztec Empire. Deploy your Aztez (elite close combat warriors) in the metagame and enjoy a highly technical real-time combat event that has consequences in the empire. But choose your missions wisely, as you have limited deployments! A great enemy approaches the Valley Of Mexico, and it will require all of your skill and cunning to take them on and change the course of history...\nHighly replayable Campaign game that changes every play-through. Different events, artifacts, and battles every game.\nExperience huge Empire cities, stunning natural vistas, and even the Aztec underworld!\nPerform sacrifices, score enormous combos, and summon immensely powerful Aztec gods.\nFight against historical warriors and mythological foes alike using 8 distinct weapons.\nFind and equip over 70 cosmetic items.\nOr enjoy a purified combat experience in the great capital city arena!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team Colorblind","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":22082,"name":"SPACEPLAN","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d9/8d90e8b46aa7ab30b74ffaae1c0ed691.jpeg","description":"SPACEPLAN is an experimental piece of interaction based partly on a total misunderstanding of Stephen Hawking’s A Brief History of Time. Use manual clicks and the passage of time to create and launch potato-based devices and probes from your nondescript satellite orbiting a mysterious planet. Unlock the mysteries of the galaxy or just kill some time in what the astrophysics community is calling the ‘best narrative sci-fi clicker game of all times’.FeaturesFifteen starchy items to unlock, create, and blast into the vacuum of space.\nLife affirming, silly story that will both captivate and help you kill time.\nReveal the secrets of five different planets across two different realities.\nBanging soundtrack, as is customary in a narrative sci-fi clicker game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21539,"name":"Battle Mages","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/513/513d34fca3f7d56c1fab8ea4127e3789.jpg","description":"Darkestville Castle Coming Soon\nA new part of Montezuma!http://store.steampowered.com/app/443370\nAbout the Game\nBattle Mages is a courageous mix of the RTS and RPG in a huge fantasy world, full of mystery, mythical creatures, magic and knights honor.\nImagine as you have just graduated of an Imperial Magic School and now you have to face the trial of Battle Mages Guild completing the tasks in the Mage Towers all around the Internal World. Start your glorious adventure by fighting through the undead army to find the lost gnome artifact that can stop the imminent danger.\nYour time is running out my friend! Challenge yourself and stop this bloody war! Let the magic be with you!\nHuge game world that lives its own life\nDynamic quest system, that can change in every minute depending on your choices\n5 unique designed races each having strengths and weaknesses\nOriginal character leveling system with 45 spells, 6 stats for mage character and tens of special abilities\nUnique troops leveling and micro-control system\nWeather and season simulation, beautiful landscapes, rivers, lakes, forests, mountains, canyons and even a sea island","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"}]},{"id":21297,"name":"Inside The Gear","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50c/50c9a99ece19d4b6991020771e7d7a48.jpg","description":"A physics puzzle game like no other! You are inside the big old machine. There are rusty gears and shafts all around you, along with interactive objects such as planks and cubes. Use each object and place the wheel on the platform – easy!Key Features:Unique physics puzzle game.\nMultiple solutions for each puzzle.\n25 levels with its own colour scheme in each one.\nGreat atmosphere.\nNo stories, just puzzles and lots of gears!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mykhail Konokh","platforms":[{"id":0,"name":"PC"}]},{"id":20639,"name":"Arcane Sorcery","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/425/425aa5a25aa6e300aba80d189741d0c8.jpg","description":"Arcane Sorcery is a 4x strategy game. You are a sorcerer king. Cast powerful spells from afar from one of 4 spell books. Train units and build your economy.\nHigh strategy on a campaign map as well in turn base battles.\nChallenging AI that does not get buffs in all but the hardest difficulty.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Andrew Rowe","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19267,"name":"Ember Kaboom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/749/7498c8e9b294a764e53b0dd0743fcb76.jpg","description":"Ember's a fox who loves adventure.  Run, jump, and ride through 30+ colorful, fast-paced obstacle courses in a quest to get your missing soul back!  Slip past fire-breathing dragons or weave between hungry over-sized goldfish...  Ember's ultra-simple control scheme is easy for anyone to pick up and get hooked!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Josh Koenig","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19020,"name":"Pajama Sam 3: You Are What You Eat From Your Head To Your Feet","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/066/066f5a66b41d48d554fec57185dc61e1.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GamePajama Sam is off on a nutritiously edible adventure!\nPajama Sam chases down some snickering cookies, only to find himself in the midst of a food squabble! The fats and the sweets are taking over Mop Top Island and an emergency peace conference has been called, but four of the delegates are missing! Now, it's your turn to spring into action to help Pajama Sam find the missing delegates, put a stop to the sticky quarrels, bring peace to Mop Top Island, and still make it home in time for dinner.\nMeet friends along the way - friendly food walks, talks and even tell jokes.\nExplore and Learn: Investigate every location. There is something new to learn with every click!\nInteract with the characters and listen closely for clues.\nIt's a different game each time you play.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"}]},{"id":18549,"name":"Vampire of the Sands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1a/d1a0846c0229d5dabe5c9648b6252aca.jpg","description":"Vampire of the Sands is a punishing action dungeon-crawler with roguelike elements. Resurrected by a necromancer, you are sent into the dungeon to assassinate The Vampire. Although your body is fragile, there are many tools at your disposal to beat the odds. Utilize:Items in the dungeon are to be treasured. Carefully manage your use of the mundane and magical to ensure you come out alive.Brawl:Fight monsters, each with their own separate personalities. Discover their true nature and exploit their weaknesses.Die:See how far you can get with only a single life. Feel your blood pressure rise as you get further than ever before!Upgrade:Unlock runes which allow you to upgrade your character. Choose carefully to synergize with your preferred playstyle, or go for unique and fun combinations for a challenge.Explore:Delve into the branching dungeon in any order you want.Return:Vampire of the Sands is fully complete, but will still see improvements and content updates. User feedback is welcome!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13450,"name":"Perpetuum","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b14/b14a0eed60e8e90dfd7b0d77bcc8d7cd.jpg","description":"Special EditionGet a headstart on your Perpetuum adventure with our premium packages!\nEP (Extension Points) can be spent on your character's extensions to instantly become better at your trade of choice\nPerpetuum Credits can be used to purchase monthly EP boosters or downgrade unwanted extensions\nAID packs (Alien Improbability Devices) provide you with random modules or ammunition when activated\nExclusive sparks will boost selected attributes of your active robot\nThe Perpetuum OST includes 4 albums with over 5 hours of atmospheric music\nAbout the GamePerpetuum is a persistent, sandbox, single server, massively multiplayer sci-fi rpg (MMORPG). Control huge robots and mechs to gain access to an alien planet's resources and knowledge, amass huge wealth, or even claim part of the world for yourself using terraforming and complex infrastructure.\nMain Features\nNo Monthly Fees – Buy once, play forever. Enjoy a constantly evolving world with periodic feature upgrades.\nSci-Fi Setting – Perpetuum is set in a unique sci-fi environment inhabited by robots and alien technology.\nPersistent Game World – Perpetuum features a large, persistent, single shard online game world. Players all play on the same server together. Changes made to the game world by players are permanent.\nIndustry – Perpetuum features a complex, multi-tier industrial system that enables players to have both small and large scale industrial operations.\nEconomy – The economy is completely player driven. Other than basic items, everything on the market is manufactured by players, the prices dictated by supply and demand.\nPlayer-Built Infrastructure – Players are able to raise their own settlements in the unoccupied areas of the Perpetuum world, where they are able to enforce their own rules as they see fit.\nTerraforming – Players are able to form the world of Nia as they see fit to aid their goals. The terrain can be raised or lowered in certain areas and thus settlements can be protected by intricate strongholds, and temporary shelters can be created in the heat of battle to protect vulnerable allies. It's all up to the player's imagination.\nCharacter Progression – Time-based character progression requires no grind and provides a level playing field for casual and hardcore players alike.\nLarge Scale PvP – Players are able to clash in huge battles for control of territory and resources. Formable terrain, destructible scenery and player built infrastructure all play key roles in the course of war.\nHigh Customizability – Players of Perpetuum have a large number of ways to customize their robots for the various goals they strive towards.\nNatural Processes – The Perpetuum game world always changes through natural processes. Destroyed plants grow back and spread, and outmined resources replenish over time.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Avatar Creations","platforms":[{"id":0,"name":"PC"}]},{"id":12789,"name":"Deadly Hunter VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4af/4af06bf52e933ff75eb8f7535ea164cd.jpg","description":"Take the role of a Deadly Hunter in this first person defense game!\nThe Orcs invaded our homeland but we defeated them. However, there are still small bands of Orcs lingering in a number of our strongholds. As a renowned hunter, your task is to eliminate the remaining Orc troops and to liberate all strongholds.Amazing Immersive Experience\nBattling monsters is brutal. As their archenemy, you must fight their axes and spears.\nUse your body to dodge about and find ways to blow the enemy’s head off, or you’re next to fall! Rich Game Content\nOver four (4) hours’ worth of glorious gaming experience with over 20 scenes and exciting challenges!\nMonster variety like no other: Find over 10 kinds including Berserker, DarkSpear, Shieldon, SmokeLord, and Ladybug and find the best ways to annihilate them!\nExciting future content for all types of players: The Escort Mode and Multiplayer Mode are coming soon. Powerful Trap System\nTraps are hunters’ best buddies!\nUnlock 10 unique traps including the steel trap, the venom swamp, and the archer tower.\nEach Orc has a specific weakness – find out and choose a trap wisely!\nThere are over 100 trap upgrade combinations! If one isn’t powerful enough, satisfy your desire and upgrade your traps.\nExtreme Challenge\nAfter sharpening your Orc-slaying skills at the regular levels, step up and try the Elite and Endless Challenges. Conquer the most ferocious monsters and add them to your loot!\nLet the world know you’re the best hunter! Enter the global rankings after clearing a stage and start your own legend.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Leiting Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10255,"name":"Orange Moon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbf/fbff1eb27bd5fb0d48a80179be623ac7.jpg","description":"Orange Moon is a surreal 2D action-platformer with RPG elements and complex puzzles. Take on the role of an explorer as you discover the mysterious world of Orange Moon – filled with hostile native life forms and harsh, treacherous environments. To increase your chances of survival, choose from a variety of weapons, equipment, and upgrades to aid your dangerous exploration. Can you uncover all of Orange Moon’s secrets?\nExplore a mysterious world filled with hostile life forms.\nSurvive by acquiring and utilizing an array of unique weapons, equipment, ammunition, and upgrades.\nSolve complex puzzles to successfully uncover the secrets surrounding you.\nFight bizarre enemies – from carnivorous plants to deadly biomechanoids – and defeat fearsome bosses.\nOvercome harsh and treacherous environments with obstacles such as acid swamps, toxic clouds, and deep craters.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Betelgeuse Zero","platforms":[{"id":0,"name":"PC"}]},{"id":9654,"name":"Hide vs. Seek","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/717/7176b057bedd0703d56f05525a76f973.jpg","description":"An experiment has gone horribly awry, giving birth to a mischievous, shape-shifting blob of goo! A state-of-the-art tracking robot was created as a countermeasure to protect the house. Take the role of either character and join the frantic cat-and-mouse chase as the blob sneaks through the house while the robot hunts it down!Key Features:Intense chases\nNarrow escapes\nOnline peer-to-peer multiplayer through Steam\nUnique character abilities\nFree! No micro-transactions, no in-app purchases, just free.Character Descriptions:Hider:\nA blob of sentient goo, the Hider's objective is to sneak around and gather as much goo as possible from canisters scattered throughout the house. It can turn into almost any object to disguise itself, but it also has a few defensive measures in case it is found by the Seeker. A brief sprint helps create some distance so the Hider can morph into a new object and vanish again. It can even vaporize a small percentage of its body to create a smoke screen that leaves a gelatinous residue on the Seeker's ocular unit. Once enough goo has been collected, the Hider can take over the Seeker by assimilating it into the glorious mass the Hider has become. If the Hider does not collect enough goo, however, it will run out of energy and the Seeker will reclaim the house in the name of order and cleanliness.Seeker:\nA robot hastily constructed to combat the goo, the Seeker is equipped with only the highest quality gear to stop the Hider. A high-tech squirt gun dilutes the Hider's goo until it is weak enough to be captured. A tracking grenade causes a chemical reaction on contact with the Hider that will cause it to leave a trail behind it for a short time. The Seeker can even detect how far away the Hider is, displaying the data on a hot-and-cold meter for maximum effectiveness - who needs numbers, anyway? The Seeker has to prevent the Hider from collecting goo until it runs out of energy, or capture it once it has been sufficiently weakened.Who are we?Brave Little Studios is a group of 9 graduate students from the University of Utah's Entertainment Arts and Engineering program.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Brave Little Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9569,"name":"Fictorum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/243/2435226d3370e6ced1fa8bd056d9090d.jpg","description":"A reign of terror never feels so satisfying as when you leave a literal pile of rubble in your wake. Giving wizards a much-needed makeover, Fictorum is an action role-playing game that features fully-destructible structures, a randomized node-based world map, and a satisfying magic system with on-the-fly spell shaping and customization.\nIn Fictorum, your mage wields real, legendary power right from the start—unlike those found in most magic-centric games. Our magic system uses a dynamic and intuitive spellcasting and shaping system that grants the player an unrivaled level of customization and reconfiguration. Up to three runes can be applied to a spell, each affecting a different spell characteristic. The runes are easily swapped to suit the player’s current need, interest, or whim. You might amplify ice blasts to freeze enemies in place, expand the radius of a fireball explosion to crumble a bridge and hinder pursuers, or chain a lightning attack together to strike several targets in a cluster. Shaping makes spellcasting much more tactical and satisfying.\nRather than starting out as a hapless farm boy who stumbles into his powers and avoids enemies or entire areas until leveling up, players take on the role of an established wizarding badass, hell-bent on his mission for revenge. Yet challenge is abundant—the wizard must bring down a sprawling empire by himself, besting scores of bandits, cadres of Inquisitors, and hordes of corrupted abominations on his quest for vengeance. The protagonist has access to unlimited magical powers, making the game less about spamming that one spell that works passably well until it becomes upgradable. The experience is more about tailoring your magical arsenal, giving the player a wide range of freedom and the ability to effectively, efficiently, and enthusiastically destroy every obstacle. The randomly-generated world map features locations where every structure (from large buildings to bookshelves to tables to even a lone fork) can be demolished.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Scraping Bottom Games","platforms":[{"id":0,"name":"PC"}]}]