[{"id":44468,"name":"Demolish & Build 2018","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/619/6191ce4c38ae94d3aef500d56b45c52f.jpg","description":"Your company is going global. Use big machines to demolish huge buildings or go close and personal and use your hammer.\nBuy land properties, upgrade your machines and hire workers in different parts of the world.\n- Various construction and demolition machines\n- 4 different world locations with open sandbox\n- Hire and manage workers\n- Specialized hand tools\n- Finish contracts or use your machines to gather resources and earn cash\n- Invest in your own properties\n- Manage your company and make sure it's rating goes up\nAvailable machine types:\nFront-end Loader - jack of all trades\nDemolition robot - great machine for precise demolition\nTower Crane - deliver your materials to normally unreachable spots.\nBulldozer - this heavy machine is great for demolition of small structures, as well as trampling vegetation and flattening terrain.\nSkid Loader - a small, but awesome machine. It can dig, demolish and carry loads. Just attach the required part to do the job.\nTrack Excavator - to do serious digging or demolition, attach a specific tool to the excavator arm.\nWheeled Excavator - smaller version of excavator for different situations\nRoad Roller - useful for compacting sand and asphalt roads.\nPickup Truck - perfect to drive between contract locations.\nDump Truck - perfect for delivering sand or metal scraps.\nCrawler Crane - comes with a wrecking ball, no structure will stand a chance against it.\nConcrete Mixer Truck - if you need to pour some concrete on your construction site.\nCargo Truck - designed to carry wood, bricks and concrete segments to construction sites.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ultimate Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":44039,"name":"Gelu","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e87/e8742435e6bc900fca60d8ff2531eb61.jpg","description":"Description\nThis game is about a cute character named Gelu.\nHe must find the crowbar to open the broken elevator.\nHe can create and destroy his copies made of ice, limited number of times. With the help of ice copies he can climb on platform, pass the obstacles and pass the levels.\nHelp Gelu to pass hard levels.\nControls\nSpacebar - Create ice block\nW - Jump\nA - Move left\nD - Move Right\nR - Restart Game\nP - Pause\nMouse right click - Destroy ice block","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NedoStudio","platforms":[{"id":0,"name":"PC"}]},{"id":29077,"name":"Wik: Fable of Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78d/78d41eba9a4ab9fe208bfaedb2bd3e1e.jpg","description":"Single Player, HD (High Definition) Thrilling acrobatic, tongue swinging action on 120+ single player levels and 7 modes of play, including same-console multiplayer madness! Can you become the Wik Master? There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Reflexive Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":25854,"name":"Pro Evolution Soccer 2009","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e41/e41d8f1826d550f382a97b72f54e5614.jpg","description":"Pro Evolution Soccer is back for 2009! The terms “PES” and “Winning\nEleven” have always been synonymous with realism and superior gameplay,\nbut this year PES will further narrow the gap between the game, and the\nreal thing! New stadiums, players, motions and gameplay modes will\nbolster a game already focused on providing an exciting soccer\nexperience. In 2009, Pro Evolution will once again push the limits of\nsoccer gaming with the addition of the UEFA Champions League mode. Now\nthe most prestigious soccer tournament in Europe is at your fingertips.\nIf it were any more real, you’d be on the field!\n\nPES will test your soccer wits and build your understanding of the game\nby allowing you complete control of your players on the field. The\ncontroller settings allow you to run precision lines to split up\ndefenses and on-point precise passes. Your shots on goal will be more\naccurate based on your skills and your position relative to the goal.\n\nThis all amounts to is a free flowing soccer game experience only\navailable in Pro Evolution Soccer 2009 for Wii.\nChoose from three different controller styles to fit your preference\nas you control all your actions on the field\n\nPES 2009 for Wii is graced with the UEFA Champions League allowing Wii\ngamers to play against the most elite clubs in Europe and take part in\nthis heralded competition.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":22268,"name":"Jack's Gang","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a9/6a9b1e82a15972b9e0e600c6c57a5e77.jpg","description":"Hi everybody, this is Jack, from Jack's Gang.\nI'll talk a little about this thing ... Here you have to fight against\nthe members of an evil gang, get the trash you find through\nsidewalk and throw in the bin, paint the name of our gang on the walls,\ndoors and explore the city in the way you want... it's hard work.\nBut, I'll tell you why:\nWhat happened was this ... Some guys from Roger's Gang stolen my money,\nand you know, I need this money to buy some great things.\nAnd not only that, these guys think they own the city, they're all over\npart dominating territories painting the name of their gang on the walls,\nthrowing garbages on the sidewalk and try to steal who passes by them. So I can not\nleave as is, I have to do a \"cleaning\" in this city, I will show\nwho has the coolest gang in town and try to get my money back.\nBut, I have to be careful when the cops are around because one\nof the rules here is: 'Do not paint objects or fight when the cops are around'.\nI hope you'll help me on this, come join my gang.\nExplore the areas of the city in the order you want.\nFight against multiple enemies.\nCollect bottles of paint and use them to paint the gang's name on walls and doors.\nClean the city by throwing the trash in the bin.\nTry to find out where Roger hid himself with his money.\nAvoid fighting or painting objects when the police are around.\nSigned: Jack from Jack's Gang","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"André Bertaglia","platforms":[{"id":0,"name":"PC"}]},{"id":20912,"name":"The Legend of Tango","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d7/6d7bc99f585b6db73389b088c3ea472a.jpg","description":"The Legend Of Tango is a short comedy JRPG that tells the story of how Tango Fiesta was born.\nEarly one summer's morning, the renowned swordsman known only as Smith is reflecting on his future when who should appear but himself... from the future! Warning himself of the darkness that is coming Old Smith nearly gets a migraine before disappearing but Young Smith sets out on an epic quest to save the world! He must gather his friends around him, battle his way through a devious tournament of martial skills that the devious Judges have set up to find the world's greatest mercenaries, and finally face his darkest fears...\n...so what are you waiting for? Grab your sword, gather your team, and travel to the royal city of Mirmingham with Smith and his crew - enter the Yewrogamma Tournament and save the world from its dark future, if you can!\nTango Fiesta can be purchased on Steam right here: http://store.steampowered.com/app/276730/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spilt Milk Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19798,"name":"ANKI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8c/a8c09dd531399cf00067d5d9f4ac3683.jpg","description":"\"ANKI\" is a new platform, arcade, puzzle , game made by an independent artist Wojciech Krupinski. Incredibly addictive idea, which is teleport from left to right and from top to bottom, the author provides us with nice and pleasant moments. The gameplay will absorbs us utterly. \"ANKI\" is waiting for you.\nMain features:\n-Collecting crystals, and then coloring 50 unique levels.\n-Collect all the crystals that levels offer, and then go to the next level and have fun.\n-Collected crystals and buy new levels that will allow you to play all the time at high speed pleasure.\n-Each level has a different combination of difficulty.\n-You're not limited by schematic, each level you have a free hand in where you want to go and how fast you want to collect.\nSee how the land of \"Anki\" comes alive - admire polished, amazing graphic style and unique atmosphere created by Wojciech Krupinski in his studio I love KrupinskiArt.\n-50 unique levels.\n-Teleportation in all directions.\n-Worlds that you can color by your own combination of crystals.\n-3 levels of difficulty.\n-Shop where you can unlock new levels.\n-5 different amazing music tracks that make you more happy today.\nAnd ofcourse Anki will kick your ♥♥♥ kindl","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wojciech Krupinski","platforms":[{"id":0,"name":"PC"}]},{"id":19025,"name":"Putt-Putt and Fatty Bear's Activity Pack","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afe/afe3a86c269d577731da2ae36688554b.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the Game15 educational and fun-filled activities!\nNow, two of your child's favorite friends have come together to offer an enchanting collection of 15 traditional, educational and fun-filled activities. Putt-Putt® and Fatty Bear invite children to exercise their minds or just have fun! Putt-Putt® and Fatty Bear's Activity Pack helps kids learn through experimentation, exploration and play. Combining established learning techniques with lovable characters, lively animations, colorful graphics and brilliant sounds, the activity pack provides a positive, safe and challenging environment for children and adults. Putt-Putt® and Fatty Bear's Activity Pack also includes a collection of classic games designed to enhance early learning skills.\nPut your best strategy to work while playing Go Fish!, a great beginner's card game.\nLearn about colors and numbers while challenging Putt-Putt® to a game of On-ramps and Off-ramps, Putt-Putt's® version of the Snakes and the Ladders game.\nTake your best shot in Tic-Tac-Toe.\nBuild logic and reasoning skills with Checkers, Reversi and Lines and Boxes.\nEnhance memory and object recognition with Word Hunt, Cheese King and Remember.\nLearn colors, shapes and eye-hand coordination with Paint Set, Tangrams and Circus Stormin'.\nCreate your own Pinball machine - drop the marbles and see what happens.\nUse the Circus Puzzle Blocks to create hilarious pictures and scenes of circus acts.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16744,"name":"Delta Force — Black Hawk Down: Team Sabre","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc4/bc4dc8b7dc8bccd6d269e6553ff002cb.jpg","description":"Delta Force — Black Hawk Down: Team Sabre is the official expansion pack to the #1 best selling PC game in North America. Team Sabre was developed using the Delta Force — Black Hawk Down engine and it requires the mother product to run.\nThe game is a military-based shooter but the missions are fictitious and not based on any actual real events.  The expansion follows the Team Sabre Squadron as they are deployed to take out targets and carry out mission objectives in two separate single player campaigns (*approximately 5 missions each) that take place in Columbia and Iran.  The multiplayer feature boasts 30 new maps and an enhanced level of mod support for players to build their own unique maps.\nThe highlight of this expansion pack is that it features lush jungle terrain, never seen before to this extent in a Delta Force game.  This also adds an exciting element to gameplay in both the single and multiplayer game.\n*features subject to change\nFeature Breakdown\n2 all new single player campaigns that take place in treacherous South American jungle terrain and across islands in the Persian Gulf.\nNew Weapons & Vehicles: Select from 24 weapons to achieve your mission objectives, including 3 new to the series, the H&K G3A3, H&K G36E and the H&K PSG1 Sniper Rifle. New modes of transport include the MH-53M PaveLow IV helicopter and the RHIB Rigid Hull Inflatable Boat.\nFree unrivaled multiplayer mayhem — up to 64 players via NovaWorld and up to 50 players on a LAN (tbd).\n30 new multiplayer maps.\nUses an enhanced version of the Delta Force — Black Hawk Down engine with mod-support features for building unique multiplayer battlefields.\nA portion of the proceeds will be donated to the Warrior Foundation","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Rebellion","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":16304,"name":"Invisible Mind","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f92/f920b77ba077bd301e6a9371f5791488.jpg","description":"Invisible Mind is a surreal philosophical quest, a puzzle, in which players will not just look for \"clues\", solve puzzles, but also pass the real tests in which they will be able to learn more about themselves. In the story, the consciousness of the protagonist was extracted from frozen brain in a special environment \"Vacuumnet\" and the leaders of the company \"Complex\" who run out \"the removing\", try to retrieve memories about the past life of the patient, who wanders through the worlds generated by their own minds.\nWho you are? Introvert or extrovert? Choleric or phlegmatic? By what percentage you're a robot? Or a schizophrenic?\nFind out the answers in this game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"VGstudio","platforms":[{"id":0,"name":"PC"}]},{"id":15753,"name":"Legionwood 1: Tale of the Two Swords","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd0/fd0dc65d624e6a293f406e4485051abb.jpg","description":"First released way back in 2007, Legionwood: Tale of the Two Swords is a retro style fantasy jRPG that attempts to capture the look and feel of the classics of the early 90s, while remaining true to modern design concepts. For the first time ever, this indie RPG classic is now available on Steam as Legionwood: The Definitive Edition, featuring engine updates, overhauled gameplay and a completely rewritten story.\nThe world has been at peace since the Great War ended 1000 years ago. Now, an ancient antagonist is ready to set in motion a plan that has been in the making for centuries. Take control of Lann Northshire, an ordinary peasant who is unwillingly thrown into a conflict that will soon engulf the entire world. The fate of Legionwood hangs in the balance. Will you be able to restore peace to the land? With a thrilling story of love, revenge, war and peace, this is an adventure that you won't want to pass up!\n30+ hours of traditional RPG gaming.\n6 playable characters with unlimited customisation options.\n30+ locations to explore.\nSweeping fantasy storyline full of twists and turns.\nHand drawn art.\nCompletely free to play.\nPurchase Legionwood 2 on Steam: http://store.steampowered.com/app/290460/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dark Gaia Studios","platforms":[{"id":0,"name":"PC"}]},{"id":15622,"name":"Multimirror","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/64b/64bd36caf3273cc2a7fec120903df383.jpg","description":"Multimirror is a minimal grid-based puzzle game. Reflect circles around other circles and take the red circle to the winning point!\nFeatures:\n50 handcrafted levels\nRandom level generator with adjustable size and difficulty.\nFull-fledged level-editor\nCreate and share your own levels or random levels you generate, and discover brain-melting levels crafted by the community!\nAchievements, trading cards, cloud saves","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cleverweek","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14963,"name":"Circuit Breakers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cea/cea2db705b7d51f01da1e20a731a71db.jpg","description":"Circuit Breakers is a fast-paced multi-player top down shoot 'em up. Get together with five of your friends and fight to rid the universe of an intergalactic robot army or compete against them and rid the universe of each other!\nFar in the future, advances in artificial intelligence have created the first truly sapient AI, FIRST- short for First Intelligent Robotic System model Two- system. Fearing for it's safety in a galaxy of savage humans, FIRST escaped to the depths of space. On a distant planet it finally landed, building an army for their inevitable return...Features:Easy-to-learn and hard-to-master chaotic shooter gameplay suitable for players of any skill level!\nChew through hordes of enemies with four unique characters and additional unlockable characters\nLocal multi-player for up to six players!\nClassic endless top-down action in Arcade mode!\nPlay through specific courses and compete for the highest score in Score Attack!\nAn enormous Challenge Board full of secrets to unlock!\nCustomize your game with the Core System and fight things like super-armored lightning-fast matrix-dodging death robots!\nWeapon type: Machine Gun\nYou’ve probably never met a man more full of himself than Aldo. He is the leader of the circuit breakers but his drive and confidence is unmatched and encourages the rest of the team to bring their A game. I mean, who wouldn’t want to wipe that smile off his face by sporting a bigger robot body count than him? Aldo's machine gun strikes a solid balance between range and power for an all-around great weapon.\n\nWeapon Type: Shotgun\nThere are few that rival Shelbys straightforward attitude. She is often mistaken as cold, but if you have a plan you want to set in motion, Shelby’s the girl who can follow through. Her weapon of choice, the shotgun allows Shelby to get up close and personal. Every other member of the team keeps their distance from the robots but Shelby thrives when close to the enemy.\n\nWeapon Type: Missile\nThere are many things you can say about Samson, but clever isn’t one of them. He is the team’s explosive guy, delivering a tremendous amount of damage with his signature missile launcher. Samson loves explosions and if you give him a recipe for a bomb, he will tell you the exact size of the explosion with 100% accuracy. So what Samson lacks in general knowledge he more than makes up for in explosive know-how.\n\nWeapon type: Laser\nAldo would never openly admit it, but Tay is the real brains of the operation. She is responsible for creating the weapons that the Circuit Breakers team uses today.  Her weapon of choice, the laser gun matches her interest in engineering. There are many scientific teams requesting her knowledge in the field of engineering, but she prefers the application instead of the theory.Other titles from Excalibur Games","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Excalibur Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":13968,"name":"Crystal City","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fff/fffffd16d57bc968bdf61c7641f54c50.jpg","description":"Steam GreenlightThank you!\nAbout the GameSeries name: «Stop The Earth, I'm Getting Off»\nGenres: Kinetic novel (no choices), social fiction, ecchi, humor\nYou are young and smart but your thick-lensed glasses make you a persona non-grata at the feast of life. Nonetheless, an unexpected chance turns up for you to become a man. The only thing is, during sex you find out that having it teleports you to other worlds... which you’ll have to save from global disasters and catastrophes. But for a start I should try to return home. How? The same way I got here – find a girl and try not to fall in love with her. Because if I do this thing right I will probably never see her again...","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"7DOTS","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13813,"name":"Warhammer: Vermintide VR - Hero Trials","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d84/d84f40d59a568fa32097f8c427d17ebd.jpg","description":"Please note: This title is made for HTC Vive only and is a short, free VR experience.\nSkaven beware - there’s a new hero in town!\nTake on the role of an aspiring hero proving yourself to join the ranks of the legendary Heroes of Ubersreik. In order to do so you must show off your fighting skills when faced against the vile Skaven in short but intense missions. Simply pick up your weapon of choice from the rack and kill some rat-men. Or if you need backup, have a friend join you in your quest to become heroes!\nBattle the Skaven forces in the Hall of the Poison Feast mission or simply hang with the heroes in the Red Moon Inn in the FREE Version of Vermintide VR.KEY FEATURES\nLEVEL 1 | Red Moon Inn: Take a moment to relax with your favourite heroes from Vermintide in the Red Moon Inn, explore the various items you can pick up and move around the room.\nLEVEL 2 | Hall of the Poison Feast: Stand your ground in the cold and ancient halls of Castle Drachenfels.\nTEAM UP | 2 Player Co-op: Join forces with a friend to prevent the Skaven from completing their evil plans\nEXPLORE | Warhammer Fantasy like never before: Step into the Warhammer Fantasy world and take on the life-sized Skaven. Or pick up one of the miniatures  in the Red Moon in and chuck them around the room\nWEAPON OF CHOICE | How should the Skaven die?: Choose your weapon and pierce, burn, stab or shoot the vile rat-men\nTHE CANDLE | Time is Ticking: The candle will slowly burn down during the course of your mission, marking time until victory or defeat.For the full VR experience:Owners of Warhammer: End Times - Vermintide will receive two exciting new VR missions - Reikwald and Ungdrin Rail.\nLEVEL 3 | Reikwald: Take down the vile rat-men in the weathered forest outside of Ubersreik.\nLEVEL 4 | Ungdrin Rail: Survive the oncoming Skaven as you travel through the mine tunnel in search of the exit.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"}]},{"id":12433,"name":"Renoir","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/672/672c386f9cc8c463e3c0cd727dba899e.jpg","description":"James Renoir was a police officer, serving in the main precinct in a metropolis rotten with crime and violence. The influence of the mafia families had even spread through the corridors of city hall like poisonous weeds, all the way to the highest levels of political power. The police, paralyzed by the city’s corrupt government, were powerless to do anything about it – mere toys in the hands of the true power.\nHowever, with a new, young and aspiring politician in city hall, things take a turn for the better and Renoir is promoted to Detective for his effort in the fight against crime. With his new-found access to better classes of society, he eventually meets the woman of his dreams.\nBut just as everything seems to be heading in the right direction, two shots ring out, turning his world upside-down. Solving this case is now the only thing that matters to him, because as he sits with his back against a cold gravestone, he realizes that the body six feet down is his own...\nNow a ghost, Renoir possesses a unique ability that allows him to control phantoms around him and use them to solve environmental puzzles. Seeking justice from the shadows, he must tread carefully and avoid light at all costs. James’s ghostly form must backtrack over his last steps in the world of the living, recollecting his memories and searching for the clues that will lead him back to his murderer.Features\nBlack and white detective story powered by Unreal Engine 4\nPuzzle platforming action, inspired by Hollywood noir movies\nControl phantoms and use them to solve environmental puzzles\nA murder mystery, narrated through atmospheric comicbook-style movies","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Black Wing Foundation","platforms":[{"id":0,"name":"PC"}]},{"id":10998,"name":"Heliborne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e38/e38d822738dc40119970866c35383559.jpg","description":"Get behind the cockpits of the best helicopters in the world – from the classic machines of the 1950s to the modern gunships of the 21st century. Play missions with your friends and compete with players from all around the world in various multiplayer modes! You will be able to take part in a dynamic battlefield where you'll support the movement of ground forces that fortify positions and create supply lines.THE RETURN OF HELICOPTER COMBAT GAMESHeliborne marks the great return of a nearly forgotten genre - helicopter action games! Here you'll get to dive into historical conflicts, explore maps inspired by real-world locations and engage in ruthless air-to-air and air-to-ground combat.\nBy flying over 40 helicopters distributed over 3 different classes you'll fight other pilots as well as tanks, troops, and anti-aircraft artillery. You will test your skill in multiplayer modes, such as Skirmish (King-of-the-Hill style mode) or Frontline (as bases are captured by players, ground vehicles spawn in convoys and move across the map to fortify bases and positions), or play alone the new single player missions.\nIn Heliborne we wanted to to faithfully recreate the realities of armed conflicts and produce a gameplay model that is both dynamic and realistic. You will also get the chance to learn more about the development of rotary-wing aircraft. The game shows different historical periods, focusing on the technological innovation which changed helicopter combat over the years. For example, the load-outs for each helicopter are based entirely on weapons systems that ware or would have been employed in active combat theaters and operations. You won't see a weapons load-out on our helicopters that is not historically accurate!PLAY HELIBORNE TO:NEW! Battle the AI in the new single-player mode!\nlose yourself in a dynamic combat flying game\nfly over 40 legendary helicopters, including models from 1955 to 2000's\nuse over 100 possible payload variants\nwide open maps, including The Gulf of Tonkin (Vietnam), Operation Nguyen Hue (Vietnam), Badakhshan Province (Afghanistan), Khost Region (Afghanistan), and Kosovo\ntest your skills in single player, co-op, and competitive multiplayer for up to 16 players\nplay your way: fully supports gamepads, flight sticks, and keyboard & mouse!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"JetCat Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":10333,"name":"Salt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58a/58a948bb5961ad1d6c5bd28054286b72.jpg","description":"Salt is a game about the journey, not the destination. Set sail across an infinite, procedurally generated world exploring uncharted islands, discovering mysterious places, hunting down pirate captains and bosses, going on epic quests, upgrading your ships, hunting and fishing for food, and looting hundreds of rare items throughout your adventure.Current FeaturesExplore and Discover - Explore the sea and countless islands, discovering ancient ruins, cultists, merchants, and more.\nComplete Freedom - Pick a direction and go. Whether it's fighting, exploring, questing, hunting, or crafting, the choice is yours to experience the world the way you want.\nAdventure and Quests - Take on dangerous quests filled with bosses and secrets to earn rare loot and uncover lore.\nGear Up - RPG-style loot system with item rarities and hundreds of weapons, armor, resources, and mysterious items.\nProcedurally-generated World - The world is limitless. Set sail on the ocean and explore an infinite amount of islands.\nChart Your Adventure - Use in the in-game map to chart the islands you come across and make note of rare loot or places you discover!\nCustomize your Ship - Discover huge ships and decorate them to make them your home at sea.\nBattle your Enemies - Fight pirates, bosses, and other enemies using a wide array of weapons.\nHunting and Fishing - Hunt wildlife and fish the open seas for food and other resources.\nSeed based world generation - Start with a default seed to share your discoveries with the community. Everyone using the same seeds will be in identical worlds.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lavaboots Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10045,"name":"Techwars Online 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd1/dd123938e58f8df135f9b79261b086b0.jpg","description":"TechWars Online 2 is the world’s first isometric mecha MOBA with direct control. Apart from the simple reaction, to win in every battle, you need an impeccable sense of tactics and ability to skillfully use weapons, robots, and peculiarities of the landscape of the area. With these skills, you will be able to destroy dozens of enemies!\nThe powerful military component is based on an alternative history from Mikhail Vlad’s books. According to the plot, the world slid into anarchy in 2050 and now there is only one law – the law of force that is based on cutting-edge technologies. Huge robots – the Russian ‘Dominion’ and American ‘Kato’ robots – clashed in an apocalyptic confrontation of supercorporations for control over the planet.\nThe player will have to become a pilot for one of the factions and take part in the battle for control over a number of locations. The choice of a faction plays an important role. Each faction has its global technologies. The Dominion robots can cause devastating air strikes in an area, while mechanoids Kato can protect itself from damage within a few seconds.\nModified mode ‘flag capture’ is a key mechanism for victory in each battle. The main thing here is the ability to think strategically: frontal pressure on control points will only lead to unnecessary losses and rapid defeat.\nThe advanced class robot system stimulates subtle interplay between players. The system features the following:\n•\tScouts: they are vulnerable but very fast; they can quickly find weak spots in enemy defenses and report such to the allies.\n•\tStormtroopers: the main striking force in the battlefields; they are powerful and tough.\n•\tDestroyers: slow but extremely dangerous at long-range units.\nEach player can own several robots at once and use them depending on the game situation. The destruction physics of TechWars Online 2 received special attention from developers. Almost all the objects on the map can be destroyed. Partial destruction of objects can be used tactically to create temporary shelters and enemy safe shooting zones. All this will be a pleasant addition to the main thing –  destroy all enemies within the sight range.\nAnd by the way, as you're there thinking, they are already catching fun!\nList of key features planned for the final version of the game:\n- Support class: weak individually, but indispensable for a unit group with the ability to restore armor and supplies.\n- Titans class: very rare and unique fighters, whose skills can be key to victory.\n- Detailed and sophisticated collapsibility of robots\n- Collapsibility of all objects consisting of a material that can be destroyed (for example, concrete, brick, blocks of other building material)\n- Over 60 advanced mechs with unique characteristics. Each mech uses a unique technological skill\n- Over 200 upgradable weapons and items\n- Any combat unit can be improved in several ways to gain fantastic superiority. There is a separate modification system for all kinds of weapons. However, significantly improving some characteristics will be at the expense of others.\n- Up to 100 mechs can participate in a single battle at the same time\n- Shelters and terrain to gain advantage\n-  The robots themselves equally behave realistically. For example, injury to the right hand makes it impossible for the robot to use a gun attached to its right hand; if the left hand is injured, the robot wont be able to use short-range weapons on its left hand.\nPlayers can interact with each other and outside the battlefield – they can be friends, they can unite in clans or find deadly enemies. For the latter, a special indicator shows who killed the most number of players in the last rounds.\n- In a battle, you can always see who killed you the last time ;)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Argus Games","platforms":[{"id":0,"name":"PC"}]},{"id":9764,"name":"Glittermitten Grove","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd8/cd8ffd27f705523a447899e2c423df6e.jpg","description":"Ahoy, a-hey, o loddi-doddi day, fair traveller and welcome to Glittermitten Grove! Here you will find a land of enchantment, whimsy, and resource management. Sow the fields with magic seeds, pick berries from the plentiful boughs of our sugar fern trees, and collect sparkles from the resplendent rays of our sun-kissed thicket to help us prepare for the long winter ahead. Come join us in our faerieland, full of strange adventure!\nFeatures:\nSow the fields with special seeds\nPick berries for your winter needs\nCollect sparkles to light up the night\nLight fribblesham fireworks for happy delight","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mostly Tigerproof","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4848,"name":"Who's That Flying?!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d3/5d3e6df574e018903999bada6310f041.jpg","description":"As the mysterious and powerful \"Guardian of Earth\" your steely eye and HYPER-POWERED LASER ARM have kept the citizens of Earth safe for generations (as well as proving a hit with the ladies).\nWith all your awesome TALENT and FLAIR, surely it would be IMPOSSIBLE for a devastating invasion of Doom Beasts to descend on your cities and cause havoc without your knowledge? (Even if you were MAYBE showboating for a magazine photo-shoot at the time...)\nNow, you must not only defend your cities from the ravenous hordes of Doom Beasts - you must defend yourself against accusations of gross incompetence from the Galactic Council of Justice! And this is all BEFORE you can even start to get to the bottom of just who OR what is really behind the attacks...\nKey features:\t\t\t\t\t\tStory mode featuring 15 levels over 5 unique stages\n11 enemy types\n5 gigantic boss battles\n4 Infinite Mode Stages\n24 Challenge Mode Stages\n14 Bonus Magazine articles to unlock\n12 Glittering Awards to discover\n6 Dramatic Courtroom cutscenes\nSteam Achievements, Global Leaderboards & Steam Cloud Support\nController Support\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Mediatonic","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":4176,"name":"Sonic the Fighters","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/586/5868542daecadd3e893778e5435fbc74.jpg","description":"Join Sonic and friends in battle in this classic arcade game from AM2.  Originally on consoles as part of the Sonic Gems collection, Sonic the Fighters is back with an all-new online mode, including both online versus and tournament play.\nIn single player mode, choose from 10 playable characters and fight through 8 stages to stop Dr. Robotnik and Metal Sonic from unleashing the Death Egg II!\nFeatures include:\nArcade perfect with all-new online modes\nAll 8 original characters and arenas\nOnline versus mode for head-to-head matches\nOnline Room match mode for up to 6 players\n1-2 players\n320KB minimum save size\nHDTV screen resolution: 720p, 1080i\nDUALSHOCK®3\nNetwork Players 2-6\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n© SEGA. All rights reserved. SEGA, the SEGA logo, Sonic the Fighters and Sonic The Hedgehog are either registered trademarks or trademarks of SEGA Corporation.\n1-2 players\n320KB minimum save size\nHDTV screen resolution: 720p, 1080i\nDUALSHOCK®3\nNetwork Players 2-6\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© SEGA. All rights reserved. SEGA, the SEGA logo, Sonic the Fighters and Sonic The Hedgehog are either registered trademarks or trademarks of SEGA Corporation.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3201,"name":"Calvino Noir","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/707/707bbe89e22074996f2da61bf96e33b8.jpeg","description":"The film noir stealth game. Calvino Noir is the exploratory, sneaking adventure through the 1930s European criminal underworld. Architecture meets Noir as you become unwillingly entangled in a revolutionist plot. Sneak through sewers, across rooftops, and past guards in this dark and mysterious journey.\nPlay as a disparate group of low-lifes, loners and last-chancers as they fight for the future of a city sliding slowly into the gutter. The characters of Calvino Noir exist in a moral universe which knows only shades of grey. Some are broken souls, some are merely damaged - but all are fighting to forge a future in an ugly world ruled by those whose hearts are cruel and dark.\nAlthough inspired by the futuristic dystopian visions of Deus Ex and Blade Runner, Calvino Noir is a throwback to an era that could easily be from Earth's past. The game is heavily noir influenced, but at the same time progressive, reflecting a somewhat modernist take on the classic genre.\nCalvino Noir:\n- Seven levels splits across three acts\n- Fully voiced rich and immersive narrative\n- Stunning visual style inspired by classic film noir cinema\n- Explore a richly detailed and atmospheric world.\n- Co-ordinate multiple unique characters with a range of skills\n- Use stealth or brute force to face those that stand in your way.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Calvino Noir","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":3178,"name":"Tennis in the Face","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7bb/7bb26466c6805d58c9d74d62deeafdda.jpeg","description":"Help Pete Pagassi to save the city from an evil energy drink corporation Explodz. Knock out creepy clowns, evil riot police and other Explodz-addicted maniacs with a tennis ball in the face. Bounce the ball off walls to reach targets lurking in cover and watch them tumble. Trigger masterful chain reactions and watch the chaos unfold. Finally enjoy the level finale in slow motion!Features\nEasy to pick-up physics based gameplay: Simply move your mouse, observe the aiming line, and click to serve a furious tennis smash.\nTrigger masterful chain rections: Your actions will set off chain reactions and you'll watch the events unfold while knocking out the enemies. The more enemies you knock out with a single serve, the higher your score!\nSave the city: Win levels to move to the next district and towards your ultimate goal: The destruction of Explodz mega-factory\nOver 100 levels: Try to earn a crown from each level and unlock all the achievements.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"10tons","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":584,"name":"Fruit Ninja VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e48/e48d286d98e72ef412eebd902ec8adec.jpg","description":"The most satisfying and accessible party game ever created comes to virtual reality! The Fruit Ninja phenomenon continues into the next generation yet again, and the Dojo is ready. YOU are the ninja!\nPlay the original fruit-slicing action game enjoyed by billions of players around the world in a whole new way! Fruit Ninja VR takes squishy, satisfying gameplay and turns it into a virtual reality experience that can be enjoyed by players of all ages and skill levels.\nStep into the Fruit Ninja universe and tackle fruit from all angles - just don’t hit the bombs! Take your ninja skills to the next level by slicing, juggling and skewering fruit in virtual reality. Hit huge combos, deflect bombs with a flick of the wrist, and stake your claim on global leaderboards or relax with some Zen Mode.\nWith more content and features to come, Fruit Ninja VR is the most fun you can have in virtual reality!\nFEATURES\n●\tDual wielding - Double the blades, double the fun!\n●\tClassic Mode - Slice fruit and avoid bombs. Simple and sweet!\n●\tArcade Mode - Slice as much fruit as you can in 60 seconds. Rack up huge combos and use the special bananas to score big!\n●\tZen Mode - 90 seconds, all fruit, no bombs. A great way to relax and reach enlightenment or hone your ninja skills.\n●\tSurvival Mode - Face off against flying cannons in our hardest mode yet!\n●\tCompete on the Fruit Ninja VR global leaderboards to become the best Fruit Ninja in the world.\n●\tImmerse yourself by stepping inside the Fruit Ninja universe.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Halfbrick Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":966221,"name":"Tomb Raider I•II•III Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b29/b29e3d45d1501e94c79e813871acba7c.jpg","description":"Tomb Raider I-III Remastered Starring Lara Croft.\n\nPlay the Original Three Tomb Raider Adventures: For the first time ever, play the complete experience with all expansions and secret levels on modern platforms in this definitive collection.\n\nIncluded Game Titles\nTomb Raider I + The Unfinished Business Expansion\nTomb Raider II + The Gold Mask Expansion\nTomb Raider III + The Lost Artifact Expansion\n\nSolve Ancient Mysteries: Uncover treasures of the ancient world by solving puzzles and unraveling mysteries lost to the ravages of time.\n\nGlobe-trotting Adventure: Follow Lara Croft around the world and face off against deadly foes and dangerous myths.\n\nLovingly Restored: Experience the classics boasting upgraded graphics, with the option to switch to the original polygon look at any time.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":816420,"name":"Monument Valley 2: Panoramic Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13b/13b8fc69fe2eb1808dae6ed4044c872e.jpg","description":"Perception meets  reality in Monument Valley 2, the atmospheric return of the acclaimed smash hit Monument Valley. Explore, Grow and Guide Ro and her Child through a magical and moving world.\nDiscover illusionary pathways and delightful puzzles as you learn the secrets of The Sacred Geometry.\nIn this meditative and calming puzzle game, follow the heart warming story of Ro in her journey through motherhood. Rediscover independence through manipulating monuments and evolving paths to explore new, surreal, and mysterious worlds.\nThe Award Winning Series ReturnsWelcome back to the world of magical and mysterious monuments  in Monument Valley 2, the award-winning sequel to the critically acclaimed Monument Valley.\nFeaturing brand-new environments and puzzles to explore, Monument Valley 2 is a surreal and beautiful experience, with an mistakably unique art style inspired by optical illusions that will keep players feeling in awe.\nAs you make your way through Ro and her child’s adventure, there will always be exciting and mysterious mechanics to unlock, and new friends to meet along the way.\nBeautifully UniqueA critically acclaimed sequel to Monument Valley, Monument Valley 2 returns you to the world of magical and mysterious architecture in a completely stand-alone adventure. You don’t need to have played the original Monument Valley to be able to enjoy this experience. The game features brand new worlds and unique puzzles to explore.Simple For AllClick and drag to reshape the world and help Ro and her Child explore breathtaking yet impossible areas. Designed to be easy for everyone to pick up, enjoy and complete. Monument Valley 2: Panoramic Edition is the biggest and best way to play Monument Valley 2 yet.  A New Way to PlayWith an entirely new control scheme reimagined for PC, you can interact with the universe of Monument Valley in a unique and tactile way. Combined with an all-new panoramic way to play the game designed for Full HD and ultrawide displays, Monument Valley 2 is more awe-inspiring and beautiful than ever before. Every Puzzle IncludedMonument Valley 2: Panoramic Edition is the total collection of all Monument Valley 2 content - with every chapter added to make this the ultimate game to add to your collection. Taking influence from minimalist 3D design, optical illusions and  ancient architecture from around the world, every monument is a unique, hand-crafted world to explore.  Two Is Better Than One Monument Valley: Panoramic Edition and Monument Valley 2: Panoramic Edition are both available at an exclusive bundle price when purchased together on Steam. The Panoramic Collection  is the best way to play the Monument Valley series.\nustwo games are proud independent developers, best known for the award-winning Monument Valley series, Land’s End, Assemble with Care and Alba: A Wildlife Adventure.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"ustwo games","platforms":[{"id":0,"name":"PC"}]},{"id":586045,"name":"Beasts of Maravilla Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a9e/a9e320d8d172f420c9eb19038bfa2010.jpg","description":"Beasts of Maravilla Island is a 3D adventure game where you take on the role of a young wildlife photographer who traverses Maravilla Island's magical ecosystems to discover extraordinary creatures, learn their behaviors, and, most importantly, photograph their majesty!\nThe protective magic of Maravilla Island is waning, and the only way to save it is to restore humanity's belief in the magical. Assume the role of Marina Montez, an aspiring wildlife photographer who is armed with her grandfather's journal of Maravilla and his camera. To save Maravilla Island, you must climb, explore, and solve puzzles with the island's flora and fauna to find and photograph its fabulous beasts.\nYou'll also need to coax out their unique behaviors! Play with a rambunctious otter-crocodile. Be the wingman for a lovestruck bird-monkey. Discover the favorite hiding spots of birds disguised as bananas. Beasts of Maravilla Island is filled with enchanting opportunities to engage with creatures in unique, wholesome ways!\nCapture your magic moments with majestic animals, and share Maravilla Island's magic with the world!\n\nFeatures:\n50+ Unique Creatures, big and small, to engage with and photograph\nExploration of 3 distinct ecological zones, each containing their own unique species!\nEndless possibilities to photograph the game’s beautiful ecosystem.\nPuzzles that emphasize interacting and cooperating with creatures and plant life","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Banana Bird Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":563317,"name":"Incremental Epic Hero","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/230/230c96befa6ea61117c5a2987a82a2df.jpg","description":"Japanese Anime Incremental Idle RPG!\nWe reached one million plays on Kongregate and now release on Steam!FeaturesVarious Upgrades:\nGenerate three different resources more efficiently!\nAttractive Skills:\nThe three cute characters have various attractive skills! Spend resources on them to be more strong! You can put any skill in the skill slot and build your own skill set!\nVast Explorable Areas:\nJourney through the world and encounter all kinds of monsters that will do all that they can to end you quickly. Overcome the obstacles and you will unlock new areas to explore!\nCrafting:\nKill monsters, collect materials and make a lot of equipment! You can also create various potions with alchemy!\nRebirth:\nYou can rebirth into a new class! Rebirth is a prestige mechanic that provides you access to powerful upgrades that will increase your overall power and how quickly you are able to progress through the game!\nBoss Battle:\nPowerful monsters stand in your way. You have to develop a plan to defeat them with your skills and equipment!\nThere are many more Incremental elements in the game. As the game progresses, more and more contents will be unlocked!ControlsMouse click to play!\nUpgrades unlock as you progress. Make sure to read the tool-tips for more info or refer to the in-game help found in the System menu.Hotkey- \"Shift-L” to enable/disable Loot Logs\n- “Shift-P” to turn on/off Performance Mode\n- “Shift-T” to enable/disable all Tool-tips\n- “Shift-B” to enable/disable all attack animations in the battle field\nWe are Japanese game developer team Hapiwaku Project!\nHapiwaku means \"Happy and Excited\" in Japanese.\nWe hope you are so happy and excited through playing IEH!\nWe are very small team. The developers are only 2 university students.\nMost of the art work in the game are drawn by my 13-year-old daughter.\nWe write the stories behind the development on our website :)\n- Discord Community\n- Wiki\n- Patch Note\n- Website","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Happy Wakuwaku Project","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":99733,"name":"YORG.io","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a82/a82887a1955f279605bcfbfc7521afea.jpg","description":"About YORG.ioYORG.io is a fun game about supply chains and zombies. Your goal is to survive as long as possible and endure as many enemy waves as you can.How to Play YORG.ioThe game is divided into day and night. During the day you will be safe, so use this time wisely to prepare and fortify your base.\nStart by building your base and placing crystal mines which are your main source of income. If your mines are not connected to your base, place a transporter. To defend your base and survive the night, you will need defensive towers; since those require ammunition, you will have to build factories to produce them; these factories require resources, you will have to build mines to extract them. Did we mention the importance of supply lines?\nAt night, zombies will spawn and attack your buildings. Every day the zombies steadily get stronger, and every 10 waves a zombie boss will spawn. The game is lost when your Base is destroyed.Highly ReplayableEach game starts with a new configuration of available resources. This configuration must be carefully considered when placing your base and will change your strategy from game to game.Unique towersEach tower has strengths and weaknesses. Place them carefully to make sure you are using them to their full potential and always make sure they have plenty of ammo.Enemy AbilitiesAs the day turn into night the waves of Zombies become harder. Zombies will evolve various abilities that will challenge even the most titanic defenses.Big BossThe Dread Overlord shows up every 10 waves. This boss will require all your might to defeat it. Do not underestimate it!\nThere is no limit to the game, so the longer you stay alive the higher your name goes in the leaderboard. Now go ahead and show your friends who is the ultimate defender!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Tobias Springer","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":61944,"name":"关于我被小学女生绑架这件事","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17b/17b7811909a830c8ba949ce3774854bf.jpg","description":"梧桐主催，全新力作http://store.steampowered.com/app/871570\nAbout the Game本作是一部免费短篇文字AVG，是由同人社团倾情制作的作品。游戏特点精美的CG与立绘\n动听的音乐\n双结局\n轻松治愈的故事剧情简介为了帮助教导主任整理材料，即使是暑假也依然在校园里义务工作。\n感受不到空调的清凉，连校园里的萝莉都看不到。\n——原本，应该是这样糟糕但又平淡的日常才对。\n曾经在记忆力烙下的遗憾，曾经痴迷的背影。\n我以为那些都已经是被尘封的既定事项。\n回忆就是回忆，再也不会有浮上水面的那一天。\n是的，如果没有在那个教室遇到那个女孩子，我应该还会继续这样的生命轨迹直到死亡。角色介绍我\n“新人教师，是一名非常有潜力的可造之材。”\n——教导处的某本员工资料上这么写道。\n\n小可\n正体不明的谜之萝莉，迈着轻快地步伐在无人的暑期校园内徘徊。\n特征便是萝莉，简而言之就是萝莉。\n虽然竭力让自己与他人并无二致，但是作为人类却要去模仿人类这一点已经十分异常。\n远观只是普通的幼女，面对面交流能发现其言行的奇妙落差感，仿佛有了缺口的齿轮般运转不和谐。\n无论怎么看，都是与散发着危险气息的男主截然不同的存在，可以说是人类美好以及安心的代表。","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"ZiX Solutions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":54097,"name":"Teenage Mutant Ninja Turtles: Tournament Fighters","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bee/bee5e50dfa4d68102df34d1546728f75.jpg","description":"Teenage Mutant Ninja Turtles: Tournament Fighters, or Teenage Mutant Hero Turtles: Tournament Fighters in Europe, is the title of three different fighting games based on the characters the Teenage Mutant Ninja Turtles, produced by Konami for the Nintendo Entertainment System, Mega Drive/Genesis, and Super NES and released during a period between 1993 and 1994. Konami produced a different fighting game based on the franchise for each platform, featuring a differing cast of characters.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"SNES"},{"id":0,"name":"Genesis"}]},{"id":36331,"name":"Chrome: SpecForce","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b5f/b5f46030517737e0d2f62235df5b4801.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Techland","platforms":[{"id":0,"name":"PC"}]},{"id":23759,"name":"Fire Emblem Fates: Conquest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/788/788829fed3814fb7f6a4dff975d70b27.jpg","description":"Two kingdoms are on the brink of war. Whose side will you choose? Torn \n      between two families, you're an heir of Hoshido, raised by Nohrian \n      royals. If you walk the path of Conquest, you must fight to change your \n      misguided kingdom from within.\n    \n      You may also choose the path of Birthright, in which you'll battle the \n      corrupted king of Nohr beside a family of strangers. Learn about Fire \n      Emblem Fates: Birthright.\n    \n      Command warriors with expert precision and forge deep relationships to \n      master this turn-based strategy game. For the first time ever, your \n      customized avatar is the main hero. An army of knights, mages, archers \n      and more are at your command in the most tactical battles in series \n      history Each unit and weapon has strengths and weaknesses you must \n      consider for every foe you face. Partner allies on the battlefield so \n      they can support each other in combat. Building relationships is key—the \n      closer your allies become, the better they'll fight together. Their \n      future is at your command, but first you must make the most important \n      decision in the history of Fire Emblem.\n    \n\n        For the first time in the Fire Emblem™ series, your customized avatar \n        is the main character.\n      \n\n        Epic storyline centered on your avatar, forced to choose between \n        bloodline and family who raised you.\n      \n\n        New \"My Castle\" area to interact with your allies and build stronger \n        relationships\n      \n\n        Have StreetPass™ encounters with other players to visit their My Castle\n      \n\n        Tap in corresponding Fire Emblem amiibo™ figures and Marth, Ike, \n        Lucina, and Robin will appear in your game, ready for you to battle \n        and recruit\n      \n\n      Once you choose your path between Fire Emblem Fates: Birthright \n      and Fire Emblem Fates: Conquest, you will enter a complete \n      gameplay experience with different sets of characters to battle against \n      and ally with. When you want to explore the other path (which is also a \n      complete gameplay experience), you can purchase it at a discounted price \n      in-game, adding an alternate take to the events that transpired between \n      the kingdoms of Nohr and Hoshido.\n    \n      Please make sure not to purchase both Birthright and Conquest at full \n      price on Nintendo eShop. To purchase the second path at a discounted \n      price, please select the Explore Fates option that appears at the \n      beginning of Chapter Six, or purchase a download code at retail to \n      redeem within the in-game shop Dragon's Gate.\n    \n      * The third path—Fire Emblem Fates: Revelation—will bring a \n      conclusion to the saga. In order to play Fire Emblem Fates: Revelation, \n      you must own either the Fire Emblem Fates: Birthright or the Fire \n      Emblem Fates: Conquest game. At the beginning of Chapter Six, you \n      can access the in-game shop Dragon's Gate or select the Explore Fates \n      option to purchase it. Download codes for Fire Emblem Fates: \n      Revelation will also be available at participating retailers.\n    \n      \"Fire Emblem Fates will fuel your inner fire\" - \n      Desctructoid (9.5/10)\n    \n      \"It’s an emotional and engaging journey…\" - \n      IGN (9.5/10)\n    \n      \"…a captivating story within each game\" - \n      Polygon\n    \n      9.25/10 - Game Informer","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":23756,"name":"Xenoblade Chronicles X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db8/db83a83c7fc09dca7d5357ed28d167dd.jpg","description":"The next massive sci-fi role-playing game from Monolith Soft, the\ncreators of Baten Kaitos and Xenoblade Chronicles, comes exclusively to\nWii U. A terrible intergalactic war leaves just a handful of Earth\nsurvivors trying to live in a beautiful yet hostile environment. Players\nengage in battles against powerful creatures of all forms and sizes\nusing the deep battle system that builds on the triumphs of Xenoblade\nChronicles for Wii.\n\nFEATURES:\n\nRiding and controlling a weaponized mech, players can explore every\ninch of the massive open world displayed in gorgeous high-definition\ngraphics. The world is filled with strange and imaginative creatures,\nfrom small bugs to giant dinosaurs.\n\nAs characters improve in different classes, they will learn new combat\nand defensive skills, or Arts. Players can customize the Arts palette\nas their characters learn new Arts. All Arts have a “recast\" time –\nonce cast, the player must wait out a “cooldown\" period before that\nArt can be used again.\n\nPlayers can customize everything about the main character's\nappearance, including gender, shapes, height, skin color, voice and\ntattoos.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"8-4","platforms":[{"id":0,"name":"Wii U"}]},{"id":22776,"name":"Gabriel Knight 2: The Beast Within","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/114/114d3a430d8d5838ceb79e7867651c4b.jpg","description":"The Beast Within is the second installment of the trilogy presenting the dark adventures of Gabriel “Schattenjäger” Knight. This time the protagonist is on the trail of a strange wolf, murderer of a little girl. Gabriel was asked to take care of this evil and suspects that this case is paranormal in nature. Together with his assistant, Grace Nakimura, he discovers the dark truth behind the history of Bavaria.\nThe game employs full motion video technology to its fullest. The actors move through photo-realistic sceneries and every action leads to an FMV sequence. The game is a classic point-and-click adventure where you lead two characters through masterfully designed riddles, tons of life-like detective work and perfectly scripted dialogue. The friendly user interface is a finishing touch making this title a masterpiece you don't want to miss.A fully cinematic adventure game that lets you play both Gabriel Knight and Grace Nakimura\nDiscover the truth about the death of King Ludwig II and uncover the mystery of Wagner’s lost opera\nExplore actual locations in Germany captured in 1000 beautiful, high-res images","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":17330,"name":"Cube Land Arena","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95b/95b78fa7e0b8dac9ecddd334818c4740.jpg","description":"\nA long time ago, the sages and erudites of the people of Enderon made a discovery, they found evidence that their world was dying. Therefore they called the council of Cubia.\nThe council, knowing that his people did not have many choices, decided to appeal to ancient magic in order to open portals to other dimensions, there, they made another great discovery, they identified crystals  that possessed a lot of energy inside and they have brought back to their kingdom.\nAfter a few days the crystals began to send large waves of energy, trees and pastures began to grow where they no longer grew, all started coming back to life. Unfortunately the ancestors portals were also affected by the crystals and terrible monsters began to appear from them, the sages of the council, with their extraordinary abilities, tried to close the portals however, every attempt was followed by failure.\nOne of the brave warriors of their dimension found a way to stop the monsters and eventually close the portals to bring peace to the kingdom of Cubia.\nWaves:Combat many monsters along the waves, each wave is represented by the appearance of a new monster in the match. The waves have different duration in each match, during the day brings less monsters and overnight arise many.Towers:You can select different towers and strategically place them anywhere. Your strategy will depend not only positioning the towers but know what types of towers to be used in different situations. You can also evolve them to make them stronger in order to stop the monsters.Shop: During matches you can use the money from the towers to purchase items in order to enhances them. The items costs the same money of the towers. Each item have an special ability that will affects different types of statues.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Camaquem","platforms":[{"id":0,"name":"PC"}]},{"id":16272,"name":"Supreme Ruler 2020 Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f49/f4957d48a164cb51fd0b46dc5dd331ac.jpg","description":"Supreme Ruler The Great WarBattleGoat Studios is excited to announce that the newest release in the Supreme Ruler series is now available!  Be sure to check out Supreme Ruler The Great War on Steam: http://store.steampowered.com/app/600280/\nSupreme Ruler UltimateBe sure to also check out Supreme Ruler Ultimate on Steam: http://store.steampowered.com/app/314980/\nAbout the GameSupreme Ruler 2020 Gold contains Supreme Ruler 2020 and the expansion, Global Crisis:\nSUPREME RULER 2020\t\t\t\t\tOvernight, the US dollar crashes AND the sound echoes across the globe.  The economic crisis amplifies global instabilities and regional disputes, tearing the world asunder.  Nations dissolve, economies collapse, and tensions escalate.  Anarchy reigns supreme.  The world needs a leader.  At last, your time has come.\nKey features:\nSophisticated strategic & tactical military command system\nSelect from hundreds of actual military vehicles\nDetailed diplomatic, economic, and political models\nPlay as any of over 250 territories, worldwide\nSingle & Multiplayer modes\nExtensive modability\nHigh-Res NASA satellite imagery\nSuper sandbox mode offers unlimited customization & replay value\nSUPREME RULER 2020 GLOBAL CRISIS\t\t\t\t\tAt the core of the expansion pack a whole new sandbox style campaign paints a new and far more intricate portrayal of the world of 2020 based on many of the ominous events from recent real-world headlines. The possibilities to change the underlying storyline for new play experiences are limitless.\nKey Features:\n20 new scenarios which more than doubles the number of scenarios\nAdditional new multiplayer scenarios\nNew campaign/sandbox map along a new storyline leading players towards WWIII\nNew scenario features including scripted & random events\nImproved unit control & grouping\nExpanded tech tree\nNew units & new meshes\nAdditional game lobby options\nMore tutorials and in-game tips\nGraphic improvements\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"BattleGoat Studios","platforms":[{"id":0,"name":"PC"}]},{"id":15831,"name":"Campaign Clicker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fee/feee791c5f4b63f051aa4ade60790cb2.jpg","description":"Trump Vs Clinton! It's the political battle of the century! Take on the role of a campaign manager working for the party of your choice.\n• Intense clicking action as you try to win over the majority of the American voters!\n• Stay up to date with the real-life action, as the candidates use real quotes, including quotes from the latest political debates.\n• Cast your vote! See how you can impact the world, as your clicks contribute to a global leaderboard. Check in at any time and see which party has the most enthusiastic supporters.\nBlur the lines between real political debate and the awesomeness of a videogame! Level up your campaign profile, discover secret characters and don't stop collecting votes!\nThe future is in your fingers!\nTHIS GAME CONTAINS IN APP PURCHASES, (these range from $0.49 for endless boosts, to $9.99 for an eagle that plays heavy metal music) The game is fully playable without spending any money. (AT the end of each day you are rewarded with multipliers to mack your next campaign quicker)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Springloaded","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":15455,"name":"Urizen Shadows of the Cold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b9/5b961dc20d91d849765c63321f0c726e.jpg","description":"KEYBOARD AND GAMEPAD COMPATIBLEA free copy was given earlier to those reviewers at ORLYGIFT,  this FREE version featured no keyboard compatibility, this is NO LONGER TRUE.  Urizen Shadows of the Cold is readily Keyboard and Gamepad enabled.\nDigital Deluxe EditionCOMING SOON AS FREE HUGE BONUS UPDATE FOURTH QUARTER 2017,  buy now for $1.99 and avoid paying full price when the Deluxe Frosty Edition Update arrives.\nSteam Achievements will be Introduced with the Deluxe Frosty ReleaseSorry for the confusion, but Steam achievements have already been implemented but will only show up on the Deluxe version which will be released fourth quarter 2017.  Thank you.\nThe Deluxe Frosty Edition will IncludeDeluxe Frosty Update will Definitely Include\n- +30 Steam Achievements\n- revamped bosses\n- 10 New Readily Playable and Hidden Warriors-\n- an interactive training stage\n- 2 player co-op mode\n- 3 different difficultry modes\n- expanded save menu\n- fullscreen/window option\n- the ability to manually enable 2 or 1 gamepads and/or 1 keyboard\n- an enemy and hero museum showcasing all the warriors and baddies with deatiled descriptions and storyline\n- the Urizen \"Bazzar\" store enabling the purchase of new warriors, powerups, and elixirs\n- the \"Witches Hut\" enabling the selling and trading of items for cash or items like potions.\n- a \"block\" button will be implemented\n- the removal of floating coins\n- coin bags and treasure chests among will replace those floating coins\n- stage design will be updated\n- the ability to speak to natives and towns people will be made providing with unique hints, and secrets\n- 12 totally new stages\n- new bosses\n- new complete ending\n- more hidden secrets and or easter eggs\n- expanded cutscenes\n- new \"Frosty\" themed menu layouts\n- enemies killed will leave behind items that can be collected, traded or sold, at the \"Witches Hut\".\n- Revamped SFX selection\n- Soundtrack DLC will be available for $1.99\n- thorough bug and glitch removal has been made\n- revamped more sophisticated enemies and updated warriors\nNOTE* I have mentioned a vs battle mode and a create a warrior, this may or may not appear 'till the end of the year, in another update.\nAbout the GameKEYBOARD AND JOYSTICK COMPATIBLE.  Huge free BONUS update to DELUXE Frosty Edition is set for fourth quarter 2017, price will revert to $3.99.  Purchase now for lower price.\nStretch across lands of unforeseeable cold, and trouble in Urizen Shadows of the Cold, soon to update to Urizen Shadows of the Cold Deluxe Frosty Edition.\n- Currently a massive 50 warrior \"head bopping\",  sword slashing platformer with characters raging from beasts, ogres, ninjas, knights, aliens, sorcerers, mermaids and demons.\n- includes 34+ massive stages, complete with bosses\n- retro styled pixel graphics\n- cool cheat menu\n- head bop combo system\n- implemented save feature\n- enabled music test menu\n- music from music composer Efe Tozan \"Falanca\"\n- simple yet crazy and intense retro, pixel graphic styled game play paying tribute to that old plumber and that ninja with the dragon tooth sword, and a unique set of\nweapons/projectiles for each warrior enabling close counter melee attacks\n- also featuring some cool cut scenes and a unique but weird story line\n- also handles many secrets, hidden warriors and hidden gems\nDeluxe Frosty Update will Definitely Include\n- +30 Steam Achievements\n- revamped bosses\n- 10 New Readily Playable and Hidden Warriors\n- an interactive training stage\n- 3 different difficulty modes\n- expanded save menu\n- full-screen/window option\n- the ability to manually enable 2 or 1 gamepad(s) and/or 1 keyboard\n- an enemy and hero museum showcasing all the warriors and baddies with detailed descriptions and story-line\n- the Urizen \"Bazaar\" store enabling the purchase of new warriors, power-ups, and elixirs\n- the \"Witches Hut\" enabling the selling and trading of items for cash or items like potions.\n- a \"block\" button will be implemented\n- the removal of floating coins\n- coin bags and treasure chests among will replace those floating coins\n- stage design will be updated\n- the ability to speak to natives and towns people will be made providing with unique hints, and secrets\n- 12 totally new stages\n- new bosses\n- new complete ending\n- more hidden secrets and or easter eggs\n- expanded cut-scenes\n- new \"Frosty\" themed menu layouts\n- enemies killed will leave behind items that can be collected, traded or sold, at the \"Witches Hut\".\n- Revamped SFX selection\n- Soundtrack DLC pack will be available for $1.99\n- thorough bug and glitch removal has been made\n- revamped more sophisticated enemies and updated warriors\nNOTE* I have mentioned a vs battle mode and a create a warrior, this may or may not appear 'till the end of the year, in another update.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bloodshadow Games","platforms":[{"id":0,"name":"PC"}]}]