[{"id":28313,"name":"Magic: The Gathering","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b5/4b57ce9117952922bb011ff65b79bfa7.jpg","description":"Magic: The Gathering is a video game published by MicroProse in April 1997 based on the collectible card game Magic: The Gathering. It is often referred to as Shandalar after the plane of Shandalar, where the game takes place. The player must travel the land and fight random enemies to gain cards, and defeat five wizards representing the five colors. The player must prevent one color from gaining too much power, and defeat the planeswalker Arzakon, who has a deck of all five colors. Adventure game and role-playing game elements are present, including inventory, gold, towns, dungeons, random battles, and character progression in the form of new abilities and a higher life point total.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"}]},{"id":21587,"name":"Dungeons: The Eye of Draconus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdf/fdf88efe05acc680843d73e68b166685.jpg","description":"Dungeons the Eye of Draconus is a early 90’s arcade style, one to three player, comedy, retro brawler, with both local and online multiplayer support, complete with mounts; multiple attacks, and varied gameplay, all reminiscent of Battle Toads, Golden Axe and TMNT Arcade.\nWith a variety of enemies filling every stage, boredom is kept at bay as you and your friends battle through a bizarre fantasy world. A hilarious story, complete with cut scenes and fully voiced dialogue sequences.\nJoin Gleobryn the cleric, Rose the thief and Bolax the barbarian as they journey through ancient mountains, fight primitive Kobolds, raid an orkish fraternity and deal with all kinds of crazy characters in, \"Dungeons the Eye of Draconus\".\nKey Features:\n•1-3 player online / local co-op\n•Hand Painted Backgrounds\n•Fluid Sprite Animation\n•Fire Breathing Chicken\n•Configurable keyboard and 360 controller support\n•Un-lockable Steam Achievements, Cards and Badges","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SuckerFreeGames","platforms":[{"id":0,"name":"PC"}]},{"id":21564,"name":"Pilot Brothers 3: Back Side of the Earth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/832/832b58e7cd0948ace8030a0272aab04c.jpg","description":"Back Side of the Earth: Pilot Brothers 3\nBerdichev, Spring 1958. Sensible Brother Chief and his not-so-bright assistant, Brother Colleague saw a report in papers that in Tasmania number of rare animals was greatly reduced. They decided to go there and do investigation. The main suspect is Carbofos! Help Chief and Colleague to save poor elephants!\n14 Increasingly difficult levels to solve\n2 Different characters: Brother Chief and Brother Colleague\nFast-paced, arcade mini-games and loads of absurdly witty mini-games!\nJoin the famed duo in their search for the missed animals!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"1C Wireless","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":21271,"name":"AVSEQ","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c85/c85e8d2b7e491328ba9fdb0b825ab156.jpg","description":"AVSEQ is an audio-visual sequencer puzzle game. Connect falling atoms to unlock near-endless varieties of music at each stage. Every level of AVSEQ is a music sequencer with 2.2300745198530623×10^43 possible audio permutations, that's 22 tredecillion in total!\nNo, we're not making those numbers up. We actually did the math. This is a generative music game designed by procedural systems wizard Tom Betts, and it provides a colorful, beautiful challenge to even the most hardcore of puzzle-game experts.\nKey Features\nInfinite freeplay mode\nGenerative unlockable music\nTwenty-two tredecillion audio permutations","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Big Robot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18585,"name":"ABE VR","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/599/599debe47314029bbe498d4c02df4e3f.jpg","description":"ABE VR is an intense experience that recreates the horrifying story about a misguided robot seeking the unconditional love of humans…at whatever cost.\nCreated in Unreal Engine, and continuing our filmmaking in virtual reality, ABE VR is based on ABE the multi-award winning short film, and planned feature film, written and directed by Rob McLellan.\nNo longer do you have to just watch the film, you now get to experience it as a character. Specifically, ABE’s chosen victim.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hammerhead VR","platforms":[{"id":0,"name":"PC"}]},{"id":17914,"name":"Point Perfect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07c/07c18ee37437d75667145cb4f6acf4b1.jpg","description":"Testimonial\nYouTube Hype!\"I find myself quite charmed by the game...it has a lot of heart, humor and creativity.\"\n- Northernlion\n\"OK, that's a space ninja! A space ninja wielding the Master Sword! I am not OK with this...\"\n- Markiplier\n\"Weee, you will not kill me! I've been practicing! Doo pee doop pee doo!\"\n- DangerGerbil\nAbout the GameThe planet is being attacked and it will take a bodaciously bad-ass cursor pilot to blast the scum to whence it came! Dodge, dip, duck, click and point your way to glory in the most gnarly retro-arcade death trap that you are likely to ever play! Point Perfect will put that \"I'm a real PC gamer\" attitude to the ultimate test and might make you cry a little in the process. But fear not young pilot, because with great challenge comes even greater glory and nerdy bragging rights! For a select few it will even mean graduating from the prestigious Point Perfect University of Aeronautics. Which of course includes a printable diploma that you can hang on your wall to make Mom proud!Features\nProcedurally generated levels means no game is quite the same!\nOver 20 bosses that can evolve new attacks and patterns for you to adapt.\n24 trophies to unlock as well as a secret game mode.\nGet trolled! Point Perfect will test you to the limit and make fun of you if you fail!\nSteam achievements\nTrading cards","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Highcastle Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17758,"name":"Gardens Inc. – From Rakes to Riches","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9c5/9c572f95cad24c9135fa9cdc518b0f8a.jpg","description":"Jill’s grandparents are deep in debt and the dastardly Cliff Gold is eager to foreclose on their home. Her only chance to raise the money they need to pay him off is to win the gardening contest. Cliff Gold will do everything he can to stop Jill from winning the contest, even if he has to participate himself. Without help your Jill won’t stand a chance. Will you be the one to help her and save her home from Gold's evil clutches?\nManage your time and resources effectively in this time-management gardening adventure! With both limited time and resources, you must work quickly and efficiently to get the highest possible score. Gardens Inc. might start off simple, but get ready for a challenge the further you plow through all 50 levels! Keep collecting and managing valuable resources that are used to complete goals on each level. Do it well, and Jill can raise the money to help pay off her Grandparents debt!\n50 dynamic & varying time management levels\nCreate beautiful gardens to your liking or try to guess the taste of your customers\nCountless achievements\nHigh replayability","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"World-Loom","platforms":[{"id":0,"name":"PC"}]},{"id":16981,"name":"QP Shooting - Dangerous!!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/509/509eb9336672b5dce6eadb37d2da9051.jpg","description":"Special Offer\nAll owners of QP Shooting – Dangerous!! will unlock a free bonus character in 100% Orange Juice on Steam.\nAbout the GameQP Shooting - Dangerous!! is a bullet hell type shoot’em’up starring the pudding-loving dog girl QP seen in 100% Orange Juice. Nothing can stand between QP and her pudding - not even difficulty options to reduce the experienced gamer to tears!\nA mysterious nemesis has taken pudding away from the world. Can a lone heroine with a sweet tooth stop their nefarious plans?\nIt's time to get back your pudding... again!Features:5 Stages - meet old friends and new enemies as you progress through five wildly different stages to solve the mystery of the missing pudding.\n4 Difficulty levels - something for every player, from merely challenging to tear-jerking.\n3 Play Styles - play with Orthodox, Defensive or Aggressive style, affecting the behavior of your Hyper Mode.\n28 Formations to Unlock - earn points to unlock new attack formations for QP. You can load up to 3 different Rbit formations onto the field, and switch them on the fly.\nArcade and Conquest Mode  - Conquest Mode saves your progress and allows you to progress a stage at a time, striving to do ever better.\nReplays - Save replays of your best victories and most miserable failures to study or share.\nPudding(?)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Orange_Juice","platforms":[{"id":0,"name":"PC"}]},{"id":16691,"name":"Sky Break","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/707/7077d55b75b9a5e8e5c401b5f5f645f7.jpg","description":"Humanity is threatened. A deadly virus is rapidly spreading.\nThe particular flora of Arcania, a planet once used by humans for space colonization, may help in the creation of a cure. But the planet has been abandoned ever since working drones turned against humans.\nA group of researchers has been sent to this planet to find a solution. You are one of them.\nBut as you arrived, your spaceship crashed…\nHack and command mechasMechas are wild and are used to living in the storm. You must fight some of them for your survival, but they are often stronger than you are.\nYour best chance of survival is to hack some of those mechas and use them as allies to defeat the others.EvolveThe more combats you win, the more fragments you earn. They can be used to evolve your mechas' strength and skills. But you can also find some during exploration.\nYour character can also improve its capabilities.The StormThe weather is a major threat. You must deal with lightning strikes, tornadoes, and other elements in order to make your way through the storm. You will be able to activate old installations used to ionize the air and stop the storm within an area. Thankfully an old abandoned station that sits above the clouds provides good shelter.The SpaceshipYou have access to your spaceship early in the game, but you do not have enough fuel to leave the planet.\nIt is impossible to land in the storm, but once you have unlocked some weather controllers, you will be able to quickly travel across the map and save a lot of time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Farsky Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15846,"name":"The Lords of the Earth Flame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b26/b266ff6904fb407631bd53173c929826.jpg","description":"The Lords of The Earth Flame is a novel game created in the best traditions of interactive fiction and text-based role-playing. Non-linear structure, rich text core, and the “analog” feel of times past are certain to provide unforgettable gaming experience for hours on end.\nThis attempt to revisit the unduly forgotten genre is a curious challenge and possibly the first step toward a full-scale rebirth of non-linear text-based quests. In the developers' enthusiastic view, modern graphics technology and friendly interface may help interactive fiction spring to a new life and find a well-deserved niche of its own on the modern gaming market.\nPlot\nThe game's events take place in a fantasy universe closely resembling the Late Middle Ages. Take up the role of a guide to a trade caravan that—by a twist of fate—finds itself in a mountain cave. Your efforts to get out lead you to mysterious ruins, entering which may result in losing more than just your life…\nGame features:\n- atmospheric parchment-scroll interface;\n- intricate non-linear plot;\n- mood-setting soundtrack;\n- replay value;\n- more than 5 different endings.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rhino Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15559,"name":"Black Sand Drift","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/808/8084d12b33ae69a95c43b4abae8d46a5.jpg","description":"For over 300 years, the five planets of the Kotiro galaxy and its citizens have struggled under the heavy hand of maniacal, mechanical bots called Spiral. As the metallic army's relentless pursuit of the resource Black Sand begins ramping up exponentially, a few brave heroes decide to fight back.\nEnter Black Sand Drift: A wholly unique shooter built from the ground up with the PC in mind. So what makes this SHMUP stand out from the crowd? Well, to begin with, there is a heavy emphasis on characters and story; and through the 25 levels spanning 5 different locals, the dialog driven narrative will play out with lots of interesting and strange revelations culminating in a spectacularly whimsical finale.\nCreated with the keyboard in mind, using the WASD in combination with the SPACEBAR feels tight and responsive; a must for any game challenging you with leaderboards. And because there are 25 separate local and online boards to tackle, you will appreciate the smooth controls. The ARROW keys and CONTROLLER support are also available as alternatives!\nThe music consists of 25 tracks—1 for each level—featuring guitars, bass, drums and vocals; a rarity for such games of the same creed. Every aspect of Black Sand Drift has been intentionally tweaked to present you with something wholly unique from anything you've played before.\nBetween the music, controls, graphics, breadth of story and overall experience, I hope you find something here that truly inspires and evokes the emotions we all crave as dedicated gamers. Thank you for checking out Black Sand Drift!\nThe Tilda’s default weapon's system fires an automatic stream of bullets, giving the player a means to fight the deadly Spiral forces. However, this is not the only weapon at your disposal; there are also 15 powerful Special Weapons spread out among the 25 levels.\nCharacters:\nExtras:\nFor every level you beat (without cheating), you will unlock a special image accessible from the main menu; everything from concept art to alternate versions of characters and more, all straight from the pages of our sketchbooks.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Echo Hall Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14893,"name":"Story Of the Survivor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f53/f53c4079756063b33a298e03832f0d9d.jpg","description":"What will you do when world collapse? Follow the story of Thomas, one of last humans on earth as he try to survive in zombie infested the world. Use robust crafting system to create whatever you may need on your journey. But don't forget zombies aren't the only thing you should watch out for.\nCRAFTING SYSTEM. COOKING SYSTEM. 38 playable WEAPONS. 3 playable CHARACTERS\nIf you're a fan of The Walking Dead or other zombie-related media, then this is the game for you!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kamil Szczepanik","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11183,"name":"Devilian","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/674/674f8e96c2a8d90cbe5e78ae88995f40.jpg","description":"Just UpdatedBeware the Terror of Totames\nWhether you prefer the path of the Morbid or Capricious, the lands of Nala now offer you even more excitement - Devilians will earn their chosen item set only through great effort and risk!New Dungeon: Dimensional Fortress - NIGHTMARE!New RAID - Forbidden Sanctuary - TOTAMES!\nLearn more about this update here!\nAbout the GamePlay as a half-devil hero fighting to save your world from a fallen god and join thousands of others in a vast free-to-play Massively Multiplayer Online Action RPG. Spread your wings, sharpen your steel, and unleash the devil within!\nJoin the fray as a Berserker, Evoker, Cannoneer, or Shadowhunter Each Class possesses a unique Devil Form you can level up – and unleash – to wreak havoc on your foes.\nCustomize your character with advanced Skill Paths, collectible Talismans, weapons, armor, and other implements of dark intent.Fast, visceral PvP of an Action RPG combined with Massively Multiplayer ScaleDispatch your fellow players in 20-vs-20 battlegrounds.\nGet intimate in 3-vs-3 affairs.\nReap the rewards of wars fought between entire guilds.Come for the Action, Stay for the Action ....and the PvP, Crafting, Quests, Trading, Cities, Mounts, Pets, Guilds, Guild Alliances, Wars, and Dungeons that make Devilian a fully-featured MMO – albeit one with a fresh perspective and devilish twist.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bluehole Ginno Games","platforms":[{"id":0,"name":"PC"}]},{"id":10109,"name":"Shadows 2: Perfidia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b16/b16386e9d1262751b5e30053e9e8e09b.jpg","description":"Shadows 2: Perfidia is a survival horror game inspired by classics like the Penumbra series and Layers of Fear.\nExplore a darkened office complex and uncover the truth behind the horrifying events that have befallen its inhabitants.\nPlay as one of two characters with unique storylines, monster encounters, and gameplay challenges.\nNavigate a multi-story maze that grows scarier, harder, and more twisted as you struggle to escape the madness.\nTwo characters to play with, each in a different location\nOver 18 levels with unique scares & puzzles\nRealistic sound effects\nCreepy atmosphere\nNew gameplay mechanics\nRandomized encounters, item locations etc. on each level\nShadows 2 combines elements from your favorite indie horror titles and drives them to a new level of terror.\n\nConfront over three types of monsters, each with distinct behaviors and tactics. Use darkness to your advantage and evade the creatures’ deadly threats.\nSolve diverse, interesting puzzles to access each floor’s elevator and advance the story, a mind-bending tale of betrayal and revenge.\nMaster a unique sanity system that allows you to stave off trauma by guzzling energy drinks or shutting your eyes against the chaos. Witness too many horrors, and feel your mind unravel.\nThe world of Shadows 2 is packed with details, from menacing sound effects to cleverly plotted jump scares and disturbing set pieces.\nAn overwhelming feeling of dread prevails. You’ll never know what’s just around the corner – safety, certain doom, or worse...\nIn addition to the main story, each floor contains secret items that can be collected to unlock behind-the-scenes content and design documents.\nShadows 2 has already left its mark:\n„That was really good” – Markiplier\n„There's something about it that scares the s#%t of out me” – Daz Games\n„I'm f!#king done” – KSI\nAre you brave enough to embrace the Shadows?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"MrCiastku","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":9884,"name":"TASTEE: Lethal Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/813/813276a2212f0bd6420a190121117a3a.jpg","description":"New Update Coming Next Week\nNew Software Update Coming Next Week!\nHi all,\nWe've been a bit quiet on the announcement front of late but are back with some news to share.\nWe'll be releasing a software update next week with a brand new feature: Daily Missions\nWhat are Daily Missions?\nA new single player mission that is generated every day\nThe squad configuration, map, rule set, and enemies are all randomized each day - It'll be a surprise every time!\nYou get one try per day\nPass or fail, you get a score that is registered to the daily leaderboard\nThis is something that we've been tinkering with for a little while and wanted to keep it under wraps until we were ready to unveil it.\nWe've been having a lot of fun with it at our studio and are really excited to finally release it to our player community.\nAbout the Game** Regular community tournaments (with awesome prizes!) are scheduled throughout 2017! **\nThis is TASTEE: we do take out.\nYou are the director, you will coordinate a master plan using every tool at your disposal. Off the books, unsanctioned and highly illegal, you’ll be doing the dirty work the government can’t.\nThey are elite, elusive, and deliciously dangerous. Independents and rogues, these mercs do not play well with others and we’re going to cram them all into your rundown diner: TASTEE. They’re an unruly powder keg waiting for a spark...but fortunately most of these guys like explosions. This is your team.\nYour job is to recruit these hired guns and form the TASTEE team; use them to orchestrate missions to take down the Cartel. Misfits and outcasts, each merc has refined their own personal MO when it comes to death and destruction. Their unique set of skills is exactly what you’ll need to steal guns, interrupt supply lines, save hostages, formulate traps, and execute epic gunfights on your mission to take down The Cowboy - the big boss responsible for a global crime epidemic. Lethal tactics have been authorized… Good luck.\nFEATURE SET\nSingle Player Mission Mode:\n30 Missions across 10 locations.\nRecruit mercs, each with their own unique skillset.\nMission Leaderboards - Replay missions, best your own scores and top others’ to climb the global leaderboards.\nRegular Community Tournaments Scheduled Throughout 2017:\nJoin the TASTEE community and participate in our regular events and tournaments.\nWin TASTEE swag like our t-shirts or concept art prints - or emerge on top and take home the coveted, 3D-printed, TASTEE trophy!\nA Diverse Roster of 12 Mercenaries, Each with Their Own Special Abilities and Weapons:\nEach character has their own particular skill set, their expertise ranging from clever gadgets to lethal combat abilities.4 distinct character classes: Gunmen, Snipers, Shotgunners, Bombers.\nMix and match your mercenaries to create the optimal squad for each situation.\nCoordinate attacks by pairing units with complementary skills and abilities. For example, Linus breaks through walls, attacking from unexpected locations and opening paths for teammates; pair his skills with Bodark's swift disarming shot to take enemies by surprise and leave them vulnerable.\n10 Unique, Randomized Tactical Maps:\nRich, detailed locations highlight dramatic cat-and-mouse armed encounters.\nDestructible environmental objects - Destroy doors and cover objects to alter the playing field.\nRandomized Maps Elements - Destructible object placement is randomized on all maps, creating different pathways and strategy possibilities for each match.\nLearn the maps to formulate strategies - Find ideal sniper locations, quick getaways and lanes to lead your opponent into an ambush.\nCompetitive Online Multiplayer Play:\nELO-ratings based global leaderboards - Defeat other players in the community to move up the rankings and become #1!\nAsynchronous Online Matches - Play Head-to-Head matches asynchronously - submit your turns at your own pace. E-mail notifications inform you when it's your turn and when someone has challenged you to a match.\nCage Matches - Play Head-to-Head matches live - submit your turns before the timer runs out.\nDaily Mission - Single Player Challenge:\nA new single player mission every day!\nThe squad configuration, map, rule set, and enemies are all randomized each day - It'll be a surprise every time!\nYou get one try per day - pass or fail, you get a score that is registered to the daily leaderboard.\nShare your Best Match Replays:\nJust won an incredible match? Share the replay with other Lethal Tactics players!\nPractice Mode:\nPlay full matches versus AI.\nPractice your tactics and test unit combinations.\nSteam Achievements:\nPlay all modes to earn them all!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":6454,"name":"Legends of Callasia","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/470/470084264b342db36cf18165b32b9a2a.jpeg","description":"The Great Callasian War rages across the lands. Choose a faction and awaken the legendary heroes to lead your armies and destroy enemy forces! Build cities, conquer kingdoms, and form or break alliances on tabletop-style maps with bonus cards that can turn the tide of battle. Follow the story of the factions in single-player campaign missions, or test friendships in online multiplayer with an original simultaneous turn-based system that adds deep strategic elements in predicting other players’ moves. Fight your way to the top of the leaderboard, and dominate the fantasy world of Callasia!\nNote: This is a free demo which includes the tutorial, starter campaigns and four heroes for each faction, and three maps for skirmish and multiplayer. The full version can be unlocked through a one-time purchase from within the game or via DLC.Full Version Features:\nThree Factions to choose from: Hundred Kingdoms, Faeborne, and Revenant\nOver 25 Heroes with different classes, traits, and bonus cards\n30 Single-Player Campaign Levels worth almost 40 hours of gameplay\nMore than 40 tabletop-style Skirmish/Multiplayer maps playable up to 8 players\nPay once and play on all platforms: also available on iPad and Android","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Boomzap","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":982711,"name":"Hive Jump 2: Survivors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a4/2a4f0fd1bf193e467021505fae3a2de6.jpg","description":"Hive Jump 2: Survivors is a sci-fi, action-packed, bullet heaven roguelike. After a squad of intrepid jetpack jumpers is decimated in an intergalactic ambush, a lone survivor sets out for vengeance while fending off endless waves of killer insects.\nPlay as different jumpers for unique builds and abilities. Collect amber and alien goo as precious resources to earn upgrades and mow down the hordes however you see fit. Your secret weapon? Jetpacks! Strap in, dodge incoming hordes, and maneuver around obstacles - one gory run at a time!\nKey Features\nAuto and Manual Aiming - Auto-fire at enemies to focus on movement, or take aim to better control the chaos.\nMultiple Jumpers, Multiple Ways to Kill - With multiple options, each Jumper has distinct stats that impact speed, rate of fire, health, and more.\nCustomize Your Jumper - Earn weapons, upgrades, and augments, like automatic enemy targeting and increased health reserves, to create the ultimate soldier.\nJumping Jetpacks - Utilize your jetpack to dodge enemies and traverse the environment in search of Hives.\nHSA Store - Convert your enemies’ guts into currency, exchanging “goo” for weapons, utilities, and relics of varying rarity. Snag precious Amber to boost builds with permanent upgrades.\nPermanent Upgrades - Unlock permanent abilities to give your Jumper an advantage from the start of every run.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Graphite Lab","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":963612,"name":"Cats Hidden in Paris","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6bc/6bcdbc6fea063c4a9521a1fa8dc04f78.jpg","description":"🐾 More Cats 🐾          https://store.steampowered.com/app/2313240/Cats_Hidden_in_Italy/       https://store.steampowered.com/app/2356500/Cats_Hidden_in_Bali/\nAbout the GameCats Hidden in Paris is a very easy and cute hidden object game set in Paris, France.\n100 cats are waiting for you to be discovered within a hand-drawn background.\nRelax thanks to the chill soundtrack\nFound a cat? Click on it!Features🐾 1 Level, 100 cats\n❔ Easter Eggs\n💡 Hint System\n⏰ Timer mode with leaderboard\n⚙️ In-game Settings\nhttps://store.steampowered.com/app/2377970/Cats_Hidden_Around_the_World/","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Travellin Cats","platforms":[{"id":0,"name":"PC"}]},{"id":945034,"name":"Slay the Princess","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3c/f3c853a053de6e9bb52170a7d29a0aa9.jpg","description":"More from Black Tabby Gameshttps://store.steampowered.com/app/1609230?utm_source=STP&utm_campaign=steam&utm_medium=web\nAbout the GameYou're on a path in the woods, and at the end of that path is a cabin. And in the basement of that cabin is a Princess.\nYou're here to slay her. If you don't, it will be the end of the world.\nShe will do everything in her power to stop you. She'll charm, and she'll lie, and she'll promise you the world, and if you let her, she'll kill you a dozen times over. You can't let that happen. Don't forget, the fate of the world rests on your shoulders.\nYou're not going to listen to him, are you? We're supposed to save princesses, not slay them...\nFeatures\nFully voice-acted by the impeccable Jonathan Sims and Nichole Goodnight.\nHand-penciled art - every background and sprite is drawn traditionally with pencil and paper by Ignatz-winning graphic novelist Abby Howard.\nA princess. She's very bad and you have to get rid of her for all our sakes.\nNo, the Princess isn't a cosmic horror. She's just an ordinary human Princess, and you can definitely slay her as long as you put your mind to it.\nDon't even think about trying to romance her. It won't end well for you.\nHopefully you won't die. But if you do, you'll die a lot. Be careful and stay focused on the task at hand!\nTime loops No time loops. Don't be ridiculous. Time is a strictly linear concept and it certainly doesn't \"loop,\" whatever that's supposed to mean.\nA branching narrative where what you say and what you believe determines both who you are and how the story unfolds.\nA new roleplaying experience from the creators of Scarlet Hollow.\nSlay the Princess is a choice-driven psychological horror visual novel/dating sim with dramatic branching, light RPG elements, and hand-penciled art.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Black Tabby Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":830182,"name":"The Mortuary Assistant","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/412/412927cbf20b9e72371dd8e5a1c1bf31.jpg","description":"Having completed your degree in mortuary sciences, you have taken on an apprenticeship at River Fields Mortuary. Over the past several months you have logged many hours aiding the Mortician in daily tasks along with learning the ins and outs of the embalming process as well as how to properly handle and care for the deceased.\nLate one night, you are called into work to handle some embalmings. Death doesn’t keep day time hours. But there is something different about these bodies because there is something different about you. The phone rings with the Mortician on the other end. The rumors are true, and you can not leave.\nPerform embalming tasks while keeping demonic forces at bay\nPractice occult rituals to identify demonic entities\nPiece together clues to banish the demon and save your soul\nUncover the gripping history of Rebeccca Owens, the haunting past of River Fields, and a sinister secret that lies just beneath the surface…\nGround breaking system makes every playthrough unique, guaranteeing you will never feel completely safe.\nA story that unfolds through multiple playthroughs. Each demon you banish is just a piece of the puzzle\n10+ hours of content with more to find for inquisitive eyes\nPerform embalmings, handle the various jobs around the mortuary, and exorcise demonic forces. All in a day’s work.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"DreadXP","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":644661,"name":"AI: THE SOMNIUM FILES - nirvanA Initiative","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/17e/17e0128079e7446d77ec3ca8efb007c8.jpg","description":"Newly-appointed Special Agent Mizuki and her AI partner Aiba are tasked to solve the bizarre Half Body serial killings in this sequel to the critically acclaimed AI: The Somnium Files.\r\n\r\nSix years ago, the right half of a corpse was discovered under mysterious circumstances. The left half was never found...until six years later, when it was discovered completely fresh with no signs of decay, as though the victim was alive until just recently. Now, newly-appointed Special Agent Mizuki and her AI partner Aiba are tasked to solve the bizarre Half Body serial killings...","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":566464,"name":"Astral Ascent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/472/472d8a266a27d0eee5f1c3b76d120e23.jpg","description":"Astral Ascent is a 2D platformer rogue-lite set in a modern fantasy world. As one of 4 Heroes with very different personalities, you must escape from the Garden, an astral prison guarded by 12 powerful and vicious bosses, the Zodiacs.\nFIGHT YOUR WAY\nUnlock dozens of unique spells for your 4 distinct characters. Optimize your own build or try out a new one to take down 12 powerful bosses. Get stronger with time to match up with your foes. Each run will test your skills and your reactivity.\nDON'T GO ALONE\nThe weight of destiny is too heavy to carry by yourself? Don’t worry and bring a friend to play in our two player co-op mode. Fight and crush your enemies together in local co-op or online using the Steam's Remote Play Together feature.\nAN ASTRAL THREAT\nThe Zodiacs are 12 experienced guardians dispatched over 4 gorgeous worlds. They’ll bring to the battlefield unique attacks, abilities, and patterns, backstories to uncover, and reasons to be fighting you. Get yourself warned!\nNARRATION THROUGH REPLAYABILITY\nAstral Ascent is a rogue-lite infused with narration. Replayability is part of our story which will be unravelled piece of piece. As you get stronger, you will discover more about the characters, their motivations, and the secrets of the world they’re trapped in.\nA BEAUTIFUL MODERN FANTASY WORLD\nDash across gigantic landscapes. Explore original and hand-crafted areas. Discover the world created by our artists, with a gorgeous art and frame-by-frame animation.\n4 PLAYABLE CHARACTERS\n\nUnique characters. Unique weapons. Unique ways to play.\nAyla: The sole survivor of her guild of assassins, she uses her twin daggers to eliminate her enemies before they can react. Her speed and proficiency are unmatched.\nKiran: This orphan learned life the hard way. He uses his strength to deliver attacks powerful enough to create shockwaves. Brutal.\nCalie: This talented sculptor wants her freedom back. She will use her magical gemstones to pierce enemy defenses and shred them to bits. She is unforgiving.\nOctave: Trained by a powerful witch, this young fighter summons ethereal guns to attack his foes. When needed, he can conjure bigger weapons as well. Lethal in all cases.\nA COALITION FOR HOPE\nYou can count on faithful allies to help you find your way out\nThe Merchant: This mysterious figure has the power to unveil your true potential through rememoring forgotten skills. Careful… it comes with a price.\nZim-Zim: Her greenhouse hides magical plants which can increase your abilities. If you can stand her whimsical and frankly immature behavior.\nOloon: The best stylist in the known universe is right here and available. Want to change the color of your clothes? Dye your hair? She has everything you need!\nPapa Yalee: This old cat—he is almost 20!—will always have a good story about the foes you’ll encounter and your runs. The good news is that… most of them are true.\nSova: Once a powerful sorceress, Sova was cursed and must now serve the Garden. Her past is a burden of shame she carries in silence.\nOrdan: De facto leader of the Garden, this fierce warrior helps the Heroes in their quest. Her might is legendary.\nIkki: Ordan’s ex-husband and a powerful warrior on his own, he is in charge of training the Heroes. His knowledge of the art of war is endless.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Hibernian Workshop","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":275622,"name":"SinVR","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/304/3047746f7b9806ccd1dc0d9f838c5c26.jpg","description":"Your wildest dreams made real.  Your realest dreams... made wild.  Virtually wild. Virtually Real. This is the essence of the Forbidden World of SinVR.\nENTER the Forbidden World\nSelect your female partner and take her on a magical journey into your deepest fantasies.\nSinful Features:\nA collection of interactive PC experiences unlike any other!\nAI driven behavior\nVR support for HTC Vive and Oculus Rift with Touch\nUse your Vive or Rift controllers to interact with the girls\nOne girl and one scene included free, others available via DLC\nSupports No-VR mode, with only a PC & mouse (no VR headset)\nPurchasable DLC Upgrades:\nDozens of different sex positions\nExplore a growing library of girls and scenes\nOver 300 different girl/scene combinations\nTake any girl into any scene (mix and match)","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"SinVR","platforms":[{"id":0,"name":"PC"}]},{"id":244699,"name":"PHOGS!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/38f/38fb7bb56f3fbb78444a7e7cf9aaeb8d.jpg","description":"PHOGS! takes you and a friend on a double-ended physics dog adventure in a vibrant and colourful world filled with puzzles to solve and strange creatures to help. Cooperate and coordinate as you each use half of a controller to control one end of the dog, stretching and grabbing to grow jumpkins, herd munchlets and feed the hungry world worms. PHOGS! is a game with simple controls and a silly atmosphere that anyone can play with family and friends.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Coatsink","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":63641,"name":"The Flood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c8/7c88598797ad7be0c6644c7de9bbac7a.jpg","description":"The Flood is a peaceful 5 minute narrative experience in which you pilot a little boat down a river. It's a gentle reminder that sometimes we should stop worrying about our destination and just enjoy the journey.\nSteer a boat down a river and avoid obstacles and debris\nExplore beautiful hand crafted sceneries\nEnjoy wonderful soundtrack composed by Jozef SarisskyCOMMENT FROM DEVELOPER:I developed this game alone during a course of 3-4 months. Whole project started when I was experimenting with environment design and it has slowly transformed into this short metaphorcial journey which I decided to share with you. Working on this project was a very interesting and rewarding experience that has taught me a lot and pushed my limits.\nI understand that this game is quite unusual and it may not fit everyone's style but hopefuly there are some of you who will enjoy this journey and find themselves in it.\nEnjoy!\n- Ondrej","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Simple Ghost","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":63189,"name":"Yaga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16e/16e747f0a911f3b68f45ba7ae211d835.jpg","description":"Play as Ivan, a one-handed blacksmith cursed with incredible bad luck.\r\nIvan is caught between a Tzar giving him impossible tasks, a mysterious witch who wants to manipulate him, and his grandma who wants him to find a wife.\r\nStart your journey in an action RPG where the story and characters react to the way you roleplay your character.\r\nBuilding a reputation through roleplaying results in different interactions with villagers and NPCs, unlocking secrets, trading options, or bestowing game-changing curses or blessings upon the player character.\r\nPagan beliefs and superstitions are key to unlocking hidden secrets, getting house spirits on your side, or avoiding the powerful curses of unclean creatures.\r\nFateful Crossroads between levels allow the player to influence the difficulty, challenge and level generation of the game\r\nDiscover and combine lots of talismans and artifacts that change the player's abilities and the gameplay\r\nCraft and upgrade an arsenal of weapons and tools to aid you in your journeys.\r\nUnique Soundtrack featuring underground folklore band Subcarpați.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Breadcrumbs Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":59733,"name":"Revelation Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df8/df85dcd65d28b5c8a9073eedf1194d82.jpg","description":"FREE STEAM WELCOME PACK\nWelcome to Revelation Online! We have a small welcome present for all new players joining us from Steam. This Free Steam Welcome Pack contains a permanent head accessory and a permanent purple title.\nFeatured DLC\nAbout the Game\nRevelation Online is a breathtaking Massive Multiplayer Online Role Playing Game set in the lively, fantasy world of Nuanor. Discover amazing adventures and explore a vibrant world of ancient mystery using the power of character flight without boundaries.\nUnravel a legendary myth, told throughout solo adventures, gripping group expeditions, a great variety of dungeons, and raids. See the story unfold in exciting cut-scenes or fly to fabled places where you will always find something new to undertake and new friends to do it with.\nBand together as you soar through the skies or battle each other in Revelation Online’s competitive play modes. The dynamic combat system delivers a fun PvP combat experience for casual and hardcore players alike. Exciting challenges range from smaller scale arena duels to epic scale territory sieges and cross server warfare. Join intense battles with hundreds of players simultaneously, PvP is boundless in Revelation Online.\nPlease note, Revelation Online is still in Open-Beta and has not officially been released.\nExplore a vibrant world of ancient mystery. Experience absolute freedom of exploration with the power of flight and admire stunning views - cliffs, forests, mountains, and cities.\nSpread your wings or master one of the many aerial mounts to soar through the skies of Nuanor. Dive into the waters or climb to the top of the world – in Revelation Online you can reach any place freely.\nUnravel the legend of a mysterious artefact unfolding in exciting cut-scenes throughout solo adventures, fascinating group quests and a great variety of dungeons. Immerse yourself in a thrilling adventure, full of excitement and betrayal\nFly to fabled places where you will always find new friends to storm a myriad of dungeons located in caves, blighted deserts and realms of eternal shadow. Gather your group of 5, 10 or 20 to overcome obstacles and defeat the bosses within to be awarded glory and unique outfits.\nEven at maximum level, the game has just begun! Hone your tactical skills and gain epic equipment by gathering your allies and taking on towering bosses in multiphase raids with up to 20 players. Prevailing in these challenges will prove your mettle and rank you amongst Nuanor's greatest heroes!\nThe fight for a guild territory in Nuanor can turn into a massive scale conflict. Literally, hundreds of players can take defensive positions on the ramparts or attack forts and bastions shoulder to shoulder with their friends. Fight for the glory and prestige of your guild and wave your banner on your conquered territory.\nOnce you reach the right level and are willing to take the chance, you can participate in open world PvP. Kill offenders, avenge fallen friends or defend a rare spawn together with your allies. Declare personal wars on your own, but be wary of the penalizing system. This is a system of high risks and high rewards.\nTest your battle prowess in more than 6 different PvP maps: from \"classic\" battlegrounds and \"capture the flag\" to a massive cross-server battle and special PvPvE zones with unique gameplay.\nThis is your chance to discover new and exciting opportunities in Revelation Online. Together with players who share a common goal, you can achieve unprecedented heights! Fight shoulder to shoulder with your fellow comrades! Work together and build your guild a home, where you can relax after adventuring.\nMake your character look the way you want with a multitude of hair and appearance choices! Along with accessories and masks, create a style that suits you and set trends that others will follow!\nFrom finding your soulmate to getting embroiled in turf wars, you'll have plenty of occasions to display your intentions, both good and bad. Jump from having a ceremony with your pact mate to provoking battles against your enemies.\nRevelation Online has a unique system of player housing where players (upon reaching level 40) can gain access to their own free apartment, which they can then upgrade and stylize to their liking with a wide range of furniture and accessories. They can invite friends over and even share living space with their pact mate!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NetEase Games","platforms":[{"id":0,"name":"PC"}]},{"id":54074,"name":"Super Contra (1988)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6aa/6aa19ae89ae0ebba0f021515e2daa14b.jpg","description":"Super Contra (スーパー魂斗羅 エイリアンの逆襲, Sūpā Kontora: Eirian no Gyakushū, \"Super Contra: The Alien Strikes Back\") is a run and gun video game by Konami originally released as a coin-operated arcade game in 1988. It was ported to the Nintendo Entertainment System under the shortened title of Super C in North America and in Europe and Australia as Probotector II: Return of the Evil Forces. It is the sequel to the original Contra and part of the Contra series . The game stars Bill Rizer and Lance Bean, as they are sent to thwart another alien invasion. Both the arcade version and the NES version have been re-released in various other platforms since their original releases.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"NES"},{"id":0,"name":"PC"}]},{"id":53357,"name":"Kingdom Hearts: Chain of Memories","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a4/0a45869d5c720cecfd976b76b2fe2fd7.jpg","description":"Sora, Donald and Goofy travel down a long road that meanders through endless fields, and come to a crossroads. As Sora stands in the crossroads, he gazes up at the night sky and thinks of his lost friends. Just then, a mysterious man approaches from down one of the branching paths. \"Ahead lies something you need,\" he says, \"but to claim it, you must lose something dear.\" The man vanishes before a single path, leading to a castle that eerily resembles a girl's drawing... In the coming journey, what will Sora and his companions gain, and what will they lose? In addition to Sora, players can control Riku in this adventure that bridges the gap between Kingdom Hearts and Kingdom Hearts II.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Jupiter","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":50141,"name":"Contraband Police","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff0/ff06a6ec7507a28a735fdd8a38ac8767.jpg","description":"How much contraband, you think can be smuggled in one truck on a third-world country border?\nAs a contraband police inspector, do Your best to find out!\nValidate documentsCheck driver's license, transport checklist and other to find any discordance with the actual state.\nAllow or deny passing the border.\nExamine vehicle for technical faultsBe alert for any deviations from the norm like spilled oil, broken lights or bald tires.\nWrite a ticket suitable for the failures found.\nYou are responsible for allowing faulty cars pass the border.\nDiscover contrabandSearch for smuggled alkohol, drugs, weapons etc. hidden inside car parts or cargo.\nDecide whether to report found contraband or take a bribe and let the smuggler through.\nUpgrade your postGather police respect for your great work or loose for mistakes.\nSpend your points on post upgrades like new inspection tools, barriers, K-9 dog and many more.\nComplete different tasks each day New day can bring some unexpected restrictions for vehicles like max emission of exhaust gases,\ntotal weight or banned cargo.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Crazy Rocks","platforms":[{"id":0,"name":"PC"}]},{"id":46989,"name":"Hollowed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/375/375e1145ee8de04f4f94574b454b0268.jpg","description":"Controller RequiredController is required to play Hollowed. No keyboard and mouse support.\nAbout the GameHollowed tells the story of a woman who will do anything to bring her perished loved one back to the world of the living. The player will control a humanoid character named Halia as well as a spirit named Oco simultaneously on one controller. These two characters are tethered together by a spiritual connection and they must work together to progress through the daunting challenge of bringing Halia's loved one back to the world of the living. While Halia has the ability to jump and move like most platforming character, Oco has the ability to help Halia in her endeavors through four unique abilities. Use these abilities to interact with the environment and Halia in order to progress through platforming puzzles in this 3D side-scrolling adventure.\nThe mechanics allow for a new way of exploring the side-scrolling genre by asking the player to control two characters simultaneously. Halia's controls take up the left side of the controller while Oco's controls take up the right side of the joystick. It is only through the synchronous collaboration between these two characters that the players will succeed in helping Halia save her loved one.\nFeatures seven original soundtracks, fully rendered stylized 3D environment with hidden secrets for the player to uncover, and a story that explore the deep emotions of grief.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Project Polish Productions","platforms":[{"id":0,"name":"PC"}]},{"id":46337,"name":"Sakura Gamer","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99f/99f1c5aa6712f9976a363262ae246bdb.jpg","description":"When she was a young girl, Nekohime dreamt of being a video game developer. Now in her early twenties, she’s abandoned that dream to focus on her uninspiring job as a computer repair technician. There’s not enough time in the day to focus on game development – and anyway, isn’t she too old to entertain such unrealistic notions?\nThat is, until her childhood friend, Clover, introduces her to the seductive Suki.\nSuki is determined to turn Nekohime’s dream into a reality and finally develop a game – and she refuses to let Nekohime’s self-doubt stop her. Whether she wants to or not, Nekohime’s pulled into a brand new world, alongside these two bubbly, optimistic girls.\nWill they be able to make a hit game together, or will it all be for nought? And, in the end, will Nekohime manage to find true love?\nThe unwilling heroine of the story. Her real name is ‘Sayo’, but her friends refer to her by her internet handle - much to her embarrassment.\nThough she dislikes being referred to by a silly nickname she made up on the spot when she was a kid, she exhibits a lot of catlike traits. She’s always seen in her cat-eared jacket, she likes taking naps, and she can be rather ‘catty’.\nShe lacks purpose in life, and is bored by her tedious, unrewarding job. Maybe making a video game is exactly the kind of diversion she needs.\nOne of Nekohime’s closest friends. Her real name is Chika.\nThough she loves revealing cosplay and dressing in tightly-fitting spandex, she’s actually an elementary school teacher. She’s warm, cheerful, bubbly, and loves playing around with finger paints, which makes her a surprisingly good fit for her job (and no, she doesn’t dress quite so outlandishly when she’s at work).\nBeing creative, she enjoys experimenting in the kitchen and composing music. She nominates herself as the composer for her video game venture.\nA mischievous, vixen-like girl from Nekohime’s past, infamous for encouraging her elderly grandmother to feed her laptop’s D-Drive rice for a ‘Shinto purification ceremony’.\nSuki flirts with almost everyone, to such an extent it’s hard to tell whether she really means it. She also enjoys teasing people – particularly uptight people like Nekohime who get flustered easily.\nShe grew up in a shrine, but is worlds apart from the image of a ‘traditional Japanese beauty’. She can be loud and obnoxious and incredibly pushy, but she’ll apologize when she realizes she’s gone too far.\nShe’s also a competent digital artist, who spent a large portion of her life drawing and uploading her pictures online. After all, there’s not much else to do at a shrine.\nFeatures:\nsmall choices affect the ending, three endings are available in total\nplay the game in Chinese, just change the language in the options\nthis visual novel contains fanservice","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"}]},{"id":44699,"name":"Dark Elf","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df0/df0d330479c72b11a1be40d904877199.jpg","description":"Trading cards: According to new policy of Steam, trading cards will be available when the quantity of copies of game sold reachs a certain amount.\nIt’s a story about a dark elf and a teenager who survived from death field after experiencing countless death.\nThe background is that after the war and in the peaceful world, Frelia the former mercenary saved the young Ruse who was attacked, and took him in.\nHeroine: Fraylia\nA very haughty dark elf and female warrior\nCV: Inukai Ao\nBWH: B90 (G cup) W57  H95\nDuring the world war, as a mercenary she lived in the smoke of war.\nAfter the war, she worked in the city’s trade union as she traveled around the world.\nOnce when repelled a monster she saved the young Ruse and took him in.\nThe two lived in Orucu and depended on each other.\nHero: Ruse\nThe teenager living with Fraylia\nMany years ago, he was saved by Frelia when a monster attacked the orphanage where he lived.\nAt the beginning he didn’t open his mind and then he generally talked with her about everything.\nRuse has always been reading books at home for his bad health.\nHis dream was to become a national scholar.\nVarious Storylines\nIs it a happy ending? Or is it to degenerate happily?\nSeven RPG can be used for the end of storylines.\nTwo general directions:\n1. Normal line\nThe two lived together. Fraylia strives to help Ruse become an independent and strong man.\nAccording to different options of storylines, she could be a virgin at the end of the game.\n2.Sinner line\nWhen her specific work fails, there will be another line.\nFraylia regarded as a sinner can release her instinct power after lots of insults.\nRuse leaves. In order to see him again, she has to do some illegal work that her country arranges for her.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ONEONE1","platforms":[{"id":0,"name":"PC"}]},{"id":41339,"name":"Lifeless Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/46f/46fde2439383716ae3935d6d34d07921.jpg","description":"Lifeless Planet is a new 3D PC action adventure, independently developed by David Board and Alaska-based Stage 2 Studios and to be published world-wide by Lace Mamba Global in Q4 2012. The game puts players in the moon-boots of a volunteer astronaut on a one-way mission to a life-bearing planet far outside our solar system. But after a rough landing, the promise of a new Earth soon fades with the discovery that the planet he was to explore is now barren and inhospitable.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stage 2 Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":32977,"name":"Heroes of Might and Magic 4","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ee/3ee7f7eba8b211e0994d2c47eef0d245.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":32925,"name":"Black & White","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80e/80ea9be0380b3bfcce5178f3166dc8bd.jpg","description":"\"Black & White\" is the second game released by ZeroCreation after \"Lay a Beauty to Rest: Dark Peach Blossom Spring\".\nThe game type is visual novel + war chess game.\nIt is like a painting with symmetrical composition, presenting a dystopian world of black and white.\n\"Black & White\" has more than 250,000 words of game text.\nThis is a \"not dystopian\" dystopian story.\nPlayers will observe the memories of the twelve main characters as they are observing, and continue to communicate with the mysterious girl.\n- \"The opposite of justice is not evil, but another kind of justice.\"\nThis sentence is the most crucial theme of \"Black & White\".\nIn the world of Black & White, you can trust the White Church camp that symbolizes order, fairness, and reason.\nYou can also identify with the Black Cinder Crow camp, which symbolizes freedom, culture, and sensibility.\nOn one side are priests with white hair, possessed by insects, and different personalities.\nOn one side are historical figures who have returned from the dead, died tragically, and are romantic. How would you choose?\nThe art style of \"Black & White\" is extremely unique, and all the UI and characters in the game present a contradictory intention.\nThere are nearly 100 characters and more than 400 CG or story maps in the game.\nWe not only carefully sculpted the vertical paintings and CGs of each character with an extremely serious attitude.\nA branch plot is also set up for each of the twelve characters, and the branch plot will present a large number of story maps in a manner similar to comic interpretation.\nCompared with our previous work, \"Black & Whitef\" has optimized the animation. While ensuring high-quality static art, some art can be animated and lifelike, which can make players feel better. Enter this world!\nWe also put a lot of effort into this game in terms of sound, and strive to achieve the top level of domestic two-dimensional games.\nLin Fangzhou, Harper, Xu Luyang and other three composers are mainly responsible for the soundtrack of \"\", and the sound effects are also produced by special sound engineers, who will control every link.\nThe dubbing director of \"Black & White\" is Mr. Mori Zhongren, and the dubbing actors have invited Hanser, Tao Dian, and many dubbing actors from Yuesheng Dubbing Club to cooperate.\nThere are a large number of turn-based war chess level elements in \"Black & White\".\nWe hope that through the war chess level, people can be more immersed in the characters and worldview, understand the plot, and at the same time, we hope to bring more fun to players who like war chess.\nThere are more than 30 level maps in the game, including moving in subways, wilderness, urban areas and other venues.\nIn the first half of the game, players need to constantly unlock the character story, and at the same time clear the less difficult and guiding story levels.\nIn the second half of the game, after players collect 12 characters, players can freely assign characters to form a team, clear 28 challenge levels, and unlock more follow-up plots and game achievements in the challenge levels.\nThe game adopts weak cultivation, in the process of playing the level. Players can unlock new skills of characters by achieving achievements or unlocking plots, and match different gameplay combinations.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Lionhead Studios","platforms":[{"id":0,"name":"PC"}]},{"id":28158,"name":"The Last Night","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/072/07298d6f70b6055296006c49a670deea.jpg","description":"Humans first knew the era of survival. Then they knew the era of work. Now they live in the era of leisure. Machines have surpassed human labour not only in strength, but in precision, intellect, and creativity. The fight for survival doesn’t mean food and water, but a purpose for living. People now define themselves by what they consume, not what they create.\n\nThe Last Night immerses you in the everyday life of Charlie, a second-class citizen living in a city brimming with augmentation and citizens living a gamified existence -- none of which Charlie can experience himself due to a childhood accident. Apathetic and disheartened by the seemingly pointless world around him, Charlie is presented with an opportunity to take matters into his own hands. But at what risk?\n\nFeatures & Highlights •Explore a breathtaking post-cyberpunk world\nRoam freely across four varied and vibrant districts in a unique blend of 2D and 3D. Travel between areas with futuristic transportation and wind your way through dense crowds, drones, and unique characters -- as long as you have the right to be there.\n\n• **Immersive, revolutionary visuals**\nExperience a city of gorgeous pixel art, drawn and animated by hand combined with state-of-the-art compositing techniques and camera work. The result is an immersive aesthetic, modernizing the cinematic platformer genre.\n\n• **Contextual stealth & gunplay**\nEach encounter in The Last Night is handcrafted to ensure variety and narrative progression. Use your acquired knowledge of the city to hide from drones, skirt around police, and escape dangerous situations - or people.\n\n• **Real-time action dialogues**\nDraw your gun to intimidate or simply walk away while in the middle of dialogue. NPCs will stroll and chat alongside you rather than just stand around. They’ll even remember what you’ve said, night after night. Make sure to watch your mouth as much as your back.\n\n• **A rich, personal narrative**\nExperience an unfiltered, futuristic society through the personal lens of Charlie, an ordinary low-class citizen - from the daily routine to extraordinary events. Live the stories of the city and its inhabitants in a world that may have you questioning modern life.\n\n• **Dynamic, original soundtrack**\nShowing you a side of the city that the camera can’t, the soundtrack and audio design places you directly into the heart of the world. From the music playing in shops as you stroll by to hover-cars blasting above you and the stories overheard through open windows, everything has been crafted to enhance the visuals and fully immerse you in this living, breathing environment.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Odd Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":27930,"name":"Shakedown: Hawaii","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78f/78fbd47ade99a02351a0e810d0f4f073.jpg","description":"BUSINESS IN THE FRONT. BODIES IN THE BACK.\nFrom the boardroom to the streets, build your corporate empire and destroy the competition.\nWelcome to Shakedown: Hawaii, Vblank Entertainment's latest open world adventure. Shakedown: Hawaii parodies mega corporations, white collar crimes, and the most comically egregious business practices that go alongside. It playfully satirizes business that's so ballsy, you'll be left saying, \"I'm not even mad, that's amazing!\".\nBuild a \"legitimate\" corporation via open world missions, property acquisition, shakedowns, sabotage, market manipulation and collateral \"re-zoning\".\nThe entire island is up for grabs... or at least, will be once you ruffle enough feathers.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"VBLANK ENTERTAINMENT","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":21762,"name":"Vitrum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35a/35a04e4211a80ce57061652607990c17.jpg","description":"Vitrum is a 3D, first person, puzzle/platform game. The main character is an android designed to convert energy from crystals into powers. The android can absorb energy in each of his hands, allowing him to combine different powers. One of the coolest powers is the ability to invert the gravity, because it’s 3d and because the player can freely choose when and where to use it! Vitrum takes place in a desert laboratory full of different colored crystals. Some crystals grant powers, others are harmful to the android.\nThe player will have to figure out how to use the crystals, solve the puzzles and finish each stage in Vitrum. Features:\n- Stage editor\n- More than 45 stages.\n- Collect crystal shards to unlock Insane stages.\n- Each crystal color represents a power, explore each color and discover every power the android can execute.\n- Combine powers to solve more difficult puzzles.\n- Explore 3D gravity inversion, materialization of crystal platforms, super high jumps and other powers.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"9heads Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21570,"name":"Robinson Crusoe and the Cursed Pirates","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12f/12f2817ba411c40d7ecdd7f2e0f80d21.jpg","description":"Robinson Crusoe is back in his greatest adventure yet!\nIt's 1679 – After escaping the inhabited island, Robinson Crusoe sets sail for Brazil. Four weeks later ,however, he and his friend Friday encounter an uncharted land mass. Something strange happens with their hands, with cursed spots appearing over them. Voodoo magic smells in the air.\nFeatures:\n- Explore a ghost island inhabited by Cursed Pirates, with over 40 unique locations\n- Collect Black Spots and prepare an anti-curse root\n- Insult a monkey while testing over it the effect of the root\n- Meet unusual characters with unusual orientation\n- Find your way through an underground labyrinth while searching for the undead Captain\n- Dig pirates from the graves and laugh out of loud as stupidity takes control of their brains\n- Test your skills in Pirates IQ contests ®, Turtle Races, Grog competitions, brain bending puzzles and of course Hidden Object hunt!\n- Play through more than 35 absolutely unique mini-games (puzzles)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MagicIndie","platforms":[{"id":0,"name":"PC"}]}]