[{"id":12001,"name":"Arma: Cold War Assault Mac/Linux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b5c/b5c876799a465de3a410a30c1b824835.jpg","description":"Bohemia Interactive's debut game published by Codemasters as Operation Flashpoint in 2001, became genre-defining combat military simulation and the No. 1 bestselling PC game around the world and has won many international awards, including “Game of The Year” and “Best Action Game”.  Over 2 million copies have been sold since its release.\nStoryline\t\t\t\t\t\tThe horrors of WWIII are imminent.\nThere are clashes over the Malden Islands from dusk to dawn and you are caught in-between. You must use all of the available resources in your arsenal to hold back the incoming darkness. Victor Troska came back to Nogovo, he thought the pain of war was left buried in his past.\nBut his dream lies broken now.\nHis worst nightmare returns when military forces lands near Nogovo.\nKey Features\t\t\t\t\t\tCold War Assault\nCommand squad of fully equipped troops\nOver 40 authentic vehicles and aircraft\nImmersive campaign and single missions\nLAN/Internet multiplay\nVast 100km2 battlezones\nResistance\nStory-driven 20-mission campaign\nNogova – the new 100km2 island\nNew vehicles, weapons and equipment\nDetailed urban environments\n","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":364990,"name":"Chicory: A Colorful Tale","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/710/71095dec34962a167121a9d67838818f.jpg","description":"Chicory: A Colorful Tale is an adventure game about a dog wielding a magic paintbrush! Use the power of art to explore, solve puzzles, help your animal friends and restore color to the world. Created by Greg Lobanov (Wandersong), Lena Raine (Celeste,  Guild Wars 2), Em Halberstadt (Night in the Woods, Wandersong, Untitled Goose Game), and newcomers Alexis Dean-Jones and Madeline Berger!\nThe Brush is a one-of-a-kind artifact that can color the world. Naturally, it needs a wielder, a master artist responsible for all colors and for passing the brush down. The current wielder, Chicory, is immensely talented and beloved by all... until all the color in the land vanishes, and her with it! I guess that leaves it up to you, her number one fan, to take up the brush and fill in for her. Hmm... good luck!\nExplore the Picnic Province, and draw on anything!\nManipulate the environment with your paint and solve puzzles!\nUnlock new paint abilities and use them to reach new places!\nCollectible clothes, plants and furniture to dress your character and the world how you want!\nA world full of animal characters to help and befriend!\nLocal co-op! Play with your friends and paint together!\nIt's like Zelda in a coloring book world, with a dash of Animal Crossing!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Finji","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60645,"name":"DEMON'S TILT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a36/a36130f4e8c635bcd2f99385d4d029b6.jpg","description":"OCCULT PINBALL ACTION!\nTurbo-Charged Pinball is back!\nUpdated with bigger sprites, more baddies, more secrets and of course MORE BULLETS!\nDemon's Tilt pushes the limits of the Video Pinball genre with SHMUP & Hack N' Slash elements.FEATURES:\nA SPRAWLING 3 STORY TABLE\nCRYPTIC SECRETS\nHELLISH BOSSES\nINTENSE SPECIAL MODES\nMULTIBALL\nINSANE JACKPOTS\nBULLET HELL\nA MEGA-DRIVEN SOUNDTRACKMORE DETAIL!\nA three-tiered cathedral to Explore:\nUnlock its gothic secrets and depth over time, Packed with mini-bosses, baddies, ramps and mechanical traps.\nA Unique Magic System:\nConvert waves of enemy bullets into homing magic that fights for you,\nor transmute them into GOLD for a banked Ultra Jackpot!\nCombos:\nUse your Chain Meter to combo hits and keep your scoring momentum up. Link ramps to extend the Chain Meter's life.  Speed and aggressive play rewards!\nMultipliers:\nBase Multipliers can soar up to 99x Earn Global multipliers to rocket your score into the billions!\nBonus Rituals:\nComplete Dark Rituals and spell letters for huge bonuses & jackpots Complete them all and unlock a special WIZARD MODE!\nMultiball Modes:\nTrue full table multiball and add-a-ball modes!DEMONS\nThe High Priestess:\nControlled by an unknown demonic force. Turn her Wheel of Fate and take control of your destiny.\nThe Manticore:\nPart lion, serpent, and scorpion. An enslaved beast oversees the cathedral and protects its deepest secrets.\nThe Hermit:\nThe humble gatekeeper of the cathedral.\nThe Phalanx:\nA well-defended skeleton horde. Their shields will stop most shots, try and outflank them!\nShub Calamari:\n120 million years old is just a baby when it comes to Cosmic Gods!\nSacrificed Goat:\nAn aggressive demon, its eyestalks are its weak point.\nInsane Homunculi:\nA blasphemous experiment gone awry. Watch out for the bile!GRAPHICS:\n\"Hi-Bit\", massive colorful sprites inspired by the Neo-Geo, Saturn and PlayStation era.  Scaling, rotation, camera zooms... No \"blast processor\" required!MUSICA Mega-Driven Soundtrack:\nAn all-new OST true to the guttural sound of the Sega Genesis, composed by E.C.2151","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"WIZNWAR","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":34779,"name":"Freedom Fighters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c7c/c7c164e910febe99d88d6c3413724a94.jpg","description":"They took your freedom. It's time to take it back!\n\nFreedom Fighters is an intense third-person action game set in an alternate history New York during the invasion of a foreign superpower. Take on the role of Chris Stone, a hard-working plumber, and rise through the ranks of the resistance to prove yourself as a charismatic leader.\n\nLiberate supplies, scavenge weapons and use the 'recruit and command' system to grow the resistance and lead up to 12 freedom fighters into strategic conflicts throughout the campaign. Travel across the city and complete interconnected missions where your actions in one level affect the battles in another.\n\nOriginally released in 2003, IO Interactive's cult classic is now available digitally in its original form for the first time.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"IO Interactive","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"}]},{"id":18924,"name":"$1 Ride","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d8/3d81ea3575ff2d7bc98cd0da32f29fbf.jpg","description":"$1 Ride is a casual game with a fast paced, timing and reflex testing game-play style.\nTravel through space at warp speed! Collect power ups to increase your speed or risk your fuel to collect money, missiles and more.$1 Ride Features- Collect power ups and loot as you fly through space.\n- Do battle with your friends on the leaderboards.\n- Unlock new ships.\n- A fantastic soundtrack by Eric Matyas.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BeHappy Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18413,"name":"Hamlet or the Last Game without MMORPG Features, Shaders ...","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af5/af57a4a8db50fa23c947c4eff16c3ae7.jpg","description":"Hamlet or the Last Game without MMORPG Features, Shaders and Product Placement is the original point-and-click adventure game based on twisted William Shakespeare's Hamlet. Solve logic puzzles and fight with monsters to uncover secrets, punish all the villains and rescue the princess.Key FeaturesFrom the Creator of an Award-Winning The Franz Kafka Videogame\nIn the best traditions of classic adventure games\nThe first indie game in the world based on Shakespeare's Hamlet\n25 levels\nBoss battles\nLogic puzzles\nNo inventory","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Denis Galanin","platforms":[{"id":0,"name":"PC"}]},{"id":17385,"name":"Konung 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b7/3b79f43c4624ad31e31077ce59c26f65.jpg","description":"Konung 2 is a sequel to Konung: The Legend of North. According to the storyline Good and Evil traded places. The main hero that won a victory over the forces of Evil in the first part of the game has got under the influence of a very powerful magic artifact -- Sovereign bracelet. The hero became the dark Master, the biggest threat for his land. His mind is completely controlled by the bracelet and he is trying to subdue all other magic artefacts.\nOnly six heroes, descendants of the Titans, can stop him. They must be fearless and very cautious. Their enemies are not only bloodthirsty monsters but Master's warriors as well. Their task is hard but it's the only way to save their land.\nThe world of Konung is a unique and spacious fantasy land, that combines parts of known history with classical myths and the legends of the Chronicles, including immortal heroes, magical artefacts and ancient sorcery. The whole world is shaped by three cultures on the verge of the second millennium: tribes of wild Slavic hunters, noble traders of the still-powerful Byzantine Empire, and fearless Viking warriors.Key features:Unique Fantasy world settled in an atmosphere of myths and the legends of tribes of wild Slavic hunters, noble traders of the still-powerful Byzantine Empire, and fearless Viking warriors\nSix different heroes, male and female warriors\nImproved RPG system, wide range of character skills an characteristics\nDetailed dialogue system\nDozens of quests\nOutdoor and indoor locations\nSettlement management","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":12007,"name":"Duke of Alpha Centauri","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/903/903cc206631e1ce58ed30fcb92b0fa58.jpg","description":"ABOUT\nDuke of Alpha Centuri is a space shooter with amazing graphics. The main goal of our game is to have a lot of fun while blowing up hordes of different types of enemies.\nEngage in boss fights, upgrade your ship and ship systems until you are able to show off in an endless mode. The game is designed to fit any player, from the beginners all the way to the skilled ones.\nAnd also It has different difficulty settings to make it more challenging.\nLEVELS\nThe game is featuring different and unique levels. Each level and enemy is carefully designed and programmed to give you as much fun as possible. Every level looks amazing, with beautiful space graphics.\nUPGRADES\nEvery time you level up, you unlock one system upgrade point. For every 10 levels you are able to unlock more ship upgrades.\nSystem upgrades\n- Mechanical weapons power supply\n- Energy weapons power supply\n- Shield\n- Hull\n- Weapons damage\nShip upgrades\n- Tactical\n- Auto-aim plasma turret\n- Auto-aim missile\n- Auto-aim laser turret\n- Science\n- Holoemiter improvement\n- Shield energy converter\n- Phase shift\n- Engineering\n- Fast shield recharge\n- Fast hull repair\n- Fast weapons power recharge\nPLAYER\nThe Player has two different types of weapons: mechanical (bullets and missiles) and energy weapons (plasma bullets and lasers). They are powered from different power sources so keep in mind to upgrade them both. Missiles and lasers are activated when the player targets enemies with an auto guided system. You can change your target at any time.\nBesides weapons, the player has 2 more ship abilities: holoemiters and system overload. Holoemiters are used to boost your damage and projecting 3 or 5 holodrones, so that you can damage enemies more quickly. System overload is a technology that combines nanorobots and high temperature plasma reactions to recharge shields, weapons power supply or to repair your ship's hull.\nYour ship has a defense shield installed. If it fails, be careful that you don't get critical hull breach, because your reactor core will explode and destroy your ship.\nENEMIES\nDuke of Alpha Centuri has 13 different enemies, each one with 3 different styles which gives them a complete diversity.\nEnemies are equipped with different types of weapons (plasma weapons, photon weapons, lasers, missiles) and some of them have cloaking technology, so be careful when they appear.\nBosses are quite unique and use all kinds of foul tricks to destroy the player. You will encounter some asteroids.\nBe careful when flying near them because your shields can't block them, so they will hit you directly.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4648,"name":"Golden Axe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f0c/f0ccc044fa8ed8942e04a72a2d022a3d.jpg","description":"Just UpdatedAll SEGA MegaDrive/Genesis titles now launch using the new SEGA MegaDrive/Genesis Interactive Hub, with all new features, UI and Steam Workshop Support!\nAbout the GameThe land of Yuria has been invaded and is now ruled by the iron fist of Death Adder, who secured his throne by seizing the Golden Axe™.\nThree brave warriors now rise to the challenge of defeating Death Adder and his soldiers and returning peace to the Kingdom.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"}]},{"id":3239,"name":"Yu-Gi-Oh! Legacy of the Duelist","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/749/7497fc6b11cc4d28e34a7f967f90ccab.jpg","description":"Enter the Duelist Simulator to take your place among the finest Duelists ever in Yu-Gi-Oh! Legacy of the Duelist! Players from around the world have been invited to take part in an elite Dueling program that simulates the best Duels across all of Yu-Gi-Oh! history. Replay actual events in the Yu-Gi-Oh! timeline, from the original Yu-Gi-Oh! series up to Yu-Gi-Oh! ZEXAL, featuring the storylines, characters, and Decks in a brand new Story Campaign.\nWith over 6,600 cards to play with, including new Pendulum Summon Monsters, Duelists can fight in hundreds of matches with over 90 characters, and even compete in new Battle Pack Sealed Deck and Draft play with other Duelists online.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":573125,"name":"Life is Strange Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e3f/e3fc11718acfeac81c05cbcc394dae2f.jpg","description":"Experience the BAFTA award-winning story of Life is Strange now beautifully remastered with enhanced visuals and vastly improved animation using mocap technology.\n\nPlay as Max Caulfield, a photography senior who discovers she can rewind time while saving her best friend Chloe Price from a violent altercation.\n\nThe pair soon find themselves investigating the mysterious disappearance of fellow student Rachel Amber, uncovering a dark side to life in Arcadia Bay. Meanwhile, Max must quickly learn that changing the past can sometimes lead to a devastating future.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":319155,"name":"She Sees Red","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5c/b5ca23be7fbe477a52f1539cda924362.jpg","description":"She Sees Red is an interactive live-action thriller full of drama, violence, and your responsibility.\nThere's been a strange murder in a night club. A detective is doing her best to find the elusive murderer who continues their killing spree leaving abundant evidence behind. Make different choices to affect the plot line and reveal all pieces of the puzzle.\nDynamic and non-linear plot: it's a short but intense story with four possible endings that depend on your choices.\nUnconventional storytelling: the plot consists of two intertwined lines, and your choices in one of them determines the other.\nReal motion picture: it is a live-action movie presented to you by true professionals.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Rhinotales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":17139,"name":"Rise of the Triad: Dark War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19e/19eb4045b8e6d8d7dc876afac8991b4d.jpg","description":"Tackle incredible game hazards, such as spinblades, gun bunkers, huge boulders, Firejets, pits, Firechutes, Lavawalls, gas grates, and more.\n\"Like DOOM, Rise of the Triad is a high quality, fast scrolling first-person perspective 3D action game. Graphics are on par with DOOM. It has destructive enemies and lots of them, an arsenal of weapons from simple pistols to missile launchers, life-preserving armor, traps and ambushes galore, and the ability to play by modem or network. In all, there's a great degree of similarity between the two games. In addition, Rise of the Triad puts most of the other DOOM wannabes to shame - it's that good!\" -  Chuck Miller, Editor of interactive EntertainmentFeatures\nRise of the Real Estate: Super huge levels - up to one million sq. feet, and up to 16 stories high!\nDigital Diversity: Ten unique, digitized enemies in the game, plus four multi-stage bosses!\nWin Your Way: Thirteen hardcore weapons and play as one of five characters, each with unique attributes and abilities.\nCollateral Damage: Nearly every object can be destroyed - even mark walls with bullet holes!\nConnect and Kill: Modem and network playable, up to 11 players via an IPX compatible network.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"3D Realms","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":9636,"name":"CLANNAD","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f1/9f1d4be0f0e3dd1d4cf37f884c809461.jpg","description":"StoryAfter the death of his mother, Tomoya Okazaki—a guarded delinquent student at Hikarizaka High School—struggles to not only make sense of the abusive relationship he has with his alcoholic father, but also find meaning in his life. While on his way to class one morning, he meets a mystifying girl named Nagisa. She is a delinquent like him, but only because she is repeating her senior year, unlike the perpetually tardy Okazaki. From their brief encounter, Nagisa decides they should be friends, and enlists Tomoya's help to revive the school drama club. Not being busy in any way, he decides to join in. Along the way, the two make friends with many other students and try to find both solace and belonging in their endeavors.New FeaturesHD Upgrade\nAll visuals have been upgraded to 1280x960 for the Steam release of CLANNAD.\nDangopedia\nExclusive to the English version of CLANNAD is the term encyclopedia, Dangopedia! It's a handy reference tool for understanding aspects of Japanese tradition and pop culture.\nAchievements\nSteam achievements are supported! There's also an in-game menu to review your progress.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"VisualArts/Key","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":27939,"name":"Pokémon Ultra Sun, Ultra Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c90/c90ccff08926e422c682ceb3804342bb.jpg","description":"Take on the role of a Pokémon™ Trainer and unravel the mystery of the\nLegendary Pokémon Necrozma's new forms: Dusk Mane Necrozma in the Pokémon\nUltra Sun game and Dawn Wings Necrozma in the Pokémon\nUltra Moon game. You can encounter and battle 400+ Pokémon,\nincluding new forms. A brand-new showdown awaits!\n\nDiscover the Legendary Pokémon Solgaleo and Lunala's new Z-Moves and\ntheir mysterious connection to the Legendary Pokémon Necrozma. Then\nventure into Ultra Wormholes to explore the Ultra Beasts' home world,\nencounter every Legendary Pokémon, and uncover Ultra Megalopolis, a dark\nworld where Necrozma has stolen the light. On the bright side, the Alola\nregion has new activities, and fresh landscapes to explore with some\nassistance from your powered-up Rotom Dex. You'll need all the help you\ncan get if you're going to stop Giovanni, Ghetsis, and the rest of Team\nRainbow Rocket from taking over the Alola region!\n\nAs a Pokémon Trainer, uncover new mysteries in the Alola region and\nbeyond!\n\nEncounter over 400 Pokémon, including new forms, on a quest to become\nPokémon Champion\n\nNew Z-Moves for Necrozma, Solgaleo, Lunala, Mimikyu, Lycanroc, and\nKommo-o\n\nUltra Warp Ride Solgaleo or Lunala into Ultra Wormholes and surf with\nMantine\n\nTake photos and share them with friends in Alola Photo Club\n\nFace off with Team Rainbow Rocket to determine the fate of the Alola\nregion!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":17749,"name":"Elegy for a Dead World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/801/8011db10fbb1491829fc0c2b91d966c6.jpg","description":"In Elegy, you'll travel to three worlds and write stories about their long-dead societies. You’ll lose yourself in settings inspired by the works of poets Keats, Byron, and Shelley, and use the game's system of writing prompts to help create your own masterpieces.\nExplore 27 different writing challenges, through which you create narratives about the worlds you visit, from multiple perspectives. In one challenge, you play an archaeologist, uncovering clues and writing about a city's final days; in another, you're a thief, composing a song about searching the wreckage for valuables; and in another, you're a bard penning a lament in rhyming couplets.\nThe developers created Elegy to share the joy of creative expression -- ideally, they want to give non-writers an environment in which they can tell stories. With visuals inspired by Romantic painter J. M. W. Turner, the game provides a playground for individual imagination, and a community where everyone is an artist. Elegy's developers, Dejobaan Games and Popcannibal, are leaving the discussion of what art or a game is to critics, and merely asking gamers, \"What will you write?\"\nWhen you've finished writing a story, share it with other players via Steam Workshop; then read others' works, and commend your favorites.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dejobaan Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16795,"name":"Back to Dinosaur Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e50/e504453430d648dbbca9fe48d8a0f7ab.jpg","description":"Crytek first earned its reputation for pushing the limits of computer graphics with the original X-Isle/ Dinosaur Island  demo, which wowed press at 1999’s E3 convention in LA. Now we come full circle with Back to Dinosaur Island, which blew away attendees of GDC 2015 earlier this year. Back to Dinosaur Island takes advantage of 15 years of CRYENGINE development to show users the sheer endless possibilities that upcoming Virtual Reality devices like the Oculus Rift offer, bringing them face to face with the most terrifying predator that has ever walked the Earth.\nBack to Dinosaur Island has been built from the ground up to take advantage of the Oculus Rift HMD, and requires an Oculus Rift DK 2 device to run. Please check the System Requirements below- Virtual Reality games require a high frame rate to guarantee a comfortable experience for the user. Running Back to Dinosaur Island on weaker hardware can cause lower frame rates, which can lead to users having a less than ideal experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Crytek","platforms":[{"id":0,"name":"PC"}]},{"id":14236,"name":"Sakura Dungeon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20f/20ff9f13a1d5ce50fab81054bef8bd7a.jpg","description":"You are Yomi, an ancient fox spirit. Your dungeon has been stolen from you while you have been sealed. Capture monster girls, collect loot, explore the dungeon's depths and reclaim what is yours in this dungeon crawler game.Game FeaturesLead and control a powerful party of up to 6 characters!\nFirst-person view with retro dungeon crawling action!\n3 difficulty settings (Normal, Hard, and Abyssal) with 15-25 hours of gameplay depending on your skill and the difficulty setting!\n50+ different types of monsters to fight and capture. Gotta’ capture them all!\nUnlockable CG Gallery and Sprite Gallery!\nOver 30 in-game outfits to discover and equip!\nSteam Achievements!\n15 Trading Cards to collect, with 6 unique backgrounds, and 9 SD Emoticons!\nIn this story players will assume the role of an ancient fox spirit who awakens after several hundred years of deep sleep to find that possession of her lovingly made dungeon has been taken from her! As if that wasn’t enough cause for alarm, she has also been robbed of her power, leaving her weak and vulnerable. She soon discovers that it was a heroic knight who woke her from her slumber, and after a brief fight and “negotiation,” the knight decides to join her on an adventure to reclaim the dungeon! Together, they will unearth great treasures, reveal secrets and hidden rooms, and recruit monster girls to fight by their side...all while avoiding traps, fighting off dangerous enemies and bosses across multiple floors, and uncovering the devious plans of the new dungeon lord. One of the most important mechanics of Sakura Dungeon is the ‘capture’ mechanic, wherein the player will be able to capture monster girls they encounter and add them to their party.\n\nIn addition to dungeon exploring, Sakura Dungeon is also packed with extensive dialogue and plenty of gorgeous backdrops and cutscene artwork for the player to unlock as they carefully navigate their way through the dungeon.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":502171,"name":"Action Taimanin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa1/aa1549ad03039b4a72addf6a63a01f18.jpg","description":"SYNOPSISTokyo. The demonic city, plagued with the demons from the dark realms.\nThe ancient rule has prohibited the demons from interfering with humans,\nbut with the humanity's dark descent, the pact is now history,\nand the treacherous syndicates weave crime and chaos throughout the world.\nIn order to protect the nation, the Japanese government has established a special force,\nconsisted of ninjas who, with their might and skills, can fight against the demonic invasion.\nThe world will know them... as the taimanins.\nA new task force is established, composed of taimanins, to fight against the international threats and terrorist attacks.\nThe task force's first mission is to retrieve the bio-weapon stolen from UFS base.\nThe mission takes a wild twist, as an unexpected alliance joins the team,\nand equally unexpected adversary reveals himself - a man who knows Igawa Asagi, the Almighty Taimanin.......\nCOMBATIntense hack-and-slash action with simple taps and swipes!\nCombine skills, supporters, and weapons to customize your combat style!\nCHARACTERS3+ gorgeous playable characters and 30+ lovable supporter characters from the famed Taimanin franchise at your service!\nWin their flavor to unlock exclusive, intimate visual novel stories!PRIVATE ROOMPose and deploy the 3D models and create your own action screenshots!\nAll playable characters and enemies available for 3D sandbox fun!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Lilith","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":457728,"name":"Suicide Squad: Kill The Justice League","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eac/eac17db790a988f47e5700d176497694.jpg","description":"Jump into Suicide Squad: Kill the Justice League, the genre-defying, action-adventure third-person shooter in development from Rocksteady Studios, creators of the critically acclaimed Batman: Arkham series. This title combines the studio's signature character-driven story gameplay with third-person shooter action to deliver a gaming experience unlike any other.\r\n\r\nDiscover the origins of Amanda Waller's infamous Task Force X (a.k.a. the Suicide Squad) as Harley Quinn, Deadshot, Captain Boomerang and King Shark begrudgingly embark on their mission to take down the World's Greatest DC Super Heroes, The Justice League. Featuring an original narrative set within an expansive open-world city of Metropolis, Suicide Squad: Kill the Justice League puts the four DC Super-Villains on a collision course with an invading alien force and DC Super Heroes who are now laser-focused on destroying the city they once vowed to protect. All the while, the Suicide Squad must be mindful of the lethal explosives implanted in their heads that could go off at the first sign of defiance.\r\n\r\nEach squad member has their own unique moveset with enhanced traversal abilities to freely explore the dynamic open-world of Metropolis, along with a variety of weapons to customize, and skills to master. Fans can tailor their experience, whether playing on their own as a single-player, or teaming up with friends in multiplayer co-op.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Rocksteady Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":32697,"name":"Age of Empires","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/323/323dac3cdfdc40cd87dd4b2582578afe.jpg","description":"Age of Empires is the first in a series of real-time strategy video games developed by Ensemble Studios and published by Microsoft. Players choose from one of 16 available civilizations and lead the same to victory, which can be achieved through various means, such as destroying all enemy civilizations or by building and protecting a Wonder. Players start with few resources and subjects, and utilize them to build an empire, advancing through 4 distinct stages and researching technology and building monuments and armies. An expansion, titled Rise of Rome, was released in 1998, adding four more civilizations and a host of QOL improvements.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Ensemble Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17610,"name":"Reign: Conflict of Nations","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c0/6c04228c6d5ec8b2feb3de91bd2c6b81.jpg","description":"Reign: Conflict of Nations is a large-scale real-time historical strategy game covering three centuries of medieval Europe. The player becomes a monarch testing their skills by controlling one of 26 unique factions as they develop smart economics, work political maneuvers, maintain thoughtful diplomacy, take care of resources and wage war. As the ruler players have absolute command and the ability to thrive or fail and die.\nReign: Conflict of Nations allows players to have a well thought-out and historically accurate system of building and assigning labor forces in cities, a large selection of scenario-based and random missions, an expansive and realistic technology tree, more than 150 types of military units and elaborated graphics and animations which bring the war to life.\nStrategy game covering 300 years in the history of Europe.\nBased on a detailed 3D map with authentic landscape and historically accurate military units.\nLarge-scale military campaign to turn a small principality into a large and powerful empire.\n26 factions to control: Russian, Polish and Lithuanian princedoms, lands of the Knight Orders and Eastern European monarchies.\nPolitical, economic and role-playing systems showing the intricacies of diplomacy and wars in medieval Europe.\nGreat people and personalities of the past, hundreds of game characters, each one with their own unique specialties including rulers, commanders, priests, alchemists and spies.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Lesta Studio","platforms":[{"id":0,"name":"PC"}]},{"id":15784,"name":"Suits: A Business RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2e/f2e6c8b35371639de651e15c466b6d17.jpg","description":"Looking For A Job?\nThe Corporation Needs You!\nApply at Suit City HQ today and put the future of the world in your hands!\nThe Corporation IS you! The Corporation keeps our beloved society in order and in justice.\nThe Corporation supplies the task and the task supplies cash! And remember citizen, more\nreward for the less questions you ask... Our perfect society relies on us to keep the cogs in\nthe machine lubed up and quiet. The cogs keep the machine running and functional.\nWe need cogs like you to support the city in the most noble of ways. Take action!\nTake a stand! Take this application in your hand and apply now!\nNecessary Credentials:\nStrong Fists\nChiseled Jaw-line\nFantastic Tie\nA Very Girthy Briefcase\nFighting Experience\nLack of Heart\nLove for the Corporation!\nPlease submit your application along with your $0.99 application fee to start today!\nFeatures\nOver 99 Different Types of Enemies\nFind Hidden Treasures Within Each District\nEnjoy a Kickin' Soundtrack Composed by Gbone and the Biz\n86% Interactive Environments\nLots and Lots of Sandwiches\nMultiple Hours of Game Play\n35 Achievements\nSteam Trading Cards\nAll of this and more for less than 1 dollar!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Technomancy Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12988,"name":"Ninja Blade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c8/1c8c873ecaf82bb408db648cedeca542.jpg","description":"It was July 7th, 2011.\nWhile investigating reports of unlawful weapons trafficking, peacekeeping forces encountered an unclassified carnivorous species occupying a small village in Northern Africa.\nThese rabid creatures were easily provoked and resistant to conventional attack. Eight specimens were encountered in the region now referred to as \"Ground:ALPHA\"...\nOnly four were successfully contained for study. Victims of the attack were quarantined at a research facility nearby. These victims displayed signs of internal liquefaction and accelerated necrosis, similar to symptoms of other flesh-eating viruses native to that region.\nBut it wasn't a viral outbreak. It was a parasitic infestation. A previously unidentified species of hook worm was found beneath the skin of the Ground: ALPHA specimens.\nThese parasites, we call them \"Alpha-worms\", laid dozens of eggs inside their hosts, which in turn produced numerous larvae. These larvae penetrated the bloodstream and triggered a variety of genetic failures. However, unlike most genetic failures, these symptoms were not fatal. Instead, infested victims were larger, stronger… and driven by hunger.\nUsing the research gained from the Ground: ALPHA specimens, a team of some special individuals were assembled. Minor outbreaks occurred over the next few years, but elite squad quickly put them down. Which brings us to the current situation in Tokyo...\nExciting and challenging battles with 3 different weapons\nQTE and cinematic action\nVariety of powerful ninja abilities\nWeapon and ninjutsu upgrade system\nCrisscross the city of Tokyo with intense gunfights","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"FromSoftware","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":11561,"name":"Brawlout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ed/4ed594f1f80fe79687c84fe36222e801.jpg","description":"A new challenger has appeared in the platform fighter arena!\nStriking the balance between the growing competitive scene and the genre’s party game roots, Brawlout hopes to cater to the veteran platform fighter, the casual fan and the newcomer looking to make their mark. Brawlout does away with shields and blocking, focusing heavily on the aggressive, fast-paced combat which has made platform fighters so fun to both play and watch.\nEach character in Brawlout has their own unique playstyle, catering to specific character archetypes seen in other fighters. Whether you’re a die-hard grappler or a rushdown fiend, there is a fighter for you in Brawlout.\nCombined with familiar movement techniques like wavedashing and airdodging, Brawlout adds some extra mechanics seen in other fighting games. The Rage Meter builds up as you both deal and take damage, allowing you either break combos with the Rage Burst or unleash hell with the Rage Mode. The Rage Burst pushes opponents back, breaking their combos and allowing players to create some breathing room at the cost of half their Rage Meter. If the meter fills, you can activate the Rage Mode, increasing the knockback you deal while reducing the amount you take.\nAs for modes, Brawlout has all you’d expect from a normal platform fighter and then some. Up to four players can compete in local multiplayer in either timed, stock or team battles. AI opponents are also available if you want to practice your team combos with a friend, or if you need to fill out a free for all.\nBrawlout’s online suite is suitably robust, with all of the following features:\nA robust Ranked match system, complete with regional leaderboards\n1v1 casual matches for low-stress competition\n2-4 player private lobbies where players can practice or mess about to their heart’s content\nThe Brawlout Network where players can check their fight stats, match history and replays\nBrawlout TV which allows for live spectating and watching of specific player replays\nWeekly competitive tournaments for those looking to prove their Brawlout skills\nAdditional modes like the story campaign and single-player challenges are planned to be added during Early Access, along with more characters, gameplay features and other surprises!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Angry Mob Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":10813,"name":"Black Mirror II: Reigning Evil","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85b/85b77e7a993db1cd70ba8f76dc7904ad.jpg","description":"When solitary Darren Michaels befriends the beautiful Angelina, he has no idea what the fates hold in store for him. The alluring Angelina has also attracted the eye of several others; and when she suddenly disappears, Darren finds himself questioning what has happened to her while he is haunted by a series of torturous and ever-intensifying nightmares. Darren's search for his missing friend and his own sanity take him on a chilling expedition from his small New England town to Willow Creek, England - and the reigning evil of Black Mirror Castle.\nEnter a dark, captivating world as the massive evil of Black Mirror Castle is reincarnated with over 100 atmospheric locations to explore and 40 different characters to interact with. Will Darren's search lead him to redemption or the hell of insanity? The answers can only be found in the Black Mirror - for once you gaze into it, you won't be able to look away.\nFeatures:\nAn epic story of evil told in six chapters\nAtmospheric effects such as rain, fog, and storms\nMore than 40 characters and hundreds of realistic animations\nChallenging puzzles and mini-games\nOver 100 different locations, including a medieval underground temple, a mental hospital, and a cemetery","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cranberry Production","platforms":[{"id":0,"name":"PC"}]},{"id":48,"name":"PaRappa The Rapper: Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/480/480e12d3af930c41562e670778fe4a9a.jpg","description":"After 20 years since his Debut, PaRappa the Rapper returns to PlayStation! Relive the original music game and join PaRappa on his quest to win the heart of Sunny Funny and learn from favorite rap masters like - Chop Chop Master Onion, Instructor Mooselini, and Cheap Cheap The Cooking Chicken. Complete with all the music and gameplay that made PaRappa the Rapper an instant classic.\no    Experience the original rhythm game on PS4 with a complete HD remaster including:\n-Dynamic 4K support for PS4Pro and 1080p support for standard PS4.\n-Remastered Hires Textures\n-Enhanced Audio\n-Additional Alternative Audio Tracks Included\no    Play with two new features:\n-“Feel the beat” – the controller vibrates to the beat throughout the song\n-“See the beat” – enlarge the player icon so you know you hit the beat\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Sony Interactive Entertainment Inc.  ©Rodney A. Greenblat/Interlink.  PaRappa the Rapper is a registered trademark of Sony Interactive Entertainment America LLC","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":722688,"name":"Strange Horticulture","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/add/add2aecd96e74df7e27082328039957e.jpg","description":"Find and identify new plants, pet your cat, speak to a coven, or join a cult. Use your growing collection to influence the story and unravel Undermere’s dark mysteries.\nWelcome to Undermere, a quaint town surrounded by hag-infested forests and rugged mountains. You are the Horticulturist, owner of local plant store Strange Horticulture. As a cast of colorful customers come by your shop, you are quickly thrust into an occult mystery stretching back hundreds of years.\nExplore the lands beyond your store to find new plants, but be careful! The dark woods and lakes are not always friendly to a simple herbalist. You might discover powers beyond your wildest dreams - or lose your mind completely. Use context clues to determine which places to visit, and which to avoid!\nUsing your trusty encyclopedia and clues found on your explorations, you learn more about the strange plants you come across. By identifying each plant, you will be able to use their effects to influence the story -- from hypnotic hallucinogens to powerful poisons.\nhttps://store.steampowered.com/app/1574580/Strange_Horticulture","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Bad Viking","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":43772,"name":"Tracks - The Train Set Game","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5e/e5ef95d0ced6907581ad5eb4a67ea7ff.jpg","description":"Track Building\nBuild the train sets of your childhood dreams with an easy-to-use editor. Just indicate where you want to build and Tracks does all the hard work for you, effortlessly mapping out turns, junctions and crossings under your command.\nAdd houses and trees to create your own little villages\nPlace unique track shapes and configurations beyond what you would normally find in a physical train sets\nPhysics objects to play with\nInteractive mechanisms like bridges and lifts give you more freedom in moving around the environment\nPlay in free-mode to build at your leisure without any set objectivesRide the rails\nOnce you’ve created your rail network, you can ride along from inside your train, in first person. You’ll have full control of your vehicle in this view and will be able to adjust the train’s speed and direction. Your train’s weight and momentum are simulated, challenging you to maintain a steady but efficient speed while transporting heavy cargo.Objectives\nBuild your own train sets at will, or enjoy the set game modes which boast a variety of objectives for you to complete. For instance, Tracks challenges you to design a rail system that accommodates passengers’ commuting needs. Or transport cargo and build the most efficient rail network to complete objectives in the fastest time possible.Environments\nVaried environments await, acting as playgrounds in Tracks: The Train Set Game. Go off the rails, ride along the furniture, and bump into objects to activate them. Each environment contains unique features for you to experiment with and incorporate into your track designs.Share\nWe are currently researching Steam Workshop support so players can share their tracks with other players online. We will update this section once we have a good idea of the functionality available after a few tests!\nTracks: The Train Set Game is everything the child in you has ever wanted. There are plenty of train games out there, but this is the only nostalgia-filled train simulator you’ll find on Steam.\nFor all the train game news you can handle, make sure to follow Tracks: The Train Set Game on Twitter, like us on  Facebook. And for more from Excalibur Games, check out our  IndieDB profile.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Whoop Group","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":38283,"name":"Guitar Hero III: Legends of Rock","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/444/444d319b3156101aeef3d1a8df219f3f.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":37136,"name":"Cossacks 2: Battle for Europe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a16/a1655f5df4c29431b5e61b476071b9b7.jpg","description":"Let the battle begin! The Cossacks II: Battle for Europe add-on continues the renowned Cossacks II:Napoleonic Wars game. It depicts the rather short historic period of the Napoleonic wars. The Napoleon wars changed Europe forever, leading to the formation of empires and putting an end to almost one thousand years of constant strife between small states. The game provides mass-scale battles between thousands-strong armies of the nations involved in conflicts during this period. The theatres of operation introduce France, Britain, Austria, Russia, Prussia, Egypt, and three nations not represented in the original game – Spain, the Grand Duchy of Warsaw (Poland), and the Confederation of the Rhine.\nThe Cossacks II: Battle for Europe reconstructs in detail the soldiers' uniforms weapons and architecture of each nation. Each nation's army has its unique units and possibilities. The game includes over 180 units 190 buildings and 1200 flora and fauna elements. When developing the combat system the peculiarities of early 19th century warring were taken into account as was the value of formations provisions and troop morale. Tactical tricks utilized by military commanders of the time are fully reflected in the game. An \"honest\" system of bullet and cannonball ballistics based on physics is an innovative addition to the Cossacks engine. Other engine features include 3-dimensional landscaping which creates realistic-looking scenery and towns and impacts combat tactics. For example the firing range of a subdivision of soldiers or a cannon positioned at the top of a hill is greater than the firing range of a unitstationed on flat terrain.\nKey features:\n\nControl the French, Russians, Austrians, Britons, Prussians, or Egyptians -- master new weapons and tactics during a time that redefined the meaning of modern warfare.\nFight through historically inspired battles of the 19th century, with massive armies colliding in different types of terrain and weather.\nBattles on real historical scale with tens of thausands of units on one map.\nRealistic Troop Morale System - Well-fed troops live longer and grow in experience to become valuable battlefield assets, while fierce and overwhelming opponents, or marching long distances will cause morale to drop\nEnhanced diplomacy tools help you create treaties that give you the advantages\n","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":28485,"name":"Hydrophobia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8c0/8c0a8e8d2287fbc3f66a32ba7ca58390.jpg","description":"Hydrophobia™ is a third person survival adventure set in a floating city, where terrorists take control and heroine Kate has to overcome her haunting childhood memories and fight back using all her skills and expertise as a systems engineer. Hydrophobia offers fast-paced action and breathtaking visuals; engage in mind blowing “flow combat” where emergent gameplay results in a never-the-same-experience. Unleash floating oil fires, electricity and the power of the water itself to wipe out your enemy as you discover the terrifying truth of the Malthusian agenda; Save the World, Kill Yourself.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Dark Energy Digital","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":21303,"name":"Feeding Frenzy 2 Deluxe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/496/496c0aa09718d069effc48bc9bead307.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"PopCap Games","platforms":[{"id":0,"name":"PC"}]},{"id":21056,"name":"Hylics","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5f/e5f9cb8bd80ce6ac1088545cf513e73c.jpg","description":"Hylics is a recreational program with light JRPG elements.\nFeatures:\n-Advanced graphics.\n-RPG battles.\n-Overuse of random text generation.\n- ~2+ hours of content.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mason Lindroth","platforms":[{"id":0,"name":"PC"}]},{"id":19178,"name":"Sinless + OST","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b24/b24b4f040c4a754e7a07e576d7f29aa1.jpg","description":"Free OST EditionBuy Sinless on Steam and get the fantastic Soundtrack from the game for free. A set of cool cyber-tunes will accompany you wherever you want!\nAbout the GameSinless is a unique combination of a classic point n' click and visual novel with many references and inspirations from classics of the genre, such as Snatcher, or Rise of the Dragon. Add to that custom, inhouse designed lightning and parallax effects, along with a dedicated awesome Soundtrack and original storyline, we hope you will enjoy your stay!\nPlanned out as a trilogy, experience the first episode also known as the Reveal, which will be followed by Revolution and Revelations accordingly.\nWelcome to the Omni-Care sanctioned city. The world as we know it has come to an end and a New Order has taken over. Life is seemingly perfect, in an almost utopian society humans have to officialy schedule their whole days in advance via \"ports\" - mandatory cybernetic implants. Large commercial entities who also happen to be port manufacturers have replaced governments and crime is practically non existent. You are the hero of this exciting cyberpunk tale, about to start a regular day, only for it to unfold in the most unexpected manner revealing the true nature of the multi-layered city.\nFeaturing:\n-A unique, carefully planned out story and lore: It is  important to remember that you are thrown into a world of specific rules, laws, customs, lingo, social segregation etc which you will learn and unravel in time along the way.\n-Old school gameplay: meaning little to no handholding. We wanted to give the player the choice of freedom and to discover and unravel the story at their own pace, hence Sinless offers little to no handholding. Therefore many features or lore related backstories/explanations are not thrown in your face. Instead they are somewhere in the world, waiting to be discovered; be it a feature, easter-egg/game reference, or world news event etc. But fear not, optional hints highlighting interactive points will be available from the get-go.\n-Hand crafted with love: Thousands of frames of hand crafted animations, graphics,textures and other assets. We put a lot of effort and attention to the lore and story as well as the general vibe- that the graphics and soundtrack complement themselves to create the desired tone.\n-A fitting and engaging dynamic Original Soundtrack by Roland Redwood, designed and tailored specifically for the game.\n-Custom inhouse designed visual features: Taking the extra horsepower of computers to good use, the Steam edition of Sinless underwent a serious overhaul. For aesthetic reasons the game was originally designed in a 4:3 aspect ratio. Now, after countless hours of work, all assets have been reworked for a new 3:2 and 16:9 aspect ratio, with even more cool, custom inhouse designed lighting and post effects. We intensified the particle and weather effects as well, as well as reworked other assets to higher resolutions.\n-Game Over: when we said \"old school\" experience we were dead serious. You will die...alot. Well, maybe not that much as in the Souls series, but unless you are a point n' click pro, an unexpected end to your journey will be commonplace. Heck, we even took it a level further where discovering all possible endgames is a feature and accomplishment within itself. Luckily there's a checkpoint system which will take you back to the last safe point. And fear not, we left it at that (so no trolling in the vein of which some old school classics are notorious for ie AITD where you could break a mandatory quest item at the very begining of the game)... but we never can be sure of what the future may bring... ;)\n-Easter egss & references. Yup, we got that covered. Sinless is a love letter to classic games,systems and news, both old and new. Rise of the Dragon, Dredd (2013), Deus Ex, Dark Souls, Sleeping Dogs.... the list goes on and on. Will you find them  all?\n-Stay safe Citizen. And don't forget to install your scheduled Progs!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MGP Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14277,"name":"Final Quest II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4c/f4cb8499aeab0ca2dbd295ee7e026e90.jpg","description":"Final Quest IIReturn to the world of Paylea in Final Quest II. In an action-packed adventure, join Ralph and friends on an epic voyage to find his lost father. Have you got what it takes to confront the Dormai Empire?\nYour actions will define how the story evolves, multiple paths and choices will result in different endings.\nIf you didn't play Final Quest that's OK. Final Quest II is a standalone game. For the best experience in FQII however, we do recommend playing the first game in the series.\nhttp://store.steampowered.com/app/512640/\nFinal Quest II Features:Return to the world of Paylea. Explore and adventure through a vast world with a variety of unique environments\nFind and recruit allies to your team\nUnlock hidden areas with secret passwords\nRecruit monsters to be your pets\nNew treasure hunter system - Dig and find items\nNew Pixel weather system\nMini games\nCollect weapons, armours and secret key items.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RPG Video","platforms":[{"id":0,"name":"PC"}]},{"id":10089,"name":"Ball 3D: Soccer Online","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a5/3a59c74568a14736d44a1df1660c5282.jpg","description":"In Ball 3D you compete online in 7 sports, against up to 30 opponents. We have Racing Soccer, Racing, Soccer, Basketball, Hockey, Handball and Battle Royale. Already played by over 1 000 000 players.Features:\n7 Sports: Racing Soccer, Racing, Soccer, Basketball, Hockey, Handball, Battle Royale\n12 Game Modes\n23 Stadiums\n100% Control\nMultiplayer\nRealistic Physics\nT-Shirts Customization\nReplays\nStatistics\nTraining Bots\nCustom Celebrations","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Unusualsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":484886,"name":"SUCCUBUS: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1de/1de3dfd28d2e8ab5dea539f2129bc6e5.jpg","description":"THE STORY WILL CONTINUE IN SUCCUBUShttps://store.steampowered.com/app/985830/Succubus/\nhttps://store.steampowered.com/app/879420/Agony_UNRATED/\nALSO CHECK OUT THIS HORROR FROM OUR FRIENDS!https://store.steampowered.com/app/1351280/Killing_Stream/\nAbout the GameUNLEASH YOUR RAGE\nBecome a demonic priestess of lust - Vydija, and use her unique skills to take revenge on your enemies.\nRegain your kingdom making hell tremble under your hooves! Leave no one alive if they won't bend the knee.SUCCUBUS: PROLOGUE FEATURES\nThe Succubus Prologue is a part of the full version of the upcoming game - Succubus, and it includes:\n- Two levels from the base game\n- Ranked Arena with global leaderboards\n- Main Hub\n- Weapon and Armor Store\n- Bestiary\n- Interactive world map\n- Diversified opponents\n- Surreal visual setting and goreSURVIVE THE DOWNFALL\nYou are the Succubus – a wild and lustful demon who rejected the role of the queen of the infernal abyss. ­With the disappearance of the legitimate rulers of Hell, the remaining demons recognized Nimrod as their ruler, because he was the only soul who could dominate the mind of the mighty Beast. By raising his new empire from the corpses of sinners, the new king, along with his new queen – you – managed to control the chaos left by former rulers. The life of luxury and walking on rugs sewn from the skins of martyrs was not for you though, and so you have chosen a life in the wilderness. By satisfying your appetites and original instincts, you inflict pain by hurting everyone and everything in your path.\nThe moment you meet the powerful Baphomet who, together with his army, is going to get the soul of Nimrod, you are captured and maimed. Betrayed by your own species you are left with only one goal that matters –  revenge!DOMINATE HELL\nYou are the greatest terror in this brutal world. Teach your opponents that standing in your way is the biggest mistake they could make.\nBecome the judge and the executioner and unleash your rage both on the damned souls and the demons that will challenge you.\nClimb the steep rocks, seduce your opponents and avoid the traps of this living, pulsating hell. Inflict suffering, mutilate, murder and free your wrath to regain your rightful rule of the hellish dominion!UNWIND YOUR SKILLS\nGain experience by killing other beings and then use it to upgrade your basic skills and unlock additional, more powerful and brutal ones.\nEat your opponents' hearts and let the rage come over you and release your pyrokinesis skills!RIP AND TEAR!\nUse your weapons and unique armor to deal with your opponents. Attack enemies with your claws or wield the bone swords, clubs and other weapons you pick from dead enemies!\nMassacre your enemies, leaving behind the ocean of cut limbs and charred corpses.\nRECLAIM YOUR KINGDOM","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Madmind Studio","platforms":[{"id":0,"name":"PC"}]},{"id":56165,"name":"Paper Mario: The Thousand-Year Door","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bab/babed03dbdb81548a84e65437d2bc387.jpg","description":"Paper Mario: The Thousand-Year Door is a role-playing video game developed by Intelligent Systems and published by Nintendo for the GameCube. The Thousand-Year Door is the second Paper Mario game.\nThe Thousand-Year Door borrows many gameplay elements from its predecessor, such as a paper-themed universe and a turn-based battle system with an emphasis on action. For the majority of the game the player controls Mario, although Bowser and Princess Peach are playable at certain points. The plot follows Mario's quest as he tries to retrieve the seven Crystal Stars and rescue Peach from the X-Nauts.\nThe game was well received by critics, attaining an average score of 88 percent from GameRankings. Critics generally praised the game's engaging plot and gameplay, but criticised it for not being a big progression from its predecessor. The Thousand-Year Door won the \"Role Playing Game of the Year\" award at the 2005 Interactive Achievement Awards.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"GameCube"}]},{"id":54531,"name":"Super Smash Bros. (1999)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e56/e56d68182f04f90a31068da55ba91ee4.jpg","description":"Super Smash Bros. is a fighting video game developed by HAL Laboratory and published by Nintendo for the Nintendo 64 home video game console. It was released in Japan on January 21, 1999; in North America on April 26, 1999; and in Europe on November 19, 1999. Super Smash Bros. is the first game in the Super Smash Bros. series.\nThe game is a crossover between many different Nintendo franchises, including Mario, The Legend of Zelda, Star Fox, Donkey Kong, Metroid, Mother, F-Zero, Yoshi, Kirby, and Pokémon. It presents a cast of characters and locations from these franchises and allows players to use each character's unique skill sets and even take advantage of the stage's offensive events to inflict damage, recover health, and ultimately attempt to knock opponent characters off the stage.\nIt received mostly positive reviews from the media and was commercially successful, selling over 5 million copies worldwide by 2001, with 2.93 million sold in the United States and 1.97 million copies sold in Japan. It was given an Editors' Choice award from IGN for the \"Best Fighting Game\". Super Smash Bros. was commercially successful, and became a Nintendo 64 Player's Choice title. Its successor, Super Smash Bros. Melee, was released for the GameCube in 2001. The game spawned a series of sequels for each successive Nintendo console.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"HAL Laboratory","platforms":[{"id":0,"name":"Nintendo 64"}]}]