[{"id":4856,"name":"HOARD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87f/87fd7f7312a5382dfe31fe9cf538d1c7.jpg","description":"HOARD is an arcade action game, set in a fantasy world, where the player will take control of a mighty dragon. The game’s overall main goal is to collect treasure for the dragon’s hoard, as the name implies.\nThe gameplay is based around moving through different landscapes, burning down villages, collecting gold troves and kidnapping members of the local royal family, a classic dragon activity. However, the player needs to defend his character’s lair from daring adventurers. Knights set out on a quest of saving the beautiful princess,  and many more creatures with a common goal of defeating the dragon, which would be you. With level progression, players can upgrade different parameters of their scaled protagonist and improve their gold acquiring capabilities. \nThe game offers four game modes, with cooperative multiplayer gradually increasing the difficulty and the overall fun of each playthrough. The graphics are unique in the way where the game field looks like a board game table, with castles and villages placed around differently each time, and the overall look of the game is as if it was a D&D game that suddenly became alive.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Big Sandwich Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4569,"name":"Worms Crazy Golf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/770/77073b0bdeed847fdaad4f58175bc898.jpeg","description":"A golfing spin-off in the famous Worms series. Worms Crazy Golf - it's a familiar mix of the main series gameplay and classic golf transforming the latter into turn-based madness. Now the main goal is not to destroy all of the enemy’s worms. The goal is to get into the hole with fewer strikes. The game is a continuation of the mobile-exclusive Worms Golf and adaptation of the format on the PC.\n\nThe player takes control of the worm, which appears on the 2D battlefield. The goal is to drive the ball into the hole. Sometimes on the way, there are explosive sheep that explode to shreds in a collision and other obstacles to overcome. Visually, the game is reminiscent of the game series of the era of 2D Worms 2: Armageddon and Worms Reloaded.\n\nFor a single completion, there are 3x 18 holes courses all with its own visual style and challenges. As well as 15 challenges without complete courses. Also, there is multiplayer available for up to four players on the same device with the alternate right of turn. Worms can be customized to your taste. To do this, you must earn in-game cash to spend it on cosmetic items.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":1607,"name":"Beatbuddy: Tale of the Guardians","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b86/b865701cd371432f003768598039700f.jpg","description":"Beatbuddy: Tale of the Guardians is a rhythm-adventure centered around following the beat while traveling through levels. Its developer is Threaks, indie studios specializing on a single-title IPs. The game's universe includes one more title: Beatbuddy: On Tour, featuring the same world, but different beats and levels. \nThe plot follows no cliffhangers or dramatic turns of events. The story is about trying to save the Music from Maestro Prince, wanting to destroy all beats in the universe. Throughout the game, the player encounters NPC and bosses, all of them needs to be destroyed along with elegant beats. \nThe gameplay includes typical platforming and adventure section — most of the time the players float around the six worlds, with each of them divided into five parts and collects beat parts. One of the exciting features is the unique musical theme to each main character: given the soundtrack composed out of different tunes, it is a remarkable highlight.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Threaks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":22256,"name":"FAR: Lone Sails","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/da3/da340206898d0a62a944dc7fb0629008.jpg","description":"»FAR: Lone Sails« is a vehicle adventure game. In an unlikely vehicle you travel across an ocean turned desert following the tracks of a once flourishing civilization. Through an array of roadblocks and through hazardous weather you need to keep your vessel going. Where will this journey take you? Are you the last of your kind?Key FeaturesChallenging vehicle gameplay: Maintain and upgrade your vessel to overcome numerous obstacles and natural hazards.\r\nA unique world to discover: Explore a desolate dried-out seabed, follow the trails of your people and find fascinating relics and buildings, that tell the story of a civilization on the run.\r\nImmersive experience: Revel in astoundingly beautiful landscapes and indulge in the intricate, yet soothing soundtrack.\r\nA Zombie-free Post-Apocalypse: No violence, gore or death – it’s just you and your machine vs. the big nothing.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Okomotive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":450236,"name":"Delores: A Thimbleweed Park Mini-Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/764/7640e2f467e9c14e095492aa76b72c31.jpg","description":"The year is 1988. Adventure game developer Delores Edmund, on hiatus from her job at MMucasFlem Games, has returned to Thimbleweed Park for a quick vacation. While she’s home, she’s making some extra money as a photographer for the Thimbleweed Nickel News. Hey, game developers need to eat, too!\nThimbleweed Park hasn’t changed at all in the year since Delores has been away… or has it?\n…Since when is the S&D Diner a five-star establishment?\n…When did the PillowBear™ become all the rage?\n…Why is Ransome the Clown suddenly winning humanitarian awards?\n…How come no one seems to remember that dead body that turned up under the bridge a year ago?\n…Can Thimbleweed Park get any stranger?!.\nIn a town like Thimbleweed Park, a side career in photojournalism is the least of your problems...\nDelores: A Thimbleweed Park Mini-Adventure started out as a prototype for Ron Gilbert’s new point-and-click adventure game engine and grew into a fun little game. It is not a sequel to Thimbleweed Park and is probably missing all of the small bells and whistles that would make it a commercially viable game.\nThis was a challenging game to make because we had to use almost exclusively “found art” from Thimbleweed Park to create all new puzzles. Also because we couldn’t go outside IRL.\nAs a thank you to our fans, we are releasing it for free as something you can have fun with in these odd times. You don’t have to have played Thimbleweed Park to enjoy this mini-adventure. (But if you do enjoy it, why not check out Thimbleweed Park, hmm?)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Terrible Toybox","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19437,"name":"Lost Planet: Extreme Condition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/71a/71a5d314d010c818dbe105ce09f6b2c0.jpg","description":"Lost Planet: Extreme Condition is a third-person shooter game developed by Capcom.\n\n###Plot\nIn the distant future, it is no longer possible to live on Earth. The NEVEC corporation plans to colonize a distant planet of E.D.N. III. Upon arriving on its surface, the NEVEC forces are met with resistance from an alien race called the Acrid and is forced to leave the planet. A second attempt to colonize E.D.N. is taken by NEVEC which has been preparing for the assault. It is revealed that the Acrid contain thermal energy within them. This energy is essential for the colonists' survival on the planet. Civilian colonists and soldiers call themselves the Snow Pirates and try to make the planet habitable.\n\n###Gameplay\nIt is possible to play the game either in first-person or third-person modes. The players are able to travel the in-game world on foot or using mechs that are equipped with heavy weapons such as the Gatling machine gun or rocket launchers.\n\nThermal energy is used for powering the mechs and several weapons. The players have to keep an eye out on their energy level as the planet's harsh conditions and bad weather drain it down. In order to get more thermal energy, the players have to kill the Acrid or activate the data transfer posts. If the player has no thermal energy left, they die.\n\nThe game also features a multiplayer mode. For game modes are present, and the depletion of the player's thermal energy reserve does not result in instant death.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":17633,"name":"Stealth Bastard Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/341/341b452d2f747c3cf126cd43c392c450.jpg","description":"###Do I have to pay?\nSimilar at the same time to Metal Gear Solid and Super Meat Boy 2D platformer, is a classic example of the game in the genre of stealth puzzle. Originally the game was released in November 2011 for Windows and was free. Later the game appeared on Steam in the extended Deluxe edition, which included the original game, the soundtrack and the DLC of Teleporter Chambers.\n\n###Fast paced stealth\nEach level of the game is a streak of obstacles, which requires the player to the accuracy of the pixel while moving forward in the shadow. The game has a dynamic lighting system, so it will not work staying long in one place. Developers have added this system in order to speed up the game process: they do like stealth games, but don’t like their speed.\n\n###Key Features\nIn the singleplayer campaign, there are 80 levels in eight worlds, tons of puzzles and enemies. The player in the arsenal has nothing but a pair of night vision goggles, so you have to rely solely on stealth to make your way through the levels. Clashing with enemies means instant death and start over from the very beginning. The dynamic light system completes the hardcore experience that is this game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Curve Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13467,"name":"Total War: ROME II - Emperor Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ec/9ec54f5bc04a831b1319d55ff47f51d7.jpeg","description":"Total War: ROME II - Emperor Edition is a strategy game developed by Creative Assembly. It is the eighth game in the Total War series and is both a sequel and a remaster to Rome: Total War.\n\n###Plot\nThe game does not feature a specific story mode, yet it offers a set of historical campaigns for the players to go through. Most of such campaigns revolve around the reign of Caesar and his military campaigns. \n\n###Gameplay\nIn Total War: ROME II, the players control armies of the Roman Empire era. It is completely up to the player how to form an army and its navy. \n\nThe formations of armies and navies have changeable stances on the game world's map. These stances define what distance can the army traverse in one turn and the time required for the troops to prepare an ambush. \n\nAt the beginning of each scenario, the players pick a faction to play as. Each faction has a specific amount of power called “Imperium.” It specifies how many armies can a faction have and can be gained by conquering nearby lands and getting gold. After forming an army, it is up to the player to assign a general to it. Upon doing that, the general will recruit the soldiers for his army. Both armies and generals can be leveled up which unlocks new skills and traits.\n\n###Emperor Edition features\nEmperor Edition was available as a bundle in retail stores. 22000 bundles were released. This edition features a unique box, playing dice, the map of Roman Empire, a map pack, and a Legendary Edition of the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Creative Assembly","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":58809,"name":"The Forgotten City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6e9/6e9136f09bb9daaaed5a0e6d508028b4.jpg","description":"The Forgotten City is a game about time travel, a mysterious murder, and avoiding fate. It is based on an award-winning Skyrim mode of the same name. The game retains most of the original mod's lore, but reimagines the characters and the setting and features a completely new voice acting and a music score. The game is powered by Unreal Engine.\n\n###Plot\nThe game is set in a mythological ancient Roman city somewhere deep underground. A group of 26 archeologists explored the city until one of them accidentally broke a taboo and activated an ancient curse. Now they are trapped in a time loop and cursed to die and relive their deaths forever. That is, unless one of them changes what happened to the city and its inhabitants long ago, thus preventing the curse.  In the ruins, there's a portal, which leads to the past and allows the characters to relive and alter the previous events in the vein of The Groundhog Day movie. The Forgotten City features branching non-linear plots with difficult moral dilemmas and plot twists. There are multiple endings that depend on the player's actions.\n\n###Gameplay\nThe player controls a protagonist that is fully customizable, up to his or her sex and physical appearance, in a 3D ancient city. Compared to the original mod, the game introduces new combat mechanics and wall climbing. However, most of the gameplay is based around characters' interactions and timeline manipulations.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Modern Storyteller","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":15167,"name":"HuniePop","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/39c/39ce4d47f0be643164a94e5a22f199df.jpg","description":"HuniePop is a unique sim experience for PC, Mac and Linux. It's a gameplay first approach that's part dating sim, part puzzle game, with light RPG elements, a visual novel style of presentation, an abrasive western writing style and plenty of \"plot\".\nAfter a pathetic attempt to try and pick up Kyu, a magic love fairy in disguise, she decides to take you under her wing and help you out with your crippling inability to meet new women. After a few dating lessons and some sound advice, Kyu sends you out into the world ready to take on the dating world and a wide cast of beautiful babes.\n8 gorgeous girls each with their own personalities, preferences and style. (Rumor has it there are several secret characters to unlock as well!)\nMore than 20 in-game locations each with beautiful hand painted environment art and many with full day/night cycles.\nOver 250 unique items (food, drinks, gifts, accessories) that you can purchase, unlock, collect and give as gifts.\nA beautifully composed soundtrack containing over 20 tracks of original music inspired by eastern pop, jazz and bossa nova melodies.\nThousands of lines of dialog, fully and professionally voice acted, complete with a unique character lip-syncing system.\nCustomize girls' appearances with unlockable outfits and hairstyles! The girls will also dress up for dates! (Or dress down afterwards...)\nCollect nearly 50 stunning CG photos depicting the girls in various scenarios, including steamy bedroom scenes.\nAn addicting match-3 style puzzle dating system with it's own unique twists including upgradeable traits/stats, the ability to move any number of positions and special date gifts that have a variety of interesting effects on the puzzle.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"HuniePot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":46239,"name":"Project Mercury","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/730/730095db6f72b90dd3387e4886011d69.jpg","description":"The challenge is Project Mercury. The power is Raxasoft. Make your way on foot, on a hoverbike, up skyscrapers, and down bottomless pits, as you exterminate a threat of unknown origin!\nStory\nIn the not too distant future, a crack commando unit is sent to investigate an outbreak of mysterious creatures known only as Mercury.\nSeveral days go by without contact.\nYou have been tasked with determining the fate of the crack commando unit, exterminating the threat, and restoring order to a land plagued by the Mercury menace!\nGame Features\nEight stages that will put you on foot, riding on a hoverbike, scaling skyscrapers, and floating down chasms.\nState-of-the-Art high fidelity graphics at a 256x224 native resolution.\nA rich soundtrack that only five-channel chipmusic can provide.\nNine boss battles to make your blood boil.\nThree weapons modules to help you on your mission.\nBattery-powered save features to keep your progress.\nAchievements to document your effectiveness in the field.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Raxasoft Games","platforms":[{"id":0,"name":"PC"}]},{"id":11514,"name":"The Descendant","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/36d/36d3861a6cdb4ae5b1ca44cec814be8b.jpg","description":"THE DESCENDANT is a five part episodic adventure game series where the end of the world is only the start.\nAfter climate change wrecked the planet, a man-made extinction event wiped humankind off the face of the Earth. Only a few thousand ‘descendants of humanity’ were hand-picked to survive the apocalypse, cryogenically suspended in underground bunkers known as Arks.\nCenturies passed. The world recovered from the nuclear holocaust, and all the Arks reopened, except one — Ark-01.\nTaking place across two timelines, in the past you'll play as Mia, a janitor tasked with keeping the precious descendants housed within Ark-01 alive while the facility continually fails around her, and in the present, you'll play as Donnie, one of the investigators trying to rescue any surviving descendants trapped within, all while discovering a far greater conspiracy buried within the underground Ark complex.\nEvery action and choice you make directly impacts who lives and who dies, leaving the fate of Ark-01, and mankind itself, in your hands. Will you save mankind? Or doom us all?Key featuresAn episodic  adventure spreading across multiple story-rich timelines\nInvestigative gameplay, challenging puzzles, tense action sequences\nMeaningful and difficult choices with branching dialogue\nA tailored experience, full of tension and drama\nEvery player choice can influence the future of mankind","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Gaming Corps","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":486733,"name":"ReCore: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d76/d76bd51161884d729ceac7e98eacde80.jpg","description":"The story tracks Joule Adams, one of the first volunteers for the utopian colony of Far Eden, who wakes after centuries in cryo-sleep to find that nothing has gone according to plan. With her three robotic machines known as corebot companions, Joule ventures throughout Far Eden to uncover the secrets behind the failed mission. The open world of Far Eden is subject to exploration and the collection of resources. Joule's weapons are color-coded to inflict damage on a particular set of enemies and, like her companions, can also be enhanced. The corebots support her in battle and puzzle solving.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Armature Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":16192,"name":"Galactic Civilizations I: Ultimate Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39c/39c349127d69ef1b79d5819404ebd532.jpg","description":"Galactic Civilization is the first one in the series of turn-based strategy video games. After the invention of the Hyperdrive by the Terran Alliance the technology was shared four other races, but as a result, the contact with them was lost, starting the beginning of the intergalactic race to colonize and populate the systems with class 15 or better types of planets. At the beginning of the game, players will have to choose a political party that will provide hints, and chooses the intelligence of the rival races. \nPlayers will command the humanity on its way to the stars, and in order to achieve this victory, the player has four ways to go: Political, Technological, Cultural, and Conquest, all of which can be reached through the control of the resources and how they are used. Ultimate edition includes the Altarian Prophecy expansion. Galactic Civilizations offer various editors that will allow players to create their custom maps, custom game environments, and entire campaigns.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":638648,"name":"Greak: Memories of Azur","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/102/102b3f5639c57ca39e96ea1cb554f9e2.jpg","description":"Greak: Memories of Azur is a side scrolling single-player game with hand-drawn animations. You will take the role of three siblings: Greak, Adara and Raydel to guide them through the lands of Azur. Alternate control between them and use their unique abilities to escape from the Urlag invasion.\n\nGreak is the name of the main character, and the smallest brother of three. He belongs to a magical race called the Courines, which are currently under the attack of an enemy invasion from a faction called the Urlags.\n\nThis battle has been going on for a long time, and the Courines are starting to flee their own lands. Greak's goal is to reunite with his brother (Raydel) and his sister (Adara) and then escape the lands of Azur by Building an Airship piece by piece.\n\nThroughout the game, you will find each sibling in different scenarios, and once you do, they will join the adventure and help you progress through the game.\n\nKey Features:\n\nHand-Drawn Art and Animation: Enjoy a captivating story line about family, home and union in difficult times while you discover colorful and expressive scenarios.\n\n\nSpecially Crafted Puzzles: Solve specially crafted puzzles to find and collect the missing pieces of an Airship through an Interconnected World.\n\n\nUnique Gameplay: Alternate between the three characters and use their different abilities to explore the Magical lands of Azur.\n\n\nFast- Paced Combat: Discover new areas and fight against a wide variety of enemies to rescue the Courines from the Urlag invasion.\n\n\nCinematic Clips: Throughout the game, you will encounter beautiful hand-drawn cinematic clips that will accompany key story moments to immerse you into the world of Azur.\n\n\nLive Orchestra Soundtrack: Enjoy the expressive and atmospheric music themes specially created to experience a unique adventure.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Navegante Entertainment","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":18721,"name":"MX vs. ATV Reflex","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0f/b0fdf6e6b6b12f3b616db83608f0d794.jpg","description":"MX vs. ATV Reflex is the third installment in the MX vs. ATV series of the off-road racing games.\n\n###Gameplay\nThe player can compete in a motocross race. There are several types of vehicles available, from the mountain motorcycles to all-terrain quadricycles and buggies. The game features multiple modes and \"events\", including Omnicross, Champion Sports Track, Free Ride, Freestyle, and Supercross. There's also the Motorcareer mode that takes the player through most of the events mentioned above. The roster of tracks includes environments like forests, hills, and deserts, with terrains like mud, sand, or snow. \n\n###Differences from the previous games\nMX vs. ATV Reflex introduced a new control system designed specifically to improve jumps and stunt tricks. The game uses dual stick wielding, where one stick controls the vehicle itself and the other controls the driver. Driving the bike requires to perfectly balance the rider's weight to avoid the fall.\n\nAnother new feature of the third game is its destructible terrain. While passing on a track, the vehicles will spill the ground and leave deep ruts. This makes every track's relief dynamic and unpredictable. New bumps and holes can appear at every lap.\n\n###Multiplayer\nThe game has many multiplayer options. Those include split-screen, local, and online modes, the latter allows up to 12 players to participate. The results of online races are recorded to keep track of each player’s experience and allow the players to level up.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox One"}]},{"id":284,"name":"Torment: Tides of Numenera","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/570/5705f063e549547b22db00b643619388.jpg","description":"Torment: Tides of Numenera is a role-playing game developed by inXile Entertainment in 2017. \n\n###Plot \nThe action takes place in a fantasy setting, a distant future representation called Numenera. The current age of the action is called the Ninth World, as the characters believe it to be the successor of the past civilizations. The protagonist is the Last Castoff, an ancient man who left his physical body to reborn in a new one. He is a creation of the so-called Changing God. His actions attract the Sorrow, the antipode who tries to destroy the protagonist and other God’s creations. To survive, the Last Castoff has to find his creator. The player aims to explore the Ninth World, find other creatures and confront the Sorrow. \n\n###Gameplay \nThe player act from the Last Castoff perspective. He has the opportunity to perform in different ways; either peacefully – making arrangements with other characters, or hostilely – fighting with enemies and using power to negotiate. The setting is performed in the isometric perspective, and every performance is supported by the theme music and dialogues between the characters. \n\n###Key features \nTorment: Tides of Numenera is believed to be another game’s spiritual successor. It is called Planescape: Torment which was developed in 1999. Just like in its predecessor, Torment places emphasis on the story rather than on combat or item accumulation.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Techland","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":60028,"name":"Age of Wonders: Planetfall","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a9/3a9566438d476090bc19b29b03b77692.jpg","description":"Age of Wonders: Planetfall is the new strategy game from Triumph Studios, creators of the critically acclaimed Age of Wonders and Overlord series, bringing all the exciting tactical-turn based combat and in-depth 4X empire building of its predecessors to space in an all-new sci-fi setting.\n\nEmerge from the cosmic dark age of a fallen galactic empire to craft a new future for your people. Explore the planetary ruins and encounter other surviving factions that have each evolved in their own way, as you unravel the history of a shattered civilization. Fight, build, negotiate and technologically advance your way to utopia, in a deep single player campaign, on random maps and against friends in multiplayer.\n\n## Tactical Turn-Based Sci-Fi Combat\n\nPerfect your combat strategy in intense turn-based battles that offer tactical challenges, a large cast of races, units with customizable weapons, and destructible environments.\n\n## Discover a Rich Science Fiction World\n\nUncover the history of the fallen galactic empire as you explore lush landscapes, and experience the emergent story. Encounter NPC factions and rival houses, and discover hidden technologies that can strengthen your society and give you advantage over enemies.\n\n## Planetary Empire Building\n\nCreate your own unique House, and build prosperous colonies through economic specializations of planetary sectors and governing doctrines.Multiple Paths to VictoryAchieve your end goals through conquest, diplomacy or doomsday technologies. Engrossing options with NPC factions and rival Houses won’t make the decisions easy!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Triumph Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":44996,"name":"Descenders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9f/b9f558ec74f8519b7fa325175c0a65b0.jpg","description":"From the developers of Action Henk, Descenders is a fast-paced extreme downhill biking game that's easy to pick up, but difficult to master.\r\nProcedurally generated worlds: Take on different jumps, slopes and hillbombs every time you play\r\nFreestyle bike controls: Control every subtle movement of your rider, with an in-depth physics system made for slick whips and scrubs\r\nRisk vs reward: Push your rider for massive scores and combos -- but bail too many times and you might lose it all\r\nBuild your Rep: A fully-featured online Rep system lets you show off your worth, and earn new bikes and threads\r\nBecome the next Descender: Can you survive the game in a single run, and reach the ranks of the legendary Descenders?Pick a Team, Become a LegendIn Descenders, your team is your life. When you pick a side -- Enemy, Arboreal or Kinetic -- you'll be bound together with other players who choose the same side as you.\r\nGrab your bike, pick your team, and attempt to live up to the legend of your Descender. Will you join the die-hard, trick-frenzy ranks of Team Enemy, the proficient, off-road stylings of Team Arboreal, or the high-octane, speed-is-everything Team Kinetic?\r\nWear your team's colors and apparel with pride, and receive exclusive team gear\r\nYour Rep points go towards your team's total Rep, and exclusive prizes are awarded to the top team\r\nHang out with your team-mates in the Descenders Overworld, then spectate their runs and cheer them on\r\nGain access to your team's exclusive channel on the Descenders Discord server","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"RageSquid","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":1257,"name":"Virginia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf8/cf85d2102e090328048158443490f779.jpg","description":"Virginia is a silent game that offers the player to become an FBI detective and solve a mystery. It was inspired by supernatural thrillers like Twin Peaks and X-Files.\n\n###Plot\nAs its name suggests, the game is set in Virginia, in a fictional country town called Kingdom. A small boy named Lucas Fairfax disappeared recently. The main protagonist, a young and inexperienced FBI agent Anne Tarver, has to uncover the mystery and find the child. Since she lacks the necessary experience, Tarver is accompanied by a higher ranking agent Maria Halperin. The two don't trust each other, but they have to overcome their differences and work together.\n\n###Gameplay\nVirginia's gameplay is similar to interactive movies and \"walking simulators.\" The player controls Anne and travels around the city, accompanied by Halperin, to find clues and learn more about what's going on in the city. The player has no actual control over the actions of the protagonist. Instead, he or she can only navigate Tarver over the city and then watch her act. The game is very short, and two hours is usually enough to complete it.\n\n###Style\nThe game is made in an intentionally low-poly visual style. There are no dialogues, neither in subtitles nor voice acting. The player can only understand the narrative through the facial expressions and body language of the characters, as well as the other clues.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9616,"name":"Heroine's Quest: The Herald of Ragnarok","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d80/d80c04d1e76c1b53141c2b72ffaafdfb.jpg","description":"Heroine's Quest: The Herald of Ragnarok is a 2D adventure RPG with a high focus on depicting Norse mythological tradition.\n\n###Gameplay\nThe player follows the path of Heroine through the number of 2D pixel-art locations stylized for 90s games. The RPG element brings classes, skill trees, and looting system into the title. The available classes are warrior, mage, and thief.\nOne of the main focuses is on the realism — the game features a vast variety of deaths, for instance, death from frostbite if the character does not dress well; death from hunger in case the protagonist forgot to eat, and death from poisoning if the hero ate a suspicious flower in a middle of a woods.\nThe battles are not of the primary locus here — nonetheless, the system is simple and concentrated on hitting, casting spells and dodging in the appropriate time. \n\n###Plot\nThe player follows a storyline of a heroine who is destined to prevent Ragnarok — the death of all the living creatures according to the Norse mythology. The Valhalla stories, as well as the Tales of Nine Worlds here, are cleverly mixed-up with the postmodernist gags, forth wall-breaks, and even Harry Potter references. The game's source of inspiration is often confused with Skyrim. However, the developers say, that story resembles Quest for Glory in various ways.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Crystal Shard","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":1314,"name":"BioShock: The Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abd/abd7b98d0ebe13e7e8f2b3bb8300bc0b.jpg","description":"Return to the cities of Rapture and Columbia and experience the award-winning BioShock franchise like never before. BioShock: The Collection retells the epic journeys of the BioShock universe beautifully remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content, the “Columbia’s Finest” pack, and Director’s Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson.\n1 Player\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Take-Two Interactive Software, Inc. and its subsidiaries. Take-Two Interactive, BioShock, BioShock Infinite, 2K, Irrational Games, and respective logos are all registered trademarks or trademarks of Take-Two Interactive Software, Inc. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"2K","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":11025,"name":"Totally Accurate Battle Simulator","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c76/c7664fff1b8665c1be4c665950d85878.jpg","description":"Totally Accurate Battle Simulator is a wacky physics-based tactics game.\r\nExperience accurate warfare through the ages. From medieval peasants to modern-day advanced weaponry, TABS uses state of the art physics-based simulation to provide you with never-before-seen insight to our greatest battles of history.\r\n- \"This doesn't look like real history at all\"\r\n- \"At least the helmets look correct\"\r\n- \"What are you doing in my office? GET OUT\"","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Landfall","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":53551,"name":"Sonic the Hedgehog (1991)","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/373/373a9a1f664de6e4c31f08644729e2db.jpg","description":"Sonic The Hedgehog is a 2D platform game, the first installment in Sega’s Sonic the Hedgehog series. \n\n###Plot \nThe game takes place on South Island and follows Sonic — an anthropomorphic blue hedgehog. The game’s antagonist, a brilliant but insane scientist Dr. Robotnik attempts to take possession of the power of six Chaos Emeralds by entrapping South Island’s animal inhabitants inside hostile robots. Sonic decides to hinder Robotnik’s plans by freeing animals and collecting the emeralds himself.  \n\n###Gameplay \nThe game consists of six zones each of which is divided into three acts. In the first two acts, your goal is to reach the finish while the third act ends with a boss fight against Dr. Robotnik. After completing the sixth zone, you enter the Final Zone which consists of one act and the final battle against Robotnik. The level in the game is usually relatively roomy and implicate various ways of completing. The gameplay is centered on Sonic’s ability to run at high speed. Thereby the levels involve many slopes, loops, springs. Sonic can use Spin Attack to attack enemies or destroy certain obstacles.\nThe Spin Attack can be activated by gaining high speed while rolling on the ground or jumping. The players’ health depends on the main collectibles of the game – golden rings placed throughout the levels and collecting one hundred of them gives you an extra life. Also, as long as Sonic has at least one ring, upon getting hit he scatters rings instead of losing a life.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Gear"}]},{"id":45635,"name":"Shadows: Awakening","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/998/9988525895232b81618aa7eb2b844002.jpg","description":"Feature List\nExtensive Gameplay – 40+ hours for a single playthrough, but with substantial options for replayability.\nTwo Worlds – A parallel universe inhabited by ghosts and spirits; seamlessly switch between the Shadow Realm and the mortal plane and witness a gripping storyline in a world full of myths, destinies and legendary creatures.\nReal-Time Tactical Combat – Combine the skills of your various characters to maximize the effects of your devastating skills and spells.\nUnique Party System – multiple characters in one demon, each retaining their own personalities. Internal dialogues, rivalries and communication between the characters enriches the gameplay experience and narrative.\nA plethora of different characters – Choose from 3 heroes, each with their own stories, personal quests and dialogues. Consume the souls of 15 playable characters, each with their own unique skillsets, like Kalig the Bandit King and Evia, Daughter of Fire.\nSynergy System – The complex talent system intuitively combines skills from your characters to create a variety of new gameplay possibilities.\nChallenging Puzzles – Challenging puzzles are scattered throughout the game, from the rustic towns to the deepest dungeons.\nCrafting and Looting System – Expanded crafting and looting system will let you use rewards to configure the ultimate adventurer.\nFully Voiced – All dialogues are fully narrated, including actors like Tom Baker.\nAbout the Game\n“An ancient proverb warns: ‘Never trust a demon, for betrayal is their very blood’.\nYet the Sura, the great ogres of the Wastes, have a different saying: ‘A demon honours its pact’. Perhaps when the race of men looks into the eyes of hell, they see their own darkness reflected…”\n– Carissa Cantrecht\nShadows: Awakening is the new adventure in the Heretic Kingdoms saga. After the members of the secret council known as the Penta Nera are assassinated, their souls are consumed by the Devourers – evil demons which possess the ability to absorb the memories and personalities of the souls they acquire and materialize them as their puppets. Re-emerging into the mortal realm once again, the demonic Penta Nera continue their quest for power and immortality, but at what cost?\nShadows: Awakening is a unique, isometric single-player RPG with real-time tactical combat. You take control of a demon summoned from the Shadow Realm – the Devourer – to consume the souls of long-dead heroes and embark on an epic adventure with challenging gameplay, a gripping storyline and enchanting graphics. Do you have the focus and wits to master the world of the Heretic Kingdoms? Gather your party, control powerful heroes and use their skills to your advantage. But who is in charge… the demon, or the souls that it has devoured? It's up to you to either thwart a major threat and save the world, or to plunge it into complete disaster…","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":18850,"name":"Hector: Badge of Carnage - Full Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/605/6051912c710bef83cb1923281fe9aea8.jpg","description":"Hector Badge of Carnage Full Series is a three-part episodic game that follows Hector, an alcoholic detective with a tough character and strange habits. While the game is split into episodes that were released as separate titles, it has a single plot: Hector investigates the case that can be solved only with his unconventional methods.\n\nThe story starts with Hector holding negotiations with a terrorist who took hostages. The sniper wants the protagonist to complete quests around the town. These missions are quite humorous and include such tasks as fixing the town clock and shutting down a pornography store. Because of such humor the game with 2D cartoonish graphics is not allowed for kids. \n\nHector features point-and-click gameplay with a heavy focus on dialogues and less - on puzzle solving. Not all solutions in the game are obvious but, as a rule, you don’t have many items to use so variations of your actions are quite limited. Another situation is with dialogues: choosing the right lines simplifies completing quests, as Hector can solve almost any problem talking to other characters in a suitable manner.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Straandlooper","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14938,"name":"Sonic the Hedgehog 4 - Episode I","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b55/b55aebdabe22bdff8136007e4b6eef58.jpg","description":"The sequel fans have waited 16 years for is finally here - Sonic the Hedgehog 4 Episode I! Featuring enhanced gameplay elements, including the classic Sonic Spin Dash, and the versatile Homing Attack, Sonic the Hedgehog 4 Episode I picks up right where Sonic and Knuckles™ left off. Dr. Eggman’s back, and in an effort to finally rid himself of Sonic, he revisits – and improves – the very best of his creations. Get ready for the next chapter in an all new epic 2D saga built for old and new fans alike.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":292842,"name":"The Legend of Zelda: Link's Awakening (2019)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1bb/1bb38f1354db6596ccd6bdcb4a7f6cbc.jpg","description":"In this modern re-imagining, players travel to the mysterious island of Koholint to guide Link on a perilous adventure.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Grezzo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":2898,"name":"The Deadly Tower of Monsters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c14/c1484e3baaa7a2c048d457c8a55980ef.jpg","description":"This is a top-down shooter with stick controls and hand-to-hand combat. The player has jet-pack for additional maneuverability. The plot of the game tells about three actors and the film of the same name. The story told in the visual style inspired by 50s American science fiction.\r\n\r\nSpace Explorer Dick Starspeed was wrecked on a mysterious planet. To find parts for a broken ship and his faithful assistant Robot, Dick goes on a dangerous journey across an unknown planet. The game presents a very diverse set of weapons: ray guns, crystal swords, and laser whips. All devices in the game can be improved with the help of spare parts found on the levels.\r\n\r\nThe game focuses on the movie style: in the settings, you can turn on the comments of the alleged director of the film. They are the link between the setting, the characters and the events that take place on the set. In addition to the story campaign, the game has a Survival mode, which is entirely independent. The player receives some gold and weapons and is surrounded by enemies in the arena. A full-fledged multiplayer is not here, but the game still can be played on one device in a cooperative mode.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ACE Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":40746,"name":"RuneScape","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/007/0073b6418763a47eb023fba88cb22e7c.jpg","description":"RuneScape takes place in the world of Gielinor, a medieval fantasy realm divided into different kingdoms, regions, and cities. Players can travel throughout Gielinor via a number of methods including on foot, magical spells, or charter ships. Each region offers different types of monsters, resources, and quests to challenge players.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Jagex","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":374548,"name":"Between Two Castles - Digital Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6a/f6a9adf8aaf01ab0c8e17e221378e9a2.jpg","description":"The Mad King Ludwig demands castles! Lots of them. Between Two Castles of Mad King Ludwig - Digital Edition brings the delightful experience of the original board game, from Stonemaier Games, to your computer!\nDesigned by Ben Rosset & Matthew O’Malley, Between Two Castles puts you in the role of a world-renowned master builder working for the Mad King. Projects of such significance require the expertise of more than one person, so for each assignment you are paired with another master builder to execute your grandiose plans.\nIn this game, you cooperate to compete - or is it the other way around?\nYou have to work together with your peers, but in the end, there's only one winner! Plan your moves and balance your castles wisely.\nBring your friends, train with AI or challenge players around the world!Main Features of the GameBuild unique and procedural castles!\nTile-drafting mechanics, each tile type scores differently\nPlay against easier AI for casual fun or tougher AI to train for online matches\nPlay online matches with your friends or players all around the world\nBeautifully stylized graphics","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Daisu Games","platforms":[{"id":0,"name":"PC"}]},{"id":18972,"name":"Transmissions: Element 120","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78f/78f5eec9a91020e96a2f279ec366fc6b.jpg","description":"Transmissions: Element 120 is a Half-Life 2 mod that allows the player to use a \"rocket jump\" type of a gun. It is named after Unbinilium, a hypothetical element in the periodical table, that is used to power the weapon. The game features Half-Life's trademark gritty industrial aesthetics and certain horror elements.\n\n###Premise\nThe player's character is armed with a new type of weapon, Zero Point Energy Projector. The device allows its user to perform incredibly high jumps and survive landing after seemingly fatal falls. To achieve this effects, the player has to fire the weapon down while in the air, essentially performing a rocket jump. The weapon's energy beams can also be used to eliminate obstacles and opponents. To let the player make more use of it, the creator made most of the environment destructible. There are also the traditional Half-Life enemies, such as zombies, headcrabs, and Combine Soldiers. The mod is single player only.\n\n###Plot\nTransmissions: Element 120 is short and features a very little story. All narrative is delivered through action. It is only clear that game is set in the Half-Life universe, some time after the events of Half-Life 2: Episode Two. The nameless main character finds itself in an abandoned facility and has to fight his or her way out. There are diary pages and QR-codes scattered around the facility that provide cryptic messages and a little insight into the events. Some of them also serve as the clues to help the player to solve certain puzzles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Shokunin","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":82,"name":"Rain World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca0/ca0ad22b04fbee26188c02be4d03ab52.jpg","description":"You are a slugcat. The world around you is full of danger, and you must face it – alone. Separated from your family in a devastating flood, you must hunt for food and shelter between terrifying torrential downpours that threaten to drown all life. Climb through the ruins of an ancient civilization, evade the jaws of vicious predators, and discover new lands teeming with strange creatures and buried mysteries. Find your family before death finds you!\nInspired by the simplicity and aesthetics of 16-bit classics, this survival platformer requires fast-paced sneaking, both upon your own prey and past the jaws of hungry predators. Each ravenous foe in your path will be cunning, vicious and always on the hunt – eager to sink their teeth into you, or even each other. As a small, soft slugcat you must to rely on stealth and wit rather than force: learn the ecosystem and turn their strengths to your advantage. Maybe then you can survive… Rain World!\nSneak, climb, and pounce your way through a dynamic, ever-changing ecosystem of predators and prey\nExplore a vast world of over 1600 rooms, spanning 12 diverse regions filled with ancient secrets and undiscovered dangers\nNimble movements and procedurally generated animation gives slugcat a natural fluidity of movement and unique sense of weight\nIntense, primal predator encounters will challenge your reflexes\nLimited resources and the constant, impending threat of rain will test your nerve","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Adult Swim","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":5529,"name":"Castlevania: Lords of Shadow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/16d/16d7322b388ee408711e68f390afe5c0.jpg","description":"Castlevania: Lords of Shadow is a slasher game developed by MercurySteam. It is a reboot of the Castlevania game series.\n\n###Plot\nThe game takes place in a fantasy version of a middle age Europe. A member of the group of knights, calling themselves the Brotherhood of Light, defends common people from supernatural creatures. His wife was murdered by one of them, but her soul is trapped between the worlds. She comes back to her husband Gabriel and guides him to the God Masks that can bring her back to life.\n\n###Gameplay\nCastlevania: Lords of Shadow is a third-person adventure slasher title. Like in most games of this genre, Lords of Shadow focuses on short-range combat. The main weapon the player has is a chain whip called the Combat Cross. The players can use its powerful direct attacks or weak attacks that can be performed to inflict damage in a big radius. These attacks can be chained into more than forty different combo attacks.\n\nThe game features a Light and Shadow magic system, which affects the characteristics of the spells used by the player. Should one go on the path of Light, defensive spells will be used with Shadow magic using aggressive ones. It is also possible to upgrade the player's whip.\n\nJust like the previous Castlevania titles, the game features numerous puzzles and a certain degree of platforming. The Combat Cross can be used by the player to scale walls, rappel down them or swing across the pits.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":2936,"name":"Anomaly Korea","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/853/853475c28e65ff1c50422e1316dbc5a8.jpeg","description":"Anomaly Korea is the second game in the Anomaly series of tower offense (that is, a reverse tower defense) games. It has very few differences from its predecessor, the original Anomaly: Warzone Earth.\n\n###Plot\nAnomaly Korea takes place in the future, after an alien attack that devastated much of the Earth. The invaders landed their ships on our planet and are protect them with heavy fortifications. The player assumes the role of a commander of an armored squad that tries to penetrate the alien defenses. As its name suggests, this installment of the series is set in Korea.\n\n###Gameplay\nThe gameplay didn't change much since the previous Anomaly installment. The player controls a group of armored units in real time. The number of units is limited, and there are no options to produce more, so the player has to keep his or her units safe. There is a limited number of boosts the player can use to improve a unit's health or attacks. \n\nAnomaly Korea includes twelve levels in its campaign mode. The primary goal of each level is usually to eliminate the defense towers that protect the alien base. One of the few notable improvements in Korea, besides better graphics, is the variety of its missions. They can include objectives like destroying a specific number of enemy towers or protecting a peaceful convoy on an escort mission. The game also introduces a new mode called Art of War that offers the player a set of more difficult missions.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2060,"name":"Aquaria","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/702/702133bcb0b3acc9b665372e32bee808.jpeg","description":"Aquaria is an underwater 2d sidescrolling action-adventure game with a great emphasis on exploration and solving various puzzles. Players are invited to take the place of Naija, ocean dweller, resembling a human woman with fish-like features, which allow her to swim and breathe underwater. Naija has lost most of her memories and has to explore the world outside, and is up to players to guide her towards the center of the mystery of her origin, the creation of Aquaria and the world outside, wherein the centers of ruined civilizations ancient gods are resting. \nThe gameplay centers on the inability to directly interact with objects or items, but through the system of short musical tunes. In the default form, Naija can summon a circle, with eight positions to fill with differently colored notes. Surroundings will be affected by the notes of the corresponding color, and once players learn more complicated melodies after unlocking through the story will not only help to lift objects and to create a protective shield but change forms as well. A total of seven forms are available by the end of the game, some of which are used to go through the story barriers.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Finji","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":27024,"name":"Super Mario Galaxy","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/936/936f0ffac0b3c9f5c8d185f610ed2631.jpg","description":"Become Mario as he traverses gravity-bending galaxies, traveling in and out of gravitational fields by blasting from planet to planet. Control Mario with the Wii Remote™ and Nunchuk™. Power-up to reach inaccessible areas. Collect Star Bits to either stun enemies or feed Lumas.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"}]},{"id":1743,"name":"MASSIVE CHALICE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00f/00fab9a3c5d62f286f3a269bbd2c7650.jpg","description":"Massive Chalice is a fantasy turn-based tactical game in the vein of XCOM. \n\n###Plot\nThe player assumes the role of an immortal leader in a fantasy kingdom. A dark power called Cadence repeatedly attacks the kingdom, corrupting everything it touches. There's a magic item called Massive Chalice that can purge the world of Cadence. However, the Chalice takes 300 years to recharge. The player's task is to hold on until the artifact reaches its full power. The Chalice has two souls that serve as the player's advisers.\n\n###Gameplay\nThe player rules the kingdom using the world map in the Strategy mode and directly controls the units in the Tactical mode. The king himself does not appear as a unit. Instead, the player controls a group of champions with various skills and attributes. Some of the Cadence monsters that oppose the heroes have unusual attacks such as stealing the hero's XP points or aging the character.\n\nSince the player is immortal, the time is very compressed. The heroes eventually die of old age, which makes them disposable. The player has to breed new heroes and build dynasties by arranging marriages. There are three main classes of heroes: Caberjacks (heavy warriors), Hunters (ranged archers), and Alchemists (similar to wizards). Newborn heroes inherit their parents' class, but if their parents are of different classes, they can learn certain skills from both. The heroes can also inherit artifacts that become stronger after being used by generations of ancestors.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":247,"name":"Neon Chrome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cb/4cbbe312e35374b4dfdbdab98887d447.jpeg","description":"Neon Chrome is a cyberpunk top-down shooter with rogue-like elements developed by 10tons.\n\n###Plot\nIn a distant future, where human morality is at an all-time low. Major technological advancements happen, such as the perfection of cloning technology. This allowed for creating remote-controlled human clones. These clones are used in many aspects of everyday life. Several individuals that got fed up with the current oppressive government use the clones in order to kill the Overseer, who got holed up in his office in the building of a global corporation. Take control of the clones and eliminate the oppressor.\n\n###Gameplay\nThe levels of Neon Chrome are procedurally generated. The developers created an advanced physics model that allows for the environments to be completely destructible. \n\nIf you die at some point in the game, you will have to start all over again. This makes the path to the Overseer a completely different experience every time you start over. \n\nThere are many guns and cybernetic augmentations available to the players in the game. It is also possible to upgrade your character. At the beginning of the game, the players choose one of three roles to play. All three of them suit the cyberpunk universe of the game where giant corporations take over governments. \n\nThe game comes bundled with a map and mod editor which allows for creating completely new experiences and sharing them with the game's community.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"10tons","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":398414,"name":"New World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ad/4ad7dc0f8a01abea9855309e91e933fc.jpg","description":"Fate has summoned you to the shores of Aeternum, the Eternal Isle. Overcome the brutal legions of The Corrupted and draw battle lines with competing players in this land of danger and opportunity. In a land hell-bent on your destruction, what will you do to survive? Strike out alone to forge your own heroic path, or band together, fortify, and fight.\r\n\r\nFIGHT THE WORLD\r\nUnder the surface of Aeternum’s breathtaking landscape lay the seeds of an ancient evil that plots to erase all traces of humanity from its shores. Warriors of bygone ages, doomed adventurers, and creatures of legend have all succumbed to its corruption. It must be stopped.\r\n\r\nA CALL TO ARMS\r\nCombine skill and strength in melee combat, attack at range with precision, or master arcane attacks. However you choose to fight, you’ll need to forge, discover, and customize powerful weapons to fit your combat style. In epic wars with other players or holding back waves of The Corrupted, your combat skills will mean the difference between life and death.\r\n\r\nSTRONGER TOGETHER\r\nUnite players with in-game social systems that power organization, hierarchy, and command and control of formidable in-game Companies. Venture out with your own intrepid party to battle The Corrupted or to seize the land and treasure of your enemies. A thriving Company consists of master craftsmen, fearless soldiers, guileful traders, and strong leaders. Where do your strengths lie?\r\n\r\nTAME THE WILDERNESS\r\nAs you explore Aeternum, you will discover beauty, danger, and opportunity at every turn. Bend the wilds to your will by hunting fierce beasts for food and crafting materials and harvesting valuable resources from the land to fuel your ascent to power. Leverage geographic advantages to control rare resources to accelerate the growth of your territory.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Amazon Game Studios","platforms":[{"id":0,"name":"PC"}]}]