[{"id":26154,"name":"Lego Rock Band","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/924/9240fb1508840c692b7ca60ddb24173a.jpg","description":"LEGO Rock Band merges two of the most popular videogame franchises to\ndeliver a unique family-friendly music experience that will take tweens,\nteens, families and gamers of all ages on a wild journey to rock stardom\nin order to “Build a Band and Rock the Universe.” Combining the\nauthentic multiplayer music experience of Rock Band with the\naccessibility, customization and humor of LEGO games, LEGO Rock Band\nallows players to create their own unique rock star style and customize\ntheir own avatars, band members, roadies, and managers. As players\nsuccessfully complete songs and rock challenges, they can collect LEGO\nstuds, unlock additional content and collect amazing vehicles, which can\ntake their band from local gigs at rock clubs to epic stadium shows and\neven fantasy settings on Earth and beyond.\n\nFeatures\n\n• Rock out using Rock Band instrument controllers, as well as most\nGuitar Hero and other licensed music video game peripherals and\nmicrophones.\n• Rock along to current hits and classic favorites that\nthe whole family will enjoy.\n• Use the LEGO character customizer to\ncreate and personalize your band, instrument controllers and entourage.\n•\nPull off killer riffs in LEGO themed Rock Power Challenges to perform\namazing feats such as defeating a giant octopus, summoning a storm or\ndemolishing a skyscraper.\n• Go on tour and build fame LEGO style by\ncompleting songs to collect LEGO studs – unlock cool vehicles, progress\nto new venues and unlock new characters and instruments.\n• Express\nyourself with a personalized LEGO Rock Den that can be accessorized and\ndecorated to perfectly suit your rock style.\n• All-access gaming!\nStart off on Easy, and work your way up to Expert or try out the newly\nintroduced Super Easy setting created especially for budding rock stars!\n•\nTalent/artist likenesses, such as Iggy Pop are featured in the game as\nLEGO minifigures. Players will be able to unlock the artists’\nminifigure/s to perform that particular artists’ music.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":18834,"name":"Hazard Ops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f70/f7066e0326e18512d0ca5f17ba8862fe.jpg","description":"While the world teeters on the edge of utter chaos in the 21st century, you take on the role of a mercenary in the service of a private military agency. Armed to the teeth, you must eliminate opposing armies and bloodthirsty monster hordes in diverse and turbulent missions. If you survive the countless life-threatening missions, you'll be rewarded handsomely with both money and new equipment items.\nGlorious mercenary career or dismal failure? Big breadwinner or wanna-be killer? The choice is yours!\nRally up your squad, plan your strategy, and charge into the many Co-op missions of Hazard Ops. Obliterate zombie hordes, open fire on freaking dinosaurs, and take on thrilling boss fights in the story missions. We've got everything a cold-blooded mercenary needs to have a good time. Here's a small selection of the coolest modes:\nSurvival 2.0\nDo you have what it takes to survive wave after wave of zombies?\nPrimeval Ops\nThe ultimate battle against dinosaurs with rocket launchers strapped to their backs. Blast them back to the cretaceous age!\nMassive Assault\nIncreasing numbers of enemy soldiers trying to kill you, so you better kill them first.\nExtermination Ops\nPut your skills to the test with waves of enemies, deadly traps, and insanely hard boss fights!\nTurret Defense\nRise to the challenge and stop your opponents from escaping into a mysterious portal.\nLooking for direct combat against your fellow players? Do you have something to prove to the others? Then show everyone who's boss in the Versus game modes! Here are just a few examples:\n(Team) Deathmatch\nThe classics you all love. Can you shoot your way to the top of the leaderboard?\nKing of the Hill\nTactical gameplay at its best. Hold strategic points for the ultimate victory.\nBEAST\nNo time to think. Change sides after death and seek your revenge!\nMech Wars\nClimb into your own mech and pulverize the enemy!\nInfection\nTransform into a nightmarish monster and infect all mercenaries before they can take you out.\nPlay Hard. Die Hard.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Yingpei Games","platforms":[{"id":0,"name":"PC"}]},{"id":18114,"name":"Legionwood 2: Rise of the Eternal's Realm - Director's Cut","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/858/8583c22ffb74ddd53ee4eaa202091c35.jpg","description":"LEGIONWOOD 2: RISE OF THE ETERNAL'S REALM is an epic fantasy Role Playing Game (RPG) in the style of the classics of yesteryear. Playing as an elite imperial soldier trying to protect their homeland, you'll get to explore a massive, fully detailed medieval empire filled with daring adventures, outlandish treasures and dramatic conflicts. Along the way, you'll have to contend with the likes of political corruption, zombie hordes, the onset of war and a game world that changes depending on your choices and actions. Get ready to pick a side on the stage of history. Will you be the one who saves Legionwood, or will you be the one who dooms it to an age of darkness?\nFeatures20+ hours of classic RPG gameplay.\nDozens of minigames and sidequests to discover.\nHundreds of different character configurations.\nOver 100 intelligent and dangerous foes.\nNon-linear storyline that makes your choices count.\nSix different endings.\nThe Director's Cut update also includes:\nSmarter enemy AI.\nIn-game lore encyclopedia.\nExpanded endings.\nImperial Armaments, Bardsong and Journey to Charn DLC packs.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dark Gaia Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12834,"name":"Copoka","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a9a/a9a08ef55f81b72ae00c0890173c9c78.jpg","description":"Copoka is an open-world exploratory indie game about a bird building its nest in a totalitarian city state. As a player, you are soaring free, high above the city of Copoka, as a contrast to the citizens below. Your goal is to find and collect twigs for your nest, and as you construct your home piece by piece a story of intrigue and politics beneath around you.Key FeaturesTake wing and enjoy the freedom of flight\nExperience a city boiling with strife and political turmoil\nEavesdrop on conversations to get the full story of the cityStoryThe city of Copoka is in distress. Speakers all around the city proclaim the glory of the Great Leader and how she will bring salvation to a country in need, while people lament in the streets about starvation and dissatisfaction. Something is brewing in the back alleys of the slums. Whispers in the wind tell about a coming uprising, about an end to the suffering and new hope for the citizens of Copoka. Being a bird you can undertake the role of silent observer. By listening to people around the city a more nuanced picture of the brewing conflict is revealed - a conflict concerning clashing ideologies regardless of social standing or allegiance.\nOf course, it’s up to you if you wish to stop and listen. After all, what are human concerns to a bird anyway?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Inaccurate Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":11365,"name":"Diluvion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5a1/5a159c02e39731dc315247b107ef9c33.jpg","description":"Fleet EditionThe Special Fleet Edition of Diluvion comes with the game's haunting and beautiful Original Digital Soundtrack (in High-Res FLAC and MP3) composed by Light Return, a Digital version of the Diluvion Official Artbook and an Exclusive playable submarine called Manta\nAbout the GameForced into the deep oceans by a Great Flood that occurred countless centuries ago, humanity now lives trapped under a thick layer of unbreakable ice and their survival hangs by a tenuous thread. However, their penchant for perseverance is strong, and a new civilization has emerged with distinct kingdoms, religions and cultures. By a twist of fate you, an aspiring submarine captain, have been given the honor of commanding your first sub. With a brave crew at your command, you now venture into the unknown on a quest to discover humanity’s greatest secret.\nExplore the dangers of the depths in this beautifully realized flooded world, and unearth untold riches and glory.  Discover the remnants of civilization in numerous unique towns and learn their local lore, trade stories and treasure, and hire crew new members.\nContinuously improve each of the game’s 9 unique pilotable submarines using a deep upgrade system, and gain access to new areas and loot. Discover numerous types of cannons and torpedoes to help you overcome the dangers of the deep, and assemble your own unique crew to brave it alongside you. Whether you wish to play as a silent hunter or a guns blazing dreadnought, arrange your crew members and weapons to fit your playstyle.Game Features:\nA Beautiful Underwater World to Explore: Three massive and beautifully realized open sea zones to explore, each with their own factions, local stories and more\nInnovative Combination of 2D & 3D Graphics: Experience the mysteries of the deep in beautifully rendered 3D graphics as you navigate your submarine, and seamlessly switch to meticulously hand-painted 2D graphics when exploring towns and cities\nThrilling Real-Time Submarine Combat: Utilize an arsenal of underwater weapons to engage in life-or-death firefights with other submarines and deadly terrifying creatures\nCrew Recruitment: Assemble your own unique crew to fight alongside you by recruiting different Helmsmen, Gunners and Sonar Technicians. Utilize each of their special skills and personalities to change the flow of combat and exploration.\nUpgradable Submarines: Continuously improve your vessel by acquiring new weapons that can dramatically change the tide of battle\n9 Pilotable Submarines: Explore the world to uncover 9 unique pilotable submarines, each with their own feel, strengths and weaknesses\nResource Management: This world is not for the faint of heart, as resources are limited and survival is a constant battle. You’ll have to actively manage your food supplies and oxygen levels should you wish to keep your crew alive and overcome the perils of the sea\nUpgradeable Home Base: Build- and grow your own base of operations under the sea to house all your stand-by crew members and submarines. Upgrade your base to increase your notoriety and wealth, as upgraded bases can also house valuable opportunities, such as rare item merchants and bars with notorious sailors as patrons.\nLoot System: The world is filled with rare loot and hidden quests to discover…. Especially for those who dare to venture off the beaten path\nTerrifying Underwater Foes: Explore the world and test your bravery against giant sea creatures and mysterious undersea anomalies!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Arachnid Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9601,"name":"Survival Zombies The Inverted Evolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1e/b1efc46a4bbeab0c845d100826244749.jpg","description":"WHAT IS SURVIVAL ZOMBIES\nSurvival Zombies is a bloody chaotic survival first person shooter that pits heavily armed players against humanity's greatest fear - hordes of undead\nTHE SETTING\nSurvival Zombies is something you have never seen before\nFEATURES\n1K+ Achievements\nDay and night options, rain, night vision, different enemy types, bosses, grenades and loads of guns to put them down.\nUse your wits, speed and anything you can get your hands on in epic zombie brawl!.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Racing Bros","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3625,"name":"Metrico","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Metrico is a new world. A living world filled with infographics that react directly to your movement, actions and input. Visit this mysterious place and discover how everything you do affects it. With all of its puzzles and action, Metrico invites you to explore, experiment, test your skills and most of all: think outside the box.\nImmerse yourself in this experience, exclusive to PlayStation®Vita system, and see if you have got what it takes\n1 player(s)\nNetwork Features\n10240KB Minimum\nTouchscreen\nRear Touch Pad\nRear Camera\nMotion Sensor\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\nCopyright by Digital Dreams 2014","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Dreams","platforms":[{"id":0,"name":"PS Vita"}]},{"id":2752,"name":"Square Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/efa/efa17cb6a6fc0bcb515cbb63ad3451cf.jpg","description":"You are a genetically engineered killing machine with time on your hands. Having fulfilled your original purpose of saving the human race, you now get your kicks taking down all challengers in the Galactic Hero's Tournament.\nHone your skills and level-up your Hero in single player, or skip straight to the main event and challenge your friends in one of the hilarious and frantic online skirmish modes.\nKEY FEATURES Designed for multiplayer from the ground up. All maps support six players including bots as desired. Up to four human players can play locally without split screen. What's more, multiple local players can join online matches together, enabling online couch vs couch gaming.\nGame modes include co-op, free-for-all, and team based options. Hunt for gnomes, survive alien onslaughts and fight to the death in any of the six stylish 2.5D arenas.\nChoose your weapons at the start of each round and unlock them by collecting loot. Rounds begin with Melee combat and progress through: ranged, heavy, explosive and special item categories. Strategically choose your load-out to defeat your foes!\nLevel-up your Hero and unlock over 30 new weapons including: Grenade Launcher, Sticky Bomb and Chicken. Earn over 30 heroic achievements to unlock stat buffing hats!\nControls support gamepads and mouse/keyboard with bindable keys and buttons.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GNOMIC_STUDIOS_PTY_LTD","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":308,"name":"Chime Sharp","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a0/3a04747dd4acd39bbe05ec63cbd2d295.jpg","description":"Chime was a much-loved music puzzle game on Xbox Live Arcade, PC and PS3. What happens if you file away the rusty edges?\nNew music + new modes + new visuals = CHIME SHARP.\nPlace pieces, paint the board, make music. Chime Sharp is an sequel to 2009's Chime, a music puzzle game with an addictive, ambient heartbeat. You tessellate shapes to cover a grid, while a beatline reads those shapes as notes. As you cover the board the music builds to a beautiful crescendo of your own design. The only way to discover Chime is to play it, but if you want a glimpse, consider what it might feel like to cross Tetris, a music sequencer and a hypnotic dream about your favourite pop song.\nChime Sharp takes Chime's classic dynamic and updates it for 2015. The core rules are the same but the aesthetic is clean and modern and the game's soundtrack has been completely refreshed. With fifteen new levels, experimental modes, new-era connectivity and sharper ways to play, Chime's finally back -- and it wants to be your new favourite mixtape.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Twistplay","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":680065,"name":"VHS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17d/17d2020ebf64730fc81db8c0a912fab8.jpg","description":"Something Evil has arrived in the video store...\nAbominations once confined to video store cassettes have escaped the tape and transformed into deadly reality. Experience pulse-pounding 4v1 combat amidst neon-soaked cinematic labyrinths where power shifts unpredictably between Good and Evil, but always ends in a fight-to-the-death climax fit for the silver screen.\nMonsters follow a script that calls not only for death, but total domination. Be you the Werewolf-- brutal and swift, or the Dollmaster-- creeping and conniving, you are designed to feast on fear, terrorizing your teenage prey relentlessly.\nTeens scramble to flip the script with weapons fueled by ancient Stigma-- Burn, Shock, Curse, and Purify-- that extinguish Evil. Blast monsters with a faceful of Flame and Fury, dish out a killer jolt from your Raygun or RC Flyer, swing Cursed Swords and cast curses, and harness the glory of a Holy Slingshot or Cross.\nVHS bleeds 80s horror, and if you’re not careful, you will too.\nFight Back or DieThe monsters of VHS are a tribute to over the top 80s horror where anything goes. From a classic Werewolf to the sinister Dollmaster, fight as a growing roster of grotesque, ferocious, and lethal creatures. As a Teen, craft and master a variety of single use and limited fuel weaponry for a shot at turning the tables on the monster. There is no escape, so you must fight to survive.\nMovie MagicEach level is hand-crafted and designed for the ultimate cinematic showdown. Explore classic and fantastical cinematic locales, from decrepit hotels to top-secret research facilities.Hero’s JourneyEach character has a skill tree full of unique perks and custom cosmetics along their personal path to becoming the ultimate hero or villain.Celebrate CreativityShowcase your own style from head to toe in colorful costumes and vivid variants that celebrate the freedom of the 80’s video era. Become the ultimate Video Horror Society fan as you collect an entire shelf of movies full of challenges that reveal hidden lore and reward themed cosmetics. Free to PlayVHS is already yours to enjoy, so hop in!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Rewindapp","platforms":[{"id":0,"name":"PC"}]},{"id":678695,"name":"Beholder 3","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/312/3121ba5c3d5fbe8b747475099f3e63b8.jpg","description":"Welcome to The Greatest Union!\r\nA totalitarian state that controls everything and everyone through oppressive laws, total surveillance, and intimidation.\r\nYou are Frank Schwarz, a husband, and father who lost his cushy office job at the Ministry after someone set him up. The only way to avoid jail time was to make a deal with a high-ranking security officer.\r\nNow a government spy working undercover as a landlord, you must break into tenants' apartments, search them for contraband and eliminate anyone your boss wants out of the picture.\r\nAt the same time, you’ll have to spy and scheme against co-workers and superiors in the Ministry to work your way back up the ladder. Different factions are secretly vying for power over the Ministry and the country – play them against each other to your advantage.\r\nCan you get your old life back, or even something better?\r\nWill you fight for change and truth or uphold the status quo?\r\nWho are you willing to sacrifice to get what you want? Features: Work two jobs: in an apartment block and in the Ministry.\r\nDifferent political factions are fighting for power. Pick your side wisely.\r\nComplete quests from the Ministry: promote the ideology of the totalitarian state, manipulate flags and spread whatever propaganda you’re told to.\r\nInstall surveillance cameras and search apartments and offices.\r\nMaintain your cover by doing everyday chores like paying bills, fixing up apartments, and keeping your tenants happy.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Paintbucket Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":496652,"name":"Manor Lords","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/885/8853972ba3d2baa7270cda2fed3ddc06.jpg","description":"An upcoming strategy game for PC that combines deep, organic and realistic city building with large scale, tactical battles. \n\nHand crafted by a solo developer, it utilizes the power of Unreal Engine to give the RTS/Builder genre a fresh spin.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Slavic Magic","platforms":[{"id":0,"name":"PC"}]},{"id":492017,"name":"Mr. Prepper: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe5/fe5e6a10a1b2a7f0cc434a1eac8ac551.jpg","description":"Also check the game from our friends :)https://store.steampowered.com/app/1310520/Occupy_Mars_Prologue/\nAbout the GameCheck the full version of the game:\nhttps://store.steampowered.com/app/761830/Mr_Prepper/\nMr. Prepper: Prologue is a free standalone version of the game Mr. Prepper, featuring an essential part of the story.\n- Build an underground shelter\n- Craft infrastructure that keeps you alive\n- Follow the quests, and explore the beginning of the Mr. Prepper's story\nMr. Prepper is the guy who lives in a country which once was the land of freedom but step by step its government changed everything. If you don't obey - you disappear. Be as they want you to be or be gone. Our hero decided to oppose, to get out of this delusion of life. The only way for him to hide his plans and his doings is to build an underground shelter and construct a machine that helps him change this situation. But he will need materials, materials so rare in this world - help him get them, help him break the status quo.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rejected Games","platforms":[{"id":0,"name":"PC"}]},{"id":484837,"name":"Furry Love","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b20/b20d697ab91e06e91d425b0faf8a16d7.jpg","description":"General\nFurry Love is an Entertaining Arcade Game, consisting of a Series of Exciting Mini-Games with the Attractive Furry Girls 🐺\nBeautiful Furry Girls, Amazing Atmosphere, Great Music, 32 Levels with Full HD Furry Artworks.\nGreat for relaxing after a hard day at work. Join us! Features\nFive Unique Game Modes\nDynamic Gameplay and Various Difficulty Levels\n32 Wonderful Levels with Full HD Furry Artwork\nAmazing Atmosphere & Great Music\n100 Achievements\nCheat Code to Complete the Level - \"LOVE\" Game Modes\nFurrman\nFurry Cutter\nCatch the Furry!\nPuzzle Many thanks to our artists: Danomil, Paintchaser and Totesfleisch8!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Red Six Development","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":272509,"name":"Skater XL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b95/b957080fc9e91b2c781618f207e69846.jpg","description":"Skater XL is a head-first dive into the skateboarding world, where style, creativity and the perfect trick is yours to define.\n\nCreate, combine, and style tricks with unparalleled board control as you hit iconic California locations where street legends have left their mark.\n\nPlay as skating icons Tiago Lemos, Evan Smith, Tom Asta or Brandon Westgate on your way to becoming a skateboarding pro.\n\nDive into the digital skate subculture, with featured community created mods, brands, ‘zines, and maps. Hit more than 60 real skate spots connected by block after block of plazas, schools, pools, buildings, car parks and corridors.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Easy Day Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":61629,"name":"Feather","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/180/180cba53d89227e0bc02b1d683893a19.jpg","description":"Feather is a serene game about exploration and immersion in a beautiful landscape. Become a bird, fly around and lose yourself in zen-like flow whilst listening to the soothing ambient soundtrack.\nFeaturesPlay as a bird with responsive and fluid flight controls\nA vast island for you to explore\nNine unique songs that can be found around the island\nNo enemies, no combat, no threats, just peaceful flight\nFull day night cycle in a responsive immersive world\nRelaxing ambient soundtrack and sound design by Mitchell Pasmans\nSupport for gamepads and keyboard/mouse","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Samurai Punk","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":59369,"name":"Knowledge is Power: Decades","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ec/4ecd8a314774b727abcba5b5a8f15af1.jpg","description":"HAVE THE TIME OF YOUR LIFE.\r\nWho will be first to scale the Pyramid of Knowledge? Put your pop culture knowledge to the test in this high-energy quiz game show featuring thousands of entertainment-themed questions spanning the last four decades.\r\nIn this new title for the PlayLink range of games for PS4™ , go head-to-head with up to five of your family and friends using your smartphone or tablet as your controller.\r\n•\tGet the edge on your opponents by using a mix of new and familiar Power Plays.\r\n•\tEnjoy great gameplay variety with six touch screen Challenges.\r\n•\tChoose from eight fresh new characters complete with fun selfie filters.\r\n•\tPlay the way you want with new game modes and options.\r\n•\tTake the fun on the go with a rapid-fire quiz that can be shared from the free app.\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\r\nAll players must play Knowledge is Power™: Decades in the same room using the same PS4™. Download and install the free Knowledge is Power™: Decades app to your tablet/smartphone from your device’s app store and connect your device to the same Wi-Fi network as the PS4™ console or connect via the PS4™ Wi-Fi hotspot (Wi-Fi Direct).\r\nNote: you need the Knowledge is Power™: Decades companion app on your iOS/Android™ device to play this game. For best performance, iOS 9+ or Android 4.4+ is recommended. Not all devices are compatible.  Compatible mobile device and Companion App required to play.  For more information visit: www.playstation.com/playlinkcompatibility.  DUALSHOCK®4 wireless controller is required for set-up and PlayStation®4 system functions.\r\n© 2018 Sony Interactive Entertainment Europe. Knowledge is Power is a trademarks of Sony Interactive Entertainment LLC. \\. All rights reserved","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"}]},{"id":56976,"name":"Contra: Hard Corps","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb5/fb5b00564eaa90bc0032188d15d2699f.jpg","description":"Contra: Hard Corps is a side-scrolling run and gun-style shoot-'em-up video game released by Konami for the Sega Genesis in North America and South Korea in 1994. It was also released for the Mega Drive as Contra: The Hard Corps (魂斗羅 ザ・ハードコア, Kontora Za Hādo Koa) in Japan and as Probotector in Europe and Australia. It was the first game in the Contra series released for a Sega platform and serves as the first entry in the Hard Corps series, itself a subseries of the Contra franchise.\nSet five years after the events of Contra III: The Alien Wars, a terrorist group led by the renegade Colonel Bahamut has stolen an alien cell recovered from the war and now intends to use it to produce weapons. Instead of the traditional Contra heroes of Bill Rizer and Lance Bean, a new task force known as the Hard Corps (with four members) are sent to deal with the situation. The game features a branching storyline with multiple possible endings.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Genesis"}]},{"id":44995,"name":"ICY: Frostbite Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/462/462c07dee45995f887df20e0eee03d9c.jpg","description":"SURVIVE THE WHITE WASTELAND\nICY is a narrative-driven post-apocalyptic survival RPG set in a new Ice Age, where your life and the lives of your followers depend on every decision you make. Create your own character, using a detailed stat system that influences your abilities to hunt, travel, scavenge, communicate and lead, then begin a journey of survival across the White Wasteland.\nIt is up to you to take on the responsibilities of leadership and guide your newfound nomad family in their fight for survival. Do not take your role lightly, for each decision you make, each word you speak, ripples through the life of your community.\nTake heed, for you and your clan are not alone in this frozen world. In addition to the elements and the wildlife you encounter, there will be loners and bands of miscreants to deal with. Decide carefully on whom to trust and how to react or the snow covered landscape will become your icy tomb.FEATURES\nExperience an intense story of survival in a unique post-apocalyptic new ice age setting.\nInfluence the plot with your choices, with numerous shades of morality that lead to multiple endings.\nLead a group of survivors, each one with different needs, values and ideals.\nScavenge for items and hunt for food while facing the challenges of starvation, illness, harsh elements and other bands of survivors.\nMore than 400 pieces of detailed hand-drawn artwork that portray the bleak and dire landscape of the frozen world.\nCustomize your character by choosing how to distribute attribute points among 9 different skills that affect your abilities and experience through the entire game.\nEnjoy the new combat system offering a mix between a classic turn based combat system and a trading card game.A COMPLETELY REMASTERED EXPERIENCEAfter nearly two years since the original release of ICY, Inner Void Interactive and Digital Tribe Games are proud to release ICY: Frostbite Edition, a completely remastered edition of the game. We worked to improve every lacking feature of the original ICY, recreating the game from scratch in Unity 5.\nThanks to the exhaustive feedback received from our community and the experience we gained from the original game, we have improved ICY’s formula in many different ways to let it offer a real survival RPG experience in a cold post-apocalyptic world.\nA new combat system was developed: deeper, more exciting and more challenging than the original one.\nThe survival experience was overhauled in order to offer more variety.\nA crafting system was introduced, allowing the player to create new items.\nThe original plot was improved and new quests and characters have been added to create a longer and more satisfying experience.\nThe UI was completely reworked to be clearer and better looking.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Inner Void","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":28624,"name":"Rock Band Music Store","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"The Rock Band Music Store is a new, easier way for you to find your favorite tracks and discover new music for Rock Band, LEGO® Rock Band,  and The Beatles: Rock Band on Xbox LIVE. Browse, preview, and download your favorite tracks and track packs for your favorite Rock Band game in an easy-to-navigate interface. Easily sort through hundreds and hundreds of available tracks to build your ultimate setlist!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Harmonix","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":22871,"name":"Worms 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/453/453f4139b7a8ac372e20b7bd3b8f145a_ckjlaAd.jpg","description":"World domination is just a cluster bomb away!\nWelcome to the strange cartoon world of Worms 2. Wreak havoc on your rivals in an addictive game of revenge and mean-spirited cruelty. Take control of wiggling warrior worms who wield wacky weapons such as deadly mad cows, sheep and flying bananas in the struggle for domination.\nWorms 2 puts you in command of a platoon of wily worms inhabiting insanely bizarre, randomly generated terrain that changes each time a new game is played. Your goal is to utterly obliterate, exterminate and generally make life lethal for your rivals using an assortment of outrageous weapons.\nThey’re back, they’re cute and deadlier than ever!\nMultiplayer notice: In this version of Worms 2, the only multiplayer option available is hotseat.Unleash utter rampage with a mind-blowing array of wacky weapons in this king of hotseat party games!\nAdd new Worm speech-sets, edit weapons, and create new landscapes with the Worms 2 editors.\nStunning cartoon-style animation brings the Worms to life!","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"}]},{"id":21409,"name":"Luxuria Superbia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fed/fedd644c7f376e8ab84b350cf3bcf94f.jpg","description":"A simple game of touch, pleasure and joy.\nLuxuria Superbia is a colorful, musical journey made to fill you with joy. Exciting designs explode from your touch as you glide through playful stylized flowers. It’s all about the experience and the interaction.\nThere’s twelve flower-like tunnels and a garden with a temple.\nIn the garden, you select a flower by turning the dial.\nWhen you complete a flower the next one is unlocked.\nA flower always starts out colorless.\nBut when you touch it, color fills the tunnel.\nStay in the glowing flower as long as possible!\nPlay slowly and gently to get a high score.\nJust pushing through as fast as you can will result in failure.\nThe game wants you to take it easy and be playful.\nThe blush you cause to a flower imbues the garden too.\nFor each flower, there’s a column in the temple.\nTime spent in a blooming flower makes its column grow.\nThe garden starts blank, just like the tunnels.\nBut over several journeys, it flourishes with color.\nBring color to the flowers, bring joy and beauty to the garden!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Tale of Tales","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20618,"name":"Gnumz: Masters of Defense","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/268/268bcb2ad247c62fb80e4de2cb090f81.jpg","description":"An enemy army is at our gates!\nLead the defense!\nAn unknown mineral has been found in the depths of the dwarfish caverns – more valuable than gold and harder than steel. But this find quickly turned sour... The Wicked King laid siege to the underground cities and ordered their inhabitants to give him their entire supply of the wonderful ore.\nAnyone who wishes to lay their hands on the dwarfs' treasures must overcome hundreds of clever traps and powerful curses standing in their way.\nGnumz: Masters of Defense is a strategy game inspired by classical fantasy. Its new system of interacting elements will reveal your tactical talents, and brute force has its place as well. Each level in the underground caverns requires an individual approach. New players and hardcore gamers alike will enjoy its carefully crafted balance.\nBuild an ideal chain of traps. Use magic and the power of the elements: earth, ice, fire and shadow.\nBattle in the depths of the Iron Mountain, in the cold of the Icy Halls, in the hellish fire of the Crucible and among the secrets of the Shadow Frontier. Defeat the army of the Wicked King!Key FeaturesCrush the invaders with the power of the four elements!\nA mechanic new to the Tower Defense genre!\nPlay with tactics or with brute force!\nA mass of refined traps and magical spells!\nDestroy hundreds of enemy invaders!\nA new fantasy world with dozens of underground cities, mines and catacombs!\nDestroy the Wicked King's massive army!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"8Floor","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19443,"name":"Making History: The Calm & the Storm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f98/f986f5a89101223cf7cfab13848a660b.jpg","description":"Making History® delivers the open-ended gameplay of strategy-game classics, but with compelling new economic, military, and diplomatic systems and deep research that lets you play with real historical challenges.\nThe game drops you into a rich WWII world where every nation has its own agenda, and where events can turn on a single alliance. Work with your nation's historic strengths and weaknesses. Build up your industry, infrastructure, economy, military. Create alliances. Then reshape your strategy as the world evolves with each turn.\nRich WWII world: MAKING HISTORY: The Calm & the Storm includes over 80 nations and 800+ regions. Each nation is given detailed characteristics built on extensive research, including economic and military strengths, diplomatic relations, ideology, and technical advancement. Each region features terrain, infrastructure, resource production and more.\nYou are your Nation: Jump into a world in motion where every nation is pursuing its own agenda, and where events can turn on the breaking of a single alliance. Devise strategies based on your nation's historic strengths and weaknesses' and revise your plans as the world evolves in response to your actions. Play as the United Kingdom, France, Germany, Italy, Japan, the USSR, the United States, or China.\nMulti-Turn Combat: An innovative combat system allows many approaches to engagements from massive assaults to holding actions. Supplies, reinforcements and geography all affect your battle plan.\nMore Military Options: Use unique unit abilities to blitzkrieg with armor, fight attrition battles with hordes of infantry, decimate enemy industry with strategic bombers, and bomb fleets from a distance with a carrier task force. With scientific research you can unlock more advanced military units, and every unit features a detailed 3D model.\nSophisticated World Economy: The game's economic system models the connections between world power and economic strength. Players control trade, aid, industrial development, infrastructure investments, and a deep field of research.\nPowerful Alliance System: As you make and break alliances, declare war and propose peace, each action affects your relations with other nations, and their willingness to ally with you. If you lack strong allies, you may find other nations are more are more likely to attack.\nHistoric Scenarios: Six scenarios let you start at a crucial historic moment, focus on a specific event, or play the whole war. Scenarios cover the fall of France, Pearl Harbor, the D-Day invasion of Europe, the Sudeten crisis and more, and each is based on detailed research. You can work to succeed where others failed, or take a different path and see what happens.\nSuperb replayability: Each scenario drops you into a different firestorm. Each nation you play presents unique challenges. Everything evolves from your economic and military choices, the alliances you make, and the actions and reactions of the world's other nations.\nSingle and Multiplayer Turn-Based Gameplay: Innovative simultaneous-turn-based play is quick and responsive, and keeps you in control with no waiting. Play with up to eight others in multiplayer mode, using in-game chat to devise joint strategies and secret pacts. Will you be a trusted ally or a backstabbing tyrant?\nBuilt for Modding: Use included Scenario Editor to modify scenarios or create your own.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Muzzy Lane","platforms":[{"id":0,"name":"PC"}]},{"id":19159,"name":"Bad Mojo Redux","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/26d/26d424d065932b422fe80e4d4c3736d6.jpg","description":"Inside a seedy, dilapidated bar in San Francisco, your dreams of escape are about to be realized. But remembering one last keepsake, you are suddenly seized by its magic, and your transformation begins. From within the damp walls of Eddie's Bar, you emerge a cockroach.\nEnter a world of perilous puzzles and bizarre perspectives. What you discover may shock you. What you don't may kill you. Either way, you won't come out the same person. You may not even come out a person at all...\nMore than 800 navigable screens are rendered in stunning hi-resolution detail. Live-action video and spine-tingling music will drag you into the dark, disturbing atmosphere of Bad Mojo.\nPrepare yourself...It will take all of your skill to crawl out.\nGame Features:\nPlay as a scientist turned cockroach in this cult-classic adventure\nManeuver through a dark and dilapidated San Francisco building\nTotally original premise; great graphics and design; updated FMV\nTerrific exploration and discovery with organic obstacles","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Pulse Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":15988,"name":"Adam Wolfe","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b0/5b0fd32c6696c6085ee7495dfce893fb.jpg","description":"Step into the shoes of Adam Wolfe, investigator of the supernatural. Driven by your sister’s mysterious disappearance, take to the brooding streets of San Francisco, where crime and paranormal occurrences intertwine in dark corners.\nSolving one mystery after another, slowly unravel a larger conspiracy that could lead you to your missing sibling, but may also drag you into the abyss forever.\nUse your wits, your detective instincts and, when all else fails, your six-shooter in this psychological thriller packed with more than 8 hours of challenging gameplay. Secret societies, unnatural afflictions and ancient covenants await you in Adam Wolfe's exciting 4 episodes!\nBecome the Detective. Become Wolfe.\n53 unique locations\nsublime artwork\ntantalizing storyline\nunique case-solving mechanics\nclever puzzles\nfour convoluted mysteries!\n\nWe’re not called Mad Head Games for nothing. We’ve made over 18 games for the casual HOPA market and have spearheaded a kind of revolution and evolution of the genre. We’ve grown, expanded and enjoyed such astounding success that we should be more than happy simply to rest on our laurels and toast our former glory.\nHowever…\nHowever, We’re Not Content. Not Even Close.\nThe Mad World Is About to Get Even Madder!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15155,"name":"Evolution RTS","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b1/5b1a701f3f7977e5bf3a620447cfcb20.jpg","description":"Check out our Discord Server!: https://discord.gg/WUbAs2fPlease Note: Evolution RTS is developed by only one person (with help from other developers on occasion) and has a relatively small but tight knit community, however it is quite active. We use our Discord server to set up games and discuss balance. If you would like to start up a game, you can just click the \"Play the Game!\" button on the lobby main screen to see if the servers are currently populated, or simply join Discord and ask if anyone is up for a game. The answer is usually yes. To update to the latest version, all you need to do is join a server. The Lobby will download everything you need automatically. Steam already comes with the core game files and maps, but game updates are handled through the lobby. Updates happen early, often, and they are usually only a few kb in size.SPECIAL NOTE FOR LINUX USERS: The libsdl2-dev package is required.Evolution RTS is a free an Open Source RTS game designed using the Spring Engine. It has been in development for many years and receives updates often. Its gameplay is designed specifically to appeal to gamers of all skill levels. The gameplay is designed around the use of unit groups, and the mixture of your unit group often will determine how successful you are in battle, as opposed to churning out hundreds of the same unit continually.\nThe economy and teching system is easy to learn and use. The game itself supplies many tools that make managing your economy easier so that you can focus more on crushing your enemy than of playing simcity in your base. Units interact using realistic physics and varied terrain (you can actually micro units in order to dodge projectiles!).\nBelow is a very short list of the features that Evolution RTS has to offer:\nRealistic Physics\nProjectiles and units use a realistic physics system which allow for unprecedented control and gameplay. Micro your units to avoid projectiles. Hide behind terrain for cover.\nEpic and Macro scales\nControl the battlefield and a level that feels the most comfortable to you, whether zoomed in controlling individual units, zoomed out viewing the entire map and issuing orders on a macro scale, or somewhere in between! You are in complete control!\nFine tuning controls for builders\nSet builders on repeat so that they repeat the orders you give infinitely until they die. Adjust builder priority in order to control the amount of resources allocated to that specific builder’s construction project.\nUnique Cover System allows you to easily set up ambushes\nHide your army in rocks and foilage completely undetected and lie in wait to ambush your enemy!\nGameplay geared towards casual gamers in addition to hardcore rts fans, as opposed to only being fun to play at the higher levels\nGameplay designed around being easy to learn yet hard to master. As a newbie you can be up and running in no time, and the gameplay ensures that just because you are new, you aren’t necessarily at a huge disadvantage.\nHundreds of units at once\nThe Spring Engine allows for hundreds or thousands of units to be beating the daylights out of each other all at once. Gameplay scales seamlessly to fit!\nUnique unit abilities\nDiscover units with special abilities, such as the ORB with it’s incredible area healing abilities, or the Overseer with it’s EMP ability!\nSimple Economy\nThe economy is designed to be easy to learn, and use. There are only two resources in the game; Energy and Metal. Energy is used for utility purposes such as unit ammunition, powering shields, and building nuclear missiles, whereas metal is used to construct structures and units. Metal income is split between allies and resources that overflow the player’s capacity automatically flow into allies banks.\nEasy to learn teching system\nSimple teching system that revolves around using the same buildings that supply energy as a means to increase your tech availability ensure seamless transitions into heavier unit technologies.\nBeautiful effects\nFull particle effects engine and beautiful effects painstakingly created down to the last detail ensure that every battle will be visually stunning!\nFull Soundtrack\nFull in-game soundtrack that highlights the mood based upon whether you are building structures in your base or engaged in an all out no holds barred war for survival will keep you on your toes and fuel your need for dominance! Over 40+ tracks!\nEasy battle formations\nEasy to use battle formations via selecting a group of units, right-clicking and dragging on the map make it easy for you to give complex orders to your units,  even in the midst of a battle!\nIntelligent Unit Targeting AI\nUnits automatically target the best enemy units to attack on their own, leaving you to concentrate on formations, flanking, and commanding your army!\nGive orders via the mini-map\nFull unit orders can be given via the minimap, so you can control your units intuitively no matter where your camera is pointing.\nPlace map markers with or without labels, and draw directly on the map\nMap markers, drawing, and labels make it easy for you and your allies to communicate your battle plans, and illustrate them!\nUnit balance dependent on unit mixture instead of one unit owning an entire army all by itself\nUnit balance is designed so that composition matters more than simply churning out hordes of the most expensive unit.\nIntelligent builder AI\nBuilders have a plethora of tools and options available to use to help you with macro tasks so that you can focus on kicking robotic ass!\nCompletely customizeable GUI\nThe many parts of the in-game gui can easily be moved around, resized, and positioned exactly how you like it! Be your own boss!\nGorgeously detailed unit textures and designs\nAutomatic ladder ranking and replay system\nhttp://replays.springrts.com/browse/game=9\nCompletely free, forever!\nOpen Source!\nhttp://www.source.evolutionrts.info\nEvolution RTS is a continually evolving and developing game; Come and join our community! We love having more people to talk to and play with! Preemptively, welcome to our community!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Frozen Yak Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14470,"name":"The Book of Legends","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de6/de6360210ad33551f4d26ac10638669b.jpg","description":"The Demon of Fear, Azutura, is slowly but surely awaking because the world is increasingly being dominated by thieves, rogues and bandits. Indeed - Azutura feeds on people's fears. The solution is found and crafted by the best alchemists of the realm: a special relic whose vapors will put the Demon in a profound sleep for the next few decades or so.\nA notorious traveler gifted with an extraordinary strength, Jordan, is sent to the House of Fear where the Demon lies to do the job. But the very first day of his mission, he is robbed by thieves and loses the precious relic! Details\n'The Book of Legends' is an epic, sprawling role-playing game packed full with characters, quests, items and secrets, evocative of the greats of the genre such as Final Fantasy, Dragon Quest and Phantasy Star.\nKey Features:\nMore than 40 achievements to unlock\nMore than 30 playable characters\nPlay as the strongest man in the world (yes!) but also control a Princess, a Celebrity, a Ghost, a Dragon, a Demon, even a chicken and a cow - in \"The Book of Legends\", the word \"role playing\" takes on its full meaning\nMore than 125 spells to cast\nMore than 60 weapons and 110 pieces of equipment\nMore than 100 different enemies - defeat extraordinary monsters such as dragons, manticores, demons and ogres\nMore than 300 areas to explore\n60 hours of playtime\n2 different modes (Casual/RPG)\nMouse control allowed\nEasy-to-use Quest book and Party Switcher\nAuto-save\nParty Splitting\nChoices that affect the game significantly\nMultiple endings\nExciting story full of twists and witty or hilarious dialogs\nCountless hours of playing, a myriad of side quests and secrets\nGreat interaction between characters and even non-playing characters\nSpectacular spells and summoning\nA Colyseum with 2 different tournaments\nGorgeous characters, graphics and music\nFull List of Aldorlea Games Available on Steam\nMillennium - A New Hope\nMillennium 2 - Take Me Higher\nMillennium 3 - Cry Wolf\nMillennium 4 - Beyond Sunset\nMillennium 5 - The Battle of the Millennium\nThe Book of Legends\n3 Stars of Destiny\nDreamscape\nVagrant Hearts\nAldorlea Useful Links\nOfficial Website (contains 100+ games including all 20+ Aldorlea Games released to date)\nAldorlea Community (join it to receive help and info about the games)\nAldorlea Facebook Page (become a member to get up-to-date news about us)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aldorlea Games","platforms":[{"id":0,"name":"PC"}]},{"id":14449,"name":"Disney•Pixar Cars","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8d/f8d1a8a5b88ba044691346e7d9af586a.jpg","description":"In this video game adaptation of Disney•Pixar's Cars, you begin as Lightning McQueen, a rookie racecar looking to win fame and fortune at the Piston Cup Championship. A racing adventure game with ten playable characters from the film, Cars offers more than 30 races and mini-games through open environments. The game includes voice talent from the movie, so listen for moral lessons from Larry the Cable Guy and comic relief from Cheech Marin.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Rainbow Studios","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"GameCube"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":13328,"name":"Spy Fox in \"Dry Cereal\"","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f92/f9256904e43f756ccb2cbd8c43d1fcaf.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameWill kids be forced to endure a fate worse than eating dry cereal!?\nThe Plot: William the Kid has nearly completed his dastardly plan to cow-nap all the worlds supply of milk!\nThe Mission: The super-suave agent, SPY Fox, must find Mr. Udderly, rescue all the cows, and stop William the Kid from depleting the worlds supply of milk. Using ingenious SPY gadgets, keen wits, and daring moves, SPY Fox, jumps out on an udderly exhilarating adventure!\nInnovative new tools like Talk Balloons allow kids to investigate in a whole new way\nUse top secret SPY gadgets to solve puzzles that test logic\nEarn clues with fun games and activities\nClues change every time you play, and the game just might end differently\nSPY Fox in Dry Cereal challenges and inspires kids to observe details and solve problems in creative and flexible ways. Kids play with faithful, lovable friends as they discover and explore captivating worlds where they direct the journey at their own pace.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11234,"name":"Naval War: Arctic Circle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09e/09ee0da10ac59366ee8b3eb7b4b894cc.jpg","description":"Strategic and tactical battles for world domination on, under and above the open sea. Take command of the contemporary navies and air forces of all the powers in the North Atlantic region to defeat your enemies.\n\nNaval War: Arctic Circle is a Real Time Strategy (RTS) game where the player battles enemy naval and aerial forces for power and ultimate world domination. The game includes real units from the United Kingdom, Germany, the United States, Russia, the Scandinavian countries and others. The game play takes place along the Norwegian and British coast, through Iceland and Greenland all the way to the North Americas and the North West Passage.\n\nNaval War: Arctic Circle has two full campaigns along with skirmish missions and online competitive play. Ultimately, Naval War: Arctic Circle tells a story about a power struggle for control of the world’s resources and supply lines in the Polar Regions.Key features:Two campaign modes, telling a narrative from Russian and NATO sides\nOn-line play through LAN as well as over the Internet\nEnormous area of game play space, with over 35 million square km of open sea and coast line\nExtreme long range guided and self-guided weaponry; if you can detect the enemy, it will be possible to strike\nVertical game play, from orbit aerial units to the bottom of the ocean floor using a seamless zoomable map of the entire North Atlantic Ocean\nDetection and evasion focus with realistic sensory measures and countermeasures yielding a strategic game experience based on stealth rather than head on tactical battle\nGreat detail in unit management with fewer but more powerful units making selection and management more distinguishable and less cluttered with an unparalelled level of individual  detail\nRealistic weather model, with real world implications for tactical and strategical deployment of resources at hand\nReal world units, with all major powers surface, subsurface and aerial units, both contemporarry in service, as well as experimental and on the drawing board","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Turbo Tape Games","platforms":[{"id":0,"name":"PC"}]},{"id":11230,"name":"Cloud Pirates","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/307/30700befd6ff5e5c5b7b65d6805263f1.jpg","description":"Take command of your own pirate airship, equip it with cutting edge weaponry and blast your enemies from the skies. Cloud Pirates is an action MMO in which you fire your cannons to crush the enemy in fast-paced aerial battles!\nTake command of your own airship and navigate the clouds to battle rival captains in exciting tactical team combat. Rule the skies by dodging enemy volleys, using daring maneuvers and your impressive weaponry. Blaze through science-fiction fantasy battlefields in your state of the art airship and become a legendary Cloud Pirate!\nAs you progress, you will gain access to tons of unique upgrades and weapons that will grant your airships new powerful abilities. Give your ships a fearsome and deadly appearance through numerous visual customization options, and develop your captain & crew. Become the scourge of the skies!\nForm a squadron and cooperate with other cloud pirates in strategic battles. Play to the strengths of your team mates: combine your firepower to overwhelm the enemy, or simply outsmart them by beating the other captains to the capture point or loot. Adjust your team strategy for each game mode!\nWould you rather be in the thick of battle piloting a mighty Dreadnought, or mount the sniper’s roost in a light Galleon? Try various abilities and surprise your enemies in each battle with new tactics specifically suited for that battlefield. Choose the role that suits your play style best, change altitude at the right moment and take cover when needed. A cunning captain leaves nothing to chance!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Allods Team","platforms":[{"id":0,"name":"PC"}]},{"id":5452,"name":"WarHawk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a81/a8135911b5ab1d3691ed9f6b06aa3476.jpg","description":"In Warhawk, players experience the thrill of white-knuckle aerial combat with hundreds of enemy fighters, bone-crunching armored assaults and high-intensity infantry combat in a massive, all-out war fought both on the ground and in the skies. During gameplay, players are tasked with protecting their homeland from the invading Chernovan armada. By doing so, players take command of the most advanced war machine in the fleet, the Warhawk, capable of aerobatic dogfights at high speeds or hovering over ground troops providing tactical support.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Incognito","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":5327,"name":"Bomberman ULTRA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/950/950d3c4296bf4a3cb7b561c44fe9afb5.jpg","description":"Because you demanded it! Bomberman ULTRA gives everyone who picks up the controller the chance to bomb their way to victory. Play offline with up to 7 people, or hop online to play against up to 8 people from around the world! Pick from 6 game modes on any of 14 levels, mix and match over 50 character costumes with over 150,000 possible combinations, and choose exactly which of 16 power-ups you want to appear in each level! Stat-tracking leaderboards will show just how good you are!\n© 2009 HUDSON SOFT Hudson Entertainment and Hudson Soft are trademarks and/or registered trademarks of Hudson Soft. Bomberman is a registered trademark of Hudson Soft.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Hudson Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3945,"name":"Cloudberry Kingdom","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ab/1ab34e07ec1350fb79bd40357b38a709.jpg","description":"Unhappily ever after. That’s how it starts. The Orb resurfaces and the classic characters return. Kobbler with his mania, Princess with her endless boredom. It’s only a matter of time before Bob, our hero, shows up to put order back to madness. Three powers struggle for victory and the fate of Cloudberry Kingdom hangs in the balance. What will become of the retired hero, Bob? Will saving Princess one last time win her love? Could true love ever stop Kobbler and the power of the Orb? No, probably not. But hey, it’s worth a shot!Key Features:Infinite Levels: A platformer designed with a fully random level generator. Every level is brand new. The difficulty caters to all skill levels, from casual to hard core. Also, save and send levels to friends!\nHero Selection:[/b] Play as 10 hero types and unlock even more. Also, create your own hero in the Hero Factory – not just the look of the hero, but the physics as well.\nMultiple Game Modes: Experience three different types of play including Campaign mode, Free Play and Arcade mode which includes Time Crises, Hero Rush, and Escalation.\nMultiplayer and Co-op: Enjoy four-player gaming with multiplayer and co-op modes, including Bungee mode.\nCelebrity Voice Acting: Cloudberry Kingdom touts celebrity voice actor Kevin Sorbo, the star of hit TV series Hercules: The Legendary Journeys and Andromeda, and plays the leading role in the parody film Meet the Spartans.[/list]","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":2880,"name":"Dark Cloud 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3e/e3ed9222eb6f4e95a04c9f0f8e5ff3fd.jpg","description":"Experience Dark Cloud™ 2 for PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita or PS App.\nBuild your world. INVENT your weapons. CREATE your adventure!\nDiscover a secret binding the past, present and future. A secret where an innocent inventor, a temporal warrior and an ageless evil hold the key.\n•    Experience an epic action/role-playing adventure that relies on your innovation as much as exploration and fighting reflexes.\n•    Enhanced Georama allows you to re-create worlds with more freedom & flexibility.\n•    Tinker with the Invention System allowing you to create hundreds of items including tools, weapons and more.\n•    Fight your way through an array of unexplored dungeons including caves, sewers and forests.\n•    Over 100 hours of action-RPG gameplay filled with hundreds of Items, numerous levels, and a wide array of monsters.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\n© 2003 Sony Computer Entertainment Inc. Dark Cloud is a registered trademark of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Level 5","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":2246,"name":"Metal Slug Anthology","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37e/37e28ae1366811a51fbf96c2a0ebcc49.jpg","description":"In 1996, an arcade legend was born with the release of 'METAL SLUG: Super Vehicle 001'. The clever mix of the military-style themed, side-scrolling action shooting / platform gameplay, with a wacky sense of humor and hilarious cartoon style met with an instant success among players around the world.\nThe popularity of SNK's legendary action-shooting series has never shown any signs of slowing down over the years. To celebrate, the creators of METAL SLUG ANTHOLOGY™ stopped at nothing to provide a 2D, side-scrolling compilation with all the great gameplay possibilities into this complete arcade compilation.\nEach installment in the series included in METAL SLUG ANTHOLOGY™ offers unique, memorable gameplay and game objectives centered around a futuristic battle between the Regular and Rebel Army. The Regular Army gathered its scattered troops and launched a desperate counter attack recapturing the stolen Metal Slug, and using an arsenal of vehicles to destroy the opposition!\nAn exclusive bonus PS4 Theme is available with the purchase of METAL SLUG ANTHOLOGY™.\n1-2 players\nDUALSHOCK®4\n1080i HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© SNK PLAYMORE CORPORATION ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"SNK","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":212,"name":"Plague Inc.","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f8/0f8f34410d8f86a5c528a421b2429485.jpg","description":"Can you infect the world? Plague Inc. is a unique mix of high strategy and terrifyingly realistic simulation.\nYour pathogen has just infected 'Patient Zero'. Now you must bring about the end of human history by evolving a deadly, global Plague whilst adapting against everything humanity can do to defend itself.\nBrilliantly executed with innovative gameplay and built from the ground up for iPhone & iPad, Plague Inc. evolves the strategy genre and pushes mobile gaming (and you) to new levels. It’s You vs. the world - only the strongest can survive!\n◈◈◈ #1 top game globally with well over a billion games played ◈◈◈\nPlague Inc. is a global hit with almost a million 5 star ratings and features in newspapers such as The Economist, New York Post, Boston Herald, The Guardian and London Metro!\nThe developer of Plague Inc. was invited to speak at the CDC in Atlanta about the disease models inside the game!\n▶ “The game creates a compelling world that engages the public on serious public health topics” – The Centers for Disease Control and Prevention\n▶ “Best Tablet Game” - New York Daily News\n▶ “Plague Inc. will snag your attention in all the right ways and keep it there” - Touch Arcade\n▶ “No denying Plague Inc.'s high-level of quality” - Modojo\n▶ “Plague Inc. should not be as much fun as it is” – London Metro\n▶ “Will leave you hoping to destroy the world, all in the name of a bit of fun” – Pocket Lint\n▶ “Plague Inc.'s gameplay is infectious” - Slide to Play\n▶ Winner – “Overall Game of the Year” – Pocket Gamer\n▶ “Killing billions has never been so fun” – IGN\n◈◈◈\nFeatures:\n● Stunning retina graphics with a highly polished interface (Contagion guaranteed)\n● Highly detailed, hyper-realistic world with advanced AI (Outbreak management)\n● Comprehensive in-game help and tutorial system (I am Legendarily helpful)\n● 12 different disease types with radically different strategies to master (12 Monkeys?)\n● Full Save/Load functionality (28 Saves Later!)\n● 50+ countries to infect, hundreds of traits to evolve and thousands of world events to adapt to (Pandemic evolved)\n● Full game support for scoreboards and achievements\n● Expansion updates add the mind controlling Neurax Worm, the zombie producing Necroa Virus, Speed Runs and real life Scenarios!\nLocalised in English, German, Spanish, Brazilian Portuguese, Italian, French, Japanese, Korean, Simplified Chinese, Traditional Chinese and Russian. (more coming soon)\nP.S. Give yourself a pat on the back if you got all the themed literature references!\nSpecial sale price to celebrate being one of the most popular paid iPhone games ever!\n◈◈◈\nLike Plague Inc. on Facebook:\nhttp://www.facebook.com/PlagueInc\nFollow me on Twitter:\nwww.twitter.com/NdemicCreations","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ndemic Creations","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":727317,"name":"Blood West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ce/8ce57a8157f635caf4c16fd8b8f0dada.jpg","description":"After you die your soul moves on to where it suppose to. Heaven or hell. But if the body is denied its rest six feet under, the soul is doomed to stick around a little longer. The world's gone mad, broken, and cursed, and the last thing worthy of faith and reverence is the double-barreled shotgun at your side. They say that dead men tell no tales? Well, I do have one hell of a story to tell you...\n\n\n\nBlood West is an immersive Wild West FPS where, as a revenant desperado, you take on the twisted demons and eldritch horrors, while you search for the means to end the curse that has befallen the frontier, and maybe find some peace for your wicked soul. One quest after another, the spirits of the land lead you towards even greater challenges. And whatever your path may be - things will get rough. For hell is empty and all the devils are here! In Blood West you will find:\n\nChallenging FPS combat\nStealth mechanics awarding caution\nExploration and resource management\nTrait-based character progression\nNon-linear immersive gameplay","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Hyperstrange","platforms":[{"id":0,"name":"PC"}]},{"id":484668,"name":"Not For Broadcast: Prologue","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f3/2f39e67948648417709e746748a903b8.jpg","description":"Get the Full version of the Gamehttps://store.steampowered.com/app/1147550/\nAbout the Game\"PROLOGUE\" IS A FREE LIMITED VERSION - BUY THE GAME HERE!\nLook, mate - it’s not that hard. Choose the angles, roll the ads, and bleep the swears. Just keep in mind that how you show these people will change their lives. Don’t worry - you’ll get paid either way!\nIn an alternate 1980s where the nation stumbles towards dystopia, join the National Nightly News team as they document the latest political scandal, the rise of a radical government, and which celebrity has for some reason written a book about it all.\nYou only came in to clean the studio - but in a bizarre twist of fate, it's now up to you to determine exactly what goes on air.\nNot For Broadcast is an immersive, narrative-driven propaganda sim that lets you set the agenda. Mix four camera feeds, choose the headlines, bleep the bad language - all under the pressure of a live broadcast. Will you censor the news and be rewarded, or expose the truth and live with the consequences?\nFrame the picture - Keep the general public entertained with your editing skills. You are the artist and the broadcast is your canvas.\nKeep it PG - Censor swear words… or “unapproved” information. Keep the news safe for children and oppressive political regimes alike.\nHand-pick the headlines - Their public image is in your hands: run the story of a footballer's new beau, or his last dodgy night at the pub? His marriage and his life are in your hands.\nCue the ads - Watch your bank balance soar or dive based on what advertisements you run. Customer satisfaction not guaranteed.\nThe show must go on! - Keep broadcasting no matter the cost. News stops for no-one, not even a category 5 storm!\nKeep them laughing as you go - The stress of playing a part in this twisted political turmoil getting you down? Sit back and relax - The National Nightly News team will take you from laughter to dread in the course of a commercial break.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"NotGames","platforms":[{"id":0,"name":"PC"}]}]