[{"id":17222,"name":"hocus","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d60/d60c9109bb86cf01461189e0884db4d3.jpg","description":"hocus. is a minimal perspective illusion puzzle based on M.C. Escher drawings and impossible shapes.\nSee mobile version: https://itunes.apple.com/us/app/hocus./id1030548464\n***  Gamepad support (highly recommended) ***\nCreate and share your levels as a card or code  Relaxing music & sounds  100% indie - designed and developed by a puzzle lover  Mouse and gamepad controls  65 Beautifully crafted mind bending levels (new levels are coming...)  Optimized for PC and human brains","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Yunus Ayyildiz","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13553,"name":"Leadwerks Game Launcher","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6d/c6d0165e39bcb263d8b1b6319cd759e0.jpg","description":"Leadwerks Game Launcher lets you play a variety of creative, experimental, and just plain wacky mini-games made with Leadwerks Game Engine.  Fly a spaceship through an asteroid field, play a round of miniature golf, or ride a lawn mower while dodging killer cows.  It's free and there's a constant supply of new things to try.\nWith Steam Workshop integration, you can talk directly to the developers and give your feedback for new ideas to be incorporated into their games.  Start a discussion and let the devs know what you liked about their game, what can be improved, and any new ideas you have to add to their game.  Your feedback will help them design their game and create something new and unique for the Steam community to enjoy.\nIf you're looking for the latest polished blockbuster AAA game with no rough edges...this isn't it.  If you want to try something off the beaten path, complete with glitches, experimental ideas, unbeatable levels, and a never-ending variety of new things to do, get Leadwerks Game Launcher.  It's free and includes more than 25 mini-games, with new ones being added all the time.\nHere are some of the mini-games you can play right now for free:\nHunt for Food\nAsteroids3D\nVectronic\nMini Golf\nBeach Roll\nThe Mower\nCuber\nEvaluation Abridged\nCastle Defender\nThe Hankinator's Funhouse\nThe Hankinator's Phantasmagoria\nSlafstraf Horror\nCuber\nNuke\nTunnels of Tarkus\nRise of the Pumpkinheads\nThe Biodome\nOne More Day\nLockdown","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Leadwerks Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":365,"name":"iO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/832/832a39c906297bb58885fb56a7ab942d.jpg","description":"iO is a physics platformer in which you control a ball. By growing or shrinking the ball you can influence its speed and weight. Use these mechanics to gain momentum and make your way through the levels. Toy with the laws of physics, solve the puzzles and reach the exit as quickly as possible. Can you win the gold medal in all levels?Features:225 challenging levels to solve, including the extra tough Impossiball Levels.\nCrafty mechanics like inversed gravity, portals, tricycles and movable objects.\nLeaderboards in all levels to race against your friends and other iO players.\nBronze, Silver and Gold medals to earn.\nDual Stick controller support.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gamious","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":53088,"name":"The Last Blade (1997)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2da/2dab29baecf27327f4d896baa39b433d.jpg","description":"The Last Blade, released in Japan as Bakumatsu Roman: Gekka no Kenshi (幕末浪漫 月華の剣士 Lit. Bakumatsu Romance: Moon Flower Swordsman), is a fighting game developed and released by SNK for the Neo Geo system in 1997. It was also ported to several home systems. A sequel, The Last Blade 2, was released in 1998.\nThe game takes place during the Bakumatsu era in Japan, and incorporates various elements of Japanese mythology (with a heavy emphasis on the symbology of the Four Symbols). As such, the background music generally incorporates synthesized instruments simulating a sound appropriate to the 19th century setting, in a Western classical, pseudo-Romantic style (unusual for a fighting game).","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"DotEmu","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"}]},{"id":46505,"name":"NBA 2K18: The Prelude","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49f/49f779db060a6ec25951619ffc014472.jpg","description":"Get a head start on your MyPLAYER career for free! Download the Prelude a full week before NBA 2K18 arrives. More details to come.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1 player\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2005-2017 Take-Two Interactive Software and its subsidiaries. All rights reserved. 2K, the 2K logo, and Take-Two Interactive Software are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. The NBA and NBA member team identifications are the intellectual property of NBA Properties, Inc. and the respective NBA member teams. © 2017 NBA Properties, Inc. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"2K","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":36018,"name":"Hellgate: London","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d90/d90e0238fb70038c0d6c36fa1943e31c.jpg","description":"RETURN OF THE HELLGATE: LONDON ON STEAM!\nWith the support of many fans, developers have been able to offer the latest version of Hellgate: London game in the Steam.\nHellgate: London provides a single play environment with the latest version (Version 2.0) of the Hellgate: Tokyo service.\nThe game provides single play optimized scenario contents and premium support items.\nThe Hellgate: London is an action role-playing legend game you have been waiting for. Hellgate: London presents a near future that the devils and minions were brought to the Earth before the whole world falls into fears. As a survivor, you must rescue humanity from army of darkness using battle skills and magic.\nThe game offers endless replayability to its users through different modes, levels, random generated monsters and huge collection of weapons and items. You can enjoy playing game in either third-person or first-person perspective.\nKEY FEATURES:\nCharacters\nThe Hellgate introduces six classes of characters to choose from. Each character has its philosophy, training and combat skills. The class you choose is an important factor that determines a game play. In addition to the class, you can choose various visual physical attributes like sex, height, size, hair and skin color etc.\nCharacter customization system allows you to create your own unique character and raise its level and skills through quest performance and battle against the devil.\nRandom generation system\nHellgate: London provides infinite repeat playability by creating randomly generated dungeons, items and quests. Random maps allow you to have unique and personalized play to enjoy different experiences each time you play. Every space the player steps into is a randomly generated map, where quests and items are always generated randomly.\nUnique items\nOne of the important features of Hellgate's game play is its collectable rare item system.\nHellgate offers a variety of items such as Random, Rare, Unique, Named and Quest items to ensure you enjoying the game.\nFurthermore, through various item-related systems you can create an infinite number of items and get support in the development of your character with a higher level of items and characters.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"T3Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":29787,"name":"Maniac Mansion","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7b5/7b58d09f57803a5805b13d6c4f4020d6.jpg","description":"The Edison mansion has always been a creepy old house on the edge of town. There have been rumors of strange experiments going on and of odd creatures living amongst the Edison family. There is even a story that a meteorite once crashed near the home nearly 20 years ago. More immediately, a girl named Sandy has gone missing from the local highschool and her boyfriend Dave swears that he saw Dr. Fred abducting her. Dave knows that he cannot do it alone and will need help from two other students if he has any hope of infiltrating the mansion and rescuing Sandy.\n\nPlayers start by choosing two students to accompany Dave to the Edison mansion, and can then switch between these three characters at will. Most actions are carried out by selecting verbs on the screen and applying them to an object (such as \"OPEN Door\"). Each character maintains a separate personality and may have a different way to solve a problem from his classmates. Thus many of the puzzles can be overcome in different ways depending on the character being used. If any one of the kids are captured by the Edisons, they are thrown into the dungeon and must be rescued themselves by any character who still has their freedom.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Apple II"},{"id":0,"name":"NES"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Linux"}]},{"id":27979,"name":"Bravely Default","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f42/f4233dab41a5e807b5689ed926efd685.jpg","description":"Square Enix's highly-acclaimed fantasy RPG brings deep, strategic combat\nto the Nintendo 3DS™ system in an ambitious game that bolsters its\nturn-based combat with a compelling new risk/reward system RPG fans will\nobsess over. Explore Luxendarc as Tiz and other memorable characters on\na visually stunning quest to restore balance to the world.\n\nHand-drawn 3D backgrounds and a rousing score bring Luxendarc to life.\nEnter a brave new world of turn-based combat! Time your turns tactically\nand turn the tides in your favor with the new Brave and Default system.\nFlex your strategic muscle by combining more than twenty jobs with\nhundreds of different abilities. Summon friend’s characters to fight by\nyour side, or borrow their abilities*. Recruit citizens with the\nStreetPass™ feature to rebuild Tiz's destroyed village. Be part of the\ncommunity in this fresh take on the single player RPG!\n\nFeatures:\n\nA unique, innovative twist on turn-based combat\n\nComplex, lovable characters in a top-tier RPG\n\nTime your turns tactically with the new Brave and Default system\n\nSummon your friend’s characters to fight by your side, or borrow their\nabilities*\n\nForm flexible strategies by combining 20+ jobs with hundreds of\nabilities\n\nAcquire StreetPass™ tags and use them to gain access to powerful\nequipment and items in-game\n\nEvocative music and gorgeous hand-drawn watercolor backgrounds with 3D\nelements\n\nIn-game content available for purchase using stored account funds.\n\n* Wireless broadband Internet access required for online play. For more\ninfo, go to support.nintendo.com.\n","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Square Enix","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":21758,"name":"The Tomorrow War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0d/d0d8d42665fb2f79a9740fb137f1d62d.jpg","description":"The Tomorrow War is a space sim based on the trilogy of novels written by a famous Russian author, Alexander Zorich. These books are dedicated to the intergalactic war of two mighty empires. Along with the graduates of the military-space academy players will witness different stages of the conflict between United Earth Empire and Konkordia.\nGamers will participate in local operations and in huge space battles, meet alien races and fight against unofficial military organizations and of course take part in the final battle.\nThe 27th Century. There is peace on Earth. Mankind has discovered ways to travel outside of the solar system and planets thousands of light-years away have been colonized. The United Earth Empire is at a cross-roads as an old enemy decides the galaxy has room for only one Empire.\n300 years ago one of the human colonies turned to Zoroastrianism, an ancient human religion. They formed a new nation called Konkordia and then increased the population through cloning their people. Konkordia has already conquered more than 30 planets and has become a powerful star nation. While The United Earth Empire has signed peace with Konkordia there was always tension in the relations between the two states.Key features:owerful game engine capable of modeling whole planetary systems. The engine allows continuous flights from space into the atmosphere of a planet and landing on any part of the planet\nAdjustable settings - from a hardcore space sim to a near arcade game\nDozens of NPCs and locations\nDifferent types of spacecrafts - from fighters to ferry ships","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"CrioLand","platforms":[{"id":0,"name":"PC"}]},{"id":21636,"name":"7 Wonders: Treasures of Seven","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84a/84ac39685dbc8de087b8fb07c8e15d60.jpg","description":"It's time to build nine of the most intriguing structures throughout history!  Match runes to break blocks and uncover the lock and keystone for each round.  Rotate the cube face to move your keystone along the pathways you've created to reach each level's lock and conquer all six sides!\nOnce you've mastered the faces of the outer cube, move to the inner cube where you'll attain pieces to build your compass. Build all nine amazing wonders, and you'll uncover the hidden city with the help of your map and compass. Don't miss this incredible and innovative chapter in 7 Wonders!\nGround-breaking rotatable game board!\nCool pathway puzzles to solve on each level\nRevolving board enhances power-up strength\nNine all-new Wonders to build","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":20629,"name":"The Stalin Subway","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d92/d9230d1af900beac9caed35c2e34737f.jpg","description":"Darkestville Castle Coming Soon\nAbout the Game\nImmerse yourself in the dark atmosphere of Moscow during the 1950s. A covert plot against Stalin - the general secretary of the Soviet Communist Party - threatens to take the lives of innocent people. Against his will, KGB officer Gleb Suvorov must prevent the attack and rescue the lives of innocent people. You'll lead Gleb through a tempest of events where you'll visit prominent sights in Moscow, control the trains of a secret underground tunnel, and use authentic weaponry--including the anti-tank rifle PTRS-41, RKG-3 grenades, Molotov cocktails, and flamethrowers.\n•\tThe photorealistic representation of the most prominent Moscow sights: subway stations, the Kremlin, Moscow State University etc.\n•\tThe top-secret objects: a military transport underground dug-outs, Stalin’s bunker.\n•\tAuthentic weaponry, including such weapons as anti-tank rifle PTRS-41.\n•\tThe NPC-s are able to show the emotional reaction to the environment and the player’s actions.\n•\tControl the trains of the secret underground line.\n•\tOver 300 types of destructible objects.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Orion Games","platforms":[{"id":0,"name":"PC"}]},{"id":17720,"name":"Gladiators Online: Death Before Dishonor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ee/4eed8190a516c201425723889a18be77.jpg","description":"Welcome to the Coliseum. Behold the sacred sand where blood is spilt and fortunes are made. ‘Tis not a place for the meek, so abandon all thought of tomorrow and bolster your courage. From now on Fate will be your lover, and her embrace holds no warmth - only death and glory.Step into a more brutal Time\nGladiators Online provides an authentic look at what occurred in the life of ancient gladiators. Your  main tasks as Lanista (owner of a gladiator school) will be to scout new talent, prepare and equip your men for battle, and control your fighters during combat - furthering the fame of your noble House!Fight thousands of other Players\nCombat in Death Before Dishonor plays out in real time allowing you to tactically control your gladiator’s offensive and defensive moves. Collecting Virtus energy through successful attacks and timing one of the 60 individual combat skills will decide over life and death in the arena.Manage your Business\nWith over 600 items, consumables and techniques influencing the outcome of the battle, strategic management is crucial to a Gladiator’s success. Training and preparing your men for combat will require you to seek the professional assistance of Magisters, Healers and Courtesans.Death Before Dishonor\nDeath in the arena is permanent, no magical potions, no divine intervention. As Livy points out: “We feel public misfortunes just so far as they affect our private circumstances, and nothing of this nature appeals more directly to us than the loss of money.” And that’s exactly what your men are: Capital investment. Tend to their needs and watch your fans and income rise. Let them die and you can bury your hopes right with them…Class Descriptions\nThe Murmillo is the archetypical gladiator of imperial Rome. His name may derive from Latin “Murex”, a pointy-shelled sea snail, well-fitting a defensive combat strategy. He is heavily armored, fights with a gladius short sword and wields a large shield.\nThe Hoplomachus derives his name from the Greek “Hoplon”, the typical round shield of Hellenic fighters. Clearly the inspiration for this gladiator class was the Hoplite with his “Sarissa” lance, fighting in the armies of Alexander. The Hoplomachus is a medium armored combatant focusing on spear and small shield.\nThe Thraex class developed from the fierce warriors of the north-eastern province of Thrace. Gladiators of this type prefer fighting with curved swords such as the one-handed “Sica”. They wear medium armor and wield small rectangular shields.\nThe most iconic of all gladiator classes, he fights with the “Rete”, the fishermen’s net, and the trident. Retiarii are only lightly armored, predominantly with solid shoulder armor, the “Galerus”. They do not use any shields, generally relying on their tridents wielded with both hands.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dorado Games","platforms":[{"id":0,"name":"PC"}]},{"id":17596,"name":"Ukrainian Ninja","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ef/8efefb2a61142919020e38a0375ffc78.jpg","description":"Ukrainian Ninja is a multiplayer platformer game for Windows. The Ninja shoots and slashes, using weapons sold by the trader to clear each world. Jump, scale and fight like a ninja as you battle it out with multiple enemies and bosses. The Trader has weapons to help you such as miniguns, rocket launchers, assault rifles, and even the classic ninja star.  Each World ends with a special Boss fight as a final hurdle, and then there are bonus rounds at the end.\n- 8 Worlds to liberate\n- 24 challenge bonus rounds\n- Coop / Multiplayer Support (up to 16 players if wanted)\n- Dedicated Server Availability\n- Gamepad support\nThis is our 1st game as a team, and we hope you enjoy. We have taken all complaints and improved the game with them.  If you have any issues or complaints, PM one of us and we see what we can do. :)\nABOUT OUR TEAM\nWe are a group of friends that decided to make a game together, we have been modding for years before that for other games.  We all come from pretty much the same game, and joined up to make this game, and support the Ukraine.  We decided the name of the game because ninja's are cool, and we had a couple Ukraine's in the group (At the time, they have now since been busy with their lives over the time of development, and our team has shrunk.) However we press on, and have completed our 1st game. We are a team of 4 main members, that are working our best to provied the best entertainment for price.  We hope you enjoy our game, and any questions can ask us anytime, we are really friendly :)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Denys Ovsiannykov","platforms":[{"id":0,"name":"PC"}]},{"id":16626,"name":"Quanero VR","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b5/9b550b44b32862907f12db23c2c5a26c.jpg","description":"Quanero is an experimental VR experience for the HTC Vive and the Oculus Rift. Your goal is to figure out what caused a violent incident in a futuristic bar by manipulating the time. You can slow down time, reverse it or bring it to a halt. Explore the scene, unlock the story's branch points and unravel the mystery. There's also an explosion. Quanero was created with Unreal Engine 4 and can be downloaded for free.Background InformationThe possibility of experiencing stories in virtual reality offers completely new challenges to the art of storytelling. The traditional work of directing and the function of the cameraman have to be reconsidered completely, as the player is able to choose his point of view and position.\nWe have tackled this challenge in our final bachelor project Quanero and even went one step further: in this experience, we also give the player complete control over the time. Thus, it is possible to move forward and backwards in time, to stop it or to view the action in slowmotion from every perspective in the room. We're offering the player a new and extremely immersive experience. The goal of the experience is to find the source of the devastating chain reaction which climaxes in an explosion.\nQuanero was developed specifically for HTC Vive. VR technology enables you to feel like you're in this futuristic bar, partaking in a brawl or a drug deal and finding yourself in a spectacular explosion with debris raining down on you.\nThis project was created by students from the University of Applied Sciences Salzburg's MultiMediaArt and MultiMediaTechnology degree program. The content was created with several 3D applications and textured with the help of substance painter and designer. Body and facial expressions were acted out by professional actors and digitized with a motion capture system.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Laserboys3000","platforms":[{"id":0,"name":"PC"}]},{"id":15428,"name":"Ragnarok Clicker","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef9/ef987504084aeb152ec378abfcf8917f.jpg","description":"Experience the original classic world of Ragnarok Online in a new game collaboration by Playsaurus (developers of Clicker Heroes) and Gravity Interactive. The teams have \"clicked\" together to bring new life to the monsters and characters of Ragnarok to the idle game genre.\nBegin your journey with only your loyal Novice friend into the World of Ragnarok, and seeking out more party members to give you more skills and damage.  Battle ever increasing challenges by assembling more party members and leveling them up with zeny, gain special bonuses by capturing MVP cards for an edge to your unique playstyle.\nVisit the beautiful vistas and terrifying dungeons of Ragnarok, face down monsters from the cute Porings to the terrifying MVP Bosses of the world.  Progress to higher dungeon levels to prove your ability and patience while, recruiting and deploying mercenary helpers to bring in extra loot, and of course team up with your friends to form a guild to take on multiplayer guild challenges that await!\nPlay the game with your own style, either Idle or in active clicking mode or anything in between.  Even after you reach extremely high dungeon levels you can restart your dungeon run with many of our items and MVP card benefits to try and reach ever higher and faster!  Over 100 Monsters and and infinite dungeon levels to battle, join the adventure of a lifetime today!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playsaurus","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":12895,"name":"Surge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7bf/7bf6a532fa4e6ba6b2c31da6e098aa8d.jpg","description":"SURGE is a 2.5D metroid-vania adventure platformer game.\nYou play as the brilliant Dr Lazarus who lost an arm and his memories. His new prosthetic the A.R.M., however, helps him fling & hook himself across the megalopolis of Brahma. With the assistance of your personal A.I. friend Galatea, find a way to stop Infinium's devastating effects on the human brain, retrieve your memories, fight the powerful Golems using your gadgets & upgrades — but hurry up before it's too late!\nThis original title is the result of the combined efforts of the classes of 2017-2018  (Level Design, 3D modelling and Animation) of Le Campus ADN, in Montreal (Quebec), Canada. This capstone project was created in during a 15 week-long dedicated production under the guidance of video game industry professionals.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"House of Secrets","platforms":[{"id":0,"name":"PC"}]},{"id":12131,"name":"Blueprint Tycoon","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/541/541d0f86152ed944f773ce521be461ee.jpg","description":"Build your settlement, gather goods, ensure maximum efficiency and make a profit!\nIn Blueprint Tycoon you are tasked with running a settlement by gathering raw materials and crafting them into complex goods to be supplied to your contractor for a profit.\nCreate your own Blueprints for each Crafter/Harvester using multiple Workers with a multitude of Tools and try to create the most productive Blueprints.\nProfit margins are razor thin so you must focus on ensuring peak efficiency at every point of your supply chain, if something breaks you must be swift in managing your cash flow before your treasury runs out and you face the wrath of unpaid Workers!\nPlan your Island for maximum efficiency\nHire workers and keep them happy, fed and most importantly, paid\nColonize other Islands and set up trading routes\nResearch new products to supply more profitable contracts\nMaximize productivity by creating your own Blueprints\nManage your supply chain and keep everything working at peak efficiency\nOptimize your contracts for maximum profit!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Endless Loop Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11088,"name":"Rencounter","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/abc/abc8c816c9cf7539195658dd53bfb6fd.jpg","description":"Rencounter is a difficult, turn-based, RPG, roguelike game with a mysterious atmosphere.\nThe world of Rencounter is immersed in gloom. The game begins in a maze full of bloodthirsty enemies, valuable resources, and secrets. Help your squad survive while navigating through a network of tunnels and rooms. Distribute provisions and medicine to keep them alive.\nIn a world where every choice counts, you will be taken away on a path that will shape your destiny. Find your way to the end of the quest and discover the secrets at the end of your journey!\nFeatures:\n- Explore dungeons\n- Fight enemies\n- Scavenge equipment\n- Loot valuable items\n- Build Your character\n- Manage inventory","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SPVD","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10295,"name":"Perception","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95c/95cb859b1dbb2243cae3abcd632eae40.jpg","description":"Perception is a first-person narrative horror adventure that tells the story of Cassie, a blind heroine who uses her extraordinary hearing and razor-sharp wits to unravel the mysteries of an abandoned estate that haunts her dreams.\nAfter months of research, she discovers an abandoned mansion in Gloucester, MA. Once there, Cassie finds that Echo Bluff is worse than her nightmares. A ghastly Presence has tormented its inhabitants over generations, and it now hunts Cassie. She must solve the estate's mysteries or become one of its victims.\nGame Features:\n- \"See\" using echolocation. Every sound creates a visual.\n- Engage in a deadly game of hide and seek with relentless enemies, including The Presence.\n- Trigger radical change at the Estate at Echo Bluff each time you solve its mysteries.\n- Travel back through history to exorcise your own nightmares.\nAbout the team:\nThe Deep End Games is an independent video game development studio located in Boston.\nThe team consists of veteran developers who contributed to franchises such as Bioshock, Bioshock Infinite, Dead Space and more.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Deep End Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":7797,"name":"Football Manager Touch 2017","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c25/c25d4d5eee9a962842f78bce3495586c.jpeg","description":"Take control of your favourite football team in Football Manager Touch 2017, the streamlined, ‘transfers and tactics’ way to enjoy football management.\nWith over 2,500 real clubs to manage and over 190,000 real footballers and staff to sign, Football Manager Touch 2017 packs the depth of Football Manager’s acclaimed data but provides a faster experience, focusing on the core managerial duties.\nYou’ll have full control of transfers and decide who plays, and who sits on the bench. You're in complete control of tactics and you’ll follow the match live with our acclaimed 3D match engine. For managers in a hurry, Touch lets you simulate your match at the click of a button, allowing you to speed through your season to glory.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SEGA","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":5340,"name":"Blood Omen: Legacy of Kain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d54/d5408c9314af7c14ec876dd4627a2d55.jpg","description":"Blood Omen: Legacy of Kain introduces the fictional setting of Nosgoth. In the game, the player takes the role of Kain, a human nobleman, who is murdered and given the chance to exact revenge on his assassins by becoming a vampire. He travels Nosgoth, slaughtering the corrupt sorcerers of the Circle of Nine in hopes of discovering a cure for his vampirism, but gradually begins to view his transformation as a blessing over the course of the story.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":963,"name":"Leap of Fate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/825/825c6fd73ebe43064f312a2ef5819ecb.jpeg","description":"Leap of Fate is a unique blend of isometric perspective, furiously-paced action, and roguelike elements. As one of four technomages hiding in the shadows of New York City, your time has come to confront the Crucible of Fates, a mysterious testing ground that will magically pit you against your own psychological demons. Your journey through the Crucible has you fighting hordes upon hordes of enemies and overcoming deviously laid traps. Your tools are your lightning-fast shadow walk, the powerful glyphs you find, and the magical skills that you upgrade along the way. Your reward for survival? Unspeakable power and a chance to uncover your true fate.\nKey Features:\nExperience an extremely fast and satisfying action game, built around the ability to Shadow Walk\nUpgrade over a hundred magical skills, through an innovative system of randomly-generated skill trees\nDiscover the profound and intense stories of four characters, told through beautifully illustrated cinematics\nExplore a modern-day cyberpunk fantasy spanning cybernetics labs, dark alleys and secret societies\nChallenge\nCombat in Leap of Fate is extremely quick and deadly. Not only will you face more than a hundred different types of enemies, ranging from pit fighters to mad cultists and hidden turrets, but the procedurally generated levels will keep you on your toes at all times. Be warned; once you die, you must restart from the beginning and try again. Hopefully, you'll have unlocked new permanent upgrades to help you along.\nMagic\nWithin each game session, you will find many opportunities to gain magical power. In addition to the game-altering glyphs you randomly find along the way, there are more than a hundred magical abilities total, spread across the Mobility, Attack and Passive skill trees. The twist in Leap of Fate is that skill trees are randomly shuffled, ensuring that each game differs from the previous one. On one run¬¬, you'll float over pits and disintegrate enemies with Atomic Flash, while in the next, you'll be wielding a projectile-reflecting technology while calling upon the Greys to abduct your foes for you.\nCharacters\nIn Leap of Fate, you play one of four mages, each with their own distinct gameplay style and storyline:\nAeon, the shadow mage: Psychologically scarred by years of oppression in a secret society\nBig Mo, the cyborg technomancer: Wrestling to come to terms with his dual nature\nMukai, the spirit channeler: Struggling to regain control of her mind from three powerful entities\nRasimov, the rogue occultist: A centuries-old mage on an endless quest to cheat death\nThey say this place makes you face your own fears, your own demons. But it can also reveal your fate, if you survive the trials.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Clever-Plays","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":756587,"name":"Who Pressed Mute on Uncle Marcus?","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fe2/fe2743649dc053c1d301ed4590018db1.jpg","description":"Every year, Abby’s mum has a family quiz on her birthday. It’s a long-held tradition, one that brings the whole rich and eccentric family together - and one that Abby dreads. But this year's quiz comes with a shocking difference... as it’s about to begin, her beloved Uncle Marcus tells her that he’s dying - and someone in the family has poisoned him. Abby is the only one he can trust... You must find out who the murderer is before it is too late.\n•\tShot in lockdown and filmed simultaneously in London and Los Angeles\n•\tStarring Andy Buckley (The Office) as Uncle Marcus and Abigail Hardingham as Abby\n•\tAlso starring Susannah Doyle (Black Mirror), Robbie Kay (Once Upon a Time) and Gabrielle Glaister\n•\tReturning FMV actors Georgia Small (Five Dates) and Al Weaver (The Complex)\n•\tFrom the studios behind The Complex, Five Dates, Night Book and Bloodshore","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Wales Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":678655,"name":"Blast Brigade vs. the Evil Legion of Dr. Cread","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3e/b3ea9a8c312e8ce3ffea2c91e01f4df2.jpg","description":"JOIN OUR DISCORD\nPREVIEWS\"Hollow Knight with guns.\" — Уютный подвальчик\n“The humor, colorful aesthetic, and good game mechanics make this a title that’s worth keeping an eye on.” — http://Hardcoregamer.com\n\"Thanks to its colorful art direction and a will to pay tribute to 80's action flicks, this game may have the qualities needed to satisfy people in search of a nice metroidvania.\" — http://Actugamer.net\n\"Blast Brigade is a humorous and “blaster-heavy” 2D action-adventure that will find many friends.\" — http://Gamodrome.de\n\"A very colorful Contra.\" — Trisha Hershberger\nAbout the GameBlast Brigade vs. The Evil Legion of Dr. Cread is an eye-popping 2D action-adventure inspired by the popcorn-chomping thrills of '80s action flicks. Assemble a crack team of heroes and use your platforming skills and puzzle-solving wits to traverse unique biomes, meticulously designed to encourage metroidvania-style exploration. Arm yourself with upgradeable weapons and perks, and embark on a daring mission to save the world from a mad scientist!\nGet the Team Together: Switch between four heroes on the fly! Blast off with all-American hero Jeff, channel the deadly rage of Soviet agent Shura, decommission enemies as the cyborg Scotsman Galahad, and help the chakram-wielding Vortex reclaim her island from Cread's legions.\nExplore a Metroidvania-inspired World: The many biomes of Dr. Cread's island may look as pretty as a postcard, but this ain't no holiday in the sun! Explore, backtrack, and trailblaze non-linear routes through gorgeous, interconnected levels towards your mission objective.\nCrush Monstrous Bosses: Test your mettle in epic boss fights against hybrid monstrosities, giant robots, cyborg ninjas, and other evil minions – all baying for your blood. Make full use of your skills, weapons, and expertise if you want to survive!\nUnleash Amazing Abilities: Overcome puzzles and enemies with Jeff's explosive grenade launcher, reach new areas with Shura's grappling hook, and warp around with Vortex's chakram teleporter. Use your wits as well as your fists to survive!\nSave the World: Unravel the evil plans of Dr. Cread in an action-packed story campaign. Assemble the Blast Brigade, combine their skills, and storm the island to bring this heinous villain to justice – once and for all!\nBlast Brigade vs. The Evil Legion of Dr. Cread is now available to play in Early Access! You can enjoy the following content right away:\nKickstart your mission with approximately 15 hours of gameplay\nRecruit 3 playable heroes to the Blast Brigade: Jeff, Shura, and Galahad\nExplore 6 unique biomes, from frosty mountains to golden beaches, frightening laboratories, and dense jungles\nNeutralize up to 30 unique enemy types\nBattle 7 different bosses, including a killer cyborg, a deadly ninja, and monstrous mutants\nThere’s more to come in the future! Add Blast Brigade vs. The Evil Legion of Dr. Cread to your wishlist to receive notifications about new content.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Allods Team Arcade","platforms":[{"id":0,"name":"PC"}]},{"id":254652,"name":"Apsulov: End of Gods","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65e/65ea0434536e4431c39625c9212b7004.jpg","description":"Far beneath the earth lies a place built in one man’s search for answers, control, and the mercy of the Gods. But as he delved deeper he found something buried, something locked away, to never again reach the surface of the nine realms of Yggdrasil. Something that now resides in Midgard, the human world, where it re-makes and exploits human technology to suit it’s own goals to leave nothing but destruction and misery behind.\nIn this world of human technology and mythological artifacts, chaos rules over the realm of man. It is in this chaos you find your purpose and destiny.\nYou awake in a sanctuary of steel and concrete, built to honor the Nordic Gods and to house an artifact, buried in the earth aeons ago.\nUnveil the secrets of the inhabitants, the artifact, and the nine realms of Yggdrasil in Apsulov: End of Gods.\nImmerse yourself in this Future Viking Horror-Adventure containing:\nNordic Mythology and Science-fiction\nImmersive environments\nAtmospheric sound and music\nA range of mechanics to aid you on your journey\nImportant notice: This game is in production. Languages, functions etc will be added to the page when it’s implemented in the game.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Angry Demon Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":67478,"name":"Wordament","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d2/4d2da41e85f33e6d00a4235debdbb0d4.jpg","description":"Why play against one person in a turn when you can play against thousands at once? Wordament® is a real-time continuous word tournament.  Players compete on the same board with everyone at once. Rounds offer challenges such as two- and three-letter tiles, themed words, speed rounds and more. You can be a champion in many ways: find the most words possible, earn the best score, find the longest words, best your Frenemies, or beat your top score. How you win is up to you.\n\nWordament tracks your progress by maintaining rich statistics about your gameplay including your best word found, total score, best word count, first place finishes and more. Xbox Leaderboards show you who's rocking it for the day, hour and overall. Climb the ranks and earn achievements and bragging rights along the way.  Will you be our next champion?","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Microsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":60191,"name":"Bullet Witch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fb/5fbad757fa71162546f26440d62e966a.jpg","description":"First, there was the earthquake. Then the war, then the plague, then the riots. In the span of a few short years, humanity suffered every disaster imaginable — and all as a prelude to the one we couldn't have imagined.\nAn army of literal demons marched straight out of Hell, trampling over the survivors wherever they found them. When they killed, they wore their victims' skins. When they conquered, they seized their enemies' weapons. Powered by supernatural evil and loaded with military hardware, they scattered us and ran us down.\nBut then she came. At first, we thought she was one of them — a woman in black, with a long gun like a witch's broom and the magical powers to match. Survivors whispered her stories in the alleyways: stories of battles so intense that they leveled whole city blocks, during which she mowed down entire demon regiments with flaming bullets, then shared her own blood to save the wounded. They say she can summon clouds of ravens, call up thorns from the ground, and even conjure up lightning and tornadoes at will.\nMaybe she flew down from Heaven. Maybe Hell spat her back out. Either way, she's all we've got.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nFirst released on the Xbox 360 in 2006, Bullet Witch offered a unique combination of Japanese dark-fantasy aesthetics and Western-style military action. This PC re-release brings the title to a new generation of gamers, improving the resolution, framerate, lighting, and game balance.\nAfter an army of demons takes over the world, the human resistance is on the brink of collapse. Just when all hope seems lost, a woman in black appears on the battlefield. She possesses a long gun like a witch's broom and an array of magical powers to match. Taking on the role of this mysterious savior, Alicia, you’ll fight through hordes of demon soldiers, mutated civilians, and even giants.KEY FEATURES\nThis Is My Broomstick\nAlicia's gunrod can transform on the fly into four different weapons, each of which can be enchanted for extra punch and special perks. Mow down enemies to charge your magic meter, then can call down thunderbolts, tornadoes, and even meteors to blast the rest of them to kingdom come. Few gaming heroines have ever wielded as much raw power as Alicia at her peak.\nThe Path of Destruction\nNothing is safe from your wrath, least of all the environment around you. Your magic can tear the roofs off of buildings, ignite an entire gas station, or level towers. If any enemies survive, use your telekinesis on the rubble to throw it at them and crush them flat.\nYou Are Not Alone\nYour strength and bravery will inspire the battle-hardened resistance fighters around you, and soon enough, they'll fight by your side. Use your magic to keep them alive, and they just might return the favor.\nAll DLC Included\nThe PC release of Bullet Witch includes all the original game's costumes and bonus missions for free. (Beat the game once to unlock the latter; the costumes are available from the start.)","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Marvelous","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":52080,"name":"LEGRAND LEGACY: Tale of the Fatebounds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b87/b87bad9282f719c21840e3ecc7f19c37.jpg","description":"LEGRAND LEGACY: Tale of the Fatebounds is a love letter to our all time favorite JRPGs with a fresh take on classic turn-based combat and tactics. Welcome to Legrand, a beautifully hand-drawn world riddled with curious creatures, devastating wars, and intriguing tales of vengeance and redemption. Embark on an epic adventure through this sprawling fantasy universe and fight alongside the Fatebounds as they attempt bring peace to Legrand! But be careful who you trust because everyone has a secret to hide…A fully immersive experience with stunning FMV, fully rendered 3D cinematics, and epic original soundtrack.\n3D models and original assets come together with gorgeously stylized hand-drawn backgrounds.\nAction packed turn-based combat and tactical warfare scenarios that will test the limits of your wits.\nRecruit craftsmen to restore the abandoned city of Dumville, play mini games, or embark on rewarding side quests.\nCollect loot from slain enemies to craft items and upgrade weapons.\nConfigure items and grimoires that characters can wield in combat or set combat formation.\nCommand the military might of nations in intense tactical battles.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SEMISOFT","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":51205,"name":"Lords Mobile","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/abc/abcd8ee4396e67f09a9ffcf24ce16f9f.jpg","description":"Clash with 250 million global players on both mobile and Steam! Dive into a world of strategy and chaos in LORDS MOBILE, the real-time strategy MMO game!\nExplore exotic magical lands thrown into chaos by terrifying monsters and powerful enemies. Choose your favorite heroes, make new friends, and charge fearlessly into war! Strike down your foes and build an empire!\nFEATURES\n☆ An Open-World Game ☆\nJoin with millions of players in an open world! See, chat, and clash with other players in this MMO game!\n☆ Finding Friends ☆\nUnite your allies in your kingdom and ride into war together!\n☆ Rule as the Emperor ☆\nClaim the throne in a battle royale for the kingdom! Will your legacy as a ruler be just or cruel?\n☆ Powerful Heroes ☆\nRecruit and upgrade heroes with unique skills and characters! Let them lead your kingdom to glory, or mix and match them to complete an RPG-style campaign that you will want to play again and again!\n☆ Master Your Strategy ☆\nHow will you prepare your troops for the clash? Try out new lineups and perfect your strategy! Find the best way to strike down your opponent in this top-notch MMO SLG!\n☆ Animated Battles ☆\nExperience the thrill of war as armies clash in beautiful 3D graphics!\n☆ Switching Kingdoms ☆\nEstablish your empire on new lands by moving to any server you want with a simple click!\n☆ Choose Your Path ☆\nWill you conquer enemy kingdoms and imprison rival lords? Will you liberate prisoners of war? Or will your kingdom and empire crumble to dust?\n☆ Summon Familiars ☆\nForge pacts with fearsome monsters and make them Familiars! Train and groom your new companions to their full potential. With their powers by your side, nothing can stand in your way!\nWrite your own legacy, only in LORDS MOBILE!\nNote: This game requires an internet connection to play.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"IGG.COM","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":51092,"name":"Disney's The Jungle Book","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/889/889baaf0f816565b1cf78dbfdc551ba1.jpg","description":"Get down to the bare necessities of life…\nPlay as the man-cub, Mowgli, an orphan raised by a pack of wolves in the jungle. No parents. No school. No problems. Great life, huh?\nExcept, there’s a rumour that Shere Khan, the man-eating tiger is coming after you. So now you’ve got to sneak, swing and swoop your way through the jungle, catch the tiger by the tail and reach the safety of the man-village.\nTo do this, you have to get the hang of incredibly tricky vines, neutralize venom balls, dodge coconut-throwing monkeys and fire off bananas at any scorpion, vampire bat or crazy ape that gets in your way. So eat your bananas and get ready – it’s a jungle out there!\n●Relive Mowgli’s classic adventure as you travel through over 10 levels – all weird, all wild and all totally different\n●Encounter characters straight from the classic Disney movie, including Bagheera, Kaa, Shere Khan and many more!\n●Jump, swing, climb and banana-throw your way through this adventure, collecting gems along the way","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Eurocom","platforms":[{"id":0,"name":"SNES"},{"id":0,"name":"NES"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Game Boy"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Game Gear"}]},{"id":46568,"name":"Sorry, James","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c50/c5016a1759641cd48ead4c93b38fa376.jpg","description":"You are James Garner, security engineer in Mantis Corp., leading tech company in weaponry field. You get usual task to decrypt company files. Unusual is that these files contain bizarre chat. Things become weirder, when you realize, that your job is to “hack love story”.\nWhy this is so important for Mantis?\nWhat can hide behind someone's conversation?\nWhat will you risk to find out the truth?\nSorry, James is story-driven puzzle game which take unusual step on storytelling. You will discover plot through dialogues of two strangers and learn a tale about James, whose role is to decrypt files containing that chat. Along with creepy thriller and conspiracy atmosphere there is unique game mechanic that reminds mix of Sudoku and Minesweeper-like gameplay.FeaturesSTORY. Witness non-usual storytelling, which revolves around hacking a love story.DIALOGUES. Based on chat with real people, psychology researches and real-life conversations.\nVISUAL. Dive into office atmosphere with elements of thriller in retro style graphics.\nGAMEPLAY. Unique puzzle experience mix inspired by Sudoku and Minesweeper.\nLEVELS. Half a hundred levels, that will satisfy both hardcore and casual players with up to 3-6 hours of gameplay.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Konstructors","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":38701,"name":"Dragon Nest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6de/6de2b3076180a184d51a2affcdb30a46.jpg","description":"关注我们欢迎加入玩家QQ群，或关注我们的社交账号，了解龙之谷最新动态！\n玩家QQ群：755702085\nB站： @龙之谷官方\n抖音：@龙之谷\n微博： @龙之谷官方微博\n贴吧： 龙之谷吧\nAbout the GameThe \"Dragon Nest: Ark of War\" version is now open! Infinite Ark [Past] - Deep Layers are now available, and the Glory Leaderboards are coming soon. The Orc Paradise is back for a limited time, clear it to receive great rewards. The Mid-Autumn Festival event is here; make mooncakes to earn L-Dragon Jade and abundant materials! New items are in the shop, including exotic travel outfits, a harp three-piece set, and the grand arrival of the new mount, Teddy Bear 4.0.\n\"Dragon Nest\" is a free-to-play 3D action-adventure game operated by Shengqu Games. With its unique control scheme, stunning game visuals, fast-paced combo combat, and intense PVP experiences, \"Dragon Nest\" has become a highly popular action-adventure game.\nLong ago, the Supreme God Desmodus commanded two goddesses to create the world. The Goddess Altairia created the Altairia continent, while her sister, the Goddess Vestine, created the mysterious land.\nAltairia is a charming world inhabited by ancient dragons, chaotic dragons, ancient beings who carry the will of the goddess, protective spirits of life and nature, as well as ordinary humans and animals. The Supreme God was very pleased with this creation. Vestine, in jealousy, gave Altairia a poison known as the \"Poison of Corruption,\" which brought her life to the brink of death.\nInfluenced by the slumber of the goddess and the Poison of Corruption, Altairia faced various crises. To protect their homeland, brave warriors embarked on epic adventures, battling against the mighty dragons...\nInnovative Control Scheme\nA departure from traditional gaming controls, this greatly enhances gameplay and the joy of manual dexterity, providing exhilarating combo combat.\nCombat Experience Comparable to Console Action Games\nA unique 3D unrestricted control system allows for combos, aerial juggling, pursuits, and evasions, offering a combat experience that rivals next-gen console action games.\nEpic Dragon-Slaying Journey\nCollaborate with a team of allies, become a dragon-slaying hero in the passionate world of Altairia, and challenge bosses nearly ten times your size using super-cool skills.\nIntense PVP Combat\nWith the innovative 3D unrestricted combat mode, engage in intense and thrilling real-time battles against other players online for an exhilarating experience!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Eyedentity Games","platforms":[{"id":0,"name":"PC"}]},{"id":29232,"name":"Transference","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b3/9b342bb362066076f7c75d637987e974.jpg","description":"Transference™ is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft.\nBridging the gap between movies and games, lose yourself in the destructive tale of a man’s obsession as you explore his digitally recreated memories.\nA PSYCHOLOGICAL THRILLER THAT MERGES MOVIES WITH GAMES\nCharacter-driven stories tackling emotional and human experiences that challenge conventions, combined with the experience of building rich gameplay.\nUNFOLD A MYSTERY AS YOU SOLVE THE RIDDLE OF A FAMILY\nCome face to face with a fractured family as you freely explore their minds. Navigate a dream-like home filled with secrets. Collect the evidence of a family’s history to choose how you repair their lives.\nA MULTI-BRANCHING NARRATIVE WHERE YOUR ACTIONS DETERMINE A FAMILY’S FATE\nAffect their lives from the unique perspectives of each family member to piece together the mystery. The choices you make from every angle ripple through time and space, as you learn their story.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":24227,"name":"Pro Evolution Soccer 2013","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e63/e634a4493d4771c4eb8e335b24101492.jpg","description":"Pro Evolution Soccer 2013 returns to the roots of soccer with unique\nlevels of control plus major emphasis on the individual style of the\nworld's best players.\n\nThanks to feedback from dedicated fans, PES2013 offers total freedom to\nplay any kind of ball, which for the first time includes full control\nover shooting and first touch. Endorsed by Cristiano Ronaldo and Neymar,\nPES will continue to push boundaries, perfectly reflecting the genius of\ntop level players and capturing the essence of modern teamwork. The\nresult will be the most faithful recreation of modern\n\nFeatures\n\n- Total ball control and freedom of play\n- Worlds top licenses and\ncompetitions in cluding UEFA Champions League and Copa Santander\nLibertadores\n- Use PlayMaker controls to string together your\nfavorite moves\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":21600,"name":"Lightfish","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90e/90e846866d62701a5a0a5a1c3e9871ca.jpg","description":"LightFish is a highly addictive arcade game, where the user controls a small fish who lives in the abyssal deeps of the ocean... surrounded by deadly creatures. His objective is to destroy all the monsters who inhabit those dangerous zones by drawing lines onto unexplored territory. However, any enemy who manages to touch the Lightfish will kill him instantly!\nLightFish is a classic concept evolved into something new and exciting, with unique features and an original soundtrack. Immerse yourself in a colourful world full of beautiful yet deadly sea creatures and progress through the numerous levels the game offers!\nKey Features:\t\t\t\t\t\tClassic gameplay evolved and enhanced\n2 different game modes\nOriginal soundtrack\nUnique graphic style adapted to gameplay\nScore challenges that encourage replayability\n10 enemy types and 45 unique levels\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Eclipse Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20775,"name":"Intake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb4/eb45d83a308530afc0c861233d95dace.jpg","description":"Just UpdatedMake way for the MAYDAY launch and update!\nCoinciding with the release of Intake on iOS we've pushed a brand new update to Intake on Steam! It includes a handful of gameplay tweaks, some new features, and some bug fixes!\nGameplay: Challenge levels during regular gameplay and pro mode now appear at intervals of five levels.\nGameplay: Flashbangs appear starting at level five.\nGameplay: Removed the game over level bonus from appearing in level one.\nGameplay: Challenge Modes are now 25 levels longs.\nFeature: \"No Nonsense Mode\" turns off level up shield transitions and the bonus level, so you can get more playtime faster.\nFeature: Gartnervision is a toggleable visual effect for the letterboxes. No effect on gameplay, it's just sexy.\nFeature: Tweet button to tweet your score.\nBug fix: The rank badge display in Challenge Mode always shows the proper rank.\nBug fix: Shortened transition timing across the board.\nBug fix: Streamlined some loading times.\nBug Fix: Improved loading performance.\nBecause of the dramatic changes to gameplay, we're clearing the leaderboards.\nEnjoy!\nAbout the GameIntake is the new retro-futuristic drugstep arcade shooter from Cipher Prime. In this polychromatic love child of Dr. Mario and Ikaruga, you battle a never-ending barrage of pills, pushing your skill and reflexes to the limit to avoid a lethal dosage. Blast and combo your way through an epic cascade of audiovisual mayhem so intoxicating it comes with its own warning label.FEATURESClassic Arcade Shooter: From its aspect ratio to its fast-paced game play, Intake is directly inspired by classic arcade shooters and SHMUPs with just a hint of FPS love.\nAchievements: Over 70 finely tuned achievements that will teach even the most hardcore player new tricks. These are not your typical progress-only achievements.\nHigh Scoreboard and Game Stats: Keep track of your high scores and decimate your friends.\nChallenge Modes: Acceleration, Minefield, Reaction, and Flood modes will challenge every aspect of how you play.\nGameplay Changing Features: Grab vitamins while you play and trade them in for intense game upgrades. You can even turn the game into a SHMUP if you show your skills.\nDubstep Soundtrack: Infinite wubs. Classy ones.\nColorblind Modes: Intake offers colorblind modes for players with deuteranopia, protanopia, and tritanopia.\nFull Steam Support","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cipher Prime Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19238,"name":"Magicka: Wizards of the Square Tablet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a67/a67d19aba7363e99d25aaa9b200e2e23.jpg","description":"Exclusively for the PC version your wizard will get all in-game robes and staffs unlocked from the start in this enhanced square edition. Remove the grinding time and get right to the action with your choice of gear!  All of these goodies will be unlocked on every other platform you choose to play on\nThe once wandering wizards have found their way back home in  Magicka - Wizards of the Square Tablet, now available for PC. Experience the mobile hit on your squarish and almost certainly, stationary monitor.  But fret not, if any wizards still happen to be wandering you can still accidently kill them with cross platform support across  all  devices.\nFrom the publisher that brought you Magicka, it’s more Magicka! Wizards of the Square Tablet features the innovative and dynamic spell casting system from the original PC hit.  Experience a brand new campaign set prior to  the original tale of Magicka.\nAdventure through the new campaign by yourself, or “accidentally” obliterate your friends in multiplayer co-op, which supports up to four players! Play together with fellow mages across multiple platforms, which may co-exist in the same game session thanks to a twisted union made possible by dark sorcery!\nCast your spells across multiple levels, and unlock new powers unique to  Magicka – Wizards of the Square Tablet. Experience the humor and chaos of this satirical fantasy world.FeaturesCross Platform Gameplay (iOS and Android versions sold separately)\nCombine elements to create thousands of spell combinations\nAll-new campaign for single or multiplayer\n4-player mayhem with many “accidental” team-kills\nNew items and powers unique to Magicka – Wizards of the Square Tablet","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ludosity","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":14686,"name":"Immune - True Survival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08a/08a5cc5e3cccd929bcc07fe50dfc04ce.jpg","description":"Experience true survival with a wink in the world of Immune - the new open-world online game.\nSurvive the wastelands with the help of your friends and your hand crafted weapons. Build your own fort to defend yourself and your hard earned loot from evil mutants, bandits or reckless players.Features:Multiplayer survival with XP, ranks and missions.\nOptional PVP and PVE with wild animals, soldiers and mutants.\nCraft weapons, clothing or tools and build your own fort.\nPlant, grow and harvest your own food or just go fishing.\nOpen cases and collect, trade or win rare Steam Inventory items to customize your character.\nHealth conditions, medicine, vehicles, trading and much more to discover.\nXP: Experience Points\nPVP: Player Versus Player\nPVE: Player Versus Environment","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"vidiludi games and entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3000,"name":"OPUS: The Day We Found Earth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0f/e0f835e31b98fdb24f85b804f51a4f23.jpeg","description":"Just Updated\nAbout the GameDive into the boundless galaxy and embark on an emotional adventure!\nHelp our little robot, Emeth, to fulfill a century-old promise by finding Earth in order to save Mankind—so step into the spaceship, operate a deep space telescope, and find out what’s out there in the unknown.“A robot without a goal is nothing more than a calculator. So, listen up... Your goal, is to find Earth. Do we have a deal?”- Dr. Lisa, the creator of the robot and who believes that Earth is not just a myth.“We have a deal… Emeth will find Earth!” - Emeth, the robot.\nAn atmospheric experience with a rich story\nA whole galaxy to explore and get lost in\nSecrets of mysterious planets to be uncovered\nMeticulously crafted art\nA beautiful soundtrack to chill out to\nExperience an emotional, atmospheric story of purpose and pursuit.\nIn the far future, humanity has lost its way back. Help the childlike robot Emeth carry on his creator's will to find our long lost home, earth, together, as he realizes a greater purpose inside his tiny mechanical heart.\nAs the adventure begins, players operate an evolving space telescope to find Earth by scanning nearby stars. Also, the game is like a visual novel in which players can explore each crew member’s secrets scattered around the spaceship with rich narration.\nEnjoy a full soundtrack of original music from composer Triodust.Woven deeply into every corner of the game. Prepare to lose yourself in the organically generated soundscape while wandering through the galaxy!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SIGONO","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2400,"name":"There Came an Echo","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/274/2740df566cd0181b4277d25e07ae1dc3.jpg","description":"***Note: There Came an Echo, though designed primarily for voice commands, is fully playable without them.***\nEnder Wiggin. Admiral Ackbar. That dude who commands the G.I. Joes. These totally rad commanders knew that battles are won not by a single footsoldier, but by issuing precise commands that put their units in position to achieve victory.\nIn There Came an Echo, follow in those commanders' footsteps by giving orders to Corrin Webb (Wil Wheaton) and his squadmates in a unique real-time strategy experience. Using an advanced voice recognition system, direct your units through a variety of mission types against foes armed with futuristic energy weaponry and personal force fields. Make your move with standard commands (\"All units, advance to Bravo 3!\") or utilize custom variants to express your unique personality (\"Everyone, do the worm over to Buttface 3!\"). Keep it classy, folks.\nFollow a complex, character-driven sci-fi plot: Corrin, an ordinary cryptographer, is thrown into a deadly game of secret agendas when a group of mercenaries tracks him down in Santa Monica, California. Guided by the mysterious Val (Ashly Burch), Corrin must escape from a foe with seemingly limitless resources and discover what secrets his own unbreakable algorithm, Radial Lock, is safeguarding...information that, if released, will rattle the very foundations of reality itself. Also starring Laura Bailey, Yuri Lowenthal, Cassandra Morris, Rachel Robinson, and Cindy Robinson.\nKey Features:\nExperience an epic single-player campaign that focuses on plot and character development over the course of the game\nUtilize a robust voice command system, or use standard keyboard/mouse/controller methods\nCustomize every command, unit, and location in the game to literally any word or phrase\n20+ track original score by phenoms Ronald Jenkees and Big Giant Circles\nNumerous language models supported, including various English-language accents and foreign languages!\n(Note: if your Intel® RealSense™ needs updated firmware to function properly, please see instructions in this thread: http://steamcommunity.com/app/319740/discussions/0/530646715632003344/)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Iridium Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]