[{"id":97766,"name":"Out There: Omega Edition","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de2/de2cdcbbf1c5cfd6434cbbd56afdc873.jpeg","description":"Out There is an award-winning space exploration game blending roguelike, resource management and interactive fiction\n\nYou are an astronaut awaking from cryonics not in the solar system, but... out there... in a far and unknown place of the galaxy. In Out There, you will have to survive, tinkering your ship with what you can gather drifting in the void, and spot garden planets to refill your oxygen supply.\n\nSpace is an hostile place ; dangerous and mysterious adventures will mark each step of your travel. You will not only meet intelligent species that won't care about you, but also deal with ancient powers linked to your destiny and the fate of mankind itself.\n\nSurvival and understanding of what is really at stake in the galaxy is the core of what Out There has to offer.\n\nMusic by award-winning composer Siddhartha Barnhoorn (Antichamber, The Stanley Parable)\n\n• 59 achievements, 1 leaderboard\n• A dark and melancholic, hard sci-fi adventure\n• Explore a freshly procedurally-generated galaxy every new game\n• 350+ multiple choices handwritten game book adventures\n• Epic main storyline with 4 different endings\n• 10 spaceships with different specs to discover\n• Crafting system with 20 alien technologies built from 15 materials\n• Engage with alien life forms and learn their language\n• No combat ! It's you against the environment\n• Eerie score by award-winning composer Siddartha Barnhoom (Antichamber, The Stanley Parable)\n• Fantastic pulp comics graphics\n• High replay value","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":8830,"name":"Windosill","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eed/eed18cd9bc7694d220be237330f83571.jpeg","description":"Explore a dream-like world of impossible wonders...\nExplore 10 different immersive, animated environments\nInteract with dozens of physics-based creatures and objects\nSolve brain-tickling puzzles to unlock new rooms and reveal new surprises\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Vectorpark","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":19562,"name":"Hot Tin Roof: The Cat That Wore A Fedora","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf3/cf3960c13b36100483e6d3530f1ba169.jpg","description":"You’re the Private Investigator on a string of grisly murders, scouring for clues in a 3D side-scrolling world. Grab your fedora and revolver - in Hot Tin Roof you’re on the case! Dive into a noir mystery and become Emma Jones, the only PI partnered to a cat named Franky.\nNoir as heck.\nMetroidvania meets Adventure Game in a side-scrolling 3D world, with tons of platforming and exploration\n4 distinct plot threads, with 15 different resolutions.\nInstead of acquiring abilities, you find new revolver rounds, which you load into your revolver yourself. Combine them in unique ways!\nScour the world for clues! Use them in conversations to unlock secrets, solve murders and more.\nCats. More cats than you could shake a cat at. Also, pigeons and rats. Many wearing tiny hats.\nSpiffy chip noir jazz soundtrack.\nIt’s a dog eat dog world out there, but luckily? A cat has your back. Franky. The cat that wore a fedora.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Glass Bottom Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16715,"name":"Cultures - 8th Wonder of the World","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c1f/c1fcf53ccfc99d3852dec02ee69ebea0.jpg","description":"Buy Cultures - Northland:http://store.steampowered.com/app/351860/\nAbout the GameCultures - 8th Wonder of the World takes place some years after the end of Cultures - Northland. The renowned hero Bjarni and his friends, retired after their last adventure and enjoyed their day-to-day lives. This peace was not meant to last as one day the powers of darkness and evil slowly began spreading all over the world. The greatest heroes of the past were summoned. The people cried out to our friend Bjarni, who immediately set out to save mankind from the clutches of doom and misfortune once again. The destiny of Bjarni’s people, and with them the destiny of all humanity, now lies in your hands. You must solve the mystery surrounding the 8th Wonder of the World with your heroes and banish evil from the Earth!\nThree difficulty levels that make the game fun for anyone from strategy novices to battle hardened veterans.\nExplore unknown territories and establish trade routes with other tribes.\nWatch as your inexperienced fighters grow into fearless heroes of great renown.\nSolve a number of challenging quests and adventures and meet old friends and enemies.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Funatics Software","platforms":[{"id":0,"name":"PC"}]},{"id":10292,"name":"Battalion 1944","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bad/bad8be7e7cd7d227e977f83ed4876a7b.jpg","description":"Closed Alpha & Beta Access!\nGet access to the Battalion 1944 Alpha, Beta and Early Access versions!\nAbout the GameBattalion 1944 recaptures the core of classic multiplayer shooters and propels WW2 into the next generation. Battalion 1944 utilizes the most advanced industry technology to create a visceral and heart-thumping multiplayer experience that has been crafted by the designers who have grown up playing Medal of Honor and Call of Duty 2.\nFight in real world locations such as the streets of Carentan, the forests of Bastogne and many more in our spiritual successor to the great multiplayer shooters of the past. Precise aim with your Kar98, covering fire with your M1 Garand and quick thinking with your Thompson are key to your success, all packaged into a competitive multiplayer environment.\nJoin a Battalion and compete season to season with BattleRank, our global competition system. Contribute to your Battalion's season objective to earn cosmetic rewards for your character, weapons and accessories within our realistic art style. Flaunt your success through your player profile to become a renowned player within the community. BattleRank’s highly tuned stat tracking system enables Battalion 1944 to go beyond the standard mould of shooters gone by and enables players to compete globally for rewards, glory and honour.\nFuelled by the power of Unreal Engine 4, Battalion 1944 resurges World War 2 back into the modern gaming spotlight in our spiritual successor to the great multiplayer shooters of the past such as Call of Duty 2 and Day of Defeat. On BattleRank, it’s down to skilled soldiers like you to fight for your battalion.\nIn short, Battalion 1944 is an infantry based first person shooter with an emphasis on raw skill. No grinding, no 'exosuits', just you and your skill as a player.Key Features\nRaw skill based gameplay. We believe your skill should be determined by your play, not through unfair overpowered unlocks & abilities. Battalion takes design influence from classic skill based competitive shooters and merges that classic game feel with stunning next gen visuals and a fluid modern user experience.\nIntense & balanced infantry combat. Our designers have played hundreds of multiplayer games to design the perfect formula for a well balanced WW2 shooter. The excitement in Battalion 1944 lies in the intense infantry combat and authentic down the barrel experience.\nBattleRank. Fight as a lone wolf or team up alongside your friends. Contribute to your Battalion's season objective, receiving cosmetic & XP rewards for team and individual victories. Compete in regular challenges, ranging from seasonal to quick fire hourly objectives to earn rewards and extra XP. Challenges are broadcast via the main menu's BattleRank panel as well as the Battalion 1944 social channels.\nBeautiful & realistic environments. Our incredibly talented art team are designing a visually stunning recreation of World War 2, travelling to Normandy to gather reference and research the war to make Battalion's weapons, buildings and environments as authentic as possible.\nCosmetic Progression System. Our progression system will not under any circumstances offer game breaking advantages to players of higher rank but instead will offer a purely cosmetic based unlock system. When you gain XP you will be rewarded with visual upgrades for your character, accessories and weapons within our realistic art style guidelines. This way players can shape their own identity and become a renowned and recognisable player within the community whilst still retaining an authentic World War 2 experience.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Bulkhead Interactive","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":2098,"name":"Rebuild 3: Gangs of Deadsville","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05e/05e9610afcbc7fad8cc89d44847e0ed6.jpeg","description":"It's been a few years since the zombpocalypse turned the world's cities into graveyards and sent the few survivors into hiding. Now you must gather them up and restore civilization to a ruined city, one building at a time.\nRebuild 3 is a strategy sim game with a good helping of narrative and dark humor. It's a thoughtful game that'll make you fond of your survivors before you send them to their deaths for the greater good. As you expand your fort to new buildings, you'll decide between farms or fortifications, housing or hospitals, and make tough decisions to fend off raiders, illness, starvation, and madness. And the dead are still out there wandering the streets, hungrier than ever.\nRebuild 3: Gangs of Deadsville is the third of my Rebuild series, and the first one available on Steam. It's a totally new, much bigger game than the first two.Features\n4X style strategy and city (re)building\nEndless replayability with randomized cities and events\nSurvivors with individual skills, perks, relationships, and stories\nRival NPC forts with their own agendas, friendly or otherwise\nCampaign Mode, a journey through cities of increasing size and difficulty\nStrategic fort defense and interactive attacks\nPlay in either real-time or turn-based mode\n5 skills: defense, leadership, scavenging, building, engineering\n10 resources and one-use items to find or craft\n30 missions: scavenge for food, kill zombies, farm, fish, trade, bartend...\n35 node research tree\n50 building types with unique uses and/or scavengeable resources\n70 types of equipment to find\n100 survivor perks: Melee Training, Green Thumb, Light Sleeper...\n200,000 words of event text - enough to fill two novelsBonus features in the Deluxe Survivalist Edition\nDesktop version of Rebuild 1 (previously only available in browsers)\nDesktop version of Rebuild 2 (including \"winter\" mobile content)\n5 bonus professions for your main leader\n5 corresponding unique items\nPDF artbook","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Northway Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":1019,"name":"LEGO Harry Potter Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e51/e51f9a3d6694ceb8bbae0124593f7bd8.jpg","description":"The LEGO® Harry Potter™ Collection brings LEGO® Harry Potter™: Years 1-4 and LEGO® Harry Potter™: Years 5-7 to the PlayStation®4 computer entertainment system for the first time with both top-selling videogames remastered on one disc! This compilation unites the creative prowess of LEGO and the expansive world of Harry Potter, with an exciting journey full of spell-casting, potion-making, puzzle-solving, lessons, dueling and much more for players of all ages to enjoy.\n1-2 players\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nLEGO HARRY POTTER: COLLECTION software © 2016 TT Games Ltd. Produced by TT Games under license from the LEGO Group. LEGO, the LEGO logo, the Brick and the Knob configurations and the Minifigure are trademarks of the LEGO Group. © 2016 The LEGO Group. All other trademarks and copyrights are the property of their respective owners.  All rights reserved.\nHARRY POTTER characters, names and related indicia are trademarks of and © Warner Bros. Entertainment Inc.  Harry Potter Publishing Rights © JKR.\nWB GAMES LOGO, WBIE LOGO, WB SHIELD: ™ & © Warner Bros. Entertainment Inc.\n(s16)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":38218,"name":"World of Warcraft: Wrath of the Lich King","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/437/437de3c9cbcde991cd06c85e024902bb.jpg","description":"In the wake of the Sunwell's purification, a period of suspicious quiet had swept over the world. As if on cue, the undead Scourge launched a massive assault against the cities and towns of Azeroth, this time extending its reach far beyond the Eastern Kingdoms. Under pressure to respond with a full army, Warchief Thrall deployed an expedition force to Northrend led by Overlord Garrosh Hellscream. Meanwhile, the missing human king Varian Wrynn at last returned to Stormwind City and reclaimed his crown. He sent an equally powerful Alliance army, commanded by Bolvar Fordragon, to defeat the Lich King—and any Horde forces who would stand in their way.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16138,"name":"Pankapu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf9/cf96a67b28719ac0d12270a35d0964f2.jpg","description":"Jump into a neo-retro adventure with Pankapu : a taste of 90’s platformers in an oneiric world. Pankapu is a narrative action-platformer that takes place in the dreams of Djaha’rell, a child troubled by a tragic incident. Upgrade your skills, find new competencies, switch your Aegis in real time in order to get rid of Nightmare's invasion: \"Fight for the safety of your land, dear Dreamkeeper\"\nTold in the manner of a fable read to a child, the game has two levels of reading: the tale of Pankapu, epic and naïve, and the one about Djaha’rell's life, in the real-world, dark and tragic.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15350,"name":"Order of Battle: World War II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/680/680754c0b53ab997c8fc37ec649ffac5.jpg","description":"Just Updated\nBlitzkrieg, the new DLC for Order of Battle: World War II, is OUT!\nIn this new DLC you take command of the German armed forces for the first time! Lead your army through 12 new exciting scenarios covering the first two years of war from the German perspective! With +200 new units, 9 new nations and plenty of new features!\nhttp://store.steampowered.com/app/528620/\nSteam Exclusive Offer\nBuy a complete-your-set bundle containing all the 4 DLCs set in the Pacific theater at a huge discount - 40% off!\nhttp://store.steampowered.com/bundle/1999/\nAbout the GameThe free version of the game gives you access to the unique Boot Camp campaign as well as a taste of the first chapter of every other campaign pack. This means that new free missions will appear as soon as a new campaign gets released!\nOrder of Battle: World War II is breath of fresh air for all strategy fans. It is a game that takes wargaming to a new level by upgrading every single game element and rebooting the genre for a new generation of players. Detailed terrain, rich animations and a slick interface, all within a traditional setting and with the elements that are familiar to experienced players - Order of Battle: World War II follows in the footsteps of all time classics, such as Panzer General.\n\nWith a selection of over 700 unique looking and behaving units, players can build and manage their army, fleet and air force throughout the campaigns set in the various theatres of operations during WW2. A unique system of specializations allows players to customize their forces with special units, bonuses and abilities that reflect the difference in strategies and mentality of the various factions.\n\nA set of unique Commanders – split between Generals, Pilots and Captains – is gradually unlocked in the campaigns. These can be attached to specific units to provide unique bonuses to anything in their command range. While good use of unit types and tactics remains the player's priority, clever use of Commanders can tip the balance in an offensive operation or buy just enough time in defense to turn the tide to your favor.\n\nIn Order of Battle: World War II, a unique supply system also plays a key factor that directly affects the combat efficiency of the units. Landing on an enemy island without any support ships will prevent the invasion forces from building a solid beachhead, and breaking the supply lines of your opponent, isolating his units and making encirclement maneuvers are the strategies required to achieve an ultimate victory.\n\nAdd an intuitive in-game scenario editor, up to 4 player multiplayer support through Hotseat or Slitherine's PBEM++ server system and you have a game with endless re-playability.\n\nClassic turn based, hex based gameplay with an intuitive UI and great depth.\nPlay in dynamic campaigns with unit carryover and multiple \"what-if\" scenarios.\nA rich 3D world with detailed animations and effects. Turn-based wargaming has never looked this good!\n20 different Specializations give a unique feel to each faction including Banzai Charge, Bushido Code and even the Manhattan Project.\nOver 700 different unit types, including infantry, tanks, ships and aircraft, each with unique visuals and animations\nAttach unique commanders to your units to give them additional offensive and defensive bonuses\nA deep but intuitive supply system allowing breakthroughs & encirclements.\n4 player multiplayer over PBEM++ and hotseat, supporting last-man-standing, teamplay and cooperative against AI scenarios.\nAn extensive, user-friendly in-game scenario editor with a what-you-see-is-what-you-get design.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Artistocrats","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":12251,"name":"Insanity Clicker","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7a/d7a6caa1e9fe7656ee64e515635b5321.jpg","description":"Been looking for the thrill? Then you've come to the right place! Here is a terrifying survival simulator of an abandoned hospital with elements of horror, which will keep you in suspense throughout the game! Insanity Clicker is a time-killer game full of horror and fear  that will make you tremble in a couple of minutes!\nImagine: you are alone, the sounds of heads and fists beating behind the bare walls around you can be heard even through them... What's going on here?! First thoughts: I want to get out of here as quickly as possible, but... Am I strong enough?\nOne click, two clicks - and you're not so weak and vulnerable as you were a moment ago! More clicks, more power! Hitting the wall becomes automatic with time! The one has to be hardy, need to adapt to this place. Pills, mutagens - consume everything you need to stay sane! But they also have to be found somewhere, so  clench your fists and step into the unknown!\nStill not scared? Then we got tell you about the inhabitants. Maniacs, madmen and mutants – are just a small part of the population of this place. And now the most interesting part - each of them is ready to eat you alive, tear you up into pieces or just kill by the injection of a deadly vaccine. Yeah, deranged former doctors of the hospital will also join the party!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PlayFlock","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3621,"name":"My Singing Monsters","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e4/6e4fb66651c629ad8a471211b975bdeb.jpg","description":"Welcome to My Singing Monsters! Breed them, feed them, listen to them sing!\nRaise a monster pet, then feed your musical monster to help them grow. Take care of a collection of fun monster characters in this free musical game for the whole family!\nCreate an island full of Singing Monsters, then watch your song evolve as you breed and upgrade happy monster pets. Design and build unique decorations to make your world look just the way you want, then share your creation with friends! You'll love exploring the wonderful fantasy land of the Monster World!\nHappy Monstering!FEATURES:Collect and level up over 250 cute and funny monsters — dragons are so last year… Customize your islands with cool decorations and catchy music Enjoy awesome graphics and character animation Play with friends around the world Discover new updates and events year-round","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Big Blue Bubble","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":3515,"name":"Pro Evolution Soccer 2015","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c51/c511b48dbaa5e1ca5f02a94b5cc70b31.jpg","description":"KONAMI returns to the football field with PES 2015 with a return to core PES values.\nDownload the game that has won IGN's Prestigious 'Best of 2014 - Best Sports Game' and Gamescom's 'Best Sports Game' of 2014.\nThanks to the incredible FOX Engine, PES 2015 delivers stunning visuals and animation where the world’s greatest players move and play just their real-life counterparts, while PES ID ensures that the whole team matches their famed playing style. Every gameplay element has been retooled for a more responsive experience, while new shooting and goalkeeper systems ensure the heart-in-mouth feeling that comes with a top-level game is faithfully recreated. Close control, tackling, and the balance of play also perfectly reflect that of real football. Similarly, players can now use the new myClub system to develop an all-conquering side, building from humble beginnings to create a world-class XI.\nWith all-new multi-player modes, real-life managers pacing the touchlines and new live data, PES 2015 does its talking on the pitch.\n1-2 players\nHDTV screen resolution: 720p, 1080i, 1080p\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nOfficial Licensed Product of UEFA CHAMPIONS LEAGUE™. Official Licensed Product of UEFA EUROPA LEAGUE™. All names, logos and trophies of UEFA are the property, registered trademarks and/or logos of UEFA and are used herein with the permission of UEFA. No reproduction is allowed without the prior written approval of UEFA. adidas, the 3-Bars logo, the 3-Stripe trade mark, adipure, Predator, Climacool, Nitrocharge and adizero are registered trademarks of the adidas Group, used with permission.  F50 and 11pro are trademarks of the adidas Group, used with permission. The use of images and names of the football players in this game is under license from FIFPro Commercial Enterprises BV. © 2014, DFB  Officially licensed by FIGC. Licensed by OLIVEDESPORTOS (Official Agent of the FPF). Producto Oficial Licenciado RFEF. Liga BBVA 14/15 Product under Official Licence from the LFP www.lfp.es  Images and names of Liga BBVA football players under LFP license. All other copyrights or trademarks are the property of their respective owners and are used under license. ©2014 Konami Digital Entertainment.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"PES Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":936663,"name":"Fortnite Looping","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/974/974676610d3b9ab0d7c3c9803225aa5c.jpg","description":"Get ready to drop into the ultimate Zone Wars experience with our action-packed Fortnite fangame! Available on Android and PC, players will build structures, and engage in intense combat against other players in a fight to be the last one standing. With customizable characters and a variety of weapons and items to collect, every match is a new adventure in this thrilling fan-made version of the beloved game.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Germans Projects","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":868086,"name":"Silent Hill 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/09b/09b41c1a2c5761c5b1772a4ae238bb0e.jpg","description":"Having received a letter from his deceased wife,\nJames heads to where they shared so many memories,\nin the hope of seeing her one more time: Silent Hill.\nThere, by the lake, he finds a woman eerily similar to her...\n\"My name...is Maria,\" the woman smiles. Her face, her voice... She's just like her.\nExperience a master-class in psychological survival horror―lauded as the best in the series―on the latest hardware with chilling visuals and visceral sounds.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Bloober Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":21504,"name":"Showtime!","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/64d/64dc39fbf4fb5e1df988564900b0a02c.jpg","description":"Download the demo today @ http://www.myrtilusentertainment.com/showtime.html\n\"Showtime!\" will allow you to control and build your very own movie studio from the ground up! As a newcomer to Tinseltown it will be your job to create movies your audiences want to see as well as develop new technology to stay relevant in the film industry.\nCreate the type of movies you've always wanted to make! Or buy film rights from other studios to reboot a franchise.\nContract actors/actresses to your studio to use them whenever and whatever you desire!\nStay ahead of the curve by upgrading your studio facilities and keeping up to date in the latest film and sound technology.\nThe in-game Editor allows you to easily customise almost every facet of the game - from actors/directors/producers to film titles, studios and even critic reviews (plus much more!)\nShowtime! will also allow you to import your very own movie posters.\nFeaturing 9 dynamic AI studios to compete against. Compete for the #1 spot to receive annual government bonuses and rewards!\nHave aspiring screenwriters pitch you movie ideas, or build your own scriptwriting office to do it for you!\nCompete against the highest grossing movies of all time for the top spot in the Hall of Fame\nCheat your way to the top! Think of a famous quote and try your like... Psst; \"I love the smell of napalm in the morning\" torches your competitors' studio lots! -- And you didnt hear that from me ;)\nDesigned for Windows Vista, 7 & 8 ONLY (Note: Windows 10 experience may vary)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Myrtilus Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20974,"name":"Famaze","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc0/fc0b1df7114034b12ac6c49541adecd2.jpg","description":"Famaze is a retro themed puzzle adventure game. The game combines charming SNES era visuals and sound, randomized \"roguelike\"mazes, strategy and puzzles, rpg elements, and a fun lighthearted story. The game is simple to pick up but offers endless replay because of the procedural nature of its levels.\nThe story of the game involves a mad king who has captured the happy rutabagas of the land and has turned them into evil monsters to guard his kingdom while he searches for the elusive perfect recipe for rutabaga pudding. The heroes of the land (a knight, thief, or wizard) must delve deep into the king's domain to rescue the rutabagas, find the gem of truth to unravel the secret recipe and put a stop to the mad king's plot.\nOriginal soundtrack by Disasterpeace\nArtwork by Oryx\nProcedurally generated puzzle dungeons created infinite replayability.\nEnvironmental variables including treasure chests, pit traps, healing blocks, and magic beacons.\n3 heroes to choose from with powerful unique abilities.\nUseful items including potions, fireballs, teleport orbs, and magic crystals.\nCollectible hidden artifact pieces meta game with artifact summary screen.\nA fun, lighthearted story line.\nAn original soundtrack including 23 unique tracks by Disasterpeace\nDetailed stat tracking including gold, high scores, types of monster kills, etc.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Oryx Design Lab","platforms":[{"id":0,"name":"PC"}]},{"id":12703,"name":"Sleeping Valley","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/982/9822844947262f94178da4139ef8a9a3.jpg","description":"Sleeping Valley - a new arcade platformer game\nIn Sleeping Valley you only have one life to live and it's your job to see how far you can take this cute character on his brutally hard journey.\nContols are easy to understand: you can move character with the arrow keys and jump over brutal obstacles by pressing the space bar.\nFeatures:\n- Many colorful stages\n- Lots of different and hard levels\n- Easy on the eyes\n- Ambient Soundtrack","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"White Dog","platforms":[{"id":0,"name":"PC"}]},{"id":5415,"name":"Rayman 2: The Great Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b7/2b7252fb74d5db2372144a0fb03812da.jpg","description":"Rayman 2: The Great Escape is a platform video game developed by Ubi Pictures and published by Ubi Soft for the Nintendo 64, Microsoft Windows and Sega Dreamcast. An enhanced port titled Rayman Revolution (Rayman 2: Revolution in North America) was developed by Ubi Soft Annecy for the PlayStation 2.\nSubsequently it also released on Nintendo DS & 3DS as well as the PS Vita and on mobile.\n\nRayman 2 takes place in a world called the Glade of Dreams, and revolves around its invasion and occupation by an armada of interstellar Robo-Pirates, led by Admiral Razorbeard. Prior to the invasion, the Robo-Pirates destroyed over one hundred planets in the galaxy, with the intention of enslaving their inhabitants. Upon the invasion of the Glade of Dreams, the Robo-Pirates were battled against by Rayman, Globox, and other allies. After some battles, Rayman's capture occurs after the explosion of the Primordial Core. Ly the Fairy telepathically communicates with Rayman explaining the consequences of the damage, with the core's shattering into 1000 Yellow Lums, and the capture of many fighters. Rayman's powers are also lost due to this, and he finds himself captured by the Robo-Pirates at the beginning of the game.\n\nRayman's job after escaping the pirate ship is to collect all 1000 yellow lums, kick robo pirate butt and smash all the cages he can find to free the denizens of the Glade.\nHe will have various encounters, nice and not so nice, on his way who will help him get stronger throughout the course of his story and rid the planet off the pirates once and for all!\nJump, throw, plum-ride, helicopter, swim your way through the various platorm stages that will keep you occupied and enjoy Rayman's first ever jump into the 3D space considered elevating 3D platformers to the next level around the turn of the century.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Ubisoft","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"iOS"}]},{"id":2095,"name":"Tiny Troopers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3af/3af18fb4c3313c119f9af53a25775831.jpeg","description":"New Zombie Mode\nThe Tiny Troopers zombie mode includes:\nFace endless waves of brain-munching zombies, including undead chickens!\nUtilise air dropped crates of special weapons to lay devastation on the zombie hordes!\nUse all your favorite Special Forces troopers to take down the undead.\nSurvive as long as you can against unending waves of normal and special zombies!\nAbout the GameTiny Troopers puts you in command of a team of small soldiers. Guide them through 30 deadly missions with varied objectives: destroy enemy armoured formations, save hostages and eliminate enemy generals, to name but just a few.\nYour troopers will face enemy infantry, snipers, technicals and even tanks. The casualty rate is going to be high but there’s an endless supply of fresh recruits to step up and fill the ranks. Those lucky troopers who survive from mission to mission will be promoted, and each new stripe they gain makes them tougher.\nTo increase your troopers’ chances of survival, use Command Points to give them better equipment, reinforce their team with a specialist like machine gunner, medic or delta force and call in support drops during missions. War might be hell but this is the funniest way to fight in one!FeaturesThe safe way to fight in a war: you won't end up in a body bag.\nLead your troopers in 30 deadly missions with varied objectives.\nFace enemies from infantry to snipers and tanks.\nReinforce your squad with specialists like machinegunner, medic and delta force.\nKeep your troopers alive: they get better after each new rank they gain.Give War a Chance!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kukouri","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":5645,"name":"Rock Band 3","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba5/ba540779f7e66fb166e692b9e0768824.jpg","description":"Rock Band™ is a unique platform that allows you to interact with your favorite music like never before! Create your own band in order to seek fame, fortune and rock stardom on a world-wide tour while learning to master guitar, bass, drums and vocals. Rock Band™ includes original master recordings spanning multiple rock genres from the greatest songs and artists of all time.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":3305,"name":"Super Exploding Zoo!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00f/00fafc4039c5895456bbb4b1435d7c21.jpg","description":"Round up herds of exploding animals and rampage around 80 destructible levels - defend your precious egg by slamming your herd into the greedy alien marauders and blowing them up!\nUse the special skills of different animal types to slow alien progress or access new areas!\nChallenge your friends in the multiplayer mode - go head-to-head against them whether they have PlayStation®Vita system or PlayStation®4 system!\nPurchasing this content entitles you to both the PS4™ system and “PS Vita” system versions!\nVideo output in Full HD 1080p requires 1080p native display.\nAdditional hardware required for Remote Play.\nAdditional hardware required for Interconnectivity.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1 player\nNetwork Players 2-2\nDUALSHOCK®4\nRemote Play\nInterconnectivity PS4™ • PS Vita\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nSuper Exploding Zoo is Copyright 2015 Honeyslug Limited. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Honeyslug","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":672441,"name":"Chill Corner","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fca/fcafe20df24266222cd9f00cf597aa93.jpg","description":"This is just an idle game for chillout and relaxing.\nBeautiful rooms with chilling atmosphere and weather\nMany lo-fi music for chill and relaxing\nCreating and manage your task\nTaking a rest by do several in game quest\nCreating and customize your favorite playlist\nDecorating your room\nCustomizing your character and pets","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Low-Hi Tech","platforms":[{"id":0,"name":"PC"}]},{"id":37084,"name":"RIP","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b1/7b163162d264e00e142b2766145bf67a.jpg","description":"RIP is an all-out war simulation on the ground, in the air or at sea. With over 50 Nations to choose from and hundreds of weapons in many different scenario maps from the middle eastern desert to a well-isolated bunker construction, you can fight as your heart desires and let the enemy bleed out in the dust. Show no mercy after all only the winners write the history books. In the not too far future, politicians run out of lies that would be believable to the masses to go to war so they invented a war game like competition scenario in different locked of regions all over the world, where the best of the best matchup all in which is broadcasted all over the world.  With the goal to help reduce climate change by reducing the population.  In this game the nations that rank the highest in winning the war match scores are allowed to have the highest populations and use the most resources for their country, others have to reduce all accommodations to their fellow citizen and with that trigger the natural weed out selection process of their nation through starvation and death. No need to mention that this is the most popular show on all broadcasting stations. No bombed cities and no civilian casualties during the wargames and only honorable deaths after that, what a wonderful time to be alive.  Now, where's my gun?","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"White Elephant","platforms":[{"id":0,"name":"PC"}]},{"id":28222,"name":"skate.","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c6/3c6675b071608d3b00009308e191b79c.jpg","description":"(Online Interactions Not Rated by the ESRB) This game supports English only. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". The authentic skate experience. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.  Some multi-player functionalities may no longer be supported.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts Vancouver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":15124,"name":"BLACKHOLE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f52/f522394472108b254da430a7db4065e3.jpg","description":"BLACKHOLE: Complete Edition OUT NOW!\nOne of the highest-scoring puzzle platformers of 2015 is coming back in a Complete Edition featuring the award-winning game BLACKHOLE, all available DLC (including the brand new Challenge Vault) and plenty of bonus materials!\nBLACKHOLE: Complete Edition is packed with extra content, such as:\n3 pieces of DLC (Testing Lab, Secret of the Entity, Challenge Vault)\nOver 130 levels, including 10 all-new, insanely difficult locations\nDigital artbook and soundtrack featuring more than 40 tracks\nDeveloper diaries\nPlayable first prototype of the game\nPrintable high resolution artwork\n12 wallpapers and collector cards\nAbout the GameBLACKHOLE is an award-winning hardcore platformer with over 15 hours of story-driven sci-fi comedy and gravity-twisting puzzles. Complete Edition now available!\nWhen the crew of the spaceship Endera is sucked into a black hole, it seems like the end. Fortunately, the ship crashes on Entity – an unidentified object resembling a planet. After the crash, the first member to wake up is the guy who makes coffee for the crew - you! There’s no one around and your only ally is Auriel, the ship’s computer’s sarcastic A.I. Together, you’ll need to come up with a plan to fix the spaceship, save the others and become heroes of planet Earth by closing the black hole once and for all. It won’t be an easy task, because the mysterious caves, lost cities, towering mountains and deep forests are full of tricky, gravity-defying puzzles and deadly traps.\nMain features:More than 90 levels in 6 dimensions to explore\nHundreds of secrets to discover and puzzles to solve\nA fully-voiced sci-fi comedy with a cool soundtrack\nPixel-perfect controls for both keyboard and gamepad","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FiolaSoft Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1547,"name":"King Oddball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/446/4468803b0305745142d7831f66273729.jpeg","description":"End the world with your tongue and boulders! The King swings a boulder back and forth with his tongue and YOU ARE responsible for releasing it! Time the release accurately and crush as many targets as possible with each boulder. Simple but mouth-watering addictive! Master the game by anticipating how boulders roll, bounce, and launch from explosions. Take advantage of collapsing structures too! Conquer the world in more than 120 awkwardly fun and crunchy levels!\nIngeniously easy controls. How hard can it be to end the world?\nStydy the rock, learn the rock's behavior, AND CRUSH ALL PUNY HUNAMS!\nTongue through more than 120 mouth-watering levels!\nWe really should not even mention the Hidden Secret Moustache World (spoiler alert: you get to wear a mustachio).\nFeast your eyes on the eccentric art style, see tiny hunams fly around!\nUse the Oddphone to call his royal majesty (unlocked in the third world)!\nNurture your ears with original soundtrack by Jonathan Geer and the Austin Piazzolla Quintet!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"10tons","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":750344,"name":"Cute can be broken","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a46/a46521daebc50a5db2e57d6aa40412de.jpg","description":"You can spend a week \"stroking\"\nIt is a type of KENZEN game that you do not do.\n\n■ Play time (assumed)\n10 to 30 minutes per lap. There are 6 endings in all!\n(10 types in total including endings with the same development)\n\n■ The actual situation etc.\nWelcome! (Super chat, etc. being delivered on YouTube is also okay)\nIf possible, it would be helpful if you could put the game title and URL in the video summary section.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":20911,"name":"Fingerbones","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30c/30c86bbd0336001d6bae31461d70f607.jpg","description":"Originally released last year, Fingerbones was my first experiment in narrative-focused horror.  You begin in a mysterious abandoned building, pitch dark save for the golden light filtering in from the windows. As you explore, scattered notes begin to tell a disturbing tale.\nSince then, I have released two other horror games (The Moon Sliver and The Music Machine), which take lessons learned from Fingerbones into account, and improve on its ideas.  However, some people still consider Fingerbones their favorite.  So it is now available on Steam for free, with a few minor enhancements.\nSOME FACTS ABOUT FINGERBONES\n- It's a short, narrative-focused horror experience, in the vein of games like Serena.  If you're averse to reading or demand overt threats and jumpscares in your horror games, this is not a game for you.\n- It deals with disturbing subject matter.  Be aware that this is not a game for children or those likely to be easily triggered.\n- It features a unique artstyle that combines elements of pixel horror with realistic lighting effects, which is intended to enhance the surreal atmosphere.\n- This is not a Unity Asset Store collection.  Modeling, music, environments, textures, and programming were done from scratch.  Sound effects were manufactured from creative commons samples.\n- Its music is a dynamic part of the game world, evolving based on the player's movements around the environment.\n- It attempts to bring some logic and purpose to the traditional \"collect scattered notes\" narrative mechanic of many indie horror games.\n- It is an experiment in creating an intense, horrifying experience through narrative, atmosphere, and pacing alone.\n- It is intended to be completed in a single sitting (usually around half an hour for most players), and does not feature a save system.\n- Be aware that the game quits automatically upon completion.\n- If you're interested in reading my thoughts on the game a year later, check out http://ironsnowflakes.blogspot.com/2015/07/looking-at-fingerbones-year-later.html\n- Many of the ideas about narrative and horror were expanded on in The Moon Sliver and The Music Machine.  Consider taking a look at them if you like what you see in Fingerbones.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"David Szymanski","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19552,"name":"Majesty 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f8/8f8ef162e81b296e0037a9806735fdcd.jpg","description":"In the world of Majesty, you are the ruler of the kingdom Ardania. At your service are your loyal and somewhat obnoxious subordinates, who have their own minds about how things should be done.\nIn fact, Majesty is the only game where your heroes decide on their own what should be done and when, leaving you to try to control them through monetary incentives.\nKey Features\nReal-time strategy game with indirect control - your heroes have a will of their own.\nPlay through a campaign with 16 missions divided into 4 chapters, as well as a few quick missions and a variety of multiplayer maps.\nBuild the fantasy city of your dreams and experience an engaging world, but beware: monsters are waiting to lay siege to your domain.\nDefend your realm with noble warriors, spell-wielding wizards or wild barbarians. Choose from more than 10 different classes to oversee the protection of your lands.\nMultiplayer for up to 4 players over LAN\nThe official sequel to the best-selling game Majesty: The Fantasy Kingdom Sim of 2000.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C:InoCo","platforms":[{"id":0,"name":"PC"}]},{"id":19165,"name":"The Original Strife: Veteran Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf1/cf19435d8091972bb1c19773845a7f31.jpg","description":"The Original Strife is back!\nHailed as the original FPS-RPG game that spawned countless imitators, Strife: Veteran Edition is a love letter to the classic from 1996.\nNew Features Include:\nSupport for high resolutions, with proper aspect ratio.\nOpenGL for video backend to provide portability and support for vertical sync.\nDynamic lighting and bloom\nWidescreen support.\nAbility to freely rebind all keyboard, mouse, and gamepad inputs.\nSteam Achievements\nSteam Trading Cards\nCompletion of missing and unfinished options in the original game, such as:\nThe planned \"Capture the Chalice” multi-player mode.\nMarking of current objectives on the auto-map.\nSpecial HUD for the Torpedo weapon\nImmerse yourself in this all-consuming epic quest that for the first time combines riveting role-playing adventure with the spectacular Doom 3D engine! -An evil presence has implanted itself in the fabric of our world. Play the role of spy, assassin, warrior and thief as you are lured into the darkest and most perilous adventure of your life. You´ll have Blackbird on your side - a seductive underground agent that will provide you with clues as you encounter progressively more sinister foes. Be strong, and trust no one.\nFULLY INTERACTIVE WORLD\nThe elaborate virtual environment offers 28 interconnected levels covering over 200 square miles. Explore medieval towns and industrial complexes filled with pitfalls and perils, ending in a final confrontation that will reveal the planet's darkest secrets.\nAN AWESOME ARSENAL\nFrom the silent but lethal crossbow to the breathtaking flame thrower, you'll toast, mince and vaporize your opponents in your search to control the ultimate weapon of mass destruction- the Sigil.\nNAIL-BITING NARRATIVE\nIn your role as resistance fighter, you'll conspire with allies to demolish the fanatical ranks of the order from the inside out. Provides an engaging complex storyline and a multitude of dramatic voice-overs.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rogue Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1905,"name":"Girls Like Robots","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb5/cb5613a381a4620106fb7cd0d2af3ab4.jpg","description":"Their faces are the playing pieces.  The rules are their emotions!\nRidiculously charming puzzles, wrapped around an epic tale of love and danger, topped off with an authentic old-time stringband soundtrack!\nThe goal is to put every one next to their friends.\nBut you can't please everybody all the time. Sometimes you gotta break hearts to save the day. And the day definitely needs saving: Volcanoes, exploding chickens, planetary invasion and a boy who just wants to dance with a girl.\nFEATURES:\nConstantly evolving gameplay\nA huge cast of moody folk\nLike, a bajillion hand drawn places and things\nThree Acts with 110 puzzles","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Popcannibal","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":1630,"name":"Joe Danger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4b/f4b92a47f39cc9a7a01d35bb4c6dc144.jpeg","description":"Can you put the world’s most determined stuntman back into the limelight? Combo, boost and pull ludicrous stunts as Joe attempts to race his way back into the record books in over 100 eye-popping levels. Leap school buses full of screaming kids and pools of ravenous sharks! Dodge spikes and mousetraps! Speed through coin dashes and beat Team Nasty in nip-and-tuck races! Take on and win the super-challenging Pro Medals in every level!\nCreate insane new levels in the Sandbox and share or download new ones through Steam Workshop!\nTake on insanely testing extra levels in the Laboratory!\nPlay on your TV through Steam Big Picture, or at your desk with new mouse and keyboard controls!\nExperience Joe Danger like never before with specially enhanced graphics for PC!\nRace against other players with seamlessly downloaded ghosts, and rise up the ranks on the leaderboards!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Hello Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":43422,"name":"Fallout: New Vegas - Ultimate Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c35/c35f178598d2d2dab91f8e8e6a6478e2.jpg","description":"Welcome to Vegas. New Vegas. \r\n\r\nIt’s the kind of town where you dig your own grave prior to being shot in the head and left for dead… and that’s before things really get ugly. It’s a town of dreamers and desperados being torn apart by warring factions vying for complete control of this desert oasis. It’s a place where the right kind of person with the right kind of weaponry can really make a name for themselves, and make more than an enemy or two along the way. As you battle your way across the heat-blasted Mojave Wasteland, the colossal Hoover Dam, and the neon drenched Vegas Strip, you’ll be introduced to a colorful cast of characters, power-hungry factions, special weapons, mutated creatures, and much more. Choose sides in the upcoming war or declare “winner takes all” and crown yourself the King of New Vegas in this follow-up to the 2008 videogame of the year, Fallout 3","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":36357,"name":"Soldat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d5/1d58fda838eb0aee6caff599316ce5cf.jpg","description":"OFFICIAL DISCORD SERVERSoldat has its official Discord server, where all players discuss the game, and our team shares work in progress. Use this\nlink to join!\nAbout the GameSoldat is a unique 2D (side-view) multiplayer action game. It has been influenced by the best of games such as Liero, Worms, Quake, and Counter-Strike and provides a fast-paced gaming experience with tons of blood and flesh. Soldiers fight against each other in 2D battle arenas using a deadly arsenal of military weapons, across 7 default game modes. It features 18 different weapons and 60 maps to frag away on, with full support for user created content.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Michal Marcinkowski","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16375,"name":"Age of Wonders Shadow Magic","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2d/a2db2538b7b29fd0288e07aa245c00fe.jpg","description":"Age of Wonders: Shadow Magic is the third entry in the award winning fantasy strategy series. This fan-favorite enhances the series' praised fusion of empire building, role-playing and tactical combat with the eerie Shadow World and battle with races never before seen, across new and diverse landscapes.\nCombined with the option of creating a totally unique environment with the map generator and rewriting the history of this world through the enhanced campaign editor, you are ensured a constant stream of completely new game experiences.\nKey features:\nFeatures a full new Campaign with 5 episodes and 16 scenarios, with new characters and a new unfolding story. 19 stand-alone scenarios are included.\nRevisions to the original 12 Age of Wonders races. Each race has a new city upgrade, which comes with a new unit. For example, the Elves can build a Secret Forest, which cloaks the town and produces Treemen.\nThree entirely  new races: The steppe roaming Nomads, the sinister Shadow Demons and the otherworldly Syrons.\nUse diplomacy with your rivals as you see fit. Lay siege to enemy cities with a careful balance of tactical guile and magical augmentations.  You might just be destined to become the greatest Wizard-King of all time.\nConfront rivals in Multiplayer via a LAN or over the Internet for up to 8 players - options include Play by Email, Hot Seat, and the exciting Simultaneous-Turn System allowing all players to move at the same time!\nDesign your very own scenarios, heroes, items, and even new Wizards with the enhanced scenario editor, challenging others to triumph over your creation.\nUse the random map generator to create new scenarios or multiplayer challenges at the click of one button!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Triumph Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14394,"name":"Frosty Kiss","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2dc/2dccb904158da188aa321d37e59f263c.jpg","description":"It's been a year since Semyon returned from \"Sovyonok\" and met the girls from the camp in the real world.\nBut it's New Year at hand! And it needs to be celebrated!\n\"Frosty Kiss\" is a tiny piece of this holiday that will bring back the well-loved characters of the novel one more time, even if it lasts only for a few moments. But somewhere deep in your heart should always be a place for celebration and feelings left by a kiss in the most important night of the year.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"IIchan Eroge Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13218,"name":"Sunrider Academy","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21b/21b3461ba36309278e334e04809163bf.jpg","description":"You are Kayto Shields, an ordinary man thrown into an extraordinary adventure. It was only his first day as the vice president of the Sunrider Academy student council when the unreasonable class president appointed him to be the school club manager. “These clubs cause nothing but trouble,” she said. “I’m appointing you to take charge and fix them up by the end of the year!”\nAdd to that another completely unreasonable bet with his little sister that he’ll get a girlfriend by the end of the year, and Kayto’s school life already seems hectic! But that’s not even the worst of it! Kayto soon learns that the captains of each of the clubs he’s supposed to manage have serious issues of their own. Surrounded by girls lacking any common sense, his wacky days at Sunrider Academy begin!\nYou will take control of Kayto as he carefully manages both his student life, and his responsibilities as club manager.\nStudy hard, bring glory to Sunrider Academy, and get a girlfriend!\nPiece of cake, right?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Love in Space","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4261,"name":"Tokyo Jungle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/54f/54f9edbf900803302a3cf339e2561de1.jpg","description":"Everything is the enemy, and only the strongest will survive!\nWith over 50 playable animals to choose from, unleash your inner beast to hunt your way to the top of Tokyo's post-apocalyptic food chain. Whether in Story or Survival Mode, you never know where your next meal will come from or the dangers you'll face, so be prepared for anything and everything.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SCE Japan Studio","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":490123,"name":"Maquette","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/954/95415143e264cdf3d506f55f52ef9b7c.jpg","description":"Maquette is a first-person recursive puzzle game that takes you into a world where every building, plant, and object are simultaneously tiny and staggeringly huge. Maquette makes it possible by twisting the world into itself recursively in an MC Escher-esque fashion.\n\nHead to the center of the world and you'll feel like a giant, towering over buildings and walls. But venture further out, and start to feel small as things get larger and larger - to the point where cracks in the ground become chasms.\n\nIn Maquette you will explore the scales of everyday problems in a modern-day love story. Where sometimes the smallest of issues can become insurmountable obstacles.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Graceful Decay","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"}]}]