[{"id":2964,"name":"The Fall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af2/af2ecc6d854efd19e3591c61136f9a44.jpg","description":"The Fall is a 2D side-scrolling adventure game developed by Over the Moon Games. \n\n### Plot  \nThe game follows Arid, an artificial intelligence installed in combat space suit worn by an unconscious astronaut. They crash land in unknown environments, and Arid’s goal is to save her pilot and restore his health. Being AI, Arid follows strict rules such as not to endanger pilot or not to deceive. The boundaries of AI will is one of the main themes in the game’s story. \n\n###Gameplay \nThe game revolves around exploring environments, solving puzzles and sporadic fighting with different enemies. The gameplay incorporates elements of Metroidvania and point-and-click adventures. Some areas in the game require special items to access that can be found in other parts of the game world. One of the most notable gameplay mechanics in The Fall is that flashlight serves as a pointer. You have to highlight the items to interact with them. \nDuring combat, your flashlight turns into a laser sight. The player can use covers or blend into the background using camouflage. The enemies usually do not need many hits to kill the player. So most of the time landing accurate headshots is the best tactics to defeat enemies. The player can also perform stealth attacks that recover the main hero’s health.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Over The Moon","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":405,"name":"Gems of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9f/d9f8b7d7832a2e1d9b795edeccca15f2.jpg","description":"Gems of War is a puzzle role-playing game developed by Infinite Interactive. The game is a spiritual successor of another game made by the same developer, Puzzle Quest.\n\n###Plot\nThere is not much plot present in the game. The players create their character, choose their faction, and start off as a troop commander in an army of the faction they chose.\n\n###Gameplay\nGems of War is heavily inspired by Hearthstone and uses its core gameplay mechanic while putting its own spin on it. The players engage their enemies on the game board, by choosing specific cards. After that, a gem mini-game, similar to Candy Crush Saga, starts. The better the player completes the mini-game - the more damage will be dealt to the enemy. At this stage of the enemy encounter, the players have to put three gems of the same type in one row.\n\nAfter completing several battles, the players will be invited to fight in a guild. Guilds grant the players specific abilities to use in the mini-game as well as new troop cards. \n\nSeveral card types are present in the game. Some of them deal damage directly to the enemy or their cards, others provide upgrades to the player, while everything else serves to create additional hardships for your enemies.\n\nIt is possible to play the game at multiple platforms at the same time by logging in your game account at a new device.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":13156,"name":"GoNNER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b5/1b56b734347bf779568e18475f25f389.jpg","description":"GoNNER is a tough as hell score-based procedurally-generated platformer with roguelike elements. GoNNER is also a story about friendship between Ikk, Death, and a space whale named Sally.\n\nYou will die. A lot. This is by design, but it's not made to feel unfair. You'll eventually get the hang of GoNNER, so don't lose your head. But even if you do it's okay cause we have a lot of replacement heads you can use.\n\n• **DAILY CHALLENGES!** Only playable once a day. Levels are randomly generated but in this mode everybody plays the same world and use an identical loadout. Everything resets at midnight (Swedish time, UTC+1). Can you crush your leaderboard foes?\n\n• **PROCEDURALLY GENERATED!** Every time you play the game the levels will be different and present unique challenges and opportunities.\n\n• **UNLOCKS!** You'll be able to choose from a variety of passive and active abilities at the beginning of each run so be sure to experiment with all of them and find the play style that best suits you\n• **SECRETS!** Secret areas exist in the world of GoNNER, and these areas will get you different items that you can then always use from the beginning of each run. We're not going to tell you how you get to these areas or what the criteria is for even finding them because secrets, duh.\n\n• **LEADERBOARDS!** Kill creatures, get combos, score points, and brag to your friends how much better you are than them.\n\n• **MUSIC!** It's really freaking good.\n\nGood luck.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Art in Heart","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":3419,"name":"Dragon Ball Xenoverse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/729/729822a7ac978607241a310677c7775d.jpg","description":"Just Updated\nSteam Cards for Dragon Ball Xenoverse are now available!\nPlay the game to collect one of the 6 amazing collectible cards. Get the full collection and redeem it to unlock backgrounds, emoticon and badges for your Steam environment.\nAbout the GameGoku And Friends' Fierce Battles Will Be Reborn!\nFOR THE FIRST TIME EVER, THE DRAGON BALL UNIVERSE IS COMING TO STEAM!\nDRAGON BALL XENOVERSE revisits famous battles from the series through your custom Avatar, who fights alongside Trunks and many other characters. Will the strength of this partnership be enough to intervene in fights and restore the Dragon Ball timeline we know? New features include the mysterious Toki Toki City, new gameplay mechanics, new character animations and many other amazing features to be unveiled soon!Features\nCUSTOM AVATAR – Players create their very own Dragon Ball character to take their place in the Dragon Ball world! Choose Earthling, Majin, Saiyan, Namekian or Frieza Clansman and start battling!\nNEW LOCATION - A once dormant clock has started to tick again in the enigmatic and futuristic Toki Toki City!\nNEW CHARACTERS - Mira, an android trying to become the strongest creature in the universe; Towa, a dark scientist coming from a demonic world; The Supreme Kai of Time, a deity who appeared 75,000,000 years ago and her companion bird Tokitoki, a very powerful lifeform that can produce time!\nTHE MASTER SYSTEM - Choose an original Dragon Ball character as a Master to train under. Your skill set and training excersizes will vary depending on the Master you choose. Your Master may even suddenly appear in battle to assist you!\nSTRONG IMMERSION - Inspired by one of the most famous series ever created.\nIMPROVED GAMEPLAY - Expeience a new, fast paced, and technical battle system.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":49563,"name":"EA SPORTS UFC 3","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dbf/dbf2203a8529f6badb5546084db59f93.jpg","description":"Pre-order the EA SPORTS™ UFC® 3 Standard Edition today and instantly receive the choice of one Loaner Champion Edition Fighter and Move for five fights in UFC® 3 Ultimate Team, five Premium Packs, 500 UFC Points to help build your Ultimate Team roster, and a theme.\nEA SPORTS™ UFC® 3 revolutionizes fighting movement with Real Player Motion Tech, delivering the most authentic athletic motion and visuals in sports gaming. In the new G.O.A.T. Career Mode, your choices outside the Octagon now matter as much as your performance inside the Octagon as you hype fights, create heated rivalries and more on the road to becoming the Greatest of All Time.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-2 players\nNetwork Players 2-2 - Full game requires PlayStation®Plus membership to access online multiplayer\n25GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n*CONDITIONS AND RESTRICTIONS APPLY. SEE https://www.easports.com/ufc/game-and-offer-disclaimers FOR DETAILS.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":530269,"name":"Road 96","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61e/61ec0844a59c04cb0b2d2545e464e026.jpg","description":"Summer 1996, Today is the day!\r\n\r\nYou hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive.\r\n\r\nOn this risky road trip to the border, you’ll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\r\nBut every mile opens up a choice to make. Your decisions will change your adventure, change the people you meet, maybe even change the world.\r\n\r\nThere are thousands of roads across the authoritarian nation of Petria.\r\nWhich one will you take?\r\n\r\nRoad 96 is a crazy, beautiful road-trip. The discovery of exciting places, and unusual people on your own personal journey to freedom.\r\n\r\nAn ever-evolving story-driven adventure inspired by Tarantino, The Coen Brothers, and Bong Joon-ho. Made by the award-winning creators of Valiant Hearts and Memories Retold.\r\n\r\nMoments of action, exploration, contemplative melancholy, human encounters and wacky situations. Set against a backdrop of authoritarian rule and oppression.\r\n\r\nA stunning visual style, a soundtrack filled with 90s hits, and a thousand routes through the game combine so each player can create their own unique stories on Road 96.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Digixart","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":529698,"name":"The Callisto Protocol","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/605/605e0c04ba48ece4b4ae7825473477f6.jpg","description":"This is Striking Distance’s new game, The Callisto Protocol. Studio head Glen Schofield came onto the stream to say that the development team was aiming to make one of the scariest games ever, which only sounds like a tall order if it weren’t for the pedigree of the Dead Space series.\r\n\r\nSet on Jupiter’s moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, the game aims to set a new bar for horror in interactive entertainment.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Striking Distance Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":11587,"name":"Kenshi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9eb/9ebae11c9f394b12c24901c9afb867ce.jpg","description":"A free-roaming squad based RPG. Focusing on open-ended sandbox gameplay features rather than a linear story. Be a trader, a thief, a rebel, a warlord, an adventurer, a farmer, a slave, or just food for the cannibals. Research new equipment and craft new gear. Purchase and upgrade your own buildings to use as safe fortified havens when things go bad, or use them to start up a business. Aid or oppose the various factions in the world while striving for the strength and wealth necessary to simply survive in the harsh desert. Train your men up from puny victims to master warriors. Carry your wounded squad mates to safety and get them all home alive. Features","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lo-Fi Games","platforms":[{"id":0,"name":"PC"}]},{"id":54528,"name":"Super Mario 64","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d5/1d565b99cad46c44b534d9803e27bd49.jpg","description":"Mario is super in a whole new way! Combining the finest 3-D graphics ever developed for a video game and an explosive sound track, Super Mario 64 becomes a new standard for video games. It's packed with bruising battles, daunting obstacle courses and underwater adventures. Retrieve the Power Stars from their hidden locations and confront your arch nemesis - Bowser, King of the Koopas!","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":507154,"name":"Golden Axed: A Cancelled Prototype","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc0/cc064ab715ba4195ac6d26250218e307.jpg","description":"At the beginning of this decade, SEGA Studios Australia was working on a series of reboots of classic SEGA IP, known collectively as the SEGA Reborn series. These included 2.5D reboots of Golden Axe, Altered Beast, and Streets of Rage, as well as an endless runner version of Shinobi, all encompassed in a universal hub world.\nSadly SEGA Studios Australia’s doors were shuttered in 2013, and with it the SEGA Reborn project was lost to the annals of video game history.\nUntil now.\nOn the occasion of SEGA’s 60th Anniversary, as a special treat to say “Thank You!” to our fans, SEGA is releasing a working prototype of Golden Axe Reborn, a single level created as proof-of-concept, or what’s known in the industry as a “vertical slice.”  We’ve dubbed it, tongue in cheek, as “Golden Axed.”\nGolden Axed offers a unique glimpse into the prospect of a project that could have been, and a rare peek behind the curtain at the sometimes tumultuous world of video game development.\nWe reached out to some of the original development team to bring this dusty gem to light, and they are proud that this project could be revived in some form to be shared with you, the fans.*Available until 10am PST / 6PM BST October 19th*","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SEGA","platforms":[{"id":0,"name":"PC"}]},{"id":52093,"name":"Friday the 13th: Killer Puzzle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/508/508473c51447a2c756c2ef733ebd6e04.jpg","description":"Stalk and slay campers across 100+ puzzle levels with horror icon Jason Voorhees! From the campgrounds of Crystal Lake to the highrises of Manhattan, from supermax prisons to snowy ski resorts, Jason will terrorize victims across the world (and maybe even beyond).\nFriday the 13th: Killer Puzzle is developed by the makers of cult hit SLAYAWAY CAMP (5/5 -Rue Morgue, Touch Arcade, Gamezebo... \"The most ridiculously, absurdly, insanely over the top violent game I’ve ever seen.\" -Dread Central).\n8 gut-wrenching “episodes” for over 100 puzzle levels!\nSee Jason like never before: Supermax Jason, Frozen Jason, Apocalypse Jason & More!!!\nTraps! Cops! SWAT teams! Land mines! Rotary telephones! Teleporters! Cats!\nChoose ‘R’ mode for dozens of gruesome Kill Scenes, or ‘PG’ for an almost family-friendly puzzle experience\nLevel up and unlock tons of horrifying murder weapons.\nTrade in your rusty and unwanted weapons for shiny elite ones!\n4 more DLC Expansions for 52 more puzzles, and 4 new Jasons!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Blue Wizard Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":16117,"name":"The Howler","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/271/271458a145626b16058f3023308be3fb.jpg","description":"The Howler is an indie puzzle platformer game developed by Antanas Marcelionis. \n\n###Plot\nThe plot of the game is based on the Lithuanian novel Hour of the Wolf. It is set in an alternate version of the 20th century Lithuania. The Alliance of Free Cities was created by the Rothschilds. Alchemists perform their research, and inventors fly their steampunk airships, mechanics create robotics. The story follows a former United States Marine Antanas Sidabras, who lives in the Free City Of Vilnius and investigates a murder. A major conspiracy comes up during his investigation.\n\n###Gameplay\nAntanas Marcelionis was the illustrator of Hour of the Wolf. The game inherits the same steampunk-induced visual style. The objective of the game is to fly your air balloon over multiple obstacles that will destroy it upon making contact. There are two ways of blowing the balloon. The players are able to either use their left mouse button to inflate the balloon or yell into the microphone if they have one (this is the default control scheme in the game). \n\nThe players can also control the wind flow with the arrow keys. The game's world is highly interactive, so it is possible to get more speed and elevation using chimneys and steam pipes. The game heavily relies on physics and wind simulation, as the players have to avoid sharp obstacles, mines, and all other sorts of hazards.\n\nTrailers:\nhttps://youtu.be/jolcjHcUDMM\nhttps://youtu.be/-29qlNLapgU","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Antanas Marcelionis","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15916,"name":"Minecraft: Story Mode","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a5e/a5e718412ecc9fc7008b59b2e2a29da1.jpg","description":"Minecraft: Story Mode is an action-adventure game developed by TellTale. The title revolves around the episodic series-like narrative and puts the importance of the player's choices forward.\n\n###Gameplay\nThe game resembles the genre of the point-and-click adventures. The players can talk with non-mandatory characters and choose the dialogue options out of four or five alternatives. There is a heavy focus on the QTE — the sequences where one must mash buttons in time accordingly with the pictograms depicted on the screen. At the end of each chapter, the player is presented with the choice diagram — his of her picks are compared to those of the other players across the world.  \nIt is not to be forgotten — Minecraft: Story Mode is the TellTale adaptation of another video game. Fingerprints of this are clear: the crafting mode essential to the original has been added to the game, and the title has become more friendly all in all. That is the contrast with the previous TellTale installments — they were mainly targeting mature audience. \n \n###Story\nThe Story Mode created the narrative from the start — the original game does not feature it. The story centers around Jesse — the protagonist and the player at the same time — who travel around the in-game world in searches for The Order of the Stone.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Telltale Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2427,"name":"Sid Meier’s Ace Patrol: Pacific Skies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/def/def72fbc44e21276ad86b49538e74e20.jpeg","description":"Sid Meier's Ace Patrol: Pacific Skies is a turn-based strategy with aircraft, which takes place during the Pacific War. The is a direct sequel to the game Ace Patrol.\n\nThe player will have to take control of one of the game nations and pilot available aircraft during the completion of combat missions. There is no direct control over the aircraft, all maneuvers and battles are turn-based. Sid Meier noted that despite the strategic component, players can quickly master the game because of a plain interface and a simple visual style.\n\nThe game boasts more than 180 missions, among which are famous battles like Pearl Harbor. All units in the game can be upgraded, improving their skills, and supplying new equipment. There was a mechanic, so-called Ace skills, thanks to which, the main pilot can teach the familiar skill of his wingmen. In the game there is a multiplayer, in it, the players complete turns one after another.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2K","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":23370,"name":"Battlestar Galactica Deadlock","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e3/0e32ef0cdda9dd759cf34332e4a302b6.jpg","description":"Our future plans...\nAbout the GameThe Cylons have rebelled!\nFour years of war and a steep price in human lives have not been enough to unlock a deadly stalemate. The Colonials have countered all of the Cylon’s offensives so far, but no decisive victory was achieved.\nThe deadlock is suddenly broken by a surprise attack from the Cylons and the brutal annihilation of the Colonial Fleet High Command on Picon. The fate of mankind is now resting on the shoulders of Rear-Admiral Lucinda Cain.\nThe secret, cunning plan she has conceived could turn the tide of the war forever…The Game\nBATTLESTAR GALACTICA Deadlock™ takes you into the heart of the First Cylon War, to fight epic 3D battles that will test your tactical prowess.\nTake control of the Colonial Fleet from the bridge of the mobile shipyard, Daidalos, and free the Twelve Colonies from the Cylon threat. Build your fleets, protect the Quorum alliance and prepare to dig deeper into the conspiracies of this heroic conflict.Command the Colonial Fleet\nDesign and build fleets of powerful capital ships. Recruit officers to protect the Twelve Colonies. From the Manticore corvette to the mighty Jupiter class Battlestar, you won’t be short on firepower.Legendary Names\nContinue the legacy of Battlestar Galactica™ with new characters and familiar faces, in an original story set during the First Cylon War. Launch Viper squadrons and Raptor scouts and jump the Galactica in to dominate the battlefield. An authentic Battlestar Galactica™ experience awaits.WEGO 3D Tactical Battles\nIntense tactical space battles in full 3D. Give commands to your fleet of capital ships and watch the explosive results play out in pause-able real-time across beautiful environments.War Room Politics\nFrom the bridge of the Daidalos shipyard you will command all the Colonial Fleet. Build up your forces and jump them across the quaternary solar system of Cyrannus. Keep the Colonies safe and the Quorum of Twelve unified, lest the alliance break and introduce a new age of Cylon dominance.The Cylon Threat\nPrepare to face relentless opposition. Defend against squadrons of Cylon Raiders and missile salvos from Basestars. Trust in your marines to fight off Centurion boarding parties, while your firewalls slow down the hacking attacks of the Wardriver electronic fighters. Unlock blueprints for new ships, munitions and squadrons to help defeat your tireless foe.Join Forces\nExperience Battlestar multiplayer like never before! Outwit your opponent in fierce 1-v-1 fleet battles.Review Your Battles\nReview your battles from a cinematic point of view with the AutoCam replay, and then export them to YouTube with our in-game tool!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Slitherine Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":19682,"name":"Rise of the Argonauts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/760/760b379c7d3ab6eb68375fba0f81aa96.jpg","description":"###The role model\nReleased in 2008, the game, is similar to another well-known representative of the genre of action-role-playing games God of War series. Developers became studio Liquid Entertainment, and the publisher company Codemasters. The game appeared on the PC and on the most popular consoles of its generation: Playstation 3 and Xbox 360.\n\n###The story and the setting\nThe plot of the game tells about Jason, and the action takes place in Ancient Greece. Like God of War, the game uses ancient Greek mythology to build a game universe. The modified myth of Jason and the Argonauts, who went on a journey for the Golden Fleece was used as inspiration. According to the scriptwriters of the game, Jason is a Greek king, whose wife was killed in front of him. The only way for a grieving husband to return the beloved is the Golden Fleece, which can resurrect the dead. Other well-known heroes of myths appear in the game: Hercules, Achilles, Medea, Medusa, Patroclus, and others. Together they travel through a variety of real and imaginary locations: Iolcu, Delphi, Mycenae, Tartar, and Kifr.\n\n###Key features\nThe game consists of a large number of dialogues and enemies confrontations on vast, detailed levels. In contrast to God of War, critics point out simple battles with bosses and the strange arrangement of enemies on each level, which also simplifies the gameplay. You can use a sword as a weapon, a spear, and a mace is also available. Each weapon has its own characteristics and offers different gameplay: the mace breaks shields, but can not cope with a large number of enemies, the sword reduces the player's defense capabilities, but increases the effectiveness of melee combat, etc. In addition to these weapons, you can upgrade Jason skills on four branches: Ares, Hermes, Apollo, and Athena. Points for upgrades the player receives as the tasks are completed and for the correct answers in the dialogs.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Liquid Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":19701,"name":"Command & Conquer 3: Tiberium Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f9/7f9b2bb1d1ce5ad5ccc51a3e95d1aa1b.jpg","description":"Command & Conquer 3: Tiberium Wars is a real-time strategy game developed by EA Los Angeles. It is the third game in the Tiberium sub-series and continues the plot of Tiberian Sun.\n\n###Plot\nThe year is 2047, 17 years after the events of the Firestorm Expansion pack. The Brotherhood of Nod unexpectedly turns off the Global Defence Initiative's missile shield and destroys the Philadelphia orbital station. Most of the GDI's leaders are dead in one move, with the Brotherhood planning to take on the east coast of the United States. The game follows the events of the Third Tiberian War.\n\n###Gameplay\nIn Command & Conquer 3: Tiberium Wars the players spectate the action on the battlefield and give orders to their units. The main objective is to destroy the enemies base.\n\nLike in the previous games, the core building for the formation of your army is the mobile command center, which is placed on the default starting position on every map of the game, yet it is possible to move it freely around the level. Each building type works as a technological tree where new units can be built only if a specific set of buildings were put up by the player. Every unit can be countered by another, thanks to a rock, paper, scissors game designing philosophy. Three factions are present in the game, with every one of them differing in their units, buildings, style, and gameplay.\n\n1v1 and 2v2 multiplayer modes are also available with the addition of an ELO ranking system.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":18642,"name":"LIGHTNING RETURNS: FINAL FANTASY XIII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ce/7ce5be7bf734dc4246b5e8293436c1d3.jpg","description":"Lightning Returns is the concluding chapter of the Final Fantasy XIII saga and series heroine Lightning's final battle. The grand finale of the trilogy brings a world reborn as well as free character customization and stunning action based battles.\nThe world is sinking into a sea of chaos, and in thirteen days, nothing will remain.\nThough the planet is doomed, there is still hope for those who call it home.\nAfter centuries in crystal stasis, a hero has awoken—a legendary warrior on a god-given mission to save the souls of mankind. Her name: Lightning.\nBlessed with incredible strength and an arsenal of new weapons, she has everything she needs for the coming battle. Everything except time. And now she must make an impossible choice...Downloadable content included in-game\"Divine Wear\" schemata\n\"Moogle Lover\" schemata\n\"Ultimate Saviour\" schemata\n\"FFX-2 Yuna\" schemata\n\"FFVII Cloud\" schemata\n\"FFX Yuna\" schemata\n\"Tomb Raider\" schemata\n\"Shining Prince\" schemata\n\"Dark Samurai\" schemata\n\"Sohei Savior\" schemata\n\"Utsusemi\" schemata\n\"Art of War\" schemata\n\"Flower of Battle\" schemata\n\"Shogun\" schemata\nThe \"FFVII Aerith\" schemata is not included in this pack. Furthermore, there are no plans to make this schemata available in future.Key Features:\nLIGHTNING UNDER YOUR CONTROL\nLightning will be the playable character - with a highly evolved range of techniques for battles and exploring the environment. Customise Lightning with a large range of different outfits and weapons; that affect not only the way she looks, but also her actions and abilities.\nACTION-ORIENTED COMBAT\nA new battle system gives a level of direct control over the action unlike any FINAL FANTASY game, while having iconic elements that are known and loved throughout the series too.\nDLC CONTENT FROM THE ORIGINAL CONSOLE VERSION\nThe PC release will also include all the amazing DLC content from the original console version*, including Japanese voice-overs and various costumes, shields and weapons.\n*Except for “FFVII Aerith Costume”\nA CONSTANTLY MOVING, BEAUTIFUL WORLD\nStunning artistic direction depicts a doomed world filled with choice and diversity. Living, expansive environments featuring a rising and setting sun provide unique experiences for every player.\nUSE YOUR TIME WELL\nA world on a course for total annihilation presents unique challenges; where certain areas, missions, and people will only be available during selected periods. How will you use your remaining time?\nA CONNECTED EXPERIENCE\nStay connected to FINAL FANTASY and its characters, with unique features that link the in-game world to the real world.\nNotes:\nThis version of the game has had no changes or additions made to the story of the original LIGHTNING RETURNS FINAL FANTASY XIII.\nSupports Dolby® Digital output compatible sound cards.\nThis version of the game includes some of the downloadable content released for the original.\nThe bonus items originally awarded for having save data from previous games in the series will be awarded in this version regardless of whether there is suitable save data present or not.\nIncludes no functionality linked to Square Enix Members or social networking sites.\nIt is not possible to change the names assigned to chocobos, map markers or schemata.\nKey functionality features of LR:FFXIII\nSupports graphics options intended for high-end PCs:\n- Rendering resolution\n- Scaling of the display area\n- Shadow processing\n- Texture filters\n- Colour correction\n- Depth of field\n- Lighting\n- Glare\nSupports full screen and windowed display modes\nSupports a maximum frame rate of 60fps\nSupports Full HD display with a maximum resolution of 3840x2160","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":3705,"name":"Titan Attacks!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7b/b7b2c1c2ffb15a99201c2d57b0de04bc.jpg","description":"Titan Attacks is a fixed shooter, reminiscent and inspired by the games like Space Invaders, where the player is taking control over last surviving tank on the planet and has to defend the Earth from the swarms of alien ships from the largest moon of Saturn – Titan. While defeating the aliens, the player will collect money that can be spent to upgrade and strengthen up the tank. Not only Titan Attacks brings classic arcade shoot ‘em up genre, but with several twists. Previously mentioned upgrade system, new strategies, new enemy types, and neo-retro visuals are forming fast-paced and intentionally addictive gameplay.\nThe game consists of 100 levels, forming five distinct worlds to play through Earth, Moon, Mars, Saturn, and Titan. At the end of each world is a boss fight against the largest and strongest enemy ships. It received a universal 7/10 score across multiple rating systems.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Curve Digital","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":22685,"name":"Heroes of Might and Magic 3: Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/efa/efa20a88e86267ed7c49f394fa22c1d0.jpg","description":"Includes Heroes of Might & Magic III and its expansions: Armageddon's Blade and The Shadow of Death\nMurder, treachery, resurrection, savage battles and ultimately-freedom!\nWhen Erathia's King Gryphonheart is murdered by traitors he is resurrected as an undead warlord who leads a ruthless invasion of his former Kingdom. Little resistance is met until his daughter Catherine, Queen of Enroth, returns to her homeland commanding an army of elite Enrothian warriors. Meanwhile the Necromancers raise large hordes of undead and advance towards the Erathian capitol. Queen Catherine receives the aid of her father's survived generals and embarks on a crusade to reclaim her lost land.\nYou control the greatest heroes and fiercest creatures in a conflict of epic proportions, as Cathereine fights to restore her family's rightful reign, uncover her father's killers and free him from the dark prison of his undead body!\nThis is a must have for every Might and Magic series fan! Insanely addictive gameplay that will make you want to play “just one more turn” over and over again\nGreat multiplayer, especially when playing in hot seat mode on one PC","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":15659,"name":"Super MNC","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e0/4e0ea16d3362361791100bcbd7a1bf1b.jpg","description":"Super MNC is a free-to-play third-person MOBA game developed by Uber Entertainment. It serves as a direct sequel to Monday Night Combat. The game is not playable as of May 24th, 2018 due to GDPR.\n\n###Gameplay\nThe game puts two teams of 5 players against each other. A class-based mechanic is featured in the game. It heavily depends on teamwork as the players have to choose their character right after getting assigned to a team.\n\nThe game features a mix of class-based combat, tower defense style game, and a typical MOBA. The main objective of either team is to destroy the so-called Moneyball of the opposing team. In order to complete the objective, the players have to get through the turret defense, which can only be destroyed by sending out bots on a specific lane. Once the bots get to the turrets, their shield goes down, and the turrets can be destroyed.\n\nThe players are awarded money and experience for every kill they make. Experience is used to level the player's character up and unlock character-specific skills. The money can be used to summon new waves of bots or purchase temporary powerups at vending machines. \n\nThe game also features a survival mode called Super Blitz which puts five players against the in-game announcer. The players have to defend their Moneyball as the Announcer sents waves of bots to destroy it. The Announcer takes a break every ten rounds which can be used to repair turrets, build new ones or upgrade your character.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Uber Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":11791,"name":"Death's Gambit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a8/8a859b103b74cf565d84cea232d06569.jpg","description":"Death's Gambit is a challenging Action-RPG where you explore an alien medieval planet filled with beasts, knights, and horrors. As an agent of Death, bound to his service, you must banish your fears and endure the struggle that lies at the heart of Leydia. Master the precise combat, strategically plan out your attacks, and face-off against terrifying creatures that reach to the skies. Use an arsenal of weapons and abilities to explore the unforgiving lands, rich with secrets and twisted characters that may aid or hinder your journey. Find the source of immortality that plagues the land and unravel its eternal ties to the realm.\nHunt and slay mighty boss creatures, each one requiring a unique strategy\nExplore an alien world that spans dark forests, medieval towns, frozen wastes and more\nBuild an impressive arsenal of powerful blades and helpful spells\nScale buildings and beasts with your trusty grappling hook\nGet ready to die a lot","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Adult Swim","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":263548,"name":"Little Misfortune","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/669/6691144e293eebc308d86ca3c8317c5a.jpg","description":"Little Misfortune is an interactive story, focused on exploration and characters, both sweet and dark, where your choices have consequences.\nStarring Misfortune Ramirez Hernandez, an imaginative 8-year-old, who seeks the prize of Eternal Happiness, as a gift to her Mommy. Led by her new friend, Mr. Voice, they venture into the woods, where mysteries are unraveled and a little bit of bad luck unfolds.\nSharing the same universe with the cult video game Fran Bow, created by the visionary dev-duo Killmonday Games.\n⦁\tYou may pet a doggy, a fishy, a wolfie, the Kraken, the kitty and the foxy.\n⦁\tVisit a pet cemetery with a shovel.\n⦁\tNow with real human voices: Hear Misfortune say some pretty cute things!\n⦁\tMissing children.\n⦁\tThere's a monster!\n⦁\tFall in love.\n⦁\tCommit petty crimes.\n⦁\tOriginal art by Natalia Martinsson.\n⦁\tOriginal soundtrack by Isak Martinsson.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Killmonday Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":14101,"name":"Sakura Clicker","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c3/2c3a799964d6cc311f022e0e0896a1e8.jpg","description":"Sakura Clicker is a free-to-play incremental game, a spin-off of the visual novels series Sakura developed by Winged Cloud.\n\n###Gameplay\n\nUnlike previous games in the Sakura series, Sakura Clicker does not have any storyline or premise. Its connection to the rest of the franchise comes down to the similar anime art-style and some characters and highly sexualized character design. Your goal is to defeat a never-ending string of enemies which the game calls the ‘Monsters Girls.’ They appear as explicitly dressed young women with some animal or mystic creatures features such as cat ears, dragon tails or owl wings. You fight Monster Girls primarily by clicking on them with the left mouse button. They do not attack you so you cannot die in the game. Killing enemies gives you gold coins. They are the main currency in the game. You spend gold to level up your character which increases your stats and makes you either deal more damage or hire the allies. The Allies are special characters that help you defeat enemies. Each of them has its scale of progression and comes with several passive abilities. These abelites can increase the amount of gold you get from each, the damage you deal with each click or improve automatic damage the deal themselves. The game is free-to-play and offers some paid DLCs in the form of costumes for your main hero. You can also customize your character’s outfit using gold coins.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"}]},{"id":12697,"name":"Men of War: Assault Squad 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f01/f015c52339f91d15ec22c50cc0e53b3a.jpg","description":"Men of War: Assault Squad 2 features new single player style skirmish modes that take players from extreme tank combat to deadly sniper stealth missions. Commanders can now faceoff against opponents on various new multiplayer 1v1 – 8v8 maps. To truly bring the battles to life though there is the new extreme game mode designed for huge battles on spectacular maps.\nThis new Assault Squad game brings significant game engine and visual improvements as well, with special attention paid to ones that were highly requested by the players.Key features:advanced multi-core support\nadvanced shader technology\ndirect control every unit as if you were playing a 3rd person shooter\ninterface and AI improvements, including unit kill counts and squad icon information\nnew multiplayer interface\ncamouflage depending on season\nfully updated inventory items with new graphics and updated vehicles\nsound improvements, including voice acting\nSteam features, including Steam multiplayer, matchmaking, achievements, cloud, player statistics, leaderboards, voice chat, Valve anti-cheat, friends invite and workshop\nplayer level up and ranked system\nin-game video recording, and much more.Content:15 new single player skirmishes plus 25 reworked ones from the original Assault Squad\neight player co-op support and an all new multiplayer extreme game mode\n65 multiplayer maps and five gamemodes\nmore than 250 vehicles at your command\nmore than 200 soldiers with unique equipment\nfive factions and various battlefields in Europe, Eastern Europe, Northern Africa and the Pacific\ndevelopment tools such as 3d model exporter and map/mission editor, and much more.Deluxe Edition:The Deluxe Edition of Men of War: Assault Squad 2 is the most prestigious version of the game. Display your dedicated support as one of the grandest online commanders with unique interface elements and faster collecting of experience.\nReceive a five star general ribbon for your main menu badge\nReceive an unique five star general achievement\nReceive a special icon for your player avatar visible to everyone during a match\nReceive an outstanding HUD element visible while playing and recording matches\nReceive a slight XP boost for all factions in multiplayer to unlock units fasterFree Premium Service:Digitalmindsoft guarantees you to release several free game updates including new content and features during the lifetime of the game. Because games are our passion, we are always eager to listen to community feedback and to improve our games. As an example, we released more than 10 free game updates for the original Assault Squad including plenty of new units.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digitalmindsoft","platforms":[{"id":0,"name":"PC"}]},{"id":274760,"name":"ANCESTORS: The Humankind Odyssey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ac/3acc7d1846c7c8206fdbc01fd8f2de54.jpg","description":"Ancestors: The Humankind Odyssey is a third-person open world survival game where you Explore, Expand, and Evolve to advance your clan to the next generation in this exhilarating new adventure from the creator of Assassin’s Creed.\r\nEmbark on the most incredible odyssey known to humankind: human evolution. Spanning from 10 million to 2 million years ago, begin your journey, “Before Us,” in Neogene period Africa. Explore a beautiful yet ruthless world, from swinging through tree branches in the jungle to stalking prey across the golden savannah grasslands. Decide what attributes to learn and hone in order to pass down knowledge to future generations, from crafting tools to enhancing evasive tactics against predators. Just like real life, make sure to eat, drink, and sleep to stay alive and have the energy to face any danger that may come your way.\r\nGrow your clan and find strength in numbers as you progress through critical evolutionary stages of human evolution. Your choices will write your clan’s story and determine if you can survive your evolution.\r\nKey Features:\r\nExplore Ruthless Africa: Explore the never-before-experienced world of Neogene Africa starting 10 million years ago at the dawn of humankind. From the tops of tree canopies overlooking lush jungles to the golden grasslands of the savannah, traverse a beautiful yet unforgiving landscape. For every breath-taking view, beware of the weather, predators, and other dangers that threaten your survival.\r\nExpand Your Territory and Grow Your Clan: Increase your chances of survival by uniting new members of your species and giving birth to future generations. Control different clan members, form bonds to create families, and work together to intimidate predators during expeditions. Conquer fear as you explore unknown locations in order to expand your territory.\r\nEvolve Through Multiple Generations: See the physical and intellectual evolution of the first hominids as you explore, learn, and survive. Spanning from 10 million to 2 million years ago, play as one of the first hominids and evolve over the course of millions of years during key stages in human evolution. Make crucial discoveries and hone physical abilities that will be passed down to future generations such as Ardipithecus ramidus and Australopithecus.\r\nChoose How You Survive: Evolution was not written in stone. Your decisions shape how you will overcome obstacles, increase your species, and what knowledge will pass on to future generations. Focus on specific attributes or choose a more balanced approach to survival. Your clan’s ability to survive will be directly impacted by your choices, making each player’s experience unique.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Panache Digital Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":9977,"name":"Gear Up","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/868/868a358e1c734f91cc836a37c92f61d6.jpg","description":"Gear Up is an MMO-oriented vehicular combat game. The player creates a battle robot and challenges other players' robots to a fight in an arena. The game features arcade action and simple WASD controls as well as many customization options.\n\n###Modes\nThe game includes three multiplayer modes. The first two offer traditional deathmatches and team deathmatches for teams of up to eight players, typical for most online shooters. There's also a Conquest mode, which is an updated version of Capture the flag. In this mode, the teams compete over control of a radio antenna. There's also a single player mode in which the player can compete against the AI-controlled bots. This mode, however, is only meant as a practice, as the bots are very weak and predictable.\n\n###Customization\nCustomizing your robot is the main focus of Gear Up. Before entering a battle, the player decides what weapons and movement gear the robot will use. The player can equip his or her robot with legs or wheels, melee or ranged weapons, as well as skills like invisibility or wall climbing. The game offers a roster of 116 parts, however, because of the game's free-to-play model, some of them can only be unlocked by purchasing. \n\nThe improvements are not perfectly balanced, and there are the obviously superior combinations that most players prefer. For example, robots with melee weapons, such as a chainsaw, usually have little chances against their enemies equipped with firearms.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Doctor Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":311680,"name":"F1 2019","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0f/a0f0aeea046abebc1a41cbd670ff1425.jpg","description":"The official videogame of the 2019 FIA FORMULA ONE WORLD CHAMPIONSHIP™, F1® 2019 challenges you to Defeat your Rivals in the most ambitious F1® game in Codemasters’ history.\n\nF1® 2019 features all the official teams, drivers and all 21 circuits from the 2019 season. This year sees the inclusion of F2™ with players being able to complete the 2018 season with the likes of George Russell, Lando Norris and Alexander Albon. \n\nWith greater emphasis on graphical fidelity, the environments have been significantly enhanced, and the tracks come to life like never before. Night races have been completely overhauled creating vastly improved levels of realism and the upgraded F1® broadcast sound and visuals add further realism to all aspects of the race weekend.\n\nTHE OFFICIAL VIDEOGAME OF THE 2019 FORMULA ONE WORLD CHAMPIONSHIP™\nRISE UP AGAINST YOUR RIVALS\nNEW - F2™ career opening – establish your reputation and defeat your rivals before stepping up into the F1® Championship.\nNEW - Customise your own livery and lead the pack in weekly challenges or in online leagues. Test yourself against the very best in the dedicated F1® Esports area.\nIMPROVED - Replay and share your finest moments with the new automated race highlights feature, while stunning new night lighting and official F1® branding add even more realism.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Codemasters","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":15824,"name":"Only If","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebb/ebb42064f754bd057f6e605021ab1e9d.jpg","description":"Only If is a first-person adventure indie game developed by Creability.\n\n###Plot\nAfter a party at his crush's house, Anthony awakes in a room he'd never been before. He attempts to exit the house, but a mysterious voice from the phone screams insults at Anthony and tells him where to find the exit. Tony follows the clues and leaves the house.\n\n###Gameplay\nThe main gameplay mechanic is based on exploration. Like in most escape room games, it is necessary for the players to look for clues in the environment they are in at the moment. Further into the game, the levels are no longer set in a house, but in a park with the landscapes of it being used for several puzzles. \n\nFrom level to level, several gameplay mechanics change with the only gameplay element that stays the same is the character movement or item interaction. Everything else is subject to change. These gameplay elements can be used as a puzzle piece in several levels, but most of the time they create an obstacle for the player to pass.\n\nThe developers put a heavy emphasis on the fact that gameplay mechanics were meant to be experimental and unpredictable. This effect is achieved by avoiding the use of the “What you see is what you get” principle. There are multiple unexpected turns present in the game. For example, at some point of the game, the players have to jump down a ledge. It first it appears that the main character will fall to his sudden death, yet it appears to be the right direction to move to.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Creability","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11001,"name":"Badass Hero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/127/127c2b20f0760e31f7a303bd84b04bd0.jpg","description":"Badass Hero is a roguelite platformer shooter set in a comic book universe. The game features fast-paced hit and run gameplay, procedural generation of levels and random items that make every playthrough different! All in extremely polished, modern and high-resolution 2D art.\nIn Badass Hero you shoot enemies with various guns while avoiding projectiles, traps and obstacles. Collect ink from defeated enemies to upgrade your hero. Play dynamically and aggressively and take risks like a badass to get greater rewards! Stay focused at all times or you'll die sooner than you think. Become proficient with your character's skills and master each enemy to succeed!\nComic book setting\nAction platforming with 360 shooting\nProcedurally generated levels\nCustomizable character\nPermadeath with character progression\nCompletely unique worlds, each with its own bosses and minibosses\nTons of gameplay-changing items and guns","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Awesome Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":514896,"name":"The Dark Pictures Anthology: House of Ashes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/326/326cbbdc3bc2da0b10cc3f7edd57161a.jpg","description":"Iraq, 2003. In the shadow of the Zagros mountains a military unit comes under fire from Iraqi forces. The resulting firefight causes an earth tremor where both sides fall into the ruins of a buried Sumerian temple. With all communication severed, our protagonists are trapped in a terrifying underworld they must navigate to escape - unaware that something ancient and evil has awakened in the shadows and has found a new prey to hunt.\r\n\r\nHorrific discoveries and impossible decisions now face the survivors as they strive to escape the terrifying threat they awakened. Will they each prioritize their own survival, or put aside their fears and personal rivalries to fight together as one against these underworld monsters?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":20979,"name":"Memories of a Vagabond","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/334/3341d2412c3ab1991ed6f5e0f63ccb2a.jpg","description":"Memories of a Vagabond is a turn-based RPG game developed by DarkElite Team.\n\n###Synopsis\nYou play as a mercenary, who travels from soul to soul to avenge the loss of his fiancee. The players will encounter many obstacles in their way, find new allies and encounter powerful enemies.\n\n###Gameplay\nThe game's creators put a heavy emphasis on how the game recreates the feel of old RPGs, such as Chrono Trigger and Final Fantasy. The main feature of the game is the absence of death in a usual way. Upon death, the player's soul is sent to the Soul Giver in the underworld, where they can choose a new body. All the skills that the player has learned to the point of his death will stay unaffected. This makes possible the transition of the skills of one class to another which results in countless gameplay combinations and high replay value. It has to be noted that your equipment and potions do not carry over to a new character, just like in most roguelike games.\n\nThe game features a class system with four classes present: Warrior, Assassin, Mage, and Hunter. Each of the classes differs in gameplay and is chosen at the beginning of the game or upon death. A crafting system is also present in the game which allows for upgrading your hero's equipment on the go. It is possible to craft new armor and weapons, or healing potions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"DarkElite","platforms":[{"id":0,"name":"PC"}]},{"id":18361,"name":"You Have to Win the Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c6/2c679ca8ca6e79fa55b7d675a0947de8.jpg","description":"You Have to Win the Game is a retro 2D game heavily stylized to resemble an 8bit NES release.\n\n###Gameplay\nThe player controls an unnamed character and navigates it through the labyrinth in a medieval castle. The game is set in a largely open 2D world, in which the protagonist can move in every direction. There's no side-scrolling, and each section of the world occupies exactly one screen. To help the player to distinguish them, the sections have names, often comical, such as \"Nice of you to drop in.\"\n\nAt the start of the game, the main character can only run and jump. After the player reaches a certain level, however, the game unlocks additional movements. The protagonist can eventually learn to bounce off the walls and perform double jumps. Nevertheless, the player cannot fight or otherwise defeat the monsters, such as bats and snakes he or she encounters. The only option is to avoid them. There are also collectibles like money bags, but they do not influence the gameplay. Their only role is to provide a 100% walkthrough achievement.\n\n###Style\nThe game features intentionally pixelated visuals to resemble an 80s arcade. It is accompanied by 8bit sound effects and occasional chiptune music. There's even an option to emulate a CRT display. The game uses a very limited amount of 8 colors, although the player can choose to switch to a 16-color palette or to change the default colors.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Minor Key Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":16733,"name":"Spooky's Jump Scare Mansion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a68/a68078dd8e618bd8e90d218c68e15544.jpg","description":"Can you survive 1000 rooms of cute terror? Or will you break once the cuteness starts to fade off and you're running for your life from the unspeakable hideous beings that shake and writhe in bowels of this house? They wait for you, they wait and hunger for meeting you. They long to finally meet you and show you how flexible your skin can be after it has soaked in blood. Will you brave this journey, will you set to beat the impossible, the insane, and the incorporeal?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lag Studios","platforms":[{"id":0,"name":"PC"}]},{"id":463727,"name":"Devolverland Expo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c07/c07871703c472052f149c0b08c670cc4.jpg","description":"Devolverland Expo is a first-person 'marketing simulator' set within an abandoned convention center after the annual Devolver Digital game expo was mysteriously canceled.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"PC"}]},{"id":9800,"name":"Streets of Rogue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31c/31c0408f9eba469663bcc531a98f6d3e.jpg","description":"Streets of Rogue is a rogue-lite about player choice, freedom, and anarchic fun. The game takes inspiration from fast-paced top-down rogue-lites like Binding of Isaac and Nuclear Throne, and adds free-form, experimentation-driven, emergent gameplay elements of RPGs like Deus Ex.\nRather than taking place in a dungeon, the game is set in a functioning, procedurally generated city, where complex AI informs denizens from all walks of life, who are just trying to get by in their daily activities.\nIn order to progress, the player will need to accomplish specific mission goals in any way they see fit through use of their special character traits, items, and the environment.\nWill you play as a soldier who shoots first and asks questions later?\nA stealthy scientist who uses chloroform and tranquilizer darts to silently take down the opposition?\nA genial bartender who can talk his way past the most intimidating of guards?\nOr how about a hyper-intelligent gorilla, rescuing other caged gorillas to form a small mobilized gorilla army?\nThe Mighty Feature-List\nPlay the game YOUR way! Don’t want to kill anybody? That’s cool! Want to hack computers? Got ya covered!\nRandom world generation and TOTALLY EXTREME gameplay variety means you can play for 600 hours and not get bored! Seriously though, go outside!!!\nSuper-advanced artificial intelligence that won’t put up with your crap! Outsmart these virtual humans and feel superior to your computer!\nPlay as over 20 (and growing!) wildly different types of characters! Bartender, scientist, hacker, gorilla — hey, your job is probably in there too!\nStupidly huge variety of items! Shrink rays, hypnotizing devices, boomboxes, bear traps, food processors.. Oh, and guns too.\n4-Player online and local cooperative modes lets you brutalize goons AND loneliness!\nLead a gang, free slaves, drink beer, gib ghosts, become a vampire, shrink people and stomp on them. The most insanely varied game ever made.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"tinyBuild","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":261306,"name":"Jill of the Jungle: The Complete Trilogy","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/728/72873fd9f7f9d06421f093856d0460cc.jpg","description":"She's beautiful. She's brave. She knows her way around a jungle. She is fighting the most difficult battle of her life.\nFortunately, Jill is a tough lady. She can run, jump, and skillfully use her knife and spinning blade. Want to really trick Jill’s opponents? Find the magical icons, and Jill will transform into a flaming bird, a leaping frog, or even better, a fish who can shoot bullets! Even though Jill is prepared for the dangers of the jungle, helping her complete her mission will not be easy. Do you have the courage to help her?\nJill of the Jungle: The Complete Trilogy includes:Jill of the Jungle\nJill Goes Underground\nJill Saves the Prince","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Epic Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":28600,"name":"Halo Waypoint","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3e/a3edd21d16f5329ddde378f03612181a.jpg","description":"Halo Waypoint is an official website dedicated to the Halo franchise. It features the information about the games, multiple FAQs, guides, tutorials, and media content. Via Waypoint you can monitor your progress in Halo titles and get extra in-game awards.\n\nHalo Waypoint is divided into several sections and not only provides you with the latest news on the franchise but allows to communicate with other players on Forum and purchase Halo merchandise. In fact, it’s the most complete resource of the information on Halo every player can use to stay tuned on the series’ updates.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"343 Industries","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":355,"name":"Bridge Constructor","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/189/189b1795ab39eda546c95bbcdd3c7e60.jpg","description":"Bridge Constructor is a physics-based simulation-puzzle game, the first installment in Bridge Constructor series. \n\n###Gameplay \nThe game consists of 64 levels in six different settings. In each of them, your goal is to build a bridge that would support the weight of the traffic.\nThe game’s physics engine considers many laws of physics. There are four types of materials: weak and cheap wood, expensive and robust steel, flexible cables and concrete pillars. Some levels do not allow using all of them. Your bridge must not only be durable enough but also fit in a budget given to you on every level. If vehicles destroy parts of your bridge, these parts are highlighted in red, so you can easily see on your next attempt. The levels differ in the initial layout of objects and the ravine shape. Each level has three difficulty levels that are represented by types of vehicles driving over your bridge: Car, Truck and Tank Truck. Some levels have additional objects. \n\n###Versions differences \nThe Steam version of the game includes SlopeMania, a full-sized add-on that features new levels, settings and game mechanics.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Headup Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":20947,"name":"Mountain","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0b/e0b7df921a951ec97fa4d7c595dac410.jpg","description":"Mountain is a mountain simulation application which was intentionally made as an anti-game. It features very little gameplay and only a semblance of interactivity.\n\n###Gameplay\nAt the beginning of a new game, the player must undertake a quiz. He or she has to answer several psychological questions by drawing the answers. This is the only gameplay Mountain actually has. Based on the drawings, the program generates a floating mountain that embeds the player's answers. The user cannot interact with the mountain or influence it. However, he or she can observe it from any angle by rotating the camera with the mouse. By using the keyboard, the player can also influence the game's piano music.\n\n###The Mountain\nThe mountain slowly changes over time, acting as a living environment. As the time passes, the mountain goes through the day and night, various seasons, clouds, rains, and snowfalls. New plants can grow and fade on the mountain, and random objects can fall on it out of nowhere. Occasionally, a piece of philosophical text appears on the screen indicating the mountain's \"thoughts.\" The mountain eventually collides with a shooting star and collapses.\n\n###Premise\nThis game was created as an art object and an experiment rather than entertainment. It is meant to fill the time in the background while the user is preoccupied with some other activity. Though hardly a game, Mountain can be used for relaxation and meditation.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"David O'Reilly","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]}]