[{"id":41646,"name":"The Elder Scrolls V: Skyrim - Hearthfire","genre":"RPG","price":0.0,"description":"With this official add-on to The Elder Scrolls V: Skyrim, you can purchase land and build your own home from the ground up - from a simple one-room cottage to a sprawling compound complete with an armory, alchemy laboratory, stable, garden, and more. Use all-new tools like the drafting table and carpenter’s workbench to transform quarried stone, clay, and sawn logs into structures and furnishings. Even transform your house into a home by adopting children.","imageUrl":"https://media.rawg.io/media/games/467/467b4e57229a616e7a24b2ed41429f53.jpg","releaseYear":2012,"developer":"Bethesda Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":39931,"name":"Tekken 5: Dark Resurrection","genre":"Arcade","price":0.0,"description":"After the death of Heihachi Mishima, the fifth King of Iron Fist Tournament began. Tekken 5 lets you join this battle as one of many characters, including three fighters who are new to the Tekken series. This time, the environments feature destructible objects and dangerous obstacles. Put your fighting skills to the test in the journey to prove you are the best!","imageUrl":"https://media.rawg.io/media/games/308/308f06bae565cb5fc9128067ef29c6e2.jpg","releaseYear":2006,"developer":"BANDAI NAMCO Entertainment America","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"}]},{"id":36381,"name":"Psi-Ops: The Mindgate Conspiracy","genre":"Action","price":0.0,"description":"###Meet Nick Scryer.\nAn American soldier with a difference. Slightly more than your typical grunt, Nick belongs to the Psi-Ops division, a section devoted to tapping into latent human psychic and telekinetic powers and exploiting them for military purposes.\n\nScryer's latest mission is to infiltrate and take down a psychic terrorist organization known as 'The Movement'. These mentally-enhanced menaces have been kidnapping troops and manipulating their minds to turn them into unfeeling, unthinking 'Meat Puppets', and it's Scryer's task to put an end to it. As he's attempting to penetrate an organization run by mind-readers, extreme measures have been taken to prevent detection.\n\nScryer has his mind-wiped and his face completely altered to prevent detection by former friends, which leaves him without any knowledge of his powerful psychic powers. Soon after, he's incarcerated after being captured by The Movement, and it's in this prison that he becomes your personal meat puppet.\n\nHelp Nick to gradually rediscover his devastating mental abilities - including pyrokinesis (the power to manipulate fire), remote viewing (see through walls and doors), and mind control - in Midway's stunning and highly original new adventure.\n\n###Details\n\nIt's Nick Scryer's psionic abilities that set Psi-Ops: The Mindgate Conspiracy apart from the myriad action-adventure titles on the market. Abilities such as telekinesis, which allows you to lift and throw objects - including humans - around are not only intuitive to control but great fun with it. This is largely down to the brilliant Havok physics engine, which makes all items react realistically to your actions. Send a barrel flying into a stack of boxes, and they'll all come crashing down; 'grab' an enemy, and you can repeatedly smash them into walls or even shoot at them as they hover helplessly in the air.\n\nAnd that's only one of the six powers on offer. Set fire to an object using pyrokinesis, and you can use it to set surrounding objects aflame too; use mind control to take over a foe and use him to blast his accomplices before forcing him to throw himself down a chasm; or sneak behind an unwitting Meat Puppet and use mind drain to sap his psionic energy and blow his head up in the process...\n\nThe possibilities are numerous, and the game doesn't shy away from giving you an opportunity to improvise with what you have. Need to cross a huge gap with plenty of gun-toting fiends on the other side? Well, you could create a bridge using the objects around you, surf across on a suitably-shaped item, or just use mind control to deal with the distant threat and then safely walk around the hole. It's completely up to you.\n\n###Features\n\n-Command six powerful psionic abilities: Telekinesis, Pyrokinesis, Mind Control, Mind Drain, Remote Viewing and Aura View\n\n-Open-ended game structure - solve puzzles and defeat enemies the way you want to\n\n-Realistic physics - throw enemies around the room, create fires, build blockades, and even 'surf' on objects","imageUrl":"https://media.rawg.io/media/games/7e4/7e4850f6a11373d37f05ff6440caedf1.jpg","releaseYear":2004,"developer":"Midway Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":28396,"name":"3D Ultra Minigolf","genre":"Sports","price":0.0,"description":"Buy 3D Ultra™ Minigolf Adventures - own the most imaginative collection of wacky miniature golf courses. Get ready to tee off for a quick and fun match! Putt your way through 36 crazy holes of minigolf mania! Or create your own custom hole design and challenge a friend. Buy the full game now to practice your power swing! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/686/6863accbe1fad4d16744f65f3a89e8d4.jpg","releaseYear":2010,"developer":"Wanako Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28284,"name":"Tenchu Z","genre":"Action","price":0.0,"description":"In Tenchu Z, you become the ultimate Ninja as you complete 50+ missions set in Ancient Japan to assassinate wrong doers, gather info, track enemies and collect or destroy targets using the art of stealth. Slash unsuspecting guards with a wide array of ninja weaponry on your way to slaying the big bosses. True Ninja mastery only comes with keen awareness of sound, sight and smell detection as you learn new moves and obtain new weapons and accessories. Patience and strategic thinking via use of the stealth kill system is rewarded over a run and gun style of hand to hand combat. Practice missions in single player mode offline, then grab your friends to team up for even more fun in multiplayer mode over Xbox Live or System Link.","imageUrl":"https://media.rawg.io/media/screenshots/558/5584039ee0fcffb005ebec8a2732dacb.jpg","releaseYear":2006,"developer":"K2","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":23629,"name":"Attack of the Earthlings","genre":"Strategy","price":0.0,"description":"Attack of the Earthlings combines turn-based combat and stealth in a dark comedic single player campaign, where you the player, take control of the native alien race to defend your home world from the invading humans.\nSerial Drillers from Outer Space\nGalactoil, a comically dysfunctional energy corporation, are hell-bent on harvesting the known universe for energy and will drill anything worth a dollar in its incessant quest to line its pockets with profit. However, their latest foray into energy exploration on Planet X13, has placed them into a bit of a pickle. The Swarmers, the native insectoid species, have another idea - to eat all the workers!\nThe Perfect Swarm\nYou take control of the Swarmers, a highly aggressive insectoid species, who must convert human flesh into alien muscle, upgrade their units and even find the time to gatecrash a birthday party.\nTo put a stop to the invasion, the Swarmers must plan attacks carefully. Take control of unsuspecting workers, set traps, emerge from vents and hiding spots to take your human prey by surprise, and assault in groups to kill multiple enemies at once.\nIt’s meat Jim, but not as we know it\nThe more earthlings killed, the more corpses can be consumed and transformed into new units with specialized roles and unique abilities. The flesh of their own workers is the key ingredient to developing a successful alien insurgency against Galactoil.\n","imageUrl":"https://media.rawg.io/media/screenshots/de1/de1438d25136b7aa8e3463d65cef8c93.jpg","releaseYear":2018,"developer":"Wales Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":22860,"name":"Settlers 3: Ultimate Collection","genre":"Strategy","price":0.0,"description":"The gods may be crazy! First the Almighty HE, the highest of all the gods, sends Jupiter, Horus, and Ch’ib-Yu off into an extremely arduous competition simply on account of some occasional drinking sprees! Then the three gods are subjected to scorn and derision: Q'nqura, the goddess of the Amazons, lets the trio win in battle out of pure spite, and then their humiliation is complete!\nThe Settlers® III: Ultimate Collection is a lavishly designed, strategy-filled civilization simulation where your industrious people construct buildings, produce goods, harvest crops, and conquer new lands in scintillating real-time battles! Will you heed the call of the gods and become their avatar?Settlers® III: Ultimate Collection includes the original The Settlers® III, The Settlers® III: Quest of the Amazons expansion, and The Settlers® III Mission CD.\nIncludes a full-featured and easy-to-use editor that gives you the power to create your own missions and maps.\nTwo exciting campaigns per faction filled with challenging goals!","imageUrl":"https://media.rawg.io/media/screenshots/a04/a04c2b329f2bc9fa02e6247f25d93926.jpg","releaseYear":2000,"developer":"Blue Byte","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22609,"name":"Pressure Overdrive","genre":"Action","price":0.0,"description":"Step up a gear: Pressure returns with Overdrive! Start your steam buggy and join “La Resistance”...it’s still time to prevent Count Soap from powering his Uber-Spa with stolen water!\nIn Pressure Overdrive you revisit an action packed world, filled with crazy characters and funky humor. This enhanced version will challenge your skills, while you race, ram and blast your way through countless bullets and enemies. Customize your buggy for clever play styles and have a friend join the cause in local coop mode. “La Resistance” counts on you!\nImproved controls\nNew weapons\nSingle player and local coop\nCampaign and freeplay mode\nNew endless mode\nNew bossfights\n3 worlds with 30+ Levels\nDozens of enemy types & 3 bossfights\nUpgrade your buggy with 35+ items\nOnline highscores\n10 languages supported\nSteamfunky soundtrack included!","imageUrl":"https://media.rawg.io/media/screenshots/0ac/0ac315b13f5c1480a97e8247ce32c727.jpg","releaseYear":2017,"developer":"Chasing Carrots","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":22474,"name":"Crystal Catacombs","genre":"Indie","price":0.0,"description":"Crystal Catacombs is a challenging, retro inspired “Megavanian” love letter that utilizes Rogue-like procedurally generated levels/enemies/items with a heavy emphasis on classic 2D platforming.\nDiscover, equip, use, and master an assortment of varied weapons, magic spells and upgrades.\nFeatures:\nSelect from five unique and expansive procedurally generated Crystal Realms, each utilizing different layouts and room designs. No two experiences are ever the same!!\nFind and discover random monsters, treasures, weapons and artifact upgrades!\nXP and Skill Point based leveling system\nOver 40 different unique enemies and bosses to conquer!\nHandcrafted pixel art and animation!\n(Almost Full) Controller support!\nChiptune OST by MaskedEpsilon!","imageUrl":"https://media.rawg.io/media/screenshots/065/065a8b44f9e45569473785ec6742b9a4.jpg","releaseYear":2015,"developer":"Super Fun Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22311,"name":"XOXO Droplets","genre":"Simulation","price":0.0,"description":"XOXO Droplets is a free-to-play dating sim. There's an optional paid DLC that increases the amount of dateable guys and adds a few neat extra features.\nStory:\nThe story begins when our nameable protagonist finally transfers into the boarding school of her dreams at the start of her junior year in high school. It would be perfect if it wasn't for that little catch attached to her enrollment: her parents will only let her keep attending the school for her remaining two years if she doesn't make everyone there hate her by shunning them, like she always does.\nDo your best to show just enough interest in the other losers around to appease the folks while still having time to chase after all the attractive guys in the MC's afterschool group, which just so happens to be a group for chronically unfriendable people.\nNo, seriously folks. When we say the protagonist and main love interests are a big ol' jerk squad it's not a mistake and it's not an understatement.\nFeatures:\n3 distinct jerky main boyfriend options: Everett Gray, Nate Lawson, and Shiloh Fields\n6 side characters who'll be your buddies and 6 minor clique boyfriend options, each with a bonus effect that makes the game easier\nPartial Voice acting for every significant character by a talented cast\nThe option to break up with your bf and start dating someone else, if you feel like it\nA variety of methods to manage your Reputation with the unimportant students\nPart-time jobs, stores to visit, useful items, optional mini-games, an in-game phone to call a guy up and arrange a date at one of several different locations\nOver 130,00 words. Hundreds of different events, including a collage-style ending system where you get events for every goal you achieved during the game\nCheat codes for those who don't give a f*ck about gameplay and just wanna see the events\nCast List:\nEverett Gray: DJ Horn\nNate Lawson: Belsheber Rusape\nShiloh Fields: Brendan Blaber\nBae Pyoun: Griffin Puatu\nJeremy King: Calvin Joyal\nPran Taylor: P.M. Seymour\nJB (Nameable Protagonist): Dee Margret Turner\nAlicia Rosales: Anairis Quinones\nMissy Smith: Elsie Lovelock\nKam Sung: TonyOnorific\nAdrian Wulu: Kyotosomo\nCala Gerges: Dani Chambers\nNurse Lynn: Michael Kovach\nRomeo Franco: Rowan Cross\nTrent Duncan: Joseph Ryan","imageUrl":"https://media.rawg.io/media/screenshots/e84/e84007989ca874edffa1707bbff42483.jpg","releaseYear":2017,"developer":"GB Patch Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21555,"name":"The Oil Blue: Steam Legacy Edition","genre":"Strategy","price":0.0,"description":"The Oil Blue is an indie action-sim that has you drilling for oil in the world’s oceans, selling barrels of oil on the market, and exploring new islands once you completed objectives set by your employer, the United Oil of Oceania company. Set in the oceans in the future, the world’s dependency on oil has grown to an even larger amount. It’s up to you and a crew of men to travel the ocean, find abandoned oil drilling islands, and reclaim them for the United Oil of Oceana company.\n\nOnce you land on an island, you have a set amount of days and oil barrels to make during your stay. Fire up those old drilling machines and start making oil underwater, watch the oil barrel market and sell at the highest price, repair machines and do it all within the time you’re given, or the UOO will boot you off the island for a better crew. Sell more barrels to achieve higher ranks and perks, upgrade your machines, and conquer the ocean!\n\nThe Oil Blue was released in 2010 to enthusiastic reviews and acclaim, including being a part of the \"250 Indie Games You Must Play\" book by Mike Rose. This Steam release contains all new extras, including:\n\n- Original Windows release of the Oil Blue, patched to 1.041. This patch was never officially released until now, which contains fixes that help improve gameplay input.\n- Steam Trading Card support, with all new HD art by Camille Kuo.\n- Steam Achievements, unlocked using the included Oil Blue Achievement Unlocker/Helper App. Simply boot up this program and it will scan your save files for achievement unlocks, including old game saves you can transfer from previous releases!\n- Includes the original game's soundtrack in MP3 and FLAC file formats by Jonathan Geer.\n\n-----\n**Note: This is a legacy release.** The game's original source code was corrupted years back, to where I can no longer patch the game. However this game release contains all of the patches made up to this point, which fixed numerous bugs, added new features, etc. This game was tested on Windows XP, 7, 8.1 and 10, and while it works great on the machines we tested it on, there is a possibility of it not running correctly on your machine. Please view the [official troubleshooting guide](https://steamcommunity.com/sharedfiles/filedetails/?id=491158079) before purchasing for more information. Thank you!","imageUrl":"https://media.rawg.io/media/screenshots/c39/c39327e002b2590d6b2c338cb9988199.jpg","releaseYear":2015,"developer":"Vertigo Gaming","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21270,"name":"Evopollution","genre":"Strategy","price":0.0,"description":"Create oil drills and solar farms in the business strategy game Evopollution.\nYour aim is to turn the money you start with into $1,000,000 out of the profits you earn from buildings like oil drills or gas plants.\nBeware the pollution you create, if an area becomes too polluted it could summon meteors, lightning or even a giant worm creature that could destroy your hard work.\nMaintain your world with trees and keep the pollution low, or even go green with solar panels and wind turbines.\nPlay on areas like the mountains or the snowy plains, earth not hard enough? Try Mars instead and terraform the planet back to its original state.Game Features5 Randomly Generated Maps\nBeautiful Pixel Art Graphics\nOriginal Soundtrack","imageUrl":"https://media.rawg.io/media/screenshots/be8/be80b78e0f0529225929e99880c206c9.jpg","releaseYear":2014,"developer":"Atapki","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21248,"name":"New Star Soccer 5","genre":"Simulation","price":0.0,"description":"Live the life of an up-and-coming superstar in this unique football career game. Start out as a 16 year old lad and work your way to the top to become a footballing legend! You need to train hard, play matches, make transfers, do interviews, stay in touch with friends, sign sponsorship deals, go to the casino, buy cars, and more! With so many distractions in a footballer's life is it any wonder that so many don't make it? But what about you? Can you become a new star?\nKey features:\nThousands or clubs and hundreds of leagues to play in, with realistic continental and international competitions.\nA global leaderboard lets you compare your progress and transfer value against other players around the world.\nPulsating match action with interactive fans and cameramen!\nNewspaper reports highlight your highs, lows and outright scandals!\nThere are 7 keys skills to build up as you grow from young wannabe to international legend.\nYou have 8 relationships to maintain including the boss, fans, girlfriend and sponsors.\nCasino games and horse racing allow you to fritter away some of your hard-earned riches.\nHaggling for a better contract or giving a post-match interview – there are loads of mini-games to master.","imageUrl":"https://media.rawg.io/media/screenshots/2a7/2a70e7be3bed203a3c96ff39a64478f9.jpg","releaseYear":2012,"developer":"New Star Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21238,"name":"Kick-Ass 2","genre":"Action","price":0.0,"description":"Dive into an exciting, action-packed adventure and relive the incredible scenes from the Hollywood blockbuster 'Kick-Ass 2'. A ominous threat is hanging over New York City and only Kick-Ass can stop it. Fight countless hordes of enemies! Put on your mask, hone your weapons, and get ready to kick ass!FeaturesBrutal attacks and devastating combos!\nRelive the film's best scenes!\nExperience an adventure in New York City!","imageUrl":"https://media.rawg.io/media/screenshots/d9e/d9efe3ac535a21306d75535be1e5836d.jpg","releaseYear":2013,"developer":"Freedom Factory","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19049,"name":"Conan the mighty pig","genre":"Action","price":0.0,"description":"Conan the mighty pig as a relaxing action-adventure exploration game. In your quest to find all the lost truffles you must avoid forest creatures and eat plants to gain special powers.\nThere are many interconnected area to explore, including mountain and caves.\nAn extension on the freeware flash game- this is your chance to own your very own copy of this highly addictive game for your Steam library","imageUrl":"https://media.rawg.io/media/screenshots/c2e/c2e5b222f7d7660cba78f955811b41d7.jpg","releaseYear":2016,"developer":"Mihai Morosanu","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18754,"name":"Ferrum's Secrets: Where Is Grandpa?","genre":"Adventure","price":0.0,"description":"Ferrum city was enveloped by a thick fog. Prominent citizens and scientists disappeared and among them well known inventor working on a number of inventions in the field of electricity. Shortly after his disappearance his granddaughter comes to his house. With her favourite kitten Iris, she must face the mystery and discover what happened to her grandpa. Will she manage to save him?\nGame features:\nBeautiful 3D graphics.\nRich world set in the realities of steampunk.\n59 intriguing locations.\n16 unique mini-games.\n13 challenging hidden object scenes .\nMore than 100 items to collect.\nExtra difficulty modes, including an extremely difficult Expert mode. Can you finish it?\nThat's not all! You can explore mysterious labyrinths, collect bonus items, solve intricate puzzle, explore the corners of the plot and everything in a vintage atmosphere of steampunk. It's like an old good movie, but better, because unlike the cinema, you can change the cinematograph and try out new vintage look of the game. Try one of our old-school cinematographs and change the game's look and feel:\nVintage,\nOld lime,\nShort nap.More cinematographs soon!","imageUrl":"https://media.rawg.io/media/screenshots/04b/04b6f7b03b5237bb06b897273a76b04a.jpg","releaseYear":2015,"developer":"ZigZag Soft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17246,"name":"Blight of the Immortals","genre":"Strategy","price":0.0,"description":"Fantasy! Strategy! Zombies!A plague of undead creatures threatens to overwhelm the land and with the fall of each town to the Blight, more walking dead rise and the zombie apocalypse draws nearer.\nFor the first time in centuries, the six great races of Alundria must stand together. The lawful races of Elves, Dwarves, and Men; and the chaotic races of Orcs, Goblins, and Trolls. The strengths that make each race unique... magic, money, and might are twisted and darkened as each creature returns from the dead as a zombie version of its former self.\nTo save the world, you must recruit heroes, expand your empire, and raise armies as fast as you can because as time marches on, so does the zombie horde.Features Blight is a unique blend of Online Strategy Board game and Collectible Card Game.\nMultiplayer is Co-OP. Players must work together to defeat the zombies.\nMultiplayer is slow-real-time and always ticking away in the background. There is no need to wait for your turn,  simply login throughout the day to command your forces and coordinate with the other players.\nIn Single Player is turn-based and you can choose how far ahead in time to jump each turn. Earn Valour by throwing caution to the wind and jumping ahead 12 hours or pay Valour to micromanage your forces and jump ahead just 1 hour.\nThe Single Player campaign include 36 missions spanning the 6 different races. Explore new strategies, collect new hero cards, and master the different races with each new scenario.\nCollect over 100 Hero Cards and explore new strategies and combinations with each deck you build. Early Access\nHelp us test this Early Access build and let us know whats working and whats not. We love hearing from our community and so please join us and be a part of the game's development!About Iron HelmetIron Helmet is the developer behind the award-winning strategy game, Neptune's Pride. Named PC Gamer's Webgame of the Year, Runner Up to Edge Magazine's Indie Game of the Year, and Honourable Mention in the IGF Grand Prize category.\nIron Helmet is Jay Kyburz and Penny Sweetser, who have worked on AAA titles such as BioShock, BioShock 2, Total War, Tribes, Freedom Force, and SWAT 4.","imageUrl":"https://media.rawg.io/media/screenshots/393/39378cc1ea920c72fcd5e13300c50fc9.jpg","releaseYear":2016,"developer":"Iron Helmet Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Web"},{"id":0,"name":"macOS"}]},{"id":17019,"name":"March of the Living","genre":"Adventure","price":0.0,"description":"About the gameThe world is crumbling and the dead are roaming, but a glimmer of hope remains. A safe place where humanity can start over, protected from the hell this world has become. This is your destination.\nAlong the way you'll meet allies, defeat foes and battle through the infected. Manage your resources and make the tough decisions necessary to ensure the survival of your group. In this march for salvation, your choices matter.GenreMarch of the Living is a survival roguelike-like inspired by FTL and popular zombie fiction.FeaturesManage a group of up to 6 survivors\nDefine your journey through over 160 unique events\nA new procedurally generated game world on each play-through\nReal time combat with the possibility to pause at any time\nOver 80,000 words of quality writing\nTrade for the supplies you need\nScavenge for goods in cities\nFour starting characters to unlock\nAdaptive music for an immersive experience","imageUrl":"https://media.rawg.io/media/screenshots/580/580b07f2e05574220adfd42c42c9c44a.jpg","releaseYear":2016,"developer":"Machine 22","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16818,"name":"Forgotten, Not Lost - A Kinetic Novel","genre":"RPG","price":0.0,"description":"Our Media Friends!Ever since our Greenlighting, we've received so much love from everyone and we are humbled!\nOtaku Aniverse - Forgotten, Not Lost has two of the most important qualities needed to make a visual novel great. The most important part of any visual novel is a strong and thought provoking story that draws out emotions in the reader. This visual novel has a solid story that conveys an important message and puts you in the shoes of the main character. Another important feature that should be present in any visual novel is art that compliments the story and emotions. The art in this visual novel is simple but helps to set the mood as it was intended. I highly recommend this to visual novel fans who enjoy emotional stories and simple yet beautiful art.\nSUBALTERN GAMING - Forgotten, Not Lost is a great accomplishment for effectively instilling varying emotions into the writing and overall package of the game and successfully conveying this to the player. While the topic of dementia is sad in itself, it is handled well here and not overly pandering. The author of the story, Darren Kwok, based it off actual experiences caring for someone with dementia. Afterthought Studios’ in concert with the motto of Touching Hearts Through Words, created this short kinetic novel. It is a mature title backed by a mature–in professionalism at least–company. It’s short and inexpensive, and a great example of an indie title matching big-budget talent.\nFuwanovel - It does what few VNs manage to do, by tackling a serious health, and psychological issue, in a very real, and relatable way.\nHayurika - ... the story does leave the player with a deep feeling for the farmer and his illness, hopefully helping raise more awareness about dementia and Alzheimer’s in the long run.\nVNVortex - The art of the game is quite simplistic, but it fits the sorrowful theme very nicely – same can also be said for the music, which complements the whole package neatly.\nMeru's Reviews - The music (which I liked a lot), character sprites, and backgrounds are quite simple and subdued, but fittingly so, given the themes and setting, and they work together with the words to evoke a bittersweet atmosphere that veers between joyful and gloomy along with the protagonist’s changing moods.\nAbout the GameAn old farmer lives with his wife - However, he hasn't quite been himself lately. His mind wanders off, he forgets his daily routine and he often brings up things from the past.\nForgotten, Not Lost comes from the creators of A More Beautiful World and is a kinetic novel that tackles the theme of dementia and is a visual novel that hopes to bring tears into our readers' eyes, especially those who have gone through similar situations when dementia or Alzheimer's has claimed the memory of a loved one.\nSet in a medieval world, take the role of a farmer, who has dementia and is slowly forgetting details of his life to the heartache of his elderly wife... Or is it that simple?\nThe author of the story, Darren Kwok, based it off actual experiences caring for someone with dementia - Afterthought Studios' in concert with our motto of Touching Hearts Through Words, created this short kinetic novel.\nFor media inquiries, please email pr@afterthoughtstudios.org","imageUrl":"https://media.rawg.io/media/screenshots/a3c/a3cbc45c9360b58c8dcea11058c9ee92.jpg","releaseYear":2016,"developer":"Afterthought Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12949,"name":"Climbtime","genre":"Casual","price":0.0,"description":"Game supports gamepad and VR Vive controllers. Note for the demo version only the first two levels are available. For the demo, achievements are disabled and a separate leaderboard for level 1&2 demo times.\nGame goals/modes\nThe game currently has five modes\nClimb\ntime-attack - reach the highest block(the one with a blue spinning cube over it same as the one at the base) as quickly as possible.\nFly(Vive only)\nGlide(gamepad/keyboard)\ntime-attack - destroy(by making contact) all 10 cores(the spinning/pulsing red orbs) at each floating block as quickly as possible\nCrystal Hunt\nFind and collect(using the crystal shot) all 10 hidden crystals in the tower. The crystals are small blue cubes and create a sound which grows louder as you get nearer.\nExplore\nFly, glide or long-distance teleport over the terrain and enjoy the views which are modeled on the below real-world mountain and canyon terrains. More content to find in this mode coming.\nGreat Smoky Mountains, USA\nCastle Valley, Utah, USA\nYosemite, USA\nGrand Canyon, USA\nSee in-game pause menu(start button, F1 or Vive controller menu) for settings, Controls, Game modes and additional notes.\nNote that game engine graphics and input config options can be accessed by holding down shift or alt or ctrl key while starting the game.\nIf using the Oculus Rift and the game fails to load, let me know and I will try to publish a separate branch download oculus rift specific version.\nCredits:\nMusic for levels 2,4,6,8 by Talon Vick https://www.tolanmusic.com","imageUrl":"https://media.rawg.io/media/screenshots/b96/b961820ddf21227a104c47a040ee02f2.jpg","releaseYear":2016,"developer":"Saluda Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12595,"name":"Crea","genre":"Action","price":0.0,"description":"Embark on an adventure with what little you have and discover what the world of Crea has to offer. Through each action, improve your talents and master many skills. Through each victory, grow in strength and shape yourself. Through each inquiry, unlock new items to craft and build. Through each expedition, explore new realms and uncover Crea’s lore.\nLevel up by defeating enemies\nLearn over 80 skills through the talent system\nLoot and craft powerful gear with unique attributes\nDiscover the world’s expansive mythos and history\nDefeat challenging original monsters each with their own attacks\nSurvive by timing shield blocks and dodge rolling\nVanquish by your weapon of choice: Sword, Spear, Bow, or Magic\nChallenge massive bosses and prepare to die\nResearch materials to discover their crafting capabilities\nFind old recipe scrolls scattered throughout the world\nUpgrade equipment to carry over their stats\nUse chaos crafting (minigame) to create even more powerful items\nExplore massive procedurally generated worlds\nQuickly teleport through the use of Way Crystals, Way Shards and Rifts\nDelve into dungeons that not only look different but play different every time\nTravel to completely new Realms beyond the bounds of the main world\nBuilt from the ground up with modding in mind\nAll gameplay logic and content exposed in Python\nEasily create new content or entirely new gameplay systems\nLearn from extensive modding tutorials and API documentation\nJoin in on the Development Streams\nTrack progress and what’s planned on the Roadmap\nGet the latest development news on Twitter","imageUrl":"https://media.rawg.io/media/screenshots/e9e/e9e229c5c07f23090cf96f09c3843320.jpg","releaseYear":2016,"developer":"Siege Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12519,"name":"Tomoyo After ~It's a Wonderful Life~","genre":"Adventure","price":0.0,"description":"A visual novel developed by KeyStory\nThis is a sequel to CLANNAD, following Tomoyo's ending.\nTomoya, the protagonist, has started to work at a waste collection company in the outskirts of town. He recently begun living on his own, and enjoys a calm and happy life with his girlfriend Tomoyo.\nOne day Tomoyo's brother, Takafumi, brings his father's illegitimate child, Tomo, to Tomoya's apartment.\nTomo had been abandoned by her mother, and Tomoya and Tomoyo reluctantly decide they would look after her.\nFurthermore, Takafumi's ex-girlfriend, Kanako, ran away from her home just before the start of summer vacation.\nShe too ends up staying in Tomoya's room.\nTomoya, Tomoyo, Tomo, Takafumi, Kanako.\nAnd so begins the first and the last summer these five people will spend together.Characters\n\"A never ending love does exist, I know it...\"\nTomoyo\nThe homely heroine who supports Tomoya, who has just joined the workforce out of high school.\nShe is actually very good at fighting and would win even against a group of people ganging up on her.\n\"It's like a curse born of my mistake...\"\nTakafumi\nTomoyo's brother. He is very well-versed with computers.\nAgainst Tomoya's wishes, he set up a computer in the room and visits to sue it frequently.\n\"If something like that doesn't exist... It's better to enjoy life as much as you can.\"\nKanako\nA girl who ran away from home, unhappy with her mother's upcoming remarriage.\nShe apparently used to date Takafumi and has a foul mouth.\n\"Then make up with a kiss.\"\nTomo\nThe illegitimate child of Tomoyo's father. An innocent young girl who would believe in anything.FeaturesFully voiced story\nTomoyo After features a fully voiced story and stars the phenomenal voice talents of Hikaru Isshiki (Little Busters!, The Fruit of Grisaia) and Yuichi Nakamura (CLANNAD anime)\nDungeon & Takafumis\nFeaturing the characters of the main story in a fantasy setting, \"Dungeon & Takafumis\" is a fully-featured, comedic strategy RPG that will add hours to your experience\nTomopedia\nNewly added to the English Edition, Tomopedia provides insight into Japanese culture and explanations for cultural references that you may come across in the story.Staff\nGame Brand: Key\nGame Design: Jun Maeda\nScenario: Jun Maeda, Leo Kashida\nIllustration: Fumio\nMusic: Shinji Orito, Magome Togoshi, Jun MaedaTheme song\nTitle: \"Light colors\"\nLyrics: Jun Maeda\nComposition: Shinji Orito\nArrangement: Kazuya Takase (I've)\nVocals: Lia","imageUrl":"https://media.rawg.io/media/screenshots/a2a/a2a6a9176a34376c42758242513ad6f9.jpg","releaseYear":2006,"developer":"VisualArts/Key","libraryGames":null,"platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"}]},{"id":11833,"name":"Memoranda","genre":"Adventure","price":0.0,"description":"Memoranda is a game about forgetting and being forgotten!\nA point and click adventure game with magic realism elements that tells the story of a young lady who gradually realizes she is forgetting her own name. Is she really losing her memory or is there something else that could explain the strange circumstances?\nThe story happens in a quiet little town where a few ordinary and strange characters live together. Including a World War II surviving soldier to an elephant taking shelter in a man’s cottage hoping to become a human. There is one thing all these characters have in common: they are losing something. It could be a name, a husband or even someone’s sanity!\nThe story is inspired by various Haruki Murakami short stories that describe a surreal world full of lonely characters.\nFeatures\n- A classic 2D point and click adventure game in a magic realism setting.\n- Unique and beautiful hand-drawn full-HD 2D graphics.\n- Inspired by many of Haruki Murakami’s short stories.\n- Original soundtrack with more than 15 tracks.\n- Thousands of lines of dialog with English voice over.\n- Meet more than 35 characters in 40 different locations.","imageUrl":"https://media.rawg.io/media/screenshots/6a0/6a0ed54cb31f57973026c8b8350e17c4.jpg","releaseYear":2017,"developer":"Bit Byterz","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":11826,"name":"Reflex Arena","genre":"Action","price":0.0,"description":"Reflex Arena is an old-school arena shooter that updates the dizzying speed and demanding precision of a classic arena FPS with the power of modern gaming technology. If you spent your youth gibbing your friends in Quake III Arena or Unreal Tournament, then Reflex Arena is what you’ve been missing.\nReflex Arena recreates the lightning-fast twitch gameplay of the golden age of first-person arena shooters. It’s the best of both worlds: the speed and precision of a classic 1990s shooter, reborn inside a bleeding-edge 3D engine custom-built for the latest gaming hardware.\nIn the 21st century, first-person shooters abandoned the brutal purity of Quake III Arena and Unreal Tournament, but indie studio Turbo Pixel decided it was time for a comeback. There are no chest-high walls to take cover behind here, and no profound insights into the horrors of war—Reflex Arena is nothing but fast, competitive, first-person fun.\nJust Check Out All these Features!\nOld-school arena shooter recreated in a gleaming modern game engine, welding 1990s twitch gameplay with all the benefits of modern technology.\nSmart matchmaking, support for group play, statistics tracking, championship ladders and everything else you need for competitive and social online multiplayer.\nPersonal servers and full LAN support so you and your friends can play the way you want to without lag slowing you down.\nClassic gameplay modes including free-for-all and team deathmatch, capture the flag and tense one-on-one and two-on-two duels, plus mutators like big head, arena, and instagib.\nRandom item drops let you personalize your character with hundreds of cosmetic upgrades, or trade them with other players using Steam Inventory.\nBuild a custom map right inside the game, solo or multiplayer, then instantly test it in-game and upload it to the cloud for other players to check out.\nCustomize your UI to show you the information you need the most using simple-to-learn Lua scripts, then share your custom UI with other players.\nFull Steam Workshop integration means you can easily browse and download community-created content.\nIn-game replay editor with a full suite of features allows players to relive their glories and disappointments and taunt their defeated opponents with highlight reels and frag films\nNew features coming soon!\nSmart and adaptable AI-controlled bots to keep you on your toes when nobody else is around—use them to hone your skills before plunging into online multiplayer.\nCompetitive seasons will reward players for their skills in online matches by immortalizing them on a season leaderboard and awarding them points to spend in the store.\nCompetitive points earned in online multiplayer match-ups will be redeemable for cosmetic items for personalizing the look of your combatant: character skins, golden weapons, and more.\nTurbo Pixel Studios is a small independent development team in Australia formed by industry veterans with decades of game development experience. Drawn together by a common love of the high-speed, high-performance, no-nonsense shooter experiences of their youth, the team came together around their debut project, Reflex Arena. This old-school competitive arena shooter is the epitome of everything the team loves: classic twitch gameplay enriched by two decades of advances in design and technology.","imageUrl":"https://media.rawg.io/media/screenshots/1eb/1ebf2b4518e566c076e8ba0edef3d919.jpg","releaseYear":2017,"developer":"Turbo Pixel Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10457,"name":"Warfare Online","genre":"Strategy","price":0.0,"description":"Engage in intense battles in Warfare Online, a tug of war game from the creators of Warfare 1917 and 1944. Assemble your own custom platoons and take them to battle online against commanders from all over the world!\nAccessible Real Time Strategy\nBuild custom Platoons\nDestructible Cover\nOver 150 Support Assets to collect\nOnline Multiplayer\nFree to Play","imageUrl":"https://media.rawg.io/media/screenshots/23d/23d4403d02284c17996bfe57e7aa2ba4.jpg","releaseYear":2017,"developer":"Con Artist Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9889,"name":"Street Legal Racing: Redline v2.3.1","genre":"Racing","price":0.0,"description":"Special EditionMany thanks to the entire Street Legal community for voting for this game in Steam Greenlight!\nAbout the Game\nStreet Legal Racing: Redline is a legend, it's the world's most popular vehicle mechanic simulator with night drag races and on-track racing events. We have improved the original game by adding a lot of new features and fixing old bugs.WARNING: THIS RELEASE IS STILL BETA, IT COULD BE UNSTABLE AND CONTAIN BUGS!What's new:\n16 cars from Street Legal 1 with all models, correct prices, descriptions, etc.\n17 new high-quality maps, including drag strip with working traffic light\n7 new gamemodes, including Drifting, Circuit racing and Drag racing\nPedals for automatic, semi-automatic and manual transmission\nSwaybars\nDTM modifications of Nonus, Baiern and Einvagen\nDTM V8 engine\nShimutshibu Focer WRC bodykit\nFixed baiern custom headlights and little fixes to chassis\nPaintable stock rims\nUnlocked hidden suspension scripts\nBugfixes for previous versions of the game\nTyre texture replacement\nNew rear wings\nSide exhaust for Prime DLH\nNew mufflers\nImproved F3 camera for all stock cars\nSkydome animation\nGullwing doors for SuperDuty\n900km/h speed limit\nCompletely new high-quality animated graphic interface, a lot of fixes and improvements to old interface code\nRussian language support\nDebug features (stop EXE, on-screen debug, print to log)\nTHOR: little addon for asynchronous code execution\nNew type of GPS map with automatic route generator\nEntirely new main menu\nExtended freeride mode: now you can select the map\nAdd-on gamemodes and maps support\nExtended career mode with over 60 racing events\nCamera animations on race start\nBoth manual and automatic savegame support\nNew unlockable cheats (fillmygarage, testme, reddevil)\nCompletely new credits menu\nHall of fame: my personal memorial in the game in honor of the legendary members of Street Legal community\nNew soundtrack, including unreleased tracks of Hotel Sinus\nPaint booth as a dedicated game area\nPaintcans with selectable RGB/HSL color and capacity\nNo more vehicle information in Joe's dealership\nNew trade-in dealership\nThree ROC prize cars\nAutomatic, semi-automatic and manual transmissions as separated parts\nDifferential as a separated part\nAdditional MC hood\nNew model of Prime car: DLH750\nPrime DLH500 is not a special car anymore and become available for purchase\nPolice versions of playable cars in Hot Pursuit gamemode\nParticle systems for tarmac, sand, gravel and grass\nNew ground detector code: now the game can tell you if you're driving off the asphalt area\nAdded code for checking RPM in the java\nAdded code for controlling vehicle programmatically from java\nBuilt-in debug tools for placing environment sounds, camera animation points, OSD calibration, etc.\nCompletely new OSD for all stock cars\nNew default OSD\nNew game fonts\nNew cursors\nNew high-quality game icon and new logo\nAbility to get into the car in dealerships\nVehicle class detection\nGhost driver feature\nAbility to talk to police\nHigh-resolution skydome textures\nAnimated OSD message boxes\nBuilt-in automatic RDB builders to help modders\nFlappable parts can be opened by click in dealerships\nTons of improvements in original game code\nNew decals and logos\nAutomatic save is more frequent\nCompletely new traffic\nMoveable parts in the garage\nDriveable garageSpecial thanks to:\nGTR-X-ITE\nMiNTACiD\nA-Crow\nSannex\nFrIEnDKiLLeR\nRazeil\nJim\nInvictus\nSnakeR\nAkvalang\nKOcccTya\nILLKING\nuser12\nREDLINE_RACER\nDraeghonov\nJAG\n123sw\nkarpej\nJOZ\nCjYoung\nGreen2989Huge thanks to the great guy RASTA-BEAT! Dude, you're the best!","imageUrl":"https://media.rawg.io/media/screenshots/9ee/9eefa88f01297ba6a641dd7c6f277a3c.jpg","releaseYear":2016,"developer":"ImageCode","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":8326,"name":"Third Eye Crime","genre":"Action","price":0.0,"description":"Feature ListThird Eye Crime Features:\n•Gorgeous visuals are set to a soulful jazz soundtrack in noir stylings, coming together to create a stylistically immersive gameplay experience.\n•Third Eye Crime offers a unique twist to the stealth puzzle game genre. The goal is not just to avoid being caught by the enemy, but to misdirect enemies, leading them on a wild goose chase so the player can make a clean escape\n•Play through three acts covering eight unique environments totaling over 120 levels and visually intuitive gameplay, beginners are effortlessly eased into the heist before launching into increasingly complex levels.\n•Intelligent pathing design perfected through Moonshot Games’ AAA-experience underscores Third Eye Crime’s stealth aesthetic, intuitive for a player of any skill level to pick up.\nAbout the GameThird Eye Crime is a stealth puzzle game featuring Rothko, a smooth-talking criminal who can telepathically predict where enemies will move to attempt to thwart his heists. Players must rely on skill and their “third eye” to deftly make an escape. Third Eye Crime was created by AAA-turned-indie developers Moonshot Games, harnessing years of design expertise at Bungie on successful titles in the Halo series to create a fully independent, cinematic experience.","imageUrl":"https://media.rawg.io/media/screenshots/8d1/8d1b382b076ddf413988cf6d8f53ed95.jpeg","releaseYear":2014,"developer":"Gameblyr","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":7,"name":"Laserlife","genre":"Action","price":0.0,"description":"Remember what it means to be a human in this interactive biography of a dead astronaut found in deep space by future intelligences who have no concept of humankind.\nWith technology far beyond human comprehension, the discoverers of the astronaut use lasers to build physical replicas of the astronaut’s long-dead memories in hopes to understand what this strange creature was and why they are floating through space alone.\nBy controlling dual lasers with both analog sticks, players will:\nCollect Memory molecules scattered around the mysterious space ship\nHarmonize the Astronaut’s memories within the Astronaut’s metaphysical plane\nWarp back to reality through the Astronaut’s subconscious, avoiding mental blocks\nEnergize the dead Astronaut so it can create physical manifestations of its memoriesLaserlife is meant to be played in one sitting, so turn down the lights, turn up the volume, and get lost in this existential adventure about what it means to be a human.\n*Laserlife requires either an Intel® RealSense™ Camera or a controller in order to play*","imageUrl":"https://media.rawg.io/media/screenshots/7fc/7fc2823632067ce1306495739708e0ef.jpg","releaseYear":2015,"developer":"Choice Provisions","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":966906,"name":"Horizon Forbidden West Complete Edition","genre":"Action","price":0.0,"description":"Join Aloy as she braves the Forbidden West, a deadly frontier that conceals mysterious new threats.\r\n\r\nThis Complete Edition allows you to enjoy the critically acclaimed Horizon Forbidden West™ in its entirety with bonus content, including the Burning Shores story expansion that picks up after the main game.\r\n\r\nBrave an expansive open world – discover distant lands, new enemies, rich cultures and striking characters.\r\n\r\nA majestic frontier – explore the lush forests, sunken cities and towering mountains of a far-future America\r\n\r\nConfront new dangers – engage in strategic battles against enormous machines and mounted human enemies by using weapons, gear and traps crafted from salvaged parts.\r\n\r\nUnravel startling mysteries – uncover the secret behind Earth’s imminent collapse and unlock a hidden chapter in the ancient past… one that will change Aloy forever.","imageUrl":"https://media.rawg.io/media/games/ebd/ebda55ee4922cbbc1c15d41cf3845519.jpg","releaseYear":2023,"developer":"Guerrilla Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":961624,"name":"Quasimorph: End of Dream","genre":"Action","price":0.0,"description":"ADD TO WISHLISThttps://store.steampowered.com/app/2059170/Quasimorph/\nAbout the GameEvery mercenary is looking for that one job that will allow them to retire. And it seems that you've just stumbled upon it: the AnCom corporation is asking you to retrieve the intellectual assets of the Fresco corporation.\nGather your gear, prepare your clones, and get ready for the start of a story that will forever change the Solar System.Level the Playing Field. At Any Cost.Become the boss of your own Private Military Company: carry out orders from corporations, and earn a reputation with your blood and sweat. Explore planetary bases, secret labs, and the wreckage of spaceships to find new technologies, abilities, and other items that will help you level the playing field during operations.\nMake mistakes. Overcome and become better.Remember that you have an advantage: clone the best employees and send them to certain death to probe the weaknesses of your opponents. There is no need to risk valuable human assets and expose your PMC to unnecessary legal risks, for nobody cares about the fate of a clones.\nDon't Bury Yourself Under the Crossfire.Corporations hire ruthless mercenaries to carry out their shadow operations. Demons distort human nature and pervert human evolution.\nGather a team of professionals, count your ammo, and keep track of your equipment to be prepared for any perversions of this space slaughter.","imageUrl":"https://media.rawg.io/media/screenshots/6af/6af93574b59fbcb412c8ce636ef63941.jpg","releaseYear":2023,"developer":"Magnum Scriptum","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":850769,"name":"FreestyleFootball R","genre":"Action","price":0.0,"description":"《Freestyle Football》 is an online soccer game developed by JOYCITY, a well-known Korean online sports game company. The game adopts a fashionable and flamboyant visual style, incorporating elements of street art and soccer art. In 《Freestyle Football》 you can show your individuality and charm, and also enjoy the fun of teamwork.\nIn《Freestyle Football》your mini team will consist of 5 characters including a goalkeeper. Each player will control one character to participate in the game.\nThere are 3 game modes in Freestyle Football:\n1.4V4 mode with fast-pace.\n2.Friendly game where you can play freely with your friends.\n3.Breakout mode where you can enjoy the game alone.","imageUrl":"https://media.rawg.io/media/screenshots/43f/43f2f4994321b4f30b1629c541e26d7f.jpg","releaseYear":2022,"developer":"Joycity","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":545036,"name":"Mad Games Tycoon 2","genre":"Strategy","price":0.0,"description":"Start your own game developer studio\nIt is the year 1976.A few revolutionaries set out to take over the entertainment industry. You too take the risky step and found your own game company in a small, unimpressive office.\nBuild your own studio with offices, production facilities and server rooms. Place decorative objects in your offices to increase prestige and attract the best employees in the industry. Watch out for pollution, heat and employment opportunities for your staff.\nBuy the most desirable offices and become the leading manufacturer of computer games and consoles.Develop games and consoles\nWith \"Mad Games Tycoon 2\" you have countless options to develop the game of your dreams. From a simple text adventure to expensive MMOs. Develop games for high-paying publishers or produce and distribute games from the competition. Do you want to publish your games on all consoles, or do you want to create the next exclusive hit for the most successful home computer? Design the most impressive next-gen console and dominate the hardware market.Dominate the game industry\nHire the most legendary game developers, sell your most advanced engines to the competition, or buy out all game developer studios. You have countless ways to influence the game industry. Guide your small studio through all crises and make it a market-leading company.","imageUrl":"https://media.rawg.io/media/screenshots/e2c/e2c800ba2adabc3444221d887ae620fe.jpg","releaseYear":2021,"developer":"Eggcode","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":442841,"name":"WRC 9 FIA World Rally Championship","genre":"Simulation","price":0.0,"description":"Preorder now to get the Audi Quattro A2 1984 when the game releases.\nFollowing a successful return in 2019, the WRC license is back and even better with WRC 9.\nThe Off-Road simulation standard with realistic physics praised by the best drivers, WRC 9 offers even more content.\n2 new game modes designed for the community:\n- A completely customisable league system so you can challenge your friends in multiple rallies\n- A Co-Driver mode for playing in Co-Op\nGet all of the drivers and official cars from the 3 categories (WRC, WRC 2, WRC J), as well as all of the Calendar's rallies, including the 3 new ones: Kenya, Japan and New Zealand.\nImproved physics for even more realism, and environments redesigned to provide total immersion.\nMore regular multiplayer content with daily, weekly and monthly challenges.\nOffline multiplayer (2 players)\nOnline multiplayer (2-8 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nUses DUALSHOCK 4 vibration function\nPS4 game can be controlled via PS Vita\nEnhanced game play on PS4 Pro console\nOptional In-game purchases\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","imageUrl":"https://media.rawg.io/media/games/555/555b41df1e7348328fcac9a3b2c5b653.jpg","releaseYear":2020,"developer":"Kylotonn Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":427764,"name":"Yokai's Secret","genre":"Action","price":0.0,"description":"Plot overviewFor thousands of years, the Yokai-girls in the \"Country of Yamato\" lived in peace with human beings, but the Yokai-girls suddenly rioted, and the whole world lost its color. As the \"Master Hentai\"before, you undertake the responsibility of saving the Yokai-girls and the world!\nFeaturesMove the color blocks, complete the color arrangement puzzles, and reveal the truth of the riots!14 Yokai-girls with different characters are looking forward to meeting you！❤With live2D technology, all characters will move! Every Yokai-girls has multiple interactions!Each character has an exciting personality voice!❤","imageUrl":"https://media.rawg.io/media/screenshots/a84/a84cd5a244300860457ee30786e81061.jpg","releaseYear":2020,"developer":"Double W","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":349598,"name":"BOMJMAN","genre":"Action","price":0.0,"description":"BOMJMAN is an epic saga based on a cartoon with the same name. The game will immerse you in the atmosphere of a grim post-cyber-antiutopistic megalopolis whose streets have been swept by an unbelievably colossal wave of injustice that paralyzed all the peace-enforcement agencies.\nThe main hero is a regular person who, because of tragic bout of slacking off, received a lethal dose of unemployment and became a Hobo-Man! Since then he's been selflessly, senlessly, and unreasonably using his superpowers to save the day fighting forces of crime and evil. If he's not too lazy, of course. But once, our hero faced a threat he's not been prepared for. A secretive and well-organized organization has crept into the city. Trying to confront them, Hobo-Man cannot even imagine what kind of trouble he found himself knee deep in.\nYou're about to become a hobosapien and sort out the mess in this breeding ground of human sin. Strip the corrupt officials of their legal immunity using a wide selection of ranged and melee weapons. Cut through mobs of thugs without fear and fight the bosses of the most ruthless factions of the city. Stun them with your supernatural stench and smash their craniums with your fossilized sock. The most imporant thig - don't lose yourself in those murderous intricacies in which our hero is about to step with his unwashed feet...","imageUrl":"https://media.rawg.io/media/games/ec5/ec5fcbc9d8e77ccb13559958ad848a32.jpg","releaseYear":2020,"developer":"Bomjman Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":327245,"name":"Stronghold: Warlords","genre":"Strategy","price":0.0,"description":"For the first time ever Stronghold: Warlords allows you to recruit, upgrade and command AI lords across the battlefield in the form of in-game ‘Warlords’. Each warlord under your command boosts your strategic prowess with unique perks, characteristics and upgradeable abilities. Put them to work for your industry, fortifying borders, forging weapons or team up for a pincer attack! Each campaign mission, skirmish game and multiplayer battle means a fresh set of warlords to command and new strategic depth to discover.","imageUrl":"https://media.rawg.io/media/games/45d/45dbd2760b31b8b521da217b7154b689.jpg","releaseYear":2021,"developer":"FireFly Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":250011,"name":"Jupiter Hell","genre":"RPG","price":0.0,"description":"Jupiter Hell is a classic, turn-based roguelike set in a 90's flavored sci-fi universe. Set on the moons of Jupiter, the game pits a lone space marine against overwhelming demonic forces. Rip and tear zombies, demons and unmentionable monstrosities, using classic weaponry such as shotguns, chainguns, railguns and the trusty chainsaw. All to the shine of CRT monitors and the tune of heavy metal!\nDive deep into a true form of the 30 year old roguelike game genre that has resurged in popularity. Experience tactical permadeath challenges in glorious 3D visuals. Jupiter Hell is the spiritual successor to DoomRL, the parody roguelike that years ago streamlined the traditional format and popularised a new wave of accessible roguelikes. Distilled, hardcore gameplay, fast-paced challenge and limitless death all await.True Roguelike!\nThe classic tactical mix of permadeath with turn-based, procedural gameplay, but now updated with modern graphics and accessibility. A traditional roguelike designed for all players.Fluid Gameplay\nDynamic turn-based action with unique adaptive animation system lets you play at your own pace. Supported by intuitive interface and streamlined gameplay for action-focused entertainment.Smart Procedural Generation\nBuilt upon decades of expertise in producing truly engaging procedural content. Layered procedural structures, adaptive challenges and intermeshing random systems ensure engaging variety.Limitless Challenge\nA game full of tense tactical combat, tight resources and legendary boss battles. Advanced difficulty modes and special challenges cater for the most masochistic players.","imageUrl":"https://media.rawg.io/media/screenshots/c86/c865deec91bf85da36363ab13451beaf.jpg","releaseYear":2021,"developer":"ChaosForge","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":64217,"name":"Mr.Jezko","genre":"Adventure","price":0.0,"description":"\"Mr.Jezko\" is a small hedgehog adventurer that collects fruits on numerous levels, full of dangers and predatory creatures. Solve the puzzles to collect all fruits and avoid traps.Climb on the ledges and switch on portals to succeed.Collect stars to get higher score.\n- Platformer with puzzle elements\n- 4 different locations\n- 40 cunning levels\n- Cute hedgehogs","imageUrl":"https://media.rawg.io/media/screenshots/464/4640ead5c93b1557d969b5539bce2ed9.jpg","releaseYear":2018,"developer":"EasyGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":61105,"name":"The Caligula Effect: Overdose","genre":"RPG","price":0.0,"description":"Mobius. An idyllic world that exists for the sake of letting people forget about the pain and problems of reality. In this world created by a sentient vocaloid program, μ (Mu), reality and fantasy has become blurred, allowing people to relive their high school years in bliss. Yet in this seemingly beautiful and perfect world, something is amiss.\nEscape from this false paradise with your fellow students and return to reality in The Caligula Effect: Overdose!\nKey Features: An Overdose of New Features -  The Caligula Effect: Overdose boasts enhanced visuals and gameplay! Explore new scenarios, endings, and the “Forbidden Musician Route” while escaping the virtual world of Mobius.\n\nThe New Faces of Kishimai High - Play as the newly added female protagonist! Plus, meet two new members of the Go-Home Club, who each have their own new Ostinato Musician to face.\nUse the Imaginary Chain! - Turn-based battle meets exhilarating action in this refined JRPG battle system! Develop a flawless strategy after using the Imaginary Chain to predict what your enemies will do next!\nUnite and Escape - Sometimes, it’s hard to go it alone. Befriend over 500 other students in this imaginary paradise to improve your skills in battle and ultimately return to reality.","imageUrl":"https://media.rawg.io/media/screenshots/874/87488ab238ecb7c5de6cb752b9d97730.jpg","releaseYear":2018,"developer":"Engine Software","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":59814,"name":"Future Proof","genre":"Adventure","price":0.0,"description":"A meteorite is about to hit the town of Greensvale and you don't have much time to find a way out!\nYou play as a teen-age boy named Sean who has the untapped ability to go back in time when he dies. Trapped in a time loop by the fiery death of a meteorite impact you must find a way to either escape or save the town from destruction.\nYou are not alone, however - with the help of several other stragglers in the town you will have to solve problems and find a way to help everyone, or yourself – you choose!\nBe wary though, as nothing is as it seems in Greensvale and secrets are waiting to be discovered around every corner!\nGet ready your red string and corkboard as you try to piece everything together.Features:\nA single-player 2D puzzle adventure game with both challenging and rewarding logic-based puzzles.\nThe level of challenge you want to take on is up to you.\nComplete freedom to explore the town of Greensvale.\nGet what you want out if it - play-time is around 2 hours for main ending and may take 15+ hours if you want to try find all the endings.\nReplay value - 14 different endings. If you want to find just one or all of them is up to you.\nCollect items and clothing from around the town to help you solve puzzles and avoid dangers.\nThought system to help you keep track of different clues you may find.\nVisually fresh and unique inspired by 90's cartoons and classic games like Earthbound.\n","imageUrl":"https://media.rawg.io/media/screenshots/53a/53a99f48f5d919ef2fca65480d61e292.jpg","releaseYear":2018,"developer":"Silhouette Valley Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]