[{"id":292944,"name":"112 Operator","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/006/006aeb072314f08590e7ab6b38e7721b.jpg","description":"112 Operator allows you to manage emergency services in any city in the world! Dispatch units, take calls and face situations caused by weather, traffic or changing seasons. Help the city survive escalating events like riots, organized crime, terrorist attacks, cataclysms, natural disasters and many more!Danger has escalatedHelp on a scale bigger than ever before. The sequel of the award-winning 911 Operator lets you act on many, completely different levels - from taking care of a single neighborhood, to coordinating several operators’ work in the world’s biggest metropolises. Full 3D visualisation will give you the inside view of your units’ actions. Choose from over 100 000 areas, such as districts, municipalities, and tens of thousands of real cities from all over the world.To all units: a storm is coming…Face the dynamic weather, based on authentic, historical data. Watch the incidents change as day or night comes, traffic increases and seasons pass. Watch out for extreme conditions that may lead to cataclysms and natural disasters. Try to tame big wildfires spreading across the map. Weather isn’t your only problem though - be careful when dealing with terrorist attacks and gang wars.112, what’s your emergency?Take calls from people in various situations, needing the emergency services’ help. You never know who’s on the other side of the line - you might hear a frightening murder story, maybe you’ll have to instruct someone on performing CPR, or keep your nerves while encountering an annoying prankster.It’s my job, ma’am...Choose one of the European cities in completely new Career mode and find out if you’ll manage to climb up to the very top of an operator’s career ladder. Follow the commands of your supervisors and see your actions affecting people you’re in charge of or those who need your help. Sometimes your mistakes will only be followed by a reprimanding e-mail, sometimes they’ll influence your own life.\nYou can also play special scenarios in any city in the world, or make your own rules in the Free Game mode.We need backup!Command the best specialists, using technologically advanced equipment and vehicles. Decide what to use - a SWAT team, Search and Rescue helicopter, or maybe riot gear? When your units arrive at the scene, command them in the tactical view that gives you the full image of the situation.NEW FEATURES IN 112 OPERATOR:25 times bigger, expandable maps of REAL CITIES with 3D buildings\nentirely new set of emergency calls and large events\ncompletely redesigned campaign mode, with objectives system, emails and a story\nday&night, weather, seasons and traffic now influences the duty and the incidents happening\nnew fire mechanic, that can consume entire areas and require dozens of units\nregion specification - gameplay will vary depending on a country legislation and district characteristics (slums / business / residential /industrial / forest etc)\nnew OnSite situation visualization that shows the action precisely and intuitively\nnew team members - doctors, sergeants, dogs, robots and others!\nadditional dispatchers, that you can assign to districts for help!\nredesigned equipment, now packed up in entire gears","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Jutsu Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17851,"name":"Dwarfs!?","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/857/857c69f58359e999c195ebd4f72cecbc.jpg","description":"Dwarfs!? is a two-dimensional RTS developed by Power Of Two.\n\n###Gameplay\nThe players control a mining colony of dwarves, who dig for treasures. The players have to mine the resources and to protect the colony from environmental hazards, such as water and lava and different enemies.\n\nThe main objective of the game is to mine resources and find special caves. All of this earns the players gold, which can be spent for spawning new dwarves, upgrading the existing ones or build the town up.\n\nAt the beginning of the game, the players choose which difficulty setting to play on and set a time limit. The game ends if the time limit expires or the town gets destroyed.\n\n###Units\nThe game features two kinds of dwarves: warriors, and diggers.\n\nWarriors participate in combat, and their numbers are limited. It is possible to spawn more warriors by upgrading a Town Hall or an Outpost. The warriors can also be trained on the Outpost. While not in combat, they will roam around your town and patrol it. \n\nDiggers, on the other hand, spawn automatically at Town Halls and Outposts. While walking back and forth in the town, they generate resources. If a digger gets scared by a nearby combat situation, they can dig themselves. Sometimes this works against the diggers as they dig into the support walls the hold the water off.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Power of 2","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":44683,"name":"Rise of Industry","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ba/8ba023119cc83dff0d1d535f12e6b348.jpg","description":"Rise of Industry is a strategic tycoon game that puts you in the shoes of an early 20th-century industrialist. Build and manage your growing empire in a living, breathing, and procedurally generated world that is constantly evolving and adapting to your playstyle.\nAs a budding entrepreneur, you will build factories, construct efficient transport lines, move raw materials, produce finished goods, and arrange trade with the world's developing cities, providing them with the resources they need to flourish - for as they grow and prosper, so do you.\nDesigned with an eye towards both accessibility and depth, Rise of Industry has enough strategic complexity and replayability to satisfy the most experienced fans of the genre, while its simple-to-understand mechanics ensure that new players will love it as well.Features\nExperience tailored for every player - Specialise in just trading, production, gathering or any combination and research your way to bigger and better things.\nUse PR & Marketing to gain favour (or repair damage) with your business partners.\nChoose from over 100 individual products and manage the manufacturing process from harvesting raw materials all the way to delivering the end product to local stores & townspeople\nBuild and manage a solid transportation network to enable the efficient transfer of goods via plentiful trucks, speedy trains and high capacity airships.\nBe prepared for fierce competition – Advanced town and city A.I., make for an intelligent and changing game world so you won’t be the only one looking for the best deal.\nTown personalities – adapt a suitable approach for every town or face their economic backlash.\nHuge, procedurally generated maps mean that you’ll always have room to expand your empire into whether in testing scenarios or sandbox mode where imagination is your only limit.\nBe quick to adapt to the current business climate with contracts, random events and quests keeping you on your toes and cash flowing in.\nGo green or go home: pollution, disease and other industrial by-products will eventually await the non-conscientious tycoon.\nEver-changing biomes will present different environmental challenges as you aim to make the most out of the map - Lose potential oil reserves as polluted tundra melts into fields or fertile grassland wilts and dies into arid desert.\nReady for global domination? Bend and break your friends into economic submission in multiplayer-mode**multiplayer mode coming post release","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Dapper Penguin Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21175,"name":"Pixel Puzzles: Japan","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/25a/25a342d0017cd93fff3a0a6176e025b1.jpg","description":"Pixel Puzzles: Japan is an indie relaxing game developed by DL Softworks. It is a part of the Pixel Puzzles game series.\n\n###Gameplay\nIn Pixel Puzzles: Japan players will build various puzzles of pictures drawn in Japanese aesthetic. There is a certain degree of interactivity, as building puzzles relax the in-game monk, who will achieve higher consciousness levels. As you progress through the game, the monk will become more and more relaxed, which allows you to attempt to build even bigger puzzles.\n\nThere is no lose conditions whatsoever present in the game, as the game does not feature any time limits and it does not punish the players for putting a puzzle piece in a wrong way. However, unlike the real-life puzzles, the puzzle pieces in these game are not square and their form is actually procedurally generated making no playthrough the same. Some of the unarranged puzzle pieces move from time to time to help the players figure out where to put them.\n\nThere are 19 puzzles present in the game. Each of them is hand-drawn and has its own difficulty level. The game features puzzles in sizes from 60 to 350 pieces.\n\nAs the players build up the puzzles, traditional Japanese music will play in the background. The game features 26 Steam achievements, which are given to the players for completing for completing puzzles.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":22879,"name":"Warsow","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b3/6b36ee5fc04694742802d6bc00ac3ef6_ZwonMkK.jpg","description":"Warsow is set in a futuristic cartoonish world where rocketlauncher-wielding pigs and lasergun-carrying cyberpunks roam the streets. It is a completely free, fast-paced first-person shooter without hard graphical violence. Red stars instead of blood indicate hits and colored cubes replace guts as gib effects.\nSpeed and movement is what Warsow is all about. Like a true cyberathlete you jump, dash, dodge, and wall-jump your way through the game. Grab power-ups before your enemy does, plant a bomb before anyone sees you, and steal the enemy’s flag before they know what is going on!\nAn open source engine that gives you the freedom to make gameplay mods.\nPowerful e-sports features such as Warsow TV with OGG audio stream support for providing improved streaming capabilities.\nHighly customized graphics settings that allow flexibility for both competitive and casual play.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Chasseur De Bots","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5663,"name":"Star Wars: The Force Unleashed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/932/93221053809511fde4a0c6a9fddaf558.jpg","description":"The STAR WARS® saga continues in STAR WARS®: THE FORCE UNLEASHED™, a videogame developed by LucasArts, which casts players as Darth Vader’s “Secret Apprentice” and promises to unveil new revelations about the STAR WARS® galaxy. The expansive story is set during the largely unexplored era between STAR WARS: Episode III REVENGE OF THE SITH and STAR WARS: Episode IV A NEW HOPE.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"}]},{"id":2737,"name":"Shadowverse CCG","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca2/ca257e3481af0b2c8149d6600440aa85.jpeg","description":"\"One of my favorite games this year\" - IGN\nFrom the creators of mobile sensations Rage of Bahamut and Granblue Fantasy, Shadowverse features AAA artwork and unique game mechanics that make it the most visually and tactically rich CCG on the market.\n- BATTLE real–time opponents from around the world, or enjoy the fully voiced story mode\n- STRATEGIZE with innovative mechanics that guarantee epic battles\n- MASTER seven character classes each with unique play styles and killer cards\n- SUMMON 800+ cards, each lavishly illustrated with jaw–dropping fantasy art\nInstall now for TONS of free gifts and join our fun–loving community of over 1 million daily players!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cygames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":17376,"name":"Might & Magic: Heroes VI","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56f/56f1caa6bcd4bb33425d9ebb620c8845.jpg","description":"Might & Magic: Heroes VI is a turn-based strategy game developed by Black Hole Entertainment. It is the direct continuation of the Might & Magic game series.\n\n###Plot\nThe game takes place 400 years before the events of Heroes of Might and Magic V. \n\nMichael, a powerful archangel was revived. He sets out to capture Ashan covering it up as preparation to a demon invasion. The Archangel kills off his old enemies as he goes on, yet the human dynasty of Griffons is highly underestimated. A war breaks out, and humans win.\n\n15 years after the war, the fifth children that will be the protagonists of Might & Magic: Heroes VI are born. The Duke is killed, and the children set out on a quest to find out who possessed the mind of the killer.\n\n###Gameplay\nThe game's formula does not deteriorate much from the previous installments of the series. It still is a hero-oriented turn-based game. The players can join a faction, each of which has several heroes, different units that can be upgraded.\n\nThe players can buy property in the game. Every property will become a part of the player's own kingdom. Not only it is used for overviewing your possessions, but the kingdom is also known as the part of the map that the player has under their control. It is essential to keep an eye out on the wellbeing of your citizens, as each property produces items for your army and resources for progressing further into the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Black Hole Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":14391,"name":"Nuclear Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef3/ef39987b6340de4215f229852b832bdd.jpg","description":"Nuclear Dawn is a multiplayer first-person shooter developed by InterWave Studios. It was initially announced as a Source Engine mod but was later made as a separate game.\n\n###Plot\nWorld War 3 broke out on January, 22nd 2040. The war was fought with the devastating nuclear armament of the 20th century. Nanoviruses annihilated whole cities and machines roamed their streets. It is 2049, the war still continues, and those who survived are now parts of the Consortium or the Empire.\n\n###Gameplay\nThe players compete with each other in 16 versus 16 matches. There is one commander chosen in both of these teams. A commander places objective for their team on the map, places checkpoints, builds up defenses and supports their team by calling in a scout UAV.\n\nAll the other players are usual soldiers. There are four soldier classes available to the players with each class having its own purpose.\n\n###Classes\nAssaults serve as perfect middlemen, who are capable of everything but are not perfect in it. They can be seen carrying an AR, a grenade launcher or a DMR.\n\nExos are slow-moving but deadly. They can lock their exosuits down in place in order to drastically improve their accuracy. They're fond of chainguns.\n\nStealths are fast, agile, but have almost to none armor and ammo. They use SMGs and sniper rifles.\n\nSupports are a must on the battlefield. Although they are lightly armored, they can revive downed soldiers and do repairs. SMGs are their pick.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"InterWave Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":959,"name":"Lego City Undercover","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1fa/1fa173b8507cab48b755eebfabeb9930.jpg","description":"Join the Chase! In LEGO® CITY Undercover, play as Chase McCain, a police officer who's been tasked with going undercover to hunt down the notorious – and recently escaped – criminal Rex Fury and putting an end to his city-wide crime wave. With two player co-op, friends can explore the sprawling open-world metropolis that is LEGO® City, with more than 20 unique districts to investigate, car thieves to bust, hilarious movie references to discover, vehicles to drive, and hundreds of collectibles. LEGO CITY Undercover brings together witty, original storytelling with signature LEGO humor to create a fun-filled experience for players of all ages to enjoy.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"TT Fusion","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":246478,"name":"Fire Emblem: Three Houses","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/530/53081dbd5003f990fa5312404ac3d71a.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":59028,"name":"Regular Human Basketball","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/052/052ab18a578cac8d95e7ecbc8291e8ea.jpg","description":"Regular Human Basketball is the multiplayer party-starter that has your team wrestling to control your giant mechanical death machine. Yelling orders, flipping switches, and shootin' hoops in a post-apocalyptic basketball showdown.\nWork together to control the human.\nPlay a 1 on 1 match, or bring in friends to help out.\nInitiate your magnet to grab the ball, while a buddy rotates it all into position.\nInvade your opponents mech and disable their thrusters while they try to chase you out.\nOnline or Splitscreen Multiplayer for 2 or more ballers.\nAdd steam friends to your party to battle each other, and challenge other teams online. (*requires non-private steam community profile)\nSupport for a huge number of controllers for local play.\nCan you achieve harmonious dunking with 10 players all pressing buttons and yelling orders?\nState of the art basketball simulation\nSix titanic arenas to dunk in.\nAdvanced player face generator with all the latest parts, like LEFT_EYEBROW_42B!\nRealistic basketball commentary from real human commentators.\nA pumping 80s hip-hop soundtrack that’ll have you waving your arms in the air like you just don’t exhibit the human ability to care!\nLifelike physics simulates over 4 human emotions.\nPhysics in video games are always perfect, and this is no exception. Yelling, confusion and flipping upside-down will be things of the past, as you guide your human to the perfect dunk with pinpoint precision. No flailing, flopping and falling out only to be accidentally squished buy your well-meaning buddy here!\nMichael Jordan once called basketball \"The Sport of Kings\". That was shortly before someone accidentally turned off his magnet mid-dunk and he crashed to the floor upside down with legs flailing and boosters rotating the wrong way. Poor Michael, he sustained serious chassis damage.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Powerhoof","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2918,"name":"Volume","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/109/109846cf7518140bd962f77cdc14a880.jpg","description":"Volume is an indie stealth-action game developed by Mike Bithell Games.\n\n###Setting\nThe game is set in the same timeline as another game developed by Mike Bithell named Thomas Was Alone and takes place after the events of it. Volume's story is a modern take on the tale of Robin Hood. A thief named Robert steals a mysterious device called Volume that allows for the simulation of heists in order to attempt a military coup. Robert decides to stream the heists on the internet.\n\n###Gameplay\nThe game is heavily inspired by the Metal Gear Solid game series. The game pays its homage to the Japanese video game series even in its camera work as it closely resembles the same top-down third-person view angle. \n\nThere are 100 levels present in the game. The objective of each level is to unlock an exit point by collecting all the gems scattered across the level and get out of there as soon as possible without being spotted by the guards. The game offers a high rate of replayability as the performance of the player is evaluated and tracked on global leaderboards.\n\nThe players can't kill the guards, yet they unlock a vast arsenal of various gadgets that can be used to distract the guards further into the game.\n\nThe game comes bundled with a level editor which allows for the creation of your own missions. The players have to complete their levels before sharing them with the community.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bithell Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17830,"name":"Insanely Twisted Shadow Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cc/0cc6a55041978168782e99e1cf7887a0.jpg","description":"###Interesting mix\nThe game is a mixture of 2D shooter and puzzle genres developed by Shadow Planet Production and released by Microsoft Studios for its Xbox360 console. As part of the HumbleBundle pack, a soundtrack for the game is available, which was released separately. The game began to be developed in 2007. It took four years to build the first demo version for the Penny Arcade Expo. The action of the game is developed on a distant planet and includes the exploration of the game world, like the games of the Metroidvania series. The game was played by the famous artist Michel Gagné.\n\n###Key features\nThe game offers the player to solve two-dimensional puzzles, which are mixed with the active segments of the gameplay. The player can upgrade the ship, which he controls: it happens with the help of extraterrestrial technology. The main task is to save the home planet from destruction. The game is available on Steam. There are game modes that support up to 4 players, but you can not play in a basic coop. To do so on console one will need an online subscription to play over the net. The story of the game is rather short - the player will need approximately 4 hours to complete it.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Shadow Planet Productions","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":835,"name":"Volgarr the Viking","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/218/2184086b78ff972f35855d72a3f186d1.jpg","description":"Volgarr the Viking is a 2D action-platformer inspired by classic platformers such as Ghosts ‘n Goblins and Rastan. \n\n### Gameplay  \nThe game follows a Viking named Volgarr summoned by Odin to defeat an evil dragon. The gameplay shares many similarities with old-school side-scrollers.\nThe game consists of six main worlds and one secret level. Each of the world except the final one, divided into two part: an open area referred to as ‘level’ and a ‘temple’ with a boss on the end of it. On every stage, you have to go from the beginning to finish slaying monsters on your way and picking up treasures and power-ups. Volgarr has two weapons: throwing the spear and a sword. Throwing spear can be charged, and if it hits the wall, it serves as a platform that allows player achieve secret places. Additionally, Volgarr can pick up Mjolnir’s Blessing, a power-up that kills all non-boss enemies on the screen upon taking a hit. The hero has several different moves to fight the enemies and getting through platforming sequences such as jumping slash, crouching slash and down thrust. \nThe player can collect treasures scattered throughout the levels. Most of them only affect the player’s points. However, picking up particular Life Fires gives the player access to particular Valkyrie levels – alternate versions on game world with different layouts and more challenging enemies. The amount of Life Fires player collected affects the number of lives they have to beat Valkyrie level. Completing all of them in a single playthrough unlock a secret level Yggdrasill where Volgarr has to defeat the last boss in the game - Nidhogg.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Crazy Viking Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":62422,"name":"Imperator: Rome","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c1f/c1fd4088b7e221b5b12768868308a06b.jpg","description":"Alexander. Hannibal. Caesar. These great men and dozens like them shaped the destiny of a continent. Mighty kings, clever generals and would-be gods made their mark on the ancient Mediterranean. Around this sea, close knit nations tested their mettle and virtue against each other in fierce combat, their cultural and political legacy now inseparable from what we understand as Western Civilization. But nothing was guaranteed. Can you change the course of history in Imperator: Rome?\nImperator: Rome is the newest grand strategy title from Paradox Development Studio. Set in the tumultuous centuries from Alexander’s Successor Empires in the East to the foundation of the Roman Empire, Imperator: Rome invites you to relive the pageantry and challenges of empire building in the classical era. Manage your population, keep an eye out for treachery, and keep faith with your gods.Imperator: Rome’s features include:Character Management: A living world of characters with varying skills and traits that will change over time. They will lead your nation, govern your provinces and command your armies and fleets. We also introduce our new, more human-like character art.Diverse Populations: Citizens, freemen, tribesmen and slaves - each population with its own culture and religion. Whether they fill your armies, fill your coffers or fill your colonies, keep an eye on their happiness - your success depends on their satisfaction.Battle Tactics: Choose your approach before battle to counter the stratagems of your foes.Military Traditions: Each culture has a unique way of waging war. Romans and Celts have different options available to them. Unlock unique bonuses, abilities and units.Different Government Types: Manage the senate in a Republic, hold your court together in a monarchy, answer to the clans in a tribal system.Barbarians and Rebellions: Migrating barbarians may sack or settle your best land, while disloyal governors or generals can turn against you - taking their armies with them!Trade: Goods provide bonuses to their home province. Will you take advantage of stockpiles for local strength or trade excess goods to spread the wealth around?Provincial Improvement: Invest in buildings, roads and defences to make your kingdom stronger and richer.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":44277,"name":"Hand Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c5/3c50b128b2811eae9ed7b32956233f82.jpg","description":"Hand simulator is such a game in which you can control your hands. Your task is to learn how to\nwork by your fingers well, how to master the art of shooting and to try to become the fastest and\nthe sharpest shooter in the whole wild west.\nAt your disposal there are two training levels, where you can twist spinners, master chirography\nand plunge into the subtleties of handling weapons. After hard training you can take part in an\nonline duel, and find out how cool your skills are.\nFeatures:\n- Detailed mechanics of weapons. In order to make at least one shot, you have to work hard.\n- Multiplayer. Check your speed with the real opponent.\n- Achievements. Participating in online duels, earn a reputation as the best shooter.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"HFM Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":14166,"name":"DETOUR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cec/cecdb3d3d184693448eaf02918a34c64.jpg","description":"DETOUR is a real-time strategy game developed by Sandswept Studios. \n\n###Gameplay\nDETOUR is a competitive multiplayer game, that can either be played against AI or with three other players. The main objective of DETOUR is to get your trucks to your destination safely. The other players will prevent you from doing so by placing turrets, placing obstacles or destroying the roads.\n\nDETOUR has several elements of tower defense games. In order to get your truck to the finish, you will have to build new roads to avoid your opponents, use shops to distract their truck drivers, blow up rocks to build tunnels through the mountains and build up your offensive turrets to destroy the enemy trucks.\n\nThe players have a wide range of weapons at their disposal: air, land, and sea turrets, electromagnetic pulses, or the basic physics objects. There is still one condition present in the game - the players can't put any turrets too close to the enemy trucks, adding to the game's difficulty.\n\nShould the players start a solo game, five difficulty levels will be available to them. The game features a number of maps with different scenarios. How about a map, where there are four lines with each one of them belonging to a different player? How will you build your defense and offense? Who is going to take up all the available space first and deliver their cargo?","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Sandswept Studios","platforms":[{"id":0,"name":"PC"}]},{"id":350505,"name":"Tribes of Midgard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e71/e712a5b2e9fc0e7a7789baa42636af67.jpg","description":"Tribes of Midgard is a new cooperative survival game in which players must resist the oncoming invasion of Giants during Ragnarök. Set in procedurally generated worlds full of dark creatures, hidden gods and abundant materials to be uncovered, you play as a Viking living in a village that houses the Seed of Yggdrasil; the last bastion that protects the Gods from the other Realms.\r\nYou’ll need to explore the wilderness to craft new weapons and be prepared to defend the sacred center of your village from the grim shadows from Helheim that prey upon its power. All the while, a Giant of Jotunheim stalks ever closer to your village, seeking to destroy Midgard and fulfill the prophecy of the end of the world.FEATURES\r\n10 Player Co-Op Survival\r\nForm a tribe, from 1 to 10 players, and survive together as long as you can.\r\nExplore Procedural Lands\r\nDiscover procedurally generated worlds filled with secrets and surprises.\r\nCraft Legendary Equipment\r\nUse your gathered materials to forge new equipment and reinforce your village.\r\nDefend Your Home At Night\r\nWork together to stop the legions of Hel from invading your village at nightfall.\r\nFight Together In The Wild\r\nFace a variety of enemies while exploring the world and loot them for rewards.\r\nStop The Giants To Prevent Ragnarök\r\nEngage menacing Giants and defeat them before they destroy the Seed of Yggdrasil.COMMUNITY\r\nWe are constantly updating the game to make it better. If you wish to support Tribes of Midgard, be sure to join our newsletter for more information and our Discord to give us feedback. We are working hard to make the game available in Early Access in the upcoming months.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Norsfell","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":58811,"name":"The Sinking City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ceb/ceb68aef14fbe54f0610acd8de480f64.jpg","description":"The Sinking City is an adventure and investigation game set in an open world inspired by the universe of H.P. Lovecraft, the master of Horror. The half-submerged city of Oakmont is gripped by supernatural forces. You're a private investigator, and you have to uncover the truth of what has possessed the city… and the minds of its inhabitants.\r\nAn oppressive atmosphere and story inspired by the universe of H.P. Lovecraft.\r\nA vast open world that can be explored on foot, by boat, in a diving suit…\r\nHigh replay value thanks to an open investigation system: each case can be solved in a number of ways, with different possible endings depending on your actions.\r\nAn arsenal of weapons from the 1920s with which to take on nightmarish creatures.\r\nManage your mental health to untangle the truth behind the madness.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":3922,"name":"KILLER IS DEAD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/540/54027b1cc2caa3b5a1426cde0d6f60e9.jpg","description":"The action \" KILLER is DEAD” takes place in the near future. The world is very similar to the one in which we live but still different. The player controls an executioner named Mondo Zappa. His right hand wields a katana, and the left hand is wholly modified (it can be changed into various forms, including a gun and drill). His goal is to execute heinous criminals scattered all over the world.\n\nPlaying for Zappa, you will go through twelve story missions selected on the world map. They range from short linear levels to longer levels that require complete investigation. Some level areas also need the activation of interactive objects (e.g. switches) to move forward. During missions Mondo fights with challenging enemies, using a katana and cybernetic weapons. If you use your left hand, camera's angle changes view to the perspective over the shoulder.\n\nThere are three types of missions in the game: story missions (advance the narrative forward), submissions (they are set at the main missions where Mondo performs various tasks ranging from combat missions to quests), and\" Scarlet \" missions where the female Starlet support character issues combat missions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":36367,"name":"Stubbs the Zombie in Rebel Without a Pulse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a7/2a78d5a02588ba925d87d4c76c7f0802.jpg","description":"From the Executive Producer of Halo, comes Stubbs the Zombie in Rebel Without a Pulse. You play as Stubbs, an undead antihero who takes on a futuristic city using nothing but his own carcass and the weapons of his possessed enemies. This third-person action game uses the Halo engine and integrates tongue-in-cheek humor and a strong storyline with innovative combat.\r\nIn death, Stubbs has finally achieved the success and power he never had in life - and he sees no reason to stop until all of Punchbowl, Pennsylvania is his. Of course, billionaire playboy industrialist Andrew Monday has other ideas. The tension mounts until the city explodes in a full-scale human vs. zombie war.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox"}]},{"id":27944,"name":"Sine Mora EX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec2/ec2d4b29f9dd149918d91431a0f65a6e.jpg","description":"Sine Mora is a Latin expression meaning “without delay.” The setting of this shoot 'em up game is described as “style-inspired dieselpunk.”\n\n###Plot\nThere are two plots in the game, developing at different points in time.\n\nThe first story is about a father who avenges the Empire for his son. His son, a bomber pilot, was executed by the Empire because he refused to drop a nuclear bomb during the Enkies attack.\n\nThe second story is about the last survivors of the Enkie race, who also plan to take revenge on the Empire for the fact that the Empire destroyed them.\n\nBoth plots of the game often develop in the same locations, but the differences between the situation in these places are very significant, because the events of different plots occur at completely different times.\n\nEverything happens on the planet Seol, which is very hike to Earth. However, the crust of this planet is very unstable, and this is the cause of the constant earthquakes. The landscape of the planet is very variable, its geography changes significantly over very short periods of time.\n\nBy the time the game starts on the planet, two main factions compete: the aggressive Empire, ruled by the dictator, and the kingdom of Atarak, inhabited by the Enkie race.\n\nThe Enkie race follows the teachings of the great prophet Enkie and is able to manage time. They can carry themselves and any object at any time past or future.\n\nThe empire does not know how to manage time, but it is developing a machine that can do it. This machine will be able to accelerate the individual time of any object or living being, in order to bring it to the end of its existence, erasing, as soon as possible.\n\n###Gameplay\nThe player controls the aircraft, the main weapon of which can be upgraded. The main weapon can be used without limitation. There is also a secondary weapon. It is more powerful, but its use is limited.\n\nThe player's performance is estimated by the sum of the indicators: the destruction of enemies, the damage received, collected powerups (shielding, extra time, and upgraded weapon).\n\nDestruction of enemies with the primary weapon will increase the game's score multiplier, while use of the secondary weapon or time manipulation will reset the multiplier.\n\nThe game has four difficulties: normal, challenging, hard and insane.\n\nGame modes are: Story, Arcade, Score Attack, and Boss Training.\n\nInstead of health, a player’s state is measured by time. At the beginning of each level, the player receives a certain amount of time. This time can be reduced (accelerated) due to the actions of enemies, and the destruction of enemies, on the contrary, increases, stretches time.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":27230,"name":"Castlevania: Lords of Shadow - Mirror of Fate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db7/db7742ac820b7921635e85148be17663.jpg","description":"Trevor Belmont, a knight of the Brotherhood of Light sets out to avenge\nthe death of his mother, at the hands of his own father, who has now\nreturned from years of exile to take up residence in a mysterious\ncastle. What was once Gabriel Belmont now stands a powerful vampire\ncalled Dracula. Dracula has declared war upon the Brotherhood and thus\nthe scene is set for a cataclysmic showdown between Father and Son!\n\nFeatures\n\n• Discover the history of your bloodline - Play as multiple characters\nthroughout history, as you battle your ancestor Dracula, each time\nlearning more about your history and why the Belmont clan must atone for\nthe sins of their forebear. Dare you tempt fate?\n• Choose your\ncharacter – Multiple characters to enjoy, each with unique abilities and\nskills across different eras. Take control of the legendary Trevor and\nSimon Belmont and more, as you battle Dracula and his evil minions.\n•\nShare new abilities through your lineage - Pass onto your descendants\nyour newfound abilities in each era and discover the true destiny of the\nBelmont's. Featuring a huge array of combo’s and a deep strategic combat\nsystem, this Castlevania is an exciting action game with tons of depth.\n•\nBattle massive bosses – Experience titan fights in full 3D, climb,\ntraverse and overcome huge bosses. Use your secondary weapons and\nmagical abilities to take down these awesome foes.\n• Features\nunrivaled Nintendo 3DS Visuals – Experience super high resolution and\ndetailed 3D polygon graphics with side scrolling areas and full 3D\nsections combined.\n• Utilize Focus & Magic – Use magic to turn the\ntide of battle! Kill enemies to gain experience and buy new combos and\nabilities using your travel book. Play well and you will be rewarded.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":16761,"name":"Stick it to The Man!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa5614030bcda5f7eb5403c681aec7a6.jpg","description":"Meet Ray, he lives in a world where everything is made out of paper and stickers. One day he has an accident and wakes up with a giant pink spaghetti arm sticking out of his brain. This gives him awesome powers and he can suddenly change the world around him by folding it, tearing it, pulling stickers off and sticking them elsewhere! And if that weren't enough, Ray can also read peoples minds! Digging into the brains of his fellow citizens, Ray can hear their thoughts and use that to his advantage. Unfortunately, Ray doesn't have much time to get to grips with his new abilities. He is framed by ‘The Man’ with a crime he didn’t commit, and is on the run. Can you help to get Ray out of this sticky situation? Get ready to tear it, rip it and Stick it to the Man!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zoink!","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Web"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":817,"name":"Slain: Back from Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b22/b22fd6e7dc6fc22118439c9d8fd810c3.jpg","description":"Slain: Back from Hell\nYou control the fate of Bathoryn, a doomed hero in a Gothic world, who seeks to liberate six cursed realms from six deadly overlords.\nHe must battle his way through this blighted land, packed with gruesome pixel art foes before ascending (or sometimes descending) into a stronghold, all the while defeating fiendish traps and vile monsters alike.\nAt the heart of every domain Bathoryn will confront a mighty foe - defeat it and his quest continues to its ultimate destiny. Fail, and you’ll die gruesomely – mauled by werewolves, disintegrated by floating monstrosities, squashed by great weights or torn apart by hidden blades. And you will fail…\nThere are 3 key areas to be mastered in order to vanquish Slain: Back from Hell.\n- Learn to wield 3 deadly elemental weapons, each one exploiting weaknesses in different enemy types. Each has a different combo, timing and use. Mastering quick switching between weapons is the path to victory!\n- Glean the placement and timings of enemies and booby traps.\n- Generate, conserve and unleash your Mana wisely.\nAccompanied by the heavy metal visuals is an even heavier metal soundtrack recorded by Curt Victor Bryant (formally of Celtic Frost).\nFeatures\nChallenging ‘elemental’- based melee and magical combat\n6 hours of bone-crushing, metal-fueled mayhem & gore\nChoose from 3 unique weapons in your fight against the demon hordes.\nFull soundtrack recorded by Curt Victor Bryant formally of Celtic Frost. \\m/\nCunningly concealed secrets (shhh).\nBoss fights, mini-boss fights, sub-mini- boss fights & macro-sub- mini-boss fights.\nNo laborious levelling, no tedious grinding, no wimpy crafting!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":15294,"name":"The Void","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a0/7a0b4801b4ec1a8ed03cf07cfedcaa77.jpg","description":"The Void is a game about supernatural adventures in a grotesque world. The game was also released under the names Turgor (the original Russian title) and Tension.\n\n###Plot\nThe main protagonist of the story is dead. His soul is trapped in the Void, a world beyond life and death that serves as a sort of Purgatory. Two factions inhabit the Void: the monstrous Brothers and the lovely Sisters. They live in the world almost devoid of color. The Color exists in this world as a liquefied substance that is very valuable. The protagonist wants to leave the Void and return to the world of the living. To achieve it, he has to infiltrate the faction of Brothers that consist of deformed, disabled men. Whether they will be hostile or friendly depends on the player's actions.\n\n###Gameplay\nThe player navigates the main character from the first person view. The main goal is to gather Color, which in The Void stands in for all traditional types for video games resources. The protagonist needs Color to restore health, recharge weapons, and increase experience. To obtain Color, the player has to gather Lymph and then process it through the many hearts of the protagonist. As the Color fills the hearts, it influences gameplay in various ways, including the character's interactions with the NPCs.\n\n###Style\nLike most of the Ice-Pick Lodge games, The Void features a grotesque and surreal visual style. It is set in a gloomy grey world full of fog, ruins, and deformed creatures. The Void is set to the dark ambient music.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ice-Pick Lodge","platforms":[{"id":0,"name":"PC"}]},{"id":16223,"name":"Hack 'n' Slash","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfb/cfbacead71a46900fd2f90f01785ac43.jpg","description":"Hack 'n' Slash is a top-down action game created by Double Fine Productions. \n\n###Plot\nThe head wizard of the village where Alice lives in mandates everyone to stay inside their homes, the village's armory begins to make weapons that nobody is allowed to carry and the people who try to figure out what is going out get killed. You do not buy that these laws were made for your protection. Alice gets out of her house and goes on to unravel the mystery.\n\n###Gameplay\nHack 'n' Slash takes the word Hack seriously, as the players can literally hack the game's world using their USB Sword. The players use the sword to defeat the enemies met in dungeons or the village. The sword can also be used to interact with any in-game object that has a USB port. Sometime later into the game, the players can alter the behavior of their enemies by using the sword.\n\nThe main protagonist also gets a hold of the Third Eye Hat (an homage to internet slang), which is used to access a debugging console. This console was used by Double Fine themselves. It allows the players to peek into the containers, or examine the code to figure out what they have to do next. The players can even adjust the in-game clock which affects the flow of the game's time. \n\nA character progression system is present in the game as the players can find books on various aspects of the game, which later allows the players to hack more and more in-game objects.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14784,"name":"Blades of Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fb/3fbe3c1d67fdda2685b0f49e06813038.jpg","description":"Blades of Time is an action-adventure hack-and-slash, a spiritual successor to 2007 game X-Blades.  \n\n###Plot \nThe game follows Ayumi, a treasure huntress and the master of gun and sword. One day she and her partner Zero get stuck in an alternate universe known as Dragonland filled with treasures and secrets. Know she must find her missing pal and escape the Dragonland.  \n\n###Gameplay \nThe gameplay mostly consists of fighting enemies and solving puzzles. The player can use Ayumi’s twin swords and rifle as well as different skills and magical abilities. The hero’s primal moveset consists of the sword attack, kick, tossing enemies in the air, jumping, shooting and dashing. The player can also perform finishes on weakened enemies, resulting in their instant death. The most notable mechanics in the game is Ayumi’s ability to rewind time. Activating it allows the player to set some actions after that is performed by Ayumi’s another-timeline clone. It is useful in both combat and puzzle-solving. Defeating enemies gives you souls that can later be exchanged for new skills and magic spells. Through the game, Ayumi travel through different locations, some of which can alter certain game mechanics. For example, while in the desert you should stay in the shadows as long as you can because the sun is too warm.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Gaijin Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"}]},{"id":616679,"name":"Trek to Yomi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc5/bc53067cffecb71129fcb0b4fbf0e922.jpg","description":"As a vow to his dying Master, the young swordsman Hiroki is sworn to protect his town and the people he loves against all threats. Faced with tragedy and bound to duty, the lone samurai must voyage beyond life and death to confront himself and decide his path forward.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":17424,"name":"Time Clickers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/796/796e9bb16fad9a7676867db97759027f.jpg","description":"Your mission starts now!\nCollect gold, upgrade your Click Pistol & hire a team of elite sharp-shoooters to help with defeating the enemies in this clicker idle game. Not a fan of micro-transactions? Then this is the perfect game for you, since it has no micro-transactions or hidden fees.\nJoin TimeGamers.com to share saves between Steam, web browser, Android and iOS, be part of our live leaderboard and access extra stats!\nControls: Mouse & Left Click\nQuick Team Upgrade Keys: A, S, D, F, G\nQuick Active Abilities Keys: 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, SPACE\n1. Destroy cubes to collect gold.\n2. Spend gold to upgrade your weapons.\n3. Time Cubes appear at wave 100.\n4. Spend Time Cubes on Artifacts.\n5. Your team earns gold even when you're offline.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Proton Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9963,"name":"Wuppo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b86/b86fffe4f3fd00af3c7ee5533bb7c060.jpg","description":"After losing its home, one lonely Wum must travel the length and width of the world to find a new place to live. From the metropolitan haven Popocity to the cavernous Bliekopolis, our Wum will discover magical places and encounter strange creatures. But this Wum is no traditional hero and only by using wit and charm can it succeed in this massive journey.\nWuppo is a two man passion project, with hand-drawn visuals, an extensive soundtrack and a huge world to explore.\nFEATURESExplore a wondrous world filled with Wums, Fnakkers and other strange creatures.\nResolve an ancient conflict on your quest for a new home.\nUse items and social skills to overcome diverse challenges.\nFight numerous enemies, ranging from small, to big, to MASSIVE!\nCollect filmstrips to discover the world's detailed history.\nEnjoy an enchanting and memorable orchestrated soundtrack.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SOEDESCO Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":53478,"name":"Silent Hill","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/15d/15db2360d1130ba8c10573586588b0bd.jpg","description":"Silent Hill is a survival horror video game for the PlayStation published by Konami and developed by Team Silent, a group in Konami Computer Entertainment Tokyo. The first installment in the Silent Hill series, the game was released in North America in January 1999, and in Japan and Europe later that year. Silent Hill uses a third-person view, with real-time rendering of 3D environments. To mitigate limitations of the console hardware, developers liberally used fog and darkness to muddle the graphics. Unlike earlier survival horror games that focused on protagonists with combat training, the player character of Silent Hill is an \"everyman\".\nThe game follows Harry Mason as he searches for his missing adopted daughter in the eponymous fictional American town of Silent Hill; stumbling upon a cult conducting a ritual to revive a deity it worships, he discovers her true origin. Five game endings are possible, depending on actions taken by the player, including one joke ending.\nSilent Hill received positive reviews from critics on its release and was commercially successful. It is considered a defining title in the survival horror genre, and is also considered by many to be one of the greatest video games ever made, moving away from B movie horror elements, toward a psychological style of horror emphasizing atmosphere. Various adaptations of Silent Hill have been released, including a 2001 visual novel, the 2006 feature film Silent Hill, and a 2009 reimagining of the game, titled Silent Hill: Shattered Memories. The game was followed by Silent Hill 2 in 2001.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Team Silent","platforms":[{"id":0,"name":"PlayStation"}]},{"id":52383,"name":"The Banner Saga 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d10/d1079ef92c414ca95e7b54ccec4d8a37.jpg","description":"Banner Saga 3 is the epic conclusion to a sweeping viking saga six years in the making. This strategic RPG, acclaimed for its strong story and compelling characters has won over 20 awards and been nominated for 4 BAFTA awards. \n\nAs the world crumbles around you, how will you survive when the Darkness draws near, and who will you trust with the fate of the world?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Versus Evil","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":22098,"name":"Scanner Sombre","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbd/dbdd6258866ad13ecf1709fbc3db165f_6vjwQ3o.jpg","description":"Regaining consciousness you smell the damp.  Opening your eyes you see the stone walls of the chamber flickering by the light of the fire; you stumble to your feet and kick a helmet clattering across the floor.  Slowly the ache in your head begins to subside and you notice the beginnings of a passage.  After a few steps the darkness consumes you.  Returning to the safely of the fire you see a LIDAR scanner on the floor - a trigger press results in a faint glow coming from inside the helmet.  You put the helmet on, adjust the beam-width and proceed into the abyss….\nInspired by Gone Home and Dear Esther, Scanner Sombre is a cave exploration experience.  With stunning visuals and a terrifying theme, it is the 6th major video game released by Introversion Software - creators of the million selling, BAFTA award winning Prison Architect as well as Uplink, Darwinia, DEFCON and Multiwinia.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Introversion Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17462,"name":"EARTH DEFENSE FORCE 4.1 The Shadow of New Despair","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ef/6ef42db1fe8a42ab707a9fa1b86a585a.jpg","description":"The phenomenon that \"Armor value\" or \"Acquisition of weapons\" of save data is tampered when playing online multi play with specific playersWe deeply apologize for any inconvenience this time.\nWe have got some reports about the title above.\nWe investigated about it and verified the same phenomenon.\nWhen we played online multi play with specific players who are called cheaters and tamper their game data, our save data became aberrant by obtaining tampered items after the mission.\nWe will keep investigating about malicious data tampering, but for now, once your save data is tampered, it is impossible to get your data back again.\nWe would appreciate for your understanding.\nAs a workaround for customers, since this phenomenon is caused by playing online play with cheaters and completing missions, if you find any cheaters or players who are suspected as cheaters in the online room, we deeply recommend you to leave the room as soon as possible without launching the mission.\nIn addition, if you find any cheaters or players who are suspected as cheaters during the mission, we also recommend you to leave the mission before you complete it.\nAbout the GameIt's a fight for the future of the planet between the Ravagers, a merciless swarm of alien invaders, and the Earth Defense Force (EDF) in this third-person shooter.\nAs an EDF soldier you will go head to head in fierce combat against the hordes of giant alien insects and their slaughtering machines.\nPlay as four different classes in over 80 missions with a range of 800 weapons at your disposal.\nThe most overwhelmingly numerous forces of Ravagers the series has ever seen will take the EDF fighters to the depths of despair and back!\nOnline co-op play supported.\nWeb\nhttp://www.d3p.co.jp/edf4.1_pc/\nTRAILER 【EDF News】\nhttps://www.youtube.com/watch?v=NxYv9cvvM9U\nhttps://www.youtube.com/watch?v=bE1eff1xvLg\nhttps://www.youtube.com/watch?v=JmjnVI5mJo8","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"XSEED Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":10829,"name":"Agents of Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4cb/4cba4ae8fb6f8ddd23e24702c756fa02.jpg","description":"Agents of MAYHEM is the latest open-world, third-person action game from the creators of the Saints Row franchise!\nIn Agents of MAYHEM, you run a no-holds barred operation against a shadowy super-villain organization known only as LEGION and their mysterious leader, the Morningstar.\nFollowing the global attacks on Devil’s Night, cities of the world are held by the LEGION’s Ministries, bands of powerful villains named for the Seven Deadly Sins.\nSeoul is the personal domain of LEGION’s mad scientists, the Ministry of Pride – Doctor Babylon and his rogue’s gallery of supporting villains.\n\nYou play as a variety of Super Agents – each with their own distinct look, personality, weapons, and skills. Explore the city of Seoul to rout out LEGION operatives and their vile plans to take over the world.\nMAYHEM’s Agents have a license to do what the hell they want, so long as they do whatever it takes to grow the agency and ultimately defeat LEGION.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":13172,"name":"The Gardens Between","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/af8/af81c1cc5aad59f0ce1b3b7cee207220.jpg","description":"The Gardens Between is a surreal puzzle adventure that follows best friends, Arina and Frendt, as they fall into a mysterious world of beautiful garden islands. The player can traverse back and forwards in time to discover each garden’s secrets and, along the way, reveal a story about friendship, childhood and growing up.\nReceptionThe Gardens Between has been described as “The Simplest Deep Game Possible” (hardcoregamer.com, 2017).\nIt has been selected and featured in several games festivals, awards and exhibitions across the world including Indie MEGABOOTH (PAX East), Out of Index, ACMI and BIC Fest.\nArt & MusicExperience the Breathtaking Art & Music of The Gardens Between with our Album Length 'Ambient Slow Trailer' at http://relax.thegardensbetween.comAbout the Voxel AgentsThe Voxels Agents create delightful games that unravel in surprising ways. Headquartered in Melbourne, the studio was founded in 2009 by Simon Joslin, Matthew Clark and Tom Killen to create games that kindle curiosity with a passion for highly focused gameplay.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"The Voxel Agents","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":545028,"name":"Brigador: Up-Armored Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fd/2fd795038776b825c8db01c999ce7f2d.jpg","description":"Brigador is an isometric real-time tactical game from independent studio Stellar Jockeys, released on October 16, 2015 on early access. It officially left early access on June 2, 2016. The game has been compared to the Syndicate and MechWarrior series.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stellar Jockeys","platforms":[{"id":0,"name":"PC"}]},{"id":17777,"name":"Anno 2070","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ae/9ae37c55143614798f919ce8e8eb94aa.jpg","description":"This is the fifth game in a series of Anno games.\n\nThe game genre remains unchanged - this is a real-time strategy with a variety of elements from other genres included in it: from the city construction and management simulator to submarine battles.\n\n###Time, situation, character\nThe game takes place in 2070, when the ecological situation in the world has become so serious that it cannot be completely ignored and the attitude to the environment becomes a key point in the development of corporations, on whose activity the well-being of humanity is based.\n\nThe game has implemented some of the gloomiest predictions about global warming: the world ocean level has risen so much that the continents have gone under water, and people have only to swim between the remaining islets on huge floating ark cities.\n\nYou control the captain of such an ark - and this means that you will have to explore, discover and colonize islands, build trade routes, build cities, meet the needs of the population, mine and mine food, build all kinds of enterprises, mines and fleets.\n\n###Gameplay\nThe entire Anno series is characterized by a general scheme - the player has to develop unpopulated but resource-rich territories, adjusting their economies, and then move on in search of new undeveloped territories.\n\nIn the Anno 2070 there is the same scheme, but its concrete implementation this time focuses on maintaining the ecological balance during colonization.\n\nVarious approaches to this problem embody the main actors in the game:\n- the classic industrial tycoons from the Global Trust Corporation - rely on coal and nuclear power plants\n- the environmentally-minded governing bodies of the Eden Initiative Corporation - these people rely more on renewable energy sources, wind energy or falling water.\n\nThe magnates, if you go their way, provide a more rapid development, but the population is dissatisfied with the deterioration of living conditions.\n\nEnvironmentalists are developing more slowly, but the situation becomes softer.\n\nBut not everything is so primitive - both the magnates and the environmentalists have no ready answers to all the questions. Environmentalists also have to deal with environmental pollution, and the magnates, if they wish, can build waste treatment plants and make their strategies more acceptable.\n\nIn addition, the game has a third force - scientists who can significantly change the balance of forces with their technologies.\n\nIt is technologies, a powerful factor that can change a lot, became the second significant difference in the game setting after the need to preserve the ecological balance during colonization.\n\nIn addition to these three main factions, there are many other actors in the game: pirates, free traders, mercenaries, an oil baron named Sukhov, a Japanese oceanographer and others. You can interact with all of them - trade, negotiate, ask for help, carry out their tasks, receiving scarce licenses for the purchase of technologies as a reward.\n\n###Multiplayer\n\nMultiplayer mode allows you to bring into the game a lot of interaction in social networks. Players can form alliances, choose each other in the Senate, and then vote in the Senate for certain laws.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"}]}]