[{"id":13027,"name":"Battlepaths","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f04/f0483d4fffa385854d4eefb2af3de8b8.jpg","description":"Battlepaths is a loot-centric and addictive 2D-RPG featuring neat monster hacking, an excellent loot system and a huge variety of character development. Learn skills, use powerfull potions, and hunt down the Chaos Overlord. The battle begins in Babatula, the first of three big realms to explore.\nBattlepaths offers a sophisticated drop system that generates countless different items along with more than 50 unique items. The character customization allows you to create a unique hero with its own strengths and weaknesses. You can build a heavy, damage dealing tank, a deadly ninja that utilizes high speed and agility to attack his victims from out of nowhere, a true master of mind who crushes his foes with powerful combinations of special abilities, or something in between.\nYou can choose to play in different realms that each have their own landscape and their own set of creatures. The many superior items you will find can be exchanged between different characters, one of which will eventually become the first powerful enough to face the Chaos Overlord.\nPrepare yourself for Battlepaths!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Key17 Games","platforms":[{"id":0,"name":"PC"}]},{"id":3857,"name":"Velocity Ultra","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a06552772363af7e02b6486fb5f86c1.jpg","description":"Velocity®Ultra is an award-winning top down shooter that puts you in control of the galaxy’s only Quarp Jet, an advanced spacecraft with the ability to teleport at will. Tasked with rescuing survivors from a collapsed black hole, you’ll need to use both firepower and quick-wits to catapult the Quarp Jet through 50 levels of sci-fi action.\nFeaturing explosive visual effects, an anime-inspired art style and an exhilarating electronic soundtrack, Velocity Ultra combines the speed, ferocity and challenge of classical arcade shooters while introducing a whole new layer of complexity to the genre with unique puzzle mechanics.Key FeaturesFly the most advanced spacecraft in the galaxy through 50 challenging levels.Solve devious puzzles and outsmart enemies using a range of space-shifting controls.Full Steamworks integration including over 30 achievements and a full collection of Steam Trading Cards.Online leaderboards and a pitch-perfect ranking system for every level.Fully configurable keyboard controls and full gamepad support.Bonus missions and a range of hidden mini-games to discover as you play.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Curve Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":364812,"name":"Rock of Ages 3: Make & Break","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba7/ba7e84d59dbdb2fab5b2c1368e3bdfa5.jpg","description":"Make your own Levels. Break everyone else's.\nRock of Ages 3: Make & Break is competitive tower defense and arcade action rolled up with ACE Team's quirky, Monty Python-esque humor into one giant, creative game for the ages!\n\nJump into the expansive, gut-busting story for an eclectic adventure featuring bizarre and irreverent takes on legendary characters, or for the first time, create and share your own levels to compete with friends and strangers online in a real-time mix of hectic tower defense and epic boulder-racing arcade action.\nMake & Break Worlds\nDesign and build your own levels in the easy-to-use editor and share your creations with players from all over the world for nearly limitless creative fun!\nCompetitive Tower Defense\nBuild defenses and race to destroy your opponents’ in up to 4-player online multiplayer, or head-to-head in 2-player split-screen action.\n\n\nBoulder-Smashing Arcade Action\nCrash your way through everything in your path as fast as you can in six distinct and arcadey game modes with over 20 zany boulders!\n\n\nAbsurdly Funny\nTake a ride on the wild side with ACE Team's hilarious story – everyone from Caesar and Moctezuma to Krampus and the Flying Spaghetti Monster make an appearance in an expansive campaign across history and beyond.\n\n\nGame Modes Galore\nDefend your base in the new Boulder Avalanche, perfect your rolling skills in the fragile Humpty-Dumpty Mode, race the clock in Time Trials, or create your own unique gameplay with the creator for hundreds of hours of fun!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ACE Team","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":61536,"name":"CHRONO TRIGGER (HD)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd1/cd1dedeafe91fa1d9034dba0c3dcb1f7.jpg","description":"The timeless RPG classic returns loaded with upgrades! Journey to the forgotten past, to the far future, and to the end of time. A big adventure to save the planet, now begins…\nCHRONO TRIGGER is the timeless role-playing classic developed by the ‘Dream Team’ of DRAGON QUEST creator Yuji Horii, Dragon Ball creator Akira Toriyama, and the creators of FINAL FANTASY. As the story unfolds, embark on a journey to different eras: the present, the middle ages, the future, prehistory, and ancient times! Whether you're a first-time player or a longtime fan, this epic quest to save a planet's future promises hours of enthralling adventure!\nAs the definitive version of CHRONO TRIGGER, not only have the controls been updated, the graphics and sound have also been revamped to make your adventure even more fun and enjoyable to play. To complete your journey, also included is the mysterious ‘Dimensional Vortex’ dungeon and the forgotten ‘Lost Sanctum’ dungeon. Meet the challenges presented to you and long-lost secrets may be revealed...\nStory:\nA chance encounter amid the festivities of Guardia's Millennial Fair in Leene Square introduces our young hero, Crono, to a girl by the name of Marle. Deciding to explore the fair together, the two soon find themselves at an exhibition of the Telepod, the latest invention by Crono's longtime friend Lucca. Marle, fearless and brimming with curiosity, volunteers to assist in a demonstration. An unanticipated malfunction, however, sends her hurtling through a rift in the dimensions. Taking hold of the girl's pendant, Crono bravely follows in pursuit. But the world into which he emerges is the one of four centuries before. Journey to the forgotten past, the distant future, and even to the very End of Time. The epic quest to save a planet's future makes history once again.\nKEY FEATURES:\nActive Time Battle Version 2\nDuring battle, time will not stop, and you can enter commands when the character's gauge is full. The enemies' positions will change as time passes, so choose your actions based on any given situation.\n‘Tech’ moves and combos\nDuring battle, you can unleash special ‘Tech’ moves, including abilities and/or magic and characters can combine these abilities to unleash all new combo attacks which are unique to them. There are over 50 different types of combos that you can execute between two and three characters!\nExperience the 'Dimensional Vortex' and the 'Lost Sanctum' dungeons\nThe Dimensional Vortex: a mysterious, ever-changing dungeon existing outside of space and time. What wonders await you at its center?\nThe Lost Sanctum: enigmatic gates in prehistoric and medieval times will lead you to these forgotten chambers. Meet the challenges presented to you and long-lost secrets may be revealed...\nGraphics and sound\nWhile keeping the atmosphere of the original, the graphics have been updated in higher resolution. As for the sound and music, under the supervision of composer Yasunori Mitsuda, all songs have been updated for an even more immersive gameplay experience.\nComfortable controls\nWhether you play with a gamepad or a keyboard, the controls have been updated for a more pleasant gameplay experience.\nAutosave\nIn addition to saving at a save point or choosing to quit from the menu, your progress is saved automatically while traversing the map.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Square Enix","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":20302,"name":"Guns and Robots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/670/67024fb5e5f19777c9cb3f9e5bf8b0c4.jpg","description":"Guns and Robots is free to play online third person shooter. The game brings robot action with massive customization. Players get cartoony bright 3D graphics in attractive environments and challenge each other in open arenas. Guns and Robots gives fun, entertaining experience with easy to master gameplay and numerous options to experiment robot constructing skills.BUILD YOUR ROBOT. CUSTOMIZE IT. DOMINATE THE ARENAS!\nWe are very excited to give gamers around the world the ability to enjoy the game that the community participated in creating! We would like to thank all for your support and most importantly, we are dedicated to adding more content and bring to you exciting new features, so join our Forums at http://forum.play-gar.com and be a part of Guns and Robots community!FEATURED DLC\nPurchase the Steam Starter Pack of Guns and Robots and blast your way through your enemies with:\n• 1000 Sparks\n• 150 Upgrade Components\nGuns and Robots Starter Pack is ideal for new robot-fighters who are looking to get a quick start in the action. This is special new player offer to get your hands on cool artillery, equipment and upgrades. In this pack you will get all upgradable component options:\n30 upgrade head components,\n30 upgrade weapon components,\n30 upgrade device components,\n30 upgrade body components,\n30 upgrade chassis components,KEY FEATURES\nMassive customization. In Guns and Robots, the robots come in three module classes based on players' assembly and unlimited options for character customization. Pinpoint enemies with multiple weapons simultaneously.Wide variety of potential combinations per weapon allow players to fine—tune their arsenal according to their game play preferences.Enjoyable and extremely funny online arenas where players literally blast their way through.Adrenaline-pumping game play. Different maps add fine mixture of thrill, speed and action to the game play.Dynamic combat experience.Players can choose to line up for high-level real-time combat.Player Guilds. Players can join, create guilds and benefit from numerous guild features.Achievements. Variety of achievements for the players with exceptional performance.AVAILABLE GAME MODES:\nCapture the Batteries (Capture the Flag)Team Deathmatch Bomb Squad (Destroy the Enemy Base)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Masthead Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19080,"name":"Unforgiving Trials: The Darkest Crusade","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edb/edb167b3cea231167cd2039d29dac2a0.jpg","description":"Update AnnouncementHello Adventurers,\nwe are grateful for all the feedback we have received so far. Some issues regarding game balance, spelling mistakes and minor bugs will be addressed and fixed immediately in an upcoming patch in the next couple of days.\nIn the much bigger upcoming 1.1 patch we would like to add more story and out of combat related content, in order to make the game more diverse. If we find any more issues we will do our best to fix them in order to provide the best possible experience while playing our game.\nThank you for all the support,\nTeam Amaterasu\nAbout the GameThe land is Cursed. Dark horrors have conquered the kingdom of men. Countless brave adventurers have attempted to cleanse this evil. None have returned...\nA nobleman enters the inn seeking adventurers to join him on his holy quest. Once again a small fellowship departs on it's quest to vanquish the evil that torments the land. Now the fate of the kingdom rests upon the shoulders of one brave party. A heavy burden weighs upon their souls, for now they have to face the Unforgiving Trials.STORY\nEvery 20 years Corruption spreads across the lands inflicting terror and fear in the hearts of villagers. No one knows the reason for this calamity except the old King who perished when the hordes swarmed the Capital city. Many tried to reach the king in attempt to gain any knowledge or insight to fight the curse. Yet it all proved futile as no one ever returned to tell the tale. The story begins in a bustling inn along the road that leads east towards the Capital. A mysterious young lord ventures forth only with his most trusted guardian and a pouch full of coins. It is up to him to recruit a party of the very best adventurers: knights, wizards, thieves and oddballs. Recruit whoever it takes to reach the old King and reclaim the lands of man. While your quest seems straightforward it is certainly not an easy task as vile beasts and threatening monstrosities lurk the realm, ready to strike you down at the first sign of weakness.GAMEPLAY\nEmbark on an epic adventure to save the lands. Form a party by selecting 4 different adventurers from a pool of over 12 unique classes. Battle your way through the cursed lands scaling the highest mountains and exploring the darkest dungeons. Face more than 30 unique challenging bosses in order to reach the capital of the kingdom. Trade and interact with other travelers, influence their fate and discover many secrets on your dark adventure.FEATURES Fast paced Active Turn Battles\nMore than 12 characters with their unique classes\nCustomizable leveling system offering different builds and playstyles\nOver 200 spells and abilities to master\n30+ overpowered bosses\nAnimal companions\nExplorable populated villages with traders and other adventurers\nExtremely challenging and strategic encounters\nUpcoming content updates with new characters, skills and moreAMATERASU SOFTWARE\nWe are a team of four video game enthusiasts with a childhood dream of making our own video games witch laid dormant till now. Every member of our team is a fan of old school JRPG genre. It's our dream to revitalize its turn based battle system witch is shunned more and more every year in favor of more action oriented combat. For this reason we decided that our first project will be battle oriented JRPG in order to reignite the passion of old school turn based combat.\nWe are grateful for all the support and are looking for your feedback on what kind of additional content (classes, spells, characters) you want us to add in the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":966349,"name":"We Were Here Expeditions: The FriendShip","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/123/1234ba5e5cfe5c2165fe9bbc814db664.jpg","description":"Free to claim until October 13, and it’s Forever yours!Put your Communication, Teamwork, and Trust in your friendship to the test! Claim We Were Here Expeditions: The FriendShip until October 13th 2023 for FREE!\nAbout the GameThink you and your bestie can take on any challenge together? We’d like to see you try! This new bite-sized standalone We Were Here experience will really put your friendship to the test. To prove that your friendship can overcome anything, you will need to take on several puzzling challenges.\nIt’s all about Communication, Teamwork… and Trust. Talk together, work together, and most of all, believe in your friend.\nThe two of you are alone at sea when pursuing a distress call leads you to a deserted island, where you encounter a mysterious boat ride in an abandoned amusement park. This is a voyage you won’t forget, with puzzles that take two to solve. The state of your friendship will directly affect the state of your friend-ship!\nWe Were Here Expeditions: The FriendShip has a free boarding ticket until October 13.\nBe aware, this is an actual test as you’ll be graded on how well you solve these puzzles! Will friendship truly last forever? Or is this friend-ship sinking to the bottom of the ocean?\nWe Were Here ‘Expedition’ SeriesFrom the makers of the renowned We Were Here Series comes the bite-sized We Were Here Expeditions! The perfect chance for new Explorers to get a taste of our flavour of co-op puzzle fun - while longtime fans can try to achieve the perfect score. Everything's better together with a friend, and crossplay is supported so if your friends use a different platform you can still board the friend-ship!\nPlaying with your friend and communicating well is key to the series: asymmetrical puzzles give players different perspectives and can only be solved together. But don’t worry, your walkie-talkies will let you keep in touch. Over and out!\nNOTE: This game is co-op only. It requires both players to have a working PC-compatible microphone and an internet connection.\nhttps://store.steampowered.com/app/1341290/We_Were_Here_Forever/","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Total Mayhem Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":58818,"name":"Tetris Effect","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59d/59d568770eecc7b3f18fcedd314b68d3.jpg","description":"From Tetsuya Mizuguchi and the same people who brought you the award-winning Rez Infinite and Lumines comes the new PS4 game TETRIS® EFFECT.\nNamed after a real-world phenomenon where players’ brains are so engrossed that images of the iconic falling Tetrimino blocks (i.e. the Tetris playing pieces) linger in their vision, thoughts, and even dreams, TETRIS EFFECT amplifies this magical feeling of total immersion by surrounding you with fantastic, fully three-dimensional worlds that react and evolve based on how you play. Music, backgrounds, sounds, special effects—everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you’re playing.\nFrom deep beneath the ocean to the furthest reaches of outer space and everywhere between, TETRIS EFFECT’s 30-plus stages take players on a wondrous, emotional journey through the universe. The core of the game is still Tetris—one of the most popular puzzle games of all time—but like you’ve never seen it, or heard it, or felt it before.\nWhether in full HD on a standard display and PS4, or in razor-sharp 4K resolution with a PS4 Pro, or in fully-immersive 3D via the optional PS VR support, TETRIS EFFECT’s gorgeous imagery, evocative sounds, and super-addictive gameplay add up to an unforgettable experience...and that’s literally unforgettable, as the game’s name implies.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Enhance Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":27418,"name":"The Legend of Zelda: The Minish Cap","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25d/25d9592abbd02dccd67d83108ae79582.jpg","description":"Don the Minish Cap to shrink Link™ down for his most massively\nmicroscopic adventure ever! Mere blades of grass will tower over your\nhead as you explore Hyrule, conquering enemies, puzzles, dungeons and\nbosses as you go. Along the way, you’ll wield powerful items, fuse magic\nKinstones and befriend the elusive Minish to stop the evil sorcerer\nVaati.\n\nThe Minish Cap plays a pivotal part in the Four Swords storyline of the\nLegend of Zelda™ series, and is the first and only game in which Link\nexplores the land of the Minish—a tiny, mysterious kingdom on the very\nsurface of Hyrule. That makes this unique entry in the Zelda series a\nmust-play for new and old fans alike. Inventive items like the Mole\nMitts and Gust Jar give Link powers he’ll need to use wisely if he wants\nto save the puzzling world of Hyrule and the miniature land of the\nMinish. When there’s a princess to save, a bad guy to beat, and you’re\nTHIS small, the stakes will never be higher.\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Capcom","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Nintendo 3DS"}]},{"id":263537,"name":"Samsara Room","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/650/650f564e03040b8aa31e909e00c32b68.jpg","description":"You find yourself in a strange room. There is a telephone, a mirror, a grandfather clock and some other odd objects you don’t recognise. It seems there is only one way to escape… become enlightened.\n\n\nSamsara Room is a new atmospheric point-and-click adventure by the creators of Rusty Lake and Cube Escape series. This praised predecessor to the Rusty Lake universe is completely re-assembled with brand new puzzles, story, graphics and an immersive soundtrack by Victor Butzelaar.\n\n\nCelebrate our five year anniversary with us, download and play for free now!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rusty Lake","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":21510,"name":"Fractal: Make Blooms Not War","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bd9/bd986acc3ee9d7463f7ff2fa73c29394.jpg","description":"From the award-winning team that brought you Auditorium and Pulse: Volume One comes Fractal, an enthralling music puzzler experience. Push, Combo, and Chain your way through a pulsing technicolor dreamscape all the while expanding your consciousness at 130 BPM.\nWith 3 unique and challenging game modes, amazing HD-Quality graphics, and an ever-evolving soundtrack, Fractal is sure to destroy what little productivity you have left.\nKey Features:\n\n3 Distinct modes of play: Campaign, Puzzle, and Arcade\nAll-new Musicbox Audio Engine composes music based on how you play\nColors! Hexagons! Particle Effects! Ridiculous Callouts!\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cipher Prime Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12410,"name":"WARMODE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b13/b13e36f7344da3f3f53b63a9beff3f14.jpg","description":"Free to play shooter about the confrontation of two irreconcilable sides, represented by the government military housings and the armed hirelings. Try your hand at virtual battles with off-scale dynamics and hurricane gameplay in the spirit of the classical shooters.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"WARTEAM","platforms":[{"id":0,"name":"PC"}]},{"id":4511,"name":"Brothers in Arms: Hell's Highway","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b1/2b1a4e59f1c6f31828f32a6c4e2943c4.jpg","description":"Brothers in Arms Hell's Highway brings the critically acclaimed squad-based WWII shooter into the next generation of gaming with amazing graphics and sound, new cutting-edge gameplay features and a totally redesigned online component.\nDelivering on the franchise's compelling story, unrivaled authenticity and intense squad-based action, Brothers in Arms Hell's Highway drops you into Operation Market Garden, the largest paratrooper operation in World War II.\nBrothers in Arms Hell's Highway  next generation: The classic authentic, squad-based combat series explodes on next-generation hardware, offering unprecedented graphics and features.\nNew story, new setting: Join Matt Baker, Joe Hartsock and the rest of the 101st Airborne Division in Operation Market Garden as they fight to open the infamous Hell's Highway in a daring bid for a quick end to the war.\nLive the life of an enlisted man: Get orders from HQ, go on patrol, spot the enemy and set up a devastating ambush. For the first time, finding the enemy before they find you is part of the challenge.\nUnprecedented character design: Lifelike characters look, talk, move and think with incredible realism. Game characters interact with the player and each other like true brothers in arms, trading ammunition, helping wounded allies and civilians, working together to man team-operated weapons, and more.\nRich cinematic experience: As the squad leader, you interact with and get to know your brothers. Each character has his own distinct personality, unique story and background, and grows throughout the game.\nPowerful new units under your command: Players can use or command combined arms teams  machine gun crews create intense fire, bazooka crews destroy buildings and tanks, and mortar crews pound the enemy from a distance.\nPlay your own way: Players can choose to use their squad to execute a tactically elegant flanking maneuver or charge in with guns blazing.\nDestructible cover: Keep your men moving and choose your cover wisely  modeled using real physical properties and behaviors, weapons will damage, dent, scorch and destroy the world around you.\nCompletely new multiplayer experience: Fight major multiplayer battles with dozens of players on each side, combining all the intensity and accessibility of Deathmatch with the squad-based gameplay that helped make Brothers In Arms famous.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":45416,"name":"Purrfect Date","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/993/993460faee85d30b329da00d13d33471.jpg","description":"Meet the catsHOT SINGLE CATS IN YOUR LOCAL AREA:\nAbout the Game\nSign up for sexy cat facts with our official mewsletter here.\nYou can also stay up to date with all of the latest Purrfect UpDates on Twitter, Facebook,\nInstagram, YouTube and the Official Blog.\nPurrfect Date is a cross between a visual novel, dating sim, and dark British comedy. You, a human, will get to date cats and uncover the secrets of the mysterious Cat Island. Choose your own adventure as you romance the talking cats, balance your stats and carry out your research into the dark and questionable history of the Island.\nDrawing inspiration from trailblazing games such as Undertale, Dream Daddy, Hatoful Boyfriend, and Pony Island, there'll be lots of twists, turns and alternate playthroughs to keep you replaying.\nThroughout the game’s seven chapters, you will be playing as multiple scientific researchers, on a quest to analyse and understand the flora, fauna, and felines of a very unusual island - Cat Island - an island almost exclusively inhabited by Cats.\nAs you investigate and assess the Island locals, you begin to realise there is more to these cute kitties than meets the eye.\n666 - 6 chapters, 6 playable humans and 6 dateable cats.\nFinal Chapter - A final, 7th chapter, based on the decisions, choices and consequences of your 6 previous characters and chapters.\nA long tail - With more words than Harry Potter and the Chamber of Secrets, Purrfect Date contains more than 7 hours of Gameplay (Based on the average reading speed of 200 words per minute).\nManage your Research, Recon, Romance and Stress levels - It's up to you to diligently juggle your stats while maintaining a flourishing professional and romantic life.\nCuriosity killed the cat - Multiple endings, paths, hidden stories and side adventures.\nLocalised in as many as 1 whole language - English.\nSteam Achievements, Trading Cards and Cloud Saving.\nMeowsic and Programming by OliverAge24 - Musician, turned YouTuber, turned GameDev, this is Oliver’s debut game.\nWritten by Ruby-Mae Roberts - Ruby loves cats. Her mum, Charon, also helped write the game.\nPawesome Artwork by Dan Lish - He’s worked on games such as Grand Theft Auto 3, Serious Sam and DJ Hero, with companies such as Lucas Arts, Rockstar Games and Sony, and on loads more projects, including comics, album art and graffiti.\nThis game is dedicated to Little Edie and Lush. May their food bowls forever overfloweth with mackerel (they're both still alive btw).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Bossa Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":9437,"name":"Witch It","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b5/6b536e453f3457c2ff5a444c3ef38b12.jpg","description":"Check out this new Daedalic titlehttps://store.steampowered.com/app/319540/\nAbout the GameWitch It is a multiplayer hide & seek game. Brave hunters seek hidden witches in a humorous, magical world.Hunt & Hide in a vibrant, magical world\nThe Witch It world is jam-packed with humble villages, icy lakes, and ancient libraries for you to explore and hide within. Each map has its own stories and secrets for you to delve into and discover!Seek as a Fearless Hunter\nAs a hunter, your job is to hunt down all the witches for the sake of a peaceful town. Hunters are equipped with a range of different tools and gadgets to help them with their task, whether it is a loyal chicken that scans for sneaky witches or a body slam skill that causes huge impact damage in one area!Hide as a Mischievous Witch\nWitches have the ability to mimic almost anything in the landscape in order to fool the hunters and stay alive. Witches can switch between different props as they please, as well as perform different spells to confuse or scare their opponents!Discover a wide variety of props\nEach map is filled with an ever-expanding amount of unique props that witches can disguise themselves as, from large items of furniture to small foods and fruits. Glorious rewards await the most curious of witches who can find and mimic all of them!Express Yourself\nFill your wardrobe with stylish shirts and wacky brooms. Unlock more and more items as you play the game and earn experience, so you can individualize your hunter or witch according to your own personal taste!Choose between several game modes\nThere are currently four game modes. 'Hide & Seek' – Hunters have to find all the witches to win the game. 'Mobification' – Caught witches turn into hunters. 'Hunt a Hag' – Skills are disabled for both teams and hunters can only use their melee weapon. \"Fill a Pot\" - Witches need to fill cauldrons and Hunters must prevent them from doing so.Main Features\nPlay as a hunter or witch on twelve diverse maps, each with own unique playstyles and prop layouts for you to discover!\nUse a growing array of fun skills to troll and fool your opponents!\nDynamic, physical based prop movement allow you to easily locate hiding spots or traverse the maps effortlessly!\nUnlock countless customization options for both hunters and witches, of varying rarities and caliber!\nProgress and level your account to show off your prop hunting and hiding abilities!\nPlay on public servers with other experienced prop hunters, or open up your own private server and play with a group of friends!\nWitch It is an Early Access title, so our core gameplay mechanics and features may be subject to change. We welcome all types of feedback over on our Steam Forums or Discord server!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Barrel Roll Games","platforms":[{"id":0,"name":"PC"}]},{"id":299545,"name":"WRATH: Aeon of Ruin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15e/15edbe93b186beaf9cb0a741b13a4cf6.jpg","description":"You are Outlander.  \n\nOnce adrift upon the Ageless Sea, you now find yourself on the shores of a dying world. \n\nFrom the consuming darkness emerges a figure cloaked in white, the Shepherd of Wayward Souls, who burdens you with the task of hunting down the remaining Guardians of the Old World.\n\nYou must journey into the vast gloom to explore ancient ruins, discover forgotten secrets and battle the horrors that lurk within.\n\nFueled by legendary Quake 1 technology, the veins of WRATH pump with the DNA of revered '90s shooters.\n\nWRATH embraces the timeless elements of classic titles such as DOOM, QUAKE, DUKE NUKEM 3D, BLOOD, UNREAL and HEXEN and carries them into the 21st century.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"3D Realms","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":13114,"name":"Long Live The Queen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/702/70209af765e47a476484ed6911b17d25.jpg","description":"Rule the world or die trying!\nBeing a Princess is not an easy job. Being a Queen is even harder. Especially when you're only fourteen years old, and the reason you've inherited the throne is that your royal mother has just met an untimely end.\nNow power is up for grabs. You may be the official heir, but much of the country's nobility would love to steal the throne for themselves. Aggressive neighbors will take advantage of any weakness to enlarge their borders at your expense. And that's not even mentioning the magical dangers which are lying in wait...\nCan you survive long enough to reach your coronation?\nTHE QUEEN IS DEAD, LONG LIVE THE QUEEN","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hanako Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11508,"name":"Tales of Maj'Eyal","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e27/e2752ee3912a3d9c7224922efce79e60.jpg","description":"Tales of Maj’Eyal is a roguelike RPG, featuring tactical turn-based combat and advanced character building. Play as one of many unique races and classes in the lore-filled world of Eyal, exploring random dungeons, facing challenging battles, and developing characters with your own tailored mix of abilities and powers.\nWith a modern graphical and customisable interface, intuitive mouse control, streamlined mechanics and deep, challenging combat, online stats and character sheets, Tales of Maj’Eyal offers engaging roguelike gameplay for the 21st century.\nFocus on randomly generated tactical battles\nRich set of very unique classes\nUnlocks & achievements progression\nRich world with its own history which slowly reveal during the game\nNo consumables, no grinding\nTurn based: think before you act!\nSimple, easy to use interface\nEasy modding support with Workshop integration\nBuyers will get all the extra features that normal donators get. You can test for free on te4.org","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Netcore Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":258,"name":"A KING'S TALE: FINAL FANTASY XV","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2a/b2a07062fed4f1bfb52f4ec4ab4fbb86.jpg","description":"Set in a fictitious 30 years before FINAL FANTASY XV, this game features retro-style inspired graphics centered around a fast-paced combat system with influences from modern gaming. The in-depth combat system blends intense attacks, devastating magic, mighty summons and unique companion attacks into a singular gaming experience through three diverse locations in the world of FINAL FANTASY XV.\nRestless before bed, young Noctis asks his father, King Regis, to tell a fairy tale full of fantasy and adventure instead of just another generic bedtime story. Regis begins with a peaceful day being disrupted when monsters raid the royal capital, Insomnia. Young Regis, joined by Weskham, starts his adventure from the royal capital. Eventually they are joined by friends Cid and Clarus, where they travel to the plains of Duscae only to discover a mysterious cave where their enemy resides.\n1 player\n2GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nA KING’S TALE™: FINAL FANTASY®XV © 2016 Square Enix Co., Ltd. All rights reserved.\nDeveloped by Empty Clip Studios Inc. and Powerhouse Animation Studios, Inc.\nA KING’S TALE is a registered trademark or trademark of Square Enix Co., Ltd. FINAL FANTASY, SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd. All other trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":416811,"name":"Builders of Egypt: Prologue","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2bd/2bd7c117057e74c03b6ea9577ae8e4c1.jpg","description":"Add Builders of Egypt to wishlisthttps://store.steampowered.com/app/818520/\nAbout the GameBuilders of Egypt: Prologue is an economic type of city-building taking place in the valley of the Nile. The story starts in a little-known protodynastic period in which you will be able to observe the birth of the Old Egypt and finished with the death of Cleopatra VII.\nThe most important aspect is the skillful management of urban planning by shaping the grid of streets, placing buildings and their mutual relation. Well-designed city will greatly improve economic efficiency which may convert into city income.\nDiplomacy and politics:\nThe governor will face very difficult choices to be made in a constantly changing political environment. Costly expeditions, Pharaoh and other cities requests, military threat and a mixture of different cultures will be a commonplace. A series of wrong choices can cost the loss of trading partners and low interest in the city by settlers. Moreover, the total lack of obedience to the rulers may end up with a civil war.\nReligion:\nDeity will be able to interfere with daily life but it will be done implicitly. The main aspect of religion will be satisfying the need for access to the places of worship, providing supplies for temples or organizing festivals. Neglecting this sphere may result in a dangerous social unrest on a par with e.g. famine.\nTrade:\nTrade is the most important element in royal treasury. Without it, it is very difficult for economic stability built solely on taxes. Therefore, in the interest of the player, producing  goods for export at prices that will be able to change dynamically depending on the geopolitical situation, will be required.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Strategy Labs","platforms":[{"id":0,"name":"PC"}]},{"id":366884,"name":"Ion Fury","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f7/7f7c32fb264abbf14ea32b3ba41eae0a.jpg","description":"While Shelly “Bombshell” Harrison earned her codename defusing bombs for the Global Defense Force, when evil transhumanist mastermind Dr. Jadus Heskel unleashes the members of his cybernetic cult onto the streets of Neo DC, she knows it’s time to start causing explosions instead of preventing them.\n\nHer quest to slay Heskel leaves a trail of carnage throughout huge, multi-path levels filled with gigantic explosions, more secret areas than we can count, and inhuman foes behind every corner. There’s no regenerating health here; stop taking cover and start running and gunning.\n\n\n\nShelly’s crusade to take down Heskel’s army will see her leave destruction in her wake with a wide arsenal of weapons, complete with alternate fire modes and different ammo types. Her signature revolver, the tri-barreled Loverboy, brings enemies pain and players pleasure with both single shots and Old West-style hammer fanning action. Who needs a regular shotgun when you can load buckshot into your grenade launcher? Violent, over-the-top Bowling Bombs rip enemies apart with ease.\n\n\n\nIon Fury laughs at the idea of mandatory checkpoints and straight paths through shooting galleries. But, just because this is a true old-school first-person shooter doesn’t mean we've ignored all the good new stuff the last two decades have brought. Headshots? Hell yeah. More physics and interactivity? You betcha. Widescreen, controller support, and Auto Saves? 3D Realms and Voidpoint have taken the best of both worlds and cooked it all into a bloody stew. \n\n\n\n\n\nThe true successor to classic shooters such as Duke Nukem 3D, Shadow Warrior, and Blood.\nExperience the original BUILD engine on steroids, pumped up and ready to rock again after 20 years!\nDuck, jump, climb, swim, and blast your way through 7 exciting zones packed with multiple levels of mayhem!\nA beautiful game world assembled from thousands of hand-crafted textures and sprites\nAn awe-inspiring arsenal of devastating weapons, including multiple ammo types and alternate fire modes. Tri-barreled revolvers, grenade launchers, and heat-seeking smart bombs are your best friends!\nThe classic '90s FPS action you love, meshed with modern inventions like locational damage and seamless level transitions\nZERO PROCEDURAL GENERATION. All levels are hand made and full of multiple paths, cool effects, and complex set pieces!\nThumping soundtrack comprised of true tracked module music, in authentic FastTracker 2 format\nEasy access on to level editor and other development tools on day one, plus Steam Workshop support","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"3D Realms","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":274849,"name":"Fae Tactics","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/055/0551cc6cba70fc8cd633bd5b0660b807.jpg","description":"In Fae Tactics, follow a young magic user named Peony on her journey across a vibrant world full of mystery and danger. Summon allies, cast spells, and befriend a motley crew of characters as you dive into the growing conflicts between man and magical beings known as fae.\nStory\nLong ago the world of magic was separated from the natural world by Elemental Gates. One day the seal on the gates was broken, flooding the natural world with magical fae creatures once thought to be myths. The worlds merging was imperfect and much of the land was torn apart. The devastation claimed the lives of most of the population of natural and fae creatures alike. Those that survived have forged new lives in the ruins of the old worlds, but growing tension between man and fae threaten to finish what began with the opening of the gates.\nFeatures\nUnique menuless turn based tactical gameplay.\nManage the magical elements of your party to counter the enemies elements.\nBefriend a colorful cast of allies! Level Up and customize their abilities.\nBattle all kinds of Fae creatures and collect them into your team.\nFind powerful and unique Spells to help tip the scales in your favor.\nTraverse a variety of colorfully detailed environments in this isometric wonderland.\nUnravel secrets as you explore the various conflicts in the world in any order you want!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Endlessfluff Games","platforms":[{"id":0,"name":"PC"}]},{"id":28855,"name":"Spartacus Legends","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca3/ca34cd101e220397796a84acccd209a6.jpg","description":"Spartacus Legends is a video game adaptation of the Starz historical action TV series Spartacus. It was released as a free-to-play and discontinued since 2015.\n\n###Premise\nThe game is set in the Ancient Rome in the Republican era. It features Spartacus, a gladiator who became the leader of a slaves' rebellion, however, it does not follow the titular character's biography. The game is loosely based on the prequel miniseries Spartacus: Gods of the Arena and centered around gladiatorial arena fights. The game allows both single player and multiplayer.\n\n###Gameplay overview\nSpartacus Legends combines elements of the fighting genre with a sports simulation. The game puts the player into the role of an organizer of the arena fights. The player can purchase new gladiators and equip them with new weapons and armor. As the player wins more matches, his or her gladiators earn experience, and more equipment is unlocked. He or she can also purchase any items using the real-world money.\n\n###Combat\nDuring battles, the player controls his or her gladiator while trying to defeat the opponent controlled either by the AI or by another player. The combat mechanics are simple and repetitive. They consist of kicks, punches, rolls, and blocks that can be used in a progression to form combo movements. There are also finishing moves that allow a gladiator to execute his or her opponent in a bloody and spectacular manner.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Kung Fu Factory","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":9678,"name":"LawBreakers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/576/57614dc6203d74f1d980754c3298192c.jpg","description":"Deadzo Deluxe Edition\nLawBreakers evolves the FPS, but keeps pricing dead simple. A low, one-time price includes all future role characters, maps, and modes for free. No BS. Everyone pays the same for the core game. You can’t buy better weapons. You can’t buy skill. Wins are earned, not bought.\n\nBut, for an extra $12.99, you can look awesome while you kill awesome. The Deadzo Deluxe Edition includes:\n\n6 Exclusive Boss Tier Character Skins\nHadronium Blue Weapon Skins\n3 Exclusive Deadzo Weapon Stickers\n& Deadzo Account Portrait\nAbout the Game","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Boss Key Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":375223,"name":"Calico","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b26/b2688f72567e196b860b8d4054a5344e.jpg","description":"Calico is a day-in-the-life community sim game where you are given an important and adorable task: rebuild the town’s cat café and fill it with cute and cuddly creatures! You will journey to a small village filled with magical girls and other fantastical friends, where you are placed in charge of a run down cat café. Build up your café by filling it with cute furniture, fun decorations, yummy pastries, and get it bustling with animals again!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"CatBean Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14988,"name":"Sonic Lost World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51d/51dec86a3a4fff0d0faa122db48a98fd.jpg","description":"In his latest plot to defeat Sonic and rule the world, Dr. Eggman has harnessed the power of menacing creatures known as the Deadly Six. However, when the Deadly Six rise up against their new master, Sonic must unite with his arch nemesis Eggman and explore the mystical Lost Hex in order to take them on head-to-head. Use Sonic’s amazing new moves & incredible Colour Powers to speed across a variety of unique terrains, racing inside, outside & upside down in every level.NEW MOVES\nSonic moves like never before. Vault over obstacles, free run up & along walls & sky dive between islands at lightning speed. Plus the Spin Dash is back!COLOUR POWERS\nNew & improved Colour Powers. Sonic can now fly through the air, tear up levels & explode into enemies. He’s more powerful than ever!NEW WORLD\nSpeed through a variety of exhilarating levels. Explore massive mind-bending courses, vast underground tunnels & colossal structures in the sky as you run inside, outside & upside down.BOSS BATTLES\nSave the world one fight at a time. Take on each of the devious Deadly Six in dynamic boss battles which test all of Sonic’s moves & power-ups.NiGHTMARE ZONE DLC Included\nIncludes NiGHTMARE Zone DLC free - featuring monsters inspired by the hit game 'NiGHTS into Dreams'PLUS – Now with new and improved PC Features:\n60 FPS gameplay\nHD resolution support\nFull PC Gamepad + Keyboard support\nFull Steam functionality","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sonic Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"}]},{"id":7978,"name":"Two Worlds II Castle Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e07/e0771b2710df02f05aa34b7767f0c930_O6X8cDx.jpeg","description":"While the bloody battle between Gandohar’s troops and the armies of the Orcs is raging in front of the gates of Oswaroth, the emperor waits in the depths of his palace on the outcome of the struggle for power. However, he does not know that an elite troop of Orcs, led by Rogdor, is making its way through secret paths into the fortress and is now close to the portals of the throne room...\nGameplay\t\t\t\t\tUtilize the opportunity to slip into the role of the Emperor Gandohar and his henchman Sordahon! These villains from the \"Two Worlds\" universe are now playable for the first time ever in this strategy game, thus opening an entirely new perspective into the vast world of Antaloor. Using foresight and skill, you must defend abandoned ruins, dark forests and winding catacombs against the onrushing Orcs. Ward off each attack with clever tactics and weaponry, defending Gandohar's throne in the Oswaroth fortress! Are you ready to break the high score and confront the ultimate Castle Defense challenge against opponents from around the world?\nKey features:\t\t\t\t\tComprehensive campaign mode provides an immersive approach to this strategic title\nJump right into the Arena mode for instant action\nContent based on both \"Two Worlds\" role-playing games\nA range of environments including ruins, forests and catacombs\nTwo distinct playable characters to lead your army, both equipped with special attacks such as Fire Damage or Ice Bomb\nSix uniquely different, upgradeable combat units such as Magicians and Rangers\nDozens of different enemy archetypes in over 20 independent classes\nAdvanced unit management with a variety of powers at your disposal\nMassive levels with up to 50 units on-screen simultaneously\nIndividual graphics and sound settings\nAtmospherically dense level based soundtrack\nCompetitive online high-score hunting in Campaign and Arena modes\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Topware Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":730,"name":"Year Walk","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/602/6020940d3a7f6c0b24d2555c836c81ee.jpg","description":"In the old days man tried to catch a glimpse of the future in the strangest of ways.\nExperience the ancient Swedish phenomena of year walking through a different kind of first person adventure that blurs the line between two and three dimensions, as well as reality and the supernatural.\nVenture out into the dark woods where strange creatures roam, on a vision quest set in 19th century Sweden. Solve and decipher cryptic puzzles, listen for clues, and learn about mysterious folklore creatures in the built-in encyclopedia as you seek to foresee your future and find out if your loved one will ever love you back.\nMysteries and clues await everywhere in Year Walk, but to fully understand the events that took place on that cold New Year's Eve, you will have to delve deeper than the adventure and lose yourself between fact and fiction.\nThis edition of Year Walk features several new additions:\n• New locations within the game\n• Map\n• Updated art\n• New puzzles\n• Integrated Encyclopedia about the mysterious myths and creatures encountered in the game\n• Hint system\n• Steam Achievement Puzzles\n... and more!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Simogo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":484939,"name":"Werewolf: The Apocalypse — Heart of the Forest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c87/c87402bf3b30f4cb2e3d45ba5840d69a.jpg","description":"Werewolf: The Apocalypse — Heart of the Forest throws you deep into a primeval wilderness in the center of modern Europe. It’s where the protectors of nature wage their ancient, neverending war against the forces of destruction.\nYou play as Maia, who comes to Poland hoping to trace her family roots. Trying to learn more about her ancestry, she will discover her family’s dark secrets and reveal hidden truths about the last wilderness of Central Europe.\nVisit real-world places of mystery and power. Explore local legends and traditions. Discover the fascinating world and history of the Polish-Belarusian borderlands. You will witness how nature clashes with technology and greed. Can it survive without our help?Discover the Legendary RPG System\nFor the first time ever, you will be able to experience Werewolf: The Apocalypse on your computer.\nWerewolf: The Apocalypse — Heart of the Forest adapts the mechanics of the legendary title from the World of Darkness universe, emulating the experience of a classic role-playing session.\nAn immersive narrative that can measure up to the best mystery novels.\nBeautiful, distinctive collage art that combines hand-illustrated characters with pictures of real places to inspire your imagination.\nBy making tough choices that often bring dramatic consequences, you will affect your character attributes: Rage, Willpower, and Health. This impacts your ability to perform certain actions as well as change the range of available choices and the presentation of the world. The game will analyze your behavior and determine what kind of werewolf you are.\nWerewolf: The Apocalypse - Heart of the Forest is a beautifully written, deep, and balanced experience. It’s tailored for World of Darkness veterans and newcomers looking for an accessible entry into this rich, acclaimed universe.\nThey teach you to fear rather than to be angry, but fear solves nothing.\nAnger is there for a reason, to shield and protect you.\nAnger is the part of you that cares.\nRage gets things done.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Different Tales","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":21808,"name":"New kind of adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ed/4edbbf1e3591d96c467a3740852f9c99.jpg","description":"New kind of adventure is a 3D adventure game with RPG elements.\nMary hides in a wardrobe after her parents had a fight. She falls asleep. When Mary awakes, she discovers that she is in a beautiful, magical world with giant strawberries and magical druids!\nWith her new friend Aquarius, Mary must find a way back to the real world!Features:Use Mary's new found powers and Aquarius' magical abilities to solve puzzles and complete quests.Collect Artefacts to unlock new magical powers and abilities.A huge vibrant world, with colourful wildlife and environments.Gather items and resources to trade with Druids.Original folk jam soundtrack.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mint Age Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16184,"name":"Rolling Sun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94f/94f81e4293c01b9cb3b7fc95d935eeeb.jpg","description":"Rolling Sun takes advantage of the latest version of CRYENGINE, with best in class physics, lighting and water effects.  Discover ancient magic as you guide your Sun Stone through lost Incan and Mayan civilizations.\nTake control of a defeated Sun God trapped on Earth.  Use the last of your powers to guide a stone across and ancient civilization, gaining power as you get closer and closer to your rival, the Moon God.\nSkills to unlock :\nAs you gain power, you'll gain such skills as double jump, mid-air dash, and more.\nPhysics-based gameplay.\nTake advantage of a living environment, powered by CryEngine physics, to reach your goals.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mystik'Art","platforms":[{"id":0,"name":"PC"}]},{"id":6508,"name":"Draw a Stickman: EPIC","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/312/3123c2b86ff947d3b6a846c771817e06.jpeg","description":"Draw a stickman, then guide him through a fantastic world of adventure! Using an assortment of pencils, draw elements, tools, and weapons to solve puzzles and overcome obstacles.\nDraw a Stickman Epic could be compared to an adventure game, RPG, or puzzle game, but the unique drawing mechanic is unlike any game you've ever played before! From drawing a rain cloud for growing plants to drawing an axe for chopping down a gate, you control all aspects of your environment.\nExplore diverse environments and encounter unusual creatures as you draw your way through 14 levels (plus a hidden bonus level)! With the non-linear gameplay, how you overcome one environment will determine which level you unlock next. Each level is filled with hidden secrets and achievements, offering hours and hours of replay value.\nGrab a pencil and dive into the world of Epic!\nExclusive Features for Steam\nImproved visuals and audio\nNew hidden content exclusive to Steam\nMore challenging puzzles\nSteam-specific content including 42 Steam Achievements, Steam Stats, Steam Cloud, and Steam Trading Cards!\nAwards and Recognition for Draw a Stickman: EPIC\nDownloaded 5 million times!\nPlayed over 100 million times!\n5 Total Webby awards for the entire Stickman series!\nIncluded in the 100 best Apps by PC Mag!\nRanked top 15 games by PC World!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hitcents.com","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":28399,"name":"Perfect Dark Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d5/0d555bec9338aa4f4035fe664e9dc10f.jpg","description":"Perfect Dark Zero takes place when a secret war begun between shadowy corporations bent on world domination. Joanna Dark and her father, Jack, are caught up in the fight for the planet's future. A routine bounty hunting missions opens a global conspiracy that cahnges Joanna's destiny forever. Guide Joanna Dark on her journey to become the Perfect Agent. Perfect Dark Zero features a compelling and captivating story pluging players into a world of corporate espionage and conspiracy. Perfect Dark Zero merges the excitement and intrigue of its predecessor with recolutionary game design, online play and amazing graphics to deliver an experience that defines next-generation gaming and entertainment. Multitude of Weapons, Gadgets and Vehicles - Perfect Dark Zero features many of the classic weapons and gadgets from the original games as well as other additions. Combat-enabled vehicles include jetpacks, hovercrafts and motorcycles.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":1009,"name":"Batman: Return to Arkham","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e71/e71777044864f84d79ae74f3b4a4ed26.jpg","description":"Return to Arkham and experience two of the most critically acclaimed titles of the last generation - Batman: Arkham Asylum and Batman: Arkham City, with fully remastered and updated visuals. Batman: Return to Arkham includes the comprehensive versions of both games and includes all previously released additional content.\n\nBatman: Arkham Asylum exposes players to a dark and atmospheric adventure that takes them into the depths of Arkham Asylum –Gotham City’s high security psychiatric hospital for the criminally insane. Use Batman’s legendary gadgetry, strike from the shadows, and confront The Joker and Gotham City’s most notorious super villains.\nBatman: Arkham City sends players soaring into Arkham City - a heavily fortified sprawling district in the heart of Gotham City. Batman Arkham City introduces a brand-new story that draws together an all-star cast of classic characters and murderous villains from the Batman universe, as well as new and enhanced gameplay features.\n\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nBATMAN: RETURN TO ARKHAM software © 2016 Warner Bros. Entertainment Inc. Developed by Rocksteady Studios. Remastered by Virtuos.\nBATMAN and all characters, their distinctive likenesses, and related elements are trademarks of DC Comics © 2016. All Rights Reserved.\nWB GAMES LOGO, WB SHIELD: ™ & © Warner Bros. Entertainment Inc.\n(s16)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":681463,"name":"Escape Simulator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34d/34d81011dd25dd596d25094a215b7823.jpg","description":"MORE FROM PINE STUDIOhttps://store.steampowered.com/app/1599880/Cats_in_Time/\nAbout the Game\nEscape Simulator is a first-person puzzler you can play solo or in an online co-op. Explore a growing set of highly interactive escape rooms. Move furniture, pick up and examine everything, smash pots and break locks! Supports community-made rooms through the level editor.\nInteractive Puzzles: Rummage through 15 rooms filled with puzzles designed by real-life escape room operators. If something is not nailed to the wall, you can pick it up.\nOnline Co-Op: All the rooms are playable in an online co-op. We recommend to play built-in rooms with up to 3 players (but you're welcome to play with more). Community rooms have been tested with up to 20 people. Customize your character and join with friends to work-out puzzles together. More heads are better than one!\nExamine Everything: Read through books, examine ancient artifacts and find clues to riddles. Need to cross-reference a clue? No, problem - just pin it to the screen.\nCommunity-Made Rooms: The game includes a room editor with which you can design your own escape rooms and puzzles. Through workshop integration, you get to play awesome things the community has created.Fifteen rooms are arranged into packs:\nLabyrinth of Egypt\n\"You and your mentor discovered the ancient Labyrinth of Egypt. By accident, he activated a\ntrap, and you got separated, with no way out in sight.\"\nAdrift in Space\n\"An explosion wakes you up. Your spaceship has been hit by debris, and you're heading straight into the sun.\"\nEdgewood Mansion\n\"You were invited to attend a special dinner at Dr. Edgewood's mansion. Instead of eating food, you'll be solving a victorian mystery.\"","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Pine Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":27936,"name":"Pokémon Gold, Silver","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fe/6fee3969b73bfccd935517c0c15826d8.jpg","description":"When initially launched on the Game Boy Color system, the Pokémon \n      Silver Version game continued to expand the Pokémon universe, adding \n      100 Pokémon, held items, Pokémon eggs, and real-time events thanks to an \n      internal game clock. Now a new feature lets you trade and battle Pokémon \n      using local wireless on the Nintendo 3DS family of systems!\n    \n      Dozens of Pokémon join the action, including Legendary Pokémon trio \n      Raikou, Entei, and Suicune. Pokémon Silver Version \n      introduced new Pokémon types as well—look out for Steel-type and \n      Dark-type Pokémon throughout your travels. At the start of your \n      expedition, you'll have the option to choose one of three starting \n      Pokémon: Chikorita, Cyndaquil, or Totodile. Then, prepare to battle your \n      rival frequently as the two of you make your way across the incredible \n      Johto region. You'll find Pokémon in Pokémon Silver Version \n      that you won't find in Pokémon \n      Gold Version, so look for a fellow Trainer to trade with!\n    \n\n        Experience the classic gameplay of the Pokémon Silver Version \n        game!\n      \n\n        Discover the innovations that started with the Pokémon Silver \n        Version game.\n      \n\n        Battle and trade with friends using local wireless\n      \n\n        Catch all of the 100 Johto Region Pokémon by trading with your friends \n        who have the Pokémon \n        Gold Version game!\n      \nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Game Boy Color"}]},{"id":15034,"name":"SUPER DISTRO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/279/279fee1118d4e376ff94e1373eea461a.jpg","description":"CONQUER THE BATTLEFIELD WITH SUPER-POWERED ABILITIES AND THE SKILL OF YOUR HOARDING!\n\"SUPER DISTRO\" is a hard-as-nails (Seriously, Who comes up with these idioms?) 2D platformer in the style of retro games such as Megaman, Super Mario Bros 2: The Lost Levels and other such rage-inducing classics. Taking \"Difficult gameplay\" to a whole new level - SUPER DISTRO is not for the faint-of-heart. You will die again and again. The weak need not apply - Only those who are determined to overcome impossible odds will find victory here and those are the rules of the land in SUPER DISTRO.\nIn the words of a certain sour-tasting character from a popular television show: \"We've have it all!\"\n\"SUPER DISTRO\" is hopefully unlike anything you've ever played before (We promise that's a good thing!) - Taking familiar staples of excellent games of yesteryear and throwing bucketloads of creativity and innovation (And wall-punching difficulty!) on top; You'll be delighted with the result! Everything has been loving handcrafted by a single guy (With a little help from his friends!) to make sure SUPER DISTRO a stupidly enjoyable, Yet rage-inducing experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"KITATUS STUDIOS","platforms":[{"id":0,"name":"PC"}]},{"id":10204,"name":"Pavlov VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca3/ca3925d7004ae8dd6a1e897242152f32.jpg","description":"Pavlov is a multiplayer shooter for the HTC Vive.\nFeaturesDedicated Servers\nCompetitive Search And Destroy game mode\nCasual fast-paced game modes\nBots\nMatchmaking\nOffline/Practice mode\nVoice Chat\nTouchpad and OOB locomotion\nOOB LocomotionOOB stands for \"out of body\", a teleport variation without actually teleporting, your \"avatar\" moves into the target location while you snap every half a second to it. This works great for people who are prone to motion sickness without breaking the game for other people, this means you can play with regular players.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"davevillz","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":7784,"name":"Mushroom 11","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b7/5b745d1ef8f6f3783784edf40d5e40aa.jpeg","description":"\nDelete it and it will grow.\nMold an amorphous organism into any shape by pruning its cells. New cells will immediately grow, allowing you to traverse a mysterious world across brain-twisting obstacles, overcome swarms of bizarre mutated creatures, and understand the true nature of the devastation from which you emerged. The eerily beautiful visuals are complemented by the exquisite, ethereal soundtrack of British electronica legend The Future Sound of London, also available as DLC.\n* Rock, Paper, Shotgun's Best Platformer of 2015\n* IGN's List of Best Platformers and Most Innovative Games of 2015\n* The Guardian's Top 25 Games of 2015","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Untame","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":369,"name":"Monster Loves You!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8bc/8bcc440b3f1bf3ca7d81a25b28e3bd72.jpg","description":"Live the life of a Monster, from birth to elderhood and beyond, making decisions that affect the world of Monsters and Humans.\nYou live in the village of Omen, and your favorite snack is the fingers of small children. As a Monster, you pop up in the most interesting places — what do you do when three angry bears discover a young child in their cabin? Or when you spy a wolf hunting down that woman with the red cloak?\nAs a Monsterling, your choices are simple ones. Do you chase those poor little mice (+1 Ferocity) or protect them from the dogs (+1 Kindness)? Do you come clean about that fungus your friends ate (+1 Honesty) or cover for them (+1 Bravery)? As a youth, your choices determine your personality.\nBut all youngins must grow up. Monsters and Humans have been at odds for centuries, and there are Human villages on the other side of the enchanted woods. When Human children get lost in those dark and winding thickets, do you terrorize them for fun (+1 Ferocity)? Do you help return them to Human civilization to prove that not all Monsters are to be feared and hated (+1 Kindness)? Or do you fatten them up for Human foie gras — a Monster delicacy? All this, to the backdrop of increasing tensions between Monster- and Humankind.Key features:Balance Bravery, Cleverness, Ferocity, Honesty, Kindness, and Respect to wield political power.\nOver 900 choices to make. Devour Little Red Riding Hood. Gobble up Hansel and Gretel. Eat the Three Little Pigs.\nEncounter different adventures each time you play, with a dozen or so possible endings.\nBonus: Become a Neurosurgeon without having to attend medical school. That's value!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Radial Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]}]