[{"id":21831,"name":"Onirim - Solitaire Card Game","genre":"Strategy","price":0.0,"description":"\"Asmodee has a pretty excellent record of bringing well-regarded modern boardgames to mobile. Onirim is no exception, providing a twist on the solitaire card game that's just perfect on your phone.” - Pocket Gamer\nA Golden Geek Best Solo Board Game Nominee, Onirim is a card game where you play as a Dreamwalker, lost in a mysterious labyrinth, and you must discover the oneiric doors before your dreamtime runs out - or you will remain trapped forever!\nOnirim is a solitaire card game. You must work against the game to gather the eight oneiric doors before the deck runs out. You can obtain door cards either by playing cards of the same color three turns in a row or by discarding one of your powerful key cards when a door appears from the deck. In both cases, you will have to decide the best use of each card in your hand and carefully play around the Nightmares. Those cards are hidden in the deck and will trigger painful dilemmas when drawn.\nIn addition to the exciting solo mode, players will enjoy the intuitive user interface, automated deck management, and stats to track their progress and successes against the game!\nOnirim includes:\n• Shadi Torbey's base Onirim game in solitaire mode\n• 2 expansions: The Glyphs (free) & Crossroads and Dead Ends ($0.99)\n• Original artwork from the base game by Philippe Guerin and Elise Plessis, enhanced by animations\n• Solo play\n• Detailed, interactive, turn-by-turn, in-game tutorial\n• Scoring sytem with global leaderboard\n• Offline stats record so you can track your progress\n• Languages available: English, French, German, Italian, Spanish\n***One of my favorite solitaire games! - Zee Garcia, The Dice Tower\nFind all the latest news for Onirim on Facebook, Instgram, Twitter and Youtube!","imageUrl":"https://media.rawg.io/media/screenshots/abb/abb471baec91ccd03c5351f894b28e4d.jpeg","releaseYear":2017,"developer":"Asmodee Digital","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":21329,"name":"C-RUSH","genre":"Action","price":0.0,"description":"C-RUSH is an old school Shooter, with HD graphics.A new threat is coming from the space; the plasma insects. Exterminate the vermin!!\nBeat your own score and compare it with the other players !Key Features:\n- One ship with different positions to use\n- Different Gameplay according to the positions and shoots\n- A Schmup where you need reflection as well\n- Works with the XBOX 360 Pad\n- 2 Difficulty modes\n- Compatible with Steam leaderboards\n- Achievements to unlock!\nHD video here : http://www.youtube.com/watch?v=6kZeFqj0gNg\nC-Rush was made by 2 people only, and contains one world divided in 4 stages. This is a score game, the main goal is to improve your score each time you play.","imageUrl":"https://media.rawg.io/media/screenshots/187/1871725a9b8a531f8e0a4c61b0892575.jpg","releaseYear":2014,"developer":"Artnumeris","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21190,"name":"The chronicles of Emerland. Solitaire.","genre":"Adventure","price":0.0,"description":"When deciding to learn card magic in a school of an old wizard you could not imagine that you would be chosen by fate as a savior of an entire world. Emerland is an ancient world of magic, where the fragile balance is threatened by the evil sorcerer Sat. Consolidate around you the races populating this fairy land: Elves, Humans, Dwarves and Mermaids. Only together you can challenge him!\n- Awesome and stunning graphics.\n- Mix of a number of Solitaire styles and Hidden objects\n- Fascinating scenario.\n- Two difficulty levels.","imageUrl":"https://media.rawg.io/media/screenshots/acd/acd71cab0db3d804d01223c8e1027766.jpg","releaseYear":2012,"developer":"Rainbow Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17622,"name":"Harvest: Massive Encounter","genre":"Strategy","price":0.0,"description":"Harvest: Massive Encounter is an award-winning real-time strategy game with battles of epic proportions and a unique style of resource management and exploration. Build power plants, mineral harvesters and defense towers and make sure they have sufficient energy to fend off endless hordes of evil aliens. The game offers a vast array of possible strategies with these simple rules, and will compel you to try new and better base designs every time.\nYour objective is simple: Stay alive for as long as possible. Compete on the extensive online high-score lists, form player groups that battle against other groups, or simply try to beat your own record on each of the game's planets. With two scores to beat, three planets to explore and four high-score enabled game modes, you will have a lot to do!\nSurvival Real-Time Strategy Game with Epic Proportions\nUnique Resource Management that Requires Planning and Creative Thinking\nBeautiful Rendered 2D Graphics\nFive Game Modes Ranging from Relaxed to Insane\nThree Worlds with New Challenges and Discoveries\nTen Distinct Enemy Alien Types\nFive Building Types with Unique Abilities\nExtensive Online High-scores\nUnlock all 25 Steam Achievements","imageUrl":"https://media.rawg.io/media/screenshots/a7c/a7c5d2c01f481985393c9dfd3a9245f8.jpg","releaseYear":2008,"developer":"Oxeye Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":16951,"name":"Kyn","genre":"Action","price":0.0,"description":"In a world where Viking mythology collides with magic, explore the world of KYN in a fast paced role playing strategy game that combines party based combat with exploration and progression.\n•\tA Magical Viking World Brought to Life.    Unlock the mysteries of the vast world of KYN as you explore ancient ruins, lush landscapes and snowy mountains filled with intricate puzzles and plenty of danger! Fight against a variety of intelligent enemies and use your skill and cunning to take out powerful boss enemies!\n•\t A Hybrid Tactical RPG Meets Hack-n-Slash.  This is real time action in a fantastical RPG setting.  You will need to leverage the environment to create traps, defend areas or build up special attacks.  When tactics are needed, utilize the slow motion feature, where time slows to almost zero and you can direct your heroes to an area and assign them a task to out flank, out smart and defeat your enemies!\n•\t An RPG Party with up to Six Playable Characters.  Build that classic RPG dungeon crawling group with our motely group of heroes. Each warrior can be outfitted with different equipment and specialized abilities to meet your needs. Allocating points in mind, body, control will build characters that fit your style or meet the challenges of the puzzles you will soon face.\n•\t A Deep Crafting and Loot System.  Collect hundreds of items.  Combine over 100 different elemental materials in a unique crafting system designed to help you get more powerful weapons and armor.","imageUrl":"https://media.rawg.io/media/screenshots/92b/92b7eac4eb76705f2d185535a118cc5b_DeYr2jz.jpg","releaseYear":2015,"developer":"Tangrin Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16945,"name":"Ortus Regni","genre":"Strategy","price":0.0,"description":"AN EARLDOM AWAITS YOUR HAND.\nA truly medieval card game, that is free to download in the modern world!\nOrtus Regni is a new and novel card game inspired by the late Anglo-Saxon period of English history. The Late Anglo-Saxon era in English history is a time of warring Earls. Minor kings all, they claim whatever lands they can. They establish fiefs, cultivate powerful vassals, and fight and engage in endless political struggles. All the while, the Vikings roam not just the sea, but the land.\nIt is truly a Dark Age. Or is it?\nThis is Ortus Regni, “the birth of the kingdom.”\nThe ancient world is dead. The world is reborn. Anyone can become a king through politics and diplomacy – or by the blade. And it is always, in the end, by the blade. Will it be you?\nOrtus Regni is a unique closed-deck, deck-design strategy card game. Players take the role of great Earls vying to control what will become England. Ortus Regni was inspired not only by Anglo-Saxon history, but also by the art of illuminated medieval manuscripts.\nQUICK AND EASY DECK BUILDING: Or let the app build you one, and the save the decks you like.\nTUTORIAL SYSTEM: Journey through the basics of the game.\nCOMPLETE CARD SET INCLUDED: no in game “currency” or card harvesting.\nNOVEL STRATEGIC CARD GAME INTERFACE: Pictorial cards and a replicated tabletop experience.\nOrtus Regni is based off of the premium tabletop card game of the same name. To learn more visit: http://ortusregni.com","imageUrl":"https://media.rawg.io/media/screenshots/b31/b318deb62ddf9dba67ef438ae04aa781.jpg","releaseYear":2016,"developer":"Jon Sudbury Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16567,"name":"Nicolas Eymerich - The Inquisitor - Book 1: The Plague","genre":"Adventure","price":0.0,"description":"A will of steel, a heart of stone, intelligence as sharp as a knife, and wisdom as deep as oblivion.\nEymerich is called upon to investigate an obscure case. Something that goes way beyond heresy, revealing a new face of Evil. He must tackle a great number of arduous tasks and make many painful choices. Terrible creatures await him, but with his burning determination he will overcome a Plague that is deadlier than his worst possible nightmare.\nPlay a remorseless character to live an original story inspired by the famous novel of Valerio Evangelisti.\nKEY POINTS:\nNumerous unique riddles and environments rich in details\nNumerous easter eggs to find\nSound effects immersives atmospheres and enchanting original musics\nVoices in English, Italian\nTexts in French, English, Italian, German, Spanish\nBONUS:\nVoices and texts in Latin for a best experience!\nDivine's Help system to save player to get stuck","imageUrl":"https://media.rawg.io/media/screenshots/184/184b7a2e7f66166c3648da9e694799f8.jpg","releaseYear":2014,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14556,"name":"SoulCraft","genre":"Action","price":0.0,"description":"Humankind is on the brink to discover the secret of eternal life. Fearful of their existence, angels and demons make a pact to proclaim the apocalypse enabling them to materialize on earth and fight the humans. SoulCraft lets you play as an angel and it’s up to you to decide who will win the war – the Evil itself from hell, God in heaven or the humans.\nWith over six million users SoulCraft is one of the best Action RPG games for Android, iOS and Windows Phone - now it is also available on PC!\nHave you ever levelled up a ranged hunter or a wild melee fighter in good old Hack ‘n Slash fashion? Collected loot en masse and upgraded countless equipment to epic proportions?! Felt good, didn’t it? Then now it's time to fulfil your destiny: Do your duty, be a legendary hero and fight for the balance of life itself and be a beacon in this darkest of times in the action RPG SoulCraft. Become an arcane legend and bring back order into a world of chaos. Unleash your wild blood!FeaturesAction RPG that can be played completely OFFLINE!\nPlayable via GamePad, Mouse, Keyboard or Touch.\nSimple Action RPG game with lots of hack n slash and dungeon crawling\nCombat demons in real locations such as Venice, Rome & Hamburg, New York & Egypt. More locations coming soon!\nFive different game modes in legendary quests including time run, arena, hellgate, crystal defense and boss fights\nBattle lots of different and diversified enemies and fight with lots of weapons, swords, items, spells, equipment, gear and loot. Kill like a knight of heaven (aka angel).","imageUrl":"https://media.rawg.io/media/screenshots/7e5/7e5aef6bba1027ba56f60163a759e2cc.jpg","releaseYear":2015,"developer":"MobileBits","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":14040,"name":"Karos Returns","genre":"RPG","price":0.0,"description":"Game Summary:\nAfter a tenuous peace between the four races of Broccion, the world is at war again, seeking leadership. Players take up arms for their guild and for their nation to battle for land, resources, and victory. Choose from four races (Human, Shadow, Seroine, and Vaneese Human) and seven classes (Mystic, Bow Mistress, Blader, Paladin, Rogue, Sorceress, and Gunner), then gain experience to grow into an advanced class, and Fletta to improve your abilities.\nUnique Features:\n-\tFletta System that allows unique class customization\n-\tExplore the dozens of cities and territories in Asmara\n-\tGuild Warfare: None-siege Type Battle Modes Castle Siege, Mine Takeover, and more\n-\tCrafting System: Forge powerful armor sets through hunting, fishing, and mining\n-\tArena System with unlimited Arena Matches\nGame Outline:\nPlayers fight their way through quests, guild clashes, large-scale PvP action and castle sieges to bring peace to the fantasy world of Asmara. Players can choose from four races (Human, Vaneese Human, Seroine and Shadow) and seven classes (Bow, Mystic, Mistress, Paladin, Blader, Rogue, Gunner, and Sorceress). In addition to the traditional experience-point-based leveling system, Karos Returns features the Fletta system that can be used to increase stats, give buffs, buy resources and enchant items. Furthermore, open world PvP adds a morality system to the game, providing an even deeper level of customization for online gamers.","imageUrl":"https://media.rawg.io/media/screenshots/f12/f1279f73207d089794b9b52c8dfff2ff.jpg","releaseYear":2015,"developer":"Galaxy Gate","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13642,"name":"Blueshift","genre":"Simulation","price":0.0,"description":"In Blueshift (formerly Brian's High Velocity Research Center), you get the chance to fly and jet around vast landscapes at ridiculous speeds. Spread your wings and use your rocket boosters to glide, do tricks, go off jumps, ski, anything you can imagine.","imageUrl":"https://media.rawg.io/media/screenshots/3b0/3b04f6072dcb9559e658da2f505d763d.jpg","releaseYear":2016,"developer":"Zach Tsiakalis-Brown","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13395,"name":"Spy Fox 2 \"Some Assembly Required\"","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameThe Plot: Once again, the world relies on Fox - Spy Fox, the suave secret agent who smoothly finesses his way through Spy Corps' toughest assignments. This time, Spy Corps' corrupt counterpart, the Society for Meaningless Evil, Larceny, Lying and Yelling (S.M.E.L.L.Y.) has devised a dogbot which will be unleashed upon the unsuspecting world! In his nastiness, S.M.E.L.L.Y.'s corrupt commander, Napoleon LeRoach, did not install an OFF switch on the dogbot. Instead, he hid the switch somewhere within the World's Fair.\nThe Mission: Find the hidden OFF switch, deactivate the dogbot and stop LeRoach in his robotic tracks!\nExperience Junior Adventures delight in the challenging puzzles and cool mini-games.\nThe secret ending is almost as elusive as SPY Fox's modesty. Can you find it?\nOut of time, Super Sleuth? Save you game and finish it up later.\nThink you solved the mystery for good? Play again - you may find a whole new adventure awaiting you!\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/1e2/1e23ee0896444a35368a8e4ea95b888b.jpg","releaseYear":1999,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":13116,"name":"Horror Hospital","genre":"Action","price":0.0,"description":"MAY BE HARMFUL TO PEOPLE WITH EPILEPSY\nThis game is a puzzle game based on intelligence. Not just horror game. The predicted playing time is +5 hours\nAre you ready to face into fear?\nThink of a dark hospital where fear and horror intertwine.\nA hospital full of paranormal activity.\nThe Horror Hospital is a game in the mind of a mental patient. The first part of the game is in the mind of the patient, and the second part is a brief section about the patient's recovery and awakening.\nHorror Hospital game is about the events that go through the head of a mental patient. In the game, the actor's wife and child play the game from the point of view of the character who is lost in the traffic accident. His family is lost in a traffic accident, the mental balance of the character is disturbed and the hospital where he is admitted loses both consciousness and memory so that the character begins to happen in his mind.\nIn the first part of the game, the players first try to collect 8 pictures to regain our character's memory and consciousness, and when the photos are combined, the patient's family photo is revealed. With the emergence of family photography, the flow of the game continues.\nAnd more...","imageUrl":"https://media.rawg.io/media/screenshots/52b/52b9557eaef24aed619c8277b98d5b6b.jpg","releaseYear":2017,"developer":"KNP Music and Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12138,"name":"Slice, Dice & Rice","genre":"Action","price":0.0,"description":"Slice Dice & Rice is an indie fighting game with no health bars. Inspired by Bushido Blade, it revolves around the idea of finding an opening in opponents defense and ending the round with a single, clean hit. Gone are the tedious hit points – each scratch impairs your movement, every wound might be your last.\nGameplay\nOur goal was to make fighting games accessible to anyone. An intuitive set of basic abilities allowed us to remove the need for memorizing inputs and move-lists, while retaining the complexity. Moves can be canceled to feint an attack, hits can be parried or dodged, and they can clash with one another. This creates a mind-game heavy gameplay, one that mimics real samurai showdowns\nCharacters and Stages\nYou can play as one of 8 characters, all with their own stories and unique fighting styles. Game’s cast offers many variations of gameplay, from a swift monk using only his fists in battle, to a muscular lady with a giant sword that compensates speed and mobility with endurance during her attacks.\nFights take place in alternative version of Japanese underworld and features 6 unique stages with hand-drawn textures.","imageUrl":"https://media.rawg.io/media/screenshots/739/7393f23d69fd5551957e1dac986fd001.jpg","releaseYear":2017,"developer":"Arc System Works","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":9573,"name":"Tuebor: I Will Defend","genre":"Action","price":0.0,"description":"Defend, conquer, and survive against hordes of mutants, cyborgs, and ruthless artificial intelligence systems in the post-apocalyptic dystopian future. Play cooperatively as a legendary hero in this 3rd person choose-your-own-adventure, cyberpunk inspired online RPG.\nTuebor is a cross-genre 3rd person MMO-lite. Tuebor blends elements from MMO, RPG, FPS, and MOBAs into a single cohesively fun game. Players choose their favorite character and jump into high action PvP arenas or Cooperative PvE challenges.\nTeam Death Match PvP, Last Stand PvE, Capture the Flag, MMO-style Battlegrounds PvP, or our E-Sport Skull Ball will delight fans of any genre.\nSkull Ball\nMire's Lockup, Caldera, and Factory J-03 are the 3 game-launch e-Sports maps as part of the Skull Ball game mode.\nCompete in teams of 4v4 to take out your opponents, gain Skull Power, and score goals to win\nThe Skull Ball arenas are designed to excite and challenge the players, some with deadly consequences.\nDeath & Glory\nLava Flow is the first of Tuebor's Death & Glory modes which features a 6 player Co-Op.\nTeam up to defend Facility H50-TD against waves of increasingly difficult enemies from freeing the \"Experiments\", building up to 3 unique and exciting boss fights, and culminating in a near impossible to beat final last stand.\nCapture the Core\nNew Detroit and Skull Chasm are Tuebor's Capture the Core maps.\nTeam up in groups of 8v8 in this new spin on a familiar game mode. The teams are trying to power up their reactor by grabbing misplaced power cores in the heart of New Detroit, or throughout the Skull Chasm.\nProtect the power core carrier to gain a speed boost, or be on the offensive to keep the other team away in this nail bitingly exciting game mode.\nTry not to get too lost in the beautiful cityscape or chasm vista, as defeat is only a heartbeat away.\nTeam Annihilation\nDrain Pipe and Power Run are Tuebor's Team Annihilation maps.\nFight for victory, honor, and bragging rights in our take of an intense 8v8 classic team death match.\nTranslocate in with your squad and defeat the opposing team before time runs out.\nChoose your teammates wisely, as team composition counts, and your opponents will not be kind.\nCore Breach\nOverpass is Tuebor's Core Breach flagship map.\nIn the Core Breach game mode, 16 players will take on the 8v8 challenge of fighting through central map objective points in order to gain an edge on the other team and complete the ultimate goal of destroying the opposing reactor core.\nPlayers must first choose their paths to victory while taking on hostile NPCs, or going head-first into the other team.\nCore Breach is a revisioning of classic MMORPG battlegrounds blended with a MOBA-lite feel.","imageUrl":"https://media.rawg.io/media/screenshots/5cd/5cdac5487d429ca78918a55efcb996bc.jpg","releaseYear":2016,"developer":"Strength in Numbers Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5352,"name":"Patapon","genre":"Action","price":0.0,"description":"Stay on beat and win the battle in IGN's 2008 PSP® Game of the Year!\nFor years the Patapon™ tribe has lived in the desolate frontier, driven from their home by the evil Zigoton army. They wait for the day that the Great Patapon™ will return, to lead them against their enemies and bring them back to their homeland.  Grab your war drums and lead them to victory!\nKey Features\n•\tMaster up to six different drumbeats to command the Patapon troops to march, attack, defend, power up, retreat, and use magic.\n•\tBuild up the Patapon army and position them correctly for battle.\n•\t30+ Missions to play\n•         5 music-based mini-games\nPatapon is a trademark of Sony Computer Entertainment Inc. © 2008 Sony Computer Entertainment Inc. © 2008 Rolito/Interlink.  Use of this item is subject to the PlayStation®Network Terms of Service/User Agreement.  If you do not wish to accept these terms, do not use this item.","imageUrl":"https://media.rawg.io/media/screenshots/a73/a73ce51bff960a92a7e810db7bf4fb89.jpeg","releaseYear":2009,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"}]},{"id":5170,"name":"Gex","genre":"Action","price":0.0,"description":"Gex is a side-scrolling platformer that follows the title character Gex, an anthropomorphic, television-obsessed gecko who must travel through the \"media dimension\" and defeat the game's antagonist, Rez.","imageUrl":"https://media.rawg.io/media/screenshots/685/6857c3f9110d1176cb74ad428ab32f1b.jpg","releaseYear":1995,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"3DO"}]},{"id":918,"name":"Carnival Games VR","genre":"Simulation","price":0.0,"description":"Step right up and play the game where everyone’s a winner!  From the creator of Carnival Games, Cat Daddy Games and 2K bring the fun and entertainment from this successful franchise into virtual reality.\nCarnival Games VR brings an all new immersive virtual reality experience, allowing you to explore the park, interact with patrons and play up to 12 different games!  Enter a themed Carnival Alley where you can play a game and earn tickets for fun virtual prizes or unlock another game. Whether it’s scaling a castle in Climbing Wall, rolling for a high score in Alley Ball or shooting basketballs in Swish – there is something for everyone.A Carnival Game for EveryoneWith 12 carnival games, there is something for everyone.  Whether you wind up and throw baseballs in Golden Arm, shoot basketballs in Swish, test your aim in Shooting Gallery or scale a castle from great heights in Climbing Wall - there are a variety of exciting games to play!Interactive EnvironmentImmerse yourself in the carnival atmosphere where the Barker keeps you on your toes, you interact with the park patrons, navigate through four Carnival Alleys with unique playroom themes, from the Cowpoke Corral to the Wizard’s Walkway.Earn Prizes, Unlock GamesComplete a game and collect tickets for fun virtual prizes, along with unlocking more game modes at the Prize Booth! All prizes are held in a Play Room where you can unlock unique achievements.A Great Party GameDid you get a high score? Challenge your friends and see who can earn the top spot of the online leaderboard.","imageUrl":"https://media.rawg.io/media/screenshots/8e7/8e71b046d40b6c4f4e38053fb192e591.jpg","releaseYear":2016,"developer":"2K","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":440,"name":"Knee Deep","genre":"Adventure","price":0.0,"description":"When a washed-up actor hangs himself on location, a spotlight is cast on the backwater Florida town of Cypress Knee. Your screen becomes a stage on which you investigate this mysterious suicide as three distinct characters: cheeky blogger Romana Teague, down-and-out local reporter Jack Bellet, and cynical private investigator K.C. Gaddis.\nExperience a magical reality where characters are transported among scenes, set pieces moved into place, and music wafts from the orchestra pit. Knee Deep is about characters, storytelling, and the melodrama of swampland Florida.\nUncover a swampland conspiracy—Use your skills of observation, deduction, and cleverness to pull back the curtain and reveal the true story behind this backwater community.\nDynamic storytelling spotlights choice and consequence—Engage in realistic conversations that evolve based on your choices, but beware as critical decisions could lead to a breakthrough...or someone getting hurt.\nGaming goes to the theater—Vivid voice acting, imaginative set transitions, and melodrama specifically designed for the digital stage\nA swamp noir adventure in three acts—enjoy the entire season with all three acts available now!\nNEW - Step even closer to the peformance with Tobii EyeX integration! Affect lighting on actors, have them turn to acknowledge your presence, and affect menus and minigames all with the effortless movement of your eyes. Requires Tobii EyeX hardware.\nNEW - Take the best seat in the house with Knee Deep now supported in VR on Vive and Oculus! Existing users will have immediate access to VR content and new customers will receive both the original and VR versions of the game.","imageUrl":"https://media.rawg.io/media/screenshots/152/15291bad326bdbd1cf9b06948a31bfc0.jpg","releaseYear":2015,"developer":"Wales Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":894577,"name":"Melatonin","genre":"Action","price":0.0,"description":"Melatonin is a rhythm game about dreams and reality merging together. It uses animations and sound cues to keep you on beat without any intimidating overlays or interfaces. Harmonize through a variety of dreamy levels containing surprising challenges, hand-drawn art, and vibrant music.\nMelatonin explores the relationship between the dreams we have when we’re asleep and the experiences we go through when we’re awake, through unique rhythm game levels. Hand-drawn in a colorful and detailed visual style, with music produced to flow hand-in-hand with the gameplay and visuals, you will piece together elements about the main character’s life as you dive deeper and deeper into their dreams at night.Features\nDiscover over 20 dreamy levels spread across 5 chapters, with every level introducing a new song.\nUnlock a Hard Mode that will truly test your rhythm.\nMake the rhythm game level of your dreams with an easy to use Level Editor.\nUse Practice Mode to guide you through each level.\nTry out plenty of assist features if you’re feeling lost.\nAlso fully compatible with the Steam Deck and incudes a color mode calibrated for the Steam Deck's screen.","imageUrl":"https://media.rawg.io/media/games/f98/f98fccb1d2870efd911b189b03496016.jpg","releaseYear":2022,"developer":"Half Asleep","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":710407,"name":"Sanabi","genre":"Action","price":0.0,"description":"You, a legendary retired veteran, are called upon for one last operation: to ascend a mega-city ruled by a corrupt conglomerate. You were chosen for this mission because of your signature chain-hook prosthetic arm and the ability to maneuver and quickly defeat enemies. The mission: to hunt down a mysterious entity known as “SANABI” and uncover corporate secrets hidden deep within the city.\nAn exhilarating platformer\nYour giant chain-hook prosthetic arm acts as both a method for quickly maneuvering around and also a way to swiftly take out your opponents. With your legendary skills, you are capable of using your prosthetic arm to jump over cliffs and skyscrapers, dash through bullets and traps and defeat powerful enemies. It's time for you to come back out of retirement for one last mission.\nA beautiful yet mysterious cyberpunk dystopia\nMega-city “MAGO” is a high-tech city ruled by a corrupt conglomerate… at least, that’s what it was 24 hours ago. After a sudden blackout, all of its citizens mysteriously disappeared and the city was left in total chaos. It’s your mission to explore the depths of the city and uncover what happened.\nMari, the hacker prodigy\nA brilliant hacker and drone rider you meet during your mission. Mari can open locked doors, reveal enemy weaknesses and uncover encrypted information. Mari is lovely and reliable, but maybe just a little too chatty. Who knows though, this girl might be the key to finding SANABI.\nJoin our Discord Community!","imageUrl":"https://media.rawg.io/media/games/8fd/8fddf3eec9b26d7d40965d57da53cce0.jpg","releaseYear":2023,"developer":"SANABI","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":605543,"name":"Phantom Abyss","genre":"Action","price":0.0,"description":"Phantom Abyss is a massive asynchronous multiplayer game that casts players into procedurally-generated temples and tasks them with retrieving the sacred relics hidden within deadly chambers. Intrepid adventurers will dodge scores of hidden traps, leap treacherous chasms, and flee relentless guardians through branching paths until one of the relics are claimed or the devices of death overwhelm them. Be warned, you only get one attempt at each temple and failure or settling for a lesser relic means you will never see that temple again...\n\nThe cleverest players will use the phantom runs of failed attempts from other players to their advantage and avoid the missteps and mistakes that led to their doom. Once the legendary relic at the bottom of each temple is found, the temple goes away forever and becomes the priceless trophy of the skilled adventurer.\nAsynchronous Multiplayer\nExplore the perilous halls and colossal rooms of each temple alongside the phantoms of fallen players that came before you and use their successes and failures to your advantage to progress deeper than they ever could have hoped. Watch and learn from the mistakes of up to 20 phantoms including your Steam friends that have attempted the same temple and steal their whips as they fall.\nUnlock More Treacherous Floors\nRecover keys from chests to unlock deeper, deadlier sections of the temple that house more coveted relics. The more difficult a relic is to obtain, the greater the reward - the final Legendary Relic of a temple allows you to claim the whole temple so that it's gone forever.\nBlessings from the Gods\nAs adventurers venture further into a temple, offerings of collected treasures can be made at alters to gain a new blessing for the rest of the run. Collect as much treasure as you can to please the gods and gain a double jump, glide jump, extended slide, damage protection, and more!\nUnlockable Whips\nUnlock new whips with success and choose from your collection before venturing into your next run. Each whips carries a minor blessing but also a curse that may complicate your attempt at riches and glory.\nSocial Connections\nPlayers can share Temple Codes for their failed runs allowing friends to attempt the same temple or share their Adventure Code which yields a playlist of temples that player has attempted in the past.","imageUrl":"https://media.rawg.io/media/games/5f6/5f6c1c1c96a1f5de179db6b28bc3cbd3.jpg","releaseYear":2024,"developer":"Team WIBY","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":586197,"name":"Happy Game","genre":"Adventure","price":0.0,"description":"Add Happy Game to your GOG wishlist now!\r\nA little boy falls asleep to a horrible nightmare. Can you make him happy again?\r\nBrand new psychedelic horror adventure from the creators of Botanicula and CHUCHEL\r\nEndure and escape three unforgettable nightmares\r\nSolve deeply disturbing puzzles in (not so) charming environments\r\nDeal with suspicious smiley faces and pink bunnies\r\nCreepy songs and screeches from the Czech freakfolk band DVA","imageUrl":"https://media.rawg.io/media/games/751/75127366e445a0f6bbb730b3af6e7a7f.jpg","releaseYear":2021,"developer":"Amanita Design","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":586124,"name":"Retro Machina: Nucleonics","genre":"Action","price":0.0,"description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1127970/Retro_Machina/\nAbout the GameOnly one city remains on the planet, and it’s only robots who inhabit it now. Protected by a glass dome, Endeavor rises above the once lively area and worker robots are trying their best to keep it going. In order to maintain it, every robot has to do its job perfectly and any imperfections found are being discarded.\nThrown to a junkyard for a malfunction, a single robot worker is on a quest to get itself fixed. But the city sees this loyal worker as a threat now, so all the robots and defenses that protect Endeavor have turned against their former colleague. With the unique ability to control various machines of the city, including any robots that are in the way, this little Robot is on a mission to fix himself and find intelligent life.\nYet it seems that there is no intelligent life left. Only the robots programmed to keep the city nice and clean for people who are nowhere to be found.\nYou are on your ownLong ago humans vanished leaving behind only their robotic creations. Now the world they left behind is falling apart. Is there anyone out there to help you fix it and discover what happened to the people who used to live here?\nYour enemies are your toolsAlone in the world, the little robot has a special trick up his sleeve: the ability to hack and gain control of any other machines. Use them as you like: you can make them fight each other, explore unreachable places, solve puzzles, or just accompany you in your journey. There are dozens of robots with different abilities for you to explore.\nEnjoy hand-drawn visualsThe art style of Retro Machina is based on illustrations from the science fiction books of the twentieth century. Set in the retro-futuristic universe, the game is inspired by the work of such legendary people as Jacque Fresco, one of the most famous futurists in the world.\nExplore the multifaceted worldFrom underground facilities to the golden streets of Endeavour, the last city on the planet, your journey will take you across a whole region filled with new challenges, new robots, and mysteries to explore.","imageUrl":"https://media.rawg.io/media/screenshots/50a/50a1a73d455a274e96e187b3c543d3c7.jpg","releaseYear":2021,"developer":"Orbit Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":523169,"name":"NEKOPARA Vol. 4","genre":"Adventure","price":0.0,"description":"STORYDespite the popularity of Kashou Minaduki's patisserie, \"La Soleil\", his father continues to disapprove of it.\nSeeing how troubled Kashou was, Shigure offers up a suggestion as a change of pace.\nA hot springs trip with Chocola, Vanilla and the other catpanions.\nWith Azuki and Coconut's encouragement,  Kashou is determined to confront his father while Maple and Cinnamon suggest a trip to France\nto seek advice from the teacher who taught him his craft.\nBut why is Shigure also tagging along!?\nAn encounter with a new catgirl in France...\nThis story is a heartwarming cat comedy about the growth Kashou experiences\nthrough his catpanions and the bonds with them and his family... with a little ecchi on the side, too.FEATURESBeautiful artwork and designs from creator, Sayori\nOpening song, \"SWEETxSWEET\" sung by KOTOKO\nAnimated characters sprites bring the characters to life\nFull Japanese voice acting (except for protagonist)\nEnglish, Traditional Chinese, Japanese text options\nCG Gallery Mode","imageUrl":"https://media.rawg.io/media/games/a0b/a0b4974a8ab14a36ed1fcf607e583fd9.jpg","releaseYear":2020,"developer":"NEKO WORKs","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":513920,"name":"Deadswitch 3","genre":"Action","price":0.0,"description":"Deadswitch 3 is an action packed fast-paced 2D multiplayer shooter.RANKED PROGRESSIONProgress through the ranks by earning XP in-game by killing enemies, scoring objectives, and completing challenges. Unlock new weapons, attachments, perks, and killstreaks to help you achieve victory in combat. Play solo or team-based game modes with other players online, or play local games against bots to hone your skills.OBJECTIVE-BASED MISSIONSPlay solo or team up with a friend to complete objective-based Operations. Turn up the difficulty to earn Operation Stars and other rewards. Decide on the best strategy to complete each mission; go in loud or use stealth as your friend.CO-OP SURVIVALPlay one of many Survival modes and last as long as you can against endless waves of terrorists, helicopters, zombies, and other creatures. Submit your score in the worldwide leaderboards.KEY FEATURESMultiple game modes and maps\nMassive selection of weapons, attachments, and equipment\nFully customizable characters\nRanked matches and multiplayer clans\nCustom classes and killstreaks\nIntense fast-paced gameplay","imageUrl":"https://media.rawg.io/media/screenshots/d17/d177d130ff350fc5cee6d51345d397e0.jpg","releaseYear":2020,"developer":"Wilkin Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":404502,"name":"Darwin Project","genre":"Action","price":0.0,"description":"BATTLE ROYALE & SURVIVAL\nDarwin Project is an intense 10 player battle royale which takes place in the snowy Canadian Rocky mountains. Players must first conquer the cold, crafting fires and warm clothing then find clues, lay traps, and hunt down the other contestants. To be the last inmate standing, players use combat, crafting, tracking, and their personality.\nESHOW : THE SHOW DIRECTOR TAKES CONTROL OF THE GAME\nIn each match, one player takes on the role of the Show Director who oversees the arena from above in a camera drone. The Director dashboard includes a suite of tools which allow them to give the underdog an unexpected edge or turn the tables on a particularly bloodthirsty contestant by summoning a gravity storm, restricting zones, or unleashing a Manhunt that reveals a player's position in the arena.\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nNetwork Players 2-11\n4GB minimum save size\nDUALSHOCK®4\nOnline Play (Required)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nDARWIN PROJECT TM © 2019 SCAVENGERS STUDIO. ALL RIGHTS RESERVED.","imageUrl":"https://media.rawg.io/media/screenshots/271/27190950ba1d581a92f94fefa41615c8.jpg","releaseYear":2020,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":353493,"name":"Hello Neighbor Pre-Alpha","genre":"Adventure","price":0.0,"description":"Good old memories, huh? This is a PRE-ALPHA VERSION of the famous Hello Neighbor.\nHello Neighbor is a stealth horror game about sneaking into your neighbor's house to figure out what horrible secrets he's hiding in the basement. You play against an advanced AI that learns from your every move. Really enjoying climbing through that backyard window? Expect a bear trap there. Sneaking through the front door? There'll be cameras there soon. Trying to escape? The Neighbor will find a shortcut and catch you.\nSuspenseful horror gameplay that focuses on sneaking around your neighbor's house\nConstantly evolving experience where the Neighbor's AI counters your moves, and learns from what you do\nSandbox-style gameplay with plenty of environmental interaction and physics","imageUrl":"https://media.rawg.io/media/screenshots/b93/b9399e47cbe7634ea7d04090d0d300f4.jpg","releaseYear":2019,"developer":"Dynamic Pixels","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":351027,"name":"Ranch Simulator","genre":"Simulation","price":0.0,"description":"Teaser # 1 On YouTubehttps://youtu.be/kyeR-yWHGFM\nAbout the GameYou inherited a ranch in the wooded mountains, which you can completely upgrade and customize.\nKey Features\nImproving and building your own ranch;\nFully open world;\nMany types of livestock and wild animals;\nHunting and protection of your territory from predatory forest animals;\nSeveral types of fully customizable vehicles;\nMini games\nRadio stations with great music;\nDay&Night cycle;","imageUrl":"https://media.rawg.io/media/screenshots/a65/a65074b56c47ae8d88354096a3198c84.jpg","releaseYear":2021,"developer":"Toxic Dog","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":349399,"name":"Snowtopia","genre":"Strategy","price":0.0,"description":"Welcome to Snowotpia, an hivernal world that lasts forever full of relaxing activities.\nTame the mountain and build the ideal ski resort on top of it. Answer the needs of skiers who always want more and better. Adapt the tracks so they can enjoy their stay.\nThe objective is simple: make it the nicest play to live. Do you want to take this challenge?BUILD\nBuild a skiiable mountain starting from the grounds up. Shape up the world of Snowtopia as an ideal world. Manage the resort with the support of the community who is populating your resort. Make sure everyone get a place and happiness in this utopian, wintery world.MANAGE\nIt won’t be easy to build the ideal ski resort. Dozen of skiers coming to Snowtopia have different needs and wishes. Some want an authentic, small station, while others want something competitive and working all year round. Answer those puzzling challenges and collection all skiers profiles.PERSIST\nThe mountain is huge and it’s not with only one station you’ll be able to collect all skiers profiles. Once your challenge is over, get onto the next! Climatic conditions, selected profiles and availables resources will vary. The mountain can be a friend or provide hard challenges.","imageUrl":"https://media.rawg.io/media/screenshots/00f/00f4bad2385fd3c1143294b9fc76af20.jpg","releaseYear":-1,"developer":"TeaForTwo","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":316856,"name":"Half-Life: Before","genre":"Action","price":0.0,"description":"Half-Life: Before – is a modification for Half-Life with new levels and story. Mod is based on Spirit of Half-Life 1.8 technology, that increases visual and functional component of the mod.\nYou're playing as a Black Mesa scientist Andrew Winner. Your mission is to enter another world to find an artifact that will allow Black Mesa scientists to open portal in another world.Features Intense action\nSet in Half-Life universe\nHigh quality soundtrack\nSpirit of Half-Life technology to enhance visuals\nHigh definition models","imageUrl":"https://media.rawg.io/media/screenshots/ca3/ca3332dd31d281619750181122312893.jpg","releaseYear":2009,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":313764,"name":"Neptunia Shooter / ネプシューター","genre":"Action","price":0.0,"description":"Story\nArmed to the teeth, players begin as Neptune in an unworldly 8-bit space dimension ravaged by creatures who burst endless waves of bullets. Shoot, dodge, and defeat the boss in six unique bullet-hell worlds. After defeating each boss, they will join your mission, allowing you to switch characters and utilize their unique shooting abilities. Neptune and her friends must traverse through this shmup space dimension and defeat the last boss once and for all!Key Features\nShmup It Up – Progress through six 8-bit inspired shoot ‘em up stages as enemy dogoos spew out an array of bullet-hell attacks in this 8-bit dimension!\nWho Will Claim Victory? – With Steam online leaderboards, bullet-hell fans everywhere can now stake the claim as the best Neptunia Shooter player in this dimension! Challenge your friends and see who gets the higher score in six different levels!\nChoose Your Ammunition! – Start your shmup adventure as the self-proclaimed protagonist, Neptune! At the end of each level, you face off a Goddess boss, who joins your party after defeating them. Switch between six possible characters on-the-fly and utilize each of their unique bullet-hell patterns to defeat the evil space dogoos and the final boss!\nBroadcast Your Skills – With the Steam Broadcasting feature, you can show off your shoot ‘em up and dodging skills to the whole world!","imageUrl":"https://media.rawg.io/media/screenshots/cd2/cd23903a4a1fbb208ad57567ce4d48bf.jpg","releaseYear":2019,"developer":"Idea Factory","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":62076,"name":"LUNA The Shadow Dust","genre":"Indie","price":0.0,"description":"To light the candle is to cast a shadow.\nBehind the veil of reality, lies an enchanted world. When the world lost its balance, it fell upon a boy to take on an unexpected journey. Until the moon rises again, the order of the world will not be restored. One cannot go back in time to correct his mistake. Whatever happened is irreversible…or is it?\nTogether with our main character and his mystery friend, players will experience a unique adventure that requires both courage and determination. Enter the ancient tower that stands at the edge of world, help the character bring back his lost memories and find out the darkest secret beyond the tower itself.\nLUNA - The Shadow Dust is a story driven point & click adventure puzzle game\nGame Platform:\nThe game will be available on PC / MAC / Linux.\nIts mobile version will be available on iOS and Android\nTraditional frame by frame character animation\nWho can resist not using this time consuming, expensive and bonkers animation technique in a game?! People might say we are crazy. We agree.\nSingle player mode with Dual character control\nHow many things can go wrong when you need to control 2 characters at the same time? Yes, a LOT. But double the difficulty means double the fun... and... double the difficulty.\nThink outside of the box of the box\nIn order to solve the puzzles, not only your logic will be challenged but also your reaction speed, music sensibility and, most importantly, your imagination.\nLESS reading, MORE cinematics\nWe replaced the dialogue system with a series of stylized cinematic animations. No matter where you're from, human or Martian, you will have fun playing this game!\nInteractive Original Music\nWe are so serious about the music that our musician has sold her soul to the game music devil.","imageUrl":"https://media.rawg.io/media/screenshots/f17/f1778f9beecf47e06f76875cec757428.jpg","releaseYear":2020,"developer":"Coconut Island Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":60539,"name":"Perfect Heist","genre":"Action","price":0.0,"description":"Perfect Heist is a round-based game, where 2 teams (cops vs robbers) try to execute/prevent the perfect bank heist. Includes an offline tutorial and an online mode to play with friends and strangers.\nA team of robbers is trying to infiltrate a bank, steal as much money as possible and then get away with their helicopter, while the cops are trying to identify the robbers in a crowd of NPCs and prevent the heist from happening.\nFeatures:\ntwo different teams (cops and robbers), each with different classes that offer unique abilities\nmultiple maps, that can be changed with a map vote\nrobbers can choose from a variety of masks, with each one offering different bonus stats\ndifferent, unique weapons like SMGs, shotguns and sniper rifles\nsupports player server hosting as well as dedicated servers\nsettings menu that includes full keybinding menu\nThe robbers have to blend in with a crowd of NPCs to not get shot by cops, while somehow smuggling explosives inside the bank, stealing money, and then getting away with it. They have a variety of options to pull off the perfect heist, for example, they can:\nkill NPCs and use their clothing as a disguise\nhack ATMs to get money\nsmuggle a bag of explosives inside the bank, and blow up one of the money vaults\nsteal money and jewelry\ncall in a rescue helicopter and get away with the money\nequip masks, that give away their identity as robbers, but give them bonus stats at the same time\nThe cops can access security cameras to monitor the bank, and use their unique abilities which include checking IDs, thermal vision or placing new cameras, to identify the robbers and then overwhelm them in a shoot-off.","imageUrl":"https://media.rawg.io/media/screenshots/248/248a6fcc90021809ac5dd95d3631ffa1.jpg","releaseYear":2018,"developer":"yeswecamp","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":57840,"name":"Tekken (1994)","genre":"Fighting","price":0.0,"description":"Tekken is a fighting video game developed and published by Namco. It was released in arcades in December 1994 and on the PlayStation in 1995. It was the first entry in the popular Tekken series, succeeded by Tekken 2 in August 1995. The arcade game features eight playable characters, while the PlayStation version features 17 playable characters in the roster.","imageUrl":"https://media.rawg.io/media/screenshots/18f/18f3ef9aa2b8ed7047a1ee46abcb8228.jpg","releaseYear":1994,"developer":"NAMCO","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation"}]},{"id":54303,"name":"Samurai Shodown","genre":"Fighting","price":0.0,"description":"Samurai Shodown (Samurai Spirits in Japan) is a fighting game series by SNK. In Japan, the name of the series is officially in katakana, but is often written in kanji (侍魂, samurai tamashii), with the second character pronounced supirittsu, \"spirits\", to better reflect the game's setting.","imageUrl":"https://media.rawg.io/media/screenshots/97c/97cd94d7d6d89a12ed562d3a4e40c4a5.jpg","releaseYear":1993,"developer":"Arc System Works","libraryGames":null,"platforms":[{"id":0,"name":"Game Gear"},{"id":0,"name":"3DO"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"Xbox One"},{"id":0,"name":"SNES"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Genesis"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy"}]},{"id":46488,"name":"Otaku's Fantasy","genre":"Adventure","price":0.0,"description":"パッとしない派遣社員生活を送る主人公。\nこれが最後とあてがわれた仕事は、\nなかなか人が定着しないという清掃会社だった。\n覚悟を決めて行ってみると、タイミング良く\n超有名インテリジェントビルの仕事が入ってきた。\n行ってみると、そこは予想以上に眩くきらびやかな世界……\n超一流企業のOLに、有名タレント、テレビキャスター。\nレジデント棟には、セレブなマダムにもいる。\nあまりの世界の違いに圧倒されキョドってしまう主人公。\nしかしある日、そんな主人公を見てなぜか\n「可愛い～」という有名タレントに、テレビ局の楽屋で\n「ねえ、おち○ぽ出してみて?」\nと頼まれて、戸惑いながらも出して咥えてもらって、\n口の中で溜まりに溜まった迸りをぶちまけると\n翌朝にはそのデカチンと射精力がビル内の美女に知れわたっていた!?\n金とヒマを持て余してたり、ストレスを溜め込んでたり、\n単に自由奔放だったりと、理由はさまざまだけど、\nみ～んな、溢れる性欲を持て余した「オンナ」たち。\n手近で後腐れなくそれを解消できるとなれば、もうその勢いは止まりません!\nユルい言動で有名な美人ハーフタレントは、お股もユルユル!?\nテレビ局の夜の顔、知的キャスターの裏の顔はドM処女。\nベンチャー企業のヤリ手女性経営者は、セックスもヤリ手!?\n超一流企業のお堅い美人OLも、ストレスと肉欲を溜め込んで…。\nさらには完成したオンナの肉体を持て余すセレブ妻まで加わって…。\n突如として、チ○ポが乾く暇も無い毎日に!\n主人公は、はじめは\n単なる好奇心と男根目当てのオンナたちに翻弄されながらも、\n徐々にそのデカチンと射精力で、オンナたちを性の虜にしていきます。\nここは、夢にまで見た\n好きなだけ種付けセックスして、みんなに喜ばれる世界!!\n○スタッフ\n・原画　　:長頼\n・シナリオ:軍艦寺眞彦\n●ジュリア\nCV:綾奈まりあ\nゆるゆるのハーフタレント\n22歳　黙ってれば美人だけど、口を開けばまるで幼稚園児のようなゆる～い発言で人気のハーフタレント。\n\n●日向綾音　[ひなた・あやね]\nCV:大山チロル\n知的美人キャスター\n26歳　経営者家庭に育ったお嬢様で、3カ国へ留学経験あり。\n今は夜のニュースの顔として全国的に知られていて、\n子供の頃から、男に言い寄られること数知れず。\n●月村真紀　[つきむら・まき]\nCV:森野めぐむ\nヤリ手女性経営者\n29歳　外資系コンサル企業出身で、起業して4年で一気に上場させてしまったやり手経営者。\n●篠田花絵　[しのだ・はなえ]\nCV:天川みるく\n一流企業のお堅いキャリアＯＬ\n24歳　田舎のお嬢様学校から誰もが知る超一流企業に入り\n周りのレベルの高さに焦りつつ、日々頑張っている才女。\n真面目でお堅い印象だが、本来性欲は強め。\nでも、いまはそれどころでは無いと必死に抑え込んでる。\n●白木響子　[しらき・きょうこ]\nCV:蒼紗\n大人の余裕セレブ妻\n28歳　オンナとして完成した肉体の持ち主。\n有名なベンチャー経営者である夫は多忙でほとんど帰宅せず。\nその欲求不満をオナニーで紛らわせている。\nキャスターとは姉妹のように過ごしていた頃もある昔なじみ。","imageUrl":"https://media.rawg.io/media/screenshots/573/573386cef37a0724ca2e7089afde8645.jpg","releaseYear":2017,"developer":"Dieselmine","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":35183,"name":"Driv3r","genre":"Action","price":0.0,"description":"In 1999 it was Driver, in 2000 it was Driver 2. Having won game of the year awards all across Europe and the US, and collecting an interactive BAFTA, now the groundbreaking 3d action driving game is back.\n\n- Over 70 playable vehicles, including cars, bikes, boats, artics, and buses.\n- 8 different weapons, including handguns, machine guns and grenade launchers.\n- Over 30 story integrated missions.","imageUrl":"https://media.rawg.io/media/screenshots/ae8/ae873a8c989c0ac9a7887d7cdffd0e79.jpg","releaseYear":2004,"developer":"Ubisoft Reflections","libraryGames":null,"platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":30891,"name":"Balls of Steel","genre":"Simulation","price":0.0,"description":"The Balls are Back! The legendary 90s pinball game Balls of Steel returns to PC in all of its radical retro glory. Play through 5 classic top-down pinball tables: Darkside, Barbarian, Firestorm, Mutation, and Devil's Island. Not only that, we've added two BRAND NEW tables in classic BoS Style: Centipede, and Missile Command! Get 7 awesome retro tables in one package!Features:\nEnjoy 5 Classic BoS tables: Barbarian, Darkside, Firestorm, Mutation, and Devil's Island, rebuilt to run on modern PC hardware!\nPlay 2 brand-new Atari-themed tables: Centipede and Missile Command. Enjoy the retro ambience while you fight back bugs and waves of incoming missiles.\nKeyboard, gamepad, or mouse controls let you play the way you want.","imageUrl":"https://media.rawg.io/media/screenshots/521/5219148b16076e8a91e31810939f52f9_fOOD40g.jpg","releaseYear":1997,"developer":"Big Boat Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":30319,"name":"Chaos Control","genre":"Action","price":0.0,"description":"Chaos Control, a super-production designed entirely on Silicon Graphics, takes you to the heart of a fantastic epic that blends cyberculture, virtual travel and manga graphics. At the controls of a space fighter, your dangerous missions will lead you into a unique spectacle with multiple, fantastic sets in full screen 3D vision.\nIt's the year 2071. Only one space fighter has the courage, composure and razor-sharp reflexes to eliminate the savage Kesh Rhan Extraterrestrials...ace pilot Jessica Darkhill. As Lieutenant Darkhill, your missions encompass heart-stopping battles in four distinctly different, full-screen synthesized universes. Your destiny - to save EARTH.\nFirst you must liberate Manhattan. If you succeed, enter the core of a virtual reality computer to neutralize a lethal virus. Then soar to outer space to destroy the enemy's well-fortressed flagship. Finally, master a fearsome labyrinth of traps to greet and beat your nemesis, Lord Commander Arakh' Kreen.\n• More than 60 minutes of computer-generated animated images.\n• Real piloting sensations due to the movements and the non-linear travel of the vessels involved.\n• Total immersion into the game enhanced by hyper-realistic sound effects.\n• A grandiose sound track consisting of original titles using the stereo effect, CD quality.\n• Combat sequence in Manhattan: the island has been entirely recreated in 3D, modeled with 2 million polygons.\n• Use of three travel modes: basic model space fighter, virtual mode inside a tank, prototype fighter considered as the ultimate weapon.","imageUrl":"https://media.rawg.io/media/screenshots/65b/65b2c1358dea7231644a32e07917ad6e.jpg","releaseYear":1995,"developer":"Infogrames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28056,"name":"Disco Time 80s VR","genre":"Simulation","price":0.0,"description":"Its Disco Time.\nThe 80s are back!\nEnter the Dancefloor and celebrate an 80s club party in VR.\nFeatures\n18 80s Style Music Tracks or use The InGame YouTube Browser\n3 Clubs + Miami Style Street with entrances to the clubs\nInteraction: Ask a Dancer for a dance, you can choose between 20 dance styles\n7 Various effects like Slow Motion, Neon, Fog, Alcohol, Drawing and more\nFun Games like Dart, Bowling, Mini Basketball, Pool Billiard and Arcade Machine\nTeleportation and Free (Slide) Locomotion VR","imageUrl":"https://media.rawg.io/media/screenshots/220/220351fb5c12f389d180dc2bcb22dac0.jpg","releaseYear":2017,"developer":"Indiecode Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]