[{"id":9665,"name":"Machine Hunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f4/3f4755b5d23415e934e37125359ed49a.jpg","description":"WHAT IS MACHINE HUNT?\nMachine Hunt is a first person, fast paced, chaotic shooting game that is aiming to bring you the old school fun feeling.\nGame pits heavily armed players against machines that have only one goal, destroy humanity.\nSETTING\nThe world of machines is dark, violent and grim. They will not stop until all humans are dead.\nTHE PLOT\nWhen an advanced weaponry base goes dark, George Flow is sent in to check things out.\nWhen boarded the transport carrier, the mention of advanced weaponry development, brought back flashbacks. Flow remembered the day many years prior, when he was at school. He remembered sitting in the office and staring outside the window for his parents to arrive. He remembered waiting and watching and no one ever showing up.\nLikely one of the most devastating sights was that of a police car driving up to the school. Its pace was slow. All George remembered was pain. His parents were dead. Gone forever. It felt surreal at the time.\nHis father had been presenting newest and most versatile combat robot to date. The real achievement of Artificial Intelligence.\nThe machines had rebelled during the demonstration. They'd killed everyone.\nThe carrier finally landed.\nEverything  seemed quiet and calm. One thing in particular. No people.\nFEATURES\n- 1104 Achievements\n- CAMPAIGN MODE\n- SANDBOX MODE\nMACHINE HUNT is still in development, there are a lot of things we plan to add to enhance a game and give you maximum pleasure and fun.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Racing Bros","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":5117,"name":"Metal Gear Solid: Portable Ops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f1/8f1f952157c743736e4059415492bb3d.jpg","description":"Snake has appeared on PSP twice already, thanks to the classy Metal Gear Acid series of card battling games, but Metal Gear Solid: Portable Ops is the first time the classic gameplay of the more established Metal Gear Solid series has been available on the format.\nFollowing on from the epic events of Metal Gear Solid 3: Snake Eater (PlayStation 2), Portable Ops finds Naked Snake in South America, struggling to defuse a missile crisis triggered by his former unit, FOXHOUND.\nA new Metal Gear Solid adventure, designed exclusively for PSP\nPlay multiplayer matches via Infrastructure Mode\nImpeccable production values, including voiceovers from the cast of MGS3: Snake Eater","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PSP"}]},{"id":2530,"name":"ARCADE GAME SERIES: Ms. PAC-MAN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a73/a7339bb929707b4ace809ac3937606d0.jpg","description":"Developed in America and first released in 1981, Ms. PAC-MAN finally comes to Steam!\nMove Ms. PAC-MAN up, down, left, and right to eat all the Pac-Dots, while avoiding the ghosts, to advance to the next stage.\nEat a Power Pellet to turn the tables on the ghosts and rack up a huge score!\nThe basic rules are the same as PAC-MAN, but with an additional Warp Tunnel and other features, Ms. PAC-MAN truly shines as its own game!\nThis latest port comes with scanline and sound settings - perfect for Ms. PAC-MANiacs!\nWith her trademark ribbon, it's not hard to see the adorable charm of Ms. PAC-MAN!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":871182,"name":"Golden Light of Rose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84c/84cfbfaee24da4bafb3f1699f7bb430c.jpg","description":"Buy Full Gamehttps://store.steampowered.com/app/1245430/Golden_Light/\nAbout the Game\nWelcome to the Meat Zone. Prop Hunt where PROPS HUNT YOU.\nGolden Light of Rose is free ver. of the Golden Light - a procedural dark comedy horror game with roguelike elements and an eerie atmosphere. It features most of main game's mechanics with a unique BLOOD FLOWERS biome different from Golden Light!\nPlay as Rose – a character from the original game, and follow her during her first time in the gut.\nDive into new Blood Flowers biome with randomized weapons to fight various enemies and spooks!\nFind a secret LVL!👀\nhttps://store.steampowered.com/app/1245430/Golden_Light/","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Mr. Pink","platforms":[{"id":0,"name":"PC"}]},{"id":846466,"name":"Trail Out","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/03a/03ae69112888ee1c3f109a048422c9e7.jpg","description":"DISCORD CHANNELHead over to the TRAIL OUT Discord server.\n\nAbout the GameWelcome to the festival of explosive races, TRAIL OUT!\nYou're in for a mad race in different parts of the world, your main goal is to live to the finish line and take the main cup of the festival! Exploding cars, flying and screaming drivers, the hype from the fans, and unseen destruction around the entire track - it's all waiting for you here! Relive the story of racer Mihalych, a simple story where you'll try to take the main cup of the festival by defeating all the bosses in unique battles.\nYou are expected:\nUp to 40 cars in different classes, different eras, and different conditions\n45 different tracks, from big-city tracks with lots of destruction, derby arenas and to dangerous tracks with crossroads\n8 different modes including various race modes, derbies, stunts, and non-traditional game modes\nRunning on Unreal Engine 4, providing modern, customizable graphics and physics\nBoss duel system - Defeat them on their own turf in a race than a derby event with various dangers\nBuild cars from the ground up at the junkyard and improve them to perfection\nAcquire fans during races and by doing challenges to unlock additional cars\nSimplistic storyline with Mihalych, the main character, with in-game cutscenes\nPlay with up to 4 friends in Split-Screen\nAdrenaline licensed soundtrack\nGame updates that will provide additional content over timeDetails:\nGamemodes:\nCross - Race on tracks where halfway through you might encounter opponents coming the other way\nRush - Race on larger tracks where you have to fight your way to the finish line\nDerby Classic - Classic destruction derby - last one standing wins\nDerby Domination - Fight opponents to score points where the winner is the one with the highest score\nHunter - Destroy as many cars as you can, defeating your opponent's high score\nNo Time - Drive on a difficult section in time with special vehicles\nStunts - Various mini-games, such as, bowling, darts\nEscape - Escape the armed aircraft that destroys anyone in the last place\nDefeat the Blacklist bosses in a duel to move up the Blacklist. Defeat them in:\nCatch me up - A special race on tracks from the member's home turf\nDerby Duel - A one-on-one destruction derby, but we warned - they have brought backup!\nAbout the game:\nDamage the car to an incomprehensible piece of junk, with the possibility of losing wheels, flying out of the window, and even exploding\nBuilding cars from the ground up from parts at the junkyard, collecting licenses from the bosses as you advance through your career\nCar improvements, bodywork, engine, wheels, nitrous oxide, paint, license plates, and more\nAlter Mihalych's appearance and improve his garage during his journey\nPut up your records on a world leaderboard, such as lap times, props destroyed, and more\nPlay with up to four players in Split-Screen on either the same PC or via Steam Together\nWe're waiting for you on the roads of the TRAIL OUT festival! This will be your last ever festival!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"GOOD BOYS","platforms":[{"id":0,"name":"PC"}]},{"id":690708,"name":"Moncage","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/895/8957dba7dae9df357a1d43e71ae7bfe2.jpg","description":"Moncage a narrative puzzle game about optical illusions. It is a combination of gameplay and game narrative. You explore a cube in the game, and each face of the cube is a window into a unique world. Whether it’s peering into an old factory, a bedroom or lost island, you’ll need to connect the clues to solve the puzzle and unravel its secrets.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"X.D. Network","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":490877,"name":"Wordle","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b7/2b773b22852e28d503479afcb7381533.jpg","description":"Feature Listhttps://store.steampowered.com/app/1386730/Wordle_2/\nAbout the GameWordle - a word puzzle game. Find the words by moving the mouse among the letters represented. There are many thematic exercises to choose from and they smoothly increase the complexity of the puzzle. Work your head hard or use hints. Good game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"PreoNus Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":427946,"name":"No one lives under the lighthouse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b29/b2981c2f356e84eb335d406a0816a0f3.jpg","description":"One of these days you finally decide to take out the box with old CDs, mostly old games, covered with 10-year old dust. But you can't outstand the desire to look through all of them and prepare yourself for an hour full of nostalgia.\nWhile browsing them, one of the PC games you found there attracts your attention. You don’t remember this game being here. You neither remember buying or playing it.\nIt seems really old, something from the early '00s. The title says “No one lives under the lighthouse”.\nThe game description on the backside of the box seems to be poorly translated from some other language:\n\"You arrive at the old lighthouse on a small island near the coast of the United States. After the previous keeper has gone missing, you need to take over his duties and watch after the light. The member of the Establishment told you they'll get you an assistant after a week or two, but right now you're on your own.\nFeaturing:\nIsland exploration\nEnjoy the loneliness and ultra-modern graphics\nLook after the lighthouse, light the lamp at the sunset\nListen what seagulls speak to you\nNo words said\nDon't open the door that leads to the basement under the lighthouse\nNo one lives under the lighthouse\nThis sounds weird and disturbing. Game screenshots on the box look a bit uncanny. If this game wasn't so old you've probably decided it's another pretentious walking sim with horror elements.\nYou need to check it. The box with other CDs stays in the corridor. You spent at least an hour looking for your old laptop, as your current PC doesn't even have the CD port.\nInstall wizard completes and closes automatically in less than a minute. A text document named \"Instructions.txt\" opens immediately after that.\nInstructions.txt:\nThe keeper is responsible for the care and management of the light, and for the station in general.\nThe keeper is responsible for the careful management and expenditure of stores and supplies.\nA lighthouse must never be left wholly unattended.\nKeepers must be courteous and polite to all visitors who conform to the regulations.\nThe lighthouse basement should be locked up tight and not visited not by the keeper, nor anyone else.\nLights must be lighted punctually at sunset and must be kept burning at full intensity until sunrise.\nAll preparations must be made early, that there may be no delay in lightning.\nThe lens and the glass of the lantern must be cleaned daily and always kept in the best possible condition.\nThe keeper and his assistance, if he has any, should live in a house near the lighthouse. No one lives under the lighthouse.\n\"This doesn't sound like proper instructions for a PC game\", you think. So you don't bother closing the document and finally launch the game .exe file.\nWhat could go wrong?\nA word from developers:\nNo one lives under the lighthouse is a short experimental retro horror game made by 3 horror fans from indie game studio Sowoke Entertainment Bureau. We loved working on it, as it's a true experiment for us. We experimented with narrative and text usage, and we're sure some of the game scenes can surprise you. And will feel horrifying. Will you dare to go to the lighthouse basement?\nWe've also tried our best not to spoil all the best moments in trailers or screenshots, so [DATA EXPUNGED]\nIf you want some clear, non-atmospheric game features description, please look below.\nGame features:\nFrom 1 to 2 hours of playtime\nA horror mystery told almost without a single word\nRetro aesthetics\nMultiple endings\nAchievements\nWe hope you'll like the game!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"AnyaFR","platforms":[{"id":0,"name":"PC"}]},{"id":427726,"name":"Fake Lay","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb3/bb34cbb4859068864a980c41911ab848.jpg","description":"Fake your way to the perfect lay!\nDisguise yourself as a cab driver, casting agent, film director, masseur or any other job that can get the girls you meet to show you a good time!\nWatch what you say to keep them girls wet!\nMake your way to the top as a self-made Casanova!\nTrain your skills as a casting agent, film director, masseur and many other fake jobs that can help you score!\nFilm the girls and make money off your art!\nCharm the girls and get them to see things your way!\nTake them on fake dates, charm them with fake stories or try giving them a real massage if you can ;) If they buy into it, they’ll do whatever you tell them to!\nShoot professional films and build your adult empire!\nStay tuned for more locations/jobs to come!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Timeless SP","platforms":[{"id":0,"name":"PC"}]},{"id":320083,"name":"The Legend of Heroes: Trails of Cold Steel IV","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/207/207fa0efeaf7905cc93b98ca12bc9ea3.jpg","description":"The Legend of Heroes: Trails of Cold Steel IV THE END OF SAGA is the fourth and final installment to the Trails of Cold Steel saga. It is the concluding chapter of the Erebonian Empire arc.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Engine Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":302823,"name":"The Red Lantern","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4e/b4e3b233f67f7adbf5a431766bf6ad2a.jpg","description":"The Red Lantern is a rogue-lite, resource management narrative game where you and your team of 5 sled dogs, lost in the wilderness, must navigate the ever-changing events of the Alaskan bush to find your way home.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Timberline Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":284756,"name":"KUNAI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c7/0c7a35efcf5adbfda3636d4fa077f440.jpg","description":"A traumatic event has shaken the balance of the world.\nHuman life has mostly been wiped out.\nRobots roam free across earth.\nYou are one of them.A NINJA METROIDVANIA\nIn KUNAI, you take control of Tabby the tablet. An elite kunai wielding robot fused with ancient warrior souls.\nUse your KUNAI and ninja parkour skills to traverse the world of ruin, and find your true purpose in an immersive METROIDVANIA game world.\nEXPLORE a world filled with secrets, hidden passages and mysterious characters. Use your ninja mobility to reach places where no normal robot could ever go!\nFIGHT your way through armies of evil Machines, rogue androids and mindless mechs! A deadly arsenal of weapons is at your disposal, you're going to need it..\nBEFRIEND various allies to help you fight against the armies of evil. Some might look a bit strange, but know that their mechanical hearts are in the right place!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"TurtleBlaze","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":61022,"name":"Super Seducer 2: Advanced Seduction Tactics","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fd/1fd0cec2a10ec3fcdec8eefc85712999.jpg","description":"Are you ready to become irresistible?\nSuper Seducer 2 takes seduction to all new levels of realism.  With 10 times the budget of the first game, Super Seducer 2 is  much bigger, better, and more seductive.\nOur hero is joined by some new friends as the story continues across 10 all new scenarios:\nBoss & Secretary\nIt’s dangerous territory but the workplace is still a common place for relationships to begin.  How do you successfully navigate and avoid getting fired (or sent to jail).\nGirl in a Group of Guys\nOne of the toughest seduction situations imaginable.  She is a feminist and her friends are tough guys who’d like to squash you.  Can you keep them at bay and leave with the girl?\nStrip Club\nShe’s beautiful, she’s sexual, she’s tough.  How do you get past being a customer and see her outside work…without paying for tons of dances?\nDating App\nTake your Tinder dating to the next level and arrange a date with a beautiful blonde.\nInterracial Dating\nHow does a British Born Chinese man seduce a beautiful brunette, all whilst a drunk Richard is trying to help (or hinder) the proceedings?\nLooking for a One Night Stand\nHow to find people that are looking for no-strings-attached fun, and escalate things so that you can get them back home as fast as possible.\nLooking for a Serious Relationship\nIt’s time to settle-down and find the one, can you make the right moves and not blow it by choosing the wrong person?\nPosh Totty vs Supermodel\nShe just stepped off a yacht, but the supermodel is just too sexy. The choice is yours.\nOlder Mahmoud, Younger Woman\nThe man, the myth, the legend.  Mahmoud is in town, and he has some dates.  Can he seduce his Habibi?  Will the 25 year age-gap help or hinder him?\n\n…And a bonus level in Mandarin Chinese.\nSuper Seducer is a realistic choose-your-own adventure FMV game where the player makes choices in dating scenarios and sees the action play out.  Choosing the right options will result in the best possible ending, and anything else will result in failure.  Along the way you will be given advice by our resident dating gurus, allowing you to learn key dating concepts and improve your social life.\nKey Features:\nFemale Perspective\nPlay from a woman’s point of view, getting unparalleled insight into the female mind in dating situations.\nMake Like a Tree\nWith true-branching, it’s possible to take a level in totally different directions.\nHappy Endings\nDepending on what skills you use and how many mistakes you make, you will see up to five different endings to each level.\nLegendary Seduction Gurus\nWhen making the game, we consulted top dating experts from around the world to make sure our Tinder game was perfect, that we knew what issues face cross-cultural dating, and to get our female-perspective levels spot on.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"RLR Training","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":59132,"name":"Gran Turismo 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e9d/e9d6ebd887cbdade457d64cea51fe47c.jpg","description":"It's more than a game. It's a religion. Whether it's for the thrill of speed, the intensity of competition, or the fanaticism in supping up your car, Gran Turismo has captured the essence of the automotive lifestyle and had unleashed the passion between man and machine. As the fourth installment of the worldwide blockbuster-selling Gran Turismo series, Gran Turismo 4 is available exclusively for the PlayStation®2 computer entertainment system. The creative and talented minds of Polyphony Digital, Inc. have once again succeeded in developing the most technologically advanced racing experience ever. Gran Turismo 4 features a truly authentic racing experience spanning 100 years of automotive history. Packed with more cars, courses, and race modes, Gran Turismo 4 delivers enhanced, if not perfected game physics and graphics.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Polyphony Digital","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":47603,"name":"Chapter I - First steps","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ed/2ed72ce77de42048e9d86b4e7fcc76a8.jpg","description":"Lines Infinite\nAbout the Game\nLines X is a Numberlink-based puzzle game involving finding paths to connect colored tiles in a grid.\n100 brain-teasing Numberlink puzzles\nbeautiful abstract design, more than 10 color themes\n8 ambient relaxing soundtracks\n15 Trading Cards, Badge, Emoticons and Backgrounds (Coming soon)\nSteam achievements\nCross-platform saves via Steam Cloud\nWindows, Mac & Linux\nInfinite fun - Lines Infinite\nGet both with 25% discount - Lines Bundle\nDisclaimer - Game contains multiple achievements, which can be considered as \"achievement spam\". We want to assure you that they were added only as a result of community event on launch date. We wanted to make personal present for our fans, no bad intentions. You can disable achievements anytime in game settings. Thanks for understanding.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nestor Yavorskyy","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":46110,"name":"Microsoft Allegiance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c79/c7997e3b5f6c4760c90e90c0a856717e.jpg","description":"Microsoft Allegiance – Space Combat Action / Simulation\nAllegiance is a multiplayer space combat sim originally developed by Microsoft that offers the action of ship-to-ship combat. From small, agile scouts to massive destroyers, you not only fly but also man the turrets. With real-time strategy components such as fully upgrade-able tech and massive multiplayer capability, Allegiance stands at the forefront of online interstellar combat.Real Time StrategyEverything is as you would expect from an RTS including tech trees, exploration, and base building. Except, of course, every unit aside from miners and base constructors is flown by a real player.\nEach team has a commander, usually a veteran with extensive knowledge of the game’s factions, economy, and strategies. The commander manages the team similar to most strategy games utilizing the overhead command view.Unique GameplayMost modern shooters are a dumbed down experience where it is more about constant action, not strategy and team-work. Allegiance has a higher learning curve but provides an extremely rewarding experience.\n– Scouting the Map –\nLike many RTS games, you start with most of the map undiscovered and your objective is to wipe out your enemies bases. Maps are broken down into several sectors. Usually most of the team will escort a constructor in one direction while a few others scout out the rest of the map and set up early warning sensors (probes). Sometimes commanders send their initial base constructor to the same sector and some early chaos ensues.\n– Tech Path –\nEarly in the game team commanders must decide on the team’s first tech path. Each tech path has strengths and weaknesses, so hope your commander chooses wisely!\n– Economy and Base Building –\nEconomy is key in Allegiance so both hunting enemy miners and defending your own is essential. Just as important is making sure your base constructors reach their targets, providing forward outposts from which to launch attacks.\n– End Game –\nOften a team that is well coordinated with strong dog fighters will begin taking control of the game. However many games remain relatively even and there is still much work left to be done. An additional tech base or shipyard is usually constructed to support your primary tech. Eventually one team will start wearing down the other. But a well coordinated assault on a key enemy base can easily bring your team back to even strength.\nDownload Allegiance and experience the unique, award-winning game play. Free to play!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Microsoft Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":45643,"name":"Twin Saga","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f63/f63bb1eda62192bd01b3f0378106bbe7.jpg","description":"Immerse yourself in a vivid and exciting anime world!For ages, the twin goddesses Marisa and Amaris watched over mankind and kept the world in peace. Until one of the sisters, in her lust for power, tipped the scales and the delicate balance between the twins was destroyed forever. Order has turned into chaos and it is up to you to return hope to the lands and fight for the future of all life!Forge Your Own Destiny!Experience the struggles of a world in turmoil in thousands of quests and dozens of dungeons. Your decisions can change the outcome of questlines and determine the fate of the characters you encounter on your journey!\n\nPlay the Way You Want!Change your character class whenever you like! Customize every class with extensive skill trees! Choose between hundreds of weapons, outfits and mounts and show off your achievements!Dynamic Combat!Combine your skills for additional damage and better crowd control. In addition, every skill builds up your combo power. Unleash that power with well-timed finishing moves for devastating effects!\nCollect the Senshis!The celestial beings known as Senshis were once the trusted servants of the twin goddesses. Gain their trust and they will fight once more - this time by your side! Get exclusive buffs, new skills and unlock daily quests with every Senshi you collect!Next Level Player Housing!Early on you get your own Terracottage: A fully mobile, highly customizable house for you and your friends! Unlock hundreds of interior furniture and decorations. Grow your own crops, craft items, get daily quests and enjoy fast travel: The Terracottage provides all of that and more!Defeat Your Enemies In Intense Pvp-battles! From class-specific duels to team-based arenas and massive battlegrounds with up to 200 participants: In Twin Saga, you can show off your skills against other players in various ways. Get to the top of the rankings for handsome rewards!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"X-Legend","platforms":[{"id":0,"name":"PC"}]},{"id":40406,"name":"Ace Combat: Assault Horizon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f3f/f3fa8d41f56e9b883c21701f37012b52.jpg","description":"The Games on Demand version supports English, French, Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  Fly at supersonic speeds and experience intense shooting gameplay with mass destruction! Engage the enemy in intense close range dogfights with a fighter plane! Wipe out enemy ground forces in one full sweep as you evade explosions in an attacker plane!   Use an attack helicopter, a bomber, and a gunship to destroy enemy forces with massive firepower!  Experience an exciting story set in the real-world in the single player campaign and participate in a variety of 2-16 player online game modes!   The story and events depicted in this work are fiction. Any resemblance to actual political states, geographic locations, persons, living or dead, corporations and organizations is purely coincidental. The work contains actual architectural structures, locations, governments and militaries, but is not affiliated with and does not endorse, nor is a benefactor of, any associated corporations, organizations, political states or persons.  All trademarks and trade names are the property of their respective owners.  All trademarks and copyrights associated with the manufacturers, aircraft, models, trade names, brands and visual images depicted in this game are the property of their respective owners, and used with such permissions.  ©GeoEye/JAPAN SPACE IMAGING CORPORATION ©DigitalGlobe,Inc.,All Rights Reserved.  ACE COMBAT ® ASSAULT HORIZON & ©2011 NAMCO BANDAI Games Inc.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":28378,"name":"SuperStreetFighter2THD","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a1/5a1e155228aa3fb8c9ad0e6077301dbd.jpg","description":"(Online Interactions Not Rated by the ESRB) Single Player, Xbox LIVE Multiplayer 1-2, Local Multiplayer 1-2, HD (High Definition). The original MMA series is back! Super Street Fighter II Turbo HD Remix receives a whole new look while improving on the innovative fighting system of the original game. Updated with 1080p HD redrawn art and widescreen support, the game offers a unique experience that appeals to new fans and Street Fighter® purists alike. There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Backbone Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":27124,"name":"Kid Icarus: Uprising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2cd/2cd7c7db68c60d2e1dfb4e91d3d770bf.jpg","description":"Some 25 years after the original Kid Icarus™ game for NES™\ncaptured the hearts and imaginations of gamers worldwide, Kid Icarus:\nUprising brings the action and adventure of this beloved series to\nnew heights – and new visual dimensions – on the Nintendo 3DS™ system.\nThe dark goddess Medusa and her Underworld Army have returned, and\nthey’ve got their sights set on the heroic angel Pit. With the aid of\nPalutena, goddess of light and guardian of the human race, Pit must fend\noff this malevolent threat. The richly immersive graphics of the\nNintendo 3DS system offerincredible depth as Pit battles enemies by air\nand by land.\n\nDesigned by Masashiro Sakurai – creator of Super Smash Bros.™\n– Kid Icarus: Uprising is an epic, action-packed odyssey\nthat unfolds with stunning 3D visuals. The game also includes\nfully-voiced levels and an amazing soundtrack.\n\nEach Chapter delivers nonstop action and is broken up into two\nsections: Air Battle and Land Battle. In Air Battle the action unfolds\nlike a dynamic guided shooter. When Pit is facing enemies in Land\nBattle, the game play handles more like a third-person shooter.\n\nA wide variety of collectible weapons offers an extraordinary amount\nreplay value. With 9 different categories of weapons, ranging from\nBows to Claws, players can learn the unique characteristics of each\nweapon and determine which is best suited for each battle and their\nstyle of play.\n\nExperience an innovative take on multiplayer battles in Light vs.\nDark, as two teams battle on land whittling away at the other team’s\nhealth meter each time a team member is defeated. The team battle then\nchanges to a man-hunt once one team’s meter is emptied. The opposing\nteam must target the other team’s lone angel to win the match.\n\nThe game includes AR\nCard compatibility. Using the built-in 3D camera on the Nintendo\n3DS system, the game recognizes countless specially designed AR Cards,\nwith animated game characters popping up in 3D on the game screen and\neven battling each other when two cards face off.\n\nThe game’s simple, intuitive play control has players hold the system\nin their left hand, while the right hand uses the stylus on the touch\nscreen for targeting. The controls are simple enough to be grasped\nquickly, but offer layers of depth and strategy for advanced maneuvers.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Project Sora Co.","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":25487,"name":"DIG DUG","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e4/1e4cfcab53dc019de1193a8b2e8dc379.jpg","description":"Take up the role of Dig Dug, the champion of love and justice, as you\ndrill through the ground and defeat any enemies that stray in your path.\nClear the stage by avoiding and defeating the persistent Pooka and the\ndeep-dwelling but whimsical Fygars.\n\nHit enemies with the harpoon and pump air into them, or drop rocks from\nabove. Pass through inflated enemies, or defeat multiple enemies in an\nadjacent passage for an even higher score. To earn a chance at bonus\npoints, don't forget to collect those vegetables that appear!\n\nKeep on digging, and outmatch the enemies that dwell deep underground!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"}]},{"id":23392,"name":"CrossCells","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b0/7b05931642edea734279ff64f565d478.jpg","description":"CrossCells is an ambient logic puzzle game.\nUse number clues to remove tiles and solve the puzzle.\nIncludes 50 brain teasing puzzles.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Matthew Brown","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22881,"name":"Medal of Honor: Allied Assault War Chest","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/909/909ca5ccc4fe379e7da5ef0c477aa918.jpg","description":"Become part of an Army Ranger team as you battle your way through\nenemy-infested towns, regain control of the Atlantic, and establish a\nbeachhead as part of the D-Day invasion force on Omaha Beach in Medal of\nHonor: Allied Assault. Medal of Honor: Allied Assault - Spearhead\nchronicles the last year of the war on the European front. Parachute behind\nenemy lines during Operation Overlord, halt the German offensive during the\nBattle of the Bulge, and engage the German forces as they desperately try\nto defend the heart of the Reich, Berlin. In Medal of Honor: Allied\nAssault - Breakthrough, you’ll join U.S. Army Sergeant John Baker as fights\nin the battle at Kasserine Pass in North Africa, race to capture Messina in\nSicily, and finally repel the German army at the historic battle of Monte\nBattaglia in the heart of Italy.\nMedal of Honor: Allied Assault War Chest is a treasure trove of historical\nbattles presented as a gritty World War II action FPS. Call in artillery\nand air strikes against the opposing forces and keep your squad away from\nthe jaws of defeat and despair. Drive various assault vehicles, always\ncharging onwards to victory. Uncle Sam wants YOU!Medal of Honor: Allied Assault War Chest includes Medal of Honor: Allied Assault and its two expansions: Spearhead and Breakthrough.\nWage war in vast and stunning locales--from North Africa to Norway, occupied France all the way to the heart of Germany.\nOver 48 carefully researched and authentic weapons from World War II.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"}]},{"id":21796,"name":"Ludwig","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/643/64361ae7b80d1d0c249884cbccbac158.jpg","description":"OVERVIEW\n2098. Mankind has left the Earth and is now living in space colonies. Ludwig, a research robot from a faraway civilisation and his spaceship are looking for forms of new energy. Unfortunately, mankind´s new space colonies are not listed on his interstellar maps, which results in a fatefull crash with the physis, the biggest station with a billion inhabitants. The crash does not only tear a huge hole into the physis´ protective cover, but also damages Ludwig´s spaceship badly enough for him to lose control of it and crashland on planet Earth. Now it´s a race against time.\nWill Ludwig succeed and get his spaceship going in time to save the physis?\nFEATURES\nExplore the area where the spaceship crashed or an enormous dam, travel by balloon through the snow and ice or cross an almost endless desert. There’s so much to discover!\nFind the weirdest components and construction plans. Use them to develop practical new gadgets to supply Ludwig with energy!\nDiscover physical phenomenons and analyse them in order to reveal the laws of physics and solve the tricky puzzles in the game.\nthrilling storyline arching over 4 unique environments\nmore than 8 hours of gameplay\ndeveloped with physics-teachers, pupils and educators - 100% curiculum based\ncomes along with didactic materials for school useage\nWHAT THE GAME IS ABOUT\nThe game tells the story of \"Ludwig\" - a small research robot who is on an important mission to find new forms of energy for the home planet of the Robotronics. After a long journey he finally reaches earth - just to find it abendoned. Humans exhausted nearly all energy sources and left the planet. They live in big space stations. Unfortunately Ludwig hits one of these spacestations with his spaceship and crashes down on earth. A damaged spaceship, a far away homeplanet in desperate need of energy know-how and 1 billion humans in a damaged spacestation - now it´s up to you as a player to clean up this mess!\nWhile following the storyline Ludwig has to learn about the human technologies on earth. Starting with the most basic form of energy production - combustion - he has to advance through a techtree to find and learn about more sophisticated forms of renewable energy.\nLudwig doesn´t know anything about the laws of physics on earth (remember - he´s an alien from a far away robot civilization called the Robotronics...). So he uses his scanner to find and analyse physical phenomenons which appear in the gameworld. All the knowledge is stored in a dynamical conceptmap - the knowledgebase.\nThe knowledgebase is empty when you start the game. While playing, it fills step by step with new nodes. You will end up with a huge concept map of physical knowledge on renewable energies. (developed together with physics teachers and educators).\nThe game features 4 unique \"themeworlds\". These quests in these environments are based on a specific topic (combustion, water power, wind energy, solar energy). The themeworlds are connected by the storyline.\nEvery themeworld features a minigame - called laboratory. A laboratory illustrates the core knowledge of the themeworld (for example: How does a pumped storage power station work? or Where should i place my windmills to get the most efficient energy output?\nAll this educational gameplay is nicely embedded in the storyline. The game is NOT devided into playing- and learning- or assesment elements. You always KEEP PLAYING the game!\nLudwig is designed to be fun to play (please judge for yourself ;-) but it can also be played in schools. The game comes along with a set of didactical materials for teachers to support embedding Ludwig in classes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ovos","platforms":[{"id":0,"name":"PC"}]},{"id":21418,"name":"Age of Booty","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52d/52d22eee72cc3f9faff0e6111a1ceef0.jpg","description":"Set in the swashbuckling era, Age of Booty™ is a casual real-time strategy game that puts players at the helm of their own pirate ship with the goal of sending your enemies to the briny deep, and looting and capturing towns for your pirate faction.\nIn Age of Booty™, players team up with AI-controlled pirate ships to raid, pillage, sink, and destroy their way to dominance on the high seas. Spoils of war and booty are used to upgrade and customize pirate ships to make them even more deadly as players take on 25 unique challenges and seven of the most devious Pirate Alliances on the high seas. Create custom maps using the intuitive map creation system.\nSingle player real-time action strategy from Certain Affinity, lead by Max Hoberman, designer of Halo 2 and 3's multiplayer game.\nRaid villages, sink merchants, seize towns, steal gold, upgrade your pirate ship and use your guns and your wits to send your foes to the briny deep.\nMaster 25 unique maps or create your own.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Certain Affinity™","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19850,"name":"Skyreach","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b3/2b3de4ee70c2e386d7a47b4c0afa4894.jpg","description":"**NOTE: Skyreach is best played with a console controller, ideally Xbox 360 / One or PS4. It can be played with Keyboard & Mouse.**\nSkyreach is a free game inspired by playing with car toys and building tracks for them to drive on. It's an exploration of building track and driving at the same time, instead of the more traditional build track first, then drive on it after. Players are able to build one path piece a head of their current location. This requires players to not only successfully stay on the path, but also plan where to build in order to reach the end of the level.\nThe environment for Skyreach was inspired by the Arches National Park of Utah mixed with the floating rocks on Pandora of James Cameron's Avatar. We also drew inspiration from the rock carvings of Petra, Jordan and Palmyra, Syria.\nRainbow Goats Studio is an independent games studio of graduate students from the University of Utah's Entertainment Art & Engineering program. This is our first published game and our first project together as a studio.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rainbow Goats Studio","platforms":[{"id":0,"name":"PC"}]},{"id":19827,"name":"BLEAK: Welcome to Glimmer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e39/e39e33f26360f800d55b7d7b07fe04c7.jpg","description":"Having spent his life locked inside, protected by his sister and hidden from an extremely hostile world, a young Sourcer named “Bleak” passed the time using his creativity and ingenuity to rebuild a destroyed C.O.G. surveyor robot name \"Glitch\". When his sister, Asha is discovered and arrested, Bleak emerges with Glitch by his side into this unfamiliar and overwhelming terrain. Can you traverse it?Welcome to Glimmer 20+ Platforming levels (Multiple ways of beating levels that change the path you take)\nCompetitive Time Trial Online Leaderboards\nTwo playable characters with unique mechanics\nA massive lore that spans thousands of years across seven original races\nStrong focus on single-player narrative story telling\n20+ original songs by alternative rock band \"Or Nothing\" Escape from Wither (est. Late 2017): Additional 20+ Platforming levels (Multiple ways of beating levels that change the path you take)\nAnother playable character\nLore expansion with greater details on the origin of Pinnacle\nStrong focus on single-player narrative story telling.\nAdditional 15+ original songs by alternative rock band \"Or Nothing\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tenwall Creatives","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19745,"name":"Project Pulsation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d32/d32a3a95f34f14867714648e0f588570.jpg","description":"Project Pulsation\nA long time ago the 'Complex' corporation preformed horrific experiments on humans, crossing them with the representatives of alien races. This resulted in a disaster, destroying everyone on the station. Or nearly everyone ... Unknown creatures remained, mentally affecting people at a distance and fatally through close contact. Strangers call them Shadows. But this does not prevent you to start your way in search of an artifact, hidden deeply in the Station.\nGet ready to meet the security system 'Complex', mutants, settled there, and ghosts;\nLook for ways out of the dark corridors, solve complex puzzles and to hide from the shadows;\nLack of oxygen and ammunition, try not to run into treacherous anomaly encountered in this damned place","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"VGstudio","platforms":[{"id":0,"name":"PC"}]},{"id":19433,"name":"Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f01/f016a6b1d3a8be7aff0529719cf071a7.jpg","description":"--------------------- PLAY THE DEMO BEFORE PURCHASING! ---------------------\nWARNING! THIS GAME WILL PROVIDE YOU WITH NO HINT.\n(You might discuss or get the hint from other player from the discussion)\nEnter the nightmarish world of \"Light,\" a spine-chilling horror game where every step forward decides your existence. Awaken in a dark, eerie environment and find your way to safety by solving paranormal mysteries.\nArmed with only a flashlight, your primary tool against the darkness, navigate through haunted houses, shadowy forests, and ominous roads. The environment is shrouded in night, with shadows concealing malevolent entities bound by unfinished business or sinister purposes.\nEach time you die, you'll be returned to starting time and place with your memory intact.\nFeatures:\nDynamic Horror Experience: Scripted scares and events ensure no two playthroughs are the same.\nAtmospheric Sound: A hauntingly effect and ambient sound effects enhance the sense of dread and suspense.\nMystery Solving: Piece together clues and solve supernatural mysteries to progress and survive.\nCan you unravel the mysteries that haunt this forsaken place and escape the night? Or will you become another lost soul trapped in the darkness? Find out in \"Light.\"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Just A Pixel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19279,"name":"Culpa Innata","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d72/d728690bac6a81ae1e609f90ba87c49f.jpg","description":"The World Union is labeled the 'perfect society'. Prosperity is a science, disease and wars have vanished, sex is entertainment, and the future has never looked brighter. Suddenly this perfect society is rocked by the murder of a World Union citizen in the 'Rogue State' of Russia. His murder oddly coincides with the accidental death of a prominent professor in Adrianopolis, an important border town between the World Union and Russia. This career making case is assigned to a young woman, Phoenix Wallis who as the Senior Peace and Security staff officer has been assigned to lead the murder investigation. Her search for the truth leads to enigmatic clues, and deepening mysteries that challenge not only her case, but her very belief in the world she has sworn to protect.\nThis story-driven, third-person game uses a 3D engine with dynamic cameras and other technologies developed by Momentum AS. Their remarkable patented facial animation technology is put to excellent use, as the game features over fifty personable characters that you'll frequently engage in dialogue throughout your investigation. Using the classic mouse in a point and click interface, players have responded enthusiastically to the intuitive and responsive control. The game features a wide variety of organic obstacles ranging from logic puzzles to hi-tech gadget manipulation to dialogue and inventory challenges.\nOriginal, complex story with a detailed history in a fully realized game world\nEnvironments and characters rendered in 3D with dynamic camera implementation\nCinematics rendered with in-game engine for seamless graphics integration\nClick and go character control; user friendly mouse-driven interface\nOver 50 interactive characters, each created with Momentum-patented 3D facial animation technology\nIntuitive dialogue system with player choice and branching conversation paths\nNon-linearity and optional player activities offer rewarding replay ability\nCharacter journal captures all key game moments\nMore than 40 unique locations\nDiverse range of integrated challenges, from standalone logic puzzles to hi-tech gadgetry to inventory and dialogue obstacles\nOriginal soundtrack","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Momentum Digital Media Technologies","platforms":[{"id":0,"name":"PC"}]},{"id":19124,"name":"Pitiri 1977","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ba/0ba6e0482ed7fffd0a95ad2f021f3f44.jpg","description":"Now isn’t this great…!\nIt’s my brother’s birthday and this Claw-thing crashes into our house and takes away Sammy! I guess someone has to play hero now…\nPitiri 1977 is an adventure-platformer with much exploration in both world and story, and is paying tribute to its classic pioneers – not only by its gameplay, but also by its background story. A narrative, that is set in 1977 (the glorious year of Star Wars IV, the Atari 2600, the Voyager One spacecraft & Led Zeppelin's “Presence”), in an imposing world, created by using hand-painted graphics, characters, solid physics and a 1970s soundtrack, gradually opened up by the player’s acquired abilities.\nYou play as a kid with supernatural powers, whose brother has been kidnapped by an unknown evil. On your quest to get your brother back, you venture through a twisted 70s science fiction utopia that lies beyond the known…\nKEY FEATURES\n\nStylish 70s Setting\nStory driven gameplay\nMetroidvania like adventure\nHand-painted Levels, Characters and Objects\nSolid Physics engine\nCool 1970s Music\n5 supernatural Abilities\nSandbox Level Editor (Beta)\nIncluding full soundtrack!\n★★★★\nWinner of the 'Content Award 2010' for Games and the Impulse XC Sponsorship 2010, Pitiri 1977 is shaping up to be a rather striking-looking game. - indiegames.com\n★★★★\nPitiri 1977 is easy to pickup, feels like a familiar platformer with the added excellence of special abilities to progress through each level, and is visually appealing is almost every way – especially the fantastic cutscene. - indiegamemag.com\n★★★★\nAn excellent platformer game that is extremely well polished and has some very creative game play mechanics. - www.clickteam.com\n★★★★\nA jawdropping cinematic intro and an introductory level in a beautifully handpainted suburban landscape signal that these guys mean serious business. - Adam Dobay (Klikdisc)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ILIKESCIFI Games","platforms":[{"id":0,"name":"PC"}]},{"id":19010,"name":"Freddi Fish 4: The Case of the Hogfish Rustlers of Briny Gulch","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b6/6b6d1ba209e9d16a45b22c7542cecd7b_bLSlA6X.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameHey Partner, Freddi Fish and Luther need your help!\nCousin Calico's prize-winning hogfish have been fiendishly fishnapped by some rowdy hogfish rustlers! Always the brave adventurers, Freddi and Luther offer to find the rustlers' secret hideout, rescue the hogfish, and wrangle those rambunctious rustlers. You can help Freddi and Luther bring justice back to Briny Gulch as you explore exciting Wild West locations, investigate captivating clues and meet adventurous new characters, like Cousin Calico, Sheriff Shrimp, Sahara Slim, and Eight Finger Phil. Most are helpful \"good guys,\" but every good Western needs a \"bad guy,\" or two...\nIt's a different game each time you play.\nThe more you click, the more you learn.\nDevelop important logical thinking, problem solving, and memory skills as you take an active - and interactive - role in solving the mystery of Cousin Calico's rustled hogfish.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":17566,"name":"Keebles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/599/59976dfeebab3a60418ea8ead6c498b8.jpg","description":"Build weird and wonderful vehicles using whatever you can find. Master rockets, balloons, parachutes and more. Save as many Keebles as you can, and be quick - the Whale at the End of the World won't wait forever!\nKeebles challenges you to build vehicles to transport the fragile Bobble across 30 challenging levels, saving Keebles along the way.\nUse the Workshop to design your vehicle. Different levels provide different items to make your vehicle from. Make use of various wheels, beams and gadgets to roll, slide, float and fly. The best design isn't always the most complicated, nor the most simple. Experiment and see what works best!\nThere are five stars to be earned for each level, plus a bonus Time Challenge award. Getting all of them isn't going to be easy, but it will be fun!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Burnt Fuse","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17160,"name":"The Great Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b7/7b7c5b47f8977e11526b1021b9f40d67.jpg","description":"The Year: 1942\nThe Place: Heldentod P.O.W. Camp\nThe Mission: Escape.\nCaptured, but not defeated, you are being held in the notorious Heldentod camp. This small, converted castle in the middle of nowhere will be your home for the rest of the war; unless you can escape to rejoin the Allied Armies. Planning, patience, skill, and courage will be necessary as you gather your resources, make  your plans, and finally, make your great escape.\nFeatures:\n•Dynamic Scrolling 3D Isometric Graphics\n•Multiple escape paths with multiple solutions\n•Guards, the Commandant, and fellow prisoners to hinder and help your plans\n•Action, danger, excitement, logic and cunning combined in a unforgettable experience\nThe Great Escape is an isometric action-adventure game. Controlling a prisoner of war in a German camp, your goal is to break out undetected. There are numerous ways to freedom – back doors, cracked fences, even underground tunnels. However, you have to plan your escape while obeying the strict rules of the camp.\nNumber one: Daily program. You have to attend two roll calls a day, one meal, one exercise, and stay in bed at night. Failure to appear at any of these events will result in the alarm being rung. When you do not touch the controls, your protagonist will move automatically, going to all important events. You have to detect and use gaps in the time-table to explore the camp.\nRule number two: guard rooms are off limits. If a soldier catches you in a room that is forbidden, you will be placed in solitary confinement. Of course, you have to enter restricted parts of the camp to find items crucial for your escape. The moral flag will turn from green to red to indicate that you are in an area where you shouldn’t be.\nRule number three: no prisoner may carry forbidden objects. When you are caught in a suspicious situation, you will be stripped of all items that you found so far. To avoid that, you have to deposit objects in a safe place. You need to find keys to open locked doors, uniforms for camouflage, flashlights to see in dark tunnels, and many more.\nRule number four: guard commands are to be obeyed at all times. The German soldiers patrol on fixed routes and have a line of sight. You have to learn the guard’s routes and sneak past their backs to avoid detection when breaking out. If you are caught, your morale will decrease. If your morale reaches zero, your will to escape is broken.v","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Ocean Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":16903,"name":"Jack Keane","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ac/5ac19a1daec2b5688028caeb8995528b.jpg","description":"Colonial England. Under a certain amount of duress... Jack takes on a job, which will not only cause him a great deal of trouble, but also bring to light the answer to a mystery out of his distant past. A lack of money leads Jack to accept a charter to take a British secret agent to mysterious 'Tooth Island'. When Jack's ship shatters on the mysterious island's cliffs on arrival and the secret agent quickly becomes a meal for a monster in the jungle, Jack is soon left to cope with the situation on his own.\nTooth Island is ruled by the strange Doctor T, who is cultivating man-eating plants and has his own dastardly plans for the British Empire. And why does he seem to know Jack, who can't remember ever having been on Tooth Island? What are Doctor T's plans? And what does he know about Jack's past?\nAnd then there's the young and naive Amanda, who is filled by an almost fanatical drive to prove her worth. In the beginning the young lady is employed by Doctor T, and part of her task is to track Jack down and take him prisoner. It doesn't take long before she begins to wonder if she is really on the right side, or if she shouldn't join her opponent, the charming Captain Jack, instead.\nA hair-raising hunt across the length and breadth of the dangerous island finally airs the mystery surrounding Jack's past and leads to a spectacular showdown with a dark and deadly enemy and his nefarious henchmen.\nA wild, action-packed Point-and-Click adventure\nA humorous and engaging story, containing many allusions and references to famous movies, characters and computer games\nGreat dialogue, over 40 memorable characters\nTwo playable characters  the somewhat clumsy daredevil Jack Keane, and the attractive and adventurous Amanda\nA variety of settings including London, the High Seas, Capetown and of course, Tooth Island!\n3D levels presented in that classic adventure style\nCinematic cut-scenes to push forward the captivating storyline","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Deck13","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16820,"name":"Distant Worlds: Universe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d75/d7546d808450339c90c704b53b52bda8.jpg","description":"The Universe is Yours!\nDistant Worlds: Universe is the newest chapter of this critically acclaimed sci-fi series, adding incredible new features and an exciting new storyline.  Universe is also the ultimate collector’s edition, the first time all previous Distant Worlds releases have been included in one package, along with an updated manual and greatly expanded modding support.\nDistant Worlds is a vast, pausable real-time 4X space strategy game. Experience the full depth and detail of turn-based strategy, but with the simplicity and ease of real-time, and on the scale of a massively-multiplayer online game.\nVast galaxies are made to order: up to 1400 star systems, with up to 50,000 planets, moons and asteroids. Galaxies are so deep, fun and immersive that you won’t want to finish the game.  Build, expand and improve your empire while playing through one of the storylines, with victory conditions or in an open-ended sandbox mode.\nEach galaxy is packed with life and activity. Encounter other empires, independent alien colonies, traders, pirates and space monsters. Explore star systems, asteroid fields, gas clouds, supernovae, galactic storms and black holes. Discover evidence of civilizations long since past, uncovering secrets about the galaxy's troubled history...\nBest of all, you can play the game your way: enjoy a quick, intense game in a crowded sector of space or take your time in an epic game spread across a vast galaxy! Distant Worlds: Universe contains all of the following:\nFeatures: Truly Epic-Scale Galaxies: play in galaxies with up to 1400 star systems and 50,000 planets, moons and asteroids. Vast nebula clouds spiral out from the galactic core, shaping the distribution of star clusters in the galaxy\nPrivate Enterprise: the private citizens of your empire automatically take care of mundane tasks like mining resources, transporting cargo, migration between colonies, tourism and much more. This frees you from micro-management and instead allows you to focus on a macro-scale\nDiplomacy: interact with other empires, discussing treaties, making trade offers or just giving them a piece of your mind. Talk to pirate factions, tapping into their underground information, or paying them to do your dirty work for you...\nChoose your Playstyle: Start with a single planet and sub-light ships, or as an established space-faring civilization with warp drives.  Play as a Standard empire or as a Pirate faction, with many adjustable victory conditions and gameplay choices depending on your actions.\nIntelligent Automation: automate the various tasks in your empire, so that you can focus on the areas that you enjoy most. Or have your advisors make suggestions in different areas like colonization, defence or diplomacy – helping you learn the best tactics and strategies\nExplore: explore the vast galaxy, discovering valuable resources, potential colonies for your empire and making contact with other empires. Uncover secrets that lift the veil on the galaxy’s mysterious past...\nColonize: send out colony ships to found new worlds for your empire. Develop your new colonies by keeping them well-supplied with a steady stream of valuable resources\nDefend: patrol the outlying areas of your empire to protect from raiding pirates or dangerous space monsters. Construct defensive bases at your colonies. Build up your fleets to defend against enemy empires. Recruit troops to invade enemy colonies and conquer the galaxy!\nEspionage: covertly seek out information about other empires, or even disrupt their progress with acts of sabotage\nResearch: develop new technologies for use in building your own unique ships and star bases\nCharacters:  including Leaders, Admirals, Generals, Ambassadors, Governors, Agents and Scientists, all with defined skills and traits and the opportunity to advance and improve\nDesign and Build: A very flexible system allows you to design and build the ships and star bases in your empire. Construct mighty military ships ranging from escorts to carriers and dreadnoughts at your space ports, or build mining stations, research installations or secret monitoring facilities at remote locations throughout the galaxy\nBuilt-in Game Editor: fine-tune your own galaxy, adding or removing star systems, planets, asteroid fields, ships, star bases, space monsters or anything else. Modify the attributes of any empire in your game\nExtensive Help: exhaustive, built-in, context-sensitive help is always only a single key-press away. Press F1 at any time for a detailed explanation of the current game screen, your currently selected item, etc\nTutorials: in-game tutorials familiarize you with all of the game elements and tools New to Universe! The entire Distant Worlds series in one package! Universe includes the Original Distant Worlds, Return of the Shakturi, Legends, Shadows and the new Universe expansion!\nComprehensive Modding and Customization Support: Allows adding/removing/changing most items: resources (including new colony-manufactured resources), ship components, planetary facilities and wonders, fighter designs, alien races and race families, diplomatic dialog, empire policy, custom characters, ship and base design templates, governments, plagues, research tech trees and more\nCan customize most of the images used in the game: ships and bases, fighters, alien races, planetary facilities and wonders, characters, troops, components, resources, ancient ruins, planets, stars, asteroids, animated in-game effects and more\nUse a previously saved and editor-customized game as a map for a new game (instead of generating a new galaxy)\nPowerful new event system accessible from a considerably-upgraded Game Editor. Set up your own storyline in a custom map with triggered events and custom victory conditions\nAdd story triggers on specific in-game objects or events, executing one or more actions on other in-game objects (either immediately or delayed)\nCan replace most of the user interface icons and sound effects\nAdd your own custom help files to the in-game Galactopedia\nSwitch between different customization sets with a couple of mouse clicks from the main game menu\nComprehensive 99-page Modding Guide that outlines how to make Mods and explains all of the settings in detail\nA new official storyline built using the new modding capabilities, covering the first war between the Freedom Alliance and the Shaktur Axis, in which you have access to the tech required to build your own planet destroyers, establish the Ancient Guardians and research and deploy the Xaraktor virus.\n","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Code Force","platforms":[{"id":0,"name":"PC"}]},{"id":15986,"name":"Secret Files 3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a16/a167113842092e444d9c2ce59e20920c.jpg","description":"The bestselling Secret Files franchise celebrates its return!\nThe dream couple Max and Nina have announced their forthcoming wedding...but at the beginning of Secret Files 3 the event suffers a catastrophe! Max is arrested by Berlin‘s police force. The accusation: Terrorism.\nNina‘s biggest adventure yet awaits her in the franchise‘s third game. Could it be possible that everything is connected to the happenings in Tunguska? Is humankind depending on her? Can she save Max or is fate more important than her happiness? Throughout the story players will experience a cinematic hunt crossing continents, with many riddles waiting to be solved.\nThe adventure is not limited to the present, there are also all kinds of puzzles to solve set in the past and in the future, and depending on the choices the player makes, alternative endings await them...Key FeaturesThe most successful Adventure brand of recent times\nCinematic production with updated game engine\nStory written by acclaimed TV writers","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Animation Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":12046,"name":"Super Star Path","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99f/99f8011e0757ec5fbe1e92ffa3d38408.jpg","description":"More Games!http://store.steampowered.com/app/491040/Bot_Vice/\nhttp://store.steampowered.com/app/643880/Strikey_Sisters/\nAbout the GameClassic color match puzzle meets space shoot'em up action! Hop into your spaceship, open a path through huge waves of aliens and other hazards, and face intense boss battles!FEATURES\nThree difficulty modes.\nRandomized color puzzle stages.\nIntense shoot'em up boss fights.\nUnlock, buy and upgrade new ships.\nUnlockable Boss Rush mode.\nColorful and polished pixel art graphics.\nArcade-like FM synth soundtrack.CREDITS\nA game by DYA Games.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DYA Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12036,"name":"Battlegrounds of Eldhelm","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be0/be06b963114a7e348ccbe5105fd80753.jpg","description":"Battlegrounds of Eldhelm is an indie, online, free-to-play CCG (collectible card game) / RPG (role playing game).\n\nIt is heavily influenced by RPGs and borrows some mechanics and ideas. The result is a fascinating mixture between role playing game and a classic card collection game with awesome features like:\nUnique card collecting process;\nPowerful card combination mechanics;\nClass specific abilities;\nPlay on your own in the single player campaign or duel other players for high scores. The available game modes are campaign, custom versus A.I. and four types of multiplayer - arena (ranking pvp), custom (ranking pvp via invite - challenge), cooperative (slay the beast) and tournaments (in direct elimination).\nPlay for the ladder board, challenge your friends or join forces against a powerful boss like enemy.\nCrusade in the campaign to be the ruler of the Eldhelm land and never be bored with the daily quests!\nWe are doing tournaments with awesome rewards at least once a month!\nBattlegrounds of Eldhelm features:\nEpic music and 3D graphics;\nThree unique races (orc, elf, human) each containing different character classes (melee, ranged, caster) with completely different play styles;\nCustomization of the visual appearance of your hero;\nTranslation in multiple languages;\nA true multiplatform experience - available for web-browser, desktop, and mobile devices;","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Essence","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11858,"name":"SQUAKE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e34/e34b617088eda2f76e55fed013acc562.jpg","description":"SQUAKE is the well loved classical “Snake” game with a mix of full-steam battle mechanics. Think of it as of Snake+Quake! Quite clever, eh? We thought so.\nIt’s a multiplayer action-packed combat-trains game! Collect cars to become longer. Destroy other trains and try to not die by hitting yourself because that would be totally embarrassing for a train to do.\nWe have 10 unique arenas with traps, power-ups, medals, trophies and all kinds of different game modes: deathmatch, team towers, domination, capture the flag, endless mode!\nOh, and you can decorate your train with all kinds of different fancy smokes and ride in style!\nCHO-CHOO to GLORY!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"On5","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]