[{"id":502116,"name":"Payday 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/06b/06b488134abac3462843e4db8e3833a4.jpg","description":"PAYDAY 3 is the much anticipated sequel to one of the most popular co-op shooters ever. Since its release, PAYDAY-players have been reveling in the thrill of a perfectly planned and executed heist. That’s what makes PAYDAY a high-octane, co-op FPS experience without equal.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"OVERKILL Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":383800,"name":"Bad North: Jotunn Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a9/1a9b0f3ff24aefe69a0ebad2959ddce5.jpg","description":"Your home is under attack. The king is dead at the hands of Viking invaders. Hope is a distant glimmer in the fog, fading fast with every passing moment. As you rise to take your father’s place as ruler, it will fall to you to stage your defenses. But make no mistake – this is no fight for victory, but a desperate grasp for survival.\nBad North is a charming but brutal real-time tactics roguelite. Defend your idyllic island kingdom against a horde of Viking invaders, as you lead the desperate exodus of your people. Command your loyal subjects to take full tactical advantage of the unique shape of each island. Everything is at stake: fail, and watch the blood of your subjects stain the ground red.\nIt’s charmingly brutal, with beautiful procedurally-generated islands and adorable soldiers juxtaposed against the blood-stained realities of war. You control the broad strokes of the battle, giving high level commands to your soldiers who try their best to carry them out in the heat of the moment. It’s accessibly deep, with simple player inputs masking a dynamic combat simulation that make it inviting to new players while challenging veterans.\nKeep fighting, warriors. Not for power or riches or glory, but for hope of peace to come once again in the harsh lands of the Bad North.\nKey Features\nREAL-TIME TACTICS ROGUELITE:  Position and relocate your troops to fend off the Vikings, who each have their own counters to the threats you pose. Pick your battles and plan your evacuations carefully! Lose a commander and they’re gone forever; lose everything, and it’s game over!\nINTELLIGENT UNIT CONTROLS: You command the broad strokes of your defenses and monitor positioning — your soldiers do the rest, navigating and engaging intuitively in response to the situation at hand.\nPROCEDURALLY-GENERATED ISLANDS: Each island is both stylistically charming and unique in its layout. Plan your strategies around every nook and cranny, for you only get one chance to save them from the enemy invasion.\nUNLOCKABLE UPGRADES: A stronger, smarter defense leads to greater rewards. Use these to develop your subjects from a ragtag militia into seasoned warriors.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Raw Fury","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":364900,"name":"ChilloutVR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d3/5d30f4c64a414f63f3ed50b812111c6f.jpg","description":"Have you ever dreamt of a world where you can create and explore anything you want? ChilloutVR is a community-driven VR & Desktop sandbox game supposed to enable players as well as creators to create and explore a huge metaverse.\nWelcome to ChilloutVR, your new place to be. Be able to create your own avatar or use existing avatars, explore a huge metaverse containing lots of different servers, game modes, avatars, and worlds.\nBe creative! You can (and should!) create content for ChilloutVR using the Unity game engine and our content creation kit.\nYou can create game modes, avatars and worlds, share them and explore a huge community made pool of content.\nNothing is more important than friendships! Meet your friends around the globe whenever you wish to, show them what you are working on, talk to them and spend time with them. You can also make new friends by joining public instances or exploring the community and group system.\nStay safe! Using our various server and client sided tools we are able to make sure you can always feel safe in our game. No IP-grabs, no crashers.\nJust enjoy Social VR how its meant to be!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Alpha Blend Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":364872,"name":"NASCAR Heat 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b8/5b8b063c6087601dd2f498a9fc2fc8e1.jpg","description":"NASCAR Heat 4, the official video game of NASCAR, looks, sounds, and plays better than ever!\nNew Features - Track Maps, Unlockable Paint Schemes, Dynamic User Interface, More Driving Control Options, Deeper Career Mode, Sonoma Raceway & Charlotte Roval Track Updates\nNew Graphics & Sound - Complete overhaul of all graphics and audio packages\nDraft Like a Pro - Team up and draft with other drivers with the drafting features\nSmarter, Competitive AI - The AI now runs multiple racing lines and utilizes new controls to adjust its skill range, stability and spread","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Monster Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":277942,"name":"The Invisible Hand","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aba/abaaa2c0b791e778a53794eb8c65b6d0.jpg","description":"Caught in the hamster wheel of a stock broking agency, your every day is a heady mix of high stakes decision making under pressure. Presented with profit targets by a boss who has no hesitation to sack you, you’ll need to engage in panic sales and timed events, lobby society groups to influence the stock market, and even undertake all-out majority share acquisitions. Read the news to see the signs, or dabble with some insider trading to get the upper edge. But, be warned, a financial investigation into your company has begun, and you may well become the focus.\nIntentionally political, The Invisible Hand explores the way we value things in a story-driven stock market simulator that will have you reaching for your tenth coffee before the working day is done.\nYour job is simple: make money, lots of money. The more you make, the happier your boss is, the richer you become, and the more you have to invest. But can you keep the cycle going?\nUse your profits to lobby key groups in the community, driving the price of raw commodities up or down to suit your stock market portfolio.\nEvery day comes with a myriad of deadlines: mission objectives, profit targets and more. But if that’s not bad enough, rumours of an impending financial investigation have started to circulate…\nWhen all is done and traded, what was it all worth? What did it earn? What did it cost? And who decides?","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Power Struggle Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":57475,"name":"Secret of Mana (1993)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/187/187c4033702cc8e5ba106820a4c39a4b.jpg","description":"Secret of Mana, originally released in Japan as Seiken Densetsu 2, is a 1993 action role-playing game developed and published by Square (now Square Enix) for the Super Nintendo Entertainment System. It is the sequel to the 1991 game Seiken Densetsu, released in North America as Final Fantasy Adventure and in Europe as Mystic Quest, and it was the first Seiken Densetsu title to be marketed as part of the Mana series rather than the Final Fantasy series. Set in a high fantasy universe, the game follows three heroes as they attempt to prevent an empire from conquering the world with the power of an ancient flying fortress.\nRather than using a turn-based battle system like contemporaneous role-playing games, Secret of Mana features real-time battles with a power bar mechanic. The game has a unique Ring Command menu system, which pauses the action and allows the player to make decisions in the middle of battle. An innovative cooperative multiplayer system allows a second or third player to drop in and out of the game at any time. Secret of Mana was directed and designed by Koichi Ishii, programmed primarily by Nasir Gebelli, and produced by veteran Square designer Hiromichi Tanaka.\nThe game received considerable acclaim for its brightly colored graphics, expansive plot, Ring Command menu system, and innovative real-time battle system. Critics also praised the soundtrack by Hiroki Kikuta and the customizable artificial intelligence (AI) settings for computer-controlled allies.\nThe original version was released for the Nintendo Wii's Virtual Console in Japan in September 2008, and for the Wii U's Virtual Console in June 2013 . The game was ported to mobile phones in Japan in 2009, and an enhanced port of the game was released for iOS in 2010 and Android in 2014. Nintendo re-released in September 2017 as part of the company's Super NES Classic Edition. A full 3D remake was released for the PlayStation 4, PlayStation Vita, and Microsoft Windows in February 2018.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Square","platforms":[{"id":0,"name":"SNES"}]},{"id":50755,"name":"My Big Sister","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/245/245668dc2a692172c732874d4ded3f31.jpg","description":"My name is Luzia...and this story isn't about me, but my sister.\nPlay as Luzia in her quest to return home. After Luzia and her older sister Sombria are abducted by strangers, it is up to Luzia to help her and her sister home. Help Luzia solve puzzles, uncover mysteries find clues and escape the clutches of insanity in this original story adventure game.\nTRY THE DEMO HERE: https://stranga.itch.io/mybigsisterSTORY\nLuzia is a typical 8 year...*Cough, 12 year old girl with a very sarcastic and playful attitude. Her story takes place on an unfortunate night where everything she has ever known, takes a turn for the worst. Her older sister Sombria has suffered an unfortunate fate as her and Luzia try to return \"Home\". Is she a ghost, a guardian, a walking corpse or still alive? Oh! I've said too much...or have I?GAMEPLAY\nThe game uses an RPG top-down style (The game is not made in RPG Maker) which consists of finding items. secrets and solving puzzles to progress the story. The game is run in chapters which are filled with secrets and easter eggs!CHARACTERS\nLuzia: A 12 year old girl with a sarcastic and playful attitude. Surprisingly, she doesn't get as scared as her older sister.\nSombria: A 19 year old with a serious attitude but a warm side when no one is looking.EARLY ACCESS\nPlease read the early access section before purchasing a copy of My Big Sister.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":45417,"name":"Shape of the World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/102/102d596799fb6afe159d46b4a93bfa22.jpg","description":"Without you, will the forest still come alive?\nShape of the World is an exploration game where a rich and colorful world grows around you, a relaxing and interactive escape about getting yourself pleasantly lost. Your presence is the driving force behind the procedurally populated environment as you establish permanent monuments to mark your journey.Game Features\nFirst-person explorer:\nWander in relaxing and surreal environments that beckon you to explore, hinting at distant landmarks and encouraging you to delve deeper into the woods. Amble, swim, drift and fly at your own pace: no ticking clock or perils laying in wait will prevent you from enjoying your journey here.\nPlay with an organic and mysterious ecosystem:\nInteract with graceful animals, ephemeral flora, and intriguing monoliths. Your actions will alter the world you discover in vibrant and unexpected ways, leaving you wondering what will happen with each path you forge and every hollow you stumble upon.\nProcedural population:\nThe forest only materializes around you when you get close, and it regrows in a new way each time you pass. The game features a graphically compelling procedurally generated environment that shifts continually. What will you find when you retrace your steps?”\nA dynamic soundtrack that responds to the player’s travels:\nThe audio shifts along with the visuals, providing an enveloping aural experience to match your psychedelic journey and amplify your immersion.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":32674,"name":"Monkey Island 2: LeChuck's Revenge","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f2/3f21894803ada962c35916a3c746cdc3_gl0wPJ0.jpg","description":"From Wikipedia:\r\n\r\nMonkey Island 2: LeChuck's Revenge is an adventure game developed and published by LucasArts in 1991. It was the second game of the Monkey Island series, following The Secret of Monkey Island, and the sixth LucasArts game to use the SCUMM engine. It was the first game to use the iMUSE sound system.\r\n\r\nThe game's story centers on the wannabe pirate Guybrush Threepwood. After defeating ghost pirate LeChuck in The Secret of Monkey Island, little is known of what happened between Guybrush Threepwood and Elaine Marley. The sequel involves Guybrush's attempts to find the mysterious treasure of Big Whoop.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"}]},{"id":23738,"name":"Ratatouille","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/041/0412a799c141fe81f72ed4b44e63e0c6.jpg","description":"Players will relive all the film's most thrilling and hilarious moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat!\nFrom the underground sewers to the bustling streets of Paris, players will dash, glide and slide through 6 action-packed, visually stunning worlds filled with dangerous enemies, intense heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"THQ","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"}]},{"id":21361,"name":"Pahelika: Revelations HD","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8a/a8a48f0b15e677c11cc477cf7b4f8730.jpg","description":"Pahelika: Revelations is a first person fantasy adventure, with exploration and puzzle solving being the main focus of the game.\nSudesh Budkoti, the titular protagonist of the series, has been having strange nightmares. Troubled, he set out to find the source of his problems. In doing so, he begins the greatest adventure of his life…\nAs Sudesh Budkoti, you will walk the crumbling, evil halls of the dark wizard academy looking for the spell that will open the dimensional storage, chance upon the old set of pictures and try to work out the story hidden within, figure out how to bypass the locked steel door of the inventor’s home, sneak into the abandoned library and get a nasty surprise...\nPahelika: Revelations is chock-a-block with puzzles both new and old, familiar and unfamiliar, simple and diabolical. You will find yourself casting spells, figuring out combination of locks, arguing with people, reading between the lines, adjusting machine valves, fixing electronics, solving light and mirror puzzles, answering philosophical questions and more.\nThe music is awesome, and is instrumental in making the game immersive. We absolutely recommend using a Headphone while playing Pahelika: Revelations. Dim the lights in your home a little bit (to help maintain the sense of mystery), put a headphone on your ears, and enjoy.\nStory\nFresh from his success in obtaining the magic book Pahelika, Sudesh Budkoti thought he was about to get some well earned rest. He thought wrong.\nNot only was he not about to get any rest, he would be called upon to save the world from an ancient evil he himself had unknowingly unleashed…\nExplore beautifully designed locations, converse with people to obtain clues, brew magic potions, inscribe scrolls, cast magic, and solve creative puzzles in this immersive game that will entertain you for hours.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ironcode Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":20727,"name":"T.E.C. 3001","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18c/18c4acbfd659dd24d01b6e1fb8839fa0.jpg","description":"Run, Rush, Haste, Burst\nSpeed has never been pushed this far.\nJump, Charge, Dodge, Slide\nYou just slipped and got crushed! You can’t handle T.E.C 3001 yet…\nTry again until speed holds no secrets for you.\nIn T.E.C 3001 (Tesla Energy Collector), you are guiding a cutting-edge technology robot to collect virtual space energy leftovers for humanity.\nWith great graphics and a unique heart-pumping soundtrack, T.E.C 3001 has what it takes to keep you on the right track.\nWinner of the Indie Games Summer Uprising 2011, the game arrives on STEAM.\nFeaturing:\n- 41 levels of speed bursting dexterity test.\n- Split screen multiplayer mode to challenge your friends on the same computer\n- Four ever-challenging game modes: Free, Drag, Speed and Endless.\n- 14 unique soundtracks to give you adrenaline rushes.\n- Simply the most hardcore runner game you can find.\nNOTE: Multiplayer is local. It means that 2 players can play on same machine, not over network","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phoenix Game Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19996,"name":"MechaNika","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd7/dd7df2546706b16a634612641ef8527b.jpg","description":"THE MANIFESTO\nProject MechaNika. Plan for the destruction of all things that aren't awesome.\nI, Nika Allen, 7 years old, am sick to death of this world. My parents don't care about me. My brother never takes any notice of me. At school I never get taught anything useful. There are loads of things that shouldn't exist. It's for these reasons that I've decided to destroy everything that isn't cool. With MechaNika I will destroy and eliminate the things and the people that I don't like. I'll start at home. Then school. This city. The entire world. I'll get rid of everything that's boring and pointless, and this world will be better for it.\nIf it's not cool, it will disappear. If you're not cool, hide. MechaNika is here.THE GAME\nMeet Nika, an intelligent girl that doesn’t fit the world in which she lives. Perhaps it’s the chocolate shake with a shot of cognac which she carries in her backpack which makes her different. Or maybe it’s the fact that at 7 years old her favourite things are the transfer of energy, magnetic fields and electrical engineering! But being the odd one out doesn’t matter to Nika. Not anymore. She has a plan to solve everything. A really… odd plan. You read the MechaNika manifesto, right?THE PSYCHOTIC ADVENTURES\nAs you help Nika in her mission to build a rusty weapon of mass destruction to destroy her world you will meet many unique characters. We want you to discover the freak stories of some of these characters and we will let you know about them through the Psychotic Adventures, a series of genre-spanning games that starts with MechaNika.THE WEAPONSA different adventure where you will join Nika in her quest to destroy the world. Go for it!\nLots of really fascinating characters with their own stories. Meet them!\nExtremely cool and colorful visuals, all hand-drawn!\nYou will face many puzzles with different ways to be solved. Choose yours!\nReferences to many other video games, anime series, movies and music bands. Can you spot them all?\nSeriously, you shouldn't skip the chance to play this game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mango Protocol","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":19916,"name":"Maui","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20d/20d58dab8c3e116d85dc3e47b0b7c4be.jpg","description":"The gods have trapped your sister. Prove yourself worthy to bring her back.\nMaui is a free action-adventure game based on Hawaiian mythology. The game features an innovative \"stat grid\" that lets you switch stats on the fly to face any situation.\nFeatures:\nPlay the game completely for free--no microtransactions, no DLC, just a free game for you to playExplore a beautiful ancient Hawaiian islandInnovative \"stat grid\" lets you switch character stats instantly at any timeCollect offerings and face trials from the gods Narrative and mechanics drawn directly from Native Hawaiian culture and mythology","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kokua Games","platforms":[{"id":0,"name":"PC"}]},{"id":19875,"name":"Steno Arcade","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/882/88208da2821d1f47153406b29d407e8b.jpg","description":"Steno Arcade is a suite of four arcade games designed to teach and drill steno and keyboarding fundamentals in an immersive, addictive, responsive, and interactive way. Steno Arcade is 100% free and open source and works with any steno machine or keyboard.\nThe Early Access build of Steno Arcade includes one of the four games in the suite, Steno Hero! Imagine your favorite rhythm games, but instead of pressing buttons that vaguely emulate the original instruments, you're hitting steno chords or keyboard keys to precisely and accurately produce the lyrics to your favorite music! It's like singing karaoke with your fingers! Steno Hero currently includes seven songs, with more to be added over time:\n“Sunday Smiled” by Hungry Lucy\n“The Standing Ones” by Hungry Lucy\n“I Think I Started a Trend” by Brad Sucks\n“I’m Your Moon” by Jonathan Coulton\n“Mandelbrot Set” by Jonathan Coulton\n“That Spells DNA” by Jonathan Coulton\n“I Feel Fantastic” by Jonathan Coulton\nWhile Steno Arcade is designed to be played with a steno machine, it can also be looked at as a traditional typing game that can be played with any standard keyboard. You only need an NKRO (N-key rollover) keyboard if you intend to learn stenography and want to play the game using steno. For example, the slower, easier songs in Steno Hero are perfectly playable using a standard keyboard, but when you get to the faster, harder songs you may find yourself having trouble keeping up with a standard keyboard and will need to use steno if you want to complete the songs with a high level of accuracy and precision.\nSteno Arcade is being developed on top of the Godot open source game engine, and the source will be released under the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0) license upon completion.\nSteno Arcade is brought to you by The Open Steno Project and For All To Play.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"For All To Play","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19534,"name":"Our Darker Purpose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dea/dea844e2e678a34d3494283427f2ecb9.jpg","description":"Journey to the dark heart of the Edgewood Home for Lost Children in this fiendishly difficult action RPG!\nWhen her teacher stepped out of the classroom a month ago, Cordy never imagined he would be gone for good. Now her fellow students have turned on each other as the school descends into chaos. Cordy must battle feral classmates and dangerous creatures as she ascends to the cruel Administrators’ offices atop the Edgewood Home for Lost Children.\nOur Darker Purpose is a top-down, rogue-like action RPG that combines the ingenuity of genre-defining classics with the expansiveness and accessibility of modern day action adventure games. The gameplay is steeped in a variety of influences ranging from A Link to the Past to The Binding of Isaac to Diablo. We love games with great mechanics and awesome, bizarre storylines, and that’s what we’re creating with Our Darker Purpose.\nEach playthrough features a unique set of procedurally generated levels. Death is permanent, but your accomplishments earn you resources to buy lesson and upgrades in the afterlife... and your education lasts forever. Every game teaches you more about the Edgewood Home for Lost Children, the disappearance of the adults, and the darker purpose of the Administrators.Key Features\nFast-Paced, Combat-Oriented Gameplay: Face unique boss encounters and challenging enemy mechanics! The Edgewood Home is a merciless environment. Dodge between fireballs and flying desks while your former classmates try to pummel you into the walls, and that’s just the lower levels…\nCharacter Variety and Customization: Assemble selections of randomized perks and upgrades to reflect your play-style – tanky bruiser, glass cannon, fleet-footed assassin, or anything else. Assemble your skills into devastating combinations… or pick style perks with no benefit at all, at your peril.\nOh Yeah, and It Takes Place in a Sinister Orphanage: Prepare for a an unflinching look at what happens when an already terrifying boarding school/orphanage goes all Lord of the Flies, and try not to get eaten by any of the possessed furniture. Only the psychologically strongest gamers will be able to withstand the insightful taunts of the Administrators themselves…Gameplay\nAllocate precious skills\nUncovering Edgewood’s dark secrets will yield valuable experience for Cordy. Each time she levels up, you’ll be able to select from one of two new abilities that she can acquire, depending on your play style and the situation at hand. You will never be as strong as you need to be, so prepare for some nail-biting choices…\nChoose your own ghastly fate\nThe house is different every game, and every level is uniquely generated. But fear not, there’s more than one way to ascend through a dystopic Victorian manor! Pick your route – would you rather battle a feral horde than risk an encounter with the dangerous Capulets? The choice is yours! Of course, each floor offers unique credit tokens to buy new upgrades, so choose wisely…\nAcquire eternal powers\nAdorable, creepy, stylized Edgewood Home students don’t give up when they fail --- they go to class. Each time you lead Cordy to a fiery (or chalky, or spikey, or venomy, or monstery) demise, you get some time to strategize with your kindly scarecrow guidance counselor. He is happy to offer his one-of-a-kind insight in many academic disciplines…","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Avidly Wild Games","platforms":[{"id":0,"name":"PC"}]},{"id":18261,"name":"Gems of the Aztecs","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f10/f10bc24f40c27fcf731e68c24a581eb3.jpg","description":"Find the treasure of an ancient people in Gems of the Aztecs.\nA wicked father refuses to allow his daughter to marry a poor man and sends him to complete a difficult challenge. The fate of the young hero and his beloved is in your hands! Help him find the treasure in the ruins of an abandoned city.\nCleverly designed puzzles, dangerous traps and the treasure of ancient and mighty rulers await you. Fulfill the hero Gerasim’s dream by completing a long journey through the abandoned country of the Aztecs. Diamonds, rubies, sapphires and gold are nothing in comparison to the heart of beautiful Isolde. Prove that you’re worthy of the honor of a great warrior, untold riches and eternal love.\n- An exciting match-3 game\n- Colorful and beautiful visuals\n- A gripping storyline\n- 120 unique levels\n- Powerful boosters and bonuses\n- Complex levels and traps for true experts","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wellore","platforms":[{"id":0,"name":"PC"}]},{"id":17523,"name":"Phantasmal: Survival Horror Roguelike","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/260/26047c8f20438820e544a6a79f7a1631.jpg","description":"Experience Terror that is Never the Same Twice with Phantasmal: City of Darkness, a procedurally generated survival horror where every playthrough is completely different. You simply cannot rely on your previous experience to guarantee safe passage.\nYou will need to face off against lurking, otherworldly horrors in the perilous, run-down Kowloon Walled City before its destruction in the early 90s.\nYou are fragile. Not just physically, but mentally as well. The grotesque creatures will challenge your very sanity and losing your mind can be a fate worse than death!\nThe odds are stacked steeply against you, but you can prevail through sheer cunning. You must scavenge for resources carefully, sneak past and distract your enemies. If you are caught, you can fight back, but don’t expect to live for very long.\nThe environment has been carefully crafted by none other than Brian Bell, critically acclaimed lighting lead of several Hollywood movies, including Riddick, Life of Pi, Ring 2.\nKey Features:\nFear the unknown: Every ramshackle, disgusting room and corridor is uniquely generated - battle your anxiety as you’ll never know what comes next!\nDon't Go Insane: Facing terrifying creatures and skulking in the suffocating darkness will erode your sanity until you can no longer tell the difference between reality and illusion!\nTread Softly: Every fight you have could be your last. Sneak past and distract your enemies as much as possible.\nLight, Both an Ally and Enemy: Every asset to survivability has a price. Use light sources wisely - you’ll need them to restore your sanity, but you’ll risk being seen!\nScavenge to Survive: Scrounge the environment for anything you can use: from firecrackers and flares through to wooden boards and metal pipes. Guns are rare, but if you find one remember that every bit of noise you make will attract more creatures, and eventually much, much worse!\nPermadeath: This is a high stakes game - once you die, the game is over!  However you retain any money you've earned to upgrade your stats or buy critical items to help you survive longer next time!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Eyemobi","platforms":[{"id":0,"name":"PC"}]},{"id":16946,"name":"Tulpa","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bae/bae58bf5ac687462dc0cd517f088aeb2.jpg","description":"Two beings entwined by fate; a girl and her soulmate, left to travel through a hauntingly elegant world where things can change in the blink of an eye. Explore the surreal landscape with them, solving riddles and negotiating fantastical obstacles in Tulpa, a unique puzzle platform adventure that's as beautiful as it is challenging.\nTaking control of Ophelia and her ‘tulpa’ Oliver, players must journey through lands full of mysterious, bizarre and often deadly encounters. Much is left to the imagination and it’s up to you to work out how to proceed, negotiating your way past traps and unravelling abstract puzzles to discover what lies at the end of your adventure.\nA world of wonder – Tulpa’s ever-changing landscape is full of surprises, meaning that you’ll never know what lies ahead…\nThe trials ahead – Each challenge in Tulpa leaves the player to work out how to progress, but the answer is always right in front of you. The question is, can you decipher it?\nTwo lost souls – Ophelia and Oliver each have unique skills, and you’ll need to use both of them to clear the many challenges that await you.\nA memorable world – Both hauntingly beautiful and cunningly deadly, the world of Tulpa is one that stays in the mind long after you’ve left it…","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Encryptique","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16741,"name":"Delta Force: Task Force Dagger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69d/69d20f8bd36c079158f338a96b7cbe60_SoLtODB.jpg","description":"As the US army's elite special operations soldiers you are the most potent 'smart weapon' known to man. You are the 'tip of the spear' for covert operations around the world — you are the first line of attack. Nothing stands in your way. From the war torn streets of Somalia you have been re-deployed to take out targets in Colombia and Iran. As the US military's preemptive strike force you must work with your team to get the job done.\nFeatures\nBECOME THE BEST — Play as any one of these Special Forces units: SFOD-Delta, 2/75th RANGER, SEAL Team 6, SFOD-SF Viper Team (Green Berets), CIA Special Operations, UK SAS 22 Regiment, Australian SASR, Canadian JTF-2, Marines Force Recon, and USAF CSAR (Air Force Pararescue) — all the actual Special Forces units deployed in Operation Enduring Freedom.\nINFILTRATE ACTUAL LOCATIONS — 25 new Delta Force missions! Take over the Kandahar Airport, raid rebel headquarters in Mazar-e-Sharif, ambush a convoy near the Pakistani border and demolish bunkers in the foothills of Kabul.\nOVER 30 WEAPONS TO CHOOSE FROM — Gear up with a huge arsenal of machine guns, assault rifles, sniper rifles, pistols and rocket launchers new to the Delta Force series.\nSPY ON THE ENEMY — Plan your attack with the element of surprise using visual intelligence gathered from Unmanned Aerial Vehicles.\nRAIN DESTRUCTION FROM THE SKIES — Call in devastating air strikes to take out key SAM and SCUD missile sites.\nLARGE-SCALE MULTIPLAYER — Create your own multiplayer games and maps with the mission editor. 10 new multiplayer maps included! *Battle online via NovaWorld.\n","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"NovaLogic","platforms":[{"id":0,"name":"PC"}]},{"id":13109,"name":"Pizza Express","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca3/ca3a39a5e54e1bcdbc795bb2b7aa1846.jpg","description":"Pizza Express is a fast-paced restaurant simulation for Windows, developed by one-man studio Onni Interactive, where you'll join the laborious Gastone and his reckless friend Lucky in a tasty adventure which will bring you from zero to hero.\nManage every aspect of your pizzeria and make it become the best eatery in town. But be quick! You only have 30 days to conquer the F.L.A.B.'s (Finger Licking Associated Bistros) hearts and top their table!\nReminiscent of classic hits like Diner Dash and Cook, Serve, Delicious!, you're sure to find hours of entertainment in Pizza Express!Features\nComplete control over YOUR menu! Design your very own pizzas: assign them a name, top them as you like and set their price.\nMore than 50 ingredients to unlock and choose from.\nA detailed management mode to neatly organise your small culinary empire. Purchase new tables, adjust the business hours, add new furniture to your restaurant, advertise it, propose scrumptious offers to your customers!\nA dynamic and unpredictable story, featuring subplots and alternate endings.\nA huge variety of zesty characters to meet and love (or hate).\nSuitable for all players and needs, thanks to 250 different possible difficulty combinations.\nTight competition in order to become the best restaurant in town.\nRetro graphics and music.\nAvailable in English and Italian.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Onni Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":9620,"name":"Magdalena","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e9/2e9f9b85e7c6f37294eae8dece9f5f40.jpg","description":"The mind dissolves in the surrounding darkness like pain dissolves in wine. Remains of memories crumble and rapidly leak like sand through fingers. And only one name stuck in the throat filled with fear. Magdalena... Minutes feel like days while waiting for something to happen. So the shadows become longer when the day dies.The light will direct your pathYou play as George, who got through bloodcurdling events.  The light will help you to find out these events.Recall EverythingIn order to gather a complete picture, you need to find all the fragments of memories and piece them together. What’s hidden behind the room’s door you can’t open? Restore the chronology of events and find the last element of the picture — a key to the room that’s been locked for years.Explore the World AroundYou can move and view every object in the house and outside it. Search for the clues that will lead you to the truth.\nWe were inspired by the Edgar Allan Poe stories while developing this game. We tried our best to create the same oppressive atmosphere of desperation and horrifying plot.\n\nWhen we were creating the game, we wanted to fill it not just with graphic, but the plot as well. That's why the game has that much of the text. In this case the game may be considered as visual novella, rather than adventure. But we have some gameplay here.\nTo make the player easier to understand how to play this game, we put that disclaimer here. At the end of every note there's a short hint of where you should go to find the next note. It might be any item in any place. Discriminating reader will be rewarded by complete and chronological story. But the game does not force you to play linear. You are free to explore the map and to find the notes circumstantially. Enjoy.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Yellow Bun","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":980502,"name":"Kingdom Come: Deliverance II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d84/d842fec4ae7bbd782d330f678c980f7f.jpg","description":"Kingdom of Bohemia, Early 15th Century: chaos has befallen the kingdom.  As invaders pillage this ungoverned land, sowing fear and terror, Henry of Skalitz seeks revenge for his murdered family.\n\nNow a trusted member of the rightful king’s allies, Henry is sent to escort Sir Hans Capon on a diplomatic mission. After they are ambushed and nearly killed, the two young men embark on a series of perilous adventures, putting their skills, character and friendship to the ultimate test.","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Warhorse Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":496649,"name":"Mighty Goose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b76/b761b37e518d4578f1abffc7587e25bd.jpg","description":"Traveling the galaxy, hunting down evil. This is the life of Mighty Goose. One of the galaxy's most credited bounty hunters!\n\nAt the core Mighty Goose is a tight side scrolling run & gun shooter that will test your skill, timing, reflexes. Building upon that solid arcade base, the game adds a ton of crazy weapons, warmachines, upgrades and secrets.\n\nAssume the role of Mighty Goose and bring the fight to the Void King. This galaxy conquering monarch commands a vast army of minions and mechanised monsters. Dealing with these baddies means traveling to distant worlds and facing all kinds of dangers. But not to worry, this is no problem for the legendary Mighty Goose!\n\n・Fast-paced run-and-gun experience with tight controls.\n・Battle against screen filling bosses that will test your skill, timing, and dodging\n・Customize your playing style using a combination of upgrade chips, secondary weapons and assist characters.\n・Pilot devastating war-machine vehicles to decimate large groups of enemies.\n・Beautifully crafted vibrant pixel art worlds, vehicles and characters.\n・An amazing soundtrack featuring crunchy synth-rock and funky jazz-fusion melodies. Composed by Dominic Ninmark (Moonrider, Blazing Chrome, Gravity Circuit).","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Blastmode","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":491704,"name":"M.A.R.S.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdf/fdf9ae1920fb0fd192a66035255294e3.jpg","description":"Join Our Discord Server~!\nAbout the GameIt's the year 20XX; military conflict between the League of Nations and UNITA run rampant across the globe, prompting small scale wars to break out in various regions. In order to combat UNITA's biochemical modification of humans, the League of Nations secretly developed the NRC: Insectoid Robots with frightening intelligence and a brimming consciousness, which sooner than not went rogue and became its own faction in this now-three-way war. The human world is now at stake, and a battle for survival and supremacy is being waged.\nFrom classic PvP modes such as Team Deathmatch, Domination, and Search & Destroy, to some more exotic modes such as Headhunter; where the player's head will grow with every successive kill! There's something for everyone amidst the many modes MARS has to offer! And fear not, those who enjoy a little PvE gameplay; MARS has dozens of those too! Fighting off aliens, dinosaurs, and robots in Wave based Survival modes, to pushing through UNITA's compound in challenging mini-campaigns with up to 4 players! There's no lack of things to do.\nEvery weapon in MARS comes with both a Level, and a Grade; each higher tier adding bonuses in terms of stats and abilities to your items!  Complete missions to be awarded upgrade materials, and use those materials to upgrade your weapons; ...simple! Many weapons can even simply be bought from the armory with currency gained from completing missions and challenges; you'll have your own fully stocked arsenal in no time!\nFrom 4 basic difficulty levels, coupled ontop of advanced challenge modes and unique settings; no thrillseeker or daredevil will ever be wanting more after trying out Nightmare Challenges! ...Or if you're feeling extra daring, give the Quantum Trials a go. Gather 3 of your friends and push through the floors! You'll be lucky to beat floor 1.\nSaving the world is no easy feat, but fret not! Your epic achievements and glorious accolades will be chronicled throughout fully voice-acted cutscenes and cinematics.\nTravel through time amidst your efforts to save the world! Fighting dinosaurs, mummies, robots and sorts of creatures from ancient history and the future... as well as some timelines that never happened!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Yingpei Games","platforms":[{"id":0,"name":"PC"}]},{"id":485118,"name":"Kill It With Fire: HEATWAVE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d7/5d724d1575ce237e8f1cf8ffab0d4470.jpg","description":"Wishlist the full game!https://store.steampowered.com/app/1179210\nAbout the GameJOIN OUR DISCORD\nThe spider - mankind’s most ancient and deadly nemesis.  As a licensed Kill It With Fire exterminator, it’s time to fight back!  Assemble your arsenal of increasingly excessive weapons, track spiders across suburbia, and burn everything in your path! HEATWAVE is a new free chapter with more weapons and new spiders! Get ready to set everything on fire, \"Kill It With Fire\" is coming soon!\nTo defeat spiders you must exploit their one weakness: FIRE. Or bullets. Or explosions, throwing stars, gettin’ smushed by stuff...pretty much anything, really.  But that doesn’t mean it’ll be easy - first you’ve gotta find the spiders.  Use state-of-the-art arachnid tracking technology to pinpoint your quarry’s location among hundreds of potential hiding spots - then, torch everything and smash the spider with a frying pan after it runs out.  It’s the only way to be sure.FeaturesDozens of weapons.\nCreepy crawlies.\n“Realistic” fire simulation system.\nGratuitous chaos and destruction.\nFinally learn the truth about spiders.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Casey Donnellan Games","platforms":[{"id":0,"name":"PC"}]},{"id":430320,"name":"KeyWe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5b/d5b00be72614011941e34cc3489d48ed.jpg","description":"The mail must flow! KeyWe is a cute, co-operative postal puzzler starring Jeff and Debra, two small kiwi birds working in a whimsical post office. With no hands to help them, they must jump, flap, peck and butt-slam their way across an interactive landscape of levers, bells and buttons to get those messages delivered on time.\r\nEncounter perilous postal environments and navigate seasonal hazards while waddling through the Telepost’s various mail rooms, and partner up with a pal to help these adorable kiwis complete their tasks, whatever the weather. Unlock new accessories to customise your kiwi and become the best-dressed mail bird in Bungalow Basin.\r\nMail room mayhem – Take on the role of a postal-working kiwi bird and partner up with a friend to type out telegrams, send urgent messages, ship packages and keep the mail flowing.\r\nCute, chaotic co-op – Buddy up on the couch or flock online.\r\nEqually cute single-player– Control both kiwi birds on a single controller to venture out on a solo mail service adventure.\r\nPerilous postal environments – Navigate post office desks and shipping rooms to become a master of the mail service.\r\nSeasonal silliness – Encounter hazards caused by wintery weather, autumnal thunderstorms and more on the way to becoming postal pros.\r\nCustomizable kiwis – Change the color of your kiwi’s feathers and unlock new accessories – because kiwi birds look cute in little hats!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Stonewheat & Sons","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":419937,"name":"Fights in Tight Spaces","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccc/ccc15a3defad8bcc0d4f2e7bc3f5f7ba.jpg","description":"Card-Based Tactical Fighting!\r\n\r\nFights in Tight Spaces blends deck-building, turn-based tactics, and thrilling animated fight sequences in classic action-movie settings. Learn to balance your hand, momentum, and positioning to overcome the odds to defeat your adversaries.\r\n\r\nPick from over 150 cards as you build a deck to suit your play style and your opponents’. Encounter random events, acquire enhancements (or injuries), and make critical choices about how best to upgrade your agent for the fights ahead.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mode 7","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":311642,"name":"Shadow Warrior Classic Redux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/855/855c0d5a8d48bf38334a097eadb3f087.jpg","description":"The definitive version of the cult classic shooter, Shadow Warrior Classic Redux features remastered visuals and two massive expansion packs. Corporations rule every facet of life in a near-future Japan and employ Shadow Warriors, one-man armies of unparalleled skill, to protect their power and forcefully remove all opposition.\nThe Zilla Corporation is the most powerful of these conglomerates and will stop at nothing to achieve domination unseen by any other corporation in the world. Lo Wang, Zilla Corporation’s legendary Shadow Warrior, discovers this corruption and the dark powers being summoned to aid his employers in this quest for absolute power. As a man of honor, Lo Wang vows to battle these demonic forces with an arsenal of explosive weapons, his silent blade, and a razor sharp wit.\nKey Features\nIncludes Shadow Warrior Classic Redux (OpenGL), two expansion packs - Wanton Destruction and Twin Dragon (OpenGL), and the original Shadow Warrior (DOSBox).\nRemastered visuals, a remixed main theme, and compatibility with modern gaming PCs.\nChallenging Steam achievements for only the most skilled warriors.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Devolver Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":282899,"name":"Enemy On Board","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41f/41f61a82056172d738f47d30d861479d.jpg","description":"SIGN UP FOR THE BETAhttps://www.eobgame.com/betasignupTRUST NO ONE!  6 players wake up on a spaceship and 2 are randomly selected to be secret Aliens. Fight, deceive, and sleuth to survive among the chaos. Last team standing wins.\nIF YOU'RE AN INNOCENT CREW...  Your ship has been infiltrated. Two of your crew mates have been replaced with shape-shifting Aliens. Scavenge weapons and tools from around the ship and use any and all of your sleuthing skills to identify and kill the Aliens before they kill you.\nIF YOU'RE AN ALIEN...  You look, talk, and walk like a crew member, but deep down inside, you are a bloodthirsty Alien. Work with your Alien partner to gather evolution points from unsuspecting innocents. Have enough? Transform into your true form and wreak havoc.\nBUILT IN VOICE CHAT Communicate with your fellow crew members to identify and kill the Aliens before they kill you. Be wary though, you might have an Alien on the other side of the line.\nRANKED MATCHMAKING Everyone starts at the bottom, but fight your way up the ladder and prove you can save the galaxy.\nUNLOCKABLE CONTENT Deceive and kill some humans to level up and unlock new skins, starting items, and cosmetics. Battle Pass ready!\nLAST BUT NOT LEAST Whether you are a two-faced Alien looking for more victims or a frantic crew member needing back-up, join the intergalactic community! https://discord.gg/enemyonboard\nCOMING SOON: SEASONAL CONTENT\nExplore the deepest Reaches of space. Seasonal updates will bring you new stories alongside limited edition characters, items, and aliens.\nCOMING SOON: MAP AND ITEM EDITOR\nBehold your inner creative. Build new maps, items, and modes to share with your friends. The possibilities are endless.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Windwalk Games","platforms":[{"id":0,"name":"PC"}]},{"id":53973,"name":"Ninja Gaiden","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e83/e838d4778e43eecfd4a30804e7396809.jpg","description":"Ninja Gaiden, released in Japan as Ninja Ryūkenden (Japanese: 忍者龍剣伝, literally \"Legend of the Ninja Dragon Sword\") and as Shadow Warriors in Europe, is a side-scrolling action-platforming video game. It was developed and published by Tecmo for the Nintendo Entertainment System (NES); its development and release coincided with the beat 'em up arcade version of the same name. It was released in December 1988 (1988-12) in Japan, in March 1989 in North America, and in August 1991 (1991-08) in Europe. It has been ported to several other platforms, including the PC Engine, the Super NES, the Virtual Console, and mobile phones.\nThe story follows a ninja named Ryu Hayabusa as he journeys to America to avenge his murdered father. There, he learns that a person named \"the Jaquio\" plans to take control of the world by unleashing an ancient demon through the power contained in two statues. Featuring platforming gameplay similar to Castlevania, players control Ryu through six \"Acts\" that comprise 20 levels; they encounter enemies that must be dispatched with Ryu's katana and other secondary weapons.\nNinja Gaiden has been renowned for its elaborate story and usage of anime-like cinematic cutscenes. It received extensive coverage and won several awards from video gaming magazines, while criticism focused on its high and unforgiving difficulty, particularly in the later levels. Over fifteen years after its release, the game continued to receive acclaim from print and online publications. It was novelized as part of the Worlds of Power NES game adaptations written by Seth Godin and Peter Lerangis, and it spawned a soundtrack CD.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"NES"}]},{"id":39405,"name":"Ratchet and Clank: A Crack in Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5dd/5dd4309687ef8ec5019072bc52b61c7f.jpg","description":"Concluding the events set into motion by Tools of Destruction, Ratchet & Clank Future: A Crack in Time will at long last answer some of the franchise fans' largest questions. After discovering that Clank's disappearance was engineered by Dr. Nefarious, Ratchet races to rescue his best friend. Unfortunately, he discovers that Clank's capture is just the beginning of Nefarious's latest diabolical plot. In this follow-up to the best-selling series, Ratchet & Clank Future: A Crack in Time puts players into the role of both Ratchet and Clank as they attempt to reunite and save the universe. Along the way, both will finally uncover the hidden truth behind their origins, and discover their ultimate destinies. As the duo come closer to reuniting, they'll have to ask themselves the biggest question of all: Do Ratchet and Clank’s destinies lie with each other? Or is it finally time for the universe's greatest duo to separate for good? Powered by Insomniac Games' fourth-generation PLAYSTATION3 system technology, A Crack in Time will continue to bring the experience of playing your own CG-animated movie to the PS3 system. Players will use new gadgets such as Ratchet's Hoverboots to explore levels and can take off in Ratchet's ship to discover nearby moons and planets. Clank will use new abilities to manipulate time to try and stop Dr. Nefarious.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":37221,"name":"Battlefield 2142","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/853/853c729f33a1a27935af11d083665761.jpg","description":"Earth, 2142. As a new ice age depletes the planet’s resources, two massive multinational coalitions wage a brutal war for the only cause that matters—survival. Armed with a devastating arsenal of futuristic weaponry you must coordinate the efforts of your teammates to win the war for Earth’s last fragile pieces of livable land. With extensive improvements to the groundbreaking Battlefield 2 ranking and upgrade system and the new Titan gameplay mode, Battlefield 2142 brings the franchise’s award-winning online warfare into a harsh and desperate future.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Digital Illusions","platforms":[{"id":0,"name":"PC"}]},{"id":36577,"name":"The Matrix: Path of Neo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/198/1988631ea35b530dea7d4257a37ac023.jpg","description":"The Matrix: Path of Neo is the second video game developed by Shiny Entertainment based on the Matrix trilogy. This time you get to play as Neo himself, starting from the day agents came to take him from his office, through the race against the clock with the machines digging towards Zion, to the final battle against Agent Smith.\r\n\r\nLike in the movies you'll start out as the untrained Thomas Anderson, and with the training and events of the movie your skills grow, enabling you to do complicated combos and take down upgraded agents.\r\n\r\nAlthough the game follows the events of the trilogy, there are some missions that come as an in-depth look of events only spoken briefly in the films.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Shiny Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":23755,"name":"Dragon Quest VIII: Journey of the Cursed King","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90b/90b54298e3285fd474bf27877e0c8a89.jpg","description":"The court jester Dhoulmagus of the kingdom of Trodain stole a powerful magical scepter sealed beneath the royal castle. Using the power of the scepter, Dhoulmagus destroyed the castle, placed a curse upon the kingdom and its people, and turned King Trode into a troll and the princess into a horse. A sole surviving castle guard journeys with the king, the princess, a reformed bandit named Yangus and a few other companions in search of the evil jester and a way to break the curse.\n\nDragon Quest VIII: Journey of the Cursed King is a traditional Japanese-style role-playing game with random enemy encounters, simple turn-based combat mechanics, and management of a party consisting of four characters, each belonging to a clearly defined class. Unlike its predecessors in the series and most Japanese RPGs in general, the game features a continuous world with fairly vast landscapes and integrated towns and dungeons, as opposed to world map traveling and locations represented by icons. The game features full camera rotation and optional first-person view. Like in the previous Dragon Quest games, many objects can be interacted with; for example, barrels can be physically lifted, carried, and broken, to reveal items hidden within.\n\nIn addition to experience points, the player receives skill points from battles, which can be manually allocated into a skill category of the player's choice. These categories include three different kinds of weapons, fisticuffs, and a discipline unique to each character. After a required amount of skill points has been invested into a particular category, the correspondent character learns a new ability or becomes more proficient with the chosen weapon. The Alchemy Pot system allows players to gather recipes and mix items to create new ones.\n\nThe international version of the game features several updates to the original Japanese version, including voice acting, graphic menu, symphonic soundtracks, and flashier effects.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Square Enix","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 2"}]},{"id":21571,"name":"The Manhole: Masterpiece Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df6/df63d242841ec69d1581efe09c1fb6e0.jpg","description":"In 1988 you met Mr. Rabbit and a host of his friends in the World of the Manhole. Your friends are still here, but they've done some remodeling. Prepare for a grand adventure in the world of the Manhole Masterpiece Edition. A world of epic wonder and whimsical magic. A fantastic world where every character comes alive and every new hallway leads to another wild dream. Just point and click. Soon you'll find yourself shooting down a winding waterway with Rejan Elephant. Click again and you're climbing to the top of the rook tower to great Molly Rhinoceros. Click on Mr. Rabbit's dresser drawer and moments later you're flipping through the pages of his noisy ABC book. Or you're suddenly transported to dine with that esteemed soul-cat, Mr. Dragon. So let the child in your home become the main character in a journey through an unforgettable land. A land where imaginations run wild and creativity is as close as the next wonderful doorway.\nThough officially for children, The Manhole has bright colors, magical locales, and cheerful adventure to delight players of all ages. Follow Mr. Rabbit through the manhole and into one of the most wondrous make-believe worlds you'll ever find. Your adventures under the manhole will take you to many odd places -- in this game, the journey is much more important than the destination.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":21375,"name":"Crash Time 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b1/8b1457dc2544e9a8073775146e4baac1.jpg","description":"Like its predecessors, Crash Time 3, the new installment of the well-known action racing game series, offers varied gameplay in top quality. The German game forge Synetic has once more taken the graphics engine a significant step further. In a gorgeous game world, completely explorable on wheels, the player gets to solve gripping criminal cases and master other diverse assignments.\nAn overview of essential innovations in Crash Time 3:\nCompletely reworked Story Mode: The previously published parts of the Crash Time series already offered tons of breathtaking action. Crash Time 3 also includes an all-new storyline. Right from the start, the player learns about the destructive power of a terrorist organization that will cross our heroes' path again and again during the game. In the course of the game, the player's objective is to discover more and more details and information regarding a series of crimes that seem to have no connection at first, and then solve everything in a grand finale.\nExtended scope of action: The player is immersed deeper into the game's storyline, interviewing informants and collecting information. And the player gets to decide how to proceed while completing the missions – simply stop the opponent with a block pass, or employ other means to achieve the given objective?\nPathfinding – improved navigation: An intelligent AI allows delinquent opponents to calculate the shortest paths automatically, and adapts the vehicle performance to the road conditions.\nFantastic driving physics: A state-of-the-art physics system offers an even more realistic driving experience.\nScore card: The score card lists the status of missions, the efficiency of the player's approach, and the game results in great detail.\nA gripping storyline and more than 70 missions with many different challenges await the player\nBad guys try to avoid capture with all kinds of tricks and driving stunts\nArea of 32 km2with more than 200 km of city streets and autobahn where you get to drive around by day and by night\nMore than 40 vehicles, from police cars and airport fire engines to tricycles\nThe Story mode creates a dense atmosphere\nThe dynamic pathfinder function of vehicles creates variation and increases the replay value\nTypical ambiance of the series, with extremely fast car chases and explosive crashes\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Synetic","platforms":[{"id":0,"name":"PC"}]},{"id":21092,"name":"Pixel Boy and the Ever Expanding Dungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07a/07aabb7bc7d420661702893353c25735.jpg","description":"Pixel Boy is an Action-RPG Shoot-em-up with dynamically generated stages across four acts each with an epic boss finale. Players can craft custom armours as well as stack and combine power ups into over 6000 different powerful weapons to overcome the dangers of the dungeon.\nNOW FEATURING CONTROLLER SUPPORT AND A BRAND NEW SURVIVAL MODE!\nFour uniquely themed acts each with dynamically generated dungeon levels within.\nEpic Boss Battles at the end of each act with unique mechanics and challenges\nMany different Combine-able and Stack-able Weapons and Power ups for OVER 6000!!! unique combinations\nCrafting system with five types of armour each with several tiered levels that have different effects and powers\nCharacter leveling with customize-able builds across several base stats\nMultiple Vendors and shops to purchase better items, power ups, and equipment\nA wide variety of enemies with unique combat approaches\nSteam Achievements\nSteam Trading Cards\nSurvival Mode\nController Support\nPixel Boy features an awesome electronic original soundtrack composed entirely by popular and talented French artist Pyramid.\nPick up the soundtrack today!\nhttp://0pyramid0.bandcamp.com/album/pixel-boy-ost\nHelp Pixel Boy on his arduous journey to become the Hero of Resolutia and this year’s Dungeon Runner’s World Champion!\nPixel Boy is a dungeon crawling top down Action Shooter. You control Pixel Boy and enter the randomly generated dungeons below the town of Resolutia. There are four acts in total, each with a powerful boss at their climax. Every dungeon is filled to the brim with aggressive and deadly enemies. As Pixel Boy you will encounter swarms of giant ants, packs of snapping dogs and even lethal dungeon birds. To help Pixel Boy bear this burden there are many tools at your disposal. Various pixel powerups can be found or purchased to help Pixel Boy overcome the treacherous dungeons beneath Resolutia.\nSpreadshot, Shields, Splitshot, Heat seekers, Critical Strike Modifiers, Time Stoppers and much more are available. Three pixel powers can be equipped at a time and are stackable AND combinable so that Pixel Boy can find the best combination of over 6000 powers to defeat his adversaries most efficiently.\nVarious types and tiers of armours can be crafted by obtaining the appropriate armour orbs dropped within the dungeons depths. Each piece of armour has different effects, abilities and levels of power dependent on its tier and orbs used to create it.\nThroughout the dungeon Pixel Boy may encounter a variety of randomly generated unique rooms. Make sure Pixel Boy pockets any keys he finds, as treasure rooms have chests that are always locked to protect their secrets. Be wary every time Pixel Boy moves from room to room, as simply entering a room could trigger a dangerous trap; locking him in the room until every monster has been defeated within. Pixel Boy should also pay close attention to torches as they could lead the way to secrets and treasures. Collect all the coins Pixel Boy finds and spend them on items, powerups and armour at the shops back in town.\nPC\nMac\nLinux\nWe would like to extend a big thank you to everyone that has supported us along our journey in the development of Pixel Boy, you all kick butt and have made it super worthwhile. If you would like to follow us or discuss anything Pixel Boy related, feel free to visit our site, twitter, and like us on Facebook. Please don't hesitate to let us know about a bug, error, exploit or heck, even just something you dislike, we are always listening.\nWe hope to be able to continue to update the game and add features continually after release, free of charge of course.\nSo don't hesitate to send your suggestions and ideas.\nGiant Box Games\nhttp://pixelboygame.com\nhttp://www.facebook.com/pixelboygame\nTwitter - @TeamPixelBoy","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Giant Box Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20910,"name":"Shadow of Kingdoms","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd9/cd956b42ab2bf2ea8e920ea17ac866ce.jpg","description":"Shadow of Kingdoms is an up and coming strategy RPG game. Play as the heir of a long lost kingdom, you will discover the secret to your country’s destruction and restore your rightful throne. Shadow of Kingdoms is set in fantasy background where the angels, demons, giants, and undead roam the earth. Build your city and recruit powerful allies to defeat evil. The game’s strategy turn based battle along side real time dungeon exploration let the player to make all the decision. Only you can decide the fate of your kingdom!\nThe game features:\n4 unique playable races\nAll unique dungeons\nPvP Conquest and Raid modes\nBuild and upgrade your city\nDynamic in game events\nReal time dungeon exploration\nTurn based encounter battle\nGuilds and alliances to honor your kingdom","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"TernGame","platforms":[{"id":0,"name":"PC"}]},{"id":19479,"name":"SAGA","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/796/796001b4e2122425b59611517df239cd.jpg","description":"The world's first and longest running Persistent MMORTS is finally on Steam! SAGA has been running since 2008, when it revolutionized the genre. We call SAGA an MMORTS because you build cities, command troops, and manage resources like in a traditional RTS, but also go on quests, chat with your friends, join guilds, and trade like an MMO. SAGA is an RTS with battling similar to the Total War series, mixed with city building from Stronghold. Build your army by collecting cards found in booster packs, or trade in-game resources for them in the auction house.Persistent WorldDesign, build and expand your own kingdom.\nManage peasants as they collect resources to help you build and maintain your fortifications even when you're not online!.\nResearch and discover new technologies in your quest for total dominance.Customizable UnitsYour units level up and gain experience points that persist between battles.\nCollect over 100 different kinds of troops and over 50 spells.\nCollect loot from fallen enemies to customize and improve your units.Solo and Co-op QuestingJoin with friends in Cooperative Mode or battle solo on over a thousand quests!\nCreate and join guilds which regularly give resource benefits.\nTrade resources and troops with other players directly, using the Auction House, and with trade routes.\nPvP is completely optional, but participate in PvP for unique rewards including booster packs, troops, and items!FAQI heard this game is pay to win. Is that true?\nWith the latest 1.50 update, we are focusing on bringing many more cards to the game's marketplace for in-game currency, making the full experience available for free. So pay to win is now a thing of the past!\nWill my current SAGA account work on the Steam version?\nYes, since the Steam version uses the same servers, your account will still work. You can also still use the standalone client if you prefer.\nDoes SAGA have subscription fees?\nNo. SAGA has absolutely no subscription fees. Instead, players are encouraged--but not required--to buy their troops in booster packs. Purchased troops remain a player's property, and can be traded with other players for different troops. Troops can also be obtained from the market with in-game gold.\nTroops become more powerful as you use them, gaining experience, new weapons and armor over time. Players can customize their armies to their nation type, drawing from over 150 different troop and spell types to find the combination that works best for them.\nWhere can i find more information about the game?\nYou can find loads more information about the game on our official site.\nWe also have an official gameplay and support focused FAQ.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wasatch Games","platforms":[{"id":0,"name":"PC"}]}]