[{"id":15362,"name":"Crossing Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d7/1d793262440ea88ef7a4e7a812dc0a7a.jpg","description":"It’s 1986 in California. A group of friends discover a mysterious pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control five kids with specials skills while fighting and solving puzzles in order to save their families and the world.\nCrossing Souls is an action-adventure with RPG touches set in a pixeled California. Control five characters: Chris, Matt, Charlie, Big Joe and Kevin. Each one has unique skills and their own combat style. Fight in real-time combats, solve diverse puzzles, beat powerful bosses and play special levels inspired by 80’s arcade videogames. As the game progresses you can unlock new items and abilities that will be helpful for this world-saving adventure. Fights and puzzles will become more difficult, so you’d better have a well-planned strategy.\n\nFeel the eighties - Do you feel that? Do you smell that? Yeah, it's the eighties. A story set in 1986 full of references such as The Goonies, Gremlins, Back to the Future and many more.\nDo you like Cartoons? - The cutscenes are inspired by 80's cartoons, totally original and never seen before in a videogame.\nWhy is this happening? - Be part of a journey between two realms, two realities: life and death. The story includes a government conspiracy, thousand-year-old characters, cowboys, pirates, ice cream, pizza, cheeseburgers, basketball… well, you got it.\nThis music rocks! - An original score that includes tracks inspired by John Williams and Jerry Goldsmith as well as radical Synth-Pop in the purest 80’s style. Play as if it was one of your favorite movies!\nReady? Fight! - You can kick multiple enemies in the ass stylishly. Fight against street gangs, a secret army, dead monsters, creepy ghosts and many more in frantic real-time combats where a good strategy will be essential to win. Main characters have unique talents and aptitudes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":7335,"name":"Super Mega Baseball: Extra Innings","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e7/0e79f96203066c9a271f2cc7adf07409.jpg","description":"Tight controls and a smooth learning curve will have you knocking it out of the park in no time in this awesome arcade baseball simulator. Polygon’s 2014 Sports Game of the Year.Features:Realistic Simulation and Physics: Don’t be fooled by the light-hearted/comical presentation; the fundamentals of baseball are well represented and if someone isn’t familiar with the rules, they will be after playing Super Mega Baseball.\nGroundbreaking Difficulty System: Super Mega Baseball boasts an innovative difficulty control scheme called the Ego system. The Ego system offers a fine-grained control of difficulty on a per-user basis, which has been widely praised for leveling the playing field in cooperative and competitive modes. This system will push seasoned gamers to their limits while simultaneously providing a gentle introduction for beginners.\nUp-to Four Player Local Co-op Play: In addition to solo play, players can try their hand at head-to-head, 2v1, 2v2 and co-op against the CPU. In co-op mode, teammates alternate batting/running each time at-bat, and alternate pitching/fielding each inning, meaning ballplayers need to be on their toes every play. To even games, players can use the Ego system to set up a competitive game between friends of any skill level.\nUltra Responsive and Blazing Fast Gameplay: Controls are easy to learn, but players will need to master jumping, diving, wall-catches, power-swings and cut-off plays to properly dominate friends. Short load times and a streamlined interface means most of the time is spent in the action, with nine-inning games taking around 20 minutes to play.\nFull Batting and Pitching Statistics: Most baseball statistics imaginable are available and ballplayers can use these to show off their MVP-quality skills.\nLeveling System: Players tally up Starpoints for hits, strikeouts and catches during each game and Level Up once they collect enough points. Players can hire staff to train and coach their squad, improving skill attributes such as Power and Speed. Use that jacked up team to win at higher difficulties (and post higher leaderboard scores than friends)!\nPlayer Customization: Customize the look and names of a team’s players to create a ragtag crew of family and friends. Make as many aesthetic adjustments as you can imagine!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Metalhead Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":462688,"name":"Steelrising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3b0/3b0f57d0fbb23854f300fb203c18889b.jpg","description":"Paris, 1789. The city is in the grip of terror. The Revolution has been suppressed with bloodshed by Louis XVI and his merciless mechanical army. It falls to Aegis, an engineering marvel, to take on the king's ranks of automatons and change the course of history.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Spiders","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":306082,"name":"Love Thyself - A Horatio Story","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/908/908adf88586934a87d9db7fa96b60688.jpg","description":"Part 1 - Available Now!\nAbout the Game\nPlunge forehead-first into the exhilarating world of Horatio, the Endless galaxy’s most perfect being. Experience life as a freshly-decanted Horatio clone on his first day of cadet school.\nWill you be the obedient servant of the great forehead in the sky? Will you manage to woo one four uniquely identical Horatio clones? Or will you skirt the line of disobedience and risk the wrath of the gene-splicer-in-chief?FULL IMMERSION\nAn exclusive deep-dive into the culture of the most fabulous being in the Universe. Your body and genes have never looked this good.Multiple narrative arcs & endings\nChoices matter!  Will you find your way to the battle-training simulations or end up bathing in a tropical waterfall? Survive or thrive, it is up to you…Colorful, retro-futuristic hand-drawn art style\nLife as Horatio can be stressful at times, but that doesn’t mean you shouldn’t enjoy it in a gorgeous, unique 2D art style. Only the finest stuff…An almost canon storyThe Endless Universe’s “true story” gets rebooted every time you start a new game. Love Thyself: A Horatio Story positions itself firmly on our in-universe sliding scale of canon as a “dude, probably.”","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Amplitude Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":37907,"name":"Insecticide: Episode 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eea/eea23fef9f21c2995433e221a5f52914.jpg","description":"Enter the fast shooting world of INSECTICIDE as hot shot rookie Detective Chrys Liszt and help solve a crime of epic proportions.  Lead your team on a bug hunt, collecting clues and solving puzzles. Use old-fashioned street smarts, unique insect abilities and an arsenal of ingenious bug weapons to confront your suspects.  Explore a futuristic world of mutant insects and uncover the truth in a city infested with corruption.\nIt won’t be easy solving this mystery, but some buggy’s got to do it!\nAction Detective Shooter\t\t\t\t\tReal-time 3D third-person view combines action-based platforming with weapons-based combat.\nUse specialized bug weaponry and unique insect abilities.\nAdventure Detective Puzzles and Crime Solving\nPut your detective skills to the test and lead a crime investigation in a futuristic world of mutant insects and film noir locations.\nCollect clues to solving a gripping mystery brimming with twists, turns, and double-crossings. Interrogate suspects, interview witnesses, and play good cop/bad cop to get the info you need.\nAn immersive story worthy of the best detective flicks\nA cast of nearly 30 unique characters woven into an addictive plotline where each clue reveals a deeper part of the mystery.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Creat Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19490,"name":"Cold Fear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5fd/5fd2077f451fb4cf675ae4141c13fd7a.jpg","description":"In a ferocious Arctic storm, distress signals are sent from a mysterious Russian whaler. As leading Coast Guard veteran Tom Hansen, you board to investigate — and discover unthinkable horrors lurking beneath the ship's bloodstained decks.\nBrave dangerous waters: Rocked by huge breakers, you must steady your nerves — and aim — to evade a watery grave.\nKeep your bearings: Battle against increasingly mutated enemies in treacherous, unstable environments.\nUnleash a torrent of weapons: Create fatal traps and use shotguns, flame throwers, or any object you can find to survive.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Darkworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":16060,"name":"Chains","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac5/ac54cd29f982ed82e8120cce308865bd.jpg","description":"Chains is a challenging puzzle game with a unique feel and distinctive vector graphics style. The object of the game is simple - to link adjacent bubbles of the same color into chains. As you progress through the physics-driven stages it becomes increasingly more challenging and players' speed, strategy and skill will be put to the test.\n20 levels each focusing on action, strategy or flow\nPhysics-driven gameplay\n3 difficulty modes\nColorblind option\nUp to 15 player profiles\nUnique art direction with beautiful vector graphics\nSoundtrack from the Belgian electro band Silence\nUnlimited replayability value\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"2DEngine.com","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12059,"name":"Amazing World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dfc/dfc5ca336ccd22c2146c6a155cc7a707.jpg","description":"The evil Queen Vexa and her minions have invaded Amazing World. Now the Zings need YOU to help save their beloved home!\nChoose your character and jump right into tons of quests, mini-games, and multiplayer events as you explore this family friendly, fully featured 3D MMO!Amazing Features\nHundreds of Character Quests: Play hilarious, fully voiced stories to boost your skills!\nDecorate Your World: Hundreds of items to customize your home and yard.\nCooperative Adventures: Team up with friends to thwart mischievous enemies!\nCompetitive Play: Compete with friends to earn the golden crown!\nDress Up: Choose from hundreds of clothing items and design your own outfits!\nEpic Monsters: Work with friends to defend Amazing World from Vexa's monstrous crew.\nHunt For Treasure: Grab a map and a shovel to search for legendary treasure!\nDrive the Springmobile: Hop in and speed through exciting Character Quests!\nGo Fishing: Cast a line and then display your fish in a new aquarium!\nAchievements: Show off your skills by claiming every achievement!\nCollections: Complete collections to earn exclusive items!\nKid friendly: Violence free. Moderated and filtered chat (parental approval required).\nhttp://www.amazingworld.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ganz","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":573277,"name":"Norco","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b23/b23e516c7c846435b9e7708a73207b67.jpg","description":"NORCO is a sci-fi Southern Gothic Adventure that immerses the player in the sinking suburbs and verdant industrial swamps of Louisiana's petrochemical hinterlands. Your brother Blake has gone missing in the aftermath of your mother’s death. In the hopes of finding him, you must follow a fugitive security cyborg through the refineries, strip malls, and drainage ditches of suburban New Orleans.\n\nImmerse yourself in an uncanny and surreal South LouisianaNORCO features detail-rich and atmospheric pixel art born from the natural and industrial landscapes of South Louisiana, accompanied by the eclectic soundscapes of composer Gewgawly I.Meet strange, unforgettable, and dangerous charactersNavigate your way through a world of uncertainty and moral ambiguity as you venture deeper into the swamp to unravel the threads left by your brother. Fight, sneak, or fast-talk your way past any hometown bullies, security contractors, or death cults that stand in your way.Explore vast scenic landscapes of pulsing nightlife and eerie solitudeSkulk through the crowds of downtown New Orleans, recruit a wild-eyed river dog, break into a refinery, boat through cypress swamps, and explore the desolate batture woods of the Mississippi River.Discover a world haunted by both past and futureFrom Southern Gothic literature to adventure game classics to experimental indies, NORCO fuses its wide sources of inspiration into something new and unseen.\nNVC: That's when your dreams began?\nCatherine: Yes. Towers falling from the sky. I’d stay awake just to avoid them.\nNVC: You say here that they lasted for years.\nCatherine: I worry that I somehow passed them onto Kay. She’d have nightmares of cell tower lights. She said they grew closer every night.\nNVC: Have you told anyone about these dreams?\nCatherine:  No.\nNVC: And tell me about the robot.\nCatherine:  Million?\nNVC: That's right.\nCatherine: She came to me in the parking lot when Kay was twelve or so. She knew Blue from his days at the refinery. I stared for a long time into her constellation of eyes. They swirled in a kind of desperation. I took her home, knowing it was a mistake.\nThe refinery is a maze  //  The swamp has a brain  \\\\  The mall is a fever dream","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Geography of Robots","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":545029,"name":"eFootball 2022","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb1/eb1ff1ffdab179ff7f0987d0266d4fe5.jpg","description":"PES, the iconic soccer game series, has been rebranded to \"eFootball™\" this year.\r\nThis change signals a new era of virtual soccer, with enhanced graphics and gameplay.\r\nGet ready to enjoy a brand new soccer experience that only eFootball™ 2022 can offer!\r\nOur ultimate goal has always been to create \"the perfect head-to-head experience\".\r\nTo achieve this ambitious objective, a new engine was implemented, changing the game from the ground up. This engine provides a completely new way to showcase player animations, a focus on 1v1 battles, and updated commands for offense and defense.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":46801,"name":"Shoppe Keep 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59a/59aa2b87df120adc819ad2ac8ad75ae9.jpg","description":"Shoppe Keep 2 is an open world, first-person, multiplayer-focused merchant simulator, and is inspired by the shopkeepers that we know and love from classic RPGs and MMOs. While adventurers are out slaying dangerous beasts, and selling an alarming amount of stolen plates, cheese and bread, the merchant is keeping their shelves stocked. It’s easy to imagine an ordinary shopkeeper’s duties, but then again... Why settle for the ordinary?In Shoppe Keep 2, you choose how you want to conduct business. Buy your stock from several suppliers around town, or take on lucrative and dangerous missions to secure high class stock that fetch higher profits. Close your Shoppe and explore the town, the forest, and maybe even a cave or two - and battle dangerous enemies in search for sweet loot! Ahem, stock. Stock.\nPlay Online or Play AloneNew to Shoppe Keep is the ability to play with friends, in four-player online co-op! You’ll be able to manage a much larger store more efficiently with several players, and share your love of retail online. You’ll also be able to flaunt cosmetic items you find while exploring, making your friends envious. Share the responsibility and riches!\nIf you want to play by yourself, instead, that’s fine too! Shoppe Keep 2 supports single player gameplay and will allow you to run your Shoppe without the addition of pesky friends who may compromise your Shoppe’s décor and profit.A Town of ChangeWhile your shop grows, so too will the town around you. There will be higher-levelled warriors looking for a good deal on a powerful sword, but the environment will also change to reflect the new level of wealth that your town has secured via a profitable adventure Shoppe.\nA changing economy affected by playersJust filed a big order of health potions? Chances are that you may have oversaturated the market and the value of these items is now at an all-time low! Shoppe Keep 2 has an optional mechanic, which tracks in-game stock that players all over the world are selling, and sends the info to our server. This information will be used to adjust item demand, mark ups that customers will find acceptable, and more! This info may also be used for seasonal events and unique rewards for players.Wear it All or Bare it All!Not only will you stock hundreds of items, but you'll also be able to equip every single one of them yourself, each with varying damage and armour stats. Use swords, bows, maces and wizard staffs while also equipping a variety of armour pieces.\nThough remember that while a fierce armour set will strike fear into your enemies, perhaps going completely stark naked will have an equal or greater effect?\nAn expanded character creator features in Shoppe Keep 2, allowing you to choose gender and skin colour. And don't be afraid to express yourself - the custom Shoppe Keeper editor also allows you to change hair styles, eye colour and to add a spiffing beard.\nBut if you're looking for something more permanent than hairstyles, how about tattoos? There's a wide range to choose from - from street-cred-boosting skulls, to poop.The New and Improved Helper BotThe Helper bot began life in the original Shoppe Keep as a humble servant to pick up dropped stock, place them on the shelves and zap thieves. The new and improved helper bot does all of that too, alongside general cleaning, but with an added frustration core which will flip off customers that they find aggravating. Other emotional cores may become available in the future to truly make your helper bot more human.Jumping isn’t going to make you moneyBut you can do it!\nRunning a ShoppeIt’s not easy running your own Shoppe. You’re under constant threat of theft from sticky fingered customers, and there’s a barbarian encampment just outside of town - which is constantly threatening the local villagers with a looming attack. But there are those who have worked their way up from zilch to run a fine and profitable establishment. A treasured document passed across generations and etched into toilet paper has been the very corner-stone of Shoppe endeavours for centuries. It lists the five-step process for a successful Shoppe:\nOrder\nPlace\nPrice\nSell\nProfitOrder stockAn empty Shoppe is not a Shoppe… it’s merely a collection of rooms. So you're going to want to make sure that your shelves are stocked with the finest wares available. The sacred Order Scrolls, passed down from Shoppe Keeper to Shoppe Keeper is fine and dandy for those standard everyday items. But there will be village vendors that will dabble in exclusive items and may only visit the town once a week. Of course, before you go and order a dozen items from these travelling salesmen, make sure there is a demand for them first, or you may be sitting on stock that no one wants!Place StockApproaching customers in a trench coat, pockets full of stock, and being the store is frowned upon by the villagers. Displaying your wares on a fancy pedestal or a table will make them much more enticing for customers. Of course, make sure that you build the right furniture for the right items. Don't go around building armour racks to store all your hats and swords!\nIf you place a large number of similar items in your Shoppe, becoming a more specialised store, your establishment’s plaque will change and you'll be granted some additional bonuses when selling those items to customers.\nWill your business thrive on variety, or will a focus and expertise be more lucrative? Keep in mind that the customer’s always right, and so you'll need to change up stock of your wares based on customer demand.\nPriceHow much is too much? Affordability is subjective, but today’s adventurers keep up with current trends and are wise to the price fluctuations of weapons and apparel. If you price an item too steeply, a sticky-fingered rogue will gladly take an item or two off the shelves without paying!\nThe price gun is the latest in economical tech. A roll of the gears adjusts the sticker price, and with just a swipe of the arm and a beep, an item’s price is adjusted. Keep an eye on your customer’s reactions when browsing your wares to consider a reasonable price for goods.SellYour clientele have their own needs and desires. You can't sell a wizard staff to a warrior - they just wouldn't know what to do with it! Then they'd want a refund, but probably won’t be able to express their desire for a refund because they'll be in the caves of Ranzagullta, battling a terrifying three-eyed Kobold Queen! All of which, while the staff you sold them magics small particles of dust into a flock of taunting seagulls. Clearly, they'd be dead, and that means no repeat custom!\nIf a customer likes what they see, they'll either buy it, or steal it. Of course, by the decree of the king, you have permission to take matters into your own hands should someone try to go for the five-finger discount. ProfitSays it all really!Features\n•             Run your very own adventurer’s Shoppe, selling potions, weapons, apparel and *ahem*… herbal products\n•             Expand your Shoppe from a single room to a two-floor mega Shoppe\n•             Four player online multiplayer\n•             An economy that changes with the online community. Sell too many health potions and the market will become over saturated\n•             Explore the open village, forest and distant lands to procure rare resources\n•             Take on forest dwellers and pick up some sweet loot\n•             Sell epic dragon armour, or equip it – all items in the game have their own stats and can be equipped by the player\n•             Employ helper bots to automate your Shoppe\n•             Craft with various ingredients to procure new products","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Strange Fire","platforms":[{"id":0,"name":"PC"}]},{"id":32330,"name":"Strong Bad's Cool Game for Attractive People: Episode 4 - Dangeresque 3: The Criminal Projective","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/11c/11cafc267b90faf3826a3c9cf40ad731.jpg","description":"Strong Bad is here to show you how it's done in his handcrafted\ncinematic masterpiece, Dangeresque 3: The Criminal Projective. You play\nDangeresque, a dirty cop in pursuit of a little action and several big\nsacks of cash. Can our hero stay alive long enough to defeat his\narchnemesis, save the world, and get the girl? Looks like he's gonna\nhave to jump...\n\nCheck\nout the rest of the series!\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":19731,"name":"The Tower Of Elements","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/292/2924065fee1ca39d0ed9ae6abbfb26dd.jpg","description":"Master the magic of Elements. Defend your tower against sneaky goblins using magic attacks. Upgrade the Tower to earn more mana points and Gems! Compare with your friends in versus mode or fight togheter in coop mode. Try to become the best in steam leaderboards and collect all the Achievements!\nThe Adventure awaits!\nFEATURES:\n★ Quick and Entertaining Games\n★ Immersive Experience\n★ Easy to Learn, Hard to Master\n★ Upgradeable Tower with Mana Points\n★ Collect precious Gems!\n★ Unlock new Powerful Mages!\n★ Leaderboards, Compare with Your Friends and Players from around the World\n★ Achievements, to test Yourself against friends\nFUTURE UPDATES:\n★ More Towers to build!\n★ New unlockable characters\n★ New game modes\n★ ...and more!\nGo ahead and see for yourself, Tower of Elements needs to be protected and you are the only one capable!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wulo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19648,"name":"Damnation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9da/9da54595a8b04299934a1a3780ca0a7f.jpg","description":"Evolving the shooter genre with its unique and exhilarating combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fire conflict, Damnation will feature vast, breathtaking landscapes, each covering miles of distance and thousands of vertical feet.\nBilled as a shooter gone vertical and visually inspired by iconic elements of American history, these massive streaming landscapes will form the battlegrounds for a post-industrial conflict between humanity and an unstoppable arms dealer hell-bent on total world domination.\nChoose your own paths and navigate the world by performing daredevil feats on the edge of human ability\nIntelligent enemies will give chase and engage players in frantic gun fights and attacks that can come from any direction\nMiles of awe-inspiring landscapes and up to three hours of actual gameplay per level\nA full-range of unique vehicles from wall-riding motorbikes to armour piercing mobile artillery provide high-octane thrills\nExtensive multiplayer options, including drop-in-drop-out co-op","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Blue Omega Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":4888,"name":"DeathSpank: Thongs Of Virtue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/044/044e5b13aded82f8d3bd0936c24f7f84.jpg","description":"Join DeathSpank, in his all new adventure! Fight through war-torn battlefields, tame the violent High Plains and sail your own pirate ship through the savage seas. DeathSpank will vanquish all-new evils, help all-new downtrodden, and dispense justice as only he can. Wield exciting new weapons, slay unbelievable new creatures and get to the bottom of the Thongs of Virtue. The downtrodden cry for justice and DeathSpank will save them or kill them trying.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":38805,"name":"Strong Bad's Cool Game for Attractive People: Episode 2 - Strong Badia the Free","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf0/bf04a2a96592fce1aca4b76388775bc5.jpg","description":"Strong Badia the Free is the second of five monthly episodes starring\nStrong Bad–the self-proclaimed \"coolest person ever\"–and the rest of the\ncast from the popular Homestar Runner web cartoons. When Strong Bad\nfails to obey the King of Town's totally unfair e-mail tax, he's placed\nunder house arrest. Once freed from his wrongful imprisonment, Strong\nBad goes on a mission to unite the local warring factions under the\nStrong Badian flag. Is Free Country USA ready for such an awesome ruler?\nStrong Bad Episode 2: Strong Badia the Free also has the Videlectrix\narcade classic \"Math Kickers Featuring the Algebros,\" plus all-new\nachievements, collectibles, costumes, and Teen Girl Squad comics. You\ncan even use Strong Bad's Lappy to send e-mails and pictures to your Wii\nFriends! So what are you waiting for? Fire up Strong Badia the Free and\nget ready to kick some doughy King of Town butt!\n\nCheck\nout the rest of the series!\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":17549,"name":"Monstrum","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca5/ca597031e8800b0333142c334dd95fa2.jpg","description":"Monstrum takes the traditional survival horror formula and remixes it completely with procedurally generated levels, permadeath, and AI driven predators, ensuring that nowhere on its derelict cargo ship is ever truly safe.\nOffering up a challenge to even the hardiest of gamers, Monstrum will force you to use your wits and whatever tools you can find to outrun or outsmart your pursuer. Attempt to escape from an environment that is out to kill you while evading the lurking terror that could be around any corner. Can you survive Monstrum?\nGame Features\nThree Unique Monsters\nFace one of three monster types each play-through, each one with different behaviours and tactics. Can you work your way out of an ambush or escape a direct attack? And will the same actions work every time?\nProcedural Arena\nPrepare for a different gameplay environment each time you play as the ship's interior shifts shape with every run, changing the location of items along the way.\nEscape Routes\nDiscover different methods of escape and delve into the bowels of the ship to recover items you need to repair them.\nOpportunities and Hazards\nUse whatever you can find to try and outwit the monster. Hide in lockers or under furniture. Use distractions to attract the monster to you, or, perhaps more wisely, to where you've just been, but be careful not to run too fast lest you fall into one of the ships numerous traps along the way.\nPermadeath\nDeath is death. Get killed in Monstrum and you'll be starting again. In a different ship, probably against a different monster. Good luck. Start running.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team Junkfish","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":17035,"name":"Planet of the Eyes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/851/851b1a3fa9b57c9f1a63e39470f5e6e5.jpg","description":"A finalist for \"Best Indie Game\" at the Canadian Videogame Awards, Planet of the Eyes tells the tale of a service robot stranded on a mysterious planet.\nWith a stunning visual mix of puzzle and platforming challenges, an original musical score and fully voiced audio logs, Planet of the Eyes will sweep you away on the immersive journey of a lone robot in an unknown world.\nGameplayPlanet of the Eyes will keep you on the edge and test your platforming skill. With quick respawns upon death and physics-based puzzles to solve, there is a mix of challenges that rewards experimentation.Handcrafted LevelsEach level is uniquely crafted to present puzzles and progression through the world. With environments that tie in seamlessly with the narrative, you’ll want to explore every corner to discover the secrets that lie beneath.Retro AestheticThe game art features smooth vectors and a rich colour palette, inspired by a retro sci-fi aesthetic; with original artwork by Vanessa Chia of Cococucumber.Mysterious Story & Atmospheric ScoreA dark story by Will O’Neill (Actual Sunlight) will be revealed, with a full in-game vocal narration by Alex Lewis. With an immersive score by critically acclaimed Sound Designer John Black, the atmosphere will haunt you on your journey through this world.Failure is FunWith more than twelve uniquely deconstructive robot deaths, every mistake in Planet of the Eyes is worth making at least once. The rest is up to you.Follow us:Twitter | Facebook | Press Kit | Website","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cococucumber","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12839,"name":"All Guns On Deck","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/073/07377bb57a5188f00de5d2c31ce95d9f.jpg","description":"The vast horizons are full of pirates, vagabonds with no claim to the ground their feet tread. Amongst the bandits scattered across the oceans, four factions dominate the worlds main landmasses. Eutopia's conquest will be the force that rids the world of its calamity. Making way for a new era of prosperity, with all continents under one banner.\nIn a world where sea battles are the punch line of jokes uttered by historians, the generals of Eutopia focus their efforts on reviving the lost art of ship building to aid in the campaign against aerially superior foes. Hiring small bands of mercenaries to take to the seas and launch a global attack on all fronts from beneath the skies. Though, as men once again set sail, the ocean reminds why the depths were abandoned all those years ago.\nAll Guns On Deck is a strategy, real time tactics action rpg, naval combat game with a unique battle system and unforgiving world to conquer. Players find themselves in the boots of a naive young sea captain, eager to take to the waves in support of the war effort of his great nation.Features:Intense sea to aerial combat.\nCapture ports & destroy enemy garrisons.\nBattle colossal sea monsters.\nCommand up to 5 guns on your warship.\nTake full direct weapon control or manage ships crew.\nMultiple crew types from welders, engineers, fireman and many more.\nTons of items and consumables to find.\nLoads of weapons to arm your vessels.\nMany ships from cruisers to aircraft carriers.\nA vast world spanning 6 continents.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]},{"id":10902,"name":"CRACKHEAD","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d78/d7800cfacdf43d510d4860eff71fe54e.jpg","description":"Get CRACKHEAD and enter the ultimate 2D breakout challenge. Exclusive to Steam with unique and fun game modes including a level editor.\nCan you complete each game mode without cracking your head?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kev Jackson","platforms":[{"id":0,"name":"PC"}]},{"id":6842,"name":"Energy Cycle","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/619/6191ae2e1bcefe10af1610073f736f48.jpg","description":"Don't miss our new games!http://store.steampowered.com/app/448470/\nAbout the Game'Energy Cycle' – new puzzle game from the developers of ‘Energy Balance’. When you click each cell on the game field - it changes color, and the colors of adjacent cells horizontally and vertically. Your task to bring all the cells to the same color. Sounds pretty easy, but try to do it!\n'Energy Cycle' feature three modes for every taste:\n- Puzzle\n(Without timer. Pre-designed puzzles.)\n- Time Attack\n(With timer and scoring. Random puzzles.)\n- Infinite Play\n(Without timer. Like ‘Time Attack’, but you can play it forever.)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sometimes You","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":3833,"name":"Blood Knights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ac/1acfcc028bda29b9fe2b73f64c1d87e3.jpg","description":"Combine your vampiric skills with the sharp edge of your blade in this medieval vampire hack‘n‘slay. Battle through hordes of monsters to restore your honor after you, a legendary and feared vampire hunter, have been turned into a vampire yourself!\nDeck13 (Venetica, Jack Keane) brings you an action-packed RPG, where you can play solo or co-op: Switch between the close-combat warrior and the crossbow wielding vampiress at any time while in singleplayer; or play co-op with a friend, joining your forces to defeat the onslaught of the evil hordes. Strike down your enemies using devastating close-combat and ranged attacks or whirl your enemies around and suck their blood using your vampiric abilities.Key Features:Action packed combat, close or ranged, paired with RPG elements\nSwitch between two playable characters with vastly different skills on the fly\nWhirl your enemies around and suck their blood using your vampiric abilities\nPlay single player or co-op with a friend, joining your forces\nInteract with the environment using your attract and repel skills\nMultiple choice dialogues will affect how the world perceives the player\nVampire story narrated with atmospheric cut-scenes\n160 available weapons and 40 different armour elements","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":39093,"name":"Strong Bad's Cool Game for Attractive People: Episode 5 - 8-Bit Is Enough","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b74/b7409fffa249c388cbcd1ccd53908628.jpg","description":"Strong Bad's Cool Game for Attractive People is a 5-episode series\nstarring Strong Bad, star of the Homestarrunner.com web cartoons and\nself-proclaimed coolest person ever. With four episodes out now and one\nstill to come, the series is headed for an exciting climax in 8-Bit Is\nEnough, starring Trogdor!\n\nThe beefy-armed dragon of legend has shaken free from his video game and\nis running through the countryside, burninating everything in sight.\nWith a dragon on the loose and 8-bit classics leaking into the real\nworld, it's all fun and games until the proud land of Strong Badia falls\nto Trogdor's fiery wrath. Now Strong Bad must take back the night by\nsending this scorching menace back into his arcade cabinet once and for\nall. Just one problem... does anybody know how to kill a dragon?\n\nJoin with Strong Bad's party and send Trogdor packing in the smoldering\nseason finale, 8-Bit Is Enough, coming soon to WiiWare. And make sure to\ncheck out the rest of the Strong Bad series in the Wii Shop Channel.\nLike a TV sitcom, the Strong Bad games are self-contained and you can\njump in with any episode.\n\nCheck\nout the rest of the series!\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":38931,"name":"Strong Bad's Cool Game for Attractive People: Episode 3 - Baddest of the Bands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be2/be2b55406a535f86e815a3ba150aac7a.jpg","description":"Rock and roll! Hurting for cash, Strong Bad sets out to dominate the\n\"Battle Royale of the Bands.\" Can he rule the stage and win the big\nprize? Or will he be drowned out by the competition? Find out in this\nhigh-voltage episode!\n\nCheck\nout the rest of the series!\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":20239,"name":"Heckabomb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9f/e9f747f13955df0d1273229d62caa7b0.jpg","description":"About the game\nHeckabomb is a twin-stick shooter for Windows. Works great with any controller. Supports mouse+keys play too. It has varied levels based in a circular arena and a host of upgradeable stats including bullet spread, rate of fire, turbo boosters and magnetic collectors. There are six varied add-on weapons too, including a chain-lightning gun, bullet-reflecting satellites and a rapid-fire swirly thing! (a legal requirement of any arcade shooter) Loads of different of enemies, including huge boss warships, missile batteries, tractor beams and a deadly enemy ace pilot will challenge your arcade reflexes and endurance.\nTwin-stick (controller or mouse+keys)\nVisually intense, massive explosions, huge debris clouds, trails everywhere\nSpectacular arcade soundtrack\nCampaign mode, Survival Mode, Hardcore Mode, AI Duel Challenge\nOnline hiscoresYour planet is dead\nThe Heckabomber is a doomsday weapon, the only thing that survived the destruction of your home planet by the alien armada. Loaded with devastating planet-destroying bombs, you'll fight across the Universe. Seek out enemy worlds to obliterate, crush their defenders, crack their planet and harvest the remains for construction materials to upgrade your ship and continue your rampage.Asteroids\nAsteroids exist throughout the Universe and are often the leftovers of planet formation. With Heckabombs detonating across the galaxy, asteroids are often the leftovers of planet destruction too! Mining them for resources allows you to build new weapons, upgrade equipment and resupply smartbombs.\nEvery second level you'll race to harvest asteroids before the blast wave reaches you from the planet you just blew up!Planets\nAfter charging up on ship upgrades, you'll take on aggressive enemy ships, crash through their defensive lines and try to get close enough to their planet to drop a single, devastating Heckabomb onto it.\nEnemies come in various shapes and sizes from tiny fast-moving divebombers to massive lumbering tractor-beam transports that'll try to pin you down for other enemies to shoot.Warships\nEvery 10th level, you'll face increasingly huge enemy Warships. Each one carries a unique bonus upgrade that you can only get if you choose to engage the Warship rather than steer clear of it's deadly weapons and fighter launch bay.Hardcore\nIn Hardcore mode you get no continues and enemy accuracy, rate of fire and bullet speed all increase substantially. One life only, extra challenging fights, vie for a place on the elite hiscore table.Casual\nCasual mode unlocks when you complete just one level of the main campaign. It offers a lot less challenge and a lot more salvage loot, making for a relaxing shoot-em-up ride up through the game as far as the first Warship encounter. Practice your moves in relative safety, or just watch the pretty explosions.Survival\nUnlocking the bonus Survival Mode gives you a huge upgrade budget to customize your ship just once then hurls you into an endless battle against increasingly ferocious odds and a limitless armada of enemy Warships.Duel\nFace the elite enemy ace pilot in the campaign and you'll unlock the bonus Duel Mode where you can challenge the ace alone (with his 5 elite henchmen... hey, he is a bad guy!)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Allicorn Games","platforms":[{"id":0,"name":"PC"}]},{"id":10110,"name":"Conarium","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9d/d9d1cc993172d6bd8d67d320340a135b.jpg","description":"Conarium is a chilling Lovecraftian game that follows the gripping story of four scientists and their endeavour to challenge what we normally consider to be the \"absolute\" limits of nature. Inspired by H.P. Lovecraft's novella At the Mountains of Madness, but largely set after the original story.\nYou, as Frank Gilman, open your eyes inside a room filled with strange, pulsating noises. Patterns of lights executing a Danse Macabre on the walls is presented by a queer device on the table. Having recalled nothing other than that you’re in Upuaut, an Antarctic base located near the South Pole, you find the place deserted and have a distinct feeling of something being terribly wrong. Somehow knowing that your memories cannot guide you enforces a strange feeling of vulnerability, a familiar yet alien sensation of being a part of a peculiar whole... Soon you will discover that having used the device during the expedition, you have died but then returned subtly changed, speaking of strange memories and of strange places. You have lost something important or gained something sinister...\nExplore the Antarctic base, as well as dreams and visions. Study clues and unlock secrets, whilst avoiding macabre beings at all cost.\nKey features:\nA deep and suspense-filled Lovecraftian story with lots of secrets and Easter eggs.\nOminous but wonderful graphics created with Unreal Engine 4.\nMultiple endings.\nA haunting and atmospheric soundtrack.\nPowered by Unreal Engine 4, Conarium aims to bring cutting-edge visuals for a more immersive storytelling and gaming experience.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zoetrope Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":4145,"name":"Twisted Metal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0af/0af1f89053246f42278ae911aec14e40.jpg","description":"With four factions battling for control, players step into the combat boots of a twisted disciple in a high octane, highly destructible world. Players fight for the prize of one wish fulfilled by the stylishly evil Calypso, the mastermind behind the Twisted Metal tournament. Disciples strategically dismantle opponents in vehicles loaded with weapons of Twisted destruction.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3464,"name":"Switch Galaxy Ultra","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/def/def0913faa39516b2157431349ab6808.jpg","description":"Switch Galaxy Ultra is an insanely addictive, fast-paced arcade challenge. Weave your way past obstacles and enemies as you travel across the galaxy collecting Tantalum for Dakur Technology. It’s loaded with content and features that will have you blazing across the galaxy at breakneck speeds.\nEarn credits to spend on new ships and upgrades, hit speed-ups and collect power-ups to get record times. If that’s not enough try out the survival mode with one life and infinity in front of you, how long can you last?\n• Truly exhilarating high-speed gameplay\n• 6 stunning vehicles, fully upgradable\n• 55 challenging levels\n• Episodic Comic designed by original WipeOut concept artist Darren Douglas\n• Cities designed by WipeOut co-creator Jim Bowers","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Atomicom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2283,"name":"Finding Teddy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48a/48aa77d35bf57278f721d64096ca8ecf.jpeg","description":"We are currently working on Finding Teddy 2 !!\nStay tuned, we are currently sending confidential preview versions to journalists\nSpecial Offer : Buy Finding Teddy and get Free OST !\nIn Brief\nThe revival of Point'n-Click.\nGraphics completely handmade, realized pixel by pixel.\nAn adventure divided into three chapters including dozens of riddles with multiple side quests.\nNo dialogues. Riddles and Music are the main point of the game.\nPC/MAC/Linux Versions Bonus\nGame in HD. We reworked all the backgrounds.\nNewgame+ : Two ways to restart the game. With the colored Girl and with a Tarant Mask. You can see the fireflies with the mask.\nAdded a bonus scene after the endings. Find how to get it.\nAdded an alternative endings in a newgame+. Be attentive during your newgame+, you can find a hint that tell you how to get it.\nStory\nA little girl was sleeping peacefully with her Teddy bear, when suddenly, a monster popped out from her cupboard then stole her favorite plush.\nWhen closing the door, the little girl awoke then got inside the cupboard. and was projected into a magical world, full of monsters and oddities.\nShe must now explore this strange land and help its inhabitants in order to rescue her Teddy.\nStill one question remains : will she be able to go back to the real world ?\nCharacters\nThe little girl : She's the main character, she's looking for her Teddy bear.\nMister Fly : Very useful fly to access some items where the little girl can't go. Very courteous.\nMister Cat : Has a bad temper, nevertheless useful to access small places and narrow galleries. Just need to scratch its back.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Storybird","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":242,"name":"Asphalt 8: Airborne","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a0/8a08bbf37f602041183946d0b029d218.jpg","description":"200 MILLION PLAYERS CAN’T BE WRONG!\nTAKE A SPIN WITH THE FRONTRUNNER OF MOBILE RACING GAMES!\nACCLAIMED BY PLAYERS & THE PRESS!\n“The iOS platform has quietly become a haven for great racers, and Asphalt 8 looks to be leading the pack right now.” - TouchArcade\n\nWINNER: **2015 MWC Best Mobile Game App**\nWINNER: **Winner of 2014 Pocket Gamer Best Sports/Racing Game Award**\nPERFECT SCORE: ** 5/5 – TouchArcade**\nPERFECT SCORE: ** 5/5 – AppSpy**\nPERFECT SCORE: ** 5/5 – Slide to Play**\nPERFECT SCORE: ** 100/100 – GameReactor**\nPERFECT SCORE: ** 5/5 – MacLife**\n\nLEAVE GRAVITY IN THE DUST!\n• 140+ OFFICIAL SPEED MACHINES: Ferrari, Lamborghini, McLaren, Bugatti, Mercedes, Audi, Ford, Chevrolet… We got ‘em all!\n• STUNNING GRAPHICS: Interactions between the vehicles, environments & tracks are a fully physics-based experience!\n• ARCADE GAMEPLAY AT ITS FINEST: Feel the thrill of gravity-defying racing across 40+ high-speed tracks!\n• THE ULTIMATE MULTIPLAYER RACING EXPERIENCE: Race in real-time multiplayer action for up to 12 opponents & dare your friends to ghost races!\n• WIN BIG: Participate in our Limited-Time Events to stack up amazing & exclusive rewards!\n• MASSIVE CONTENT DEPTH: 400+ career events, 1,500 car mastery challenges, 5 unique game modes, car collections. An endless stream of single-player content!\n• CUSTOMIZE & UPGRADE YOUR RIDES: With over 2,300 decals, take down your opponents with style!\n\nJOIN OUR RACER COMMUNITY!\n• FACEBOOK: facebook.com/AsphaltGame\n• YOUTUBE: youtube.com/c/AsphaltGames\n• TWITTER: twitter.com/Asphalt\n• INSTAGRAM: instagram.com/asphalt8\n_____________________________________________\nVisit our official site at http://www.gameloft.com\nFollow us on Twitter at http://glft.co/GameloftonTwitter or like us on Facebook at http://facebook.com/Gameloft to get more info about all our upcoming titles.\nCheck out our videos and game trailers on http://www.youtube.com/Gameloft\nDiscover our blog at http://glft.co/Gameloft_Official_Blog for the inside scoop on everything Gameloft.\n_____________________________________________\nThis app allows you to purchase virtual items within the app and may contain third-party advertisements that may redirect you to a third-party site.\nPrivacy Policy: http://www.gameloft.com/privacy-notice/\nTerms of Use: http://www.gameloft.com/conditions/\nEnd-User License Agreement: http://www.gameloft.com/eula/?lang=en","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Gameloft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":586199,"name":"FINAL FANTASY VII REMAKE INTERGRADE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/acf/acf26d699ac392c014656f7fb3224d3d.jpg","description":"By exploiting mako, the life-blood of the planet, through their mako reactors, the Shinra Electric Power Company has all but seized control of the entire world. A ragtag group of idealists, known as Avalanche, are one of the last bastions of resistance.\r\nCloud, an elite SOLDIER operative-turned-mercenary takes part in an Avalanche operation to destroy Mako Reactor 1 in the city of Midgar.\r\nThe bombing plunges the city into fiery chaos, and Cloud is tormented by visions of a bitter enemy long thought dead.\r\nOnce more begins a story that will shape the destiny of an entire world.\r\nThis game is a remake of FINAL FANTASY VII, first released in 1997.\r\nThe first title in a multi-part series, it is based on the story from the original game, up to the escape from Midgar, adding in new elements.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":53762,"name":"Contra (1987)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/352/352193b7e28b030ca879485f67515c75.jpg","description":"The Famicom/NES versions of Contra are an expanded port of the arcade version, developed in-house. The biggest difference is that the levels are restructured and significantly longer, with stages 5 through 8 being derived from and expanded from areas in the arcade version's final stage. The plot is altered as well, being set in the year 1987 in the Amazon, rather than 2633 in the Galuga archipelago. Weapons are slightly different in function and frequency, and the Konami Code makes a famous appearance. The Famicom version has additional graphical effects and between-mission cut-scenes not seen in the NES version.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"NES"}]},{"id":19493,"name":"Heavy Bullets","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/482/48295c4df8eb4ba6f09c3137c91e8711.jpg","description":"Armed with a simple yet stylish revolver and six devastatingly plump bullets, you must reset the security mainframe to restore order and reap the rewards of a job well done. To succeed in the game, players will need to move carefully and make smart use of their bullets, items, and the environment as rushing into new areas is the fastest way to get killed in the untamed wild of the neon corridors.\nLimited Ammunition - Begin each attempt to reach the mainframe with just six bullets for your revolver that must be picked back up after each shot and manually reloaded one by one - make them count.\nA Plethora of Items - Discover items and perks to aid you on your way to the mainframe. From homing bombs and coin magnets to a teleporter and high heels, each item will change up your approach. Choose wisely as you can only carry one item unless, of course, you find a backpack.\nShopping and Banking  - While death is permanent, money in the bank can live on for future attempts at reaching the mainframe. Make a deposit or withdrawal from one of many conveniently placed automatic banking machine throughout the facility. Or just blow your cash on a shopping spree - up to you.\nLife Decisions - Invest in items like Life Insurance or a Last Will that, if carried during the time of your unexpected death, will save your money, bullets, bombs, and keycards for your next attempt.\nAggressive Creatures + Malfunctioning Security - Face down dozens of nasty creatures lurking around the colorful hallways and the now malfunctioning security drones meant to defend against those same creatures.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Terri Vellmann","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14550,"name":"Greed: Black Border","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b8/8b801b6a6e1d6e01547c38740a85f4c0.jpg","description":"Hack ‘n slash your way through this science-fiction-themed action/RPG.\nIn the futuristic universe of GREED, the discovery of new interstellar travel possibilities has led to a new age of colonialization. The five largest colonial powers are entangled in a full-scale war over a new element called Ikarium, the recently discovered rare source of nearly unlimited energy. As a former member of an elite military unit, you will fight a battle for your survival not knowing that your actions will lead the fate of all mankind into dramatic consequences…\n\nThree entirely different character classes to choose from\nA huge variety of different levels in three unique settings, each playable on 3 difficulties, inhabited by fierce and deadly creatures & screen-filling end bosses\nUpgradeable skills in three categories per character class – the simultaneous use of these categories causes thrilling skill combinations\nUpgradeable character attributes with direct game play effect\nHundreds of items to collect that upgrade weapons and amour\nOnline and local cooperative multiplayer mode for up to three players\nOFFICIAL SOUNDTRACK AVAILABLE\nClick here to download the Greed: Black Border Official Soundtrack for free! (97MB .rar)","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]},{"id":10417,"name":"School of Dragons","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31c/31c38375c184be8ee616c7df5cff8e0d.jpg","description":"**Changewing Dragon now Available**\nFly Fast. Train Hard. Learn Well. Be the Ultimate Dragon Trainer! Create your own Viking and train dragons in this 3D MMO.\nJoin Hiccup, Toothless, and Gobber in the School of Dragons where you can play in the DreamWorks Animation “How To Train Your Dragon” universe with all your favorite dragons and Viking friends. Learn everything from science basics to the art of shooting fireballs, all while soaring through the skies on your very own dragon!\nRaise, nurture and train your dragon — the more you accomplish with your dragon, the more you bond with it and rise in the ranks at the School of Dragons. Also, join up with others in clans to adventure together and dominate the land of Berk while obtaining fame and rewards!\nExperience all the fun and adventure of “How To Train Your Dragon” in a 3D world when you enroll in School of Dragons!\nFeatures\nVisit familiar friends like Hiccup, Toothless and others from the “How To Train Your Dragon” franchise. Discover new friends as you progress in the School of Dragons!\nPlay AND Watch -- View clips from the movie that immerse you into the world of Berk!\nFly with Toothless, Thunderdrum, Whispering Death and all the other dragons in Flight Club as you become the ULTIMATE DRAGON TRAINER!\nRace your dragon against dragon trainers worldwide to win rewards and glory!\nThe vast world of Berk beckons you with activities such as learning to fly your dragon, fireball shooting, farming, fishing and so much more!\nCreate your very own, unique avatar. Pick your own dragon and customize its appearance from a multitude of options.\nSocialize with your friends or meet new ones in this fantastic, expansive universe!\nMystery Boxes: Uncover fantastic treasures to help you in the School of Dragons.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Knowledge Adventure","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":2974,"name":"The Four Kings Casino and Slots","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b4/2b433924da1569468fcf0ce539d3996a.jpg","description":"The Four Kings Casino & Slots is a social MMO that allows you to immerse yourself in a simulated casino experience. You will start off by creating a personalized 3D avatar that represents you in the online world. As you play, you will be rewarded with more extravagant and prestigious clothing to further customize your look. As soon as you enter the casino you will be able to participate in the most popular casino games like Texas Hold’em Poker, Slots, Blackjack, Roulette, Video Poker, and more. The Four Kings Casino & Slots is a living, breathing world that is constantly evolving with new events, clothing, and games.\nAt The Four Kings Casino & Slots you can play at your own pace. You can socialize and play at low limit tables, or you can work your way into the VIP section and play for high stakes. The top ranked players at the end of each season in the casino are awarded with exclusive in-game rewards. Seasons last 3 months and the Number 1 ranked player will get their picture posted in the Hall Of Fame.\nGet the royal treatment at The Four Kings Casino & Slots.Localization Note:The title is currently localized to Danish, French, German, Greek, Italian, Russian and Swedish with a varying amounts of Arabic, Bulgarian, Chinese (Traditional) Czech, Dutch, Finnish, Hungarian, Japanese, Korean, Norwegian, Portuguese, Portuguese-Brazil, Spanish (European), Spanish (Argentina), Spanish (Mexico), Thai and Turkish in progress. If you would like to help localize to your preferred language, please get in touch with us directly via email - info[at]digitalleisure[dot]com. We'd love to have your help!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digital Leisure","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58948,"name":"Hellbound: Survival Mode","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/725/7256c00e42e9984ef2763e91975f2a13.jpg","description":"Hellbound is a First Person Shooter game in the vein of the classics DOOM, Quake, Duke Nukem 3D, Blood and many others.\nIt's GROTESQUE! Focused in action, speed and gore.\nIn this Survival Mode version you fight against hordes of enemies in a small island until you're done.\nWe're working on the Single Player Campaign! You can pre-order it at our official website, and also get your place inside The Heroes' Cemetery ->","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Saibot Studios","platforms":[{"id":0,"name":"PC"}]},{"id":28520,"name":"Crackdown 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28f/28f1665c1727b532aa027005197d3897.jpg","description":"The sequel to the award-winning vertical-world adventure, Crackdown 2 is the ultimate open-ended world action experience, only available on Xbox 360®. The game lets you be judge, jury, and executioner for a huge, fully explorable city. Crackdown 2 takes multiplayer gaming to unprecedented levels for the ultimate co-op and competitive multiplayer experience, providing you and your friends with the complete freedom to explore, destroy, and play your way as you restore justice and peace to Pacific City—by any means necessary.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ruffian Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":264764,"name":"Railroad Corporation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98a/98ac4c16b1ca3b3353ab8143eea9f422.jpg","description":"Begin your career as an ambitious employee of a 19th Century railroad company, in the Golden Age of Steam. Manage the business by obeying the directions of your bosses. Build railroads, tunnels and bridges to towns and cities old and new, and decide how to use the railroad to the best advantage of the company. Marvel at the stunningly beautiful scenery that you must blast, dig and tunnel through – nothing must stop the railroad! If you excel, you will get the chance to set up your own Railroad Corporation, build up the local economy and earn your fortune in the New World. In order to be the very best, you must be across every aspect of your railroad empire, making new investment decisions, lobbying politicians, managing the global resources of your business empire, and constantly looking over your shoulder at the competition.\r\nKEY FEATURES:Build and manage your very own 19th Century Railroad Corporation, using track, tunnels, bridges and rolling stock\r\nHistorically accurate locomotives and rolling stock to choose from – research and upgrade stock as you become more successful\r\nBlast, Dig and tunnel through a beautiful landscape, from town-to-town\r\nExert your influence on towns and cities, buy real-estate and run a vast business empire\r\nPlay alone, against an opponent, or against many fierce competitors\r\nEngage in political lobbying, play the stock market and defend your huge business empire against your enemies","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Corbie Games","platforms":[{"id":0,"name":"PC"}]},{"id":35576,"name":"The Simpsons: Hit & Run","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d20/d20a46fb6d3b176b2613b2c234c710d5.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Radical Entertainment","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]}]