[{"id":15936,"name":"Awe","genre":"Adventure","price":0.0,"description":"Feel the thrill of yourself, once again hearing someone walking right behind you, in a completely deserted alley.\nYour feelings and logic are very important in this game.\nFeel like a detective in a strange and extremely dangerous place.\nInvestigate the loss of people, simultaneously solving puzzles and trying not to fall into the trap.\nYou will need to complete the entire puzzle first of all for yourself. You must understand what is happening, who is behind it all and how to stop it, if it can be stopped. To search for evidence you need to be as careful as possible, but not concentrating on just one thing. This can play a trick on you!\nAnd yes - you are the only one who was sent to this city. The government believes that some large sect has been located in the city, so residents are not allowed to get in touch. Officially, your task is a diplomatic visit. If you fail, the question will be raised about military intervention, which threatens a transition to a full-scale war and, as it turns out, people around the world will be killed by what people are not able to realize.Features:Pretty unusual horror game to play.\nSay \" NO !\" to darkness in horror projects!\nNo scrimmers! Only real horror!\nNo superpowers, you are an ordinary person who can die.\nThe game is developed by one person and represents an integral vision of the correct horror project.\nSustainable game development roadmap, including multiplayer for 2-8 people.","imageUrl":"https://media.rawg.io/media/screenshots/51a/51ab8d91b9a692b77ac5f5c18cd77537.jpg","releaseYear":2015,"developer":"Basov Bohdan","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13556,"name":"Attempt[42]","genre":"Action","price":0.0,"description":"Attempt[42] is a challenging first person puzzle platformer.\nIn order to clear the level, as fast as possible, you have to defy gravity and change the layout of the level. Game Modes:  Time Attack - Complete the level within the given time.\nFreerun - Take all the time you need.","imageUrl":"https://media.rawg.io/media/screenshots/b7b/b7bdebb59e6460456224f59f57b9aaa4.jpg","releaseYear":2016,"developer":"ThinkOfGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12859,"name":"Crush Online","genre":"Action","price":0.0,"description":"Crush Online is a Free-to-Play PVP MMO with MOBA-style combat in a persistent world.\nParticipate not just in single matches, but an epic war! Choose between one of three factions and many distinct characters with tons of different weapon setups and enjoy truly spectacular and tactically challenging combat with and against other players or NPCs.\nCRUSH ONLINE isn’t just a match. It’s WAR!\nFeatures:\n•\t3 nations fight for glory and wealth\n\n•\tMOBA-style combat to conquer territories\n•\tTons of weapons with unique skills\n•\tExpand your territories to gain resources\n•\tDefend and upgrade your guild castle\n•\tA politcal system with King election","imageUrl":"https://media.rawg.io/media/screenshots/d64/d644d8424d1a249102c4d121f07cedb1.jpg","releaseYear":2016,"developer":"JoyImpact","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11515,"name":"Command Ops 2","genre":"Strategy","price":0.0,"description":"Assess, Plan, Order, and React – The Decisions are Yours!\nCommand Ops 2 is a wargame engine that lets you assess, plan, order and react at the operational level just like a real Corps, Division and Brigade commander.\nWhat sets Command Ops 2 apart from the competition is the most advanced and realistic model of command decision-making implemented to date in a commercial wargame. It is based on:\n* Hi-fidelity modeling of continuous time and space;\n* Realistic command structure and process;\n* Macro management; and\n* Orders delay.\nFor that, Command Ops 2 is different than any other simulation wargame: no hexes, no turns, no micro management, no click fests. That is why it is in a way simpler and more fun to play but at the same time more challenging, because it makes you command like Commanders do.\nCommand Ops sports some of the most advanced and impressive AI ever devised in an operational-level wargame. It is your choice whether to manage every detail of your army or have the friendly AI manage the war on a lower level while you plan the larger scale maneuvers designed to make short work of your enemy. Just as a historical commander, you can choose where you need to step in and when you need to stand back and let your subordinates do their jobs.\nThe enemy AI will use its skill to launch well-timed and coordinated strikes as it probes your lines for weakness while realistically reacting to your movements! In addition, for the enthusiastic mod community awaiting Command Ops, powerful tools like MapMaker and ScenMaker allow for the creation of maps and scenarios further adding to already near limitless replayability.\nCommand Ops 2 game application has a new user interface (UI) and enhanced artificial intelligence (AI). The smartest and most realistic operational level wargame just got a whole lot better. Command like a real commander in this pausable, continuous time simulation of WW2 operational warfare, where the emphasis is on planning, anticipating and reacting to enemy developments. This is not a click-fest, and you don’t have to issue orders to every unit. The world’s smartest operational level AI can be trusted to do a reasonable job of managing your forces. Also included are the editors ( MapMaker, EstabMaker, EstabEditor, and ScenMaker ) for modifying or developing your own scenarios. The Core comes with three scenarios, including the tutorial Return to St Vith, Manhay Crossroads, and Greyhound Dash, all focussed on the Epic 1944 Battle of the Bulge.\n* Realistic command decision-making at the operational level\n* Assess, plan, order and react just like a real Corps, Division, and Brigade Commander\n* No hexes, no turns, no micro management, no click fests\n* One of the most advanced commercial AI opponents ever developed\n* A contender for the best AI in any wargame\n* The AI can manage subordinate commanders and handle micromanagement\n* Automated bridge building\n* Advanced force allocation algorithms to keep your army balanced and sharp\n* Multiple force group structures to enable cross attachments and different ways of displaying the order of battle\n* Reaction and reassessment code for smarter responses from both the enemy and friendly AI\n* Scheduling code to better manage the sequencing of tasks\n* Multiple route finding algorithms so units can rush to battle but become exposed, avoid enemy firepower,\nstick to covered terrain or take a safe but slow route\n* Formation movement code, including phase lines\n* Enhanced sighting code\n* Enhanced basing code\n* Intuitive powerful interface\n* Configurable Interface layout. Just drag dialogs to where you want them and it remembers the layout for next time.\n* Multiple Screen Support so you can position your dialogs on your second monitor.\n* Clear and concise tutorial movie to get you up to speed\n* Order options give you more control including attacks, bypasses, ambushes, stragglers, basing, retaking of position,\navoiding friendlies, rest at night etc.\n* Automate units and let the cutting edge AI manage smaller units while you concentrate on the big picture\n* Order timing controls to coordinate tasks\n* Order supply level settings so you can set resupply priorities\n* Order of battle display to help you organize your forces\n* Estab Data views to access weapon and vehicle performance data\n* Plan dialog so you can see all your orders at a glance\n* Fire Support dialog so you can manage your heavy hitters (artillery)\n* Reinforcement dialog so you can manage your new arrivals\n* Supply Arrival dialog so you can see what resupply you are getting\n* Filtered Message Log\n* Auto Save\n* Interactive Recordings that you can replay and, at any point, change your orders to try out new courses of action\n* Map patterns now change with the weather\n* Pathing tools provide estimate of duration\n* Tons of Replayability - many scenario options, including multiple random reinforcement schedules\n* Extensive unit, vehicle and weapon estabs, including German, American, British and Italian forces\n* Full construction set includes editors to create units, equipment, ammo and formations (EstabEditor); maps\n(MapMaker) and scenarios (ScenMaker) for any battle.\n* An Estab Editor to modify or create Forces, Equipment, Ammo, Formations, etc.\n* Mod various aspects of the game, including map patterns and victory messages.\n* Utilize a big range of force lists for rapid scenario creation\n* Situation Awareness Maps for easy scenario selection.\n* and many other features.","imageUrl":"https://media.rawg.io/media/screenshots/c4c/c4c4dcb4754b7167ac3f0fe48e09db0d.jpg","releaseYear":2017,"developer":"Panther Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5144,"name":"Fighting Force","genre":"Action","price":0.0,"description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nThe mad scientist, Dr. Dex Zeng is trying to destroy the world, and only the FIGHTING FORCE can stop him!\nTake the role of Hawk Manson, Ben \"Smasher\" Jackson, Mace Daniels, or Alana McKendrick, and battle your way through seven expansive levels.  Will the FIGHTING FORCE stop Zeng's evil plot in time?\nDownload this PS one® Classic game today!\n\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 85 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\nFighting Force® © 2007 Eidos Interactive.  All Rights Reserved\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","imageUrl":"https://media.rawg.io/media/screenshots/5a9/5a9b5b620920735cddde497fe0c7def2.jpg","releaseYear":1997,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":3429,"name":"Pillar","genre":"Adventure","price":0.0,"description":"Digital Deluxe EditionDeluxe edition includes the game's soundtrack, an album of bonus tracks, concept art, photography that inspired the game and more!\nAbout the GamePillar is a collection of minigames, where each game represents a different type of personality we find in people. Each personality is expressed entirely through the gameplay mechanics, without cutscenes or dialogue. All too often, we try to change people who are different than us, especially if they're polar opposites. We like to debate and tell them they're wrong and we're right... but what if there's a purpose for both extremes?\nA Little Bit More About Pillar:\nA collection of minigames, each representing different personality traits (introversion, extroversion etc.) through gameplay mechanics.\nDifferent people, different gameplay; each part of the game will challenge you in a unique way.\nExplore an intimate snowy town, beautifully hand-painted with attention to every detail.\nA distinct soundtrack, composed hand in hand with the game's design, by the game's designer, to ensure a cohesive experience.","imageUrl":"https://media.rawg.io/media/screenshots/cd3/cd34e83c6d4d4afd635ac2ef2068651a.jpg","releaseYear":2015,"developer":"MichaelArts","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":2134,"name":"Fairy Fencer F: Advent Dark Force","genre":"Adventure","price":0.0,"description":"Long ago, a war raged between two powerful deities. Each was sealed away, and now fighters seek their hidden weapons. By chance, Fang is unwillingly embroiled in the battle, and now must choose which deity to awaken in this RPG!\nKey Features\n1.\tIn the three stories to play, friends become foes, foes become friends, and, based on your choices, multiple endings can be unlocked!\n2.\tCustomize weapons by fusing them with fairies and change dungeons stats through World-Shaping. Even transform with the “Fairize” skill and become stronger in battle!\n3.\tWith up to six party members on the battlefield at a time, you can play as all your favorite Fencers!\n4.\tPlay in Easy, Normal, or Hard mode and switch the difficulty to suit your play style!\nAdditional hardware required for Remote Play.\n1 player\n11GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 IDEA FACTORY / COMPILE HEART All rights reserved.\nFairy Fencer F is a trademark of IDEA FACTORY. Licensed to and published by Idea Factory International, Inc.","imageUrl":"https://media.rawg.io/media/screenshots/988/988656ea59113975f9aa10d97d6a54ec.jpg","releaseYear":2015,"developer":"Idea Factory","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":1610,"name":"Raiden Legacy","genre":"Action","price":0.0,"description":"RAIDEN LEGACY is a four-title compilation of the mega-popular RAIDEN arcade series including RAIDEN, RAIDEN FIGHTERS, RAIDEN FIGHTERS 2 & RAIDEN FIGHTERS JET.\nThe first episode takes place in 2090 while a massive Alien invasion threatens the entire Earth. To repel the onslaught of those bad guys known as Cranassians, the World Alliance Military has developed a daring counter-attack with a powerful new weapon: the Raiden Supersonic Attack Fighter. Be a brave pilot and use Raiden’s powerful weaponry to fight against waves of enemy ships and save the human race!\nEach title includes three different modes: “Arcade Mode” (just like the original); “Mission Mode”, which allows you to play any unlocked stage; and “Training Mode”, which, true to its name, allows you to excel at your favorite stages and practice the most difficult ones!\nOriginally developed by Seibu Kaihatsu, each of these classic scrolling arcade shooters have been enhanced with brand-new features:\n•\t1 - 2 simultaneous players (local + online)\n•\t15+ different ships, each with their own characteristics, stats, weapons, and powerups!\n•\tRemastered HD soundtrack for Raiden Fighters 1 & 2 and Raiden Fighters Jet\n•\tFull gamepad support\n•\tTwo difficulty modes: Medium and Hard\n•\tAutoFire: ON/OFF\n•\tTATE support\nCompete in a virtual worldwide arcade room thanks to online leaderboards and compare your skills with the best players around the world. You are humanity's only hope for survival!\nGET READY TO ROCK ‘N FIRE: RAIDEN LEGACY IS HERE!!","imageUrl":"https://media.rawg.io/media/screenshots/02a/02ac4bb0367c5db9297ff8cee1805685.jpeg","releaseYear":2012,"developer":"DotEmu","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":894567,"name":"The Feast","genre":"Adventure","price":0.0,"description":"JOIN OUR DISCORD\nAbout the GameThere’s no better family dinner conversation starter than “Excuse me mom, but what the hell is hanging from our chandelier?!”.\nThe Feast is a short and intensely dramatic experience designed to be completed in one sitting (20-30 minutes). When your mother invites you to a family meal, you don’t expect it will be a grotesque and painful event the moment it starts.\nThis dark and peculiar spectacle grants you the lead role. In a theatrical setting, survive the utterly confusing and twisted dinner. You will be observed and judged, so face reality, weigh every action, consider possible outcomes, make choices - and define the conclusion of this life-changing celebration.\nAfter all, what happens here is not your problem…\n… or is it?","imageUrl":"https://media.rawg.io/media/games/b4a/b4a01bf2f8c13821107e101d41607e0f.jpg","releaseYear":2022,"developer":"Sever","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":844359,"name":"F1 Manager 2022","genre":"Strategy","price":0.0,"description":"Make your mark on Formula 1® in the officially licensed F1® Manager 2022. Be the boss of your chosen constructor and pick from a roster of 2022 drivers and staff. Featuring full F1® licensing and true-to-life presentation, you won’t just play F1® Manager 2022 – you’ll live it.\n\nWrite a new chapter in a bold new era for Formula 1®. Choose your F1® team and guide them to glory throughout the official 2022 races by beginning your journey at the back of the grid or taking your place in pole position – in F1® Manager, the choice is yours. Your task is to impress the board by hitting your season targets and long-term goals, securing your team’s success for years to come.\n\nYour constructor team are the beating heart of racing operations. Between races, control every detail of your team from HQ. Monitor the performance of your star drivers and staff, keep your finances in the black, and scout best-in-class staff from rival teams to give yourself an extra edge for upcoming races.\n\nGet your hands on 2022’s striking new car design and race closer to your opponents than ever before. Assign new parts for your cars to prepare for the race ahead. Choose your engineering approach to gain advantages on upcoming circuits – will you develop a well-balanced system, focus on areas needing improvement, or excel in specific aspects of performance?\n\nFrom lights-out to the chequered flag, you’re in control. Own every decision from pit strategy to tyre choices to driver callouts. Plan your approach but be prepared to react to dynamic race events such as weather and fluctuating track conditions. Immerse yourself in a hyper-realistic simulation of an official F1® race presented in true-to-life broadcast quality.","imageUrl":"https://media.rawg.io/media/games/b3d/b3d7b7ffd5883c7bbe6e4c23d715ad2c.jpg","releaseYear":2022,"developer":"Frontier Developments","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":751914,"name":"Valkyrie Elysium","genre":"Action","price":0.0,"description":"Long ago, Ragnarok—the End Times—loomed upon the realms. The All-Father Odin, with the last of his strength, created an emissary of redemption, Valkyrie; her sole task being the salvation of a doomed world.","imageUrl":"https://media.rawg.io/media/games/8a1/8a1465b48b728a68c2b8b88d5f37a16a.jpg","releaseYear":2022,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":736256,"name":"CHRONO CROSS: THE RADICAL DREAMERS EDITION","genre":"Adventure","price":0.0,"description":"Another world, another destiny\n\"CHRONO CROSS: THE RADICAL DREAMERS EDITION\" is a remaster of \"CHRONO CROSS\".\n\nThe 3D models have been upgraded to HD, new illustrations have added, and all kinds of new features are now included. Additionally, the game that formed the bedrock of the story, \"RADICAL DREAMERS - Le Trésor Interdit -\", is included in this edition!\n\nCHRONO CROSS is an RPG that transcends time and space, unfolding across two interlinked parallel worlds.\nWith over 40 party members to meet, people and dimensions will intertwine in this epic drama about the planet itself.\n\nNew Features in the Remastered Edition\n・3D models converted to HD\n・Refined character illustrations\n・Higher-quality background music\n・Switch enemy encounters on or off\n・Background filter feature\n・Battle enhancement features to make combat easier\n・Auto-battle function\n・Switch between imitation pixel font and HD font\n・Change screen resolution\n\nRADICAL DREAMERS - Le Trésor Interdit -\n\"RADICAL DREAMERS - Le Trésor Interdit -\" was released in 1996 as a standalone game, and has not been easily accesible for play in recent years. Players can experience the story that went on to become the basis for CHRONO CROSS in an audio novel format. Here, an alternate story of the RADICAL DREAMERS, a group of three thieves - Serge, Kid and Magil - unfolds in a parallel world.\n\n*You can switch between the new and old versions of the 3D models and illustrations.\n*The 3D models, illustrations, font and background filter cannot be toggled separately. They will all be switched together.","imageUrl":"https://media.rawg.io/media/games/3ff/3ffdeb71f32b5560db5786088a07f4be.jpg","releaseYear":2022,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":692538,"name":"Deathverse: Let It Die","genre":"Action","price":0.0,"description":"Greetings to all of you looking to relieve your daily stress and fulfill an insane desire for extreme self-expression. \n\nWe invite you to take part as a contestant in a literal survival game show that has enthralled the world over! !\nDEATHVERSE is a full-scale survival action game in the same world as LET IT DIE, hundreds of years after the events of that game.The player will participate in the violent survival TV show DEATH JAMBOREE as a contestant.\nIt’s an inhumane program in which 16 participants must murder each other to try to survive on an uninhabited desert island that grows increasingly polluted by the curious element of SPLithium.\nOnly those who can truly entertain and capture the hearts of the crowd can claim fame and glory.\n\nThis game carries on the spirit of the violent, twisted world of LET IT DIE.\nYou never know what will happen in a do-or-die battle to the death fought only with violent, powerful melee weapons.\nInstantaneous decisions such as whether to attack, defend, or go for the kill, surprise attacks making use of terrain, or whether to hold out in a grueling battle will mean the difference between life and death.\nContestants must also watch out for “hunters”, malevolent hired killers whose only job is to eliminate them, as well as the savage cryptids that lurk in the battlefield.\nThe key to surviving is to put on a good show and earn “GP” by thrilling the program’s audience.\nStand out from the crowd by pulling off flashy moves, and aim to be the last one standing through skillful use of various strategies.","imageUrl":"https://media.rawg.io/media/games/da4/da4707919ac9397f98787c44db5ecafa.jpg","releaseYear":2022,"developer":"SUPERTRICK  GAMES,Inc.","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":678533,"name":"Choo-Choo Charles","genre":"Action","price":0.0,"description":"Charles is a bloodthirsty train, and you need to destroy him.\nNavigate a massive play area in your trusty old train.\n\nThese winding tracks are treacherous, so you'll need to plan each mission. Be careful when clearing your path on foot, or switching the tracks direction, because Charles might be waiting for you.\nUpgrade you train to fit your needs.\n\nGo looting or complete missions to find \"Scraps\", which can be used to turn your train, into a death machine on wheels.\nGet help from the townspeople.\n\nHelp out the settlers in return for high powered weapons, and other items vital to Charles' destruction.\nFight Charles to the death.\n\nProve yourself a worthy train killer, by gaining enough strength, firepower, and skill to take down the mechanical terror once and for all.\n\nIn Choo-Choo Charles you're given the task of eradicating a monster known by the locals as \"Charles\". Nobody knows where he came from, but they know why; to eat the flesh of puny humans. You have a small yellow train, with a map, mounted machine gun, and an exquisite collection of bobble-heads on the dashboard. You'll use this train to get from place to place, while you complete missions for the townspeople, or loot scraps from around the island. Over time you’ll use your scraps to upgrade your train’s speed, armor, and damage. You’ll grow your arsenal, and (hopefully) become an unstoppable force, ready to take on the great and mighty Charles.","imageUrl":"https://media.rawg.io/media/games/2d3/2d3ca1ee050ba31996d11124b6021bf1.jpg","releaseYear":2022,"developer":"Two Star Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":500632,"name":"9 Monkeys of Shaolin: Prologue","genre":"Action","price":0.0,"description":"WISHLIST THE FULL VERSION OF THE GAMEhttps://store.steampowered.com/app/739080/9_Monkeys_of_Shaolin/\nJoin our Discord community\nAbout the Game\n\"If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle\".\n- Sun Tzu, The Art of War\n9 Monkeys of Shaolin - marks a true rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely for you!\nAs a mere Chinese fisherman Wei Cheng you have to avenge the death of your friends and family slaughtered in a pirate raid at your peaceful village. Game protagonist is quite a tough nut to crack as he knows the basics of ancient martial arts only mastered by legendary Shaolin monks. Get your trusty battle staff ready for a challenging adventure in Medieval China and for merciless fights with hordes of various enemies.\nAction-packed battles, user friendly controls and incredible atmosphere of great kung-fu movies of 70s – all this makes 9 Monkeys of Shaolin a perfect choice for every true fan of really hardcore brawlers.\n3 unique fighting styles: fight on earth, in the air or use mysterious magic seals. Combine these elements to defeat every enemy on your way.\nCaptivating narrative: discover the fascinating story of Wei Cheng and follow him as he rises from a simple fisherman to the master of Shaolin martial arts.\nStunning visual style: unlikely combination of historical and mystical elements gives you an exciting experience from every scene appears on screen.\nExtensive character development system: you learn a great deal of ways to victory as you discover various unlockable perks, items and fighting styles.\nMore than 25 different levels: Chinese villages, pirate ship, Buddhist monasteries, Japanese mansions, ancient ruins and many more.\n10 types of Chinese and Japanese polearms, each with its unique traits. Discover the landscapes to find new items!\nCo-op play: invite your friend to help you fight through growing waves of enemies and complete the game together.","imageUrl":"https://media.rawg.io/media/screenshots/569/5696cdbf539a82e311988686de4d9fed.jpg","releaseYear":2020,"developer":"Sobaka Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":487913,"name":"Pikmin 3 Deluxe","genre":"Action","price":0.0,"description":"Grow a squad of adorable, plantlike Pikmin to traverse a strange world and save your planet. \n\nCommand a capable crop of 5 different types of Pikmin™ to strategically overcome obstacles, defeat creatures, and find food for your famished home planet! You can even bring a second player along to divvy up tasks as you explore a world that seems larger than life from a pint-sized perspective.\n\nPikmin at your pace\n\nReturn to your ship before time runs out, or you (and your Pikmin) could be in big trouble. If you prefer a more casual approach, a variety of difficulty settings, lock-on targeting and optional hints have been newly added. With less pressure, you have more time to strategically command your Pikmin and take in the lush scenery.\n\nPlay side-story missions, head-to-head matches and more!\n\nThis deluxe version of the Pikmin 3 game includes new side-story missions featuring Olimar and Louie, the ability to play Story mode with a friend and all DLC stages from the original release. Feeling competitive? Enjoy fierce head-to-head Bingo Battles and online leaderboards for Mission mode.","imageUrl":"https://media.rawg.io/media/games/ae5/ae50f7d86cc1ab132b467154bf45b8e8.jpg","releaseYear":2020,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":427878,"name":"Inertial Drift","genre":"Racing","price":0.0,"description":"Forget everything you know about drifting.\nSet in a 90's retro future, Inertial Drift is an Arcade Racer with a devastatingly unique handling model and unbelievably satisfying twin-stick drift mechanics. Inertial Drift offers a whole new level of accessibility and challenge to the arcade racing genre - for a driving experience genuinely unlike anything you've played before.\nUnique Twin Stick Controls for Precision Drifting - The right hand stick gives you total control over your drift. Intuitive for new players and uniquely challenging for pros.\n16 Fiercely Individual Cars - Each vehicle is a totally different beast with unique characteristics to master. Get behind the wheel of Sport hatchbacks, Coupe's, Supercars & more!\n20 Demanding Tracks - Tear through neon city streets, race around rural temple complexes and hurtle down winding mountain passes.\nSet in a 90s Retro Future - Bold and distinctive environments.\nSingle Player Story Mode - Perfect your craft through a mix of races, head-to-heads, time trials and style showdowns!\nLocal Multiplayer - Think you've mastered the perfect drift? What better way to prove it.","imageUrl":"https://media.rawg.io/media/screenshots/6ae/6ae17bdb2248d0af5376440b4c02905a.jpg","releaseYear":2020,"developer":"Level 91 Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":63278,"name":"The Prison Experiment: Battle Royale","genre":"Action","price":0.0,"description":"In Summer Heights Correctional Facility, the government are using the prison to experiment on the inmates. As the prison population has been pushed to the brink the government have been pitting inmates against each other as apart of a psychological observation know as The Prison Experiment. With a ticket home and a pardon from the warden on the line, walking free has never cost so much!\nThe Prison experiment is a third person Battle Royale experience with a twist. You will be faced with a totally unique gaming experience designed to separate the strong from the weak.\nThis game is not just offering a fifty man free for all mode, we also offer different game modes for a truly immersive playing experience. We want players to get the full Battle Royal experience and more!\nFeatures -\nCLASSIC BATTLE ROYALE - This is what players have come to expect from a Battle royale game. Fifty players enter the game but only one can claim the victory. Be sure to keep moving though as cell blocks will begin to close off and you will left trapped with no way out.\nKING OF THE CELL BLOCK - This is our take on a classic game mode. Fifty players are spawned randomly in five sectors of the map. Each five sections will have their own last man standing fight and the winners of each section are pushed into the sixth and final location of the map. The last five players standing will fight again, and the winner will take home the victory.\nStats - Player state are hosts on our dedicated servers","imageUrl":"https://media.rawg.io/media/screenshots/0e3/0e34497f0bbc3055bcf67f0295a29113.jpg","releaseYear":2018,"developer":"AeroLab Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":62591,"name":"Ctrl CV","genre":"Action","price":0.0,"description":"\"What would you feel if, all of a sudden, there were a stockpile of people looking just like you on the streets?\"\nWelcome to the world of Ctrl CV, a find-the-image platformer puzzle game. You are surrounded by countless clones of yourself, and your goal is to find the source of these doppelgangers. Try not to lose yourself in the midst of \"yourselves\".\nWe do not know if you're one of them, or if it really is the true you... But one thing is certain; that there's only one of you that truly exist.","imageUrl":"https://media.rawg.io/media/screenshots/c47/c477e4aed5681aa0729532328fab3919.jpg","releaseYear":2018,"developer":"ZPink","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":60524,"name":"Elsword Free-to-Play","genre":"Action","price":0.0,"description":"Elsword – manga-style beat 'em up\nSide-scrolling battling mixed with role-playing gameplay – in Elsword it's all about style, teamwork and action!\nChose from one of the 12 cool characters and fight your way through the wildest anime adventure of your life.\nTactics, speed and skill are all required – a unique look, your own playstyle and endless fun are all guaranteed! Master your combos in solo missions and in multiplayer, experience the diversity of the crafting system and get pumped with regular events and updates.\nBest of all, all this is completely free – Elsword is and will remain free-to-play.\nThis is Elsword:\nSuper sidescroller: innovative gameplay offers a wealth of playtime and the character development of a role-playing game\nChoose your weapon: swordsman, archer or mage – every class has its advantages\nPersonalised style: whether you want to wear your bathing suit, rocker gear or maybe even have a panda on your arm as an accessory, you choose your look\nPlayful: the controls are easy to pick up and help you to hit the colourful manga world running\nMassive monsters: countless creatures and bosses lie in wait of heroes in sinister dungeons","imageUrl":"https://media.rawg.io/media/screenshots/b41/b41b323eb190a6d0afac349a4583e5af.jpg","releaseYear":2018,"developer":"KOG co","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":56041,"name":"Eternal Darkness: Sanity's Requiem","genre":"Action","price":0.0,"description":"Eternal Darkness: Sanity's Requiem is a psychological horror action-adventure video game developed by Silicon Knights and published by Nintendo. Originally planned for the Nintendo 64, it was made a launch title for the GameCube and released on June 24, 2002. While the game features similar gameplay mechanics to that of the Resident Evil series, it distinguishes itself with unique features, such as \"sanity effects\". In the game, players take on the role of several characters, including a young female American student who is forced to return to her family's mansion in Rhode Island to investigate her grandfather's murder, as they become embroiled in a struggle against a powerful entity and their servant who seek to enslave humanity.\nEternal Darkness was not a commercial success following its launch, but was widely praised by reviewers and won numerous awards. Although a direct follow-up to the game was cancelled by Nintendo, who owned the game's copyright, and Silicon Knights later went bankrupt and disbanded, the game's writer and director Denis Dyack has been attempting to make a spiritual successor entitled Shadow of the Eternals.","imageUrl":"https://media.rawg.io/media/screenshots/e21/e215d37a773be35ddda535490ccce1c0.jpg","releaseYear":2002,"developer":"Silicon Knights","libraryGames":null,"platforms":[{"id":0,"name":"GameCube"}]},{"id":47510,"name":"Shiver","genre":"Adventure","price":0.0,"description":"Shiver takes place in the early 1990’s, away from mobile phones and the Internet. You take on the role of a son seeking to visit his father in a retirement home in the far north of British Columbia, Canada. On the way, you find yourself stranded in the strangely abandoned Windy Oaks National Park: a new park founded on land donated by the Samstone Mining Company as an act of goodwill after a catastrophic sinkhole accident. Using your wits and tenacity you must figure out a way to contact help and escape, before the park consumes you.\nInspired by classic point-and-click adventures, Shiver brings you chilling and immersive gameplay. As you explore the closed-down Windy Oaks National Park, you must be prepared to use the items you find in your snowy environment to problem-solve your way through a variety of challenges. Spanning the course of one captivating hour, you will attempt to unravel the mysteries of the park and escape with your body intact.\nAtmospheric point-and-click puzzle-horror game\nArt constructed through a combination of painting and photography\nSpine-tingling hour of gameplay\nSpiritual successor to popular indie game Cozy","imageUrl":"https://media.rawg.io/media/screenshots/c2c/c2ca1b0f0c4102f1d99bca62161f0846.jpg","releaseYear":2017,"developer":"Kowai Sugoi Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":47366,"name":"The Mind of Marlo","genre":"Adventure","price":0.0,"description":"\"It's called Spontaneous Silly Head Syndrome and it affects fewer than 1 in 7 billion....\"\nMeet Marlo Davenport.\nMarlo was born with a curious case of Spontaneous Silly Head Syndrome, a rare disorder which makes the individual suffer temporary transformations. How does Marlo cope with such a condition, and is there a cure?\nJoin Marlo in this one of a kind narrative driven, mockumentary style adventure game. Learn about Marlo's life through compelling monologues, solve fun puzzles to help him overcome his odd condition and figure out just what the heck is happening to him! Not everything is as it seems as you'll discover unravelling Marlo's strange story. What happened to Marlo's father? Who is this Linda he keeps talking about? Why does he keep changing into a slug?\nPresented as a low res documentary with fully voice acted talking heads, The Mind of Marlo is best described as an absurd combination of TV show The Office and classic point and click adventure games of yore.\nFeatures\nA compelling narrative told in an interactive documentary style.\nOver 20 minutes of recorded dialogue\nIntuitive point and click puzzle gameplay\nFairly nice music\nSquare Nudity\nDrama!\nAt least 3 good jokes","imageUrl":"https://media.rawg.io/media/screenshots/5f5/5f59563d898b156374deda008c18b902.jpg","releaseYear":2017,"developer":"Point Bleep Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":45106,"name":"Mothlight","genre":"RPG","price":0.0,"description":"The unwanted are kicked into\nthe black sea...\n... where they would\nmelt and harden into\na pure metal.\nThe metal was then harvested\nand put to good use by the\ncommon man.\nFrom the most handsome developer ever...\nSamu presents you with a new RPG experience that will\nBlow. Your. Mind.\nIntroducing Mothlight. A game about exploration, weird stuff,\nand exploring a world made entirely out of people. Literally.\nWORLD\nThis world is different.\nAs people were kicked into the black sea,\ntheir bodies melted and then hardened\ninto a pure metal called \"Dreg Ore\".\nSoon the ore started to clump together\nand form islands. This happened more\nand more until continents were made.\nPeople who were kicked in fell on land instead\nof in the water. And then boom. Civilization.\nGAMEPLAY\nYour main goal is to explore and thrive!\nGear up, get cooler armor and be more stylish.\nFight more bizarre bosses and find more exciting items!\nThe world is yours to conquer!\nSTORY\nNeethan threatens Augus in a time most harsh.\nDemons from the darkest depths of the sea are making everyone go mad.\nThe Apostles of the Deep Ones are manipulating powerful entities...\nAnd Enzo is stuck in the middle of it.\nEscape this hell and return to the world above...\n...or be devoured by the eldritch abominations below.\nA Game by: SAMU~\nMusic by: Chez Monplaisir\nHey, if you like this game and want to support the Developer: https://www.patreon.com/samuchan\n;)","imageUrl":"https://media.rawg.io/media/screenshots/9cd/9cd6e39d569cde3d0a24ea6aceaf7437.jpg","releaseYear":2017,"developer":"Samu","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45056,"name":"Ruthless Safari","genre":"Action","price":0.0,"description":"The game's plot is straightforward and Ruthless Safari takes place in the desert where our heroine decided to take a picture of a lion on his head after the blinding flash, the furious animal rushes in pursuit of it, our task is to run and time to jump over obstacles such as cactus. Every encounter with cactus leaves our heroine without one set of clothes, and then leads to death. How long you will be able to avoid a terrible fate, depends on You!","imageUrl":"https://media.rawg.io/media/screenshots/3ce/3ce217e12ace14089a993aed1c47e175.jpg","releaseYear":2017,"developer":"SharkGame","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":43389,"name":"Afterimage (16BitGenocide)","genre":"Action","price":0.0,"description":"Deluxe EditionThe Deluxe Edition includes the full game, digital artbook, and digital soundtrack\nMORE GREAT GAMES\nDISCORD\nAbout the Game\nA great deity created the world named Engardin, leaving four goliaths before her departure. The Goliaths abided by their different divine callings and upheld the order and flow of this world. Hence, the lives in Engardin reincarnated and multiplied.\nHumans were the last creation, and their ever-expanding ambitions led to a protracted war against the Goliaths. Engardin was engulfed in flames, until a huge explosion known as \"The Razing\" devastated the Holy Grounds of mankind and brought a swift end to the conflict. But the divine order was broken, and lives withered away. The age of mankind came to an end.\nThe survivors of the conflict scattered across Engardin. Severed from the Well of Mankind and unable to reincarnate, they banded together to form settlements. Years have passed since this great cataclysm, and the remaining human settlements have been suddenly assaulted by mystic forces. Renee, a young amnesiac girl and student of Aros, was the lone survivor of the attack on her village. Determined to recover her forgotten memories and locate her lost mentor, she bids farewell to her destroyed village to embark on a journey that will inexplicably set into motion a series of events that will determine the fate of this new world.\nExperience a gorgeous hand-drawn world Engardin is not only filled with sublime beauty but also plagued by crises. The ruins of Engardin are home to many treasures and secrets, but the Corrupted are waiting for their next prey and ancient deadly traps are ready to kill the careless.Fight Fierce EnemiesWith humanity in retreat, nature and the creatures that inhabit it have reclaimed Engardin as their own. Battle through over 170 varieties of enemies and 30 tough boss encounters that stand between you and your goal. Bountiful rewards await those who can weather these brutal combat trials.Diversified Character BuildsHarness and channel the power of defeated enemies to unlock powerful skills and upgrade a diverse arsenal of weaponry. Become the master of your own fighting style with over 200 different equipment to collect and choose from including 6 classes of main weapon, sub weapon, armor, and accessories.\nExplore a non-linear world - unearth the secrets buried deep within the ruins of the vast interconnected world of Engardin. Interact with over 50 different NPCs, each with their own story and purpose. Learn more about their role in Engardin through side quests!\nFight over 170 varieties of enemies, including 30 tough boss encounters.\nDeep RPG mechanics allow for diverse character builds – over 200 different equipment to collect and choose from including 6 classes of main weapon, sub weapon, armor and accessories. Invest talent points into a variety of stat upgrades and unique weapon skills for each class of weapon.\nDetermine the fate of the world – discover multiple endings depending on Renee’s actions that will shape the future of Engardin.\nStunning 2D art style with animations hand-drawn frame-by-frame.\nDiscover new abilities and new Afterimages that grant unique benefits in your exploration and combat. Use these skills to access new areas, shortcuts, and master these in combat to defeat more difficult enemy encounters!\nOver 40 original orchestral tracks composed by the Aurogon Sound Team and fully recorded by International Master Philharmonic Orchestra and other various musicians.","imageUrl":"https://media.rawg.io/media/screenshots/609/6091c24d6df0dd54646913ce59fbbdff.jpg","releaseYear":2023,"developer":"Aurogon Shanghai","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":35038,"name":"Pirates of the Caribbean","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/7d4/7d4cafabd6f67493d1561596e0e540e1.jpg","releaseYear":2003,"developer":"Акелла","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"}]},{"id":30465,"name":"The Simpsons Arcade Game","genre":"Arcade","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/bf1/bf10cdd9aaa65613aeb7a2d5795a151d.jpg","releaseYear":1991,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":29081,"name":"2006 FIFA World Cup","genre":"Sports","price":0.0,"description":"Play with your heroes and take part in the 2006 FIFA World Cup™.  Lead your nation from the qualification rounds all the way to the FIFA World Cup Finals in Germany. You'll experience a full range of emotions along the way - from the elation of beating rival nations to the despair of having your FIFA World Cup dreams shattered in a crucial penalty shootout. This is your ticket to all the pageantry and passion of the greatest show on Earth.","imageUrl":"https://media.rawg.io/media/screenshots/3af/3afab1f74b957ea1f05ad4be7d2c028b.jpg","releaseYear":2006,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"GameCube"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":22222,"name":"The Inner World: The Last Wind Monk","genre":"Adventure","price":0.0,"description":"The flute nose dynasty has been watching over Asposia for centuries on end. In secret, they fill the roly-poly world with light and life. Emil, a trader for odds and ends, has led all the Asposians astray, making them believe that the dynasty is in cahoots with dark forces. Seriously, who knows what this weird family is doing day in, day out? The only one who could stop evil Emil is the heir to the flute nose throne: Robert. He has been petrified for three years, though. With a huge dose of enthusiasm, but little to no idea what he’s actually doing, he embarks on an adventure to find the legendary last wind monk. Of course, he has some great company: Peck, as loyal as he is flightless, and Laura, a rebel who certainly does fly, but only off the handle and who is Robert’s love with a capital L, by the way. A final ray of hope is provided by the mysterious Mama Dola, who seems to know more about Robert’s destiny than Robert himself…\nFeatures\nExperience the fun and moving sequel to “The Inner World” (you don’t need to know the first part!). Save the flute noses from persecution and evil Emil!\nHours of fun brainteasers await you: find the last wind monk, cause trouble in a tumble mouse factory, play with Uncle Oboe for some toilet paper in prison, help a desperate Bingo-Pony become happy once again, bring the adorable baby gorf back home and save Asposia! Again!\nNavigate Robert and Laura, those charming Asposians, through the game. And now you can even operate the nutty pigeon, Peck.\nThere are new sites for you to discover! Including the topsy-turvy airport “Asposia Central”, the quirky tumble mouse farmers and the mysterious Shovel Mountains.\nPractice new songs on your magic flute nose and activate ancient artefacts.\nBeautiful hand-drawn adventure for people quick on the draw.\nHilarious dialogues in awesome sound quality.\nThe Asposian puzzle help: Provides you with hints when you’re as clueless as Robert – completely spoiler-free of course.\nAvailable for most any operating system or console – except the Gameboy!","imageUrl":"https://media.rawg.io/media/screenshots/ab5/ab5a23f80b187c411f8f06df2de6356d.jpg","releaseYear":2017,"developer":"Kalypso Media","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20381,"name":"What's under your blanket !?","genre":"Simulation","price":0.0,"description":"What is this game?\nIt is about a guy, who gets into an awkward situation in a not suitable moment, and tries to overcome it. We all faced such difficulties :)\nWhat do you need to complete this game?\nYour patience, concentration and some sleight of hand, of course ;)\nWhat's under your blanket !?\nEven we, the developers of this game, have different opinions.\nWhat is more, we are going to add multiplayer in the nearest future and to realise various fascinating gameplay ideas .","imageUrl":"https://media.rawg.io/media/screenshots/332/332d2371bc4b963cd8a09b6cc1b9246f.jpg","releaseYear":2016,"developer":"5Wolf","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20191,"name":"Magnetic By Nature","genre":"Action","price":0.0,"description":"Magnetic By Nature explores platforming without platforms. Experience a fast-paced, single-player adventure mixing fluid motion, split-second decision making, stylized machine-age visuals, and a dynamic soundscape. As the last remaining robot, journey through the forgotten ruins to reactivate your friends.  Successfully funded on Kickstarter and winner of both the Best Developed Game and Audience Choice awards at the 2013 Utah Game Wars competition, MBN is the debut title from Team Tripleslash.","imageUrl":"https://media.rawg.io/media/screenshots/8c3/8c3b09011dc5bcc1c2379f7c90088b9b.jpg","releaseYear":2014,"developer":"Team Tripleslash","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19795,"name":"The Legend of Dark Witch","genre":"Action","price":0.0,"description":"The Legend of Dark Witch is a 2D platform action game.\nZizou can learn new attacks by defeating bosses.\nShe will need every one of those attacks if she is going to save the world.\n-A magical world beautifully depicted through in-game graphics.\n-Diverse levels that provide a fair challenge.\n-Additional bonuses that reward those who replay the game.\n-3 difficulty modes.","imageUrl":"https://media.rawg.io/media/screenshots/6bb/6bb7ddbf54f57f3f34862c01eeacfb52.jpg","releaseYear":2014,"developer":"Flyhigh Works","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"}]},{"id":18592,"name":"8i - Make VR Human","genre":"Adventure","price":0.0,"description":"8i brings virtual experiences to life with the highest fidelity, most realistic volumetric video of humans. A truly immersive experience, volumetric VR gives you a sense of presence and freedom to move through space and time, opening up worlds of possibilities.\n8i volumetric VR experience features:\nTrue presence: Step into the story and feel like you’re not just watching someone, you’re with them.\nFreedom of movement: Walk completely around the person you’re watching as if you’re in the same room, and choose your own perspective.\nExperience it anywhere: View on virtual reality headset, mobile and on the web","imageUrl":"https://media.rawg.io/media/screenshots/e0c/e0c4bcc213c65161dce26d5903c66819.jpg","releaseYear":2016,"developer":"8i","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17855,"name":"Idol Hands","genre":"RPG","price":0.0,"description":"💟CHECK THIS OUT!💟https://store.steampowered.com/app/1854250/\n💟CHECK THIS OUT!💟https://store.steampowered.com/app/1555110/\nAbout the Game\n◆Story:\nDue to an accidentally leaked masturbation video, the up-and-coming idol Uesugi Wakari is kicked out of her girl group.\nThen there's you, once a premier entertainment agent, who has fallen into debt and forced to declare bankruptcy. With your back against the wall, you decide to become Uesugi Wakari's agent after a chance encounter and give it one more go. As you help Uesugi Wakari rebuild her dream of becoming an idol, you need to make some serious cash and pay back your multi-million dollar debt. During these difficult times, you two will experience both joy and hardship, and since you're living together... plenty of naughty, nasty carnal relations.\n◆Gameplay:\nIdol Hands is a sex simulation game that also falls under the categories of life simulation and management simulation. Players will be given half a year to cultivate Wakari.\nBased on how you manage Wakari, she may become a singer, a mega movie star, the queen of company reps... or even a politician!? Of course, there's always porn... or how about turning her into an adult streamer?\nEach day is split into Morning, Afternoon, and Night. During each period, you can trigger various incidents or encounter a variety of NPCs.\nPlayers can choose Talk, Stream, Class, Go Out, Sex, Change, and Rest. Increase Wakari's abilities and take on more advanced jobs to stack that cash and increase her popularity!\nBesides the cultivation aspect of the game, there are some reaction-based mini-games to make the game that much more fun.\n◆Game Features\n◇More than 30 sets of videos and 400+ photos.\n◇The porno scenes are exquisitely acted, with meticulous movement animation effects, so you can really get into the moment.\n◇Full Chinese voice acting for the sex scenes.\n◇Only requires one hand to operate the mouse, so your other hand can... well, you know!\n◇A legit sex simulation game: Every little detail of the main character's thoughts and actions are meticulously laid out for you to enjoy.\n◇Multiple endings: A classic life simulation game.\n◇More than 20 outfits: Wear the one you like the most!","imageUrl":"https://media.rawg.io/media/screenshots/788/7885d2bf1d424d9bbcd50a117b55b73a.jpg","releaseYear":2015,"developer":"樹懶叫工作室","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17239,"name":"Zombie Party","genre":"Action","price":0.0,"description":"Zombie Party is a retro rampage of fun and over-the-top action, while still giving the players a deep and engaging Action-RPG Rogue-like experience! Go on a time traveling adventure, or delve deep into procedural dungeons full of gold, loot, and secrets! Unforgiving boss fights that challenge the players skills and abilities! Upgrade your guns with loads of gun mods and artifacts, find magic spell runes, potions, items, melee weapons, explore 10+ unique biomes each with its own enemies and bosses, discover 150+ unique guns and weapons, launch teddy bears that explode into fire, blow up your friends with heat-seeking missiles, and get to the final zone and try to kill the Dance King.\nTravel through Time and different Dimensions in Adventure mode!\nOnline Multiplayer! Play with your steam friends!\nAchievements!\n50 Unique characters to unlock, each with their own special weapon!\n150+ unique guns to discover! Every gun is unique!\nFun and intuitive weapon creation/modification system in-game!\nProcedural Dungeons and Caves to explore with secrets to find!\nBattle Hordes of Enemies and Fantastic Challenging Bosses!\nRPG Leveling and permanent stat progression!\nAnimal AI companions! (to love and help you fight)\nItems, Potions, and Melee weapons!\nRainbow blaster, huge energy beams, incendiary teddy bear launchers, grenade shotguns, and triple-fire rocket launchers!\nFull Procedural Magic System with Elements! (used along side weapons)\nSteam Leaderboards!\nFull Controller Support - Steam Controller support!\nOverwhelmingly Fun Multiplayer Experience!\nProfile System that allows for tracking of Stats, Global Gold, Unlocks, and Custom Load-outs!\nGlossary/Discoveries menu to see everything you've encountered in the game, with a unique description.\nTONS of fun content to unlock - Characters, Guns, Hats, Pets, etc...\nProcedurally generated Levels with Destructible Environments!\nMod and Customize your guns using a modular weapon builder to create unique weapons of destruction!\nIntense Gameplay that keeps you on the edge of your seat, and keeps you coming back for more!\nLoot! Get all the Gold you can! Buy all kinds of upgrades and unlocks!\nHidden Easter Eggs and Interactive Environments!\nMore Dungeons!\nMore PVP modes!\nStory elements!\nSupergun Creator!\nSteam Workshop functionality.\nHey guys, I want to make Zombie Party the best game I possibly can, and your support makes this all possible.\nYou guys are amazing!\nNOTE: If you suffer from epilepsy or are sensitive to flashing lights, please be careful when playing Zombie Party--we have a lot of them!","imageUrl":"https://media.rawg.io/media/screenshots/497/497cb5b2ba6767faa6624328a52281b2.jpg","releaseYear":2016,"developer":"Peach Pie Productions","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":16899,"name":"Cross of the Dutchman","genre":"Action","price":0.0,"description":"Cross of the Dutchman is an action adventure game based on the true story of the folk legend 'Pier Gerlofs Donia'.\nThe story takes place in medieval Western Europe, in the province of Frisia, near the turn of the 16th century. Though Pier and his family lived in peace, the world around them was changing for the worse. Saxon legions were invading nearby villages, making the lives of the native people next to impossible. On one fateful day, Pier got involved with the Saxon oppressors, escalating the situation for the worse. The events portrayed in this great adventure caused Pier to gather a band of farmers and form a front against the oppressors. The acts that followed made Pier into the legend he is known for, the Cross of the Dutchman.","imageUrl":"https://media.rawg.io/media/screenshots/7ac/7ac3e2d9310b6ed6921978baca892860.jpg","releaseYear":2015,"developer":"Triangle Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16445,"name":"The Cameron Files: The Secret at Loch Ness","genre":"Adventure","price":0.0,"description":"Hidden away in the serene Scottish countryside above Loch Ness, sits Devil's Ridge Manor. But the tranquility of the estate is an illusion- spooky ghosts and supernatural phenomena have invaded this once peaceful home. At the request of the famous physicist and owner of the manor Allister MacFarley, private investigator Alan P. Cameron leaves his Chicago office for the mists of his ancestral land. But when Cameron arrives, the old physicist is nowhere to be found...\nIn this thrilling point-and-click adventure game, you’ll confront strange phenomena while exploring the dark corners of the Medieval castle, the old scientist’s secret laboratory and finally the troubled waters of Loch Ness.\nCan you help Cameron discover the mysteries surrounding the lake of Loch Ness?","imageUrl":"https://media.rawg.io/media/screenshots/e64/e642d98cd6f7e38d784056cbb667489e.jpg","releaseYear":2014,"developer":"Microids","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16360,"name":"Lost Grimoires: Stolen Kingdom","genre":"Adventure","price":0.0,"description":"An alchemist's apprentice returns home from university to finish her training under a great master. Little does she know a real paranormal adventure has only just begun.\nEXPERIENCE A FANTASTIC TALE OF DECEPTION AND INTRIGUE!\nThings go awry when she revisits her family home, where dark secrets and the mystery of her parents' disappearance lie buried.\nINVESTIGATE THE SECRETS HIDDEN IN THE SHADOWS OF THE THRONE!\nShe encounters a mysterious vigilante and finds a mysterious amulet. To learn the wisdom of the artifact, she must face grim truths about the kingdom and her family.\nDELVE INTO A WORLD RICH WITH MAGIC AND HIDDEN OBJECTS!\nThe young alchemist will work her way through countless puzzles and eerie mysteries to achieve her goal and learn the truth.\nEXPLORE A BREATHTAKING, HAND-DRAWN WORLD!\nShe will embark on a quest that can potentially change the faith of the entire realm and her own future forever.\nCRAFT 14 DIFFERENT ALCHEMICAL MIXTURES TO USE ALONG YOUR ADVENTURE!\nWill she be able to reach her true potential as an alchemist and heal a broken kingdom plagued by corruption and injustice?\nFeaturesExplore 30 hand painted, atmospheric locations!\nSolve creative and engaging puzzles!\nRobust alchemy system!\nInvestigate the secrets hidden in the shadows of the throne!\nCaptivating hidden object scenes!","imageUrl":"https://media.rawg.io/media/screenshots/714/7149f93b99e329773021983abc98b18a.jpg","releaseYear":2016,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":14789,"name":"Run Run And Die","genre":"Casual","price":0.0,"description":"Run Run and Die is a crazy and atypical challenging runner!\nOur funny little penguin wakes up in a test room, but suddenly something goes wrong and everything blows up! And so begins one of the wildest, silliest, and challenging flights in video game history! But who is behind all this? How did our hero arrived there? And why can't our poor little penguin remember anything? Well there's only one way to find out... beat the game!\nYou must help our penguin hero escape a hellish complex through 24 levels filled with spikes, bombs, robots, traps, and more!\nPrepared to die? Just remember one thing... RED is DEATH.\nKey Features\n- Simple to play but difficult to clear\n- 24 crazy levels including some special retro levels for nostalgic fans\n- The best-looking version of Run Run and Die\n- Collect all energy balls for advance in the game\n- Enjoy full color illustrations that narrate the story\n- Connected to Twitter and Facebook","imageUrl":"https://media.rawg.io/media/screenshots/444/444387b1d4fc64cccf003b531a8e7a73.jpg","releaseYear":2015,"developer":"EnjoyUp Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"}]}]