[{"id":20305,"name":"Claire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e94/e9403b3e50ac044b44f39f91dce23b85.jpg","description":"Claire is alone, lost, and hunted. The world has quickly becomes shrouded in darkness with unseen threats stalking Claire from the shadows. Aided by her dog and armed only with a flashlight, Claire must conquer her fear and find her comatose mother. However, there are others lost in the darkness seeking salvation. Claire must decide who she is going to save. With every choice she'll begin to discover who she really is and whether she deserves to be saved herself.\n-Play as Claire and explore multiple levels accompanied by your dog, Anubis.\n- Use a lighter or a mouse-controlled flashlight to explore an increasingly dark world.\n-Contend with the panic system, a system that increases the scariness of the environment as fear tightens its grip on Claire.\n-Fight back Claire’s fear and stay alert with items scavenged from the dark corners of the world.\n-Find others lost in the darkness, help them and decide to save them or leave them be.\n-Multiple endings determined by plot choices and interactions with the others.\n-Multiple difficulty settings, including “Nightmare” where Claire can literally be scared to death.\n-New Game + allows you to keep your items and ramp up the difficulty.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hailstorm Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":15068,"name":"Shower With Your Dad Simulator 2015: Do You Still Shower With Your Dad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/5346dde02959f10281eb9a0abeefab6c.jpg","description":"Epilepsy warning: This video game contains flashing images.\nCheck out the original SHOWER Steam Greenlight trailer on YouTube!\nPlease note that the censored version shown in the above screenshots and trailers are for public marketing images only. Shower With Your Dad Simulator 2015 in-game genitalia remains 100% uncut.\n\"Shower With Your Dad Simulator 2015: Do You Still Shower With Your Dad?\" is a fast paced shower-simulation where you shower with your 8-bit dad.\n- Fast Pace Dad Showering Simulation\n- Includes 3 dads! That's likely more than the average amount!\n- 3 different game modes including ENDURODAD (Endurance Run), DADATHLON (Fast Pace Dad Matching), and DAD DIVISIONS\n- OST included!\n- Featured on Comedy Central's @Midnight with Chris Hardwick!\nhttp://www.cc.com/full-episodes/x58tvp/-midnight-tuesday--march-3--2015-season-2-ep-02069\n\"You know what I like? In the 8 bit world, all d[expletive] are equal.\" - Chris Hardwick, host of \"@Midnight\" on Comedy Central\n\"Also am I the only one that notices that that's a Tom Selleck moustache on your small child?\" - Jessica Chobot, host of \"NerdistNews\" on Nerdist.com\n\"that's it i hate videogames﻿\" - John \"Total Biscuit\" Bain, man on youtube\n\"I'm scared to touch the dads\" - Jim Sterling\n\"Well this is clearly the greatest game of all time, I'm gonna quit my youtube channel right here.\" - PewDiePie\n\"You can't spell 'game refunded' without 'fun dad!'\" - me\nWhy not?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"marbenx","platforms":[{"id":0,"name":"PC"}]},{"id":10549,"name":"60 Seconds!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/339/3393cbf64151fe40998853fd2310213c.jpg","description":"As Ted, a responsible citizen and a family man, you are faced with a slight disturbance to your happy, suburban lifestyle. THE NUCLEAR APOCALYPSE.\nWith only 60 seconds left to impact, guide Ted in a mad, intense and action packed dash through his house in search of his family and useful supplies. Everything will be against you - time, your very own furniture, the house that's different every time you play and the fundamental question - what to take with you and who to leave behind?\nReaching the fallout shelter in time and alive is only the beginning. Whatever you scavenged and whoever you saved will play a vital role in your survival. Each survival story will be different, with every day surprising you with unexpected events. Will all of these stories end well? It's up to you. Ration food and water, make best use of your supplies, face difficult choices and even venture into the wasteland.\nGood luck.\nEXPERIENCEthe suburbian nightmare of a nuke dropping down on your neighbourhood in this atomic, dark comedy set in 1950s.\nSCAVENGE any supplies, you will need to survive, and family members in a 60 second rush through your procedurally generated house.\nPREPARE  for the worst. Don’t just grab arbitrary items, plan your survival and follow helpful tips from emergency broadcasts!\nSURVIVE  in a fallout shelter with whatever you brought with you. How many days will you last? Will everyone make it out alive?\nDECIDE what to do, when the post-apocalyptic world pushes you to the corner. Will you risk going outside? Who is not eating dinner, when barely any food is left? How do you deal with a mutant cockroach infestation?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Robot Gentleman","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":279603,"name":"NEOVERSE","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/75a/75a24fe7a7c5d421f4077dcce8962b11.jpg","description":"Neoverse is a beautiful, fantastic game consisting of adventures with thrilling challenges. It is a strategic, action, rogue-lite, deck building game that will test the player’s skill. Start an adventure with unique heroes to save the world along various timelines.“Be the savior of Neoverse”3 amazing characters, all with their own unique characteristics300 strategic cards and more than 100 skillsOver 70 types of monsters with different patternsA never-ending continuation of unlimited possibilitiesTranscend difficulty settings for the more challenge-driven players“Various short stories of time and space waiting for you”Different combinations created using new cards each time you playFuture destinations that change each time choices are madePlots and enemies that leap across the past, the future, and legendary tales“Various new attempts”Charismatic protagonists with unique actionsAuto-draw system when cards are remainingDifferent skill combinations based on the character“All you need is the time to enjoy playing the game”The various cards and enemies you meet on your journey through the Neoverse, your problems, your joy -- these things will all become one and you will find yourself in the future. Various characters, cards, and new modes will be added to provide a fun-filled, thrilling experience.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Tinogames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":258385,"name":"Fantasy Blacksmith","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40d/40df89eb40d66b251502aca026ad8e8f.jpg","description":"You are a blacksmith in the world of the sword, magic and war, in which any blacksmith who knows how to make even the simplest swords is in demand. You start off as a poor unskilled blacksmith, but in time you will gain experience and improve to achieve wealth, fame and power, and change this world!\nFantasy Blacksmith is a magically realistic blacksmith simulator in which you have to create and sell weapons. Also, your smith will gain more experience and become stronger and more accurate with each created sword. You can also improve your equipment in the smithy, buy a better forge, better grindstone, improve your hammer and etc. We want to create an exciting and interesting simulator in which any player can make his dream sword. ;) We are developing the game and creating 3D models from scratch. From the finished content, we take the textures and effects, and then we rework most of them.\n\"You are a smith and you create swords!\"\nThe creation of the sword begins with the drawing. The sword consists of 8 parts: Blade (5 parts), Cross-guard, Handle, Top. You choose the material from which the sword will be made. It can be iron, bronze, titan, tungsten, mithril, silver, gold, etc. Using the large number of options offered and your imagination, you can create a huge number of unique swords. We believe that there may be more than 10 billion different swords that you can create.\n\"Using a hammer, beat your ingot into a blade\"\nAccording to your drawing, you will be hammering the red-hot metal to give it the shape of a blade.\nYou also need to remember to keep the metal temperature high, if it cools down, you can not forge it.\"Finally I can make Damascus steel\"\nYou will have the opportunity to practice alchemy. Using different chemical mixtures of the correct recipe, you can create a damask pattern on your sword. Depending on the proportion of the mix of the chemical elements, and on the heating and holding the mixture, the result will depend.\nOne thing I can say for sure, you will not get two identical patterns.\"Feel yourself a witch\"\nOne of the most interesting parts of the gameplay is making a magic potion. This is a very exciting and dangerous process. Having done everything correctly you will get a new sword from the mythical material, but if you make a mistake you can spoil the sword or even destroy it.\nIn the game there will be a lot of ingredients for the magical boiler and by collecting everything by recipe, you will get many different potions.\"Long live runic magic\"\nTo superimpose magic effects on weapons, runes will be used, depending on the pattern on the magic table, different spells will be cast on the weapon.\n\"Casino in the Forge\"\nWe will add a few mini-games for a variety of gameplay. Currently, dice and darts are being developed. Also artificial intelligence of rivals will be added. In mini-games you can try to sell your goods at an inflated price or play for money or rare artifacts with visitors to your forge.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Heaven Brotherhood","platforms":[{"id":0,"name":"PC"}]},{"id":2219,"name":"Geometry Wars 3: Dimensions Evolved","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a21/a21aec319fac51b9088c6f6b60335090.jpg","description":"Experience the full evolution of the award-winning Geometry Wars franchise and battle through waves of enemies on 3D grids in this frenetic arcade shooter!\nGeometry Wars 3: Dimensions Evolved includes all of the great content & features from Geometry Wars 3: Dimensions and more:\nOver 100 total levels including 40 all-new\nClassic game modes in stunning HD\n15 3D grids including 5 all-new and 12 battle modes including Pacifism, King, Claustrophobia and 4 all-new modes\n6 unique companion drones including Attack, Collect, Ram, Snipe, Defend and the all-new Sweep drone\nNew “Hardcore” mode for Geometry Wars purists with no drones or supers and a separate leaderboard\nCooperative and Online Competitive Multiplayer modes\nCommunity and Friend Leaderboards","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aspyr Media","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":485203,"name":"King of Seas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/558/558c830db14f8f928602a5406050e726.jpg","description":"“Cannon shots echo on the seven seas as on the horizon the sun rises on a new dawn of pirates. Drop your moorings, unfold the sails and launch yourself into the heart of the storm shaping your empire. The murder of your father will not be forgiven.\"\nKing of Seas is an Action Role playing game set in a deadly procedurally generated pirate world. In a ferocious plot you will fight to regain what has been taken away and embark on an epic adventure in a fantastic world, filled with battles, lost islands and treasures. A universe full of amazing characters and breathtaking missions will keep you anchored as you strive to become the king of all pirates.\nMAIN FEATURES\nStory: A series of quests guide you on your journey and uncover the intriguing characters of the King of Seas world who will lead you to the next path of your epic adventure.\nProcedural Generation: Dive into a lush, procedurally generated world that constantly refreshes the exploration mechanics within each new game.\nDynamic World: The world reacts to your every action, naval routes change and with each conquered settlement the difficulty adapts to constantly give you a more challenging time.\nMap: A thick fog will ensure travelling towards objectives is not plain sailing, after all wouldn't you want to lose the joy of exploration !?Navigation system: Atmospheric effects influence gameplay. Sail during a storm at your own risk, escape the enemies and always remember to carefully watch the wind direction to stay in control during battles. The strategy starts here.\nShip customization: Five types of highly customizable ships through an equipment and skill system, just as in any true role-playing game!\nCombat system: Not only cannon shots and nautical strategy but also speed and spectacle, thanks to a set of more than 20 skills to choose from and three branches of talents to suit any playstyle.\nADDITIONAL FEATURES\nSpecial Missions: Extra rewards await you upon completion of these secondary missions, each settlement you conquer will be the source of new adventures!\nTreasure hunt: Secret maps are hidden in the abyssal depths, find them and obtain directions to submerged treasures!\nTrading: Each settlement produces specific products with their own market value. Buy them at the lowest price possible and sell them to other settlements where they are in demand. Buy low, sell high, this is the basis of trade!\nFishing: Find as many as 30 varieties of fish living below the ocean surface. Fish them all but be careful to observe the time of day and weather conditions...\nRanking: Every battle won will drive up the bounty on your head, compare it with the most famous pirates of history. Be the King of Seas!\nMultiple difficulties: The difficulty level adds a substantial multiplier to the bounty obtained in the game. How much will you be able to generate in hardcore mode?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"3DClouds","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":455598,"name":"Lost in Random","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7e/f7ed6cf588d66eab5bb3872dc1ddcd78.jpg","description":"Welcome to the world of Random, a dark kingdom where every citizen’s future is determined by the roll of a dice. Will you be defeated by your fate or embrace chaos and learn to make it work in your favor? Embark on a journey with Even and her sidekick Dicey to play the odds and break the curse of Random.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Zoink!","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":372595,"name":"The Jackbox Party Pack 6","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/065/0650e7aec272521a46690827eedb2559.jpg","description":"It’s the wildest Party Pack yet with five hilarious new games!\n1)\tThe popular trivia deathmatch Trivia Murder Party 2 (1-8 players). Try to survive the bizarre new minigames.\n2)\tThe weird word circus Dictionarium (3-8 players). May the funniest definition win.\n3)\tThe hidden identity game Push The Button (4-10 players) . Can you discover the aliens in time?\n4)\tThe comedy contest Joke Boat (3-8 players). Craft one-liners for a cruise ship talent show.\n5)\tThe offbeat personality test Role Models (3-6 players). Find out who you really are. (Or at least what your friends think of you.)\nPlay using your phones, tablets or computers. No extra controllers needed!\nNOTE: The Jackbox Party Pack 6 is in English only.\nNOTE: The game is local multiplayer but can be enjoyed over streams with remote players.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":29223,"name":"Griftlands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/81b/81bf6b3cb4851f135b90091ec8ac5445.jpg","description":"Griftlands is a deck-building rogue-like where you fight and negotiate your way through a broken-down sci-fi world. Every decision is important, be it the jobs you take, the friends you make, or the cards you collect. Death comes quickly, but each play offers new situations and strategies to explore.\r\n\r\nPlay as Sal, Rook, or Smith. Three unique character campaigns with their own specialized decks, abilities and maps to explore. Sal is an adventurer out for profit and revenge. Rook is an aging spy working his own agenda. Smith is an idle loafer who might just save the world. Each playable character's story takes place in a unique environment, with different factions and locations to explore and exploit.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":16709,"name":"Decay: The Mare","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7cc/7cce32c1c8f43462413a314c02adbd31_XIUrd4S.jpg","description":"A new psychological horror adventure game from the creators of the successful Decay series:\nSam is an addict who ends up in an institution named “Reaching Dreams”, hoping to kick his drug problem and sort out his miserable life. But during the first night, something goes horribly wrong and he gets stuck in an endless nightmare…\nDecay – The Mare is a 3D psychological horror adventure and homage to the Resident Evil and Silent Hill games, as well as to horror adventure games like Phantasmagoria, The 11th Hour and Gabriel Knight.\nFor the first time the compelling, high-tension Adventure is available in one package, including an exclusive third chapter that will bring Sam’s journey to an end.\nDecay’s developer Shining Gate Software is a small indie studio located in Stockholm, Sweden. The studio is best known for their work with DICE and Electronic Arts on the Battlefield franchise and for their own Decay series, released on multiple platforms.Key Features\nContains the defining third chapter\nAll three chapters of the game in one compelling experience\nAmazing atmosphere, art and music\nScary and deep story\nChallenging riddles and puzzles\nUnlock achievements and collect all Steam Trading Cards to receive exclusive emoticons and profile backgrounds.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":15349,"name":"The Last Door - Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82f/82fba05f2bcf83a33bda24555694b78b.jpg","description":"Feel what it's truly like to be alone in the dark with this low-res, high-suspense point-and-click horror adventure, winner of multiple Best Games of the Year awards. Set in Victorian England, when Jeremiah Devitt receives a letter from his old schoolmate Anthony Beechworth with a hidden, cryptic message, he knows something is wrong. His journey to an abandoned manor is only the beginning as he starts to remember a long-buried secret from his youth, discovering things man was not meant to know, and opening doors that should have remained closed…\nThe Last Door: Collector’s Edition contains four terrifying episodes of occult and otherworldly horror inviting you to investigate Victorian England's deepest, darkest secret. Featuring new scenes and puzzles, enhanced graphics, unlockable bonuses, and remastered sound. Explore ancient manors, decaying tenements, and twisting underground warrens with little but a lamp and magnifying glass to guide you. Dare you open The Last Door: Collector's Edition?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"The Game Kitchen","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":586936,"name":"Super Auto Pets","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c76/c767ad9cbf2b47cb112ea73445010e81.jpg","description":"Battle against other players at your own pace in this free to play chill auto battler.\nIn Super Auto Pets you build a team from a lovable cast of animals who will fight for you. They each have unique abilites, so choose wisely who will join your team!\nFeatures two modes\nArena mode, asynchronous match ups, no turn timer! Can you reach 10 medals?\nVersus mode, match up against X other players, can you come out on top?\nPlease note that this is a beta release. Things are subject to change, and there might be some imbalance issues. Feel free to report any issues by sending us an email or joining our discord!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"teamwood","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":64143,"name":"Etherborn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/637/6371815cb6af854220b1e2dd2e2af15f.jpg","description":"Etherborn is an environmental puzzle platformer built on exploring and understanding gravity-shifting structures.\nYou are a voiceless being that has just been born into a world where a bodiless voice awaits your arrival. As your first thoughts emerge, you realise your journey has just begun. You must reach this ethereal voice to fully understand your own existence.\nNavigate through beautiful and exotic sceneries where the environments are puzzles in themselves. Interact with the world in many different angles, unveil its mysteries and find the correct paths to advance and reach the calling voice.\nIn this world, the laws of physics behave in a way that will bend your imagination. You experience gravity perpendicular to the surface you are standing on, allowing for creative exploration possibilities in environments carefully crafted as navigation-based puzzles.Etherborn features:Platforming and exploration in 3D gravity-shifting levels\nNavigation based puzzles and challenges redefined - your character’s gravity changes relative to the level design\nA surreal atmosphere inspired by artists of the XX-XXI centuries\nA poetic story line about the discovery of our true nature\nA dynamic and immersive original soundtrack","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Altered Matter","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":59986,"name":"Black Future '88","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/431/431a2b297423a9f3928d2fc99cf96a10.jpg","description":"Black Future ’88 is a Synth-Punk roguelike 2D action Shooter. Vertically climb an always evolving procedural tower to reach the top and kill its insane owner…before your heart explodes. Shoot, slash, dash and upgrade yourself to survive the endless waves of deadly traps, homicidal AI, crazed junkies and colossal Wardens standing in your way in a stylish alternative version of 1988.\nThe world is reeling from a nuclear cataclysm, created by Duncan, the tower architect. The First of his bombs fell in the summer of 1988, and by December they had blacked-out the sun with endless rain. We decided to stop keeping time after this, and it’s been 1988 ever since. Everything that lived through the initial attack will die in the extreme floods that followed.  These are the times after, where there are no more months, or even weeks…everything is measured in minutes left to live.\nTake on the mantle of one of the last remaining misfit survivors, and fight your way to the top of the tower to kill the architect and stop the endless nuclear rain. Ascend to die, and die to survive.Game FeaturesDeath Ascendant: Climb an always evolving procedural tower and fight for survival through a constant onslaught of death by fire, lasers, and slashes.\nUnique Synth-Punk World: Play through a unique take on a retro cyberpunk dystopia, and fight to survive through 5 distinct zones each with their own challenges.\nPick Your Poison: Play as one of 5 playable characters, each with their own unique buffs- and weaknesses.\nRuin Friendships: Test your wits and reflexes with a friend in couch co-op, and experience a completely unique take on the co-op roguelike.\nKill the Wardens: Fight for survival by challenging the numerous unique bosses that guard each one of the game’s zones.\nFog Machines and Laser Beams: Bring a gun and laser sword to a fire fight by arming yourself with a selection of the 50 unique weapons available in the game, each with their own unique effects.\nEvolve to Survive: The only way to survive when everything, including your own heart, is trying to kill you is to carefully boost or curse yourself by strategically choosing- and combining from 30 distinct buffs and curses.\nDailies: Every day, a new challenge is generated with unique attributes that will test your mettle and allow you to see how your skills compare against other players in a global Leaderboard. Fight for not just survival, but supremacy!\nEar Candy: Death never sounded so good thanks to an all killer original analog-synth soundtrack performed by Tremor Low.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SUPERSCARYSNAKES","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":28534,"name":"ASURA'S WRATH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/438/438c07ddb573d47f1c50e2ca1859982f.jpg","description":"Once a revered deity, Asura was betrayed by his fellow gods and stripped of all his powers. Consumed by anger at the injustice he has suffered and swearing vengeance, Asura discovers he can use this fury to his advantage and turn it against his enemies. By channelling his inner rage, Asura is now able to unleash devastating attacks and wreak havoc as he battles against the deities who have wronged him and their earthly forces. Inspired by episodic dramas, Asura's Wrath will be split into distinct sections with gameplay and narrative unfolding as one and building to a final climatic conclusion.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":21816,"name":"Chompy Chomp Chomp","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b12/b12399b287d18c2f9d9df73fbfe93b78.jpg","description":"We make games with a purpose. The purpose of Chompy Chomp Chomp is to bring people together.\nChompy Chomp Chomp is a game where people of all ages, tastes and skills can play together, and enjoy themselves on a level playing field. Play with your friends/kids/boss/gran, lose your inhibitions, shout and scream and generally have an awesome time.\nIt’s fun, but it’s having fun together that is the important part.\nChompy Chomp Chomp is a maze-based multiplayer rampage in which Chompies chase each other around trying to eat their target colour Chompy. Underneath your Chompy's feet you have a target the colour of the Chompy you need to eat. You get points for chomping, you lose points for being chomped. The target colours change at random, turning hunters into hunted and vice versa.\nIt has been awesomely described on a forum somewhere as \"the bastard love-child of Pac-Man and Bomberman\"\nCustomise your game to chomp your way through rich and varied arena environments and try all the different power-ups.Current features 1-4 players, local multiplayer\nPC exclusive single player/co-op mode\nAI Bots\nLots of power-ups\n15 different arenas (with more already on their way)\n27 Steam Achievements\nOnline is not included yet. We would like to add online as an update, so give the game a go and let us know if you would like us to add it. We're sorry we couldn't add it yet, so to make up for it, we have included an extra single player/co-op game exclusive to PC.\nSwitch your target colour between yellow and purple to eat the Blobbidees. Eat all the Blobbidees that have infested our garden! Huddle round the keyboard to team up and chomp them all, but run away from the Queen Blobbidee, she’s relentless!\nWe hope you enjoy our game!\nSarah & Woody\nfrom the Utopian World of Sandwiches","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Utopian World of Sandwiches","platforms":[{"id":0,"name":"PC"}]},{"id":2374,"name":"Dangerous Golf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e84/e840ed90103525a5b15554989e230bec.jpg","description":"Mixing arcade style high score gameplay with humorous irreverence, Dangerous Golf isn't about Par or Birdie. The aim of the game is to cause maximum damage over 100 holes and four unusual locations.\nSmash up the toilets, make a big mess in the Kitchen, destroy priceless antiques in the Palace. This is golf played indoors where the more expensive the object the higher its game value. Humorous destruction and over the top trickshots are the way to score big.\nDestroy enough things off the Tee and you’ll earn a SmashBreaker. This turns your Ball into a Fireball that you can steer around the level causing more destruction and chaos. The bigger the mess, the bigger the Score.\nLong shots, Ricochets and yet more Destruction are the name of the game when Putting. Hitting your ball straight into the hole is NOT what Dangerous Golf is about and whilst you can do that it won’t earn you the big medals or help you beat your Friends to the top of the Leaderboards.\nIf you buy and play our game … thank you .. and we hope you have fun. We are supported 100% by our players, no corporate or VC safety nets here.\nSo if you experience any problems at all please tell us – so we can have a go at fixing whatever problem it is you’re having. We are a team that loves to listen to our players and we strive to do better every day. Details at http://www.threefieldsentertainment.com/contact/.Four Ways to PlayWorld Tour - 10 tours, 10 holes in each. As you progress you unlock new locations and extra Abilities that'll help you do even more Damage.Coop World Tour  – Play the World Tour co-operatively with a friend or family member. This is the perfect couch Co-op experience. Both players play sequentially into the same scene making it the perfect game for players of mixed ability. One or more controllers.Party Golf (Offline) – Local competitive pass-the-pad Party Golf mode for 4 players. Use one or more controllers, all sign in with your profiles or play as guests, this is the perfect game to put on when your friends come round.Party Golf (Online) – Take on and play against the most dangerous golfers in the world. Up to 8 Players.Four Unique LocationsUSA – Kitchen – Make a huge mess in the Kitchen. Splat food onto the walls and floor, break Microwave Ovens and Dishwashers. Break open the Store Room, access the Back Alley and trash the Bathroom.England – Castle - Cause chaos in the Castle. Knock down the suits of Armour, spill paint onto works of art and smash priceless antiques. Explore the Dungeon, Armoury, Queens Corridor and redecorate the Great Hall.France – Palace - Let them eat cake – but only after you’ve knocked it all to the floor. Break bottles, vases, tables, grand pianos and grandfather clocks. Drop down to the Wine Cellar, make a noise in the Library or break into the Secret Vault.Australia – Disturb the peace and serenity of the Outback. Set fire to the pumps, break all the windows and run riot in the store. Tee Off on the Forecourt, make work for somebody in the Workshop, spray paint in the Paint Shop, rock the Rooftop and light up the Alleyway.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Three Fields Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":1204,"name":"Marvel Puzzle Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10b/10bc57566c85770610893f131560b0ed.jpg","description":"Update NotesMPQ 134!\n\"His teleport is worse than his bite!\"\nCountdown tiles that return to their base number instead of being destroyed are now Repeater Tiles and have special rules.\nVarious bug fixes and character balance changes.\nFor full update notes (English) visit d3go.com.\nThank you for playing!\nJust UpdatedMPQ 134!\n\"His teleport is worse than his bite!\"\nCountdown tiles that return to their base number instead of being destroyed are now Repeater Tiles and have special rules.\nVarious bug fixes and character balance changes.\nFor full update notes (English) visit d3go.com.\nThank you for playing!\nAbout the GameThe Marvel Universe comes to life in the original match 3 RPG: Marvel Puzzle Quest! Join the alliance in this unparalleled match-3 puzzle battler that combines your favorite Super Heroes and Super Villains together with deep RPG leveling, player vs. player tournaments, alliance building and more! Be one of the 5 million around the world and unleash your inner super power!\n9.1 out of 10 “An intricately crafted, remarkably deep experience -- Marvel Puzzle Quest doesn’t merely meet the expectations of its name, it exceeds them.” - IGN.com (Editors’ Choice Award)\n• \tMATCH AND UNLEASH FURY\nMatch tiles to annihilate your opponents, harnessing superpowers from Hulk’s massive strength to smash your enemies or Professor X’s mind control to manipulate the game board!\n•\t RECRUIT MARVEL’S GREATEST HEROES AND VILLAINS\nRecruit members of the X-Men, Avengers, S.H.I.E.L.D., Guardians of the Galaxy and more to create the ultimate Marvel dream team! Whether you combine Spider-Man with his arch-nemesis Venom, or Captain Marvel with her Ms. Marvel successor, Kamala Khan, assemble your very own epic team!\n• \tUPGRADE YOUR CHAMPIONS AND GAIN POWERFUL REWARDS\nHarness the power of Iso-8 to upgrade your team and collect comics to unlock characters and abilities. Master and enhance your character’s abilities to pummel your enemies!\n• \tPLAY WITH FRIENDS IN TOURNAMENTS AND MORE!\nSnag the top rank in Tournaments, Alliances, and Season Play for new character rewards and other prizes!\n• \tBECOME PART OF THE MARVEL UNIVERSE\nWritten by Marvel veterans Frank Tieri (Iron Man, Wolverine, Weapon X) and Alex Irvine (Iron Man: The Rapture, Daredevil Noir) and now with new events, features and tournaments that pull directly from the Marvel universe!\nGame is available in English, French, Italian, German, Spanish, Japanese, and Korean.\n© & ™ 2017 MARVEL. ©2017 CPII. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":388947,"name":"MOLEK-SYNTEZ","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2d/c2d0beabd09e8a0f6d956cbeb3152471.jpg","description":"December 2092\nCluj-Napoca, Romania\nThese walls don’t do a damn thing to keep the cold out.\nI should go outside and walk.\nInstead, I light another cigarette and keep working.\nMAKE DRUGS - Program your molecular synthesizer (MOLEK-SYNTEZ) to convert ordinary industrial chemicals like benzene, acetone, and hydrochloric acid into a variety of small molecules with various pharmacological effects.\nSHOW OFF - Optimize your solutions and share them with the world using the built-in score histograms, friend leaderboards, and animated GIF exporter.\nCHEAT AT CARDS - In a move that should surprise no one, MOLEK-SYNTEZ contains an original Zachtronics solitaire game. When you get stuck, cheat and place your cards wherever you want. Just don't do it so much that you get in over your head...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Zachtronics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21725,"name":"Freedom Force vs. the Third Reich","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e9/1e9b788a1155ce5b6e3be5158b5f5087.jpg","description":"Freedom is threatened yet again and only Minute Man and his heroic Freedom Force can save the day in the follow up to one of the most critically acclaimed games of 2002.\n\nFreedom Force vs. the Third Reich brings dynamic storytelling, fast-paced tactical role-play, and larger-than-life characters from the comic book pages to the computer screen. In this title, the league of heroes must travel back in time to defeat Blitzkrieg, defender of the Reich and his homicidal henchmen. With action spanning from the blasted battlefields of World War II to the dazzling depths of distant dimensions, Freedom Force vs. the Third Reich will give Freedom Fans more than they can handle.\nMultiplayer available in LAN or Direct IP Only.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"2K Australia","platforms":[{"id":0,"name":"PC"}]},{"id":16171,"name":"The Odyssey: Winds of Athena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51e/51e8bbdd67fac38fdf1eb64180e8ec6e.jpg","description":"EXCLUSIVELY FOR WINDOWS PC\nAs the Greek Goddess Athena, control the wind, seas, and air to guide the hero Odysseus back home.  In this physics-based overhead strategy game, based on Homer's The Odyssey, you'll manipulate the environment to help Odysseus's fleet return from the Trojan Wars.\nRealistic water current simulation will amaze and challenge you, as you use your godly powers to protect the Hero's fleet.\nGuide the fleet through gorgeous scenery that surrounds Mediterranean Sea.\nProtect the fleet from cyclones, harpies, sirens, and other mythical beasts, through over 50 unique levels! Put your strategic skills to the test, as you work through a myriad of intriguing scenarios!Key Features\nOver 50 amazing hand painted levels.\nNew exciting dangers for your boats including sirens, sea-monsters, storm clouds and more!\nReplay any level at will to increase your score and rating.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Liquid Dragon Studios","platforms":[{"id":0,"name":"PC"}]},{"id":11950,"name":"ICEY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/935/935c77e612cfeedcdffe02394c2ad343.jpg","description":"ICEY is a 2D side-scrolling action game. As you follow the narrator's omnipresent voice, you will see through ICEY's eyes and learn the truth about her world.\n“Alright, you caught me! This ISN'T really just a simple 2D action game, and you WON'T be seeing through ICEY's eyes... NOR will you learn the truth about her world.\" says the narrator.\n“ICEY is a Meta game in disguise. The narrator will constantly urge you in one direction, but you must ask, \"Why? Why am I following his directions? Why can't I learn the truth about this world and ICEY's purpose here?\" Fight against his tyranny, and uncover what's really going on for yourself!\nIn fact, you can become ICEY, and let loose the shackles of your own identity. You are ICEY, and ICEY is you... if you want it that way. Feel free to keep hold of your own self, if you wish.\nNow Is the Time For You to Discover the Truth.\nYou See? ICEY, I See!\nFast-paced Combat:\nCrush enemies in the palm of your hand.\nAttack! Dodge! Counterattack! Do not hesitate.\nThis is the only way to survive!\nIncredible Combos:\nWith simple controls, amazing combos are easy to unleash, even for beginners.\nEvery skill is special in its own way. Master your favorites and create your own fighting style!\nMassive Cyborg Bosses:\nCan you withstand the onslaught of attacks from terrifying cyborg bosses?\nEvery boss unleashes flurries of different attacks. It's up to you to find their weak spots and tear them apart!\n-Nominated, Tokyo Game Show 2016 DENGEKI PlayStation Best Indie Game\n-Official Selection, 2016 Gamescom Indie Arena Booth\n-Most Promising Game 2nd Prize, Taipei Game Show 2016\n-Official Selection, Casual Connect Asia 2016\n-Official Selection, IGF China 2015\n-Best Technology Award, Indieplay 2015","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"X.D. Network","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":8577,"name":"Five Nights at Freddy's: Sister Location","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6e/c6eb418beab0a064347be8b890dea33f.jpeg","description":"Welcome to Circus Baby's Pizza World, where family fun and interactivity go beyond anything you've seen at those *other* pizza places! With cutting-edge animatronic entertainers that will knock your kids' socks off, as well as customized pizza catering, no party is complete without Circus Baby and the gang!\nNow hiring: Late night technician. Must enjoy cramped spaces and be comfortable around active machinery. Not responsible for death or dismemberment.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":377011,"name":"Terminator: Resistance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d44/d443ae8ffc72fdb77a27207a196788e5.jpg","description":"Experience the events leading up to the decisive final battle for the fate of mankind in the war against the machines. Terminator: Resistance, is a first-person shooter set during the 'Future War' scenario that was only glimpsed at in the iconic films, 'THE TERMINATOR' and 'T2: JUDGMENT DAY'. The machines are destined to lose, but at what cost?\nRun and gun or sneak and hack through Skynet’s defences!\nLevel up your skills and explore a post-apocalyptic world for scraps to trade and craft!\nInteract with a motley group of survivors and change their fates!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Teyon","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":16122,"name":"LOOM","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfd/cfdfaaddca4f351b27f965a2f97af0f4.jpg","description":"Long after the passing of the Second Shadow, when dragons ruled the twilight sky and the stars were bright and numerous, came the Age of the Great Guilds.\nBlacksmiths. Shepherds. Clerics. Each dedicated to the absolute control of secret knowledge.\nAnother such Guild was the Weavers. Over the centuries, their craft transcended the limits of physical cloth, until they wove the very fabric of reality itself. Now, a strange power has swept the Weavers into oblivion, leaving behind one Weaver boy to unravel the mystery. Help young Bobbin rescue his Guild...and you just might save the universe from an unspeakable catastrophe.\nAn Extraordinary adventure with an interface of magic…\nStunning, high-resolution, 3D landscapes.\nSophisticated score and musical effects.\nDetailed animation and special effects.\nElegant point 'n' click control of characters, objects and magic spells.\nNo burdensome typing, mapping, or inventory management.\nAn easy and engaging game for beginners and veterans alike.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":295015,"name":"Haven","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f3d/f3d16029b8a52c3e0d6420ac13f19821.jpg","description":"Two lovers gave up everything and escaped to a lost planet to be together. Glide through a mysterious landscape, explore a fragmented world and fight against what’s trying to tear them apart in this RPG adventure about love, rebellion, and freedom.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"The Game Bakers","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":53207,"name":"Comix Zone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/da7/da77171112e11fbc2ad2114186bcd2bf.jpg","description":"Comix Zone is a 1995 beat 'em up video game developed and published by Sega for the Sega Genesis. An unusual feature of the game is that it is set within the panels of a comic book with dialogue rendered within talk bubbles and sprites and backgrounds possessing the bright colours and dynamic drawing style favoured by superhero comics. This style had been used in video games previously, for example Ocean Software's Batman: The Caped Crusader in 1988, but Comix Zone stretched the idea to such an extent that Sega applied for and were granted a patent for a \"Videogame system for creating a simulated comic book game\".\nThe concept for the game originated from a Commodore Amiga demo video animated by Peter Morawiec titled \"Joe Pencil Trapped In The Comix Zone\". The video was made in 1992, displaying the animation of how the gameplay and the comic book elements would blend in.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Genesis"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Wii"}]},{"id":22903,"name":"Leisure Suit Larry: Love for Sail!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/109/1096d7ebb82582e3f0295857de8839bb.jpg","description":"When we last saw our less-than-dashing hero, Leisure Suit Larry, he was in a rather sticky situation. Not one to be tied down, Larry makes the best of things by going on a cruise to forget the previous escapade. Once he arrives on the deck, he finds out there’s a Mega-Contest for the heart and body of one Captain Thigh, the sexiest sea captain this side of the Atlantic. Our hero must use his wits and wiles...wait, he’ll just cheat and “win” his way into the Captain’s bedroom. Set sail for steamy adventure on the high seas!\nLeisure Suit Larry: Love for Sail! drops a world-class lounge lizard onto a cruise ship filled with gorgeous women and side-splitting slapstick. Using the latest and greatest technology of the time, the Grope ‘n’ Click interface is perfect for those moments of “one handed mousing”. No more icons! No more messing around! If that’s not enough, you can always type in your own personalized and customized responses and see what happens. Don't miss the final classic installment of the hottest point-and-click adventure in existence!A bountiful bevy of beautiful, bouncing babes in every nook and cranny of the game!\nExquisitely hand-drawn graphics and animation along with some hidden Easter eggs that will make your eyes pop!\nWitty humor alongside spicy dialogues, a feast for the discerning and adventurous gentleman!","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21379,"name":"Depression Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57c/57c6094b3ebb26003c9d0f2a0e8c9656.jpg","description":"Depression Quest is an interactive fiction game where you play as someone living with depression. You are given a series of everyday life events and have to attempt to manage your illness, relationships, job, and possible treatment. This game aims to show other sufferers of depression that they are not alone in their feelings, and to illustrate to people who may not understand the illness the depths of what it can do to people.\nOver 40k words of interactive fiction.\nPlaythroughs are short enough to be done in one day, but long enough for the game to have gotten it's point across.\nAbout 150 unique encounters.\nBased on your depression levels, different choices open and close off to you.\nContent generated based on your decisions.\nThe choices you make have a real effect on how your playthrough turns out.\nMultiple endings.\nSee how your choices affected the game's world, and how well you've managed your depression.\nAudio and visuals react to your depression.\nListen as the music gets glitchier and see how much stronger the static gets. Watch the color get sucked out of how you see the world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Isaac Schankler","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18718,"name":"Frontlines: Fuel of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/500/500a374f7438dbdda12a0739d7926f1a.jpg","description":"Frontlines™: Fuel of War™ is an open-world First Person Shooter set on the frontlines of tomorrow. In a world ravaged by a global energy crisis, environmental decay, and economic depression, players assume the role of an elite soldier in the Western Coalition Army on an epic crusade against the Red Star Alliance to control the last of the world's oil reserves. Frontlines: Fuel of War combines cinematic, non-linear game play with next generation firepower and a revolutionary Frontline Combat System™ to deliver the most thrilling and intense FPS to date.\nFrontline Combat System - In both single player and multiplayer modes, join the forces on the frontline in focused, intense combat.\nOpen World Environment - In both single player and multiplayer modes, create your own path to victory with non-linear mission objectives and destructible environments. Chip away at the battle instead of standard die and redo system.\nNext Generation Firepower - Over 60 next generation vehicles and weapons inspired by military designs of the near future including jets, helicopters, tanks, APCs and more.\nCustomizable Soldier System - Character customization allows you to represent your play style through character choices, weapon load out and role specialization.\nAdvanced Team Play - Supports up to 64 players on PC via LAN or Internet with shared targeting systems, squad based VOIP and more.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Kaos Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":10831,"name":"State of Anarchy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8a/c8a4a450ebb486d34741d8483d0f6cb9.jpg","description":"State of Anarchy is a hillarious take on the top-down crime simulator!\nThe whole town has gone mad!\nShoot anything that moves!\nDo not release the gas pedal!\nAnarchy has never been so much fun!\n\"Annoyingly enjoyable. I laughed in spite of myself.\"\n\"Looks and plays like the imagination of a small child. In a good way.\"\n'State of Anarchy' features: Fast-paced run&gun action\nHillarious hand-drawn graphics and mouth-made sound effects\n10 weapons vs loads of enemies\nCharacter development system\n2 game modes: Normal and Hardcore","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lapovich","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10722,"name":"Forge of Gods (RPG)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e4/9e490f54d07f99a1d893de96468a44df.jpg","description":"Buzzhttp://store.steampowered.com/app/687890/Runaway_VR/\nNew DLC Availablehttp://store.steampowered.com/app/537325/Forge_of_Gods_Forge_of_Thrones_Pack/\nBuzzhttp://store.steampowered.com/app/575720\nBuzzhttp://store.steampowered.com/app/596650/\nAbout the Game GODS are not born, they are made by YOU! Join the action in this highly addictive multiplayer card strategy RPG “FORGE OF GODS”! Collect and train as many monsters as you can to assemble the greatest team and burst through hordes of enemies in thrilling, addictive and fast-paced game! Conjure powerful dragons, sturdy warriors and exotic beasts to fight for you in the land of Pangea! Are you ready for battle?\nKill enemies! Capture souls! Evolve them! FORGE army of GODS! Be THE BEST!\n\nUnique tactical battle system to test your strategic skills!\n1000+ creatures with unique skills!\nMix different types of creatures to breed legendary warriors!\n100+ locations with unique setting and style!\nGreat skill-based PVP duels with rankings, streaks and tournaments!\nActive guilds with upgrades, raids and guild wars!\nTons of quests and achievements to complete with good rewards!\nBuild beautiful castle to fit your desires!\nRush to FORGE your own GODS in this huge and dangerous fantasy world of Pangea!\nEnjoy spectacular new challenges every day you log on!\n\nAlso you can check our other NEW projects. Chibi-style fancy card collectable RPG Mighty Party and exciting VR-shooter Cargo Cult: Shoot'n'Loot VR.\nPanoramik Inc. has been making games since 2005. We specialize in creating different types of games, ranging from casual ones up to mid core.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Panoramik","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":370222,"name":"SIMULACRA 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/218/21821dc6b088af8f377e057d0233de97.jpg","description":"The follow-up to the critically acclaimed first game, SIMULACRA 2 expands on the found phone horror format with new inventive apps, a more complex narrative, a larger live-action cast, and a deeper look into a creepy alternate universe where nothing is as what it seems.\nA young social media influencer untimely – and unnatural – death is being ruled as an accident. But Detective Murilo suspects that something is amiss. He recruits your help in investigating the case, and hands you a crucial piece of evidence; the victim’s phone. You have to get to the truth by combing through the victim’s past on her phone and interrogating possible suspects in the present.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Kaigan Games OÜ","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":22395,"name":"Escape Machines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/662/662d172bbb2385b4a26c0daf904f0463.jpg","description":"Escape Machines is an addictive Science Fiction single/multi-player/co-op adventure shooter in the near future!\nArtificial intellect and robots fight against their creators. You must take control of the robots and save people.\nThe game is currently in early beta, some features may be unfinished.Features:Play with friends in co-op and VS multi-player.*Currently unavailable* Build robots and command them to win in battle. Upgrade your weapons and armour. Battle huge robot bosses. Use vehicles to travel, add turrets to your vehicles. Customize your armour, weapons and stats. Buy/upgrade equipment in the 'Armourer shop' Level editor - create levels, share and play them with friends. Original soundtrack/SFX ~ bit-music mixed with progressive trance and electro-funk.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mint Age Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19416,"name":"X: Beyond the Frontier","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/978/978794de47444270319d84fb35be06c3.jpg","description":"The Human Race had advanced to the point where we could travel among the stars, we developed giant automated machines to help us colonise other worlds, but there was a fault in their programming and they turned and attacked. Forcing us to lay a trap to protect Earth and exiling the Human race to stay on Earth once again.\n500 Years later Kyle Brennan starts his journey by piloting an experimental ship equipped with a new piece of technology allowing it to cross vast distances on its own. However it malfunctions and traps him in a group of sectors inhabited by Aliens, hunted and with no way home, this is his story of survival... Beyond the Frontier...\n\nX: Beyond The Frontier is the first part in the X-Universe series of games developed by Egosoft.\nIt tells the story of mankind's rise and fall in the universe, and the attempt by Kyle Brennan to help repopulate the stars using a new ship called the Experimental Shuttle, and how he became trapped in a closed group of sectors linked by a series of jumpgates, owing credits to an alien for helping to save him, and hunted by several people. Unknowingly, a group of secret service people are after him, a group who have tried to hide their races secret, that they are the descendants of a group of Humans who saved earth from the Terraformer fleet they created to help colonise the universe.\nNow with the Truth coming out, X: Beyond the Frontier allows the player to play as Kyle Brennan on his hunt to find a way home, whilst helping a group of people find the truth about their ancestry, and continue to help save earth from the Terraformers who are now known as the Xenon.\nFeatures\t\t\t\t\tTrade - Trade in over 50 sectors, with over 50 different goods, upgrade you ships with dozens of upgrades available to you by 5 different races.\nFight - Find the location of the hostile pirates and survive against attacks by the Xenon.\nBuild - Construct stations to build your own production empire.\nThink - Adapt your trading empire to suit the needs of each sectors local economy.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Egosoft","platforms":[{"id":0,"name":"PC"}]},{"id":15724,"name":"Oniken: Unstoppable Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0a/e0a59a4ead52c705e23c3b3f69a533d1.jpg","description":"When a global war nearly decimated humankind, an evil military organization called Oniken takes advantage of the situation to dominate and oppress the few remaining survivors. Even though any resistance to this organization seemed hopeless, a small rebel movement organizes strikes against Oniken. One day, a ninja mercenary named Zaku offers his services to the resistance for unknown reasons. His moves are lethal and now he is the resistance's only hope.\nOniken is an action platform game highly inspired by the 1980's, its games and its movies. You can see this not only in the graphics and sound design, but also in Oniken's story and difficulty.\nDon't Worry, You Will Die A Lot Of Times.\nEvery copy of Oniken comes with digital versions of the game manual and the original soundtrack.Features\nGraphics, sounds and difficulty from the 8-bit era\nCinematic cutscenes\nOver 18 boss fights\nSix missions, three stages each\nAn extra mission after you beat the game\nBoss rush mode\nNot difficult enough? Try the new HARDCORE MODE\nGlobal Leaderboards\nFull pixelated violence","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"JoyMasher","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":14896,"name":"Asteroid Bounty Hunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e8/6e8037acf5b9eca0063371a0463f08e8.jpg","description":"Ready to take the wheel old geezer?\nAsteroid Bounty Hunter is a space shooter, with a lot more in store than simply blowing up asteroids. The story follows our hero John, who is a veteran, trying to do amends in his screw up life and he only has his space ship AI, who still cares about him. The story latter unfolds some pretty interesting things about John, his life and his relationship with stuff around him.\nThe game itself is based on a dodging/blowing up stuff, but that quickly falls in background picture, since you have to outmaneuver the enemy, who are constantly changing. Your job is to save planets from incoming asteroids, while taking care of your affairs with other bounty hunters.\nunique boss fights with different difficulty levels\ndefend the nearby planets from vicious asteroids attacks\nbattle other bounty hunters\nThe concept of the game is to farm experience, so you can unlock new upgrades. You can collect mastery points from other bounty hunter ships to unlock new ships. If you find yourself unable to progress the game, you can always come back to earlier levels and farm experience, which you can use to make limitless upgrades for you ship. Each new level brings a quest with an unique one time ship upgrade, so use it wisely.\nover 100 different size and texture asteroids, flying towards the planets\n5 different types of bounty hunters, exchanging whole game trying to kill you\n5 different bosses, each having completely unique mechanic\nYour ship 4 unique abilities\nBasic attack - limited to 3 energy particles on screen\nPhoton swarm - more powerful - giant balls of energy spinning and crushing everything ahead, it has 3 charges stored on ship\nDeath ray - laser cutting asteroids like it's a knife going through butter, it has significantly larger cool down, so use it wisely\nFinal blast - ultimate attack - sends a missile with a shape of a phoenix to the center of the screen and blowing everything hostile in 360' area. The cool down is 60 seconds, so in a way you're limited to 1-2 use per level.\nThere is two types of upgrades. You can make global upgrades in shipyard or ability upgrade in upgrade center.\nGLOBAL UPGRADES\nThere is limitless ship upgrade points, which you can spend on:\nglobal shield durability\nglobal abilities cool down\nglobal damage increase\nPlayer get upgrade point for each level up. To level up you need to get specified amount of experience by destroying hostile ships or asteroids. When we say limitless, we think limitless... there is no player level cap.\nThose upgrades applies to all ships in shipyard no mater which is selected.\nABILITIES UPGRADES\nThere is 6 different upgrades, each counting 20 points to spend.\nShield durability (max shield value)\nShield regeneration rate\nBasic attack damage upgrade\nPhoton swarm damage upgrade\nDeath ray damage upgrade\nFinal blast damage upgrade\nThere is 5 different ships in shipyard each having an unique passive bonus. Those bonuses are added to global and abilities upgrades. If you manage to unlock the special ship, you'll get all the bonuses.\nNo bonus\nShield durability bonus %\nCool down bonus %\nDamage bonus %\nShield, CD and damage bonus %\namazing space graphics and ambient\nhigh resolution planets and stars\nadvanced GUI with customizable preferences which include controls (controller support), graphics and audio","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":7849,"name":"Merchants of Kaidan","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/045/04591a8f99662aa1336d41e6c3c819ad.jpeg","description":"Special OfferBuy Merchants of Kaidan on Steam and get the soundtrack from the game for free!!!\nEarly Beta Access\nAbout the GameRegain your riches, restore your honor and punish those who have wronged you.\nMerchants of Kaidan is a challenging trading game fused with lots of RPG elements. You start very humble, one cart, a purse of gold and silver coins is all that you have. Your task is to roam the world and search of opportunities to score some profit. Buy low, sell high -  a merchant's motto is easy to grasp. And yet the job is harder than it seems.\nA good merchant needs to know everything about the market, he is always on the lookout for a deal, always listening, always engaging and deepening his knowledge. He knows what forces influence the prices, what events affect them. A good merchant listens to rumours and gossips spread by travelers at inns and taverns; hoping for a clue, a hint where to go, where a good deal awaits. A good merchant surrounds himself with specialists smarter than him, people who help him maximize profits and minimize losses. He always expands his fleet of carts, he balances risks, calculates profitability.\nThe conditions are constantly changing, and supply and demand for different goods with them. Maybe you'd like to pay a cheaper price for furs in the summer, and sell them for a hefty profit as the winter is coming and people need warmth.\nBut is it worth carrying them for so many days, risking robbery, moths and taking precious space that you could use to transport something now and make a profit immediately?\nOr is it worth to buy illegal herb in the out of reach swamps where it cost's next to nothing, and risk smuggling it into the city where you can sell it for an amazing profit? But what if the city guards want to control you? Should you pay a bribe? How big? Maybe the best course of action is to  say that you have nothing and hope they don't find anything?\nThese are the types of questions you will have to ask yourself constantly.\nMerchants of Kaidan has 4 story lines each with many quests. Main quest that brings you closer to avenging your father's murder, and 3 side-quest lines. A total of over 100 quests each composed of multiple steps.\nA set of random events that influence your journeys. A storm on the sea, attack by dragons, highway robbery and many, many more.\nThree types of transport of your goods: by roads, by sea and by flight, each has its advantages and disadvantages and a unique set of events associated. As you grow your fleet you can join a partnership and you'll get to manage 3 traders.\nYou can hire advisers each specializing in a different field. Their council will help you in a variety of issues. Some will show you shortcuts on the roads, some will help you fight of the bandits, some will council you on how to sail better and in case of a storm, how to minimize risks and losses. If you wish, you can also send them to school to improve their abilities for additional cost.\n4 seasons of the year that influence the prices of goods, open some paths for travel and block the others. They also impact the way the game looks, each city has a distinct look at different time of the year.\nRandom blessings and curses that influence your statistics. They in turn affect how well you conduct business.\nA set of artifacts that influence your statistics or can help negate the effects of random events.\nA complex market fluctuation algorithm that include many variables such as: demand, supply, seasons of the year, localization of the city, random events like droughts or rat infestation.\nA complex trading algorithm\nOver 100 quests each with multiple steps to success.\n2 out of 10 planned mini games that accompany events with next ones upcoming in the updates\nPossibility to create a partnership with other traders and control 3 characters simultaneously\n1 main and 2 quick scenarios\n15 types of goods for trade with varying characteristics, some illegal, some perishable\nBeautiful hand-drawn localisations.\nYour name is Olivean de Calinn, and this was supposed to be the most important day of your life. Your father has been preparing you, for all these years, for this exact moment. Your 21st birthday.\nYou were finally a grown-up, able to take care of yourself, a person worthy of continuing your fathers' legacy.\nHe wasn't born into money. To buy his first cart, he had to work very hard saving every silver and copper. One trade after trade, step after step, he climbed the ladder, transforming his tiny one-man venture into a trading company of a rather significant size.\nThen he met Van Talodd, the most famous merchant in the whole kingdom, and soon enough he entered into partnership. This enterprise proved very profitable, and Van Talodd promised your father something more precious than wealth. A lordship. Few weeks ago he left to the Capital – Ovoros – to accept the title. He was taking a little longer to come back than you expected, but recent weather was unfavourable, maybe he got stuck, or a road turned into a swamp... it happened all the time.\nIt was almost dusk when you heard the knocking to the door. A messenger, his clothes soiled with mud, brought you a letter. There was no lordship, your father was found a traitor, an enemy of the Kingdom, and hanged for conspiring against the king, after a very hasty trial. All his assets and estate confiscated and handed over to the person who exposed the entire plot – Van Talodd.\nSuddenly everything became crystal clear, Van Talodd maimed him with promises of lordship, the only thing money can't buy. But his real purpose was to entrap your father and take over his fortune.\nInstead of your birthday present, you got carts full of kings' sell-swords approaching quickly. There was no time to loose, you had to run fast and far. Flee from the men that were certainly sent to kill you.\nThat is only a beginning of your story, you're left with only your family ring that you had on you.  Take a fake name you need to avenge your father. Follow the same path as him, grow rich and destroy Van Talodd. The road there is hard and long – are you strong enough to make it?\nKaidan is a fictitious world, that was once a home to a space-faring civilization. It's history is almost unknown. Only that, once they developed starships, they relatively quickly left the planet. And on the remnants of the old civilization a new one has sprouted. A far less developed. If not for the artifacts left by the predecessors, they would be no different than a medieval country.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":16189,"name":"Odallus: The Dark Call","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d6/6d6bf444019a088c0ebf6f0a10a31b2e.jpg","description":"The old gods have forgotten this land. No one could save our people when darkness started spreading and collecting human souls for its army.\nOdallus is a classic exploration/action game, inspired by Ghosts’n Goblins, Demon’s Crest and Castlevania. Player takes place of Haggis, a warrior tired of fight who must wield his sword once more to rescue his son from Darkness.\nOriginal Sound Track: http://serenati.bandcamp.com/releases\nFeatures\nEight levels open to exploration\nHuge bosses\nSharp controls\nRad 8-bit graphics\nThrilling atmosphere\n8+ hours of gameplay\n50+ types of enemies\nVeteran Mode","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JoyMasher","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]}]