[{"id":6419,"name":"Strata","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc1/dc102e75fd2c6b34012a3ade60208b60.jpeg","description":"A truly unique puzzle experience that embraces simplicity, elegance, and challenge. Strata paints a simple yet challenging puzzle game onto a sophisticated canvas of color and sound. Test the limits of your brain by completing complex weaves of color to solve the puzzles.\nThe goal of Strata is to strategically layer colored ribbons to match a pattern. Using forethought and strategy you must sequence your moves correctly. Over time patterns emerge and your tactics may evolve, but Strata will keep you on your toes with increasingly difficult puzzles.\nSpecial thanks to those who supported Strata on Greenlight!Key FeaturesHundreds of increasingly bigger and more challenging puzzles.\nOption to Perfect each grid by completing it without pulling a ribbon back.\nA simple, yet addicting game for any age.\nBeautifully recorded sounds accompany your actions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Graveck","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":982,"name":"The Tomorrow Children","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/060/06007b47a26a438c584857444b0a3456.jpg","description":"Answer the call of the Motherland and unite in defense of humanity in The Tomorrow Children - a unique combination action, simulation, strategy and social gaming.\nThis is a Free-to-play edition of The Tomorrow Children. Please note that in-game purchases are optional.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n©2015 Sony Interactive Entertainment Inc. The Tomorrow Children is a trademark of Sony Interactive Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SIE Japan Studio","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":824,"name":"VirZOOM Arcade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a63/a634bdd68d5bdb4e9bb26272a6f6e618.jpg","description":"VIRZOOM VR GAMING SYSTEM\nVirtual Reality Sports\n“Play VR. Get Fit.”  That’s what VirZOOM does.  We make virtual reality games for an active motion controller where your pedaling and leaning propel you through race tracks, battlegrounds, soaring skies, and pictorial countrysides in the forms of an F1 pilot, a tank commander, a Pegasus, a cyclist, and more.\nOther online players automatically drop in and drop out of your games to provide competition and cooperation in matches up to 8 players.  Make friends and challenge them to ghost competitions over a period of time, winner take all!  Or choose your own workout and goals, collecting coins along the way to upgrade your avatars.\nOutside the game you can manage your challenges, tune your workouts, and track your stats on MyVirZOOM and link them to Fitbit and Strava.\nVirZOOM Arcade Games\n“VirZOOM Arcade” is our free collection of sport arcade games, available on Steam and the PlayStation Store, and always being updated with new features and games delivered automatically to you.\nOur game controls and physics provide maximum VR comfort to play in large virtual worlds.  No teleporting—your virtual movement reflects your actual movement.  And though the games are designed for our bike controller for sport and exercise, you can also play them for free with a regular controller.  More players means more fun for everyone, step up to a bike when you’re ready!\nBeyond our games, use the Gamepad Emulator (only available on PC) to turn your bike into a virtual joystick, keyboard, and mouse to play popular games.  Configure your own mappings or use the ones we’ve made for Project Cars, EVE Valkyrie, and Radial-G.  If you’re a developer, from homebrew to AAA, add VirZOOM bike and motion controls to your games for free with our Unity SDK.\nThe VirZOOM Bike\nActively experience virtual reality with the VirZOOM Bike Controller, priced and sized for home use by the whole family.  Now try it with a 30-day money-back guarantee.\nIntegrated sensors in the bike track your pedaling speed forward and backward. Not just cadence but the responsiveness you require for high performance gaming.  Triggers and buttons are built into the grips to take air, get bursts of speed, and blast away obstacles.  Lean on the bike to steer naturally using your VR system’s position tracking—our extra wide base keeps you planted!\nChoose the pedaling resistance that suits you to increase your score or speed or difficulty in our games. Heartrate sensors in the grips determine the calories you burn on every ride.\nThe bike operates silently to be able to hear your games, and folds up easily to move in and out of your play area.  2 AA batteries power it for months to communicate wirelessly to your VR system without cords.\nVR System Not Included\nYou must have your own VR system to play VirZOOM, but luckily it is compatible with all major systems having position tracking:\nOculus Rift (with acceptable PC)\nHTC Vive (with acceptable PC)\nPlayStation VR (with PS4)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"VirZOOM","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":613493,"name":"Metro Exodus: Enhanced Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/389/389a26a01446af026608697fff70b675.jpg","description":"The year is 2036.\n\nA quarter-century after nuclear war devastated the earth, a few thousand survivors still cling to existence beneath the ruins of Moscow, in the tunnels of the Metro.\n\nThey have struggled against the poisoned elements, fought mutated beasts and paranormal horrors, and suffered the flames of civil war.\n\nBut now, as Artyom, you must flee the Metro and lead a band of Spartan Rangers on an incredible, continent-spanning journey across post-apocalyptic Russia in search of a new life in the East.\n\nMetro Exodus is an epic, story-driven first person shooter from 4A Games that blends deadly combat and stealth with exploration and survival horror in one of the most immersive game worlds ever created.\n\nExplore the Russian wilderness across vast, non-linear levels and follow a thrilling story-line that spans an entire year through spring, summer and autumn to the depths of nuclear winter.\n\nInspired by the novels of Dmitry Glukhovsky, Metro Exodus continues Artyom’s story in the greatest Metro adventure yet.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"4A Games","platforms":[{"id":0,"name":"PC"}]},{"id":380836,"name":"When The Past Was Around","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/44b/44bcdd0bc6073f706d17c98ac0b4b896.jpg","description":"From the creators of \"A Raven Monologue\" and \"She & The Light Bearer\".\nWhen the Past Was Around tells a bittersweet tale between a girl and a beast, and a journey of overcoming the past.\nVenture through a surreal yet familiar world consisting of disjointed rooms from memories and time.\nWith each clue gathered, puzzles solved, and doors unlocked, the girl will find her way, unraveling the secrets between her and the beast, the secrets which she used to know.FeaturesA curious girl & a mysterious owl boyfriend.\nPersonal and ubiquitous. It's a game about overcoming the past and finding the self.\nVarious puzzles to solve and many mysteries to uncover in everyday familiar objects and activities.\nA sweet and whimsical journey set in a series of hand-drawn, down-to-earth settings.\nViolin music.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mojiken","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":349437,"name":"Founders' Fortune","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/901/901ce469000310e5d06f197e32da392b.jpg","description":"Build Your Colony\r\nWhen your colonists arrive, they have nothing but the clothes on their backs. You take control and tell them to gather materials and build walls, floors and furniture.\r\nYou are not limited to predefined buildings! Design your own houses and style them to your liking. There are dozens of construction and furniture elements that you can use to create the settlement you’ve always dreamed of!\r\nTake Care Of Your Colonists\r\nThe colonists are your top priority. At first, you simply need to provide them with food and shelter. But the world is full of dangers! An infection might prove fatal to the strongest warrior and a plague can wipe out your entire colony.\r\nEach colonist reacts to events, happy or sad, and reflects that in their behavior. Happy colonists will receive a boost to their productivity – Unhappy colonists might throw a temper tantrum.\r\nDeal With Tantrums\r\nIn an ideal life, all your wishes come true, at least that’s what Toni thinks. Fulfilled wishes can promote good moods, while hunger, injuries, boring conversations, or even nightmares will make your citizens feel bad.\r\nIf you ignore the needs and wishes of your colonists for too long, one of them might have a breakdown and throw a trantrum.\r\nAt That Point, All Bets Are Off…\r\nSet up your FarmFood matters. Good food makes colonists happy, wrong food makes colonists sick, little food makes colonists slow, and no food makes colonists die.\r\nGrow a variety of seasonal crops and set up a kitchen to make delicious meals. Be sure to stock up before winter hits and act quick when a swarm of hungry bugs descends upon your fields!\r\nSurvive WinterUse the time you have and make sure you have enough food stored away, for winter is coming. Let’s hope you won’t have to halve rations – because that will make your colonists weak.\r\nWhen supplies dwindle and the freezing cold wind howls outside, it’s easy to lose hope.\r\nTrade Goods and Get RichWord got around that your colony has started producing wares. Greet traveling traders and see if you can get a good deal on some ancient scrolls or buy additional food to prepare for winter.\r\nTry to keep production up so you’ll always have something to sell. A mature colony needs to pay good salaries to keep everyone happy. If morale is low, additional funds can even buy a tiny bit of happiness!\r\nResearch TechnologiesBuilding your home is a long process and resources and manpower are not the only things you need. Smart Settlers dedicate a lot of time to researching new technologies, thereby unlocking better equipment, new furniture and construction elements.\r\nSelect scholars carefully – if their personality doesn’t fit this type of work, they are not going to make a lot of progress.\r\nProtect Your OutpostYou are not alone in this new land you call ‘home’. The Tikigoblins living there are not all that happy about your settling efforts and might pay you a visit to try to get you to stop.\r\nTrain your colonists in the art of warfare and equip them with the best weapons and armor you have. Build walls and towers to ensure the security of your colony – that way, your enemies will have a difficult time trying to mess with you!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Oachkatzlschwoaf Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":283970,"name":"Final Fantasy X-2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/336/3369c92ff7d489437dc7d337576db9ac.jpg","description":"A role-playing video game developed and published by Square for the PlayStation 2, as the direct sequel to Final Fantasy X. The game's story follows the character Yuna from Final Fantasy X as she seeks to resolve political conflicts in the fictional world of Spira before they lead to war and to search for her lost love Tidus from Final Fantasy X.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Square","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":281889,"name":"Fear & Hunger","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40f/40ffb9b3224a89f17cb398b79468a9d3.jpg","description":"Fear & Hunger is a horror dungeon crawler set in the dark and hopeless dungeons of fear and hunger. Four misfortuned adventurers dwell deeper and deeper to the darkness and uncover the secrets this ancient fortress holds inside. The fortress works as an ancient nexus for different planes of existence. The depths are in an eternal turmoil as both old and new gods struggle for power, it’s up to the players to choose their position and stance in all of this.\nThe game is a hybrid of survival horror and dungeon crawler genres with its influences ranging from Silent Hill to Nethack. There are roguelike elements to the game as well as a heavy foundation of a j-RPG. Fear & Hunger is heavy on atmosphere and ruthless in its difficulty.\nOppressive and relentless atmosphere\n4 different character classes and many additional characters to recruit\nUnforgiving and unique gameplay\nRandomized elements to keep the game fresh with subsequent playthroughs\nTurn-based Strategic Dismember Combat System\nGraphical art style mixing pixel art with digital painting\nOriginal ambient soundtrack creating the dreary mood\nThe world of Fear & Hunger is VERY dark. THE GAME IS MEANT ONLY FOR MATURE AUDIENCES! Extreme violence and gore are everyday sights in the dungeons and death is one of the easier ways to go in the game. The game has drug and substance abuse, heavy themes ranging from self-mutilation to sexual violence. None of the themes are taken lightly however. They are all part of the world building and there to create the unique atmosphere where the game measures just how far the player is willing to go in order to survive.\nParts of the dungeon layout, events, loot and enemy placements are randomized with few different variations to keep things fresh with subsequent playthroughs. The game is designed with the classic trial and error formula, so you can expect to start the game over and over again. But as long as you learn from your mistakes, you can quickly find yourself at the deeper levels of the dungeon.\nThe combat in Fear & Hunger is turn-based akin to classic role-playing games, but with a twist of it’s own. You can target individual limbs of your enemies to dismember them strategically and thus maximize your chances for survival. However, just the same, enemies can also cut off the arms and the legs of your playable characters if you are not careful. You need to prepare well for every encounter if you wish to stay alive. But don’t forget that running away from threats is often the best solution as well. There are many ways for survival in Fear & Hunger - You can find better equipment, learn different blood and love magic, fuse characters into each other, pray different gods, talk your way out of battles, meet new party members, snipe enemies from distance, use traps to disable them… and so on. The Idea is to use what you got at your disposal and be creative with it.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Miro Haverinen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":255831,"name":"Hentai Girl Betty","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f24/f240fdf87b770fd6fafd9682255895ca.jpg","description":"IntroductionHentai Girl Betty is a puzzle game,you only need to swap the bricks to restore the pictures.\nThe game support cheating mode and browsing pictures with one hand  that you can unlock all pictures in just one minute ,\nThere is no time or star limit in the game, you are supposed to enjoy the relaxing experience.CharacteristicsArt PicturesCheat Mode (F)The gallery can be operated with one hand100 achievements worthy of being collectible","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"GirlGame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60997,"name":"Lucius III","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1f/d1f2fe2436cf30125c69238cb7803325.jpg","description":"ABOUTLucius  is back. This time he returns to his old neighborhood of Winter Hill. Through trials and tribulations we will finally see where the road takes him.\nIt's a difficult one. For the first time, his choices come to question.\nIs it finally time to end it all?Features:Experience an In-depth and carefully crafted story, which takes the player through a wide range of emotional experiences.\nFeel the full experience of playing the villain protagonist.\nExperience the atmospheric and detailed environments.\nUse powerful magical abilities to help your cause.\nOver 20 tracks of original music that compliments to the atmosphere of the game.\nInvestigate the past and secrets of Winter Hill and its inhabitants","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Shiver Games","platforms":[{"id":0,"name":"PC"}]},{"id":29413,"name":"Grim Fandango","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a07/a07491535ca7c6e175c9c22299c786d6.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":28569,"name":"DD: Dark Arisen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/06e/06ed75c61e7d7340459b67da2ec9cb1c.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish,  Japanese.  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  An epitaph speaks of another's demise...  A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen; their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to be discovered.  The time to take up arms has come once again. Delve into the isle's depths and uncover its dark secret!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":21974,"name":"The Legend of Heroes: Trails in the Sky the 3rd","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f4/6f45b18aeb809bf4286f44df1b460432.jpg","description":"Half a year after the events of Trails in the Sky Second Chapter, Liberl has settled into peace once again—but even during peaceful times, there are many among the distinguished and fortunate burning with greed thanks to the influence of ancient artifacts. Most of the population remains unaware of their abuses of power, but to the most enigmatic order of the beloved Septian Church, the Gralsritter, snuffing out these would-be villains and claiming artifacts in their name is as everyday as professing one’s faith in the Goddess.\n\nOn the eve of another successfully completed mission, high-ranking member Father Kevin Graham is immediately assigned to retrieve one more artifact that rests beneath Grancel Cathedral. What’s more, even though this is a task he could easily complete on his own, he must reluctantly do so in partnership with his newest recruit, rookie Gralsritter and childhood friend Sister Ries Argent.\n\nThus begins the start of a routine mission that becomes anything but, delving into a new and mysterious realm that follows an unnaturally strict set of rules: Phantasma. Therein, the history of the Septian Church and the pasts of the many familiar faces who took up arms for the sake of Liberl’s future will be laid bare…and some may have been better off staying forever sealed behind closed doors.\nA More Personal AdventureTrails in the Sky has become a fan favorite for thoughtfully written characters down to its NPCs, and for its final installment further focuses on fleshing out its playable cast via Moon and Star doors found as the story progresses.\nFamiliar Tactics, Brutal CombatWidely considered the most challenging title in the series, players are encouraged to iterate upon the combat style they’ve come to know in the 3rd’s predecessors by either enjoying its in-depth story on Easy or crying with frustration on its unforgiving Nightmare difficulty.\nOne More from Falcom Sound Team jdkNihon Falcom is known for its brilliant music, and the Trails series has never been an exception, with the 3rd adding dozens of new tracks to keep players engaged as they journey through Phantasma.\nEven More OlivierAs if two Sky games was enough Olivier.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PC"}]},{"id":19788,"name":"Elven Legacy: Siege","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4c/f4cab6ba12a5f7c5c358e99a5de89f20.jpg","description":"Several months have passed since the return of the Order of Marcus from exile to the continent and their founding of the kingdom of New Tixus in this, the second official Expansion to the epic Fantasy Strategy game Elven Legacy.\nOutcast elves under the leadership of the elven lord Saggitel, have once more acted provocatively and dared to cross in to the realm of man, but the human armies are ready and waiting. Inciting the wrath of brother Karel, the fearsome knight of the Holy Inquisition, along with the agent of New Tixus, the ranger Cornelius, Saggitel is now their target of retribution. How far can Saggitel run before they catch up to him?\n\nEach of the heroes, whatever their individual cause, has a mighty army behind them. In the course of their adventures, each will have to stand in battle and withstand mighty sieges in their quest for survival and victory. The ancient impregnable fortresses of the dwarves, the enchanted cities of the elves, and the historic capital cities of Eolia, each will see their share of bloodshed, and each will become sites of conflicts which will go down in the annals of history.\n\nKey features:\n19 new campaign missions\nThe outcome of mission quests will directly impact subsequent missions\nTwo different armies and Three new heroes (Sir Karel, Inquisitor Morcius, Captain Adrian)\nBonus mission (becomes available after Gold ranked victories)\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C:InoCo","platforms":[{"id":0,"name":"PC"}]},{"id":19556,"name":"Driftmoon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/792/79255bbd83bd19fe55d93392805012fd.jpg","description":"The beautiful, enchanted world of Driftmoon trembles in the shadow of a forgotten evil, for the dark King Ixal is again gathering his forces.\nHope lies in an unlikely alliance: A young man joins forces with a little firefly dreaming of stardom, a panther queen with the ego of a moon whale, and a very determined fellow who's lost everything but his bones, and still hasn't given up. Knowing nothing of the amazing adventures and the fearsome foes that await them, the party embarks on a journey like no other.\nDriftmoon is an adventure-roleplaying game, full of exploration, smiles and surprises, captivating stories and quests, charming characters, and countless delightful details.\nA fantastic adventure, and a deep story that will put a smile on your face, and keep surprising you!\nPlenty of personality, wit, humor and goodwill!\nThe rich, magical world is filled with captivating personalities, and zillions of things waiting to be discovered!\nPowerful editor and one-click mod sharing system.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Instant Kingdom","platforms":[{"id":0,"name":"PC"}]},{"id":18068,"name":"Liveza: Death of the Earth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/808/808c31b31f2573e374749cd63720b879.jpg","description":"Liveza: Death of the Earth – a classic platformer.\nA global catastrophe has literally torn our planet apart, breaking Earth into many pieces. You are the survivor that explores the remains of our planet and investigates the anomalies that have settled upon it. You start out with only a single item: a broken weapon that also functions as a flashlight. Along the way, as you fight off dangerous creatures, you will find useful tools that will help you jump great distances, slow down the passage of time, or even find hidden objects that you otherwise cannot see.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pinkerator","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17781,"name":"Bombing Bastards","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9f/b9f3efa204ee8c40d3079343d3aa260c.jpg","description":"Game Modes\nSingle-player adventure: help the witty Dr. Wallow get rid of all the critters and become the ruler of the galaxy!\nLocal battle for 1 to 5 players using game controllers.\nOnline battle: LAN or WAN, with up to 8 players per room.\nFeatures\n5 picturesque worlds with 30 wicked mazes.\nA large bestiary of critters to blast.\nA multitude of items and power ups to collect.\n5 hellish boss levels whose punishing difficulty will only be matched by the satisfaction you’ll get once you beat them.\nOver 10 minutes of caustic comments from Dr. Wallow, voiced by David Goldfarb (the voice behind multiple characters in Mario Kart 8).\n7 famous pieces of classical music electronically butchered by Samuel Safa.\nControllable with the keyboard + mouse or with a game controller.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sanuk Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"}]},{"id":17723,"name":"Impire","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5b/c5b78b07b117f26e1d0b27164800bb81.jpg","description":"Deep in the underworld of Ardania, a threat of the most evil nature grows and multiplies with an appetite for destruction that is unsurpassed. Summoned from the depths of the Bottomless Pit, the (once) mighty Báal-Abaddon has been torn from his throne of skulls and imprisoned in an earthly body of less-than-imposing stature (he's an Imp, OK?) to serve the none-too-competent sorcerer Oscar van Fairweather. But unfortunately for Fairweather, the luck of the damned is on Báal's side and he soon breaks free to build his own dark and majestic... Impire.\nTake control the of demon Báal-Abaddon as he attempts to rebuild his mighty hell spawn form. With the aid of dozens of evil creatures big and small as well as an arsenal of spells, you will help him construct a dungeon underworld of limitless evil and nastiness to stop all those pesky Heroes of Ardania from ruining his return to greatness!Key Features\nIncarnate a demon of the abyss; make him evolve into a powerful dungeon lord and customize him through weapon and armor upgrades\nDig your own dungeon, build different room types, and craft wicked traps to stop your enemies\nBeat up the heroes who attempt to thwart your plans, or even better, crush their souls and use them as resources to build up your dungeon\nRecruit a vast array of creatures, level them up, and upgrade their equipment\nTerrorize the surface of Ardania by raiding different locations, collecting treasures and riches along the way\nUnlock unique magical item cards and mix and match them to build a deck that suits your playing style\nPlay the campaign in solo or in coop mode; or confront friends in different multiplayer game modes","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cyanide Montreal","platforms":[{"id":0,"name":"PC"}]},{"id":17077,"name":"Pirates of the Caribbean: At World's End","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12d/12d3ba30934f0260095cf4a8a301ec2f.jpg","description":"Pirates of the Caribbean: At World's End invites players into the world of the films - and beyond. Live and die by the sword while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. Help the three unlikely allies as they unite with the villain Barbarossa from the first film. Together, they'll work with pirates and fend off a massive attack from the British Navy at the mysterious whirlpool called World's End. Players must demonstrate their cunning, swashbuckling creativity and swordsmanship as they encounter all manner of crazed pirates and cursed creatures in treacherous, exotic locations. Enjoy sword-assisted acrobatics, adaptive combat and classical dueling in unique gameplay. Unlock new moves, secret characters, inventory items, weapons and secret locations.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Wii"}]},{"id":10506,"name":"Crash Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b93/b93c47bdc06b240b4626dc520e5a5eda.jpg","description":"Crash Force is an online multiplayer, arena, shooting game at its core with RPG and racing elements.\nCrash Force is a mixture of Quake, Unreal Tournament, Twisted Metal and Rocket League in an explosive, fast-paced and competitive sci-fi alternative universe where hovercraft families rule the universe.Crash Force features:\nOnline Multiplayer Arena Shooter.\nBuilt in Unreal Engine 4.\nTarget platform PC and Xbox One, works well with a controller.\nNine Hovercrafts to choose from three factions and three classes.\nEach hovercraft has four unique abilities.\nThree unique maps and three game modes.\nLevel cap at 90 (every 30 levels you gain an Aviation point) and Ranks.\nSkills Tree with three Aviation Points.\nCustomize your hovercraft with Insignias, Decals, Sprays, Bumpers and hovercraft Bodykits.\nBattle in 3v3, 4v4, 5v5 and 6v6, and one against all (6-12 players).","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ascanio Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":4273,"name":"Madden NFL 13","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9c/d9ce42bda291a0b5406ce7ad1fdaeaa6.jpg","description":"Madden NFL 13 is all-new from boot up to credits.  Every mode, every screen, every pixel has been reinvented delivering the most innovative, connected, and authentic Madden NFL experience in franchise history.\n©2012 Electronic Arts Inc. John Madden, NFL, and NFLPA are trademarks of their respective owners and used with permission. Calvin Johnson Jr. is an official endorser of Madden NFL 13.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"}]},{"id":4211,"name":"NBA 2K13","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/26b/26bc92914d5aacbc401b1dc82de6249f.jpg","description":"With more than 5 million copies sold worldwide and more than 25 Sports Game of the Year awards won, NBA 2K12 was another monster release for the biggest NBA video game simulation franchise in the world. This year, 2K Sports has joined forces with the legendary JAY Z as Executive Producer to transcend sports video games and take virtual hardwood to the next level. Featuring an enhanced MyCAREER mode and all-new gameplay features, NBA 2K13 will let gamers pit the best players in NBA history against the new dynasty of talent, including the much-debated matchup between the 2012 U.S. Men’s National Team and the 1992 “Dream Team.”\n1-7 players\n4MB minimum save size\nSIXAXIS® Motion Sensitive\nHDTV screen resolution: 720p, 1080i, 1080p\nNetwork Players 2-10\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account. No more than one activated PS3 system within a 24 hour period. Content may not be used by any other account. You must sign in to PSN each time you start the game.\n© 2005-2012 Take-Two Interactive Software and its subsidiaries. All rights reserved. 2K Sports, the 2K Sports logo, and Take-Two Interactive Software are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. The NBA and individual NBA member team identifications used on or in this product are trademarks, copyrights designs and other forms of intellectual property of NBA Properties, Inc. and the respective NBA member teams and may not be used, in whole or in part, without the prior written consent of NBA Properties, Inc. © 2012 NBA Properties, Inc. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"2K","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":2983,"name":"Dark Cloud","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d60/d60d7383caca168941a1ff3feb3c9564.jpg","description":"Experience Dark Cloud™ for PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita or PS App.\nTwo great continents, one an advanced civilization driven by progress and technology the other, where nature is the center of all existence and everyone lives harmoniously side by side.  Two cultures that have never had contact with each other…until now.\nAn ancient evil has been unleashed.\nJourney on a quest through time to unravel the mysterious tale of the Dark Cloud.\nInnovative new gameplay, GEORAMA.\nBuild it—build a customized world. Play it—interact with the world in real-time. Live it—build the worlds and unveil clues and pieces of the storyline.\nSix playable team members each with their own unique abilities, weapons, skills and strengths.\nDetailed weapon system allows you to change and increase your weapons strength and damage.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\n© 2001 Sony Computer Entertainment Inc. Dark Cloud is a trademark of Sony Computer Entertainment Inc.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\n© 2001 Sony Computer Entertainment Inc. Dark Cloud is a trademark of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Level 5","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":960332,"name":"Showgunners","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b17/b17b95aa6c247b60b8790120c0ccc1e9.jpg","description":"In a dystopian future where corporations rule, a brutal reality show is the hottest entertainment property in town! You play as Scarlett Martillo, a contestant out for revenge. To win, you must navigate dangerous urban arenas packed with lethal traps and face off against hordes of heavily-armed psychopaths.\nEach stage in Showgunners has been hand-crafted to create a curated, turn-based tactical gameplay experience, heightened with the inclusion of a diabolical show director that can hinder Scarlett or help her opponents depending on your performance. This dynamic level design ensures that no two levels play the same way and keep players thinking tactically. Showgunners has been built to challenge and delight players, whether they’re a turn-based tactical game initiate or a long-time fan of the genre!\nScarlett won’t be fighting alone. As the story progresses, players will recruit new partners that can turn the tide of battle in all kinds of exciting ways. Upgrade your characters by spending talent points in their unique skill trees and outfitting them with weapons bought at a shop or earned during battle. Hidden challenges within each chapter can unlock more allies, legendary weapons, and helpful items, so be sure to keep an eye out!\nPlayers will need to navigate an obstacle course of deadly traps and lethal puzzles in real-time, but be prepared for an ambush at any corner. Psychopathic enemies like the Ogre and the Ronin aren’t the only deadly elements you’ll need to overcome. Combat scenarios are peppered with unique environmental hazards, from ticking time bombs to runaway trains. There is never a dull moment in Showgunners!\nGain fame by avoiding death, surviving rounds, and eliminating your enemies with gruesome panache. The more you succeed, the more fans you earn; your growing fame will yield increasingly beneficial sponsorship deals.\nStreamers, rejoice! Use the native Twitch integration to keep audiences engaged by letting them control the direction of each level. They can add more enemies, change the terrain, add or remove obstacles, or send useful items, all from chat.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Artificer","platforms":[{"id":0,"name":"PC"}]},{"id":615052,"name":"NINJA GAIDEN Σ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a06/a065ae982b71eaaac5ea3f27d549100e.jpg","description":"NINJA GAIDEN: Master Collection Deluxe Edition\nWith this version, in addition to \"NINJA GAIDEN: Master Collection\", the Deluxe Edition additional contents is also included.\n■Included Titles\nNINJA GAIDEN Σ\nNINJA GAIDEN Σ2\nNINJA GAIDEN 3: Razor's Edge\nNINJA GAIDEN: Master Collection Digital Art Book & Soundtrack\n■Deluxe Edition Additional Contents\nA Digital Art Book & Soundtrack that include visuals, still images, and music tracks from series history.\n※Online multiplayer is not available for the “TAG MISSIONS” in NINJA GAIDEN Σ2.\n※The “Shadow of the world” “Clan battle” for NINJA GAIDEN 3 Razer's Edge is not included.\nOnline multiplayer is not available for “ninja trials”.\n※\"NINJA GAIDEN Σ2\" and \"NINJA GAIDEN 3: Razor's Edge\" are also available in Traditional Chinese.\nPlaying in Fullscreen ModeThis game can be played in Fullscreen mode.\nTo do so, launch the game, and then click the maximize icon in the upper-right of the title bar. To return to Windowed mode, press the Esc key while in Fullscreen mode.\nChanging the Output ResolutionWhen the game starts, it determines the resolution that is most appropriate for your environment (either 1920x1080 (1080p) or 3840x2160 (4k)).\nYou can also set a specific resolution for playing this game.\nNote: The resolutions below are supported.\n1280 x 720, 1920 x 1080, 3840 x 2160\nTo configure the resolution, open the game's Properties from your Steam® Library.By entering \"720p\", \"1080p\", or \"4k\" in the text field of \"LAUNCH OPTIONS\", you can fix the resolution to the corresponding value.\nBy setting the game to a low resolution, you can reduce the processing load.\nAbout the GameNote: This product is included in \"NINJA GAIDEN: Master Collection\", and \"NINJA GAIDEN: Master Collection Deluxe Edition\". It is not available for individual purchase.\nNote: Please visit the official website for more information on the featured content.\n[About NINJA GAIDEN: Master Collection]\nEnjoy 3 games from the NINJA GAIDEN series in this one title.\nEach title is still just as fun as you remember while providing the same high speed action of the original releases.\nLook forward to heated battles with fearsome opponents!\n\nIn addition to Ryu Hayabusa, 4 other characters, Ayane, Rachel, Momiji, and Kasumi, are also playable. You can create a tag team with your favorite characters and freely swap out the playable character during battles.\n※The heroines included in this title are the same as the original versions. In addition, the characters that are playable and scenes (modes) vary for each title.\n\nAll of the previously released game modes and DLC costumes for each title are included in this one set. In addition to Ryu Hayabusa, each of the other characters also have many different costumes to choose from, allowing you to enjoy action packed battles in whichever outfit you prefer.\n■Included Titles\nNINJA GAIDEN Σ\nNINJA GAIDEN Σ2\nNINJA GAIDEN 3: Razor's Edge\n※Online multiplayer is not available for the “TAG MISSIONS” in NINJA GAIDEN Σ2.\n※The “Shadow of the world” “Clan battle” for NINJA GAIDEN 3 Razer's Edge is not included.\nOnline multiplayer is not available for “ninja trials”.\n※\"NINJA GAIDEN Σ2\" and \"NINJA GAIDEN 3: Razor's Edge\" are also available in Traditional Chinese.\n[About NINJA GAIDEN Σ]\nIn addition to being able to pull off unmatched dazzling techniques with \"Ryu Hayabusa\", a young ninja who has inherited the ninja arts of the Hayabusa style, with beautiful stages in a westernized Japan embellished with spirit-world motifs, and more, the game is packed with features that are a must-play for any fan of action games.\n■The epic story can easily be enjoyed with \"Hero Mode\"\nWhen you select the difficulty setting \"Hero Mode\", Hero Mode is triggered when your health becomes low. With Hero Mode, you will guard and evade automatically, and can unleash ninpo as much as you want. Even casual action gamers will be able to feel the heroic thrill of escaping a pinch to turn the tables on the enemy and advance the game. Needless to say, difficulty modes that will satisfy hard-core gamers are also included.\n[About NINJA GAIDEN Σ2]\nBecome Ryu Hayabusa, the ninja who inherited the \"Dragon Sword\", a legendary blade, and once again experience high-speed ninja action in which you face battles all over the world. The game is also packed with additional features such as \"Hero Mode\", a mode in which the player will guard automatically when they are in a pinch.\n■In \"NINJA RACE\", life or death depends on speed\n\"NINJA RACE\" is a mode in which you must race across the map within the time limit while fighting high-speed battles. In this mode, the number of enemies you defeat in succession is counted as your \"CHAIN\", and by stringing together a high chain, your attack power will increase dramatically. Also, you can pick up speed-up and time increasing items along the way, so attacking non-stop, defeating enemies as fast as possible, and gathering items will be essential to your strategy.\n■Along with Hayabusa, 3 heroines dazzlingly dash about the battlefield\nHeroines from the \"NINJA GAIDEN\" series, \"Ayane\", \"Rachel\", and \"Momiji\" appear as playable characters. With \"TAG MISSIONS\", players can select 2 characters from among Hayabusa and the 3 heroines, allowing them to switch between 2 playable characters as they complete their mission.\n[About NINJA GAIDEN 3: Razor's Edge]\nThe ultimate high-speed ninja action has returned! The game offers both extreme \"challenge\", along with an equally extreme \"sense of accomplishment\". Experience the series' most alluring high-speed action.\n■In addition to Ryu Hayabusa, Ayane, Kasumi, and Momiji join the battle!\nIn addition to main character \"Ryu Hayabusa\", the 3 female ninjas \"Ayane\", \"Kasumi\", and \"Momiji\" can be used as playable characters. And they aren't limited to just the \"Chapter Challenge\" story missions - the 3 characters can also be used in \"NINJA TRIALS\". Also, \"NINJA GAIDEN\" series heroine Ayane has a dedicated story.\n■Thrilling battles where you must be constantly alert\n\"Tests of Valor\", a special phase for series fans who want to enjoy battles even further, have been included. In each chapter, there are hidden skulls that serve as gates to \"Test of Valor\" areas. By stepping foot onto these areas, battles will occur where players must face the fiercest and strongest enemies from the \"NINJA GAIDEN\" series.\n■Upgrading characters adds more replay value!\nBy collecting hidden \"Golden Scarabs\", using \"Karma\" collected in battles, and more, players can unlock new weapons and ninpo to upgrade their characters. Of course, upgrades you have applied can be carried over for 2nd and successive playthroughs. Among moves that can be unlocked, there are moves that are new to the series, such as \"Cicada Surge\", which allows you to dodge any enemy attack, \"Meditation\", which allows you to consume your Ki gauge to recover health, and more.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"KOEI TECMO GAMES CO","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":427972,"name":"Coloring Game 3","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e7/1e728cb24b4ecb2ce8fcaa21ef1006fa.jpg","description":"Coloring Game 3 is a new paint-by-number game which has already won hearts of numerous players. Now the game offers new difficulty modes.\n15 (30) new free images.\nEach image has two difficulty modes.\nIn order to gain all the achievements, it is not necessary to complete all the variations of the image (difficulty modes). Players just have to paint at least one image in each mode.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"}]},{"id":292054,"name":"Blush Blush","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf7/cf76660cc7be59549eaedfff13b7ab54.jpg","description":"Blush Blush is a Dating Game tossed with an Idle Game. It features a light hearted story where the player must rescue a series of fun and attractive anime-boys, who have all been cursed with a dark spell. A curse that can only be broken with the power of love, naturally.\nThe gameplay is easy! The player must choose how they spend their time wisely, by working various jobs, earning stat points, and arranging dates and gifts for their love interests. A mix of strategy and story, the player will gradually become an accomplished dater, and have the chance to woo more than a dozen characters with more planned for the future.\nThe final version of Blush Blush will feature voiced audio performances, monthly game events, and premium DLC packages. Players in Early Access can expect any content they purchase to be carried over to the full version when it launches later this year.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Sad Panda Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":47595,"name":"Prologue (2017)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/672/672ca9dc7822afa49978820c6de653db.jpg","description":"Lines X\nLines Infinite\nAbout the Game\nLines X Free is a Numberlink-based puzzle game involving finding paths to connect colored tiles in a grid.\nCompletely free\n50 brain-teasing Numberlink puzzles\nBeautiful abstract design\n8 ambient relaxing soundtracks\nSteam Achievements\nCross-platform saves via Steam Cloud\nWindows, Mac & Linux\nFull version - Lines X\nInfinite fun - Lines Infinite\nGet both with 25% discount - Lines Bundle\nDisclaimer - Game contains multiple achievements, which can be considered as \"achievement spam\". We want to assure you that they were added only as a result of community event on launch date. We wanted to make personal present for our fans, no bad intentions. You can disable achievements anytime in game settings. Thanks for understanding.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nestor Yavorskyy","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21414,"name":"Luxor: Amun Rising HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6af/6af02a79d6eae62a0e66f130ec99c475.jpg","description":"Glory and adventure await as you return to save Ancient Egypt from certain doom in Luxor: Amun Rising. As chains of colored spheres rapidly approach the gateway of the pyramids, it’s up to you to stop them with your magical winged-scarab shooter. Fire colored orbs to make matches of three or more and eliminate oncoming chains.\nFilled with excitement, adventure, tons of explosive action and stunning HD graphics – can you drive back the rebellious invading forces to once again save Egypt?\nKey Features:\n88 levels of marble-shooting puzzles\nThrilling music and sound effects\nCatch falling gems to earn bonus points\nAll-new Scorpion power-up, Wild and others to help along the way\nStunning HD graphics","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":21295,"name":"Dark Shadows - Army of Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8f/e8f133c2814557677c6230c16f9bad93.jpg","description":"Dark Shadows - Army of Evil is a Classic Medieval Fantasy First Person - Hack and Slash Game with a kind of old school look.\nStorySeptember 1362:\nAn army of evil, named \"Dark Shadows\", have been ravaging the country like a plague of locusts for over a year and are frightening the people with their scary get-up. Most people still think they are monsters. But they are only in disguise. While you were away these monsters stormed the castle. A woman named Katerina has been kidnapped. It is not just any woman. You are in love with her. They’ve also taken all the gold. All the taxes. And weapons! You are the only one who can help Katarina. You must hurry and follow them before they do something to her.\nGameplayClassic Hack and Slash Game:\nThe player fights his way through 19 levels. Various weapons will be available. They can be found in different levels. Everything begins moderately and you need to find some keys and a sword. After the first level the game turns into a hack'n slash game. Most of the time, the player has to fight against enemies. But he has to do also other little things and must solve certain problems. You need keyboard and mouse.\nFeaturesThis game is an indie game with a kind of old school look.\nIt is also supporting SSAO and Bloom Shader effects.\n19 Levels and 18 Weapons\n​Single Player\n3D Realtime Cinematic Blood Splatter Scenes","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Burian Media Enterprises","platforms":[{"id":0,"name":"PC"}]},{"id":19783,"name":"The Abbey of Crime Extensum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b6/6b6c5ee8eebc8a86db3f70998c03cd04.jpg","description":"A free game inspired by Umberto Eco's novel and Jean-Jaques Annaud's film \"The Name of the Rose\", and based on the game \"La abadía del crimen\" by Paco Menéndez and Juan Delcán.\nDon’t follow several and odd sophistical doctrines that spread pestiferous seeds – wrote Clement VI himself in the year 1346 to the masters and alumni from Paris University.\nThe Pontifex addressed in his letters to the doctrine of an illustrious Franciscan monk of English origin named William of Occam, who ran away several years earlier from the prison of Avignon, accused of heresy. He had been imprisoned for four years, until he could escape, and shought asylum in the court of Emperor Ludwig of Bavaria, who was at odds with Pope John XXII.\nWhen the Emperor died, William wanted to return to the mission with his order and the church, so he traveled to Italy with his young novice to meet Bernardo Gui, who was the head of the Inquisition at that time in that region, and, ultimately, the representative of the Pope.\nHowever we cannot know for certain whether William achieved his goal. Only the testimony left by his disciple years after the events happened, in a collection of scrolls; where those amazing and terrible events that happened during the week William and him spent in the abbey the meeting was scheduled were described.\nThe testimony of the story you are about to revive…\nIn this game you play as a Franciscan, Fray William of Occam and his young novice Adso of Melk on a quest to discover the perpetrator of a series of murders in a Benedictine abbey. The entire game is played in an isometric 3D environment, with a series of objects that has to be collected in order to successfully complete the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Manuel Pazos","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19421,"name":"Full Bore","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e0/5e04503df514e6e61adbf53a7918c25b.jpg","description":"Deep underground lies a reminder of Boarkind’s darkest hours. All it takes is one little boar to dig it back up.\nHarkening back to the NES era, Full Bore is an open-world puzzle game that leaves you to your own devices. With curiosity as your only guide, you will figure out how the blocks around you behave, delve deeper into a strange underground, and eventually piece together the story of a world transfigured.\nFull Bore debuts a unique lighting engine that creates rich, atmospheric environments out of its old-school pixel art. Combined with our original bluesy soundtrack, you will soon find yourself immersed in Full Bore's mines, temples, scrapyards, lava tubes, inexplicable lakes and/or mysterious laboratories.\nWith over 150 areas, no single intended path and secrets everywhere, Full Bore gives you a world in which you can always find something new (until you find everything)New on SteamFull Bore is digging its way to Steam for the first time in May, featuring both Part 1: The First Dig, and the never-before-played Part 2: Into Hard Earth. Of course we're also bringing you some really boaring Trading Cards (see what we did there?), Achievements and more. Can you dig it? Great! More puns!Features Be a pig.* Dig. *You're actually a boar, but that doesn't rhyme with dig.\nExplore at your own pace as you learn how you can interact with the blocks around you\nFocus on puzzle-solving and exploration, not conflict.\nPlay as either Frederick the boar or Hildi the sow\nOriginal glitch/blues soundtrack gets you in the mood to dig","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Whole Hog Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17944,"name":"Epic Arena","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09a/09a7f030696571718702979af8186c5e.jpg","description":"Epic Arena is a free-to-play turn-based strategy game. It's a tactical combat game for thinkers where two players engage in epic back-and-forth matches.\nEpic Arena is easy to learn but hard to master and supports all levels of gameplay. Train your tactical muscles and gain useful insights into winning strategies in single-player missions. Fine-tune your strategies by challenging your friends in the game's duel mode. Climb up the ladders via playing ranked Blitz mode matches.\nKey features:\n3 unique teams: Chaos, Order, and Pirates, all featuring unique units, spells, and team strategies\n2 game modes: Blitz mode (time-limited synchronous play) and Duel mode (asynchronous turn-by-turn play)\n1v1 multiplayer: play against your friends, foes, colleagues, and top players from all around the world\npower cards: effectively use situational Power Cards to turn the tide of the battle\nThe game features three teams (Order, Chaos, and Pirates) with completely different units, spells, traits, and tactical options.\nPut your thinking hat on and outwit your opponent in time-limited blitz mode matches or take your time in asynchronous play duel matches.\nEpic Arena is free-to-play. Unlock or purchase additional teams to master your strategies. Acquire Power Cards and use the cards' special tactics against your opponents.\nPlay from everywhere, anytime on any device - at work, at school, on the subway! Epic Arena is available on all major platforms and provides a true cross-platform experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shadow Masters","platforms":[{"id":0,"name":"PC"}]},{"id":16483,"name":"Kaptain Brawe: A Brawe New World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/840/84022face0dcb2a88541081d3d197d16.jpg","description":"Step into the world of interstellar travel, where Space Pirates lurk at every corner. Kaptain Brawe, a Space Police officer will embark on a journey filled with quests, conspiracies and general chaos, as he follows the lead of two kidnapped alien scientists. Set in a beautiful, hand drawn alternative 19th century world, Kaptain Brawe's cartoon appearance will suit younger, as well as mature players, who enjoy games filled with humorous storyline and challenging puzzles.Features:Reveal the greatest conspiracy in the Space Age\nTravel and explore 4 planets\nPlay with 3 different characters (Brawe, Luna and Danny)\nTwo game-play modes: Hard-Core and Casual\nMeet the space pirates, Interstellar government, secret agents and more","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Cateia GAmes","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11554,"name":"Void Destroyer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b8/5b8d836c8c51c96c0f90c2ea38941303.jpg","description":"Please note: Void Destroyer is a mix of two genres - both of which tend to have a higher than normal learning curve, many controls, features and challenges. If considering a purchase, please be ready for a learning curve and challenging game play. Thank you for visiting, and I hope you enjoy the game.\nCombining the best of space combat and real time strategy. Victory can be tactical, a dogfight or capital ship slugging match - depending on how you decide to achieve it.\nA desolate asteroid field on the edge of the solar system erupts in war. Your forces rely on you to take the battle to the enemy. Build up defenses and fleets, repair and upgrade your command ship, lead your forces to reclaim and conquer territory.Game play:The seat of a fighter, the bridge of a cruiser and a tactical battle map are your tools of war. Void Destroyer puts you in command and gives you ultimate freedom over the    your forces and the art of war.\nIf you ever wanted to directly control your forces in a real time strategy game or be able to build ships and command to your wing-men and fleets in a space combat simulator like you can in a RTS - this is the game for you. Void Destroyer combines elements from space combat simulators and real time strategy games. No longer are you limited on how to control and command. Battles are waged on your terms, you are given the tools. How you use them is up to you.\nJump into a fighter to engage in dogfights, then switch into a frigate to take out an enemy corvette. Build defensive platforms to augment the security of your base. Issue commands to your attack ships to distract enemy defenders to allow your marine frigates to board an enemy's base. Defend and oversee asteroid mining craft to have the resources necessary to support your fleets.\nBy combining elements of two genres, enemies can be more brutal, fights can be larger and you can overcome greater challenges.\nThink there's not enough time? Use time dilation (slow down time) to make time for tactics.Features: A mixture of space combat and real time strategy games - two games in one, how you play is up to you\nTons of features, control options, challenges and a learning curve\nA story line, opportunities, plot twists, boss fights, and many surprises\nPilot ships - from small drones to heavy cruisers\nInstant ship switching - all ships are pilot-able\nMultitude of weapon systems in the hands of both friends and foes\nTactical Mode - easily issue orders and manage your forces\nBuild platforms\nBuild ships\nResearch new technology\nUpgrade your command ship\nCombine the use of command ship abilities for devastating tactics, use a tractor beam to pull an enemy closer then annihilate it with a upgraded main gun\nAsteroid mining\nFlight engine combines six degree of freedom with Newtonian physics, balanced to allow for dogfights\nPilot via joystick or mouse (mouse flight - includes two different modes)\nMultiple controllers (HOTAS and other) are supported\nCommand view - camera and mouse controls optimized for controlling turrets and piloting larger ships\nIf the role of a pilot isn't your thing - you can let the ship's crew do their job\nCapture enemy bases and ships\nMod support - \"mod nearly everything\" philosophy\nInstant Action scenarios - unlocked via playing the main game/story mode\nArena (dogfight) and Skirmish (RTS maps) modes\nBattle Editor - create your own maps, unlimited game play on your own terms\nUnlock system - as you research new ships and defeat enemy ships, they become available for use in the battle editor\nFormations - pre-defined and custom\nCommunity input valued by a responsive developer\nIn game guide/manual and tutorial system\nDifficulty options - make the game more forgiving to get through a tough spot if you so chose\nMade for the PC and PC gamer market, no \"consolization\"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Iteration 11","platforms":[{"id":0,"name":"PC"}]},{"id":11444,"name":"FEMINAZI: The Triggering","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c7/2c75636e876860c839a591b6f20f9958.jpg","description":"Trigger Warning: This game might, but does not intend to be offensive to some certain groups of people. Keep in mind that the game represents a satire of SJW culture and Third Wave Feminism, and does not intend to defame or shame them in any way. All events and characters are fictional.\nFEMINAZI: The Triggering is a casual game for Steam in which  your goal is to stop straight evil white males from oppressing women and minorities and make them check their privileges!\nCheck out the FREE demo HERE! http://www.kongregate.com/games/svarogstudios/feminazi-the-triggering-dress-up-demo\nFeaturing:\nOver 30 different genders, including the ability to create your own!\nMinigames\nSteam Leaderboards\nFeminism\nFat\nToxic white masculinity\nRefugees\nCultural Marxism\nWelfare\nFeminism\nBurgers and other greasy foods\nWage gap\nMocking the weak\nMuch triggering\nSuch oppression\nFat\nEvil Patriarchy\nTolerance","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"hyperboreanGames","platforms":[{"id":0,"name":"PC"}]},{"id":5294,"name":"Watchmen: The End is Nigh Part 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/773/77334b2d59a867a753c32e2c0dfdbfa4.jpg","description":"Watchmen: The End Is Nigh Part 2 delves further into the partnership of Rorschach and Nite Owl before the hero-banning Keene Act. It’s now June 1977, and any day now the passage of the Keene Act will outlaw all masked vigilantes not sanctioned by the government. Rorschach contacts Nite Owl to get his help in solving the case of a missing girl, Violet Greene. Their search takes them deep into the depraved, sleazy corners of the city and eventually face-to-face with the mysterious Twilight Lady.\nPlay as the Watchmen characters Rorschach and Nite Owl, each of whom have their own unique abilities:\n\nRorschach, a feral, street-wise fighter who can disarm enemies to use their own weapons against them\nNite Owl, a refined fighter who uses martial arts expertise and high-tech wizardry\nFight and watch the blood fly through three chapters of gut-wrenching in your face action\nIntense, visceral - battles fight up to 20 enemies at the same time with bloody, street-fighting moves\nClean up the streets with friends in split screen co-op multiplayer competition or solo","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":2178,"name":"I Am Setsuna","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/35a/35ab228c1f3dedeb27a7af9f1811ae2f.jpg","description":"More Reviews & Accolades9/10 “I Am Setsuna is a delightful breath of fresh air” - RPGSite\n8/10 “I Am Setsuna proves that there's still room for the JRPG genre” - Spaziogames\nAbout the Game\nThe I am Setsuna Collector’s Edition includes the full game and the beautiful 27 melody original soundtrack ‘Winter’s End’ by composer Tomoki Miyoshi.\nThis is the story of Setsuna; a young woman of incredible inner strength and the sacrifice she must make to save the people of her land.\nThe Island had a custom.\nTo maintain peace, once a decade, a sacrifice was offered to a fiend on the island.\nHowever, one year, the fiend grew violent before the next sacrifice was due.\nThose living on the island were afraid and tried to calm the fiend by offering a sacrifice; Setsuna, chosen because of her powers of enchantment.\nSetsuna must leave with her safeguards for the farthest land, where the ceremony of sacrifice will be held.\nKey Features:\nA great homage to JRPG masterpieces of yesteryear, using the latest technology to develop a truly memorable story and player experience and bring the authentic JRPG style to current hardware.\nA new battle system inspired by the timeless JRPG classic, Chrono Trigger.\nAn emotionally impactful and memorable story which immerses players in the narrative of Setsuna, whose story portrays heartrending sorrow.\nBeautiful character designs and varied in-game locales evoke nostalgia for classic RPGs.\nTo access your pre-purchase rewards please navigate to the following directory:\n\\steamapps\\common\\SETSUNA\\Soundtrack\n\\steamapps\\common\\SETSUNA\\Wallpaper\nIf you’ve purchased the I am Setsuna Sountrack (whether as part of the Collector’s Edition or separately) the album will be located here:\n\\steamapps\\common\\SETSUNA\\Soundtrack","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":650626,"name":"Oaken","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/43a/43a642cdfb759be215fa476c80a26ae4.jpg","description":"The world of Oaken is a mythical place, existing in a not easily defined space and time. It is stretched among the branches of the Great Oak. Its inhabitants are spirits which listen to the same voice, called the Oak Song.\nThe loss of that voice strats a series of events leading into a struggle which may either heal or destroy the Great Oak.\n\n\n\n\n\nRoguelike, hero-oriented campaign, with deck management and 3D figurines.\nA mystical world inhabited by spirits with celtic and tribal vibes.\nA randomly generated world map with tons of levels, bosses and events to be discovered.\nUnique, highly tactical battles on a hexagonal grid, where position and rotation is everything.\nUpgrade your spells and spirits the way you want.\nEasy to learn, hard to master - chill and challenge modes suitable for any player.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Goblinz Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":578186,"name":"Coloring Game 4","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d4/8d44566b4e6c266f09a9de2bba53eb49.jpg","description":"This is the last part of the Coloring Game’s franchise (coloring by numbers). The game’s fans are going to enjoy the improved functionality and a multitude of new images.\nNo more consecutive numbers are going to be given to the games within this franchise.\nThe game features 10 free images. Another 5 images are going to be added during the game’s full release.\nColoring Game 4 is not going to feature image animation.\nFollowing the players’ numerous requests, commercial DLCs are going to be unified (400,000 px.).","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"}]}]