[{"id":2935,"name":"Hatoful Boyfriend: Holiday Star","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da9/da9fbc08b1b468e84f9414f386c2d262.jpg","description":"Dove, Actually Edition\nThe Hatoful Boyfriend: Holiday Star - Dove, Actually Edition includes the full digital soundtrack, Holiday Star Dossier digital booklet, The King's Story Book, and a collection of Hatoful Boyfriend: Holiday Star wallpapers.\nAbout the GameThe loveable birds of Hatoful Boyfriend are back in the remastered holiday-themed sequel Hatoful Boyfriend: Holiday Star! Travel to fantastically styled worlds, meet interesting new chickadees, and find romance in the elegantly designed winter wonderlands. Dust the snow off your wings and take flight with familiar faces and new friends alike in extraordinary adventures hatched from the whimsical mind of the series creator Hato Moa and developer Mediatonic!\nFreshly Hatched Presentation: Experience Hatoful Boyfriend: Holiday Star in glorious high-definition with extraordinary hand drawn scenery and a dazzling new watercolor world unlike any other.\nOld Friends and New Faces: All-new stories and adventures starring your favorite feathered romantics from the original game alongside a whole new flock of lovable birdies.\nNew Avian Antics: It’s not a Hatoful Boyfriend game without a bit of the bizarre like anime inspired magical girl transformations for all your favourite pigeon boyfriends, lab-grown birds stealing Christmas and a mysterious King of the Holiday Star.\nDelightful Side Stories: Veer off the flight plan for some marvelous episodic side stories and fun distractions like series favorite Ryouta and his fantastic radio show.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1171,"name":"Alekhine's Gun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/63d/63db2274fdfa8ae48f650016d83d9dcf.jpg","description":"It is the height of the Cold War, a time of global uncertainty and civil unrest. You are Agent Alekhine, a highly skilled Russian assassin, driven by a moral compass that leads you headfirst into a covert operation unsanctioned by the country you previously served.\nWorking alongside American CIA agents, your mission is clear - though how you accomplish it is anything but - as the tension of a nuclear standoff grows with each passing minute. Enemies and allies blur; truth is as nebulous as your identity. In a world where one wrong move could be the end of you, navigating a new direction comes at a price.Features:TRAVERSE 11 OPEN GAME LEVELS - Play through open environments with non-linear missions within intriguing U.S., European, and Cuban locations. Explore multiple routes, hidden rooms, and numerous methods to execute assignments. Move freely within your surroundings. Tackle objectives in any order you choose.\nCONTROL YOUR MISSIONS - Complete each stage within the missions based on your own personal strategy and play style. Experiment with tactics such as using poisons, staging accidents, or purposely alerting guards.\nMAXIMISE YOUR STEALTH RANKING - Create distractions, pick locks, take on enemy disguises, retrieve vital documents to discover new information, and use specialised weapons to dispose of enemies. Gain additional weapons after each level based on your ability to complete missions without causing attention.\nEXPERIENCE COLD WAR ESPIONAGE - Alekhine's Gun takes place in a time of extreme hostility and tension, beginning in the early years of the Cold War after WWII and extending through the early 1960s Cuban Missile Crisis. Experience cinematic cut scenes that add layers of intrigue and offer information to help unravel the plot, while providing a historical perspective of this time period.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Maximum Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":778212,"name":"Idle Spiral","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af0/af0d5238b89607465012982b053c42d0.jpg","description":"What's Idle Spiral?\nThis is a beautiful \"Idle\", \"Incremental\" game based on spirals and mathematics. Your goal is to make the spiral grow longer and longer. The game is very simple, but it is very deep and can be enjoyed for a long time.\nHow to play\nBy buying upgrades, you can grow your spiral more efficiently. There will be a lot of mathematical equations, but don't be afraid. The upgrades themselves are not that strategic and you hardly need to understand this formula. However, as you continue to play, you will gradually come to understand the mechanics.\nLayered prestige mechanics\nThe game has various reset mechanisms called Prestige (as seen in many Idle games!). Prestige resets much of the game's progression, but allow you to progress further and faster than before.\nBattle Spiral\nIn Battle Spiral, your spiral is used as a weapon to fight various designs of spirals; to gain an advantage in Battle Spiral, it is important to consider what rewards to choose and in what order to fight the enemies. An extremely powerful boss with a very complex shape awaits you in the second half of the game!\nChallenges\nChallenges aim to achieve a specific goal under strong constraints. In challenges you will face debuffs, constraints, and fundamental gameplay changes while trying to achieve a certain goal. After reaching the goal, the challenge is completed and you receive big rewards.\nEndless Content\nTornado Prestige is just the beginning of this game. It will take some time to progress through the game, but more content is waiting for you!\nMusic by AKIYAMA HIROKAZU from H/MIX GALLERY","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Archimedes Geeks","platforms":[{"id":0,"name":"PC"}]},{"id":541282,"name":"Luck be a Landlord","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74b/74ba3e337f2c3eed2858e3f37e2e69a6.jpg","description":"Your landlord is knocking on your door. You have one coin left to your name. You insert the coin into your slot machine...and...JACKPOT! Luck be a Landlord, tonight!\nFeaturesRoguelite gameplay - The symbols you can add to the slot machine are different every time!Lots of Symbols to add to your slot machine - Each symbol has different effects and interactions.Plenty of Items to choose from - The items are different every time as well, leading to interesting build strategies.A terrible landlord to defeat.A dog you can pet.Capitalism.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"TrampolineTales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":50370,"name":"Parkasaurus","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/404/4041966f2db9eec705a5722a2f66502a.jpg","description":"Parkasaurus challenges the player to plan, design and construct fabulous exhibits that maximize both the happiness of their Dinos, and the park guests’ satisfaction and willingness to spend money! Starting with only a dream and an abandoned park the player will discover ground breaking technologies, new attractions and a special bond with each of their Dinos, all captured in stunningly beautiful modernized 3D flat design graphics.\nIn Parkasaurus if you care for your dinos, discover new technologies then your park will thrive.\nExhibit Design: Design success - each dinosaur requires a unique biosphere, which means the shape of exhibit, materials used, ecology, plants, elevation and humidity all play a key role in whether the Dinos, and the park, thrive...or become extinct.Park Creation and Management: Wisely spend resources to build the ultimate Dino Park and turn a profit to ensure future stability.Guest Monetization: By reading reviews and observing your guests, fine tune the flow and arrangement of your park to maximize the happiness of guests and Dinos alike.Employee Management: Level up rookie hires, or bring on established veterans, to help run your park smoothly and efficiently.Time Travel for Dinos Eggs: Go back in time to retrieve the hottest (and oldest) Dino Eggs.Chaotic Dino Escapes: Switch into first person view to handle any Dino rampages quickly and with care, before disaster strikes.Year Round Challenges: Manage unexpected weather catastrophes, as well as the expected diverse demands each season brings.\nCurrently Parkasaurus is in an early stage of development although a lot has been done! Out plan is to make Parkasaurus available this spring for those interested in forging the direction of this game. We have so many ideas still to do and would love the support of a Parkasaurus community to help us decide what to work on next.\nThere are only two of us working on this project, and despite being experience game makers, we desperately are going to need YOU be a Parkasaurus Warrior! Here is how:\nBe brave enough to support our Early Access release this springAdd us to your wishlist as soon as you canTweet about us, or to us, or  just talk about usTell your friends and family to support usVisit your local MUSEUM, or ZOO, or ANIMAL SHELTER\nAnd if you read this far, thanks, we love you!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"WashBear","platforms":[{"id":0,"name":"PC"}]},{"id":46286,"name":"Chicago 1930: The Prohibition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/186/18682a39f6d324f53f6e21a01a97ea27.jpg","description":"Welcome to Chicago !\nThe Mafia rules the city. A special police task force is formed to take down his gang. This squad is managed by two cops. An open war breaks out throughout the city of Chicago. Now it’s your turn to choose your side!\nThe Mafia openly rules the city. Don Falcone arrives in town to lay down his law within each disctrict. A special police task force led by Edward Nash is formed to take down the mob, by any means necessary. Open turf war breaks out throughout in the city of Chicago\nWhich side do you choose to join?\nMAIN FEATURES :\nChoose your side: play the mob or the copsby managing a team of 5 characters.\nRPG Features: Characters have five different attribute areas (shooting, close combat, throwing, charisma, first aid).\nWhen the action gets too hectic, you can use the Slow Motion Mode to efficiently manage your team during the heat of battle.\nArtificial Intelligence allows Enemies to have varying reactions depending on situations and give very realistic characters.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":24059,"name":"Super Castlevania IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c2/6c299f5dc9039c83b4c7a29b6830e29e.jpg","description":"In the peaceful country of Transylvania, there is a legend of an evil\ncastle and its master, the Prince of Darkness, Dracula. Once every\nhundred years, the powers of good mysteriously weaken, and evil attempts\nto resurrect Dracula. It's up to the Belmont clan to take up the eternal\nfight against the vampire. Players take on the role of Simon Belmont,\narmed with the legendary whip, Vampire Killer, to defeat Dracula and his\nevil minions. Luckily, Simon has many additional weapons at his\ndisposal, including axes, holy water, crosses, knives and even a magical\nstopwatch that can stop the flow of time for a spell. Simon must travel\nthrough 11 stages, beginning in the countryside, to reach Dracula's\nCastle, all the while overcoming perilous traps and hideous monsters.\nOnly the power of the Belmonts can quell the looming darkness.\nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"SNES"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":21931,"name":"Statik","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62a/62ae50892216607b20f4f81636751a09.jpg","description":"STATIK is a 4 player online co-op horror game. A group of kids in the 1980's find an abandoned house with a shelf full of VHS tapes. When each tape is played, the events of the movie start to play out in real life. Will you escape with your lives or become another victim of the static. You can choose your ending by finding the maps secrets or defeating the killer.\nEach level has multiple different endings and many easter eggs to find. No playthrough will ever be the same with the killer always making different decisions and items being spawned randomly.STORYIn the boring town of Belleville, most summer days are spent by the lake swimming or biking around town. One day, you and your friends discover an old abandoned house in the woods. It's a tall house, furniture and interior untouched like the owners just vanished and left it trapped in time. Inside, the beige wallpaper is decaying and peeling off. When you get to the living room, there is a big tv set on top of a vhs player. Next to the tv you find a shelf containing Vhs tapes with no label or name. You call your friends over to play the tape, thinking nothing of it...GAMEPLAYIn STATIK, each VHS tape is a different horror movie that plays out in the old house. You will be hiding from the killer while he tries to hunt you down and send you into the static. Find clues on how to send the killer into the static or find clues on how to escape throughout the map. The closer you get to escaping or if you're brave enough to face the killer, he will get smarter and he will be able to hear you better. Be stealthy and quiet or you will be sent into the STATIK.\n-  Co-Op Game\nWhen playing a Co-Op game, stick together to solve the mysteries of the house and help each other by using a medkit to get a player out of the STATIK.\n-  Single Player Game\nIf you're brave enough to play alone, you cannot get yourself out of the STATIK and have to solve puzzles by yourself. It's possible but significantly harder.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tarsier Studios","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":20801,"name":"Kult: Heretic Kingdoms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e4/0e4621b2eb6ff8e0c6896d16439d1373.jpg","description":"In the world of the Heretic Kingdoms, a world where God is dead and religion heresy, you are cast as a young female inquisitor, working to stamp out the last remnants of religion. On instructions to destroy a relic which the Inquisition considers to be a significant threat, you are drawn into a war between two warring secret societies – a conspiracy of mages whose goal is true power, and a shadowy cult who seeks to resurrect the Dead God.\nAs the story progresses, you will be placed in an amoral world and left to decide your own morality. Just like the real world, your actions have consequences, and it is up to you to decide if you can live with them or not. Play as an altruistic heroine, a vicious and selfish egotist, or just a woman trying to get her job done – your actions will lead you to one of six different endings depending on where you decide your loyalties lie. Will you crush religion underfoot, or become its savior? Only you can decide!\nAn engaging story line written by a script team lead by critically acclaimed game writer and designer Chris Bateman (Discworld Noir, Ghost Master)!\nFeatures a simple but rewarding combat system that keeps the action flowing thick and fast.\nA vast world to explore containing around fifty locations, scores of unique monsters, and tons of loot!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Games Farm","platforms":[{"id":0,"name":"PC"}]},{"id":18332,"name":"Gurgamoth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/528/528c9e2675321c575c78ccaa25a9ffb4.jpg","description":"Note: Gurgamoth requires controllers to playGurgamoth is a flying fighting game where the level is your weapon.\nGurgamoth is the perfect mix of party chaos and competitive strategy, ideal for sitting around on the couch with a couple of friends.\nYour only weapon is the level itself: a shifting battlefield with different hazards.  Gurgamoth is fast, relying on quick timing, but also your ability to read your opponent.  Will they dodge your attack and send you flying into a spinning saw blade?  Will they spend their attacks on a power up, leaving them temporarily vulnerable?  Will they anticipate your attack and stun you while you're recovering?\nGet inside their minds and earn the honor of awakening Gurgamoth.\nGurgamoth features:\nUnique levels, each with their own dangers\nGame-changing power-ups\nTight flying mechanics\nFantastic visual design\nFast, party-friendly matches\nFull controller support\nThe most fun you'll have summoning an elder god","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Galvanic Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15289,"name":"Memory's Dogma CODE:01","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/abb/abb23f06087716ecf1a82bf71929499c.jpg","description":"Featuring stunning graphics and an all-star voice cast, Liz-Arts proudly presents Memory’s Dogma CODE:01, an exhilarating sci-fi suspense visual novel set in future Japan!StoryIt is the year 2030 A.D. With the recent advancements in information technology and neuroscience in Japan, human memories can now be saved and recorded via a technology called  \"e-Memory.\"  Numerous state-operated facilities now exist that will allow one to communicate with the deceased: the \"Connect Center.\"\nCollege student Kusuhara Hiroki struggles with suicidal impulses after the sudden passing of his close childhood friend, Mizunashi Sorano. With her memories to last only six days, Kusuhara’s friend Amamiya Kakeru suggests that they attempt to steal Sorano’s memories from the server in which they are stored. In the midst of this, the pair of friends are suddenly embroiled in an ongoing conspiracy revolving around a truth that must be kept secret at all costs.Features:\nMultiple Decision Points - Avoid the \"bad endings\" to reach the truth.\nFully Voiced Japanese Cast- Characters (including the protagonist) are brought to life by a star-studded cast of veteran Japanese voice actors from the anime industry.\nFull HD Visuals - Enjoy the game’s stunning visuals in Full HD format.\nMultiple Languages - Play through the game in either English or Japanese.\nDynamic Cutscenes - Watch as important events unfold with wonderfully dynamic motion-graphic cutscenes. Voice Cast:\nKusuhara Hiroki (CV: Ishiya Haruki)\nHibike! Euphonium (Tsukamoto Shuuichi)\nAzure Striker Gunvolt (Zeno)\nOrikasa Reina (CV: Oonishi Saori)\nIs it Wrong to Pick Up Girls in a Dungeon? (Ais Wallenstein)\nSaekano: How to Raise a Boring Girlfriend (Eriri Spencer Sawamura)\nMizunashi Sorano (CV: Satou Satomi)\nK-On! (Tainaka Ritsu)\nIs the Order a Rabbit? (Chiya Ujimatsu)\nAmamiya Kakeru (CV: Horie Shun)\nMayoiga (Hellfire)\nTHE iDOLM@STER SideM (Pierre)\nKanzaki Haruna (CV: Nakamura Eriko)\nTHE iDOLM@STER (Amami Haruka)\nHetalia (Belgium)\nKokonoe Akane (CV: Fujita Saki)\nWORKING!! (Inami Mahiru)\nVOCALOID2 (Hatsune Miku)\nEma (CV: Asakawa Yuu)\nFate/stay night (Rider)\nAkame ga Kill! (Leone)\nMizunashi Aoi (CV: Nabatame Hitomi)\nGirls und Panzer (Itsumi Erika)\nSeiyu's Life! (Shiodome Hikari)\nKozakura Mikoto (CV: Honda Mariko)\nNichijou (Aioi Yuuko)\nStudent Council's Discretion (Sakurano Kurimu)\n- You can view the staff comments on our website.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Liz-Arts","platforms":[{"id":0,"name":"PC"}]},{"id":13863,"name":"Cuban Missile Crisis","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f89/f89a70d39d48ab4e753f96e7e621cbec.jpg","description":"Cuban Missile Crisis is a real-time strategy game combined with a global turn-based tactical mode, thrusting gamers into a world ravaged by the military-political confrontation between the USA and USSR in 1962.\nCuban Missile Crisis offers an alternative interpretation of the events that followed the infamous nuclear stand off between the United States and Cuba. As the stalemate collapsed, the two superpowers unleashed their nuclear arsenal on the world, levelling its metropolitan expanses and leaving scorched radioactive deserts. The cities that managed to survive the disaster realised that the most precious resources were now clean earth and water. The remaining world citizens found themselves in a war fighting for their very survival.\nCuban Missile Crisis provides an interesting mix of real-time battles and a turn-based global strategy mode, forcing players to use tactical troop movements while managing resources and armies. Conquer new resources, track new borders, create a new map of the world.Features\nDozens of missions, through the four sides of the conflict (USSR, the French and German alliance, China, the American and British alliance).\nNew types of weapons and equipment including helicopters, rockets, reconnaissance troops, etc.\nRadioactive contamination zones that have an influence upon military equipment and troops.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"G5 Software","platforms":[{"id":0,"name":"PC"}]},{"id":13819,"name":"Gem Wars: Attack of the Jiblets","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4c/b4ce64c2df17f4fd62c041619b1ba340.jpg","description":"Gem Wars: Attack of the Jiblets is a combat party platformer for up to 4 players. It's a local/online party game centered around the concept of \"constant one-upmanship.\" Power-ups include gems that can be picked up to empower your character with a certain element. Each element has a strength and a weakness (i.e, fire is strong against earth, but water is strong against fire). Also available are Lethal Arms, which can change your default weapon shot from a normal pea-shot to a Gatling, Barrage, Launcher, Ball or Thrower. When these two power-ups are combined they can make a deadly new weapon (i.e, Fire Gem + Thrower = Flamethrower or Water Gem + Thrower = Super Soaker).\nMix and match your equipment with an expansive arsenal of unique Tactical Arms (which include a teleporter, cement block-maker, homing beacon, bear trap dropper, swingable rope, shot-reflecting shield, magnetball that rips off enemy equipment and a claw that forces your opponents to wear whatever gem you want) and the extra-transportational Power Boots (jet boots for flying, rocket boots for speed and spike boots for stomping out enemies).\nFeatures include:\n- Single player Challenges Mode with 30 Challenges\n- Survival Mode for 1-4 Players\n- Infection Mode - 4 Players (or AI-controlled players) lock into battle for 4 rounds. Each round, someone is selected as an Infected player. That player has to infect everyone else to win the round.\n- 7 Multiplayer Battle Modes for Local and Online, including: Deathmatch, King of the Hill, Super Gem, Mixed, Last Standing, Trophy and Domination\n- All Battle Modes can be played with score/stock/time variants, Free-For-All or Team game types and wide variety of gameplay modifiers like Gem Roulette (where every 15 seconds, the player's element switches)\n- Create-A-Character with 50 unlockable character parts\n- 6 Unique Arenas\n- 20 Pieces of Equipment\n- 47 Steam Achievements\n- Steam Trading Card Support\nThe Story:\nThe Jiblets were a benevolent species that inhabited the world of Septia. Due to overpopulation, a large portion of Jiblets were forced to move underground (these were appropriately referred to as The Descended). Years later, elemental gems and weaponry began sprouting around Septia.  The Jiblets, never having experienced such power, became corrupt. War broke out.\nTurns out that the appearance of the elemental gems and weaponry was all a scheme by The Descended, whose numbers have been decimated over the years due to similar infighting caused by the same gems. The exposure to the gems in their purest form have turned The Descended into deformed monstrosities with great power and intellect.  The Descended have plotted to wipe out the unevolved Jiblets and replace them as the master race.  By releasing the gems, The Descended let the Jiblets battle among each other, setting the Jiblets' own genocide in motion.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Queen Birdface Productions","platforms":[{"id":0,"name":"PC"}]},{"id":13739,"name":"Seven Kingdoms 2 HD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a39/a3975a43df6782f918286fda627bd42d.jpg","description":"Seven Kingdoms 2 is an award-winning classic real-time strategy game of intrigue and diplomacy, of trade and industry, of betrayal, espionage and conquest.\nTake control of any of twelve emerging Human civilizations: Egyptian, Indian, Persian, Chinese, Japanese, Mongol, Greek, Roman, Carthaginian, Norman, Viking or Celt.\nFeature List\nUnique gameplay that is not just about gathering resources, amassing a big army and attacking enemies.\nAn incredible blend of city management, trade, industry, espionage, diplomacy and conquest.\nYou can either fight or buy your way to victory.\nPlay as Humans or Fryhtans\n12 Ancient Human Kingdoms, including  Egyptian, Indian, Persian, Chinese, Japanese, Mongol, Greek, Roman, Carthaginian, Norman, Viking or Celt.\n7 Fearful Fryhtan Species and their Special Units & Powers\n12 Powerful Gods and Goddesses\nHeroes to hire for each of the 12 human civilizations\nBuild Industries & Trading Routes\nIntriguing espionage actions, including agitation, counter-spy, information theft, bribing, assassination, technology theft, and camouflage.\nConduct Subtle Diplomacy or Flagrantly Break Treaties\nA Random Campaign Generator with role playing elements. New Features of the HD version:HD support – Support screen resolutions up to 1920x1080.\nLarge map mode which is 4 times as large as the original map, opening up new strategy possibilities.\n14 high quality music tracks\nImproved gameplay balance\nEnhanced shortcut key support","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Enlight Software","platforms":[{"id":0,"name":"PC"}]},{"id":11993,"name":"Dungeon Journey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/526/5262adc1e3d6df4269516383630cd3ce.jpg","description":"You descend into the dungeon and begin your journey.\nLeap over obstacles, battle slimes, and earn points.\nAs time goes on, you'll need to react faster as the movement of your hero gradually speeds up.\nHow long can you survive?\nGame features:\nPleasant background music and sound effects\nMinimalistic design","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nova Dimension","platforms":[{"id":0,"name":"PC"}]},{"id":11712,"name":"The Last Hope: Trump vs Mafia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0d/c0d8c23ecd7bcf4d58b9c495470632ad.jpg","description":"Just UpdatedSteam Achievements for THE LAST HOPE TRUMP VS MAFIA are now available!!!\nAbout the GameThe Last Hope: Trump vs Mafia is the sequel to last year's sleeper hit “The Last Hope” in which you became the President of the World. You are John Trump, the President of all Countries. Shortly after being sworn in, you travel to Europe for a conference, but your airplane is shot-down by mafia members. The Mafia and terrorists from all ex-countries join forces against you. Now you have to fix this mess. You must to fight with mafiosos, terrorists and robots from:\n-\tFrance, USA , Turkey, Republic of Moldova, Canada, China;\n-\tA wide variety of weapons such as: Sniper Rifle, Pistol, Grenades, Sword, etc;\n-\tMeans of Transportation: Trumplane, Trumpomusine, Train;\nIt will ultimately be your choice to either surrender and allow the Mafia to take over the World or nuke them once and for all!\n* Game contains trading cards","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Atomic Fabrik","platforms":[{"id":0,"name":"PC"}]},{"id":9521,"name":"Earthfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6af/6af488a0de70f433e3f30df3daa847b7.jpg","description":"EARTHFALL: The end of the world is here! Emerging from the devastation of a global meteor strike, aliens swarm the landscape and ravage the planet. Everyday people must stand together and fight back with a wide variety of weapons, supplies, and defenses as they battle through the towns and wilderness of the Pacific Northwest.\nComing to Steam Early Access in early 2017 and later to PlayStation 4 and Xbox One, Earthfall is a co-operative shooter for up to four players. Using team-based tactics to fortify holdouts and complete objectives, players must work together to survive EARTHFALL!Features:\nCo-operative Survival For up to Four Players - Team up with friends to survive the alien infestation. Robust multiplayer support and A.I. teammates stand ready to ensure a full team at any time regardless of available players\nBuild Your Defenses - Strategically deploy barricades to block the enemy hordes and install turrets anywhere to create perfect alien killing zones\nPrint Your Weapons - Use advanced 3D printers to print more than twenty different weapons to use against the vicious alien enemies\nMultiple Campaigns - Each campaign tells a story across several missions, allowing players to dive in and experience diverse settings and mission types across the Pacific Northwest (one campaign availabile in initial Early Access release)\nClose Encounters of the Brutal Kind - Deadly aliens come in all shapes and sizes, from massive drones armies attacking in waves to towering behemoths spitting plasma, every experience is different, each time you play\nBattle Unpredictable Enemies - Earthfall features a dynamic spawn system providing a constant set of new challenges lurking behind every corner\nAn Unfolding Story - Every campaign reveals new content and secrets behind the world of Earthfall and the cataclysmic alien invasion","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Holospark","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":4554,"name":"Where is my Heart?","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a32/a3279cdccbf06d799211fed0a6ec7279.jpg","description":"\"In the glade, there grew a tree.\nMerry, Merry king of the woods was he.\nDeep in his heart lived spirits, three.\nDark secrets had this family.\"\nIn Where is my Heart? you play the story of a family of forest spirits. Their world gets broken up into fragments which you have to piece back together in your mind. Each of the three characters can transform into a magical creature along the way. The Rainbow Spirit allows you to rotate the world around and jump across space; the Bat King can see hidden platforms which only exist for him; the Antler Ancestor can jump on the stars. Help the three spirits find their home tree again!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Die Gute Fabrik","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":704793,"name":"The Expanse: A Telltale Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/70a/70aefcec2ce50c815534611b0cc91c60.jpg","description":"In the near future on the outskirts of the asteroid belt, a bloody mutiny breaks loose on the Artemis. You take the role of XO Camina Drummer, where your choices determine the fate of the ship. What will you do with the truth, Bosmang?\n\nIn The Expanse: A Telltale Series, take on the role of Camina Drummer (played by actress Cara Gee in both the game and TV series), the leader of a ragtag scavenging crew on the hunt for a mysterious treasure on the edges of The Belt. As Drummer, players must work with a mix of big personalities, square off against a bloody mutiny, explore locations beyond the belt, and, most of all, make tough decisions that will decide the fate of The Artemis spaceship and its crew.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":485138,"name":"The Outlast Trials","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb7/cb79272fea3ffdba3fd48d44cc78d132.jpg","description":"Set in the era of the Cold War, human guinea pigs are involuntarily recruited by the good folks at the Murkoff Corporation to test advanced methods of brainwashing and mind control. In a world of distrust, fear, and violence, your morals will be challenged, your endurance tested, and your sanity crushed. All in the name of progress, science, and profit.\nRed Barrels invites you to experience mind-numbing terror, this time with friends. Work together and maybe you’ll survive The Outlast Trials. It’s always better to shit your pants in good company.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Red Barrels","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":445453,"name":"Neversong","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07f/07f03a84baafdd5b1f73718f9fcd736b.jpg","description":"Upon waking from a coma, Peet's girlfriend is nowhere to be found. Thomas Brush, creator of Pinstripe, invites you to investigate the screams coming from the heart of Blackfork Asylum, the increasingly violent behavior of the grown-ups, and the strange truth about Peet's past in this hauntingly dreamlike fable. Discover what's lurking beyond the doorbell in this strange tale that started almost a decade ago.\nFrom Red Wind Field to the haunting halls of Blackfork Asylum, explore six moody, illustrative levels.\nFight your way through hordes of bosses, monsters, and blood thirsty grown-ups with your trusty baseball bat.\nImmerse yourself in a breathtaking piano-centric soundtrack.\nJoin your quirky child-hood pals and trusty pet bird on an adventure to discover the truth about your recent coma.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Serenity Forge","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":399411,"name":"AI Dungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e33/e333678e6e7357d762875b3dcffdabe0.jpg","description":"Imagine a world that you could explore infinitely, continually finding an endless amount of entirely new content and adventures.\nWhat if you could also choose any action you can think of instead of being limited by the imagination of the developers who created the game?\nThis is AI Dungeon.\nAny action you take, anything you choose to say, anywhere you choose to go, in any time period you want to play - there's an infinite number of adventures waiting.\nAI Dungeon is the first limitless text adventure game of its kind built with  extremely advanced artificial intelligence using a massive deep neural network at its core.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Braydon Batungbacal","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":387321,"name":"MisBits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12d/12d2cc9b08ba2343f30dd16ff4f1162d.jpg","description":"Get your head in the game because we are about to have you rollin’ on the floor! MisBits drops you onto a sandbox stage where the rules are…there are no rules. A fun, frenetic and witty multiplayer action-adventure game for warriors, builders, thinkers, explorers and creators alike – essentially players of all ages and types.\nAn extraordinarily absurd world with a bottomless chest filled with props, bodies and costumes, giving you limitless possibilities to create a showground where boundaries are only determined by your imagination. Explore. Build. Share. Compete and Battle it out. Or if you’re not ready – we’ll guarantee it’s fun to just watch, too.\nA band of zany character, thousands of collectible and customizable head and body combos, a multitude of ridiculously challenging game modes, and a toolbox that will have you droolin’.  Whether your 8, 18 or 48 MisBits is about to transport you into the biggest, the best and the most fantastical adventure. Wait? Is ‘fantastical’ even a word?!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Purple Lamp Studios","platforms":[{"id":0,"name":"PC"}]},{"id":330452,"name":"N3: Ninety-Nine Nights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8c/e8c9b1d88663100d3abe1f39435261fd.jpg","description":"The ninety-ninth night is coming","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Q Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":61486,"name":"Medieval Shopkeeper Simulator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e7/0e761d312325fbced7cbf4e2eed3b637.jpg","description":"Medieval Shopkeeper Simulator is a medieval management, exploration and adventure game currently under development by Breakfast Studio.\nCreate, manage and expand your merchant empire, explore the borders of the world and properly manage your stores to become the most important trader in the kingdom.\nManage your stores, organize your workers, deliver orders, exchange and create unique items, unlock new skills and advantages, hire warriors for adventures, explore the world, resist global events like a plague or a war, plan your financial strategy supporting or confronting the crown and the church, alter the economy of the kingdom and its laws and face consequences of your decisions.\nDepending on the king or queen that governs, there will be laws that will suit you more or less depending on your way of playing. The world of MSS reacts to every decision and even prices in stores, punishing mistakes with your reputation. Be careful and make wise decisions, visit the seer to reveal future events and prepare yourself to them.\nNow that we move to the alpha stage, you can expect the following content in the coming months:\nMORE REAL LAWS\nFor now there are only a few types of laws such as the prohibition of the sale of some objects. In the future, each king/queen will be a unique event that will have a lot of weight in the balance of the game and your way of playing. (Second quarter of 2018).\nCUSTOMIZATION OF HOUSES\nYou can combine different models acquired in the architect to create your dream house. (First quarter of 2018).\nSTORAGE REFACTORING\nThe management of objects will become a totally new and improved game mechanic: players can organize their stock of objects as they wish. Do you need more space to store objects? Buy and improve an empty warehouse in the city. (First quarter of 2018).\nKINGDOM 2.0\nA new generation system by a procedure that will improve performance and allow you to explore in each game a new, different kingdom. These new realms will contain more diverse buildings, specific events, more characters and much more. (Second quarter of 2018).\nCLIMATE AND DANGERS\nA totally new system that challenges players during the gaming experience. Confront the environmental effects by preventing them or fighting with different global diseases and neighboring wars. (First quarter of 2018).\nKNOWN ISSUES:\nThere are some problems you might experience in the Alpha version of the game:\nbugs\nfreezing\nloss of saved games\nIf the essential game mechanics is attractive and you want to give your support to Medieval Shopkeeper Simulator while you are in early access, we would love to have you. Otherwise, we recommend waiting until MSS exceeds the alpha stage when the game is more stable, and the game mechanics are more developed. I am committed to converting Medieval Shopkeeper Simulator into the best possible game, and your help during this early phase of development is crucial for us to achieve our goal.\nIf it intrigues you to know where we will take Medieval Shopkeeper Simulator, consult our roadmap and the development vlogs that I publish several times per month.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"David Moralejo Sánchez","platforms":[{"id":0,"name":"PC"}]},{"id":49604,"name":"Unforgiving - A Northern Hymn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9c/e9c09f38028ef0cc702669d20eb6bfdb.jpg","description":"You may think you know your limits – what evils you might be willing to commit to save yourself.\nAre you ready to find out what you are capable of? Are you brave enough to face the darkness in your soul?\nNot only are the old stories true, but the things that crawl in the shadows are more wretched than you could have ever imagined.\nThe whispers of the northern woods pick at your sanity. Your fingers tremble as you light your final match, body shivering from dread. Do you sense them hunting for you? Can you feel them hunger for your last breath?\nYou can feel his eyes on you, sitting at the water's edge, watching as he plays his infernal violin…\nWhen you cross the line and enter that unforgiving place, what will you do to save yourself?\nCan you even be saved?\nAll the stories being told to scare children are actually true. The Swedish folklore is real and it's coming for you!\nUnforgiving - A Northern Hymn is a first person horror game is heavily inspired by Swedish folklore and the Nordic mythology to create the nightmares that's been haunting Swedish children for many generations.\nFeaturing:\n- Traditional Swedish environments filled with some of the most famous creatures from Swedish folklore.\n- Intelligent AI choosing it’s own paths instead of patrolling on the same routes over and over.\n- 4K support.\n- Joy for explorers with open world areas and plenty to discover and inspect.\nBe warned!\nThis game contains gore, violence, nudity and strong language! Hope you enjoy!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Angry Demon Studio","platforms":[{"id":0,"name":"PC"}]},{"id":45902,"name":"Treadnauts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f2/8f2050b4108a0995b6c7111f218fe442.jpg","description":"Treadnauts combines frantic group combat with a kiss of physics-based finesse. Players fight as colorful tanks in bright, tactical playgrounds. By moving with chutzpah™, pilots can pull off spectacular acrobatics, soaring through the air and raining deadly mortar shots on their foes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Topstitch Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":45712,"name":"Insidia","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2aa/2aa24da39c8324eeb5bbc10e518b5537.jpg","description":"INSIDIA is a tactical game of swift and frantic duels. Assemble your team of four champions from a roster of steam knights, fierce punks, odd mutants and other survivors of a post apocalyptic fantasy world, then claim victory in the battlefield. Never let your guard down: simultaneous turns and a flexible combo system will always keep you plugged into the action!\nWhen playing INSIDIA, it’s always your turn! Issue your orders in a handful of seconds, then watch your strategy unfold.\nBlend your champions’ abilities to deliver devastating blows.\nINSIDIA is not a simple deathmatch. Seize critical locations to control the battlefield and then lay waste to your opponent’s base.\nFight for glory in less than 15 minutes!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bad Seed","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":40434,"name":"Microsoft Flight","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/70f/70ff795ea915addc4b23fc93ba69a28d.jpg","description":"Experience the thrill and wonder of flight with Microsoft Flight. This free download gives you the opportunity to explore the skies over the beautiful Big Island of Hawaii in the state-of-the-art Icon A5 or the classic Boeing Stearman. Enjoy hours of gameplay with a variety of exciting missions, challenges that will test your skills, and hidden Aerocaches that will give you yet another reason to explore.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Microsoft","platforms":[{"id":0,"name":"PC"}]},{"id":39120,"name":"Star Ocean: The Last Hope","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/694/69466a321bb34e8b16fdf28a14bbd1b6.jpg","description":"The year is A.D. 2087. In the aftermath of World War III, Earth has been ravaged and the population decimated by a deteriorating environment. The countries that survived have joined together to form the Greater Unified Nations and turned their eyes skyward...to space. Edge Maverick and his childhood friend Reimi Saionji are chosen as pioneer members of the Space Reconnaissance Force, which was created to seek out new worlds beyond the stars. Their ship, the Calnus, takes its place on the lunar launch pad along with four other starships of the first reconnaissance fleet. These ships - humanity's last hope - blast off one-by-one and sail into the awaiting wormhole that leads to the vast star ocean. And so, Edge and his crew begin their voyage in search of a new haven for humanity...and a second chance.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Tri-Ace","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":25396,"name":"Apollo Justice: Ace Attorney","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ac/1ac8e4433f332827a52aa43b3786d737.jpeg","description":"Court Is Back In Session\nStar as rookie defense attorney, Apollo Justice, as he visits crime scenes, questions key witnesses and collects vital evidence before stepping into the courtroom to prove his clients’ innocence.\nFeatures:\n·       All-new high-resolution graphics\n·       A new touch screen interface\n·       Interactive forensic testing mini-games that allow players to reveal hidden clues by dusting for prints, testing for traces of blood, and other exciting techniques.\n·       Two distinct gameplay segments:\no   Investigation phase – survey crime scenes, interview witnesses and gather forensic evidence that will be used in court\no   Trial phase – present findings from the investigation to support your case, listen to testimonies and examine witnesses\n·       An eclectic cast of characters:\no   Apollo Justice: Stepping into the shoes of Phoenix Wright, the new rookie attorney leads the series into an exciting next chapter\no   Klavier Gavin: Lead prosecutor, Apollo’s nemesis and rock star legend\no   Kristoph Gavin: the coolest defense attorney on the judicial circuit, and Apollo’s mentor.\no   Trucy: A mysterious magician and Apollo’s assistant\nThe initial purchase price includes half of episode one.  The remaining episodes can be acquired through in-app purchases\nRecommended Devices:\niPhone 5, iPhone 5s, iPhone 5c, iPhone 6, iPhone 6 Plus, iPhone SE, iPhone 6s, iPhone 6s Plus, iPhone 7, iPhone 7 Plus, iPod Touch (6th Gen）, iPad（4t Gen）, iPad Air, iPad Air2, iPad mini2, iPad mini3, iPad mini4, 9.7 Inch iPad Pro, 12.9 Inch iPad Pro\nRecommended iOS:\nOS：iOS7.0～iOS 10.0.3\nIt may be possible to download the game on a device that is not officially supported.\nPLEASE NOTE: “Apollo Justice: Ace Attorney” offers some optional in game content that requires payment. You can turn off the payment feature by disabling in-app purchases in your device’s settings.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":21543,"name":"Max and the Magic Marker","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/684/684b2390f44126ac15a7fd59a3b65d47.jpg","description":"Something incredible is happening in this unique adventure! Max just drew a terrifying monster with his new marker and now it's alive and wreaking havoc in his drawings! He doesn't have any choice but to stop the monster if he wants to save his pictures. In a new kind of gaming style, Max & the Magic Marker combines tried-and-tested 2D jump n run feel with the innovative option of directly influencing the level design. Here, Max is able to change every level with his magic marker so that all obstacles can be overcome, traps avoided and puzzles solved in order to send the monster back to where it came from.\nKey features:\n15 innovative and challenging levels\nUnique influence on the gaming world with the virtual painting marker\nThree lovingly designed worlds, based on children´s drawings\nInnumerable traps, monsters and tricky puzzles\nChallenges, secrets and rewards can all be unlocked\nFantastic soundtrack from the well-known Indie band genre\nMulti-Awards Winner\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Press Play","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20201,"name":"OTTTD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a0/2a0c1dda283dd5ec8159a0ee3465eea7.jpg","description":"Lock, load and let the gibs fly in OTTTD, a Tower Defence/RTS game with RPG elements that pits you against some of the weirdest creatures in the multiverse.\nOTTTD stands for Over The Top Tower Defence, and you'll see why when you're blasting 9 kinds of hell out of a Cactus Ghost that's making a beeline for your battlefield HQ. You play as a commander for HEROCORP™, the 4th largest private military organization in the galaxy. A long period of peace has left the company coffers a little bare so the science division developed Trans-Dimensional Rifts, opening up lucrative opportunities for war in other universes. It's like Starship Troopers meets Stargate meets Spaceballs, with way more explosions!Features\n•    Ridiculously definitive edition\nPrepare your eyes and ears for incredible deluxe-ness! Featuring crisper sound and high resolution graphics, the PC release of OTTTD will leave you feeling like you've actually stepped into an alternate universe and started blasting everything to smithereens.\n•    Deep RPG Mechanics\nOTTTD lets you choose from 7 hero classes to make up your squad of 3 battlefield employees. The more action they see the more XP they earn, giving you the chance to level them up through custom skill trees, including powerful combat abilities to unleash during the fight.\n• 30+ active abilities\n• 40+ passive skills\n• 30+ equippable weapons\n• multiple armor options with stats to suit your play-style\n•    Weapons! Weapons! WEAPONS!\nWith 12 tower types to build and 6 different firearm classes, HEROCORP™ has got the hardware to ensure you can wreak havoc in your own personal style.\n•     Disgustingly varied foes\nThe range of enemies in OTTTD is wide enough to soothe even the itchiest trigger finger. Floating eyeballs? Check. Gunclams? You know it. Giant armored Wartoises? Of course. You'll even go toe to fin with a giant flying shark, and show the mythological Kraken who's boss!\nThe Story\nThe year is 2136. You work for HEROCORP™, the universe’s 4th largest private military force. Your job is to “preemptively defend” the Earth against alien dimensions. As long as you complete the missions under budget and fill out the TPS reports in triplicate, everything goes smoothly.\nIs pre-emptively defending Earth ethical? Who cares when the money’s good!Deluxe Edition\nHEROCORP understands the needs of the more discerning battle commander, hence the Deluxe Edition of OTTTD. In addition to everything in the pre-order, you'll get the Deluxo weapon and armor sets. Recently developed by our Lab Division, the Deluxo Range gets more powerful each time your soldier levels up, making it worth its weight in requisition forms. We'll also throw in a Deluxe Wallet, with 69,000 coins and 11 medals to buy yourself something nice.\n• Dexluso Armour - Armour that gets stronger as you get stronger\n• Dexluso Gun - Gun that gets stronger as you get stronger\n• Deluxe Wallet - 69,000 starter coins and 11 starter medalsOTT Edition\nIn addition to everything in the Deluxe Edition, the OTT edition comes with rare Cheese Armor set forged by our Dairy Division, which helps your soldiers get more XP and coins on the battlefield.\nYou will also receive these bad boys:\n• An Art Book PDF, full of concept sketches plus more visual treats.\n• OTTTD poster artwork. Looks amazing on 100% of walls.\n• 3D Printer files for the HEROCORP soldiers, so you can battle command IRL.\n• Your name in the credits as an OTT supporter. Welcome to history, baby.\n• An OTT Wallet stuffed with 101,010 coins and 42 medals, to give you the financial edge on your enemies.\"\n• Bonus Armour - “Vintage Combat Cheddar” - 20% XP bonus and 5% coin bonus","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SMG Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19612,"name":"RC Cars","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a2/9a216f3901dbc647e295ae16a21b7270.jpg","description":"R.C. Cars is an exciting arcade racing game featuring the world of highly realistic toy radio controlled cars. Jump, accelerate, perform acrobatic feats in the air, and bounce on big hummocks, pits and bumps while contending with opponents for victory. Win prize money for placing in the race, purchase car upgrades and participate on further tracks!\nIntroducing magnificent physics engine, three types of unique racing vehicles and ten off-road levels closely reproducing the real world, R.C. Cars is a real challenge! In the world of R.C. Cars participate in championship, quick race or ghost race. From looped tracks in different environments to real-life obstacles and outstanding off-road abilities, maneuverability and boost capacity of the realistic looking vehicles, R.C. Cars is a truly amazing racing/driving experience!Key features:12 characters - each one with her own skills and motivations\nPhysics engine outperforming the majority of car simulators currently on the mass market\nFully interactive environment\nChallenging tracks\nUnique toy racing vehicles\nVarious upgrades and bonuses\nMultiplayer support via LAN/Internet","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Creat Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16740,"name":"Delta Force: Land Warrior","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b2/0b21999bd3c7f889ee6fa3a2a1f5ab98.jpg","description":"Engage the enemy across vast outdoor environments and expansive indoor environments as you take control of the US Army's elite anti-terrorist unit. Delta Force Land Warrior™ introduces new weapons and characters for both single player and intense online multiplayer via NovaWorld.\nSelect from a team of diverse characters, each with their own special abilities. (Sniper, Demolitions, Close Quarters Battle, Aquatics and Heavey Gunner)\nAdvanced new rifles, systems, machine guns and grenade launcher\nDeveloped from the same engine used to train the US ARMY elite Land Warrior Soldiers\nWage war on the massive battlefields of NovaWorld with up to 50 players simultaneously\nRank Yourself against your enemies and allies on NovaWorld","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"NovaLogic","platforms":[{"id":0,"name":"PC"}]},{"id":16607,"name":"Idol Magical Girl Chiru Chiru Michiru Part 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/018/0188acffc1c488df6a8ca12218292d24.jpg","description":"Matsushima Michiru is a loved, respected, nationally-famous idol, worthy of singing on the same stage as the legendary Kazami Kazuki... in her own dreams, at least. In reality, she's a complete nobody, only able to perform in a dingy basement bar on the weekends for crowds numbering in the single digits.\nOne night, while sulking about the real world's inability to live up to her fantasies, Michiru sees a shining star falling from the sky. She tries to use it to wish for the fame and admiration she's always dreamed of, but what crashes down on her is not the glamorous life of a Top Idol, but rather a black cat from the World of Magic, Nyanmel. Nyanmel's request: \"Become a Magical Girl, and save the world!\" But can Michiru really handle that kind of responsibility?\nThis visual novel, a spinoff of the popular \"Fruit of Grisaia\" series, follows Michiru's adventures in an anime-like format of 13 episodes. It is split into two Parts: Part 1 contains the first 7 episodes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frontwing","platforms":[{"id":0,"name":"PC"}]},{"id":16497,"name":"Skyscraper Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/496/49609eea7d4ac8027bce80e936d369ef.jpg","description":"You're a constructer and you’ve specialized in the \"bringing up\" of skyscrapers. Due to your specialization over the years you constantly get new orders for higher and higher skyscrapers in town. Within your responsibilities are the planning, the supply with construction materials and the worker management.\nIn the beginning you are dealing with multi-storey town houses, but later on you find yourself in realizing magnificent buildings for the rich and famous. A level is considered to be solved, if, within the specified time, the received contracts and tasks have been fulfilled.\nDuring the game the player receives more and more new tools, machines and experience points. On the hunt for the high score, the game can be played with friends too.FeaturesDetailed scenery in 3D graphics\nDetailed skyscraper models\nFully animated machinery\nPlanning, human resource and machinery management\nLong lasting fun factor due to highscore function\nIntuitive control via keyboard and mouse\nTutorial for beginners","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16432,"name":"Salammbô: Battle for Carthage","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c29/c29a5a427599034a9b9e02ccf00e29e2.jpg","description":"It's the 3rd century BC, despite being supported by thousands of mercenaries, Carthage has just been overrun by its sworn enemy, the Romans, during the first Punic War. In the midst of the killing, Salammbo, the daughter of the commander of the Carthaginian forces, falls in love with the leader of the mercenaries, Matho, who is laying siege to the city as he demands payment for his services.\nInspired by the novel of Gustave Flaubert and the works of Phillippe Druillet, Salammbo: Battle for Carthage puts you in the middle of two of antiquities greatest powers. Can you deliver Salammbo's message before it's too late?\nWhether crossing gardens full of poisonous fumes or unleashing hell on Mount Solitude, the world of Salammbo is a dark one\nGet immersed in the 360° panorama of the dark and dangerous world of Salammbo, accompanied by the powerful score from Dvorak's epic \"New World Symphony\"\nA series of 3D frescoes forms a unique player's journal summarizing the adventures and providing a new insight into ancient History","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cryo Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":15981,"name":"War of Beach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/099/099a7fe5eec2941820436def3bb17689.jpg","description":"War of Beach is a strategy game in which you are to rule your own Island-State.\nAs the ruler of your island, you are to plan your economy and optimize the layout of your island.\nBe careful though, some people might not like your success.\nDon`t let your guard down. Wealth will always attract enemies.\nPrepare your defense for anything that might try to invade your island.\nWhile you’re at it, you might wish to retaliate with an army of yours.\nWhy not pay them a visit?\nGame Features\n- Create your own island and plan its defenses\n- Plan, manage and improve your economy\n- Choose from a variety of defensive buildings and different troop types.\n- Defend yourself from other players or start raiding them\n- Skill will be more valuable than anything else\n- Achievement system\n- Explore your island and its surroundings","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"LUCKY GIRLS","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15702,"name":"Pixel Gladiator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6f/b6ffa9eb95dde8645c81b863cc43d9b5.jpg","description":"Distant future…\nBrutal gladiatorial battles is a top-rated show, extremely popular all over the Universe. You’ve been sent to the abandoned planet as one of the participants of the show. Your goal is to survive as long as possible, fighting back deadly creatures in the focus of billions of viewers.\nKill your enemies to earn the money for weapons and upgrades. You are funded by your audience, so you have to keep yourself admired by slaughtering the monsters.\nTake the challenge and come out victorious from a blood bath with ferocious beasts! Become a champion of the show, full of blood, pain and insensate cruelty. Morituri te salutant!\n-Unique weapons and player upgrades\n-Turrets and traps to maintain security offscreen\n-Treacherous and deadly bosses\n-Fight on cameras to gain more money","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Durbek13","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]