[{"id":15889,"name":"Lunar Flight","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f9/3f9e59ec89657c926b2f7ed0126d37f4.jpg","description":"Explore the most realistic and beautiful realtime simulation of 'Lunar Flight' in this unique and challenging game. Experience the heart pounding sense of dread as you deliver supplies to moon bases with only seconds of fuel to spare!\nA modern take on the classic arcade game, Lunar Lander, Lunar Flight extends the experience to a fully fictionalized and accessible lunar module simulator providing a variety of mission types involving transporting cargo, acquiring data at survey locations and locating lost cargo.\nCompleting missions earns experience points and money to be used to refuel, repair and upgrade the lunar module. In addition to missions there are time trial challenges complete with online leader boards and a globally ranked ‘pilots’ leader board, ranked by experience. To round out the game there are a variety of achievements to provide additional challenges and objectives.\nWhen you think you've got what it takes, head online and go head to head in deadly combat against the best pilots in the world in Lunar Flights Multiplayer mode.\nA truly unique and challenging flight simulation experience, Lunar Flight will give you many hours of immersive, addictive and rewarding gameplay.Key featuresTrack IR Support\nAuthentic Newtonian space physics\nAddictive, challenging Simulation\nEarn money and experience from Transport, Survey & Lost cargo recovery missions\nPurchase Upgrades and Action items for the Lunar Module\nOnline Time Trial and Pilot Experience Leader boards\nOnline Multiplayer with Weapon Systems\nRandom mission generation\n51 Achievements\nSpectacular graphics and effects\nAward Winning Soundscape\nUnique Quad view display\nComprehensive Replay System\nDefault X360 Controller Support\nSupport for multiple Input Devices (HOTAS)","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Shovsoft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14856,"name":"Stone Age Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab3/ab353572470a90cc0a838b759879e6a4.jpg","description":"Stone Age Wars is an RPG arcade game where you assemble a team of prehistoric soldiers, each with unique abilities and go up against waves of vicious enemies.\nYou activate their power ups by drawing symbols on the screen as perfect as you can with your cursor.\nPlay with 15 different classes, upgrade them to improve their strength, armour and speed and equip them with all kinds of weapons and masks which give you special bonuses.\nFight 10 unique bosses and earn valuable treasure chests!Features88 waves of enemies including 10 boss missions\nOver 100 pieces of equipment for your soldiers\n15 different classes\nUnlimited upgrades\nFight 10 unique bosses and earn valuable treasure chests!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Permafrost Studio","platforms":[{"id":0,"name":"PC"}]},{"id":13414,"name":"Laraan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/591/5910b34beada14e8a437c0a5dd0f8508.jpg","description":"Laraan is experienced best when using a controller. A Windows or Xbox game pad is ideal.\nLaraan is a Science-Fiction game about exploration in a desolate world. Created with a minimalist low poly style. Accompanied by a splendid movie soundtrack.\nYou’re about to enter an old world of computer entertainment. Laraan bridges the gap between Cinema and Action/Adventure games with a completely old style of fluid, cinematic storytelling. Laraan is experienced best when using a controller, a Windows or Xbox game pad is ideal.\nUsing a completely old graphic system of cinematic zooms, pans, close-ups, and cuts, Laraan gets you involved in a breathtaking story of inter-dimensional travel.\nYou’ll duck as lasers saber, boulder crash, and monsters roar. The complete musical score and realistic, digitized sound effects will make you feel like you’re on a movie sound stage.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Flynns Arcade","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11693,"name":"CAT Interstellar","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d82/d820b4f07efdb3dc7e97f98b0241d44a.jpg","description":"Warning: This is a short story ~ 1 hour long that is meant to be played in a single sitting.Play as a DOG-VI drone, a newly activated maintenance bot, who is assisting in the terraforming effort on Mars. After a predictable yet unfortunate accident DOG finds himself uncovering the past of a seemingly barren planet.StoryWe're trying to bring the \"science\" back to science fiction. We also wanted to explore a scenario humanity might really encounter on the first planet we aggressively try to terraform.https://ionizedgames.com/Visit the webpageHttps://www.facebook.com/ionizedgamesCheck Out Our Facebook PageContact@ionizedgames.comOr Contact Us Here","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ionized Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":4675,"name":"Magic: The Gathering - Duels of the Planeswalkers 2012","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/512/51215850b921d64c2d558dc7acdb9f6d.jpg","description":"All-new and redesigned, Magic: The Gathering — Duels of the Planeswalkers 2012 takes last year’s massive hit game to even greater heights with better graphics, more options, and new challenges!\nFace off against the AI, or gather your allies for the new multiplayer format: Archenemy, where you team up to take down a boss opponent. And if one of your fellow Planeswalkers drops out, no problem–the AI will drop in for uninterrupted action!\nFeaturing ten unique decks, Duels of the Planeswalkers 2012 also lets you customize those decks. As you progress in the game, you can enhance your deck by swapping in new, unlockable cards!\nGather your allies. A challenge awaits.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Stainless Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":962024,"name":"Stray Gods: The Roleplaying Musical","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c24/c24aa67a5df2cb32ff405a2cae868dc8.jpg","description":"Gods. Romance. Murder. Musical Numbers?! Play as Grace in a world where Greek Gods live in hiding among us. Change your fate as you draw friends, foes & lovers into song using your powers of musical persuasion to unravel the mystery of the Last Muse's death.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Summerfall Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":42234,"name":"Tekken Revolution","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c2/3c22f68c6b5b84ce03aebad1122790cd.jpg","description":"Tekken Revolution is a spin-off installment in the Tekken franchise of fighting games. It was released exclusively for PlayStation 3 and discontinued since 2017. The game was the first in its series to introduce a free-to-play model. It was targeted towards new and casual players.\n\n###Gameplay\nThe player controls a character and fights other characters, controlled either by AI or by another player, in one-on-one arena battles. Tekken Revolution features 29 characters, but only eight of those are available from the start. The rest have to be unlocked by winning fights or by purchasing. The game introduces only one new playable character, Eliza the vampire. There are the traditional Versus and Arcade Modes in the game. Tekken Revolution also allows both local and online multiplayer. \n\n###Differences from the previous games\nThe game is heavily based on Tekken Tag Tournament 2 and features some of the character animations and backgrounds from this game. However, Revolution also introduces several new mechanics. There are two new types of moves called Critical Arts and Special Arts. The back walking was also sped up. \n\nTekken Revolution was the first game in the franchise to feature skill upgrade and leveling up. Each time the player gains a level, he or she may use four Skill Points to enhance his or her favorite fighter's Power, Endurance, or Vigor. The player can also purchase them with the in-game currency.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":30745,"name":"Dune II: Battle For Arrakis","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d93/d93268b78fd61979a9c80133082185a3.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Westwood Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"}]},{"id":28462,"name":"Pac-Man C.E.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc0/cc035b82249521dbd232b975b80a1b95.jpg","description":"Purchase the full version of Pac-Man Championship Edition. With new and unique gameplay features, including six game modes, a time limit, constantly evolving mazes, and enhanced graphics and sound! Practice hard and play well to experience increased gameplay speed! Experience the evolution of Pac-Man! There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":21515,"name":"Blackwell Epiphany","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57c/57cbfc6bb359059ed2fc18cba79f3195.jpg","description":"A dead man’s soul cries out against the force of a ferocious blizzard. He cries for help. He cries for answers. Then he screams as he is torn apart like damp tissue paper.\nThis wasn’t the first time, and it won’t be the last.\nThe police are powerless to stop it, so the duty falls to the only ones who can. What force could be so powerful – and so malevolent – that it would destroy the very core of a life in order to get what it wants? Rosa Blackwell and Joey Mallone mean to find out, even if it means risking themselves in the process.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19179,"name":"Sparkle ZERO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de5/de5e69068c71d9ecd33d62339f6cf6e7.jpg","description":"Before you play Sparkle ZERO please be aware that this game contains no tutorial. You will be left to explore the world alone, learning to climb the evolutionary ladder.\nThe blue whale is the largest living organism on Earth today and can reach a length of 33 meters. Evolution comes a long way to develop such large and powerful organisms and that evolutionary journey always starts from much smaller creatures, like those the Blue Whale now eats; which can be up to 4 tons a day.\nGo back to the beginning of evolution. Start from ZERO and become the smallest creature – a spark of life - which has endless development paths ahead of it. Your task is to find food, which helps to grow and develop. But be careful, you are not alone on your climb to the evolutionary peak. Many other organisms also fight for the same resources and development opportunities.\nEvolution is rich in variations, some of which are not favorable for survival, leading to defeat by better suited organisms.\nBe the best, the biggest and the most efficient. Become the ultimate sparkle of them all.\nFill the gallery of amazing creatures – the results of countless evolutionary variations.\n- Visionary graphics\n- Amazing atmosphere highlighted by mood music\n- A complex evolution system for organisms with;\n- Variety of organisms that populate the different layers of the world\n- Gallery of the most interesting sparkles","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":18404,"name":"One Manga Day","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37d/37d7db9cb48b82365da747bf889344e4.jpg","description":"Manga are comics created in Japan. The problem for most people is, as they're made in Japan they're only produced in Japanese; someone has to translate them to English! Is one man able to accomplish this? Is there more to his team's relationships other than business? Can everything in a translator's life be simple and clear?\nGirls in swimsuits. Everyone likes girls in swimsuits!\nUnique graphics, story, music. All was made especially for this game.\nFour endings: 2 bad endings, one normal and one good.\nTwo languages: English and Russian.\nAchievements: To get all 12 achievements you need to play about an hour or two.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DeXP","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17798,"name":"Ascension to the Throne","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fe/6fe5c9ac8424a28d69d22b8606f96b48.jpg","description":"Ascension to the Throne is a turn-based strategy game with RPG elements. In a vast fantasy world the hero will have to pass many tests on his way to victory. Enemies seek to stop players from regaining power and taking revenge. Gain new friends to aid you in reclaiming the throne. Become the King you were born to be - wise, brave and courageous.\nPlayers will act as the last offspring of the ancient family Illiar, which has ruled Eden for ages. But times have changed and traitorous enemies attacked the castle. They slaughtered the prince's family and destroyed the settlement, but they didn't crush his will. A very powerful spell cast by a magician threw the hero far beyond the borders of the country. He was on his own - without relatives, friends, army and without money. He lost everything he was proud of but still he was alive and chose the path of vengeance.\nPlayers will explore a new fascinating world, full of foes and friends. They will have to crush hordes of enemies and find new followers to regain the title and ascend to the throne.Key features:Open ended non-linear gameplay\nCombination of real-time movement around the game world and turn-based battles\nLarge-scale tactical battles. Up to 22 squads (up to 16 units in each)\nPlayers are not bounded by separate missions. They can go to any part of the game world and explore it. The game world is integral and players are free to choose any direction\nOriginal concept. The Hero is the player, and instead of giving orders and watching the battles from a safe place, he participates in them by himself. But remember, that you can easily loose your Hero in the heat of a battle","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"DVS","platforms":[{"id":0,"name":"PC"}]},{"id":4755,"name":"Disney's Hercules: The Action Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa4/fa470a3732f428efb79ca5ce24854253.jpg","description":"You're Hercules and you've just entered an ancient universe alive with danger. Move fast and fight faster. Do mortal combat with the vicious Hydra. Dodge swinging death traps. Outsmart the snake headed Medusa. Conquer the evil Hades. Ascend Mt. Olympus and become a god. Think you have what it takes to be a hero? Prove it.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Eurocom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":4130,"name":"Dogfight 1942","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f4/3f4eff95f344b9efd0a961c1f02e0e10.jpg","description":"Piloting a wide range of aircraft, players engage in aerial dogfights and dangerous fighter missions across the major theaters of war during WWII. Featuring realistic aircraft, DOGFIGHT 1942 introduces cutting-edge flight dynamics with unprecedented arcade accessibility. Fly over 40 historically accurate planes, ranging from the fabled P-38 Lightning and Britain's Spitfire, to the feared Messerschmitt 109 and Japanese Kate.Key Features\nAERIAL ARCADE AUTHENTICITY\nExplosive arcade action alongside advanced physics and painstaking recreation of actual events and aircraft creates an experience that’s easily accessible but hard to master\nAll aircraft are based on authentic models and all combat missions are representative of actual WWII engagements\nFun, dynamic battles offer a wide variety of action and most importantly targets to destroy – any given battle will combine dogfighting, escort missions and ground assaultDOMINATE THE SKY WITH FRIEND IN 3 UNIQUE CO-OP SPLIT-SCREEN MODES.\nDogfight Mode - Fly against a friend in head-to-head aerial combat, to determine who is the top Ace.\nSurvival Mode - Fly with your wingman battling countless waves of enemies.\nCampaign Co-op Mode - Fly with your wingman through various Co-op campaign missions fighting the Axis Alliance.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"City Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":270713,"name":"LEGO Star Wars II","genre":"Family","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30a/30aada774a1358add442a966d33b5adb.jpg","description":"LEGO® Star Wars® II: The Original Trilogy reunites the fun and endless creativity of LEGO with the epic story, heroic characters, and exciting action of the Star Wars universe. In this highly anticipated follow-up game, follow the tongue-in-cheek, brick-based action through all three epic films of the original Star Wars Trilogy.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":64111,"name":"KIDS","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf5/bf5ecc8bdd7dc05c67f91f5321067804.jpg","description":"KIDS is a short interactive animation drawn by Michael Frei and coded by Mario von Rickenbach.\nKIDS their second collaboration after the award-winning project PLUG & PLAY.\nKIDS allows you to move with and against crowds until everyone is gone.\nPlay time between 15 - 30 minutes.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mario von Rickenbach","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":58927,"name":"WWE 2K19","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1c/d1c1b52e9ee800c2d434d25afa3cf487.jpg","description":"WWE 2K19 is a game based on the World Wrestling Entertainment pro wrestling staged fights. It is the twentieth installment in its series.\n\n###Gameplay\nThe player controls a wrestler and fights another wrestler on an arena. Unlike its predecessor, WWE 2K18, WWE 2K19 abandoned all attempts to create realistic wrestling simulation. Instead, it features a more arcade, fast-paced gameplay. \n\n###Characters\nThere are more than 20 playable characters in the game. All of them are based on the real World Wrestling Entertainment fighters, both male and female. The roster is not based on a particular championship and instead features wrestlers from both present and various eras of the past. It includes such wrestling stars as Undertaker, The Rock, Stone Cold Steve Austin, and Triple H. The player can also create a completely new, customizable wrestler.\n\n###Modes\nThere are many modes in the game, aimed at both single and multiplayer experience. The main mode is MyCareer, which follows the rookie wrestler created by the player as he eventually becomes a WWE star. His coach is the fictional Barron Blade, who also appeared in earlier games. The game also features multiple “Towers” modes, such as MyPlayer, WWE Towers, Gauntlet Tower, and Steps Tower. Each of the “Towers” is a series of challenges with mode-specific rules. There's also Showcase Mode that follows the career of a specific wrestler, this time it's Daniel Bryan. WWE 2K19 also reintroduces The Road to Glory mode.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":37851,"name":"Shadowgrounds: Survivor","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5bb/5bb6b09c84027d979a46affaba10fc7c.jpg","description":"Shadowgrounds: Survivor is the sequel to Shadowgrounds (2006). It is a near future science fiction game with a top-down view.\n\n###Plot\nThe game is set on a space colony on Ganymede, the moon of Jupiter, during an alien invasion. The player controls three main protagonists, and each of them is introduced at a certain level. The first playable character, Luke, is a space marine, who is searching for the survivors after the invasion. The second is Bruno, nicknamed Napalm, who is a pest control specialist trying to get to the New Atlantis colony. The third is Isabel, a female sniper who tries to warn the colony of the approaching enemy army.\n\n###Gameplay\nThe sequel is similar in many ways to the original Shadowgrounds but also has its distinct features. Unlike its predecessor, Survivor has a stronger emphasis on action rather than plot. The game features fewer quests to complete and more straightforward levels that the player needs to simply walk through to the end. However, the sequel also introduced a typical role-playing skill mechanic that allows the player to improve the characters abilities. The player can also upgrade his or her weapons, some of which are new, but most are the same as in the original.\n\n###Survival mode\nThe game introduces a new mode in which the player has to survive alien attacks for as long as possible. In this mode, the player gains points both for killing enemies and staying alive. The maps only become available in the Survivor mode after you complete them in the story mode.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Frozenbyte","platforms":[{"id":0,"name":"PC"}]},{"id":36455,"name":"Tom Clancy's Rainbow Six: Lockdown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd7/fd74d7638cdffde34aa8b7ccdd9791f7.jpg","description":"Engineered specifically for the PC by Red Storm Entertainment, Rainbow Six returns to deliver the tensest close-quarters battles ever experienced online. In this episode, Rainbow faces independent terrorist threats, tied together by one common element - the Legion virus. Rainbow must determine the connection between the terrorist threats and the virus.\nChange in story and mission composition - Rainbow faces independent terrorist threats tied together by one common element - the Legion virus. Rainbow must determine the connection between the terrorist threats and the virus.\nEnhanced tactical gameplay allows you to immerse yourself in tense close-quarter combat, where split-second decisions mean the difference between life and death.\nSuperior multiplayer experience - Rainbow Six Lockdown™ has the total multiplayer experience, including a revolutionary class-based mode where players choose from four specialized operative classes, each with unique gameplay advantages.\nAdvanced weapons and equipment - Complete your mission with all of the tools of the trade including new items like lock fusers, laser trip mines, and the deadly virus grenades.\nNew \"classic\" maps - Rainbow Six Lockdown PC provides nine maps including three new \"classic\" Rainbow maps voted on by the fans.\nTension-building sound effects (creaking floorboards, whispers and hostages begging for their lives) hint at a threat around every corner.\nIncreased visuals - All levels contain increased visuals, accomplished by increasing resolution of textures and increasing polygon counts. In addition, lighting of spaces dramatically improves the visuals of the game.\nAll new user interface includes new radar element added to the in-game HUD - part of the motion sensor vision mode.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"}]},{"id":20009,"name":"Lost girl`s [diary]","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ee/2ee61302fe22cb3133375a48e556bced_3HFFhT2.jpg","description":"Kinetic visual novel «Lost girl’s diary»\nDescription\nIn a snowed hotel, far-far away from city hustle, a group of girls are having their vacation, alone. What would a group of girls do on a dark Christmas night? Of course, fortunetelling! Unfortunately for them, their boyfriends are not about to leave them alone and their sudden visit totally ruins their plans for fortune telling, turning it into a scary story contest.\nGenre: Horror. These stories could only scare children.\nPlaythrough time: About an hour","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SmoleVN","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18430,"name":"Wild Island Quest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/218/2187d4aaeebc5e709e6b1716e50f9b1c.jpg","description":"Project description\nWild Island Quest is a visual novel about the adventures of the teenagers on a dangerous island.\nYou can go to the Wild Island with the main characters and delve into a deadly adventure. Take one or a few friends with You, but keep in mind that all characters have their strengths and weaknesses, so the end of Your journey will depend on Your choice. Preparing for the trip, thoroughly plan your actions, take only what You really need. Any detail can be vital.\nEnjoy the Wild Island's nature and beware its inhabitants!Main featuresNon-linear plot\nDifferent endings\nPossibility to travel alone or with friends\nEvery character has their strengths and weaknesses, and can give benefits or be a burden.\nUnique picture to every location","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NLB project","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16797,"name":"Team Indie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42c/42ce7c2689584af4148b878ce7876daf.jpg","description":"Team Indie unites indie video game characters into one play experience. You will play co-op with your own prior runs and bend time to get through puzzles and action sequences. Characters like CommanderVideo from BIT.TRIP RUNNER or Clunk from Awesomenauts join forces, each one with their unique skill to cooperatively get through the jump ‘n run levels.\nPlay 10 different indie characters with their unique skills!\nMerging action 2D platforming with interesting puzzles in a beautiful world!\nCooperate with your own prior playthroughs by manipulating time!\nOver 50 levels and 3 boss fights!Team Indie Character Lineup\nCommanderVideo from BIT.TRIP Presents... Runner2: Future Legend of Rhythm Alien by Choice Provisions (former Gaijin Games)\nClunk from Awesomenauts by Ronimo Games\nSuper Crate Box guy from Super Crate Box by Vlambeer\n“Black Fluff Ball” from Badland by Frogmind\nTiny from Tiny & Big: Grandpa’s Leftovers by Black Pants Studio\nMi from Knytt Underground by Nifflas’ Games\nJ. Jitters from The Great Jitters: Pudding Panic by Kunststoff\nDustgirl from Dustforce by Hitbox Team\nTim from Braid by Number None\nMarvin the cat from Team Indie by Brightside Games","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Brightside Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":934079,"name":"The Outer Worlds: Spacer's Choice Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/876/876b9fc85a4ab10b3e52a9ade7f9ef97.jpg","description":"The Outer Worlds: Spacer’s Choice Edition is the ultimate way to play the award-winning RPG from Obsidian Entertainment and Private Division. Including the base game and all DLC, this remastered masterpiece is the absolute best version of The Outer Worlds.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":497976,"name":"Janosik","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aef/aef452747487894f106b7fbdf4358602.jpg","description":"Janosik is a retro action-platformer game with metroidvania elements: exploration, upgrades and big interconnected level. It's fast-paced, challenging, and full of secrets! Absolutely free to play!\nJanosik's companions are in trouble. They were captured by soldiers. Janosik is on the mission to take back his companions. Will you help him?\nJanosik was legendary Slovak highwayman. According to the legend, he robbed nobles and gave the loot to the poor. He is known as Slovakian's Robin Hood.\nThe game is absolutely free. There are no micro transactions or anything like that. I made the game because this is my hobby :) I hope you enjoy the game!\nBy the way - Janosik is a Slovakian hero. Just to show respect I have translated all the dialog to Slovakian language.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Onix Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":376899,"name":"Arise: A Simple Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f1a/f1ab53ba75dd2077d861d4e56efb0b29.jpg","description":"Arise: A Simple Story is a game filled with feelings of love and loss that we believe is truly special. With our hearts poured into it, it’s not just our debut as a studio… it’s our dream coming to life. We want to take you on this one-of-a-kind journey that will bring back memories of your own life, both happy and sad, but all part of your story.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Piccolo Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":302303,"name":"Windjammers 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/445/4454ca9ba9b2e251ab2fa63354558b8a.jpg","description":"The legendary disc throwing game, Windjammers, is getting a sequel!\n\nWindjammers 2 will combine everything fans love about the classic title with entirely hand-drawn 2D animations to create the ultimate windjamming experience. The coming sequel will bring new stages and players, surprising and amazing new power moves and enhanced gameplay mechanics!\n\nFEATURES:\n• Gorgeous hand-drawn 2D animations\n\n• Brand new characters and stages\n\n• New power moves\n\n• Enhanced online multiplayer gameplay modes\n\n• Local PvP\n\nTrailers:\n[ Windjammers 2 - Announcement Trailer ]\nhttps://www.youtube.com/watch?v=yPN66_QxaNA\n\n[ Windjammers 2 - Gameplay Reveal Trailer (alpha footage) ]\nhttps://www.youtube.com/watch?v=or1-y1LQJCo\n\nWiki------\nWindjammers is a sports game played from a top-down perspective. Similar to ice hockey, players are tasked to shoot a frisbee at the goal zone of the opponent attempting to score.[1] In the game, players are able to select different stages and characters. Some characters from the original game, including Wessel, returns for the sequel.[2] Each character has their own attributes. For instance, some characters have more steady control than others at the cost of speed.[3] There are EX Moves, which are special powers can be activated for gameplay advantages.[4] Both single-player and local multiplayer modes are featured.[1]","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"DotEmu","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":58862,"name":"P.T.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ad/5adbec1ab1b6390835a3bc936b96091f.jpg","description":"'My voice, can you hear it?\r\nThis sign, can you read it?\r\nI'll wait forever if you'll just come to me.'\r\n\r\nHer words - To where do they lead?\r\nBe the first in the world to find out.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":46866,"name":"The Painscreek Killings","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52b/52b84d35f96c0e739a1b7730ebba5067.jpg","description":"Janet, a young and upcoming journalist, has been asked by her editor to investigate the mysterious abandonment of a once lively town. Based on the information released by the media about the killings and supernatural sightings, Janet set foot into the town thinking she would find an interesting story to publish, only to uncover secrets that were meant to stay hidden forever. The Painscreek Killings is a first-person, explorable mystery solving game set in a fictional town of United States in the 1990s.Key Features\nNon-linear, semi-open world game where you are free to explore wherever your instincts take you.\nNote-taking and in-game photographing to aid in your investigation.\nUse your powers of observation and deduction to piece together the secrets of Painscreek.\nFind the truth and publish your story in tomorrow's papers.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"EQ Studios","platforms":[{"id":0,"name":"PC"}]},{"id":32402,"name":"Battlefield 1942","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d21/d21626684c736d1f825e9acd3993d4ca.jpg","description":"Battlefield 1942 let players engage in infantry combat and get behind the wheel of a variety of vehicles from submarines to battleships and bombers. The game is where DICE developed the signature Battlefield rock-paper-scissors gameplay, and where players first experienced the unique and unscripted multiplayer experiences now known as “Battlefield Moments.”","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Digital Illusions","platforms":[{"id":0,"name":"PC"}]},{"id":18987,"name":"BRAINPIPE: A Plunge to Unhumanity","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1c/d1cee53e7571cbfd09f562084183a883.jpg","description":"A game of lysergic excellence.\n- Jim Rossignol, Rock, Paper, Shotgun\nLike traveling through the Matrix on acid.\n- Joseph Vanburen, HarryBalls.com\nLike having sex with Yog Sothoth\n- the99th, Play This Thing!\nBrainpipe: A Plunge to Unhumanity is an easy-to-pick-up first person game of real-time spatial navigation and quick reflexes. Supported by hypnotic graphics, ear tickling sound effects and immersive dreamscape music, the game's free floating, forward moving intensity gradually increases from serene to frenetic as you play. Effortless to learn, Brainpipe's simple and intuitive interface will have you playing in seconds. Immersive and dreamlike, Brainpipe will always beckon you back for more.\n10 twisty tube levels\nRamping speed and intensity\n8 dangerously tempting obstacles to avoid\nTen levels of ramping perplexity and oddness.\nMind glyphs to collect and score\nHypnotic sound and music featuring EelMix\nCreepy eyeball buttons!\nFullscreen or windowed modes\nMouse, joystick and gamepad support\n\nDigital Eel makes deep games about weird stuff, going so far as to name one of their better games Weird Worlds. Then they went ahead and outdid themselves.\n- the99th, Play This Thing!\nCompletely and utterly original and unbelievably addictive.\n- Tom Lord, TheSixthAxis\nThe subtle doppler effect on the constant and schizophrenic audio visual assault positions you squarely inside the game in ways that most struggle at.\n- Brandon Boyer, Offworld\nBrainpipe: A Plunge to Unhumanity was the 2009 Independent Games Festival Excellence in Audio award winner.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Digital Eel","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":633,"name":"Badland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f23/f23ef5fc03eb75a1790ca9cef27bdcf4.jpg","description":"Fly and survive through the Game of the Year -winning action adventure BADLAND.\nOver 40 MILLION players and counting!\n#1 GAME in 83 countries!\nApp Store iPad GAME OF THE YEAR!\nWINNER of the Apple Design Award!\nApple Editors' Choice worldwide!\n5/5 - AppSmile - \"A standout game\"\n4/4 - Slide to Play - \"A must-download\"\n5/5 - AppSpy - \"An absolute treat to play\"\n5/5 - Apple’N'Apps - \"One of the best games\"\n9/10 - Destructoid - \"A hallmark of excellence\"\n4.5/5 - TouchArcade - \"Easy to recommend\"\n“BADLAND is a standout game that we can’t stop playing.” -- AppSmile\n“BADLAND’s unique gameplay and atmosphere make it a must-download.” -- Slide to Play\n“BADLAND doesn’t simply look pretty, it’s an absolute treat to play.” -- AppSpy\n“One of the best experiences on iOS.” -- Apple’N'Apps\n“A hallmark of excellence.” -- Destructoid\nApp Store iPad GAME OF THE YEAR\nWINNER of the Apple Design Award\nWINNER of the Nordic Indie Sensation Award at Nordic Game\nWINNER of the Best Project at Game Connection Europe\nWINNER of the SCEE Award at Game Connection Europe\nWINNER of the Best Game - Arcade & Action at the Tabby Awards\nSelected Indie Game at PAX 10\nEditors' Choice in Macworld\nBADLAND is an award-winning atmospheric side-scrolling action adventure platformer set in a gorgeous forest full of various inhabitants, trees and flowers. Although the forest appears to be right out of a beautiful fairy tale, there’s something terribly wrong. The player controls one of the forest dwellers to find out what’s going on, and discovers an astonishing number of imaginative traps and obstacles on the way.\nBADLAND takes side-scrollers to the next level with its innovative physics-based gameplay combined with stunning, atmospheric graphics and audio.\nBADLAND also features a highly original local multiplayer mode for up to four players on the same device, where the name of the game is survival of the fittest with no rules. It’s totally OK to push your rivals in front of spinning circular saws to survive. Or, if that's too rough for you, you can also cooperate with your friends and play the modified single player campaign with up to four players.\n- SINGLE PLAYER campaign with 100+ truly unique levels\n- VERSUS mode for up to four players on the same device in 30+ levels\n- COOPERATIVE mode for up to four players\n* Survive the modified single player campaign with your friends\n- LEVEL EDITOR: Create levels, share & play!\n* Start from scratch or modify the official levels\n- LEVEL WORLD: New levels to play all the time\n* Discuss with the other level makers, share tips and watch level making tutorials at http://forum.badlandgame.com\n- Intuitive one-touch controls combined with innovative level design\n- Supports 3D Touch\n* Super precise flying using touch\n* Quick actions added to home screen icon to quickly access single player and editor\n- Highly immersive audiovisual gaming experience\n- Universal app optimized for iPhones, iPods and iPads\n- iCloud support (player's game progress is synced with all linked iOS devices)\n- iOS 7 Game Controller support\nFollow us:\nFacebook - http://www.facebook.com/badlandgame\nTwitter - http://www.twitter.com/badlandgame\nBlog - http://www.badlandgame.com","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Frogmind","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":611,"name":"Subject 13","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fa/5fa23f9cc6248f280821a217261c6a2a.jpg","description":"Subject 13 is the new adventure game developed by Paul Cuisset—the man behind \"Flashback\", \"Future Wars: Adventures in Time\" and \"Moto Racer\"—in partnership with Microïds.\nThis is a true adventure game. It depicts a mysterious universe filled with secret hiding places and all kinds of mechanisms that the player discovers, analyzes, and activates. There are also objects to collect and to figure out how to use in the backdrops…\nSubject 13 will make you travel from a secret base that has been abandoned to a strange and mysterious island, so you can discover the real story. You'll have to muster all your insight and intelligence for this daunting challenge.Key FeaturesStunning 3D rendering\nIntuitive interface\nProgressive difficulty\nQuality dubbing","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Microids","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":650607,"name":"Saints Row (2022)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/253/2538c831423559834329741e44d3c718.jpg","description":"Welcome to Santo Ileso, a vibrant fictional city in the heart of the American SouthWest. In a world rife with crime, where lawless factions fight for power, a group of young friends embark on their own criminal venture, as they rise to the top in their bid to become Self Made.\r\n\r\nExperience the biggest and best Saints Row playground ever created; the unique sprawling world of Santo Ileso is the backdrop for a wild, larger than life sandbox of thrilling side hustles, criminal ventures and blockbuster missions, as you shoot, drive, and wingsuit your way to the top.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Volition","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":540036,"name":"Cruelty Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/826/8268937033816c09a50bb5a98e17b33c.jpg","description":"Cruelty Squad is a tactical first person shooter set in the hardcore gig economy of corporate liquidations. You're an emotionally dead combat-substance fueled grunt of Cruelty Squad, a depraved subsidiary company tasked with performing wetworks for its host conglomerate. Will you make the Corporate Arch Demoness proud or succumb to bitter tears of failure?\nHighly kinematic tactical gameplay using varied weapons such as the flechette shotgun, silenced 10mm pistol, radiation emitter, dart gun, corrosive gas launcher and more.\nNo handholding!\nAll of the missions have multiple viable approaches and routes. Plan out your equipment loadout to gain a tactical advantage. Choose between non-lethal and lethal options. Throw toilet bowls at enemies.\nFight and sneak through offices, suburbs, police stations and secret compounds. Find and unlock hidden equipment and levels*.\nOpen objective based gameplay, in each mission your goal is to kill or destroy your targets before heading for the exit.\nRevisit earlier missions and try to beat your best time. Can you S-rank all of the missions?\nEnemies including private security, cops, psycho freaks, flower hybrids, swamp cultists and mutant dogs.\nTalk to NPCs and figure out the mysteries of the world.\nAdvanced death mechanics.\nPunishment mode.\nNote: The game is in development and features detailed here are subject to change\n*Currently only one hidden bonus level available, more planned.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Consumer Softproducts","platforms":[{"id":0,"name":"PC"}]},{"id":485079,"name":"Tennis World Tour 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66f/66fda6d07b2d9e492c240aada4a0b18b.jpg","description":"Play as the world's top players or create your own player to try and dominate the world rankings. Faster paced, with more animations and more realism: experience the true sensations of tennis, in singles or doubles games, and challenge your friends locally or online.\n\nTHE REAL LIFE OF A TENNIS PRO\n\nYour player, your decisions. In Career mode, you manage your season, your staff, your equipment and your sponsors. And if you are up to the challenge, you can become the new star of world tennis.\n\nDESIGNED FOR TENNIS FANS\n\nMaster the timing of your strokes, the new serve mechanics and all the moves to dominate your opponent, just for fun or to win in Ranked mode.\n\nTHE THRILL OF THE COURT\n\nMore animations, more strokes, a faster pace… Experience dynamic, realistic and precise gameplay that puts you in the heart of legendary rallies.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Big Ant Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":32974,"name":"Heroes of Might and Magic 2: The Succession Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16b/16b4f71c165c700503d61434ac4959b9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":30504,"name":"Need for Speed 3: Hot Pursuit","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/291/29135e04d81ef83074ce59963636095f.jpg","description":"Need for Speed III: Hot Pursuit, released as Need for Speed: Hot Pursuit in Europe, is a racing video game released in 1998. It is the third major installment in the Need for Speed series, significantly incorporating police pursuits as a major part of gameplay. Hot Pursuit remains focused in racing using exotic sports cars, but features races that primarily take place in locations within North America, including varied settings and climates. In addition, police AI is significantly improved over its predecessor, utilizing several tactics to stop both the player and opponent. The game was released for PlayStation in March 1998 and later received an enhanced port for Microsoft Windows in October 1998. A PlayStation 2 version was developed, but later cancelled. The game title's suffix, \"Hot Pursuit\", is a term for a police pursuit. The game had a sequel that was released in 2002 as Need for Speed: Hot Pursuit 2.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":19674,"name":"Knights of Honor","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/285/285c8933c32d5ef058c19bd8e0574077.jpg","description":"As King, it is your duty to lead your people in their struggle to raise your kingdom from its humble beginnings to a position of power and prestige. War, diplomacy and a burgeoning economy are the means by which you increase your power and expand your influence. A unique Knight-management system will offer you brand new possibilities to enhance your personal strategy.\nLoyal knights blessed with special skills stand true at your side. Use them wisely in the military, the administration of your lands and in diplomacy, and then use their hard-won experience to further develop their talents as you see fit.\nAstute development of your estates and castles both satisfies your people and secures you decided strategic advantages. A suitable infrastructure can soon promote a flourishing economy. Exotic resources and relicts are spread over the game world and will reward your complete kingdom with special amenities.\nLead your hand picked troops into battle and conquer enemy realms. Storm massive fortresses or lay siege to them and starve your enemies out or even poison the water. Defend your own realms against invading forces and use your tactical skills wisely.\nUse your feel for diplomacy when concluding trade agreements or entering into military alliances. Choose husbands for your daughters wisely, consolidating your power through marriage. Be ever on the watch for assassins and spies - and do not get caught yourself.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Black Sea Studios","platforms":[{"id":0,"name":"PC"}]},{"id":13638,"name":"Ara Fell","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/726/726a74f171572130ffab3f54d880ec11.jpg","description":"\"Long, long ago, the elven sorcerers cast a spell to save the floating world of Ara Fell from destruction. Instead, they doomed it to fall from the sky. By chance, the fate of the world has been placed in the hands of a young woman. Join her as she and her friends endeavor against all odds to save their homeland, all while the clock ticks ever nearer the final hour...\"\nAra Fell combines the best parts of Japanese-style roleplaying games with the best parts of western RPGs, as well as including elements of visual novels and adventure games to create a truly unique experience. Atmosphere, emotion and surprise lie at the forefront of Ara Fell's story, driven by deep and accessible characters, each with his or her own past, their own desires and their own motivations for joining Lita's quest. Relive the golden age of the RPG with a game that both pays homage to the past greats, as well as blazing its own trail.\nEXPLORATION - Ara Fell is a world meant to be explored! Jump, crawl, swim and even fly through the air to solve puzzles and discover new locations filled with hidden treasure, secrets and adventure! Every corner of Ara Fell is designed with exploration in mind.\nOPEN WORLD - Most of the world can be explored from the moment you leave Aloria Village, the heroine's home town... provided, of course, you're strong enough. A clever explorer may be able unlock secrets and discover powerful equipment early in the game if he or she commits to taking advantage of the open nature of the game world.\nTACTICAL COMBAT - Ara Fell may be a story-heavy game, but the world is still fraught with danger. Choose specialized equipment and statistics, customizing each character to best suit your play style, and to best thwart each boss battle's unique mechanics.\nCHARACTER DRIVEN - When you join Ara Fell's unwitting heroine on her quest to save her homeland, you'll discover a world filled with vibrant characters who laugh, cry, crack jokes, lose their tempers, and even their will to go on as the size and scope of the curse that plagues Ara Fell becomes apparent. Friends and villains alike are not who they seem as the stakes grow ever higher...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"charblar","platforms":[{"id":0,"name":"PC"}]}]