[{"id":326243,"name":"Elden Ring","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b29/b294fdd866dcdb643e7bab370a552855.jpg","description":"The Golden Order has been broken.\n\nRise, Tarnished, and be guided by grace to brandish the power of the Elden Ring and become an Elden Lord in the Lands Between.\n\nIn the Lands Between ruled by Queen Marika the Eternal, the Elden Ring, the source of the Erdtree, has been shattered.\n\nMarika's offspring, demigods all, claimed the shards of the Elden Ring known as the Great Runes, and the mad taint of their newfound strength triggered a war: The Shattering. A war that meant abandonment by the Greater Will.\n\nAnd now the guidance of grace will be brought to the Tarnished who were spurned by the grace of gold and exiled from the Lands Between. Ye dead who yet live, your grace long lost, follow the path to the Lands Between beyond the foggy sea to stand before the Elden Ring.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"FromSoftware","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":2792,"name":"Layers of Fear","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6a2/6a2e48933245e2cd3c92248c75c925e1.jpg","description":"Layers of Fear is the horror game with a focus on exploring and puzzles. It is the only installment in the IP, featuring one DLC which expands the storyline further and one port to the Nintendo Switch, which adds multiple features like accelerated controllers' support and touchscreen assistance.\r\nThe primary goal of the player is to guide the genius and psychopath painter on the way to complete the painting. The problem is the player does not know how to do so — they start exploring the house, which is changing the layouts repeatedly and find out many jump-scares along the way.\r\nGetting through all of the six chapters the player may reach of the three endings: bad, average and good. The end is decided not by momentarily choice but by a series of decisions throughout the game. While the player is uncovering the truth about the premises of the hero's masterpiece, the DLC tells a story of his daughter which returns to her memories of the past. The DLC also features three endings in the same fashion as the original game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bloober Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":4003,"name":"GRID 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27b/27b02ffaab6b250cc31bf43baca1fc34.jpg","description":"GRID 2 is a racing game, the sequel to Race Driver: GRID. \n\nIn the centre of the \"story\" GRID 2 is a racing championship, which we gradually promote around the world. Money is not needed, the main thing is to conquer the audience. The race will be held in such places as Paris, Hong Kong, Chicago, Dubai, etc. All the tracks, drivers, teams, cars and sponsors in the game are real.\n\nCompared to GRID (the first part of the series), there are more modes. There were races on the so-called \"Checkpoint\",  endurance race and other several options. And the significant thing now that there is no driving on the rails, sudden acceleration of rivals and unpunished wiping of bumpers (also, damage to the machine is not displayed on the screen, it is necessary to focus on its behaviour and the replica of racing engineer).\n\nThe main feature of GRID is time rewinding. The number of rewinds is limited, but with this, you can save yourself from a fatal outcome.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3876,"name":"Deus Ex: Human Revolution - Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a12/a12f806432cb385bc286f0935c49cd14.jpg","description":"The future is now and the year is 2027. You play Adam Jensen, an ex-SWAT specialist hired to oversee the security needs of Sarif Industries one of America’s most experimental biotechnology firms. When a team of black ops mercenaries attack Sarif's headquarters killing the very scientists you were hired to protect, everything you thought you knew about your job changes. After being mortally wounded during the attack, you have no choice but to undergo radical life-saving surgeries that transform you into a mechanically enhanced being. Now hot on the trail of those responsible for the attack, you soon find yourself chasing down leads all over the world, never knowing who you can trust. The men pulling the strings will stop at nothing to ensure mankind's evolution follows a particular path. You need to discover where that path lies. Because when all is said and done, the decisions you take, and the choices you make, will be the only things that can change it.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":1682,"name":"The Wolf Among Us","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be0/be084b850302abe81675bc4ffc08a0d0.jpg","description":"The Wolf Among Us is a five-part episodic game relying heavily on dialogues and choices of the player. The game is considered a prequel to Bill Willingham's 'Fables' comic book and features usual TellTale stylistics: cartoon-like graphics, comparing your choices to the decisions of the other players and QTEs. 'The Wolf' is the first part of the series with a promised expansion to the second season coming out in 2019.\r\nYou play as Bigby Wolf; he is a Sheriff of a Fabletown: as a typical Sheriff, you need to fulfill the requests of the Fabletown's residents and uncover mysteries lying behind the crimes there. The gameplay consists of choosing the dialogue options, reacting to QTE button-mash and watching cutscenes. \r\nThe critics are marking down that unlike many other TellTale games 'The Wolf Among Us' borrows original comic book's portrayal thus looking better, and having the original as sequel before you eyes lets you engage with Fabula more quickly.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Telltale Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":998,"name":"Battlefield 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/998/9980c4296f311d8bcc5b451ca51e4fe1.jpg","description":"Battlefield 1 is a first-person action shooter set in the historical period of the World War I. Although the game is a part of the Battlefield franchise, it has no references to the previous chapters. Players are able to experience both single and multiplayer mods to get in action and to feel the era better. As a single-player campaign, Battlefield 1 offers 6 storylines (chapters) one following each other. Each consists of several missions and tells a story of a single man in the middle of a global military conflict. Playing for these soldiers and closing the targets introduces new game mechanics to players. Completing these missions gives an opportunity to dive into the history and to examine the warfare of past ages. Multiplayer experience is divided into 9 different game mods spread on 31 historical maps. You can join the dynamic battle alone or in a squad with your friends. Multiplayer allows you to assume different battlefield roles (classes) starting with a medic, support or assault and following to the tank driver, pilot and some elite units.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":18613,"name":"Counter-Strike: Condition Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8bd/8bd24e3c15354a9555bb1437fe555a69.jpg","description":"Counter-Strike: Condition Zero is the second installment in first-person multiplayer shooter series Counter-Strike. It is the only game in the Counter-Strike main series that includes a single-player campaign. In the campaign, you play as a leader of a special forces squad. You form your team from a cast of pre-made characters with unique features and go on through several unconnected missions. The missions themselves are mostly a string of multiplayer matches played with AI bots and some additional challenges like killing enemies with a specific type of weapon \nThe multiplayer part of the game is very similar to the previous installment. There are two teams in every match: terrorists and counter-terrorists. You choose one of the sites and have to defeat the enemy team by killing hostile players or completing different tasks. For doing this, you also get money rewards which you can spend on more advanced weapons and gear.  \nThe game also features Condition Zero: Deleted Scenes, the early version of the game, developed by Ritual Entertainment before the game was handled to Turtle Rock Studios.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1256,"name":"XCOM 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9bf/9bfac18ff678f41a4674250fa0e04a52.jpg","description":"The game continues the previous game line: XCOM Enemy Unknown. In XCOM 2 we see the Earth under the rule of aliens. The order established by them is based on total control but is proclaimed as the realm of prosperity and security. However, on the periphery of large cities, there are those who consider it a dictatorship and are struggling to restore independence to people. Thus the new XCOM, the organisation of freedom fighters, is reborn. The base for the organisation's soldiers is now the alien ship \"The Avenger\", converted to the needs of the defenders of the Earth.\nThe player will have to travel around the global map, contact guerrillas in various places, look for resources and perform partisan attacks on the critical points of the enemies. The tactics of the organisation have changed - now they are in the minority. The factories for the production of weapons and other equipment were closed 20 years ago, so you have to collect any found equipment and resources.\nThe game introduced many new enemies, but there are aliens from the previous game too. The hero of the game has a unique ability to be in contact with the psi-network uniting all the aliens. This ability makes him a turning point in which the enslavement of the Earth can be reversed.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":13461,"name":"Resident Evil 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/974/974342a3959981a17bdbbff2fd7f97b0.jpg","description":"Resident Evil 5 (also known as Biohazard 5 in Japan) is the third-person shooter with elements of a survivor-horror game. This is the fifth main installment in Capcom’s acclaimed franchise Resident Evil.  \r\nThe story follows Chris Redfield, the protagonist of the original Resident Evil, and his partner Sheva Alomar. As the members of the Bioterrorism Security Assessment Alliance, they are tasked to intercept an illegal bioweapon trade in Kijuju, Africa. Upon arrival, they find out that Kijuju is infected by Las Plagas, parasites that turn its carriers into zombie-like creatures.   \r\nThe game is notable for being a departure from the series survival horror roots towards more action-oriented gameplay style. The other significant innovation in the series brought with Resident Evil 5 is cooperative multiplayer for two players. There are many situations during the game that requires two players cooperation therefore if in singleplayer the second characters is controlled by AI.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":12024,"name":"Insurgency","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a1/1a17e9b6286edb7e1f1e510110ccb0c0.jpg","description":"Insurgency is a first-person shooter, which provides players with both PvP and co-op multiplayer experience. Unlike other shooters, Insurgency features a hardcore gameplay lacking the on-screen crosshair, health and armor indications, and mini-maps. For the more, each weapon instantly kills other players with one shot in the head and with the maximum of 4 shots in the body, which is quite realistic. As far as the action is set in the timeframes of the Iraq War, the two opposing sides are U.S. troops and Iraqi rebels. The gameplay is divided into 9 PvP modes (Push, Firefight, Skirmish, Ambush, Occupy, Infiltrate, Flashpoint, and Elimination) and 5 co-op modes (Checkpoint, Hunt, Survival, Outpost, and Conquer). PvP matches are held according to 9 various scenarios (depending on the chosen game mode) with the maximum of 32 player count (16 for both sides). To start a match, players have to select a character class and proper equipment. In the co-op game mode, players are offered to compete with AI during the completion of a specific game objective.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"New World Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15002,"name":"The Stanley Parable","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f0/8f0b94922ad5e59968852649697b2643.jpg","description":"The Stanley Parable is a first-person interactive story game. Being initially released in 2011 as a modification for Half-Live 2, it was entirely remade in 2013, featuring updated graphics and more content.  \nThe game follows Stanley, an office worker whose job boils down to pressing buttons on the keyboard depending on what he sees on his office computer screen. One day the screen goes black and Stanley, not knowing what to do, decides to investigate the building. \nThe gameplay consists of exploring a deserted office building. The game has 19 possible endings that depend on which way the player chooses to explore his surroundings. The Stanley Parable’s key feature is the permanent presence of the narrator who comments protagonist’s actions and suggests player what to do next. However, the player can ignore his suggestions which makes the narrator adjust his story to the player’s actions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Galactic Cafe","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17959,"name":"Ori and the Blind Forest: Definitive Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/04a/04a7e7e185fb51493bdcbe1693a8b3dc.jpg","description":"NEW IN THE DEFINITIVE EDITION\n• Packed with new and additional content: New areas, new secrets, new abilities, more story sequences, multiple difficulty modes, full backtracking support and much more!\n• Discover Naru’s past in two brand new environments.\n• Master two powerful new abilities – Dash and Light Burst.\n• Find new secret areas and explore Nibel faster by teleporting between Spirit Wells.\nThe forest of Nibel is dying. After a powerful storm sets a series of devastating events in motion, Ori must journey to find courage and confront a dark nemesis to save the forest of Nibel. “Ori and the Blind Forest” tells the tale of a young orphan destined for heroics, through a visually stunning Action-Platformer crafted by Moon Studios. Featuring hand-painted artwork, meticulously animated character performance, a fully orchestrated score and dozens of new features in the Definitive Edition, “Ori and the Blind Forest” explores a deeply emotional story about love and sacrifice, and the hope that exists in us all.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Moon Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":3497,"name":"Far Cry 4","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b39/b396dac1f3e0f538841aa0355dd066d3.jpg","description":"Far Cry 4 is a first-person shooter, which inherits traditions of the original Far Cry franchise. However, the plot of the fourth chapter is unique and has no direct references to the previous games of the series. The story is now set in the Far East, where the new main character Ajay Gale joins the opposition fighting the dictatorship. The open world lets players explore the entire environment of Kyrat – a tiny fictional region hidden in towering Himalayas. Ajay as a Kyrati-American travels to Kyrat to scatter the ashes of his mother in her motherland, but suddenly things go the wrong way, and he finds himself in the middle of the civil war between the powerful dictator Pagan Min and rebels from the Golden Path founded by his father. As the story progresses, players get new weaponry and equipment or customize the ones they have. From the very beginning, the whole map is not available, so to progress and to complete the story players have to open all the game areas by “activating” bell towers (traditional Far Cry mechanic) for establishing the Golden Path’s radio propaganda and defeating enemies’ fortresses.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":22571,"name":"Black Desert Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/651/651ae84f2d5e36206aad90976a453329.jpg","description":"Pre-Existing UsersThe Steam version of Black Desert Online requires the purchase of the game from Steam as well as the creation of a new Black Desert Online account. Pre-existing Black Desert Online accounts created from methods other than Steam will not be able to play via Steam.\nAbout the GameBlack Desert Online is a sandbox, living-world MMORPG. Experience fast-paced, action-packed combat, hunt monsters and huge bosses, fight with friends in a guild to siege nodes and region castles, train your life skills such as fishing, trading, crafting, cooking, and much more!\n\nPlayers will enjoy jaw-dropping graphics, intuitive skill-based combat, and an immersive story encased in our expansive world that’s just waiting to be explored. Accompanied by a Black Spirit, a companion whose destiny is intertwined with their own, players will discover the secret of the Black Stones and the history of their corrupting effects.\nCLASSES:\nFEATURES\nRobust Character Creation Tools - Make the character YOU want to play.\nSeamless Movement Throughout the World – No loading times necessary as you explore.\nCombo-Oriented, Non-Targeted Combat - Take part in fast-paced, action-packed combat with skills that can be chained through combos.\nUnique Weather and Climate - The weather and climate will have various effects on different zones that players can adapt to.\nDay / Night Cycle – Along with unique weather and climate changes, the game revolves around a day/night cycle that alters NPC behavior and triggers various events based on the time of day.\nInstanced Player Housing – From tents to palaces and everything in between, players can furnish and customize their own homes and can hire NPCs to keep your place clean or purchase things from the marketplace.\nMounted Combat – Utilize your trusted mounts on the battlefield and take advantage of their mobility and effectiveness in combat. Keep in mind, however, that mounts will need to be cared for, housed and protected as they can die in combat.\nBoss Hunts - Group up with friends or other players to hunt down field bosses and world bosses to get that rare loot.\nSiege Warfare - Massive free-for-all guild battles! Join a guild and participate in daily node wars or weekly conquest wars against many other competing guilds. Win the node or castle and claim it for a week to collect taxes to increase your guild funds.\nOcean Contents - Craft your boat and make sail to the vast oceans to fish, hunt ocean monsters and bosses, underwater exploring and gathering, quest missions, trade, and so much more.\nTaming & Breeding - Catch and tame horses and elephants in the wild to make it your mount. You can also breed horses for better offspring with improved mount stats and skills.\nCrafting - Enjoy all aspects of crafting in Black Desert from tools, weapons, armor, jewelry, boats, costumes, outfits, and more. Just about everything can be crafted in the world of Black Desert Online.\nProfession - Take part and grow your character into a profession that can help your income. With professions like gathering, processing, cooking, alchemy, training, fishing, hunting, trading, farming, and sailing, you can choose to play Black Desert Online the way you want to.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pearl Abyss","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":13268,"name":"Amnesia: A Machine for Pigs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d9f/d9f982e042df6263684ba1fdea3efc1c.jpg","description":"Amnesia: A Machine for Pigs is a first-person survival horror, an indirect sequel to 2010 title Amnesia: The Dark Descent. The gameplay is most parts identical to that of previous game and consist of exploring surroundings, solving puzzles, and avoiding monsters. Like in the previous game, your character is practically unable to confront monsters and has to hide from them to survive. However, there is no more sanity meter, and inventory in Machine for Pigs and puzzles are more physics-based than in The Dark Descent. \nIn Machine for Pigs, you play as Oswald Mandus, a first game protagonist’s descendant, and successful industrialist. He recovers after a fever which lasted for a few months after a disastrous expedition in Mexico. Not remembering anything about it, later he finds out that he build a mysterious machine in the basement of his mansion and his house is full of swine-like monsters. The player must restore Oswald’s lost memories and reveal the secret of the machine.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Chinese Room","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4599,"name":"Saints Row 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10d/10d19e52e5e8415d16a4d344fe711874.jpg","description":"Saints Row 2 brings true freedom to open-world gaming. Players can play as who they want, how they want, and with whomever they want in this sequel to the much acclaimed and tremendously successful Saints Row.\n\nSet years after the original, the player finds himself in a Stilwater both familiar and strange and challenged with bringing the Saints back as the rightful kings of Stilwater and bringing vengeance to those who wronged him.\n\n• Limitless Customization - Play as fully customizable characters that are male, female or something in between.\n - Vehicles can be visually customized as well as performance tuned.\n - Cribs and even gangs all have an amazing degree of detailed customization options.\n\n• Multiplayer - Co-op full story campaign has seamless integration (for example one player drives while the other shoots).\n - Competitive MP pushes the boundaries of immersion in a living Stillwater environment fully populated with police, innocent bystanders and rival gangs.\n\n• Killer Combat and Awesome Vehicles - Planes, helicopters, motorcycles, boats and cars can be piloted and used as weapons. On the ground new combat options include melee, fine aim, and human shield.\n\n• Freedom to Explore - More missions, activities, diversions, races, weapons, vehicles, cribs, city districts, and interiors than ever before. Over 40 story missions with additional bonus missions take place in a transformed Stilwater that is over 50% larger than before.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Volition","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":10560,"name":"Total War: SHOGUN 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be9/be9cf02720c9326e11d0fda14518554f.jpg","description":"Total War: SHOGUN 2 out now for Linux.\nAbout the GameMASTER THE ART OF WAR\nIn the darkest age of Japan, endless war leaves a country divided. It is the middle of the 16th Century in Feudal Japan. The country, once ruled by a unified government, is now split into many warring clans.  Ten legendary warlords strive for supremacy as conspiracies and conflicts wither the empire.  Only one will rise above all to win the heart of a nation as the new shogun...The others will die by his sword.\nTake on the role of one Daimyo, the clan leader, and use military engagements, economics and diplomacy to achieve the ultimate goal: re-unite Japan under his supreme command and become the new Shogun – the undisputed ruler of a pacified nation.\nGame Features\t\t\t\t\t\tTotal War: SHOGUN 2 features enhanced full 3D battles via land and sea, which made a name for the series, as well as the tactical campaign map that many refer to as the heart and soul of Total War. Featuring a brand new AI system inspired by the scriptures that influenced Japanese warfare, the millennia old Chinese “Art of War”, the Creative Assembly brings the wisdom of Master Sun Tsu to Total War: SHOGUN 2. Analysing this ancient text enabled the Creative Assembly to implement easy to understand yet deep strategical gameplay.\nCONQUER the islands of Japan in the 16th century.  Lead vast armies of samurai and fleets of giant warships into breathtaking real-time battles.\nBUILD your kingdom on the inviting and turn-based campaign map.  Wield economic, political, and military power to amass wealth, armies, and influence.\nSCHEME according to the \"Art of War\" by Sun Tzu. Use fire and siege tactics, spies and assassins to adapt to the ever-changing conditions on the battlefield and throughout your kingdom.\nBATTLE ONLINE and experience the main campaign in two-player mode.  Then join epic online battles with up to 8 players and lead your online army to glory in special campaigns.\nNew to Total War in SHOGUN 2\t\t\t\t\t\tNew RPG skills and experience for your Generals and Agents.\nNew Multi-stage Sieges - scaling the walls is only the beginning!\nNew Hero units inspire your men and carve through the enemy.\nNew rotating 3D campaign map.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Feral Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11435,"name":"Viscera Cleanup Detail: Shadow Warrior","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2f/f2f3c93d6153da7aee590f3ab8ccd803.jpg","description":"Viscera Cleanup Detail is about cleaning. After a brutal fight with endless waves of enemies, you must really live a bloody mess after yourselves. That's where Space-Station Janitors come in to play with their mops, buckets of water and biohazard bins to clean the area for the next bloody fight. \n\nYour goal as a janitor to search the whole area and clean any kind of a trace of a brutal fight. Body parts, med-kits, bloodbaths and others signs of a harsh battle with forces of evil. For bullets casings or flares you can use a broom to gather thing and then throw everything into the incinerator and burn all the evidence.\n\nIn this specific DLC, Shadow Warrior, janitors arrive on a very first mission of Shadow Warrior 2013. Lo Wang fought through demons and his opponents, slicing his katana in their bodies and tearing them apart. And now it is your job to take your mop, a bucket of water and funky music to clean the mess up.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Devolver Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3853,"name":"Trine 2: Complete Story","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c97/c97b943741f5fbc936fe054d9d58851d.jpg","description":"Trine II takes a few years after the first game. Successfully saving the kingdom, Amadeus seeks the fireball spells. Yet he is summoned to save the homeland with his friends - Zoya and Pontious. Goblins have taken over the land as they are trying to find the mysterious \"Witch\" deep in the forest. \n\nAlthough having more than one playable character, Trine successfully uses all three of them. Amadeus as the mage is able to move objects or create boxes and planks to help overcome some obstacles. Zoya is very agile so she can hook and grapple on some surfaces, or shoot different targets. Pontious is the strongest character in combat, and he can destroy walls in his path or deflect things with his shield. Having this three different characters, it is necessary to use all three of them to solve puzzles and beat the level. Not only you can play alone, but the game supports three players cooperative to make progress even more atmospheric. \n\nBeautiful design, music and a narrator makes Trine a great story, that feels inspired by J.R.R. Tolkien himself.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Frozenbyte","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4527,"name":"Call of Duty: Modern Warfare 2","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9af/9af24c1886e2c7b52a4a2c65aa874638.jpg","description":"Continuation of the sensational first-person shooter from Infinity Ward and Activision. It is rather difficult to maintain a high level of games every year, but it worked out in the sixth part of the series. The game continues the storyline of the previous part.\r\n\r\nThe game consists of numerous fast-paced gunfights. Classic hit points are not here anymore - after receiving damage, the player only needs to sit tight in safety waiting for health to come back. There are three game modes: the story campaign, multiplayer and Spec Ops. \r\n\r\nIf there are almost no changes in the campaign, and this is the same linear story, the Spec Ops includes 23 new levels for single or cooperative completion. Each level is a new task, a new challenge whether it is the defusing a bomb or the elimination of enemy forces. Levels are divided into tiers by their complexity.\r\n\r\nAs in any other game of the series, the multiplayer in Modern Warfare 2 takes a special place. Each match is a mission, for which you need to come up with new strategies to complete. As in the past, new weapons and perks are opened for the execution of tasks.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Infinity Ward","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":10297,"name":"Sid Meier’s Civilization VI","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/997/997ab4d67e96fb20a4092383477d4463.jpg","description":"The sixth installment in Sid Meier’s Civilization series. Like in all previous Civilization games, the player controls one of eighteen unique historical civilizations, builds its cities, explores the hexagonal map of the world, researches technologies, develops his country's culture, establishes relationships with other civilizations and wages wars. All the traditional victory types are in place, and a new one, religious, is introduced.\n\nA distinct new feature in the sixth part is that city improvements are no more concentrated in each city's only main tile. Instead, they are distributed throughout its whole surrounding area. Each of them is now considered a \"district\" with a specific purpose, and some of them should be built only on specific terrain. Similarly, wonders now occupy tiles on their own. Technology tree was also modified to take into account the player's terrain improvements that may speed up the research of certain technologies. Cultural achievements, such as Opera or Drama, are no more considered \"technologies\" and form a separate Civics research tree instead. Also, unlike most of its predecessors, Civilization VI allows stacking similar types of military units.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Aspyr Media","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"}]},{"id":19590,"name":"Ori and the Blind Forest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8c/f8c6a262ead4c16b47e1219310210eb3.jpg","description":"Ori and the blind forest is a game with a stunning visual style, which looks like a fairytale one, and also the game takes place to a beautiful and atmospheric soundtrack.\n\nThe forest of Nibel is dying. You play as a character named Ori and a spirit named Sein. They are trying to save the magical forest after the dark spirit Kuro stole the heart of the tree of life, what made the forest began to wither rapidly, losing its vitality: the water becomes dirty, the trees cease to bloom and bear fruit, and the woodland is covered with thick thorns.\n\nPlaying in the Ori and the blind forest, you have to explore a vast world, to solve platform problems and relatively complex, but interesting puzzles (first of all, they test your reaction and agility). Using the abilities of Ori (initially, he can only jump, but a lot of other skills will be opened during the game) and Sein (the ability to attack enemies) you have to cope with the difficulties on the way to fix the situation and cure the forest.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Moon Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3168,"name":"SOMA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/149/149bbed9d90dc09328ba79bbacfda3c8.jpg","description":"SOMA is a sci-fi survival horror that makes you rethink the description of death. You play as Simon Jarrett who was injured in a crash accident and agreed for an experimental operation on his brain. He wakes up at an abandoned underwater facility full of mutants. Trying to figure out what’s going on, Simon finds Catherine Chun, a scientist, who tells him about the technology of copying the human personality.\nThe gameplay is based on exploration and puzzle solving. There's no combat, and you are meant to avoid enemies and act stealthily. To progress through the story, you need to search for clues, read multiple notes and solve puzzles.   \nThough there are monsters in SOMA, it frightens with its atmosphere in the first place. A dark, abandoned station with dead people, uncertainty and the lack of any understanding of what is waiting for you is scarier than screamers and blood rivers. Moral choices you have to make don’t affect the story much: instead, they change your attitude to the events, so it’s you who develops through the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frictional Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1090,"name":"This War of Mine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/283/283e7e600366b0da7021883d27159b27.jpg","description":"A small town surrounded by war. The usual order is irrevocably violated, you have to survive, but you are not a soldier and certainly not a superhero.\r\nThe player controls a group of two to four civilians selected from twelve characters. The goal is simple - to survive the war.\r\nLater, new people can join the group. Characters need food, can get sick, freeze, die from wounds. Can run away with all the food stock.\r\nThe day is different from the night in everything. During the day we equip the shelter, repair and produce weapons and tools - from what can be found. In the afternoon we communicate with neighbours, sometimes with benefit. At night we go out for prey. The night harbours us but also harbours looters, often they are armed. Winter brings cold and freezes water, requires more health and firewood.\r\nDecisions that have to be made often have a moral dimension - can one rob an unarmed person if this is a matter of life and death for someone from the group?\r\nAs in life, events are seen as random and do not repeat from game to game. The same characters can behave very differently, and the siege can sometimes last twenty days, and sometimes eighty.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":4013,"name":"Call of Juarez: Gunslinger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a86/a86ce0afaf2d5ec2b0f048989f01795e.jpg","description":"Gunslinger is the fourth installment of the Call of Juarez series of western-inspired games. The frame story, told in cutscenes, begins in 1910, in Kansas, where Silas, a patron in the pub, brags about his adventures in the Wild West. This old man claims he used to be a bounty hunter who took down many of the famous outlaws. Most of the game has the player re-enacting Silas's presumed past, while in the present the hero is narrating his own story off-screen. Silas is an unreliable narrator, however, and his own in-game audience will point at plot holes in his tall tales. \n\nLike the rest of Call of Juarez games, Gunslinger has every classic staple of the western genre. There are saloons and gold mines, stagecoaches, Indians and cowboys, sheriffs and gangs. The protagonist will escape prison, wander the Wild West, fight brigands and other enemies using a variety of late XIX century firearms, and occasionally sing country songs. Gunfights and duels are the central features of the game. There's even a Duel mode, in which the player can enter a tournament of gun duels, and the Arcade mode, in which multiple opponents attack the player. Gunslinger also introduces quick time events that allow the player to evade bullets.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":13305,"name":"Assassin’s Creed III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/275/2759da6fcaa8f81f21800926168c85f6.jpg","description":"Assassin's Creed III is the fifth game of the series, preceded by the first chapter taking place in the time of the Third Crusade and by the Ezio trilogy, positioning itself in the times of the Italian Renaissance (1476-1499). It is the 3rd person action adventure with an accent on exploring and hunting\nDuring the new installment, the player is set to make way through the American Revolution, while being on both side of a conflict — our hero has English father and Mohawk mother, which tears him apart. Such conflicts serve as the leitmotif through the entirety of a game — not only we are choosing sides to fight on in the Civil War, but also we are facing the decisions of choosing Assassins' or Templar's side.\nAs it is common in the Assasin's Creed games, the gameplay concentrates profoundly around fighting the multiple enemies all at once, parkouring off walls and micro-management: selling resources, exchanging ships and so on. The Assassin's Creed III, however, highlights the hunting and simultaneous use of two weapons as the new in-game features.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":28172,"name":"Kingdom Come: Deliverance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8f/d8f3b28fc747ed6f92943cdd33fb91b5.jpeg","description":"You're Henry, the son of a blacksmith. Thrust into a raging civil war, you watch helplessly as invaders storm your village and slaughter your friends and family. Narrowly escaping the brutal attack, you grab your sword to fight back. Avenge the death of your parents and help repel the invading forces!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3766,"name":"Thief","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59a/59a3ebcba3d08c51532c6ca877aff256.jpg","description":"Thief is a stealth-action game, the 4th installment in the Thief series and the first game since 2004 Thief: Deadly Shadows. The game was made as an attempt to reboot the franchise. \nJust as previous entries, the game takes place in the dark fantasy world with notable steampunk and Victorian era influence. You play as Garrett, the master thief who awakens after one-year slumber caused by accident in one of his missions. He finds out that his hometown is plagued by a mysterious disease “The Gloom.” \nThe gameplay can be described as first-person stealth-action with the heavy emphasis on the variability of completing missions. Sneaking behind the enemies is usually a more effective way of performing tasks than openly fighting with them. Garrett possesses several different tools and weapons like lockpicks, prybar, etc. One of Garrett’s few weapons is bow which has 8 types of arrows and the full range of application from killing and poisoning enemies to putting out torches and distracting guards.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":952,"name":"Shadowrun Returns","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d4b/d4bcd78873edd9992d93aff9cc8db0c8.jpg","description":"Shadowrun Returns is a science fiction tactical RPG. The game became a revival of the original Shadowrun series, as the new chapter had some references to the 1993 Shadowrun. The Shadowrun universe includes several fictional cyberpunk elements because the main action takes place in the future. The game gives an opportunity to assume the role of a shadowrunner and to investigate a mysterious crime. To start a single campaign called Dead Man’s Switch players are offered to create their own character. The story begins in 2054 in Seattle, when the nameless protagonist receives a message from their shadowrunner accomplice Sam Watts, which was triggered by a dead man’s switch. The message is about Sam’s assassination, and the protagonist is aksed to investigate the case for Sam’s 100 thousand of local currency. The investigation will lead players through the story of serial killer Emerald City Ripper to the large-scale intergalactic conspiracy. In the course of the investigation, the character will participate in turn based fights and complete in-game objectives. Although the gameplay is mostly linear, it features some exploration and interaction with the environment.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Harebrained Schemes","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":17352,"name":"Killing Floor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/806/8060a7663364ac23e15480728938d6f3.jpg","description":"In Killing Floor you play as a part of a special team to fight off legions of cloned zombies. Horzine Biotech released an endless amount of clones from the facility and citizens are drowning in this waves of human flesh. Local police are trying to fight them back, but there is no progress. British government decides to build up a special team of fighters to fight off numerous amount of enemies on their territory.\r\n\r\nEvery level in the game has a precise amount of waves according to your difficulty. With each wave, the number of zombies and types will change becoming more challenging to live through. By successfully winning the round and depending on your skills, game awards with cash that you can spend on new weapon and supplies. High variety of classes have added a different gaming style for every player. You can be a Gunslinger and use pistols, Commando that uses rifles or Support that uses shotguns. Every class has their advantages and perks that can be unlocked by levelling it up. As the final wave players must face a boss with a unique mechanic.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Tripwire Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10061,"name":"Watch Dogs 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f52/f52cf6ba08089cd5f1a9c8f7fcc93d1f.jpg","description":"Watch Dogs 2 is an action-adventure open-world game developed by Ubisoft Montreal. It is the second installment in the series and continues the main idea of its predecessor - hacking and hacktivism in an open world.\n\nWelcome to San-Francisco. It is the second city in the United States to install the city-wide operating system named ctOS, which connects everything from your car to your smart home to a global network. Marcus Holloway is tagged by the system as a suspect for a crime he did not commit. Marcus decides to take action and gets together with the hacktivist group DedSec to expose ctOS and its creators.\n\nWD2 offers the player an immense open world which consists of San-Francisco, Oakland, Marin and Silicon Valley. It's the player's choice to navigate the world on foot or on a wide range of vehicles from cars to boats.\n\nIt is up to the player to choose whether to use a lethal or non-lethal approach on a mission as there is always a taser in your inventory and a billiard ball attached to a paracord that knocks enemies out. \n\nIt is possible to hack into any devices that are connected to ctOS. For instance, Marcus can control forklifts, buzz guards phones in order to distract them.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":432,"name":"Grand Theft Auto III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5fa/5fae5fec3c943179e09da67a4427d68f.jpg","description":"Grand Theft Auto III is an open-world action game, a part of the criminal franchise GTA. As the first in the series 3D game with high-quality textures, GTA III became exemplary in its genre. \r\n\r\nThe action is located in fictional Liberty City. Its map is divided into three parts – each becomes available gradually, depending on the storyline progress. The player takes control of the character from the third-person view. \r\n\r\nThe classic feature of GTA III is the ability to interact with the world: explore the map either on foot or by car, contact with other characters, visit weapon stores and shoot everywhere. Although GTA III is another chapter of the franchise, its plot is unique. \r\n\r\nThe story begins with the dynamic bank robbery. During the heist scene, the main character (silent and unnamed for the whole game) gets betrayed by his accomplice Catalina. By good fortune, the protagonist escapes from imprisonment and starts making both ends meet in Liberty City after being deceived. Therefore, his only wish – also the main idea of the storyline – to take the revenge on the former partner.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"DMA Design","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":43877,"name":"Quake Champions","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fba/fbae1bcfae1feffda6a11fbc1c939420.jpg","description":"Quake Champions is a multiplayer competitive FPS developed by Id Software.\n\nThe gameplay resembles the same arena shooter mechanics as the previous installments. For the first time in the series, the so-called champions appear in the game. Each champion has a different amount of health, top speed and a unique ability that can be used once in 20-45 seconds depending on the champion and needs to be recharged after usage. The abilities are designed using the rock-paper-scissors principle with each ability serving as a counter to another. This was done in order to put emphasis on a player's skill and not the chosen character. The game also features character customization system which allows changing the look of any selected champion.\n\nThere is no loadout system in the game whatsoever. Players have to pick up the weapons scattered on the map.\n\nPlayers can download the game for free, yet they will have access to only one Champion, Ranger. The players have to either rent new champions using the in-game currency or by the so-called champions pack that will unlock every in-game character for an unlimited amount of time.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":3474,"name":"Lara Croft and the Temple of Osiris","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1fb/1fb1c5f7a71d771f440b27ce7f71e7eb.jpg","description":"The sequel to Lara Croft and the Guardian of Light, and a spin-off to the larger Tomb Raider franchise. This time, our famous adventurer Lara Croft and her rival tomb raider Carter Bell travel to Egypt to search for the ancient temple, where a magical artifact, Stuff of Osiris, is hidden. The game is set in the temple and its dungeons, designed in Ancient Egyptian aesthetics. Besides shooting monsters, Lara and her partners have to avoid all kind of traps that will immediately remind you of Indiana Jones films. Completing specific missions will grant the player rings and amulets that enhance characters' skills and abilities.\n\nJust like the previous game, The Guardian of Light uses the isometric view. The game allows for a cooperative mode for up to four players. All puzzles are automatically adjusted to the number of players. You can play not only as Lara but also as her friendly rival Carter Bell and two Egyptian gods, Isis and Horus, who were imprisoned in the temple for millenniums by the evil god Set. Their goal is to gather together and revive Osiris, the god who was dismembered by Set, and who can save the Earth from Set's evil. While human characters use firearms and grappling hooks, the gods are armed with the magic Stuff of Osiris.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":906,"name":"Call of Duty: Black Ops III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd6/fd6a1eecd3ec0f875f1924f3656b7dd9.jpg","description":"Call of Duty Black Ops III is a science fiction first-person shooter, the twelfth game in the whole Call of Duty franchise and the third chapter in the Black Ops series. The action begins in 2065, 40 years after the events of the second part, so the game has several historical references. However, the game is not a direct sequel to the previous Black Ops game. Players are offered to assume the role of a CIA special unit trooper trying to get along with the new artificial intelligence DNI (Direct Neural Interface) system and to solve mysteries hidden in it. The whole gameplay is divided into three usual for Black Ops series game modes: Campaign, Multiplayer, and Zombies. The single-player campaign can be also completed in a squad (up to four members). Players are able to choose proper equipment and even customize the character before starting another mission. After the completion, each level could be replayed in a “realistic” difficulty or in a “Nightmares” mode (regular enemies are replaced with zombies).","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Raven Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":28202,"name":"Wolfenstein II: The New Colossus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0e/a0ef08621301a1eab5e04fa5c96978fa.jpeg","description":"Wolfenstein 2: The New Colossus is a singleplayer FPS developed by MachineGames. It is the third installment in the rebooted series.\n\nSet in the alternate 1961 where Nazi Germany won World War II, the game picks up right at the end of Wolfenstein: The New Order. After sustaining heavy injuries in the battle with Wilhelm \"Deathshead\" Strasse, BJ Blaskowicz orders a nuclear strike on Deathshead's compound in order to cripple the Nazi war machine, but he is evacuated by his comrades before the rocket launch. Blaskowicz falls unconscious for 5 months and is woken up by a Nazi attack. The player has to repel the attack and end the Nazi reign over America once and for all.\n\nThe New Colossus features several stealth-action elements, just like the previous title in the series. There are some major differences in the mechanics: now BJ can modify his weaponry on-the-go, dual wield two different weapons at the same time. The cover system makes a comeback. The Protagonist doesn't stick to cover, leaning out of it instead.\n\nThe game offers a linear storyline, but the player is free to complete side-missions in any order they like. Completing these missions is rewarded with new weapon upgrades.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":18272,"name":"Magicka","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c7a/c7a71a0531a9518236d99d0d60abe447.jpg","description":"Magicka is a fun franchise. Based on Scandinavian mythology, we follow a story of four mages that have formed an order to protect Midgard from a warlock. Yet this warlock is just a pawn in the greater game of a demon Assatur, who wants to destroy wants to destroy the homeland of the mages. The game gives few nods towards some other known franchises as Warhammer, Warcraft or even Star Wars.\r\n\r\nGaming process is very complicated. Having no character class as it is, every mage can create his unique combinations from eight different types of magic - water, life, shield, cold, lightning, arcane, earth and fire. Some of them are not compatible such as fire and cold because of their opposing nature, but the game deeply explores the way to create a unique gameplay-style based on your preference. Around the world, you can find magickas - scrolls that contain new spells and magic. Supporting up to four players at the same time it is a very fun game despite having loads of technical issues, like bugs and other problems.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Paradox Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":4544,"name":"Red Dead Redemption","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/686/686909717c3aa01518bc42ae2bf4259e.jpg","description":"Red Dead Redemption is a third-person open-world adventure game which implements the Wild West at its best: it is very much GTA-clone but in bizarre stylistics and the very beginning of the twentieth century. This is the second title of a franchise, being preceded by Red Dead Revolver and followed by Red Dead Redemption 2 coming out in late 2018. \nWe play as John Marston who gradually takes down and take out criminals and those, who crosses his path. Among the combat mechanics, the most interesting one is \"Dead Eye\" — it allows one to point multiple targets out in slow motion and then shoot them simultaneously. \nThe game features 16-players multiplayer and cooperative and also has zombie DLC — Undead Nightmare. Additional content adds two modes to the original game: undead overrun in which you have to survive an infinite amount of zombie waves, and Land Grab in which player has to defend the particular piece of land to gain control of it.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rockstar North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":10548,"name":"Darksiders Warmastered Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f1/1f1888e1308959dfd3be4c144a81d19c.jpg","description":"Darksiders Warmastered Edition is a third person slasher/RPG. A remaster of the original release of 2010. The game features a fictional world, where mythical creatures exist in something resembling our reality.\nThe game’s protagonist is called War, the first Rider of Apocalypse from the biblical stories. His story is tied to his own mistakes, and the player has to restore order and the main character’s good name. Coincidentally, the actions that can be performed by the player include masterful executions, implementation of a wide variety of weapons, and many more brutal exercises of power. The role-playing elements will help the main character progress through the game and add more flavor to the gameplay.\nThe Warmastered Edition, compared to the original game, improves in graphics, performance, and overall quality-of-life features, making the player’s experience most smooth, and allowing to be run on the most powerful gaming rigs.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vigil Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"}]},{"id":11726,"name":"Dead Cells","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f90/f90ee1a4239247a822771c40488e68c5.jpg","description":"Dead Cells is a roguelike adventure title developed by Motion Twin.\n\n###Story\nNot much story is present in the game, as only bits of any information are given out to the players. The game takes place at a remote island, where the players take place of the Prisoner. The Prisoner does not speak, yet he can express confusion and frustration using his body language. The Prisoner is basically immortal, as, in case of death, his head disconnects itself from the Prisoner's body, and gets back to the game's starting area. \n\n###Gameplay\nThe game's heavily inspired by The Binding of Isaac, as stated by the developers.\n\nDead Cells features the procedurally generated environments that are typical for roguelike games, yet it puts a strong emphasis on exploration that is typically found in metroidvanias.\n\nThe players set out to explore the island where a prison was built. As the players come down into the dungeons of the island, they find various loot, fight dangerous creatures, collect armor, abilities, and power-ups. Upon death, the players lose all the loot they had on them. It is possible to find a shopkeep somewhere in the dungeons to purchase new equipment or have some rest. \n\nThe game uses death as a learning experience, as it randomizes the placement of enemies, so the players can't take multiple attempts to complete a level. The developers want the player to examine the enemy behavior and learn how to combat the enemies themselves.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]}]