[{"id":9983,"name":"Blitzkrieg 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b2/5b227d11da35be64e7008797be5f7646.jpg","description":"Digital Deluxe Edition\nA Special single-player mission involving the Dora railway gun, the largest artillery weapon of World War II (under development) Exclusive Commanders  Konstantin Rokossovsky, Erich von Manstein, and Bernard Montgomery (already available)\nUnique combat vehicles  the T-34-76 screened tank, the M6 heavy tank, and the “Sturer Emil” (under development)\nIn-game rewards such as Silver Nickname (your nickname highlighted in silver in chat windows) and a Heroic Leader Statue for your base – an authentic monument of one of the iconic figures from your side of the war (already available)\nAbout the GameBlitzkrieg 3 is an online WW2 RTS made for true admirers of strategic mastery!\nChallenge your tactical skills in historical campaigns and defeat other players or powerful Neural Network AI in competitive matches.\nEach of three campaigns provide a unique blend of PvE, PvP and PvAI missions. Blitzkrieg's impressive Neural Network AI acts like no machine before. In total, game features 60+ historical missions with 200+ authentic combat units.\nBlitzkrieg 3 is being created with the active participation of the player community. Define the way of projects’ development together with us!\nA Neural Network machine named Boris plays at the top player’s level while not using any hidden information about the enemy. General Boris regularly analyzes the gaming session and makes Neural Network-based predictions of the enemy behavior. This approach allows him to think up sophisticated counter-strategies and bring them to life. That makes Boris tough and unpredictable, so he can amaze you over and over again.\nDominate on the battlefield in three atmospheric historical campaigns, that cover the main period of World War II: from the invasion of Poland in 1939 to the triumphant capture of Berlin in 1945. Choose your side of the conflict - USSR, Axis or Allies! Take command over your forces and win the legendary battles of World War II, that were created from archival materials on historically accurate maps. The best strategists will get additional rewards for perfectly cleared missions!\nChoose your side in the largest war in the history and fight against Neural Network AI or real opponents. Improve your tactical skills in the classic Skirmish mode 1x1, 2x2, 3x3, fighting with Boris, friends and other players for control over the map. Master your defense skills in the unique to the strategy genre - Assault mode, where one player attacks and the other defends his fortifications.\nYou will lead more than 200 authentic combat units into battle. All of them were developed based on historical technical characteristics - more than 100 models of armored vehicles and self-propelled guns, 40 different types of infantry and assault squads and variety of different fortifications and defenses. Each unit has performance characteristics reconstructed in detail, such as fire rate, armored capture, field of vision and others that let you feel like a real commander. Assemble and train your army and form your own squads to complete the missions.\nUse every opportunity to defeat the enemy: consider features of the landscape, weather conditions and viewing ranges of different types of forces to carry out the most daring tactical operations. Attack the enemy when he doesn't expect it. Use stealthy scouts and place infantry in the trenches, fortifications, pillboxes and even civilian buildings!\nLearn tactics from legendary strategists! Appoint Zhukov as the commander of your forces and defeat Manstein! In the game available more than 20 commanders, with unique features and combat tactics based on command styles of their historical prototypes. Complete tasks in single and multiplayer modes and earn the loyalty of different commanders. Each can give you useful bonuses and additional features on the battlefield. Rokossovsky, Rommel, Montgomery - the choice is yours! Each commander has his own specialization and favorite combat tactics that make tactics development of the game even more diverse, providing additional opportunities for interesting combinations.http://store.steampowered.com/app/235380http://store.steampowered.com/app/366650/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":7189,"name":"Dance Central Spotlight","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af5/af5244933e2632b12b17c6dbd2006b88.jpg","description":"The newest game in the award-winning Dance Central series focuses on the core dance experience. With more routines per song and a massive library of additional songs for purchase, Dance Central Spotlight lets you customize your dance sessions more than ever before. Break a sweat with an enhanced Fitness Mode including specially authored routines, or use the voice-activated Practice That mode to rehearse difficult moves immediately in-song. And with choreography designed for everyone from new to advanced dancers, anyone can take the stage.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"}]},{"id":795440,"name":"Inside the Backrooms","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/acf/acf37964dfecb90ad094821b3955cccd.jpg","description":"DESCRIPTIONInside the Backrooms is a Co-op online horror game up to 3 players, where you and your friends will fight to escape from the different levels of the backrooms, solving different puzzles with different mechanics in each one.\nThis game is based on the famous creepypasta with many real references implemented such as iconic entities and important elements. You will have to explore each room, look for elements that help you to continue advancing throughout the game and unlock new areas, but the further you go, more dangerous it will be, you must pay close attention in the area, identify each entity and know how to avoid them if you want to survive.\nLook for supplies, store them in your inventory, explore all the rooms, solve puzzles, unlock areas of the map, interact, try to collect everything you find.\nThe main objective of Inside the Backrooms is to engage players with its gameplay, difficulty and atmosphere. There are countless identical rooms with an old, dirty carpet and pale yellowish walls, where at first glance it gives you a gloomy and bad feeling where you realize that it is not a safe place.LEVELSThe game currently has 4 levels, each level is huge and is designed to be more difficult than the previous one and each one with different puzzles and mechanics.\nVIRTUAL REALITYThe game is compatible with VR, for those who want to live the most terrifying experience in the backrooms. If you have an Oculus Quest, Valve Index or HTC Vive device, you can't miss the experience of being trapped in the backrooms in virtual reality.\nENTITIESIn this game you will find several entities, currently 6 entities, all based on the original creepypasta, each entity will have different ways of attacking and manifesting, so it will be important to know it's behavior of each of these and avoid at all costs that several entities finds you at the same time, if this happens, you will have a bad time.\nITEMSIf you want to survive in the backrooms you will need to look for essential items and manage them properly, because if you get short of any of them, it could mean your death.\nThese are some of the items you can find on your journey through the backrooms:\nAlmond Water: Regenerate part of life.\nPills: Eliminate Anxiety\nRadios: Allows communication at a distance with your team\nFlashlight: Allows you to see in dark areas.\nProtection Suit: Allows you to prevent getting radiation on some areas.\nDocuments and Notes: Provides relevant information.DEVELOPMENT ROADMAPThe game is ready to play, but we want to keep improving it to the point where it becomes one of the best games that represent backroom creepypasta. For this reason we will continue to polishing and adding new content to the game, these are some features that are planned to be added throughout the final development of the game:\nNew Entities\nMore Levels\nNew Puzzles and Mechanics\nProcedural Levels\nNew Items\nImprove Gameplay\nLanguage Localization","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"MrFatcat","platforms":[{"id":0,"name":"PC"}]},{"id":563370,"name":"Song of Farca: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/daf/daf55a7aea71625538e58a9f1b4be0fe.jpg","description":"Click to wishlist!\nAbout the Game\nIn Song of Farca: Prologue, players step into the shoes of cyberdetective Isabella Song to investigate the theft of a pet robodog.Players can:hack security systems, personal computers and safes\nrebuild CCTV camera footage\nrun biometric analyses during questioning\nuncover evidence, chase leads and draw conclusions\nDon't let your guard down — victims can turn out to be criminals and suspects might be just one link in a long criminal chain.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Wooden Monkeys","platforms":[{"id":0,"name":"PC"}]},{"id":544024,"name":"Root","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a89/a89aad808360f8ecc72baa54bb9fa364.jpg","description":"A game of woodland might and right.\nPlay the digital adaptation of the beloved tabletop board game. Root is a game of adventure and war where 2 to 4 players battle for control of a vast wilderness.\n\nThe nefarious Marquise de Cat has seized the great woodland, intent on harvesting its riches. Under her rule, the many creatures of the forest have banded together. This Alliance will seek to strengthen its resources and subvert the rule of Cats. In this effort, the Alliance may enlist the help of the wandering Vagabonds who are able to move through the more dangerous woodland paths. Though some may sympathize with the Alliance’s hopes and dreams, these wanderers are old enough to remember the great birds of prey who once controlled the woods.\n\nMeanwhile, at the edge of the region, the proud, squabbling Eyrie have found a new commander who they hope will lead their faction to resume their ancient birthright.\n\nThe stage is set for a contest that will decide the fate of the great woodland. It is up to the players to decide which group will ultimately take root.\n\n\n\nThe most recent conquerors of the forest, the Marquise de Cat plays a game of engine building and logistics while policing the vast wilderness. By collecting Wood they are able to build Workshops, Sawmills, and Recruiters to help her score victory points. Marquise de Cat has the largest army in ROOT, but numbers alone won’t be enough to secure the forest...\n\nThe Marquise de Cat builds a mighty industrial war machine to subdue the forest. Each time the Marquise builds a Workshop, Sawmill, or Recruiter, you score victory points. The more of the same building she has on the map, the more points scored. However, to fuel ongoing construction, the Marquise must maintain and protect a strong, interconnected economy of Wood. While it may be tempting to overwhelm your opponents with sheer numbers, this leaves you at great risk of spreading yourself too thin and ultimately not being able to keep up.\n\n\nThe Eyrie Dynasties once ruled the wood, before the coming of the Cats. They must retake control by capturing territory and building Roosts before they collapse back into squabbling. The Eyrie are proud and bound to the decrees of their leaders. Each leader brings with them different specialties and advantages. The right leader at the right time could lead you to victory, but the wrong leader could cripple your chances of reclaiming the forest.\n\nDuring the Evening, the Eyrie score victory points based on the number of roosts on the map. The greater their presence in the Woodlands, the greater their gains. However, the Eyrie are bound by their Decree, an ever-increasing set of mandated actions promised by their leader. Each turn, they must take all of the actions on their Decree, or else fall into turmoil.\n\n\nThe Woodland Alliance doesn’t take kindly to despots - old or new. Marquise, Eyrie, they’re all the same. Only through the will of the people can this wood be ruled! The Woodland Alliance are masters of guerrilla warfare, they begin slowly but can build into a late-game powerhouse - but only if they can manage to subvert the other would-be rulers along the way.\n\nThe Woodland Alliance works to gain the sympathy of the various creatures of the forest. Each time the Alliance places a sympathy token, they may score victory points. The more sympathy on the map they have, the more victory points they score. Gaining the sympathy of the people requires supporters. These supporters can also be put toward violent ends, inciting outright rebellion across the forest. When a revolt erupts, the Alliance will establish a base. Bases allow the Alliance to train officers, increasing their military strength and flexibility.\n\n\nThe Vagabond is an adventurer to some, a trader to others, and thief to more, and an all-around scoundrel. As the Vagabond, you will explore all over the map, beyond just it's clearings, into dense woods to find items and ruins. You can trade and lend aid to the warring factions of the forest to help you complete your own secret quests.\n\nThe Vagabond plays all sides of the conflict while going on quests to increase his renown throughout the wood. Each time the Vagabond improves their relationship with another faction, or removes a warrior belonging to a faction hostile toward them, the Vagabond scores victory points. You can also complete quests to score victory points. To move and act effectively the Vagabond must manage a pack of items, expand your selection by exploring the forest ruins and providing aid to other factions.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Dire Wolf Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":357246,"name":"Granblue Fantasy: Relink","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5bc/5bc67f772f5086976cf3af2dd967dd68.jpg","description":"“There’s always more to explore in this big, blue world – Let me show you!”\r\n\r\nThe journey continues from your smartphone to your PlayStation 4. Captivating character designs and beautiful environments from CyDesignation, the artists behind the original Granblue Fantasy, come to life in 3D by way of PlatinumGames.\r\n\r\nPlatinumGames and Cygames are teaming up to create a new story starring beloved characters from Granblue Fantasy – sure to delight Granblue and action game fans alike.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Cygames","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":263631,"name":"Batman: The Enemy Within - Episode 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fd/2fd2ac777381270545a5921479e84298.jpg","description":"In this latest chapter from the award-winning studio behind Batman - The Telltale Series, both Bruce Wayne and Batman will be forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigate uneasy alliances while Bruce Wayne undertakes a perilous series of deceptions. Which of Batman’s new allies will you choose to trust? And how deep into the darkness will you let Bruce descend?\nDownload Episode One of Batman: The Enemy Within, a five part episodic game series from the creators of The Walking Dead: A Telltale Games Series, The Wolf Among Us, and Tales from the Borderlands.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":63573,"name":"Kaze and the Wild Masks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/543/5434f5ee96be806c7376e7ab17d924cb.jpg","description":"In Kaze and the Wild Masks, our bunny needs to become a hero when a comet strikes the normally-peaceful Carrotland, turning its plants into enraged living forms, bringing chaos around the place.Invoke the powers from ancient heroes.\nThe Wild Masks unleash skills from the legendary guardians of Carrotland. Kaze will run ferociously like a tiger, cut the skies like an eagle and explore deep underwater like a shark!A tribute to the bouncing and exploration formula.\nFocusing on simple controls schema and challenging levels are the key elements that make it so unique in these modern days. But don’t fool yourself, the game challenges the curious and skilled players making it really difficult to beat.A true love letter to the 90’s.\nKaze and the Wild Masks features a frame by frame modern pixel art graphics and a variety of colorful scenarios, that recovers the essence of 16-bit era and links the past and present generations.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"SOEDESCO Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":62783,"name":"Necrobarista","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df5/df5e02ad3677d5489e835c82691184ab.jpg","description":"A suspense story in contemporary fantasy Melbourne.\nInspired equally by anime and film, Necrobarista is an unique take on the visual novel medium.\nStylized cinematic presentation inspired by anime aesthetics.\nDiscover the world of fantasy Melbourne through dozens of intersecting stories.\nExplore the Terminal through free-roaming first-person scenes.\nFeaturing Goon-sack robots, Alchemical coffee, and Ned Kelly.\nSoundtrack by Kevin Penkin, composer for Under the Dog, Norn9, and Made in Abyss.\nMulti-lingual support: English, Chinese, and Japanese.\n---\n\"You know how, sometimes, games look so good you just want to eat them? You want to print out all the screenshots in glorious, glossy photo paper, and just put them into your mouth? You know that feeling? Yeah, that’s how I feel about upcoming visual novel game Necrobarista.\" - Rock, Paper, Shotgun\n\"I was struck by the quality of the writing in Necrobarista. It's reminiscent of games like 999, both mysterious, dark and sometimes humorous.\" - Operation Rainfall\n\"It looks like what would happen if Persona took over a coffee shop, which is to say, stylish as heck.\" - Kotaku\n\"It’s full of dramatic pauses, sassy dialogue, and a lot of mystery\" - Gamespot\n\"Stellar art design and a compelling cast of characters round out the title, and a dark, synthy soundtrack ties it all together.\" - Paste Magazine","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Route 59","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":62524,"name":"Fantasy Versus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/157/157c7aca7f2e89e563f0d70d7036ce3a.jpg","description":"Fantasy Versus focuses on quick paced 4 vs.4 multiplayer battles.\nUse the 13 solo campaign stages to become familiar with the characters and then team up with your friends or other online players and fight towards victory in Versus!\nPlay as a farmer and fight against witchcraft.\nBecome a hunter and trap your enemies.\nHold your spear high and charge towards victory.\nTame a magical bird and have it fight the enemy together with you.\nMove like an Elf in and out of crowds of enemies with ease.\nHide in the dark and attack without being seen.\nHeal your allies or cause confusion among your enemies.\n13 unique fantasy characters and even more items are waiting for you.\nChoose your character and his items to find your own play style.\nYour epic battle starts now!\nWe have servers available in the following locations:\nUSA (Washington)\nEurope (Amsterdam)\nJapan (Tokyo)\nAsia","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Animu Game","platforms":[{"id":0,"name":"PC"}]},{"id":62493,"name":"Welcome to Light Fields","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e24/e248b1316101d003a652c47f50f60065.jpg","description":"Welcome to Light Fields. Experience real-world reflections, depth, and translucence like never before in VR. Explore the Gamble House, Mosaic Tile House, and the Space Shuttle Discovery. These navigable stills showcase the emerging technology Google is using to power its next generation of VR content.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Google","platforms":[{"id":0,"name":"PC"}]},{"id":60041,"name":"Cliff Empire","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d39/d396e82f266c777d664a97c3449cfe3f.jpg","description":"Message for survivors on the Earth's orbit!\nAfter a nuclear war life on the surface became impossible. A 300m thick radioactive fog covered the Earth.\nOur scientists in the past decade predicted such course of events and used all available potential to build cliffs in the mountain region to restore life on Earth.\nWe are looking for bold active people to manage the process of restoring life on Earth. Join!\n- develop in parallel the economics of several independent cities\n- trade between your cities and the orbital station\n- a dynamic climate change that will test the strength of your cities' economies.\n- choose between ecological and harmful power supply\n- 36 additional university researches to improve the city structure\n- 64 structures for constructing the city\n- 11 goods for trade and consumption\n- possibility of switching between the 3D and the orthographic camera, as well as a free camera for walking around the city.\nThe compact gameplay involves the construction of three small cities in each randomly generated level.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lion's Shade","platforms":[{"id":0,"name":"PC"}]},{"id":51168,"name":"Rhythm Doctor","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f11/f119db085cf27d65115da51ff6752824.jpg","description":"Save lives with your spacebar!\nRhythm Doctor is a rhythm game in a world where defibrillating patients' hearts in sync with their heartbeats has healing properties. Slam your spacebar in perfect time on the 7th beat, and they might just come out okay. But beware - every patient has unique illnesses based on complex music theory: polyrhythms, hemiolas, irregular time signatures...if you don't know what they mean, don't worry. Rhythm Doctor is designed to make you learn music and rhythm theory without even realising it!\n20+ handmade levels, each with their own story.\nEvery level introduces a different concept of rhythm theory in an accessible way\nA large cast of doctors and patients feature in an epic overarching storyline\nPlay solo campaign or grab a friend for drop-in drop-out local multiplayer throughout the whole campaign!\nRobust level editor to make, share, and play community levels! Use your own music, place notes snapped to the beat, and use 50+ different visual effects and backgrounds\nChallenging \"Night Shift\" versions of each level for the brave","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"7th Beat Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":36393,"name":"eXtinction (2002)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d6/8d6442c1b3751105acfb48beff193cb4.jpg","description":"DescriptionExtinction is a short but immersive singleplayer horror game where you play as a young traveler who is exploring an abandoned valley called \"The valley of Extinction. Your role is to explore different places in the valley of Extinction such as a deep, dark forest and an old basement. In these places you will find different possessed monsters who want to kill you. Trying to survive will soon be in your best interest...ContentExtinction contains a linear singleplayer horror experience, in which you will solve different puzzles, explore different, haunted places and most importantly try to survive.\n(USE HEADPHONES FOR BEST EXPERIENCE)\n(Warning : Game contains some gore.)\nIf you are having trouble with the install then you probably need to download visual c++ redistributable, you can do that in this link https://support.microsoft.com/en-us/topic/the-latest-supported-visual-c-downloads-2647da03-1eea-4433-9aff-95f26a218cc0\nIMPORTANT : if game is not working properly when started then you need to wait untill it loads and dont click on it as it may cause it to crash, if movement is unresponsive then press \"escape\" button and click on continue.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Iron Galaxy","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":30713,"name":"RollerCoaster Tycoon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff1/ff150b754eceaf81a15635fe0379f0da.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Chris Sawyer","platforms":[{"id":0,"name":"PC"}]},{"id":27617,"name":"Fire Emblem: The Sacred Stones","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47c/47ce0053278107d77016db3e5e2e0a51.jpg","description":"In Fire Emblem: The Sacred Stones, you must help protect the nation of Renais from the invading Grado Empire. Plan your strategy, choose your units, and then lead your soldiers in to battle. The more experience your soldiers gain, the more you can upgrade their abilities. This time, your soldiers can gain experience by fighting new monsters in the Tower of Valni.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":20967,"name":"Abalone","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/189/189910e44bb5631ddb7de9c6a396feba.jpg","description":"Abalone® is an adaptation of the famous multi-million selling board game!\nDiscover - or re-discover - all the fun of Abalone on PC. Play the classic game or try out the different competition boards.\nThe rules could not be simpler - moving your marbles in lines, push your opponent's marbles off the edge of the board. The first player to push six marbles off the board is the winner.\nReached the end of the official Abalone game mode? Get to grips with the many challenges lined up by the game's creators. Have you got what it takes to succeed?\nPlay a local and online multiplayer game and challenge your friends - may the best player win!\nDevise the most elaborate strategies and let battle begin! Ready to accept the challenge?","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Asmodee Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":19073,"name":"Redline","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/261/26119aeb4aa06dad6efd727c25d4ac2d.jpg","description":"Join the Company!\nIt's 2066 and the world is a different place. While the privileged insiders live in fertile domed cities, the rest of us fight for survival in the wastelands. Rival gangs battle for supremacy, turf control and valuable resources. In order for a young man to succeed he must make the right choices about his future. That's why you want to join the Company.\nIt's on you, rookie. We think you've got the skills, but do you have the guts to go up against the worst maniacs from the lepers, the templars, and the red sixers gangs? We'll give you a piece, a rig, and let you try and prove yourself. No guarantees, but if you pull this off you might have what it takes to be one of us....\nGame Features:\nVehicular and on-foot combat - in and out of cars ANYTIME during gameplay\nEarth-shaking explosions and special effects\n12 deep missions featuring stealth, assassinations, hostage rescues and sabotage\nMassively destructible worlds\nCar-jack enemy vehicles\nOptimized for leading 3D cards and Direct 3D.\nIncludes Soundtrack in both FLAC and MP3 formats.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Accolade","platforms":[{"id":0,"name":"PC"}]},{"id":18876,"name":"Soccer Manager 2016","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/886/886e581a6630648ae4c7f80ea5960e33.jpg","description":"Soccer Manager 2016 - Play for Free, Compete for Real.\nThe most diverse FREE 2 PLAY football management simulator in the world. Take on a top flight club and test your management skills against the best or help a struggling, lower division team fight for glory.\nSoccer Manager 2016 Features\nReactive 2D Live Match Environment\nMonitor your team's performance during live games. React with different tactics and strategies and watch your team adapt to your decisions in real time\nUnique Soccer Manager X-PLATFORM technology\nOur cloud-based X-PLATFORM technology allows you to save your game on any device and continue to play on another. No need to set up a different account for different devices, take your team with you anywhere and play anytime.\nNEW Leagues & Competitions added\nWe have added a host of new competitions from South America right through to Europe.\nNEW 2016 Updated Squads\n2015/16 season squads available in-game. Has there been a change to your squad? Soccer Manager can update changes to squads within days of transfers happening. No need to wait until next season to play with updated players.\nSoccer Manager 2016 is available in 39 languages including: Deutsch, English, ελληνικά, Español (España), Español (Latinoamérica),Français, Indonesian, Italiano,Nederlands,Polski, Português, Português (Brasil), Română, Cрпски,Türkçe, العربية, 中文 (简体), 中文 (繁體), 日本語, 한국어.\nTerms of use - http://www.soccermanager.com/terms-main.php\nPrivacy Policy - http://www.soccermanager.com/privacy.php","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Soccer Manager","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18823,"name":"Jack Keane 2 - The Fire Within","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca6/ca6c1d6e98f8d90b1d59420368c0e3bc.jpg","description":"Jack Keane is back! And his newest adventure is even more fast-paced than ever before!\nFive years after his last adventure with Dr. T, the hapless but incorrigible hero, Jack Keane returns to experience the greatest adventure of his life alongside the beautiful Amanda. However he soon realises once again that nothing goes quite as smoothly as Jack had imagined.\nShanghai, 1899 -The mysterious Chinese city is the epicentre for adventurers of all kinds. Jack Keane, too, has been attracted to the place by rumours of a legendary treasure - or to be more precise, these tales have led him right inside the walls of the notorious Shanghai prison. It is within these walls that the guardian of the treasure, a secretive shaman, has been locked up for years. Unfortunately for our hero, Jack has completely disregarded the fact that it is a lot easier to get INTO prison than out of it…\nAnd this is only the beginning of Jack Keane's newest bizarre adventure: mysterious treasures, ruthless villains, two distractingly beautiful women and tons of clever humour await the most lovable treasure hunter to have ever sailed the seven seas in a comical tour de force around the globe. During his travels, Jack will not only meet old friends, but also encounter new faces such as the elegant city-lady Eve and the brilliant German engineer Carl.\nJack Keane 2 - The Fire Within is set to revolutionise the classic point & click adventure genre. Never has an adventure been as cinematic, fast-paced and humorous, without breaking any of the iconic point & click gameplay rules.\nState of the art 3D-graphics, gripping action-sequences and the typical bizarre Jack Keanesque humour will be an absolute delight to all adventure fans.Features\tControl your characters directly with WASD, or switch to the classic Point & Click-Style\nExperience the kind of love triangle we all know from everyday life movies\nExplore your own mind (literally), chase zeppelins by car, and learn a wide array of fight-stances to counter your opponents’ frantic moves\nCreated by the developers of adventure hits such as Ankh, Jack Keane and Black Sails\nState of the art 3D-graphics based on Deck 13’s revolutionary FLEDGE engine\nThe mix of fast-paced action sequences and iconic point & click-gameplay makes Jack Keane 2 - The Fire Within a truly 21st Century adventure","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Deck 13","platforms":[{"id":0,"name":"PC"}]},{"id":16591,"name":"The Lost Souls","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/971/971bb32641cea488c74041f9aad92093.jpg","description":"What does it feel like to find yourself in hell?\nYou don't feel the wind, you don't see the sun. No more hearing child's laughter.\nNo memory of those who once were your friends and family.\nMain character dies and goes straight to hell during the ritual. Wandering through the dead lands in search of his soul, he finds an old cemetery. There seems to be a way to salvation..","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"GDNomad","platforms":[{"id":0,"name":"PC"}]},{"id":13681,"name":"Sorcery! Part 4","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e5/1e5618e55d6c3feb22e00da11a7f0953.jpg","description":"An open-world narrative adventure into a cursed Citadel of monsters, traps and magic. Fight weird creatures, cast powerful spells that shape the story, cheat death, and explore everywhere. Begin your journey here, or conclude your adventure from Part 3.\n+ Explore freely - go where you want through a hand-drawn, 3D world, creating your own unique story\n+ Totally dynamic storytelling - the story adapts itself around everything you do\n+ Thousands of choices - all are remembered, from the big to the small, and all will shape your adventure\n+ Disguise yourself - adopt different disguises as you infiltrate the Citadel. Characters react differently depending on how you are dressed\n+ Uncover the secrets of magic - secret spells to discover, and new forms of magic to master\n+ Multiple endings, and hundreds of secrets - the game is stuffed with secrets and hidden content. Can you enter the vaults? Will you find the grave of the invisible girl?\n+ Cheat, swindle, deceive, or play with honour - how will you win the trust of the citizens of Mampang? Remember, every choice matters...\n+ New enemies, including mutants, guards, merchants and the undead - each with their own strengths and weaknesses\n+ Adapted from the best-selling gamebook series by legendary game designer Steve Jackson\n+ Swindlestones is back! The game of bluff and deceit is back, with the toughest opponents yet - the Gambling Monks of Effe\n+ Seven Gods, all with different quirks and powers\n+ Start your adventure here, or load your character and all your choices from Part 3\n+ New music from \"80 Days\" composer Laurence Chapman\n+ New 3D hand-drawn maps to explore by Mike Schley\nPRAISE FOR PART 3\n\"This is spectacular, a brave and fascinating evolution of what can only just be described as “interactive fiction” at this point. A bold step away from the confines of the source material, and a coherent and completely novel experience.\" - Rock Paper Shotgun\n\"Sorcery! 3 is unlike anything you’ve ever played. Its mix of puzzle-solving, combat, and choose-your-own-adventure stylings have created a unique form of entertainment that I cannot wait to get back into\" - Pocket Tactics, 5/5\n\"[One] of 2015’s best iPhone games\", TIME magazine\n\"This dragon-centric chapter of Sorcery! 3 does a fantastic job of keeping things dynamic and interesting, and better yet, its new puzzle-like aspect gives it the kind of magical, surprise-filled, combat-related fun fantasy fans live for.\" - Examiner, 5/5\nTHE STORY\nThe Crown of Kings has been stolen by the Archmage, and he intends to use it to decimate the Old World. You have been sent, alone, to break into the Citadel of Mampang and get it back. Armed with only a sword, a book of spells, and your wits, you must make your way through the mountains, into the Fortress, through the city within and finally locate the Archmage himself. If you are discovered, it will mean certain death - but sometimes even death can be overcome...\nFrom the creators of TIME's Game of the Year 2014, \"80 Days\", comes the final instalment in the acclaimed Steve Jackson's Sorcery! series. An interactive story told through thousands of choices, all of which are remembered, where no two adventures are the same. Part 4 can be played on its own as a complete stand-alone adventure, or players can load their games from Part 3 to continue the narrative where they left off.\nAdapted and expanded from the million-selling gamebook series by legendary game designer Steve Jackson, co-founder of Lionhead Studios (with Peter Molyneux) and co-creator of Fighting Fantasy and Games Workshop (with Ian Livingstone).\nUsing inkle's unique inklewriter technology, the story is written in real-time, built around your choices and actions.\nPraise for the Sorcery! series:\n* \"I love this app... better than any gamebook ever was in your head when you were a kid\" - 5/5, Interactive Fiction of the Year, Pocket Tactics\n* Top 20 Mobile Game of 2013, Touch Arcade\n* Top 25 Mobile Game of 2013 Gamezebo\n* Gold Award, Pocket Gamer\n* \"Some of 2013's best interactive storytelling\" - IGN\n* \"inkle's adaptation of Sorcery! takes the genre to a whole new level\" - Kotaku","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"inkle","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":11415,"name":"Strikers Edge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6a/c6a9dd5871c7f9975e73421044290d33.jpg","description":"DODGEBRAWL: Strikers Edge is a game of dodgebrawl! Use whatever means it takes to bring your foe down from your side of the rift.\nGIT GUD: Get your accuracy on point, anticipate your enemies’ trajectories and get the psychological upper hand to annihilate the opposition!\nONLINE AND LOCAL: Fight online or locally as one of 8 unique strikers across 4 different arenas. Achieve greatness in 2v2 with a friend or become the top striker in 1v1!\nPICK UP & MASTER: Each striker has its own set of abilities, weapon, stats and playstyles. Which one will you choose and master?\nChoose among 8 unique strikers, each with it's set of abilities, play style and strategies.\nPlay 1vs1 and 2vs2 matches, obliterate the opposition in online and local sessions.\nSelect between 4 different arenas with distinct layouts, obstacles and hazards to add to your strategy.\nEasy to learn, hard to master: pick your favorite striker and get ready to discover all his hidden mechanics, combos and nuances.\nStrikers Edge puts mind games front and center. Predict your opponents moves and surprise them with yours!\nTwitch Integration: Streamers will be able to interact with their audience when playing: viewers can become a member of the crowd inside the game, throw cheer or boo at the players, vote for match modifiers and more!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":11080,"name":"Realms of Arkania: Star Trail","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e66/e660925ca626f9ffe5f0366771189258.jpg","description":"The united orc tribes attempted to invade the region of Thorwal, but a group of valiant adventurers thwarted their plans during their previous quest. Now the orcs have regrouped and attacked other, more vulnerable areas – Lowangen is occupied and half the Svellt Valley lies in ashes. An elf ambassador summons the party to the city of Kvirasim. To unite the races of the elves and the dwarves in the struggle against a common enemy, they must recover an artifact known as the Salamander Stone.\nYet not all is as simple as it seems: As the party approaches an abandoned dwarven mine that may hold the answers to their questions, someone else makes it clear that not everyone in the country favors a cooperation between the two races.\nStar Trail is a faithful remake of Realms of Arkania’s classic sequel. This hardcore RPG features dozens of talents and spells, distinct races and character classes as well as a challenging isometric turn-based combat system. Obey your orders and succeed in your quest to retrieve the Salamander stone – the peace between elves and dwarves depends on it!KEY FEATURES:Hardcore RPG with isometric turn-based tactical fights\nHand-crafted cities and dungeons to explore in first person view\nMaster dozens  of talents including fighting and magical skills\nMeet countless endearing characters within the lovingly detailed cities and villages\nCreate your characters and manage your party\nPlan your extensive  travels through the realm in detail\nBased on the TDE ruleset as a hybrid between v3 and v4","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10458,"name":"Antihero","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1df/1dfc99d6d2feb08f4ecbe907009b5089.jpg","description":"RUN A THIEVES' GUILD IN A GAS-LIT VICTORIAN UNDERWORLD.\r\nAntihero is a fast-paced digital board game with an (Oliver) Twist. Recruit street urchins, hire thugs, start a gang, upgrade your guild, steal everything... and bribe, blackmail, and assassinate your way to victory. Includes a story-driven campaign, AI skirmishes, and intense online and offline PvP.\r\n\r\n• ONE GOAL. MANY FOES.  Play through the story-driven campaign, skirmish against the AI, and jump online in casual and ranked PvP multiplayer.\r\n\r\n• CHALLENGE YOUR FRIENDS.  Invite friends to play asynchronously or increase the pressure in a Live Match. Set up custom “House Rules” and tailor the game to your tastes!\r\n\r\n• TAKE OVER THE CITY. PROTECT WHAT’S YOURS.  Infiltrate businesses, sneak into estates, set traps, and steal everything. The city’s riches are yours – if your opponent doesn’t take them first.\r\n\r\n• SNEAKERY, STABBERY & SKULLDUGGERY!  Upgrade your guild, recruit street urchins, hire thugs, start a gang… and bribe, blackmail and assassinate the opposition.  There are many paths to the top.\r\n\r\n• MANAGE A HEALTHY ECONOMY.  Spend your ill-gotten riches to hire new recruits, upgrade your thieving skills, and acquire deadly weapons.  Gold is a thief’s best friend!\r\n\r\n• RISE TO THE TOP. See how you rank among all Master Thieves in the in-game leaderboards.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Versus Evil","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":1628,"name":"Hitman GO","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/154/15400993351864d61a0b2a738a8540b0.jpg","description":"Flash sale for a limited time!  Get one of the most critically acclaimed puzzle game on mobile at its lowest price ever!\nGet your daily fix of Agent 47 with this elegant, strategy-based Hitman game!\n5/5 Slide to Play: \"…this is one to check out.\"\n4/5 Joystiq: \"Hitman GO is an impressive debut for Square Enix Montreal.”\n4/5 Pocket Gamer - SILVER AWARD: \"Hitman GO is a clever and refreshingly original puzzle game\"\n4/5 Polygon: \"Hitman GO is a great minimalist take on the series' big ideas\"\n5/5 Pocket-lint: \"Hitman GO is a clever and intelligent way of bringing a much-loved franchise to a mobile platform\"\nBEST GAME DESIGN - 2014 Canadian Videogame Awards\nBEST IOS GAME - 2014 Canadian Videogame Awards\nHitman GO is an award-winning turn-based strategy game with beautifully rendered diorama-style set pieces. You will strategically navigate fixed spaces on a grid to avoid enemies and take out your target or infiltrate well-guarded locations. You really have to think about each move and all the Hitman tools of the trade you would expect are included; disguises, distractions, sniper rifles and even 47’s iconic Silverballers.\nWith Hitman GO, you’ll experience:\n• Challenging puzzles that put your assassination skills to the test\n• Beautiful scale model-style visuals\n• Environments with secret passageways and off-limit areas\n• Agent 47’s tools of the trade: Distractions, disguises, hiding spots, sniper rifles and even the iconic Silverballers\n• Different enemy types with unique and deadly behaviours\n• Different ways of completing each level, silently or forcefully\nPlease note:\n** THIS GAME IS INCOMPATIBLE WITH THE iPod Touch 4th GENERATION **\nHitman GO minimum requirements: iPad 2 and above, iPad Mini, iPhone 4 and above, iPod Touch 5th generation and above.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"}]},{"id":906504,"name":"Nine Sols","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cee/cee02d983e2e1e457caa562420f532fb.jpg","description":"Nine Sols is a lore rich, hand-drawn 2D action-platformer featuring Sekiro-inspired deflection focused combat. Embark on a journey of Asian fantasy, explore the land once home to an ancient alien race, and follow a vengeful hero’s quest to slay the 9 Sols, formidable rulers of this forsaken realm.\nStory\nIn New Kunlun, hero Yi has awakened the 9 rulers of this forsaken realm. To defeat the 9 Sols in the deserted city.\n\n“Becomes one with the way of Tao…”\n\nNew Kunlun, the Solarian’s last sanctuary, has remained quiet for centuries. Inside this vast realm, the ancient gods left mortals with a promised land that is forever protected by the sacred rituals, yet the truth of this world remains unknown to most. Everything changes when Yi, a long forgotten hero from the past, is awoken by a human child.\n\nFollow Yi on his vengeful quest against the 9 Sols, formidable rulers of this forsaken realm, and obliterate any obstacles blocking your way in Sekiro-lite style combat. Explore in unique “Taopunk” setting that blends cyberpunk elements with Taoism and far eastern mythology. Unravel the mysteries of an ancient alien race and learn about the fate of mankind.\n\n\nFeatures\n2D Sekiro-lite Combat: Slash, deflect, charge into enemies and blow them up with the Taoist talisman! Each fight combines fast, brutal action sequences with classic platforming mechanics.\n\nIntriguing Boss Fight: Ready yourself to fight the vicious ancient guardians and gruesome creatures. Be patient and utilize every move in your arsenal, mix up with Yi’s godly bow to defeat these larger than life figures.\n\nTaopunk Setting: When cyberpunk clashes with Taoism, melding sci-fi elements with eastern mythology/fantasy, the experimental genre of Taopunk was born.\n\nExploration: Traverse in the interconnected regions of New Kunlun. Discover secrets, piece together the story behind Yi’s revenge.\n\nAids from inhabitants: Meet interesting NPCs of this world and interact with them to receive upgrades, gain new abilities, and discover useful technology.\n\nHand-drawn Environments/Animations and Manga: Nine Sols is filled with meticulous hand-crafted, anime style landscapes, sprite based hand-drawn animations, blending with Japanese manga inspired cutscenes.\n\nRed Candle Games\nFrom the creators of award-winning psychological horror games Detention and Devotion, comes Red Candle Game’s latest title Nine Sols. The studio aims to deliver a stylized action platformer that’s cohesive and complementary to its lore-rich narrative. It’s an ongoing, most ambitious project from this indie studio.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"RedCandleGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":457900,"name":"Cartel Tycoon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7b0/7b057a481dbc578f25c236c5279799ce.jpg","description":"Cartel Tycoon is a story-driven business sim inspired by the ‘80s narco trade. Expand and conquer, stave off rival cartels and authority attention, earn people's loyalty and try to overcome the doomed fate of a drug lord with too much power.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Moon Moose","platforms":[{"id":0,"name":"PC"}]},{"id":442852,"name":"Mafia: Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/432/432578df07852491ed849b998ef45af3.jpg","description":"Mafia: Trilogy includes the following content.\n\nMafia: Definitive Edition - Lost Heaven, 1930. While scraping by as a hardworking cab driver, Tommy Angelo has an inadvertent brush with the Mafia that showcases a life of reward too big to ignore. A beloved classic faithfully remade and expanded from the ground up.\n\nPRE-ORDER BONUS PACK: The Chicago Outfit Pack\nITEMS FOR USE IN OTHER DEFINITIVE EDITION GAMES: Tommy Angelo’s suit and cab\n\nMafia II: Definitive Edition - Empire Bay, 1943. While back in the states on leave from World War II, Vito Scaletta is pulled into a life of crime to pay off seedy family debts. This fan favorite is remastered with stunning audio and visual upgrades and all DLC is included.\n\nSTORY DLC: The Betrayal of Jimmy, Jimmy’s Vendetta, Joe’s Adventures\nBONUS PACKS: Renegade Pack, Greaser Pack, Vegas Pack, War Hero Pack\nITEMS FOR USE IN OTHER DEFINITIVE EDITION GAMES: Vito Scaletta’s leather jacket and sports car\n\nMafia III: Definitive Edition - New Bordeaux, 1968. To get revenge for the ultimate betrayal, Lincoln Clay must define a new breed of crime family by taking down the old any way you choose. An award-winning narrative experience, reintroduced in one complete package.\n\nSTORY DLC: Faster, Baby!, Stones Unturned, Sign of the Times\nBONUS PACKS: Judge, Jury & Executioner Weapons Pack, Family Kick-Back Pack\nITEMS FOR USE IN OTHER DEFINITIVE EDITION GAMES: Lincoln Clay’s army jacket and muscle car","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hangar 13","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":428820,"name":"LEWDAPOCALYPSE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fc/2fccd38dcb61af7fe2544ab8ba3f9394.jpg","description":"My name is Lara!\nIt all began as an ordinary day in Beaver City.\nBut then, Zombie outbreak starts!\nThe streets become crowded with hungry and lusty evil creatures!\nThis is my last chance for survival...\nHelp me to escape this nightmare!Game featuresDynamic Action Levels, full of bloody violence, you can play with one hand!\nAnimated Erotic Scenes you can unlock by solving puzzles!\nYour choices really matter!\nNew Game + All the Sexy scenes you missed during your first playthrough!\nThree different endings!\nADULTS ONLY!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"KG/AM","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":428680,"name":"Blood Rage: Digital Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/038/0383748e5166a97d818348ca6c05800c.jpg","description":"Ragnarök is coming! The sky is falling and the end is upon you…\nIn Blood Rage, the digital adaptation of the hit strategy board game, you lead a proud Viking clan in their final fight for glory and the right of passage to Valhalla before the world finally comes to its fiery conclusion.\nTake command of your warriors, pillage villages, make good use of gifts from the gods and conquer your place with Odin in Valhalla.\nLife is fleeting, but glory is eternal. Now is the time for rage!\nCreated by acclaimed designer Eric Lang (Rising Sun, Arcadia Quest, Chaos in the Old World), Blood Rage lets you lead one of the seven ancient Viking clans: The Wolf, Bear, Serpent, Raven, Ram, Wild Boar and Stag clan. Each with their own unique miniatures of warriors and leaders.\nIn Blood Rage, your goal is to achieve the greatest amount of glory before the end of the third and final age—and the arrival of Ragnarök.\nEach god is generous in their own way: Frigga provides resources and support, Tyr strengthens your clan in battle while Loki rewards losing battles or punishes the opposing winner.\nDrafting gifts from a god will determine the strategy you want to implement. Choose your cards wisely or deprive your opponents of precious gifts.\nFor your clan, there are many paths to Glory:\n•\tInvade the mythical land of Midgard and its nine provinces, pillaging their villages and the province of Yggdrasil.\n•\tCrush other clans in ferocious battles and encounter legendary creatures from Norse mythology.\n•\tFulfill quests in honor of the mighty gods.\n•\tDie gloriously in battle or from Ragnarök as any Viking was born to do.\n•\tThe only losing strategy in Blood Rage is to cower from combat.\nEarning your place to Valhalla in single-player mode is glorious. Eternal triumph, however, can only be achieved by reaching the top of the leaderboard in ranked online multiplayer.\nFight to gain entry to Valhalla: Pillage, fight, sacrifice… Experience a new type of strategy game where victory can only be achieved by commanding your warriors in the field of battle in the face of final doom.\nWelcome to Midgard: Dozens of 3d scanned miniatures and a dynamic board faithful to the original boardgame.\nMulti-layered strategy game: Blood Rage mixes draft, hidden cards, resource management and its sheer load of trickery. Plan your strategy but be ready to adapt to your opponents’ choices: winning battles is not always the best course of action.\nUp to five Players: Introducing the ‘5th player expansion’ giving the options to play up to five players. All the miniatures from the Ram, Wild Boar and Stag clans as well as the God Gifts cards from the ‘5th Player Expansion’ of the board game are available in this digital edition for free.\nBecome the greatest Viking Leader: Play solo against AI, local multi-player via hotseat or online multiplayer with ELO ranking and leaderboards.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"exozet","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":425200,"name":"A Monster's Expedition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/731/7315a49d2039ded23bd10047880970ec.jpg","description":"A Monster’s Expedition (Through Human Exhibitions) is a brand new adventure tour for monsters who love to learn about humans!\nLearn the ancient art of pushing trees over* and fashion your own pathways with our easy-build bridges.\n*Trees have been pre-weakened by our experts for your convenience.\nThen immerse yourself in human culture with all-new exhibits from our \"Human Englandland\" dig site, each accompanied with expert insights**!\n**Insights is not a legally binding term and may or may not include idle speculation, rumour and hearsay.\nAdorable open world puzzle game from the creators of A Good Snowman is Hard to Build and Cosmic Express\nSimple but deep mechanics packed with possibilities to discover\nHundreds of islands to visit – some right in front of you, others well off the beaten track for true puzzle lovers\nA delightful way to learn about humanity from the outside","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Draknek & Friends","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58770,"name":"WAKING","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a31/a31eae78ab551bba31a91547ff1a24b6.jpg","description":"WAKING invites you to embark on an epic, emotional adventure in your subconscious. Locked in the darkness of a coma, you must battle within a dream against your personal demons in an effort to wake.\nTo prevail against the forces of darkness, you enter into guided meditations, where you collect your most treasured memories and meet the people you love. This makes WAKING the most personal game ever made.\nPresenting a high challenge in combat and the vast world waiting to be explored, WAKING appeals to fans of souls-like games and action RPGs.THE MOST PERSONAL GAME EVER MADE\nAsk yourself -- what are the sacred relics of your life? A handful of dirt from your home town? A pet that died long ago? The eyes of the one you love?\nAt the end of quests, you are asked to close your eyes and listen to a guided meditation where you envision memories from your life. You then enter these memories into the game through a series of choices. These customized memories become your weapons in the game.\nWAKING asks you to confront your fears, your desires, your personal demons, and your childhood traumas. By your side are the people you love, who you can summon to lead you through the unknown.\nTo wake, you must reconnect the synapses of your mind and unlock the mystery of what led you into the coma.COMBAT WITH A SOUL\nWAKING is a game designed for fans of Souls-like games in that it maintains a high (but adjustable) level of difficulty and challenge. Several key differences in the gameplay and combat systems, however, would make it fall outside of the genre.\nOne of the primary differences is the reliance on a telekinetic attack system, which is used in combination of melee and parrying to take down enemies. You will have to approach combat situations strategically in order to prevail.UNIQUE WORLDS\nYour vast, ever-changing Mindscape leads to unique worlds every time you venture into it. The landscapes, caverns, crypts, and dungeons in WAKING are all procedurally generated.\nPlaytime: 20+ Hours","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Jason Oda","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":57177,"name":"Sonic 3D Blast (1996)","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/681/68145c58e234705ed4559a05c043f41a.jpg","description":"Sonic 3D Blast, known outside North America as Sonic 3D: Flickies' Island, is a 1996 isometric platform game for the Sega Genesis and Sega Saturn. The story follows Sonic the Hedgehog as he embarks on a journey to save the Flickies, a species of bird that are being enslaved by Doctor Robotnik. The player must guide Sonic through a series of themed levels to collect Flickies, in order to defeat Robotnik. Though it shares similar gameplay elements with prior Sonic the Hedgehog games, Sonic 3D Blast is differentiated by its isometric viewpoint, making occasional use of pre-rendered 3D models converted into sprites.\nWhile the game was conceived by Sonic Team, most of the actual programming was outsourced to Traveller's Tales. Produced as a swan song for the Genesis, Sonic 3D Blast was developed alongside the unreleased Saturn game Sonic X-treme. When X-treme was canceled, Sega commissioned a port of 3D Blast for the Saturn as a backup plan. Both versions were published by Sega in November 1996, and the game was ported to Microsoft Windows the following year. Sonic 3D Blast was the final Sonic game for the Genesis, and has been rereleased on numerous Sonic themed compilations and digital distribution platforms.\nThough a commercial success, becoming the second bestselling Saturn game behind Nights into Dreams, Sonic 3D Blast received mixed reviews from critics. Reviewers generally disliked its isometric gameplay, citing frustrations with its controls and slow pace, but praised its visuals and music. An unofficial director's cut version developed by the Genesis version's lead programmer, Jon Burton, was released in 2017. It features new gameplay features and improved graphics and controls, among other changes.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Genesis"},{"id":0,"name":"GameCube"}]},{"id":46161,"name":"Golf Story","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff1/ff118744367a9e786b7ff8692efe7d61.jpg","description":"Golf Story combines the sheer excitement of golf with a serious story\nthat plays out over 8 different courses. Play the story of a golfer who\nis forced to give up all that he holds dear for one last shot at\naccomplishing his dreams.\n\nBut all is not so simple in the world of golf. To best today's players\nyou have to be able to keep up with them both on and off the course.\n\nFeatures:\n\nTee up anywhere! You'll be surprised by how many problems can be\nsolved by hitting a golf ball at them.\n\nExplore 8 unique environments, each with their own courses,\nchallenges, people and secrets.\n\nPlay through a dramatic story with a diverse cast of characters.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sidebar Games","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":46142,"name":"Martial Arts Brutality","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/869/869c1eae1cff323dadf21466f16c48c0.jpg","description":"Enter the savage world of Martial Arts Brutality.\nIn this F2P turn based tactical card fighter, you will learn the secrets of Kung Fu, master control of your formidable Chi Energy and perfect the legendary Dim Mak death touch.\nDiscover and collect technique cards, upgrade their awesome powers, and build ultimate fighting decks.\nFight online with or against friends, mock and insult them using the unique taunt system.\nInflict horrific injuries on you opponents and execute many different KO types as you battle your way to becoming a Dragon Grand Master.\nIs your inner warrior ready to meet the challenge? The brutal world of the Martial Arts awaits...\nFeatures\nA unique blend of tactical card play and real time attacking and defensive mechanics\nDetailed human body model allows for horrific injuries and numerous brutal KO types.\nWatch the vicious action unfold with a full fight replay system\nDiscover and collect martial arts cards, including Chi strikes and forbidden Dim Mak techniques.\nMaster a number of styles, including Shaolin Kung Fu, Wing Chun, Shotokan Karate and Taekwondo\nInsane 8 player brawls. ‘Every man for himself’ and team fights.\nBattle against friends and taunt them along the way!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cold Beam Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":43828,"name":"Mindshow","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39a/39a6ccffa5a55e09d5fb8befae414427.jpg","description":"Play to Create! Mindshow is a creative playground for making 3D animation. Publish content to your favorite social platforms faster, more consistently, and with less effort.\nSet it Up\nSet up your scene with hundreds of high-quality assets, or import your own!\nAct it Out\nUse your body and voice to record animation and play all the parts.\nFilm & Export\nGrab your shots with a virtual camera, edit in your favorite program, and share to any screen!\nFollow us!\nInstagram\nTwitter\nJoin our community!\nDiscord","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mindshow","platforms":[{"id":0,"name":"PC"}]},{"id":42295,"name":"F.E.A.R. Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/681/6814837b464aec851df56f9375b4bca8.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Inplay Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":28797,"name":"Eat Lead","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03b/03bdd545863eba7e8ade5d51b6ba6d76.jpg","description":"The Games on Demand version supports English. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". Matt Hazard was once the ultimate video game action hero delighting millions of fans during the 80s and 90s with his bloody and violent games. However, in the last few years of the console cycle, he’s fallen on hard times and has yet to star in a next-gen game.  When he finally gets the call he’s been waiting for to make his official comeback, he finds out he’s not the star,  but the prey. Matt must defeat the game where the programmers aren’t playing by the rules. They’re throwing everything at him in their arsenal from old enemies, to past environments, unfair weapons, and more to make sure he doesn’t make it to the last level.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Vicious Cycle Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":28726,"name":"Conan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a26/a26ad0ff0b4a00cf4a0910d9cbd29208.jpg","description":"Conan is an all-new action combat game featuring a story of adventure, true evil, and brutal, visceral combat. The game follows the journey of Conan the Cimmerian as he fights an epic battle against a variety of enemies and an elusive evil power that threatens to consume the world. Using anything and everything at his disposal, including hand-to-hand weapons, objects in the environment, and powerful elemental magic, Conan takes the fight to his enemies across the massive continent of Hyborea.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nihilistic Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]}]