[{"id":23291,"name":"Mirage: Arcane Warfare OPEN BETA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bfb/bfb2ca2e585d73e46e4d288d41340d3e.jpg","description":"Free WeekendPlay the Mirage OPEN BETA for free, this weekend only!\nSteam Exclusive Offerhttp://store.steampowered.com/app/368420/\nGet 10% off Mirage: Arcane Warfare if you own Chivalry: Medieval Warfare. Mirage releases May 23, 2017.\nAbout the GameIn Mirage: Arcane Warfare, the calm of a strange fantasy world is shattered by ruthless civil war. Warriors armed with steel and magic bring violence and death as they do battle across a fantastical Arabian and Persian-inspired setting of desert sands, market bazaars and grand palaces.\nMirage is a skill-based multiplayer FPS that lets you tear your enemies limb from limb with destructive magic and melee combat. Experiment and find your perfect playstyle between six diverse classes including stealthy assassins, hulking brutes, powerful mages and more. With an unparalleled focus on truly feeling in control of your magic and sword, Mirage demands combat creativity and will challenge you like never before.\nFrom the creators of Chivalry: Medieval Warfare comes a new competitive multiplayer FPS about steel and spells. Exchange-based combat expands from close quarters melee to ranged magic attacks, providing an endless variety of tactical choices, yet instant fun and familiarity for FPS fans.A NEW COMBAT SYSTEM TO MASTER\nMirage captures the true, destructive power of magic and melee combat with the tight control of a first-person shooter. The intuitive combat system demands time and patience to master with skill-based, competitive gameplay that feels like a sword fight from 20 feet away.PHYSICS-BASED RAGDOLLS AND GORE\nMirage’s gameplay crosses the intersection between close quarters and ranged combat. Block any attack – ranged or melee – in bloody combat where you can feel the shock of every blow. Experience the thrill of fantastic battles with an ultra-satisfying, dynamic gore system as limbs fly, blood gushes and heads are dismembered in cathartic, joyful destruction.NEW FANTASY SETTING WITH MULTI-STAGED MAPS\nSteal ancient magic artifacts and assault opulent palaces in multiplayer modes that tell a story of arcane civil war.PLAY AS BRAWNY HULKS, CARPET RIDING MAGES AND MORE\nPlayer choice is everything. With options for every playstyle, battle in a variety of team-based multiplayer modes and harness six diverse character classes with a selection of combat loadouts.12 UNIQUE CHARACTER VOICES - CONTROLLED BY YOU\nExpress yourself with hundreds of voice commands and explore the unique personalities of a colourful cast of characters.PLAY IT YOUR WAY\nFind the battlefield of your choice with a new matchmaking system or classic server browser, then make an entrance with customization options to help your warrior stand out.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Torn Banner Studios","platforms":[{"id":0,"name":"PC"}]},{"id":20271,"name":"Darkness Within 2: The Dark Lineage","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/084/08421230c723ff789560a82efa53aed0.jpg","description":"‘Darkness Within’ is an adventure game series, inspired by the works of celebrated horror writer, H.P. Lovecraft. In this second instalment, ‘The Dark Lineage’, players once again take the role of police detective Howard Loreid, a man tormented by the paranormal happenings around him, in the first volume ‘In Pursuit of Loath Nolder’. Now, Howard discovers that his own terrible past has some connection to the madness that is about to swallow him, yet again.\nThe Dark Lineage will take you to places where the ‘things’ of the past still live, and all the memories that should be long forgotten are still recalled; including a sleepy, depressing town called Arkhamend, a Victorian mansion that conceals dark secrets, a dilapidated building hidden within forbidding, snow-clad woods and dim underground buildings and tunnels. The Dark Lineage is even more harrowing than the previous instalment, so prepare yourself for the descending darkness, this time will be your last...\nDarkness Within 2: The Dark Lineage ‘Director's Cut Edition’ was specifically created for Steam, with many extra features not available in previous versions:\nGraphical refreshes for most environments.\nA brand new location begging to be explored.\nPost screen Chromatic Aberration effect  and Color gradation effect create a more ‘cinematic’ look, drastically improving the overall visual effect.\nMore balanced game-play with new additional puzzles and enhancements.Key features:Unlike Part 1,  Part 2 is no longer ‘point-and-click’, but plays in 3D, with the power of the NVIDIA PhysX engine ; so you can move anywhere you want, light up your way with light sources that cast real-time soft shadows and realistically lift up, push, pull or throw objects.\nBuilt-in Hint System with 3 Difficulty Levels – Players can choose to play in Standard, Detective, or Senior Detective modes.\nDynamic Puzzles and Features: Traditional adventure game puzzles are complimented by deciphering dreams, underlining excerpts in documents to garner critical clues and interacting physically with the environment\nEnhanced Gameplay Experience: Compelling special effects, stunning visuals, and dynamic lighting and shading, in a ‘first person’ game environment.\nEerie Gameplay Atmosphere: An immersive experience is created by a fascinating ‘Lovecraftian’ story, chilling realtime cut scenes, and haunting music.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Zoetrope Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":15882,"name":"Reprisal Universe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/818/818c74c000e220911d83c7caddd03b2d.jpg","description":"Thallos - Once a mighty warrior and leader -\nis now forgotten and cast aside.\nHis tribes scattered and his totems lost.\nAnanke with her brothers Erebus and Tartarus have risen against him,\njealous of the favour their parents had shown him.\nLeft for dead in exile, Thallos survived using the land around him.\nAlthough weak he knew his moment to restore his people\nand recover his totems would come.\nBiding his time, waiting.\nAnd that moment was before him,\nthat moment was now …\nHelp Thallos guide and rescue his people. Using special totem powers you can control nature itself unleashing its full fury on anyone that stands in your way. As you explore distant lands you must gather your lost tribes and Amulets. But be warned, other tribes may not take too kindly to your intentions and will put up a fight!\nCreated in homage to Populous, Reprisal's Universe spans over 34 planets and 184  islands pitting you against 3 other tribes - each with their own aggression  traits. Learn to control the 15 totem powers, upgrading them as you explore and harness the 5 Wonder totems for maximum effect. In this Universe you won't be alone, other explorers will be present helping you to uncover items and leaving their own legacies on islands you will explore.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"electrolyte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9593,"name":"Super Cloudbuilt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/855/8557edeb3312603a2ee14c2c42a73fc9.jpg","description":"Take on the role of Demi, a young soldier who wakes up in the empty shell of a ruined building, in the center of a strange new world, disconnected from her old life and physical body. With each new challenge she overcomes Demi slowly pieces together the future now laid out before her.\n\nThis remastered edition stays true to the original concept with an emphasis on player skill and creativity, but with even more diverse mechanics and a more connected and varied world.\n\nComplete incredible feats of free-running and sharp shooting\nRun through expansive worlds floating above a vast abyss, use your rocket-powered exo-suite to explore hidden paths and collect power ups to boost your performance\nTry your hand at 177 challenges and experiment with 3 game modes\nFeatures lightning-fast, action-packed speedrunning gameplay: use reflexes and speed to compete for the top position in the leaderboards\nWill Demi learn to understand and accept her new world, or question her reality and learn to defy it?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Double Eleven","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":964000,"name":"Remnant II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57c/57c95db99124157a85962eb879733185.jpg","description":"Editions\nAbout the Game\nUnimaginable Worlds. Unrelenting Odds\nRemnant II is the sequel to the best-selling game Remnant: From the Ashes that pits survivors of humanity against new deadly creatures and god-like bosses across terrifying worlds. Play solo or co-op with two other friends to explore the depths of the unknown to stop an evil from destroying reality itself. To succeed, players will need to rely on their own skills and those of their team to overcome the toughest challenges and to stave off humanity’s extinction.\nA mix of methodical and frenetic ranged/melee combat returns with cunning enemies and large scale boss battles. Choose specific gear and weapons to optimize for the different biomes and battles ahead. Bosses will bring high-level players to team up to overcome the challenge and try to obtain the biggest rewards\nPlayers can travel alone or with friends as a team through strange new worlds and beyond, overrun by mythical creatures and deadly foes while trying to stay alive. There are multiple worlds to explore with different types of creatures, weapons, and items. Utilize and upgrade discovered items to take on tougher challenges\nBranching quest lines, augments, crafting, and loot rewards will test the resolve of even the most hardened players in dynamically generated dungeons and areas. Playthroughs will feel challenging, varied, and rewarding as players succeed against unrelenting odds. Various stories are woven throughout the different worlds, encouraging exploration and multiple revisits\nExpanded Archetype system provides players with unique passive bonuses and stunning powers. Multiple Archetypes can be unlocked during play, leveled up, and equipped together for a variety of play styles","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Gunfire Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":586059,"name":"HighFleet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d9/3d9a3ea11db2de2c85083e8fd7f3bb15.jpg","description":"Battle for survival in the skies of a mysterious future Earth in this unique action-strategy game mixing arcade combat, exploration, management and diplomacy. As giant flying ships wage spectacular aerial warfare, a prophecy tells of one who will save the world – could it be you?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Konstantin Koshutin","platforms":[{"id":0,"name":"PC"}]},{"id":244882,"name":"Life is Strange 2 - Episode 1","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5e/a5e8a8fe407e2e55fafe907401f4f843.jpg","description":"The award winning Life is Strange series continues with a long-awaited sequel from DONTNOD Entertainment\nTwo brothers Sean and Daniel Diaz, 16 and 9, are forced to run away from home after a tragic incident in Seattle. In fear of the police, Sean & Daniel head to Mexico while attempting to conceal a sudden and mysterious supernatural power.\nLife on the road is tough and now totally responsible for his much younger brother, Sean begins to realize that his decisions will impact their lives forever…\n1 player\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nLife is Strange 2 © 2018 Square Enix Ltd. All Rights Reserved. LIFE IS STRANGE 2 and LIFE IS STRANGE are registered trademarks or trademarks of Square Enix Ltd. SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"}]},{"id":238395,"name":"Just Dance 2019","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fb/3fb4dc9ffa590c49d16e7adf349b9c44.jpg","description":"Just Dance 2019 is the ultimate party game with over 40 hot tracks from chart-topping artists like Bruno Mars, Cardi B, and Daddy Yankee. Use your smartphone to track your moves and jump into a personalized experience as the game learns your dancing moves and makes suggestions.\r\n\r\nThe #1 Music Video Game Franchise of All Time*, with over 65 million \r\n      units sold** is coming this fall with 40 new and fun songs. Whether \r\n      there's something to celebrate or for no reason at all, Just Dance is \r\n      there for every occasion!\r\n    \r\n      Join a community of more than 120 million players around the world and \r\n      bust out your best moves!\r\n    \r\n      From chart-topping hits to family favorites, dance to 40 hot tracks, \r\n      including:\r\n\r\n        Finesse (Remix) – Bruno Mars Ft. Cardi B\r\n        Bum Bum Tam Tam – MC Fioti, Future, J Balvin, Stefflon Don, Juan Magan\r\n        Bang Bang Bang – BIGBANG\r\n        Mad Love – Sean Paul, David Guetta Ft. Becky G\r\n        Shaky Shaky – Daddy Yankee\r\n        Dame Tu Cosita – El Chombo ft. Cutty Ranks \r\n        OMG – Arash Ft. Snoop Dogg\r\n        Mi Mi Mi – Hit The Electro Beat\r\n        Mama Mia – Mayra Verónica\r\n        Narco – Blasterjaxx & Timmy Trumpet      \r\n        Fire – LLP Ft. Mike Diamondz     \r\n        … and many more to be announced later!\r\n\r\n        With Just Dance Unlimited, the dance-on-demand subscription streaming \r\n        service, you have access to 400 songs and more! Every copy of the game \r\n        comes with 1-month’s access!\r\n      \r\n        This year, multiple creative experts from different artistic \r\n        backgrounds have contributed to creating stunning universes for the \r\n        game, like street artist Chanoir and stop-motion studio Clay \r\n        Animation. More partnerships are to be announced later!\r\n     \r\n        The acclaimed Kids mode is back! The dedicated mode brings a tailored \r\n        interface for the youngest players to enjoy in full autonomy & \r\n        security, together with 8 new kid-friendly choreographies, and \r\n        additional curated songs.\r\n      \r\n        The game learns your dancing habits and suggests content you will also \r\n        like! Follow your instincts and pick the perfect pre-made playlist to \r\n        match your mood, or let the game make recommendations created just for \r\n        you. For every moment, there’s a Just Dance playlist.\r\n      \r\n\r\n        With the new intuitive interface, personalizing your game experience \r\n        has never been so easy. Pick your favorite songs among the \r\n        ever-growing Just Dance catalogue and create your own playlists to \r\n        customize your Just Dance parties!\r\n       \r\n\r\n        The dynamic new home page features seasonal and special event \r\n        playlists, game news highlights and a new community section. Stay up \r\n        to our latest news, jump into our online mode World Dance Floor, or \r\n        follow our thematic & curated playlists recommendations… the \r\n        completely new home screen is the central hub for everything Just \r\n        Dance!\r\n      \r\n        More songs will be added all year long to enrich the game's suggested \r\n        playlists and game modes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":28386,"name":"Halo: Combat Evolved Anniversary","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec0/ec0a3967cf6ac7c79feb73abd25d2630.jpg","description":"Created in celebration of the 10th anniversary of one of the most beloved franchises in gaming history, Halo: Combat Evolved Anniversary is a spectacularly remastered version of the original Halo campaign. Bundled with seven of the most popular multiplayer maps in Halo history ready for Xbox LIVE, Halo: Anniversary will include a bounty of new features including cooperative play over Xbox LIVE, Achievements, new challenges, and new fiction to uncover.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Saber Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":22678,"name":"Heroes of Might and Magic: A Strategic Quest","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b9a/b9a189f597e498b10685df658fd79579.jpg","description":"The realms of Might and Magic are expanding. New lands have been discovered and you must rise to the challenge of conquering them. Beware, for many warlords have risen to test your leadership and tactics. You must carefully manage all the resources at your disposal or you will surely be defeated.\nNow is the time to recruit your heroes, gather your armies and lead them to victory!Reexperience the very beginning of the legendary saga\nA unique gameplay style and interesting story set in the famous Might and Magic universe\nA truly addictive combination of RPG and turn-based strategy elements","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"New World Computing","platforms":[{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":21087,"name":"Midnight Mysteries 4: Haunted Houdini","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6d/e6d8b18d9e56032185e5fd68ccc9b396.jpg","description":"Famed illusionist Harry Houdini knew he wouldn’t escape death forever.  When he promised his wife that he would try to reach her from the afterlife, it was seen as the ultimate stunt   But after years of séances, Bess was never able to reach Harry in this life or the next, and her spirit has come to you in a final plea to reunite her with her partner!\nDigging deeper into Houdini’s past, you’ll find bitter rivalries and interview Harry’s closest friends and his staunchest critics.  Consult famous friends like Sir Arthur Conan Doyle and rival Thurston the magician, while you solve puzzles and track Houdini’s ties to a super secret society.\nHelp Bess and Harry reconnect in Midnight Mysteries: Haunted Houdini!\nKey Features:\nComplete all-new adventure missions by solving puzzles, interviewing apparitions from the past, and searching for tools through beautifully locations that crisscross the globe\nIllustrated strategy guide to help you tackle puzzles and make connections\nIntriguing mystery story","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":20875,"name":"They Breathe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a2/1a27a7b9fe07b5096851d6d16d5400ba.jpg","description":"CAN YOU SEE IT?\nIn the first game by The Working Parts, a lone frog descends into the depths of a flooded forest, not yet knowing the full extent of its tragedy. To survive in a brutal, oxygen-obsessed ecosystem, you must help it see the patterns and hidden truths that make up the rules of the forest - horrible as they may be.\nThey Breathe is a critically acclaimed indie gem risen from the depths of Xbox Live Indie Games. In thirty short minutes, the game leaves it up to you to figure out every part of its increasingly bizarre universe, in order to survive the onslaught of unexpected creatures and ultimately comprehend their true nature. No matter how your descent to the bottom of the forest takes shape, it is guaranteed to give you the chills without a single word of dialog.\nKeep your eyes open, for there is darkness beneath the surface. And you're not at the bottom yet.\nFeatures\nSurreal atmosphere\nNo hand-holding\nHand-drawn HD art\nA story told through gameplay\n''Making of'' feature\nWhat people say\nThis game is only 2$, but I feel like this experience is scarring me for life - Markiplier\n\"The scariest game on earth\" - GameGrumps\n\"I approached They Breathe as a game, but it ended as an experience\" - Whatsyourtagblog.com\n''They Breathe is deceptively creepy [...] disturbing in all the right ways'' - Destructoid\n''Some games evoke such a strange feeling that you can't help but be sucked in. They Breathe is one of those games.'' - XBLIG Silver Award, NeoGAF\n''The atmosphere that The Working Parts has managed to create is praiseworthy.'' - Indiegamemag.com''a journey of discovery that is both rewarding and surprisingly horrifying'' - Plus10Damage","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"The Working Parts","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":18078,"name":"Towns","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19b/19b3b70cea1ddfd104cb219466914a68.jpg","description":"Steam Greenlight\nAbout the GameThe game brings a fresh new take on the city building/management genre by introducing many RPG features.\nIn Towns you manage a settlement on top of an active dungeon. Instead of playing the hero who delves deep into the dungeon, how about playing the town that houses and caters to the hero's needs?\nBoth the RPG and strategic aspects will be fleshed out over a series of sprawling dungeons.\nAttract travelling heroes that will independently explore the dungeons below, fight off monsters, gain levels, special skills and collect the best loot they can find in order to clear the land of all evil!\nCraft unique weapons, trade with exotic items, obtain randomized loot, set up devious death traps and build a settlement capable of holding back the forces that come up from the depths!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Xavi Canal, Ben Palgi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17866,"name":"Word Rescue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24f/24f085fd38b9684a8f3e51e5bca0bef2.jpg","description":"This is an engrossing educational game with vivid EGA/VGA graphics and support for Adlib and Sound Blaster. Using the Duke Nukem graphical system, Word Rescue has state-of-the-art dual-screen scrolling graphics similar to what's seen on the Super Nintendo and Sega Genesis home gaming systems. Even \"grown-ups\" will like Word Rescue!\nPlay as either a girl or a boy. Visit amazing locations on your word-finding adventure, as you hunt for missing words. Dark caves, rocky cliffs, deserts, happy towns, haunted houses, funny factories and creepy dungeons are just some of the places you'll explore.Features\nProgress Through Play: Educational software that's fun to play and designed for a range of players of all ages!\nA World of Words: Three unique multi-level adventures, with 330 words to rescue.\nEverybody's Included: Choose whether to play a girl or a boy character.\nComprehensive Learning: Learn reading, spelling, word meanings, and logic-solving.\nSave Your Progress: Save and restore your progress and use the built-in help and high score list.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Redwood Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17593,"name":"Math Rescue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51a/51ac886e9041126ecccc207605da278c.jpg","description":"This madness can only be the work of... the Gruzzles. In your last tangle with the mean ol' Gruzzles, you stopped them from stealing all the words from our books (in Word Rescue). This time the Gruzzles are taking all the numbers and it's up to you to get them back.\nMath Rescue is for ages 6 and up, and allows for a variety of options and skill levels. One of the options allows you to select the type of problems, either addition, subtraction, multiplication, division, or mixed.\nPlay as either a girl or a boy and visit amazing locations on your math-solving adventure, including undersea, volcanoes and the cosmos.Features\nProgress Through Play: Educational software that's fun to play!\nEverybody's Included: Choose whether to play as a girl or a boy.\nComprehensive Learning: Learn the four arithmetic functions: add, subtract, multiply, divide.\nSave Your Game: Game saves, built-in help and a high-score list.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Redwood Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16320,"name":"Mahjong Destiny","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdf/bdf62b7d9dc076b3e0b218a15d031011.jpg","description":"Mahjong Destiny is a challenging mahjong game telling the story of a young maiden on her quest to meet up with her loved one. Join her as she embarks on her adventure solving classic Chinese mahjong puzzles.\nInspired by the works of Irish poet Thomas Moore, the game includes 74 puzzles to complete with up to 300 tiles to match. With each completed puzzle, your loved one comes one-step closer, and because the tiles are laid out randomly, every game is unique each time you play. Mahjong Destiny is a fun casual game with beautiful graphics and relaxing music. Can you solve all the puzzles on the path to true love?Key Features:Classic Chinese Mahjong fun\n74 puzzles to complete with up to 300 tiles\nInspiring poetry by Thomas Moore\nBeautiful graphics and relaxing music","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":13494,"name":"Mini Thief","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af6/af629cce2fb8ff9a7b3ee209f2481310.jpg","description":"BECOME THE MASTER (mini) THIEF!\nCan you escape with the loot? Play as the Master Thief and steal as much as you can. Burgle houses in order to obtain some sweet, sweet loot.  But be careful not to get caught!.\nYour objective is simple, search the area for items which are exchangeable for money. Each level you pass will increase in difficulty. The more difficult the level is the more loot you will obtain.\nAvoid the owner at all costs! If he catches you, well, you lose everything! including your money!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stranga","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12297,"name":"Hungry Flame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f92/f92c1444ee10cf2ed316a6e21b4bb9e1.jpg","description":"Hungry flame is an action packed, vibrant game. The main goal is saving yourself from the flame that is chasing you.\nYou are the only one who decides which path to take. Get ready for the fast paced environment and avoid getting terminated by the flame. Use your agility to break through different obstacles. Destroy your foes and use the environment in your favor.\nFeatures:\n- Fast paced\n- Numerous, interesting levels\n- Different enemy types\n- Unique obstacles and game mechanics\n- Delightful and challenging","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12292,"name":"Metal War Online: Retribution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/592/592eacff6c4ad634fd87b6fd43a74b80.jpg","description":"Join us in the free game \"Metal War Online\"! We invite you to the world of uncompromising corporate wars!\nUnmatched dynamic shooter with a huge selection of futuristic technology! Millions of players. Only real people as enemies and friends.\nThe action takes place in the near future. Powerful transnational corporations embroiled in a fierce battle for resources. The battlefield became the whole world. Choose any of the powerful war machines, win the battle and lead your side to victory!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"GDT","platforms":[{"id":0,"name":"PC"}]},{"id":11918,"name":"Heaven Forest NIGHTS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d91/d911509fc50744910f8f690b41af42ad.jpg","description":"This is the second chapter from the \"Heaven Forest\" series.\nWhile in the first game we explored the meaning of life, in this second chapter we wonder about the opposite: what is the meaning of death?\nWe are born and we grow up and we step by step we come to terms with the fact that sooner or later we will die. So, in the end, have everyday efforts any meaning at all?\nAnd again: do life and death have a meaning at all? If there is meaning, is it for the good or for the bad?\nWhy is death a presence in our lives?\nIs there something beyond the physical after death?\nThe awareness of our own immanent death is a major feeling. But it's also the beginning of wisdom.\nThroughout the game you'll find scrolls of wisdom that will help you concentrate and think at a more profound level.\nThe human nature will be unfolded once you'll find all the scrolls.\nThe VR device is NOT required in order to play the game.\nVIVE and Oculus are the supported devices you can use.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11568,"name":"CroNix","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/353/3530779564c9ee904c9d23ed31df7846.jpg","description":"Join the battlefield of a post-apocalypse world.\nCroNix is a fast-paced, action-packed multiplayer PvP game where your team battle against another team of players to achieve victory.\nChampions CroNix has a unique set of characters, each with distinctive features.\nCounterpick : You can change your champion during a game. Use this to your advantage.\nCustomizing : Equip Skill cards, install Cells, and wear cosmetic items to create your unique character with different visuals and attributes.\n\nModesThere are 3 modes in CroNix - Survival, Brawl, and Domination.\nSurvival : Kill enemies or refine S.O.D. to reach target score within the time limit to win.\nBrawl : Short rounds of team deathmatch. Win 3 rounds out of 5 rounds to win.\nDomination : Capture and secure as many control points as possible to win score points.\nMore champions and modes are coming soon!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MAGICS","platforms":[{"id":0,"name":"PC"}]},{"id":7919,"name":"Akane the Kunoichi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb5/cb568ba408f09debd65ee8c6d17b2483.jpeg","description":"You are Akane, a Kunoichi ninja secretely loving her master Goro, a noble samurai. One day Goro is kidnapped by the evil Hiromi and her minions - you have to rescue him, but it won't be an easy task!\nMany enemies will try to stop you, and you'll have to be brave to fight against the evil ninjas and huge monsters loyal to Hiromi.\n- 3 secret ninja techniques\n- 5 different environments\n- 5 huge bosses\n- 15 stages\n- 45 hidden Charming Lost Kimonos to catch!!!\nFor more information:\nHomepage: http://www.haruneko.com\nFacebook page: http://www.facebook.com/HarunekoEntertainment\nTwitter: @harunekogames\n\"The bosses in the game are impressive and fun.\" www.ztgd.com - 8.5/10\n\"Impressive Graphics, Visuals & Artwork\" www.gamingtruth.com - 8.5/10\n\"Akane defines what a downloadable title should strive to be: loaded with content, affordable, and genuinely fun.\" www.digitallydownloaded.net - 5/5\n\"those crazy kids at Haruneko know what made well-remembered games worth remembering\" - www.honestgamers.com - 8/10\n\"a really cool game\" www.armlessoctopus.com - 4/5","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Haruneko Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":965470,"name":"Counter-Strike 2","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec4/ec4b02bdb3eb5c6212992c19bc05697e.jpg","description":"For over two decades, Counter-Strike has offered an elite competitive experience, one shaped by millions of players from across the globe. And now the next chapter in the CS story is about to begin. This is Counter-Strike 2.\r\n\r\nA free upgrade to CS:GO, Counter-Strike 2 marks the largest technical leap in Counter-Strike’s history. Built on the Source 2 engine, Counter-Strike 2 is modernized with realistic physically-based rendering, state of the art networking, and upgraded Community Workshop tools.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Valve Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":776260,"name":"F1 22","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3cb/3cbf69d79420191a2255ffe6a580889e.jpg","description":"Enter the new era of Formula 1® in EA SPORTS™ F1® 22, the official video game of the 2022 FIA Formula One World Championship™. Take your seat for a new season as redesigned cars and overhauled rules redefine race day, test your skills around the new Miami International Autodrome, and get a taste of the glitz and glamour in F1® Life.\n\nRace the stunning, new cars of the Formula 1® 2022 season with the authentic lineup of all 20 drivers and 10 teams, and take control of your race experience with new immersive or cinematic race sequences. Create a team and take them to the front of the grid with new depth in the acclaimed My Team career mode, race head-to-head in split-screen or multiplayer, or change the pace by taking supercars from some of the sport’s biggest names to the track.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":690727,"name":"Let's Build a Zoo","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/399/3998fc3dac9da097c980680464e1eeee.jpg","description":"WISHLIST TODAY!https://store.steampowered.com/app/1547890/Lets_Build_a_Zoo/\nAbout the Game\nIt's time to build a zoo! Let out your wild side, and create your own animal empire with this cute, expansive management sim. Import and breed rare creatures, hire the right staff, keep your visitors happy, and deal with plenty of weird and wonderful events. Then try your hand at DNA Splicing, and stitch together over 300,000 different types of animal, ranging from the majestic Giraffephant to the peaceful PandOwl!\nBuild your own zoo with over 500 different animals at your disposal, then splice together over 300,000 different animal combinations\nKeep your animals and your visitors happy, with hundreds of buildings, foliage, path and enclosure decorations\nHire the perfect employees to deal with a variety of life events\nControl everything that happens in your park, from what your animals eat to what eats your animals...\nDecide whether you want to run your Zoo above board... or break the law and pocket the extra cash\nLet's Build a Zoo lets you import a variety of animals from other Zoos around the world! Breed your animals and start families to expand your wildlife and fill your enclosures. But if that doesn't suit you... you could just create animals instead! With DNA splicing at your finger tips, you have the power to bind together over 300,000 different types of animal, creating monstrosities and oddities as you go! Ever wondered what a ChicKaka would look like? Now you can find out!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Springloaded","platforms":[{"id":0,"name":"PC"}]},{"id":309900,"name":"WORLD OF WARSHIPS: LEGENDS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d5/8d5a29af32d359d57d196f56876c9639.jpg","description":"Experience epic naval action in World of Warships: Legends, a global multiplayer free-to-play online game where you can master the seas in history's greatest warships! Recruit legendary commanders, upgrade your vessels, and stake your claim to naval supremacy with or against players around the world. PS Plus is not required for online play, so there's nothing stopping you from setting sail today!\nLIMITLESS CONTENT\nHelm dozens of warships from the 20th century's most powerful navies, set sail for glory across stunning oceanic vistas and soundscapes, and enjoy regular free updates.\nCHOOSE YOUR COMBAT STYLE\nTake control of destroyers, cruisers, or battleships to  best suit your playstyle, from a guns blazing approach, to more careful and methodical attacks, and more.\nTURN THE TIDE IN EPIC 9 V 9 BATTLES\nJoin forces with friends to challenge players around the world, and work together to devise strategies and plan attacks to outgun your opponents and turn the tide of battle.\n3D Display with compatible 3D glasses (sold separately) required for 3D features.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1 player\nNetwork Players 2-18\n25GB minimum save size\nDUALSHOCK®4\n3D Game\nOnline Play (Required)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2019 Wargaming.net. All rights reserved. 'World of Warships', 'World of Warships: Legends', 'Wargaming.net' and 'Wargaming' and their respective logos are trademarks or registered trademarks of Wargaming. You may not use or display such trademarks in any manner, except as expressly permitted in legal documents of Wargaming. All third party trademarks and service marks that appear in the game are the property of their respective owners and all rights in them are reserved.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Wargaming.net","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":60782,"name":"Battlefleet Gothic: Armada 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c02/c025c7fd9d444603c173a23497904e9c.jpg","description":"About the GameBattlefleet Gothic: Armada 2 is the new real-time strategy game adapted from Games Workshop’s famous tabletop game that portrays the epic space battles of the Warhammer 40,000 universe.\n\nExpanding on the groundwork laid out by the first game, Battlefleet Gothic: Armada 2 is a full-blown sequel - bigger, richer, more impressive and more ambitious than the original game. It will include, at launch, all 12 factions from the original tabletop game and its expansions it is based on: the Imperial Navy, Space Marines, Adeptus Mechanicus, Necrons, Chaos, Aeldari Corsairs, Aeldari Craftworld, Drukhari, the T’au Merchant and Protector Fleets, Orks, and finally, the Tyranids.\n\nThe latest dramatic story development in the Warhammer 40,000 universe, the Gathering Storm and the 13th Black Crusade, serves as the canvas for three extensive and dynamic campaigns with high narrative values, focusing on the Tyranids, the Necrons, and the Imperium. Explore the systems in the Eye of Terror, with or against renowned characters such as Belisarius Cawl, Gulliman and more.\n\nWith bigger battles, refined gameplay, improved multiplayer modes and features for a better and more balanced online experience, as well as improvements across the board and even more customisation options for fleets and ships, Battlefleet Gothic: Armada 2 promises to be the ultimate Warhammer 40,000 space battle experience.\n\nMAIN FEATURES\n\n* The ultimate Warhammer 40,000 space naval warfare experience\n* All 12 factions from the original tabletop game\n* Three dynamic solo campaigns (Tyranids, Necrons and Imperium)\n* An ambitious, full-blown sequel featuring epic battles with far larger fleets\n* Refined and improved gameplay, including new choices for ship customization\n* Improved multiplayer modes and features for a better online experience\n* The first videogame in Games Workshop's new \"Gathering Storm\" setting","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Tindalos Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":53378,"name":"Lego Star Wars II: The Original Trilogy","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d57/d5790e7e5a2b544792d99c54ab39faf0.jpg","description":"Lego Star Wars II: The Original Trilogy is a Lego-themed action-adventure video game developed by Traveller's Tales and published by LucasArts and TT Games Publishing. It was released on 11 September 2006. Part of the Lego Star Wars series, it is based on the Star Wars science fiction media franchise and Lego Group's Star Wars-themed toy line. It follows the events of the Star Wars films Star Wars, The Empire Strikes Back and Return of the Jedi. The game allows players to assume the roles of over 50 Lego versions of characters from the film series; customized characters can also be created. Camera movement was improved from its predecessor—Lego Star Wars: The Video Game; and the concept of \"vehicle levels\" was explored more thoroughly. The game was revealed at American International Toy Fair 2006. Promotions for the game were set up at chain stores across the United States.\nLego Star Wars II was critically and commercially successful; it has sold over 8.2 million copies worldwide as of May 2009. Critics praised the game for its comedic and \"adorable\" portrayal of the film series and for their preference of the original trilogy to the prequel trilogy. However, the game's low difficulty, and its Game Boy Advance and Nintendo DS versions in general, were received more poorly. The game received awards from the British Academy of Film and Television Arts and Spike TV, among others. A mobile phone adaptation, Lego Star Wars II Mobile, was later developed by Universomo, published by THQ, and released on 19 December 2006. Lego Star Wars II and its predecessor were compiled in Lego Star Wars: The Complete Saga, released in 2007.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"}]},{"id":20846,"name":"Mystery Masters: Psycho Train Deluxe Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23f/23f27b844f5c79f729487c6879294241.jpg","description":"Don't let your fears get the better of you. Don’t look away, no matter what you see. This train is about to take you on a journey into the unknown!\nIt started like any other journey. It was supposed to be just another trip through the peaceful countryside. But this train had a most unusual passenger, and he’s about to take you on a very different kind of trip. This sinister supernatural being has taken your daughter, and only you can untangle the web of secrets he has created aboard the Psycho Train!\nTo rescue your daughter, you’ll have to explore the train and its abandoned station, search for well-hidden clues, and solve mind-bending puzzles. Each step forward will reveal more of the shocking truth behind your daughter’s disappearance. Do you have what it takes to ride the Psycho Train to the end of its journey? Can you save your daughter before the malevolent villain fulfills his evil destiny? Buy a ticket for the Psycho Train, step onboard and prepare for the ride of a lifetime!DELUXE EDITION FEATURES: Experience a pulse-pounding story brimming with suspense and surprises!\nExplore the mysterious train. Discover the fate of the vanished passengers and crew, as well as your abducted daughter!\nExplore puzzle-packed locations and search for cleverly concealed hidden objects\nTry your hand at deviously clever mini-games\nExperience a high-speed psychological thriller that pits you against the creepiest villain ever!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20161,"name":"The Moon Sliver","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be4/be4f9823ef2284127ce95f4efaaf9a4f.jpg","description":"*The Music Machine--the follow up to The Moon Sliver--can be purchased here*\nThe Moon Sliver is a short narrative-focused non-linear exploration game, with elements of horror.  It features a unique narrative mechanic that blurs the line between story and exploration, where interacting with objects and even simply moving around will reveal fragments of narration.  As you piece these fragments together, a story of guilt, loneliness, and faith begins to take shape.  And it becomes increasingly obvious that something is hunting you...\nThe Moon Sliver is best thought of as an experiment in exploration-focused storytelling, blurring the line between novelette and game.  It seeks to tell a deceptively complex, poetic story in a literary fashion, through an interactive medium.  It rewards players who ask questions and actively seek to figure things out for themselves.\nExplore the island, keep your flashlight charged, wait for night to fall. Discover answers.\nThis is not a Unity Asset Store collection.  Modeling, music, environments, and programming were done from scratch.  Textures were based off of stock photos.  Sound effects were manufactured from creative commons samples.\nThe original soundtrack for The Moon Sliver can be downloaded at https://davidszymanski.bandcamp.com/.  Or, the extended soundtrack (featuring music not included in the original game) can be downloaded as DLC","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"David Szymanski","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19456,"name":"Avadon 2: The Corruption","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c26/c263c8d4edda953d65a1833f82fed3d9_14YFLWc.jpeg","description":"Avadon 2: The Corruption is a huge, indie fantasy role-playing adventure, the second chapter in the epic Avadon trilogy. You will serve the keep of Avadon, working as a spy and warrior to fight the enemies of your homeland. As a servant of the Black Fortress, your word is law. Experience an exciting fantasy role-playing adventure as you try to save your homeland from civil war and fiery destruction.\nAvadon 2: The Corruption is an epic fantasy role-playing adventure in an enormous and unique world. You can choose from five different character classes, each with dozens of unique spells and abilities. Explore cunning dungeons, hunt for hundreds of magical artifacts, and travel through an enormous world, full of secrets. Avadon 2 features many different endings. Save your people, or betray them. The choice is yours!Key Features:\nEpic fantasy role-playing adventure in an enormous and unique world.\nFive different character classes, with dozens of unique spells and abilities.\nUncover the fascinating histories of Avadon and the many lands of Lynaeus.\nMany different endings. Will you be loyal to Avadon or switch sides and bring it down? The choice is yours!\nDozens of side quests, dungeons, and secrets to discover.\nHundreds of magical items to find. Use powerful crystals to make your artifacts even more powerful.\nHuge adventure with lots of replay value. Experience with Avadon: The Black Fortress is entirely unnecessary to enjoy Avadon 2.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":17695,"name":"Madballs in Babo:Invasion","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfd/cfd127df10a1db210c1ea8ff2a2eb696.jpg","description":"The spiritual successor to the massively popular freeware top-down shooter BaboViolent2, Madballs in Babo:Invasion is an arena based 3D shooter offering players a satisfying and immersive experience in both single-player and multiplayer, including 'Invasion Mode' where players are able to design their own combat maps almost instantaneously by placing a combination of map tiles to create a never-before-seen map before gameplay starts. Truly, no two games are ever the same.\nFeaturing the recently re-released Madballs™ characters, Oculus Orbus™  and Horn Head™, from the popular 1980s toys best remembered for their outrageously bad looks and graphically colourful names, Madballs in...Babo: Invasion is a feature laden 'casually hardcore' action shooter.\nKey Features:\nSingle Player — Hours of repeatable gameplay through 10 epic levels\n2-4 Player Online Co-op —  challenge individual campaign levels with your friends or play the whole campaign in ‘Enduro’ mode\n16 Player Multiplayer —  21 maps to match all game sizes\n'Invasion' Mode —  the signature mode of the game, players take turns placing map tiles to create a unique multiplayer map prior to each match\nVoice Chat — Talk to the other players in-game\nClasses —  10 character classes (each with 2 special abilities) over two warring factions, with each faction having 5 unique weapons each with two distinct firing modes\nMadballs Characters —  Oculus Orbus™ and Horn Head™ from the infamous 80’s toy craze as in-game characters\n5 Archetypes —  Assault, Heavy, Runner, Flyer, Support\nDeployables — active (rocket turrets) or passive (healing towers) can be placed in Invasion mode\nUnlocks and Secrets —  50 unlocks and 50 Secrets to find during campaign gameplay\nAction —  emphasis on fast-paced, visceral action that is easy to pick and play, yet offers a real strategic challenge for hardcore gamers\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Playbrains","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16998,"name":"Trouble In The Manor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/897/8970a119caf1177f9401a324a4dbe8d3.jpg","description":"Trouble In The Manor is an online multiplayer game which takes place in a spooky far away manor. You are designated one of three roles upon each round: innocent, bloodhound, or murderer.\nIf you're INNOCENT, your job is to seek out murderers by any means necessary, finding any items on the manor grounds to aid other innocents and calling a hit on murderers once you have enough evidence or killing them yourself.\nBLOODHOUNDS are the same as innocents with the exception that they have an advantage with DNA devices that allow them to compare DNA against bodies they've found or any DNA that is left in an area by a murderer.\nIf you're a MURDERER, your job is to kill every innocent and bloodhound in the round as they can. They have a selection of items they can buy in the store with currency found within the manor. These items range from weapons to traps to disguising devices.\nA MURDERER also has the choice of transforming into a VAMPIRE by awakening the vampire that sleeps in the basement coffin. Vampires can turn other innocents into vampires and help the murderers quest for blood.\nWork together, trust no one.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Charyb Games","platforms":[{"id":0,"name":"PC"}]},{"id":16933,"name":"Darkwind: War on Wheels","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f3/4f3c6ebd3398f2f4a604e60cdab6cca6.jpg","description":"Battle for survival and supremacy in a gritty post-apocalyptic world of vehicular combat where strategy and tactics determines who wins.\nDarkwind is a simultaneous turn-based, physics-based game. It is often described as \"X-Com meets Mad Max\" or \"Car Wars [1980s boardgame] Online\".\nDarkwind is the only car game we know of that combines accurate physics with turn-based play. Not just turn based racing and Death-racing (with multiple cars), but also combats with up to 20 vehicles is where you realise why turn based is a must in this game. Running 10 trucks at once through a slaver ambush in Badlands, managing speed, steering, gun fire from anywhere up to 8 points on a truck would not be possible in real time.\nManage your gang, train your characters, design your own cars and scavenge for parts. Make your fortune in racing, deathracing and arena combat leagues, or venture into the wilderness and engage in tense multiplayer battles with pirates, traders and other players.\nTrade for parts, cars and weapons in the dynamic economy of a world where your characters will age, sustain permanent injuries, and die. The detailed weapon stats, and the detailed combat system with physics, critical hits, injuries and healing, psychology, leadership and perma-death ensures a strategic challenge like few other games.\nAward winning in the indie gaming community, acclaimed in the main-stream computer gaming press and praised in the war-gaming media: play it yourself to find out why.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Psychic Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16239,"name":"Minimum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9c9/9c9ecf07ffbd686e6debb1fbe4486f6d.jpg","description":"Are you a fan of old-school twitch shooters like Unreal Tournament and Tribes? What about team focused MOBAs like DotA and League of Legends? Would you like to play a game that combines elements of both genres while adding crafting, customization, giant robots and a bold new art style to the mix?\nOf course you would, and Minimum is just the game you've been searching for!\nMinimum focuses on fast-paced shooting fun and a robust system of in-match crafting, team objectives and customizable roles to create a rich and rewarding PvP experience. You'll find a bunch of interesting weapons to collect and customize, armor sets to mix and match, a solid core game mode known at TITAN MODE and more all wrapped up in a unique, minimalist artistic style that's more than the sum of its parts. Some of our coolest features include:Customizable Weapons\nCraft dozens of lethal weapons with unique abilities and roles to best fit your personal playstyles. Each weapon has 5 power levels that are activate during kill streaks, increasing your power making you a force to be feared. Be careful though: weapon power levels are lost upon death, so with great power comes great risk!Blueprint Crafting System\nGather materials from fallen foes and defeated objectives to craft and upgrade armor sets over the course of a match. Each set of armor has different benefits and weaknesses that can emphasize your favorite playstyle or counter what your enemies are trying to do.Titan Mode\nBattle in epic matches centered on the your team's Titan, a giant, destructive robot that confronts the enemy's Titan. Players can power up their Titan by performing tasks in-game, can defend their mammoth ally by killing enemy players, and can attack enemy Titans directly. The teams compete until one side's Titan reaches the enemy base and destroys it!5v5 Competitive Gameplay\nCreate cunning strategies with your teammates and define your unique role on the team by combining different weapons, armor and devices. Support your teammates weapons that increase drop rates for materials and powerups, defend your Titan with armor that grants additional health and survivability, scout enemy positions with weapon and armor that increase speed and allow for double or triple jumps, or simply go glass cannon and dish out as much damage as you can!A Player-Focused Development Team\nWe want Minimum to be the most player-focused game on Steam! Join us on our Steam community discussion forums to talk shop, weigh in on new features, report bugs and balance problems or just chat. Minimum is a game that will evolve with its community, both while in Early Access and beyond.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"TimeGate Studios","platforms":[{"id":0,"name":"PC"}]},{"id":15874,"name":"Machina of the Planet Tree -Planet Ruler","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/286/286a31470b5414774fcb2f0424def38f.jpg","description":"The \"Old World\" was a world with an advanced civilization, but after its destruction there was little to no evidence left of its existence.\nThat world was created from the blessing of the ether energy provided by the Planet Tree, Esthanatelle.\nAfter the destruction of the \"Old World,\" the Esthanatelle Order, worshipers of the Planet Tree, took control of the world.\nDuring that time, \"Attributes,\" relics of the \"Old World\" were being excavated in ruins everywhere, and the Order established Halbern Machinery Academy to research these \"Attributes.\"\nThe stated purpose of the Academy was the management and control of \"Attributes\" but, as it began to bring more places under its control, gradually the Order's control on it lessened and the Academy soon began to act independently, as a governing institution over a large part of the world.\nAt the height of all this, Cram Lanvelouche, a genius S-Rank Mechanician from the Halbern Machinery Academy; the legendary Attribute, \"Machina;\" and the Planet Tree become intertwined in a great spiral...\nMachina of the Planet Tree -Planet Ruler- is the first in a series of several games by the group Denneko Yuugi. A combo-based RPG that focuses on action and flashy attacks, Planet Ruler takes many elements from classic Japanese RPGs and combines them in a fast-paced and colorful new world!\nFeatures a unique action point-based combo system!\nWield an array of dazzling moves to triumph over your foes!\nExplore Halbern and meet its colorful inhabitants.\nEnjoy catgirls conversation between your party amid exploration with unique skits!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Denneko Yuugi","platforms":[{"id":0,"name":"PC"}]},{"id":14760,"name":"Halfway","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/583/5836b228128e94ac799e896adc58337b.jpg","description":"Halfway is a turn-based strategy RPG taking place a few hundred years into the future. Humanity has begun to colonise new worlds and until now, they were alone…\nIn Halfway you take control of a small team of survivors faced with a violent invasion onboard the colonial vessel Goliath. As their leader you will guide them through the dark and cramped corridors of the ship to slowly take back control.\nIf you have any hope of surviving, you’ll have to fight, face your fears and outsmart the enemy!\nKey features\nTactical turn-based battles are at the core of Halfway. Use cover, position, equipment and skills to your advantage in your battles.\nUnique characters: Your team is formed of unique characters you pick up along the way. Each one of them brings their own story, skills and experiences to the journey.\nFind yourself in the middle of an engrossing story-line. Step by step you’ll uncover the mysterious events that took place and what it means for you and all of humanity.\nImmerse yourself in 10-14 hours of gameplay in a beautiful pixel art environment with a lovely atmospheric soundtrack by Gavin Harrison\nModding: Map Editor and full Steam Workshop support for your own custom campaigns and missions","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Robotality","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14655,"name":"Russian Horror Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/563/5635b5358652f70b87b50e3bd4ac881c.jpg","description":"Russian Horror Story - visual novel based on true story.\nYoung and talented teacher Ivan Naumov live quite well in Finland. But it's nice to return to their homeland, to live in a Moscow apartment, venture into its repair, wait beloved wife and know that everything in life is good... Until that moment, until you hear the cry of a woman who cut off her hand. Since then begin the main events of the game. Now it's your life and the lives of your loved ones will depend on the decisions taken by thee. Alas, the home does not meet all with open arms.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dagestan Technology","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14563,"name":"Stephen's Sausage Roll","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87d/87dcf05a48b9178d6ac72d8595d4e055.jpg","description":"A simple 3d puzzle game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"increpare games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":11300,"name":"Clickdraw Clicker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bc/4bc67bd0906495d0975f906416706b89.jpg","description":"Game InformationClickdraw is an addictive completely RNG western clicker game\nTo play the game you select a location that you think the enemy will move to and a location that you want to move too, when you draw your weapon if you select the location that the enemy moved too then you will hit them and vice versa.\nEach enemy has a different skill that you will have to overcome, the goal is always to hit the enemy 3 times but some enemies wear armour that you will have to get through, if you get hit 3 times you will lose\nIt also has local multiplayer, just don't let your friends see where you clicked!\nIt's Simple But Addictive.Trading CardsYes This Game Has Trading CardsAchievementsThis game is great for Achievement Hunters! it has lots of achievements!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ColloseusX","platforms":[{"id":0,"name":"PC"}]}]