[{"id":14495,"name":"World War I","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2aa/2aa806b6e38b92294013d1306d17cf58.jpg","description":"World War I is a real-time strategy based on the modified version of the well-known Blitzkrieg engine.\n\nHumanity did not know any military conflicts similar to this one: the interests of dozens of countries got involved. For the first time, tanks, aviation, dreadnaughts and chemical weapons were used in battle. Warfare has become really massive. World War I lasted 4 long years and as a result, 3 Empires disappeared from the world map. The game World War I covers these historical events of 1914-1918 in over 30 missions grouped into 3 campaigns and one additional chapter. As a commander leading the forces of Germany, Russia or Allies, the player must be prepared to prove their military leadership skills on the battlefields of Europe.\n\nA wide range of tactical elements is at your disposal: organize the baseline, set priorities in targets and set up advanced defense lines. Light cavalry will give you speed and maneuverability in offense, artillery provides additional defense and fire support and armored vehicles help with suppressing fire against enemies.Features:RTS based on real events of 1914-1918\nRunning on the modified version of famous Enigma Engine (Blitzkrieg series)\nThree campaigns: Entente, Russia and Germany\nDozens of units at your disposal, including cavalry, armored vehicles and air support","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Dark Fox","platforms":[{"id":0,"name":"PC"}]},{"id":12378,"name":"Senza Peso","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cc/6cc37ea902d377c7e48656eaf95fac08.jpg","description":"As a soul transitioning into the afterlife, Senza Peso shepherds you on a spiritual journey through a beautiful and foreboding dark world of lost souls and redemption.\nIn this VR adaptation of the short film mini-opera by Cory Strassburger & Alain Vasquez, you become the protagonist and personally experience the metamorphosis from death to eternity.\nThis is an enhanced re-release of the highly regarded 2014 VR experience that has been a go-to showpiece for many in the VR community.\n______\nViewer Comments:\n\"dudes.. we need more of such spiritual experiences! nobody has words for how impressive this mini opera is.” - KrisTiasMusic\n\"Majestic. As. Fuck.” -p1mpslappington\n\"Killing it as usual mind blowing work People! That's now three of the most memorable VR experiences!” - HAWKEYE481","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kite & Lightning","platforms":[{"id":0,"name":"PC"}]},{"id":11734,"name":"Drop Hunt - Adventure Puzzle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6e/a6ed75b4307186bc60cb07d9998accba.jpg","description":"Be prepared for next impossible challenge in the adventure of “Drop Hunt”.\nChallenging game in a brain puzzle style. You will need to solve eighty exciting puzzle levels that are spread across four various locations - pizza, fridge, desktop, glass, to restore the ELEXIR. The amazing animation and challenging gameplay of \"Drop Hunt\" will engage you right after the first level.\nDROPS are moving together! The task is pretty simple. All you need to do is to match colored droplets into their corresponding color jar.. But, do you think it’s so simple? Try this puzzle quest and see whether you’re strong enough to achieve the game aim… This appartment is a brain workout.\nFind “donuts” to solve hard levels.\nAvoid obstacles and get special elixir.\nUse “Stepback” to go back or use extra moves.\nUse arrow to Jump to other color jar.\nUnlock new elements in each new chapters!\nAccess all the divine new content! Use all the available elements for current level getting into the next room and discovering new more adorable levels!\nIn this version:\n* Be ready to overcome 80 LEVELS in four DIFFERENT locations!\n* Train yourself with LOGICAL PUZZLES and brain teasers!\n* Have FUN with cute characters. Never get bored!\n* Enjoy cute animation and the AMAZING ATMOSPHERE!\n* Splash around & Get pop rewards!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Oriplay","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":11310,"name":"Overfall","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b2/6b2dfb9913b612f0731d95432f2bcd48_I9t0LqX.jpg","description":"Overfall is a fantasy role-playing game of rough diplomacy and tough action. Explore, negotiate, and fight your way across the high seas!\nYou will lead two heroes on a journey across the high seas in search of their lost king. You will encounter people of all breeds and all creeds; ally with them or crush them without mercy. You will face many dangers; survive them and you may unlock new characters, weapons and skills. In a world where death is permanent, you must return to the beginning and make a fresh start. The heroes you choose, the weapons you unlock and a world that is randomized mean that no two adventures will ever be the same. Key Features  A huge, dynamic world to explore, ruled by a number of races in constant conflict - it’s up to you to help or betray them\nChallenging and addictive turn-based combat - careful strategy and cunning skill combinations are the key to victory against your foes!\nPermanent hero death, procedural world generation, and high replay inspired by classic roguelikes\nInteractive story encounters where the choices you make and the allies you recruit ensure no two journeys are quite the same\nUnlock new classes, weapons, trinkets and skills as you progress in the game\nBeautiful hand-drawn art of of 9 player characters, 36 combat companions, 80+ enemies, 80+ NPCs, and 100+ locations","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pera Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11252,"name":"The Panic Room","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c76/c765356cdc2c839d5314c7c8dccd980a.jpg","description":"You awake in the dark and mysterious mansion. How did you get here? What to do next? Where is the way to escape? Only one person knows all the answers. The guy who enclosed you and several other people here. This psycho calls himself a Puppeteer, and he wants you to play his evil game. The winner will get freedom. But what sacrifice would you make to return home?\n“The Panic Room: House of Secrets” is a \"hidden object\" game. Moving through the old mansion, you'll have to solve a lot of puzzles. Only in the end of your way you can really understand the true price of freedom.\nMain features\nOver 1600 story-driven quests\n2 alternative storylines presented in the best traditions of Agatha Christie’s fiction\n2 opposite factions representing 2 alternative storylines\n23 unique characters with their own unique stories\n17 highly detailed locations to explore, 9 game modes to master, an infinite number of mysteries to unveil\n3 seasons of engaging narrative in ultimate hidden object experience already appraised by millions of gamers worldwide","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NIKITA ONLINE","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11210,"name":"Barrow Hill: Curse of the Ancient Circle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b50/b50de974e6a35594e23c6190005fb2ef.jpg","description":"Somewhere deep within the woods of Cornwall, a timeless force is stirring. Unseen beneath the ancient burial mound, known locally as Barrow Hill, a forgotten myth awakens. Following in the footsteps of the wellknown archaeologist, Conrad Morse, you will discover that the barrow is more than just a collection of forgotten standing stones& Experience the detailed and immersive storyline yourself, in this great point-and-click adventure.\nThe eerie Cornish landscape is brought to life like never before. Arriving during the Autumn Equinox you have one night to unravel a sinister story. Explore the well trodden pathways across the land, seek clues in almost forgotten shrines and experience the ancient forces which exist in the standing stone monument known as Barrow Hill.\nAncient Celtic Monuments: Standing stones are, perhaps, the most mysterious wonders of the ancient world. There are still no satisfactory explanations as to what they are, how they were built, and who constructed them. A detailed, and spellbinding, story is woven through the very fabric of Barrow Hill, offering possible explanations, further mysteries and a chance to get beneath the surface of archaeology like no other game before it.\nDig deeper: Use real archaeological techniques, and practice, to unearth forgotten artefacts and delve into the Celtic legends which haunt the green lanes of the hill. Cornwall boasts itself as the home of many sorcerers, ancient kings and mythological characters. From the piskie folk of the hedgerows and clifftops to the beasts of Bodmin Moor. There isn't a corner of England's most western county that isn't rich in folklore, magic and danger!\nDiscover a world of puzzles, archaeology and ancient rituals\nUse gadgets to locate clues and communicate with other characters\nHaunting soundtrack of creepy music and spine-chilling sound effects\nExplore wonderfully spooky locations\nUse CCTV to uncover clues\nWhat has happened to Conrad Morse?\nThis is the digital re-release of the game at Barrow Hill's 10 year anniversary ! PS: Don't forget to check out Barrow Hill:The Dark Path, the new instalment.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Shadow Tor Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10903,"name":"Brick Rigs","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c07/c07559783cc1ff4e0e975f9f644a81be.jpg","description":"Brick Rigs allows you to build many kinds of vehicles from a variety of bricks and experience their dynamic driving and destruction physics in a sandbox environment.\nIt doesn't matter if you want to build an dragster, a fire engine, a forklift, a helicopter, a plane or even a tank it will drive, break and function as you would expect it.\nThe multiplayer mode allows you to experience these physics together with your friends. You can race other players, organize demolition derby's or battle each other in a dog fight, the rules are up to you!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lukas Rustemeyer","platforms":[{"id":0,"name":"PC"}]},{"id":9275,"name":"Northmark: Hour of the Wolf","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ab/1ab9fa285f22824658243400b1574697.jpeg","description":"Experience all the thrills of adventure in Northmark: Hour of the Wolf, a card-based RPG. Choose to become a mighty warrior, cunning mage or powerful druid as you fight for glory and survival in arena combat. Explore every corner of the kingdom from fiery deserts to deep forests and cold mountain peaks and Journey to the kingdoms of the elves and dwarves.\nBut beware! Danger waits at every turn as you investigate the chilling mystery that threatens your homeland. Can you defeat assassins, thieves and hideous monsters?  And who is the enigmatic stranger known only as The Wolf? Find out in Northmark: Hour of the Wolf.\nMain features:\nAdventure across the lands of Northmark.\nEnjoy an original battle system featuring over 180 beautiful cards.\nFight for honour, glory... and gold.\nSave your homeland from the plot that threatens to overwhelm it.\nBattle in the arena, or fight for your life against powerful assassins, hideous monsters and mighty warriors.\nJourney from the cold mountain peaks to the desert wastes and deep forests.\nExplore great cities, lost ruins and the ancient mystic sites sacred to the druids and elves.\nGrow more powerful as you find the best battle tactics.\nBecome the greatest hero Northmark has ever known - you know it's your destiny!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Rake in Grass","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":1898,"name":"Super Time Force","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/759/75927ff47e676b0e35a6a8916c7336d3.jpg","description":"Super Time Force is an action-packed platformer with a time-travelling twist!  You’re in control of time itself, bending and stretching it to your advantage on the battlefield. Rewind time and choose when to jump back into the action, teaming-up with your past selves in a unique single-player co-op experience! Take control of up to 16 unique characters, and battle across 6 different time periods, from the long-ago past to the far-away future.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Capy","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":1046,"name":"ClusterPuck 99","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/382/38274ac8598d62d1f3cd3531b67d9fc4.jpg","description":"ClusterPuck 99 is a sporty competitive sports game about sports based on athletics!\nLocal multiplayer madness! ClusterPuck 99 is an 8 player game built for parties and smack talk. Bash your friends to gain control of the puck and then fight your way through to your opponents goal. Try to score while avoiding spikes and utilizing speed boosts to blast past other players.\nCompete in intense 8 Player Local Co-op matches!\nSupport for Xbox 360, Xbox One and Playstation 4 controllers.\nNavigate through 20+ dangerous maps littered with spikes, bumpers and speed boosts.\nSingle Player Challenge mode!\nCustomizable team colors and players.\nInstant replays, stat tracking and more!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PHL Collective","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":681396,"name":"Propnight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/747/747f3adc594b3d0cf2c78a4d8ef678a5.jpg","description":"Propnight is a 4vs1 multiplayer physics-based prop hunt mixed with classic horror survival.\nIn a small provincial town, teenagers continue to disappear mysteriously. But who or what is behind this?\nPLAY AS A SURVIVOR\n\nTurn into any prop to hide from a killer.\n\n\nRepair Propmachines to escape.\nPLAY AS A KILLER\n\nTake the role of a savage killer.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Fntastic","platforms":[{"id":0,"name":"PC"}]},{"id":681395,"name":"The Day Before","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d0b/d0bc26b4a79b95fa5b399d18f79fc207.jpg","description":"The Day Before is an open-world MMO survival set in a deadly, post-pandemic America overrun by flesh-hungry infected and survivors killing each other for food, weapons, and cars. You wake up alone in a world you no longer remember, setting out to find answers and the resources to survive.\n\n\n\nSURVIVE AT ALL COSTS\nSearch abandoned vehicles, houses, and skyscrapers as you scavenge for resources.\n\n\n\nENTER PLACES NO ONE ELSE DARES\nCrush the infected and other players with realistic weapons, becoming a legend of the new world.\n\n\n\nDISCOVER THE VAST POST-PANDEMIC WORLD\nExplore beautiful yet dangerous places with stunningly detailed vehicles.\n\n\n\nFIND A COLONY OF SURVIVORS\nTake part in the restoration of the former society before it's too late. In the survivor colony, you can sell your loot and communicate safely with other players.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Fntastic","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":570139,"name":"Wildshape - Map Editor + VTT","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/713/7131545cccf6ee3fb68bb88276856093.jpg","description":"Ever wish you could play your favorite tabletop roleplaying game in the rich, realistic environment of a first person computer game?\nNow you can!\nFree your game from the tabletop - or maximize your online experience - by fully harnessing the capabilities of 3D animation. Easily create stunningly realistic maps with moldable terrain and thousands of objects to choose from. Then, invite your friends to play in your custom battle map, either online or over the gaming room screen!\nCreate functional battle maps in minutes, or pour over them adding intricate detail\nBring your maps to life with rolling hills, rivers, a rotating sky, and animals\nImport/export your creations to share with the community\nShoot film vignettes to dramatically introduce a scene\nHost your players as game master, and make changes to the map as you play\nView your maps from the traditional top-down perspective, or from any other angle - even walk the terrain from a character’s point of view\nCustomize a square or hex grid, molding it to the terrain or laying it overtop\nReveal the terrain gradually to your players using fog of war\nCall up dynamic weather and lighting effects on demand\nRoll dice and animate characters as they run, fight, and die!\nAt long last, tabletop gameplay enters the realm of three-dimensional graphics.\nWildShape\nShape your adventure.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"DLDev","platforms":[{"id":0,"name":"PC"}]},{"id":481917,"name":"Train Sim World 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f6/8f669869e522895808fa013f87fe2867.jpeg","description":"The evolution of train simulation! Master iconic locomotives on high-speed services, long freight hauls or precise commuter traffic, and get creative with customisation tools in this advanced sequel. Climb into the cab in Train Sim World 2.Authentically ReplicatedDrive high-speed inter-city German rail for the first time as you push the throttle and climb speeds in the famous DB ICE 3M out of Köln.\nTake on the challenge of hauling long freight across Sand Patch Grade including the Cumberland Terminal using the raw power of the CSX AC4400CW. Master the patterns and stations of the world-famous London Underground on the Bakerloo Line.\nAll official licences, all authentically recreated – you're in the cab and in control.Get CreativePersonalise Train Sim World 2 locos with the exclusive new Livery Designer - Create your own custom liveries with an easy to use in-game tool that allows you to craft both simple and complex designs to bring your Train Sim World 2 loco liveries to life.\nCustomise how you play with the Scenario Planner - Create your own scenario. Customise locos and destinations, then jump in and get driving. Quick drive, your way.Experience A New Level Of RealismThe proprietary SimuGraph® vehicle dynamics engine has evolved – adding realistic adhesion physics for the first time. Feel the wheelslip and wheelslide in adverse weather and the added challenge of control on steep inclines.\nOptimised and upgraded visual fidelity also gives Train Sim World 2 dynamic skies and 4K support.Immerse Yourself In SimulationGet clearer information on instructions, gradient and speed profiles as you drive, including new HUD displays, clarity to the onboard safety systems, brake controls, power meter and accelerometer. A new controller scheme will give great choices on Camera and Driving modes and allows easier access from external camera mode to enter another vehicle in your consist, all while full physics and simulation are still running.Preserved CollectionYour collection comes with you - You can play your Train Sim World 2020 Add-Ons in Train Sim World 2. Train Sim World has always been about your collection, your choice of Add-Ons from your favourite region, time period, diesel, electric, passenger, freight – your way. Your purchased Train Sim World 2020 Add-Ons will be available to play in Train Sim World 2. Please note: Northeast Corridor New York, Amtrak SW1000R and CSX GP40-2 are not part of Preserved Collection.Track And Share Your ProgressWith Dovetail Live you can track your progress and stats online - Reviewing your performance and sharing and comparing with friends. Railfan Shots also give you the control to upload your screenshots to a personal gallery to share.Key Features\tExplore famous routes with unique challenges:\nBakerloo Line – First opened in 1906 Bakerloo is one of the oldest lines on the London Underground. Master the modern-day complexity of rush hour in the British capital.\nSchnellfahrstrecke Köln-Aachen – Step into the renowned DB BR 406 ICE 3M and drive passengers at speeds up to 250km/h as you race between Köln and Aachen on this German inter-city line.\nSand Patch Grade – Enjoy epic power with the CSX AC4400CW. Haul freight across the Allegheny Mountains, battling adhesion on one of the steepest grades in the United States.\tTrain Sim World 2 features iconic locomotives to master. The classic 1972 Mark 2 Stock on the Bakerloo Line, modern fast commuters with DB BR 406 ICE 3M and DB BR 442 ‘Talent 2’ and powerful hauliers with the AC4400CW, GP38-2 and SD40-2.\nLivery Designer – Get creative and add a personal touch to your Train Sim World 2 locos with this easy to use tool that allows custom liveries.\nScenario Planner – Drive what you want, where you want, as you plan out your own scenarios. Quick drive, your way.\nNew Adhesion Physics – Feel wheelslip and wheelslide in adverse weather, master moving heavy freight and keep control of your loco power on steep inclines.\nDynamic Skies – Multiple cloud layers and realistic sunlight filtering means greater visual fidelity for the skies in Train Sim World 2.\nJourneys – Start a new Journey on any route to explore more than 24 hours of gameplay featuring scenarios, services and more to complete.\nTutorials – Learn all you need to take to the rails with detailed tutorials for each locomotive. Master every switch, lever and dial.\nPowered by Dovetail Games’ proprietary SimuGraph® vehicle dynamics engine and Unreal Engine 4® technology.\nDownload Size: 9.6GB","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Dovetail Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":428775,"name":"Adios","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ee/1ee33fc616696f867bf8749b8859153b.jpg","description":"Adios is a cinematic first-person game about sticking to a complicated decision.\nYou're a pig farmer in Kansas. It's October. Cold, crisp mornings are the norm, and you have decided that you're no longer okay with letting the mob use your pigs to dispose of bodies. When your old friend - a hitman - arrives with his assistant to deliver another body, you finally screw up the courage to tell them that you're done.\nYour friend doesn't want you to stop. He knows that there's no such thing as quitting, so he'll try to convince you that you're making a mistake. You spend the day together, doing chores and exploring the nooks and crannies of an authentic environment in the American Midwest alongside the man who will be forced to kill you, if he can't convince you to stay.\nHow you respond will determine the rest of your life.\nAdios means goodbye.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mischief","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":427906,"name":"Soviet Jump Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/920/920406b1bb2f92b1b6fa921ad597241a.jpg","description":"Comrade! You hold in your hands a piece of Soviet history: the first ever Battle Royale game! Snag powerups, collect coins, and battle against 49 other comrades to declare yourself the best shock worker this side of the wall. Now is your time. Now is your opportunity for glory. Together, we are one--but will you be the one who is held above all others?\nFeatures:\n50 player online multi-comrade combat\nAction-oriented 2D side-scrolling gameplay: jump on your enemies and show them them your political might\nFind power ups to give yourself an edge over the redistributed wealth\nCustomizable characters: make the secret police jealous with your new outfits\nKeyboard Controls:\narrow keys - move\nZ - A button (jump/enter in menus)\nX - B button (use item/cancel in menus)\nC - Select button (use a held item)\nESC - Start button (pause)\nGamepad controllers can be selected in the options menu","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Fantastic Passion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":389007,"name":"Zup! F","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/790/790753b14c47ea831988deacb271827f.jpg","description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\nZup! F - the Final game of the franchise\n▪ 60 Levels\n▪ Achievements\n▪ New cubes\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic by Ann Sharova","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":327236,"name":"No More Heroes 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fce/fce0716b555c161ef1b286eecb7abc16.jpg","description":"Travis Touchdown returns to Santa Destroy after a ten-year absence. There he finds a huge artificial island metropolis floating in the sea, and a mysterious flying object hovering high above. What kind of crazy dangerous assassins will Travis face off against this time?!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":277931,"name":"SUCCUBUS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2c/f2c4325c0d51aa18d6f2df8297ca400d.jpg","description":"UNLEASH YOUR RAGE\r\nBecome a demonic priestess of lust and use her unique skills to take revenge on your enemies.\r\nRegain your kingdom making hell tremble under your hooves! Left no one alive if they won't bend the knee.SURVIVE THE DOWNFALL\r\nYou are the Succubus – a wild and lustful demon who rejected the role of the queen of the infernal abyss. ­With the disappearance of the legitimate rulers of Hell, the remaining demons recognized Nimrod as their ruler, because he was the only soul who could dominate the mind of the mighty Beast. By raising his new empire from the corpses of sinners, the new king, along with his new queen – you – managed to control the chaos left by former rulers. The life of luxury and walking on rugs sewn from the skins of martyrs was not for you though, and so you have chosen a life in the wilderness. By satisfying your appetites and original instincts, you inflict pain by hurting everyone and everything in your path.\r\nThe moment you meet the powerful Baphomet who, together with his army, is going to get the soul of Nimrod, you are captured and maimed. Betrayed by your own species you are left with only one goal that matters –  revenge!DOMINATE HELL\r\nYou are the greatest terror in this brutal world. Teach your opponents that standing in your way is the biggest mistake they could make.\r\nBecome the judge and the executioner and unleash your rage both on the damned souls and the demons that will challenge you.\r\nClimb the steep rocks, swim in the blood full of snakes and avoid the traps of this living, pulsating hell. Inflict suffering, mutilate, murder and free your wrath to regain your rightful rule of the hellish dominion!UNWIND YOUR SKILLS\r\nGain experience by killing other beings and then use it to upgrade your basic skills and unlock additional, more powerful and brutal ones.\r\nEat your opponents' hearts and let the rage come over you and release your pirokinesis skills!RIP AND TEAR!\r\nUse your weapons and unique armor to deal with your opponents. Attack enemies with your claws or wield the bone swords, clubs and other weapons you pick from dead enemies!\r\nMassacre your enemies, leaving behind the ocean of cut limbs and charred corpses.\r\nRECLAIM YOUR KINGDOMSUCCUBUS - main features:\r\n• Intense and brutal action using weapons and pirokinesis\r\n• Diversified opponents\r\n• Expandable skill tree\r\n• A system of weapons and armor that affect player's statistics\r\n• A rich and diverse world of Hell\r\n• A multi-story plot combining horror with action and survival\r\n• Hostile environment full of traps and enemies\r\n• Surreal visual setting and gore\r\n• Boss fights","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Madmind Studio","platforms":[{"id":0,"name":"PC"}]},{"id":57891,"name":"PUBG Mobile","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/087/0879f4aab10a12ecde452f6326bac01e.jpg","description":"PLAYERUNKNOWN'S BATTLEGROUNDS goes mobile - the original Battle Royale game is now available on your device!\n1. Official PUBG on Mobile\n100 players parachute onto a remote 8x8 km island for a winner-takes-all showdown. Players have to locate and scavenge their own weapons, vehicles and supplies, and defeat every player in a graphically and tactically rich battleground that forces players into a shrinking play zone. Get ready to land, loot, and do whatever it takes to survive and be the last man standing!\n2. High-quality Graphics and HD Audio\nThe powerful Unreal Engine 4 creates a jaw-dropping visual experience with rich detail, realistic gameplay effects and a massive HD map for Battle Royale. Feel like you’re in the thick of the action as you play with high-quality audio, immersive 3D sound effects and 7.1 channel surround sound.\n3. Realistic Weapons\nA constantly growing lethal arsenal of firearms, melee weapons, and throwables with realistic ballistics and travel trajectories gives you the option to shoot, beat down, or incinerate your adversaries. Oh, and you like the pan? We’ve got the pan.\n4. Travel in Style\nCommandeer a variety of vehicles including cars, trucks, motorcycles, and boats to hunt down your enemies, race them to the play zone or make a swift escape.\n5. Team Up with Friends\nSurvive the battle with your friends. Invite and team up with your friends, coordinate your battle plan through voice chat and set up the perfect ambush.\n6. Fair Gaming Environment\nPowerful anti-cheat mechanisms ensure a fun and fair environment for all PUBG MOBILE players.\nNot Just A Game. This Is Battle Royale.\n* Requires a persistent internet connection.\n* Recommended specs for PUBG MOBILE: iPhone 6s or later and iOS 9 or above.\nSupports most iOS devices, including but not limited to: iPhone X, iPhone 8 Plus, iPhone 8, iPhone 7 Plus, iPhone 7, iPhone SE, and iPhone 6s.\nContact Us\nThe current version does not represent the final quality of the game as we will keep optimizing existing content and adding new features.\nIf you enjoy the game, please join the discussion on Facebook! PUBG MOBILE Official Facebook Page: http://www.facebook.com/PUBGMOBILE\nIf you have any questions or concerns, please contact our customer service at PUBGMOBILE_CS@tencentgames.com","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"PUBG","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":53108,"name":"Tony Hawk's Underground","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/63e/63e1b309560fef546cdb7b8334226b2d.jpg","description":"Tony Hawk's Underground is a skateboarding video game published by Activision in 2003, the fifth entry in the Tony Hawk's series. Neversoft developed the GameCube, PlayStation 2, Xbox versions, Beenox developed the Microsoft Windows version, which was released in Australia and New Zealand as a budget release in 2005, while the Game Boy Advance adaptation was developed by Vicarious Visions and Mobile version by Jamdat.\nUnderground is built upon the skateboarding formula of previous Tony Hawk's games: the player explores levels and completes goals while performing tricks. The game features a new focus on customization; the player, instead of selecting a professional skater, creates a custom character. Underground adds the ability for players to dismount their boards and explore on foot. The plot follows the player character and his or her friend Eric Sparrow as the two become well-known professionals and grow apart.\nThe game was developed with a theme of individuality, which was manifested in the extensive customization options, the presence of a narrative, and the product's characterization as an adventure game. Real-world professional skateboarders contributed their experiences to the plot. Upon release, the game was a major critical and commercial success, with reviewers praising its wide appeal, soundtrack, customization, multiplayer, and plot. The graphics and the controls for driving vehicles and walking were less well received. Underground's PlayStation 2 version had sold 2.11 million copies in the United States by December 2007. A sequel, Underground 2, was released in 2004.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Neversoft","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":52935,"name":"Final Fantasy II (1988)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f29/f29af1b9d00800b26af2a6fda55aa3b9.jpg","description":"Final Fantasy II is a fantasy role-playing video game developed and published by Square (now Square Enix) in 1988 for the Family Computer as the second installment of the Final Fantasy series. The game has received numerous enhanced remakes for the WonderSwan Color, the PlayStation, the Game Boy Advance, the PlayStation Portable, and multiple mobile and smartphone types. As neither this game nor Final Fantasy III were initially released outside Japan, Final Fantasy IV was originally released in North America as Final Fantasy II, so as not to confuse players. The most recent releases of the game are enhanced versions for the iOS and Android, which were released worldwide in 2010 and 2012, respectively.\nThe game's story centers on four youths whose parents were killed during an army invasion by the empire of Palamecia, who are using hellspawn to conquer the world. Three of the four main characters join a rebellion against the empire, embarking on missions to gain new magic and weapons, destroy enemy superweapons, and rescue leading members of the resistance. The Game Boy Advance remake adds a bonus story after the game is completed.\nFinal Fantasy II introduced many elements that would later become staples of the Final Fantasy franchise, including chocobos and the recurring character Cid. It also eliminated the traditional experience point leveling system of the previous and later games in the series, instead introducing an activity-based progression system where the characters' statistics increase according to how they are used or acquired. Despite being a sequel to Final Fantasy, the game includes no characters or locations from the first game. Final Fantasy II received little attention at the time from non-Japanese reviewers, though its remakes have garnered favorable reviews.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Square","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation"},{"id":0,"name":"NES"}]},{"id":50615,"name":"Sprout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/782/7823872c22c8dfba307b4a8fd245b52d.jpg","description":"You feel gentle a thump as you land in the warm tropical sand. Who are you? Who do you want to be? Something in your heart whispers of shade, majesty, and acorns. What does this mean?\n\nYour mother waves to the east. On the far side of the ocean is a world! Plants and animals! Mountains and valleys! Birds and flowers and a forest of mighty oaks. Yes! You know that this is who and what you are meant to be: an oak.\n\nYour parents can't teach you how to be an oak. The only one who can teach you how to be an oak is another oak. Still, your parents teach you what they can - the way of the coconut. This will give you the ability to cross to the mainland, and be one step closer to your goal. It's not much, but it's a start!\n\nIn Sprout, you will embark on a casual, botanical-puzzle-adventure. You will make friends, learn new skills, solve puzzles, and ultimately become the mighty oak that you were always meant to be.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Mindful Mammoth","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":44213,"name":"Galaxy of Pen & Paper","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/227/227bab1e57b16ea7386bf6f77072226c.jpg","description":"*** NO IN-APP PURCHASES! ***\n*** Pay once and play the complete game forever! ***\nTHE ULTIMATE ROLE-PLAYING SIMULATION GOES TO SPACE!\nGalaxy of Pen & Paper is a turn-based meta RPG about a group of players rolling dice in the year 1999! Create your own game master and RPG party,  as they roleplay, explore distant planets in their imagination, fight weird aliens and save the galaxy in the era of dial-up internet and floppy disks!\nTURN-BASED COMBAT SYSTEM\nAssemble the party of your choice, picking your players, races and classes! Unlock new content with the blood, sweat, and luck of your party’s ingenuity and dice rolls!\nCUSTOMIZATION\nWill your party include a Slayer Simian Savage or a Thinker Green Medtech? Customize everything from your battle encounters to your Game Master’s table!\nEXPLORE THE GALAXY OF QUESTS AND LOOT\nGather your adventurers and travel trough a galaxy of pen and paper, and discover the newest threat as they leave Earth. All the fun of a pen and paper RPG with none of the lost dice!\nCOMPLETELY NEW GAME\nPrepare to be amazed with so much new things! Spaceship battles, stories with multiple decisions, sci-fi classes and races, side-way battles, planet navigation and exploration, and of course, traveling through space and time!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Behold Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":42485,"name":"Estranged: Act I","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/01e/01e3443bd0faf1fdab0253529ac839c0.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"AlanEdwardes","platforms":[{"id":0,"name":"PC"}]},{"id":37839,"name":"RIP 3: The Last Hero","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/471/4711b945e6524079bb69233a465064e4.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"White Elephant Games","platforms":[{"id":0,"name":"PC"}]},{"id":31033,"name":"Stronghold: Crusader","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f1/3f16c94c5de75d27dcc25fac3cd43343.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":25100,"name":"Ice Climber","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8af/8af413130a0e933ca3b124707b6167a9.jpg","description":"As Popo, players use a trusty mallet to work their way up the mountain.\nThey chip away at the blocks overhead, then jump up through the\nresulting hole to the mountain's next level. Once Popo reaches the top\nlevel, he enters a fast-moving bonus stage in which he can pick up\nveggies and, hopefully, reach the summit for a big point payoff. Of\ncourse, not everyone's supportive of Popo's pastime. Toppies fill Popo's\nholes, so players must jump through the gaps quickly. It's easy to slip\noff some of the icy levels, as Polar Bears, Toppies, and other ferocious\nfauna don't want players up there. There are 32 challenging peaks to\nscale. How will you fare?","review":"","timePlayed":0.0,"releaseYear":1985,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"NES"}]},{"id":23507,"name":"The Fidelio Incident","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5cd/5cdb1860c2b60e8cd83583a42a0edc54.jpg","description":"In 2014, God of War 3 Art Director Ken Feldman was inspired to start a side project that turned into a narrative thriller video game. With help from talented friends Brandon Popovich and Christopher Davis, this is the game we created.  We took no money, created Act 3 Games as our indie video game company and are self publishing on Steam.  We are very proud of the accomplishment and hope you enjoy the ride.\nThe Fidelio Incident is a single-player, first-person thriller set off the coast of Iceland.  After a violent plane crash, Stanley must search a desolate frozen island in search of his wife Leonore while covering up any traces of their bloody Irish past.  Rescue help is on the way, the past must remain hidden. \"They can't find out who we are!\"\n​\nInspirations include Dear Esther, Gone Home and Firewatch as well as dark character dramas like Homeland, Lost, and The Americans.\n​\nThe Fidelio Incident was also inspired by Beethoven's only opera,  Fidelio.  We use the opera's premise as inspiration for the backstory, then re-imagined it for a modern setting.\nMichael Krikorian's score composes over 40 minutes of original music.  He incorporates themes from Fidelio's overture and transforms them to fit the mood and atmosphere of the game.  The score expands the emotional depth of the narrative while complementing the atmosphere of the island.\n​\nStanley is played by Glenn Keogh, known for his roles in Transformers Age of Extinction, Once Upon A Time, and Sons of Anarchy.  Glenn was born in Ireland.  After reading the script, he signed on with the goal of bringing authenticity to Stanley's character.  We think he did a great job, and hope you agree!\n​\nLeonore is played by Bess Harrison, whose credits include The Temple and Memory, for Amazon Studios.  Bess is described by Glenn as having a sweetheart voice you can't help but fall in love with.The Game Runs On Unreal Engine 4.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Act 3 Games","platforms":[{"id":0,"name":"PC"}]},{"id":20799,"name":"Chronicles of a Dark Lord: Episode 1 Tides of Fate Complete","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f44/f44da23de18b913d6c012cbd95769b89.jpg","description":"The Rebirth Update is now live!We're happy to announce that we've launched the \"Rebirth\" Update for Chronicles of a Dark Lord: Episode I Tides of Fate on Steam. This update is free for all Steam owners, and should automatically install, depending on your settings.\nThe following is a comprehensive list of all the features and changes you can expect for the update:\nFeatures of this update:\n1) Revised dialogue for many of the major cut-scenes of the game. NPC dialogue has been mostly left as-is (save for grammar and spelling fixes). We felt that some of the dialogue in the game, especially for the more significant cut-scenes, needed to be more on par with the quality of Episode 2's writing, and act as more of a tie-in rather than the disconnect that was there before.\n2) The current sprites for the party members that are seen in towns/overworld are no longer the same sprites seen in combat. In-combat sprites are now larger, more detailed sprites.\n3) Resolution options before the start of the game. When the update goes into effect and the game is launched, you'll be greeted with a choice of resolutions. Due to the native resolution of the engine (544x416), we had to keep the width multiples of 544 in order to have the best display quality. The following will be the options: \"Full Screen\", \"1632x1080\", \"1088x768\", \"544x416\". Please note that you won't be able to see the Achievements pop up in Full Screen, due to how the Steam client manages them with the engine.\n4) Steam Achievements - Achievements are now implemented in the game. Note that older saves are compatible, but that you won't be able to unlock earlier achievements without starting a new game, which we strongly recommend.\n5) Minor graphical enhancements for the overworld, water, flooring, walls, objects, etc.\n6) Tweaked some of the enemies' battle A.I. and re-balanced damage output for some skills.\n7) Various bug fixes, gameplay smoothing.\nWe want to also note that due to the inherent limitations of the engine, we won't be able to fix the issue of those with Xbox/PC Controllers having to use the analog stick instead of the D-Pad to move your character around/navigate the menus. This is a known issue with these engines unfortunately, however if you press F1 at any time when the game is launched you'll be able to configure some of the button controls if you desire (but not the D-Pad controls unfortunately).\nYou can also press F5 at any time during gameplay to switch between Windowed and Full Screen. F6 can also be used at any time during gameplay to switched between Windowed Modes (dependent on the size of your screen). Please do not use F12, it can cause crash issues with the game.\nAbout the GameEnter a world of shadowy intrigue where stained pasts collide with the present in an explosive confrontation that will define one young man's dark destiny, as he attempts to thwart the machinations of a true evil beyond all imagining...\nImmerse yourself into a dark and complex world of intrigue with over 25 hours of Gameplay\nIncludes the previously released \"Nightmare Vision\" DLC content\nEnhanced retro graphics melded with HD-quality background animations offers a more unique graphical styling presented within a dark atmosphere\nSide-view active-time battle system (ATB) reminiscent of the classic 16-bit RPGs\nOptional quests and bonus dungeons\nCritically-acclaimed soundtrack from independent artists such as Kevin Macleod, Chris Hurn, zero-project, and Sketchy Logic. Also featuring the track \"Day to Fall\", written and performed by Marielle Thomas.\nDecisions you and your party make will affect later events and even whether townspeople live or die by your hand and much more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kisareth Studios","platforms":[{"id":0,"name":"PC"}]},{"id":20500,"name":"To Burn in Memory","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27a/27a068485b5559a4d918442ae44ca6a3.jpg","description":"To Burn in Memory is a free, ahistorical and atemporal Interactive Fiction work released for IFComp 2015. Explore a city that never existed, and uncover its secret history through the memories of those caught in the chaos of a Europe spiraling ever faster into war.\nFeaturing a fully original soundtrack by the author, with illustration by graphic design maestro Johannes Poell.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Orihaus","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20215,"name":"Painters Guild","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0af/0af1786e80cc82012019c982efba5016.jpg","description":"Digital Deluxe EditionGame + Soundtrack.\nAbout the GamePainters Guild is a management sim where you control an art academy in the Italian Renaissance.\nPaint artwork as beautiful as the Mona Lisa.\nHire painters like Leonardo da Vinci, Michelangelo and millions of randomly generated artists.\nExpand your guild and customize it with furniture and other options.\nPlay in 3 different cities: Florence, Venice and Rome.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lucas Molina","platforms":[{"id":0,"name":"PC"}]},{"id":19842,"name":"Iron Madness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/762/762d77f6adb6df7b8a59e3dea564320f.jpg","description":"In the future there's only death and destruction, so we took all the criminals and put them in cars, now they battle each other for your entertainment, so sit back relax and just hit start to play Iron Madness.\nIron Madness is a fast-paced multiplayer/split-screen car combat game with up to four players, blow your friends away with a wide variety of weapons including rockets, saw-blades, mines, and machine guns and more.\nFast-paced multiplayer action!\nSingle player campaign against AI opponents\n4 Player split screen mode\nPartial controller support\n6 Game Modes\n3 Cars\n4 Maps\nWith lots more content coming.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Inane Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19463,"name":"Cannon Fodder 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/835/8357f7af5b5139a7dff6dadeb2b86d6c.jpg","description":"Cannon Fodder 3 is a tactical action game, which inherited the style and traditions of the original game. The war goes on and its scale is nearly the same as before. 500 conscripts are sent to meet their destiny. What awaits them? A general's stars or a bed of honor?\nThese 21st century soldiers are equipped much better than their 1994 predecessors. They have 8 types of machinery, suitable for land, surface and airborne operations, as well as 17 types of weapon from assault rifles to the nuclear bomb.\nSkirmishes take place all around the world and even in space! You'll fight throughout the day and night, in hot and cold weather, in snow and rain. The enemy is skilled - there're terrorists from all over the world and they have cutting-edge technologies at their disposal: teleportation and various mechanized combat systems. Our heroes will face great challenges - artillery strikes, insuperable force fields, automated turrets, suicide soldiers and giant humanoid robots.\nYour savvy will come in handy: your actions aren't limited to slaughter and destruction. You'll have to capture enemy vehicles and bases, save hostages and rescue convicts, hold the line and shoot back from the turrets, search for data discs and spare parts, repair broken robots and bypass minefields. The high command carefully watches your operation’s progress: missions can be aborted because of major offence; minor misbehavior will be reprimanded, and great achievements will be rewarded with medals and promotions. In the end, the very best soldiers will receive the greatest reward: they will return to home camp where warm army barracks, hot army food, soft army bunks and a tender drill sergeant await them. Until the next time.\nKey Features:\n8 types of controllable machinery\n17 types of weaponry, including tactical nuclear strikes and carpet bombings\nBattles with unique bosses\nCombat progress leads to new ranks\nSpecial-purpose bonus items\nDay and night missions, weather effects\nVarious locations: America, Asia, Russia, lunar and orbital bases","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Burut CT","platforms":[{"id":0,"name":"PC"}]},{"id":19185,"name":"I must kill...: Fresh Meat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20c/20c45f75e1b6be9edbc41fdde71ea11d.jpg","description":"I must kill...: Fresh Meat is hand-drawn classic 2D point & click adventure with a light horror story. The story is about an unnamed butcher, who had his own world since childhood, from which he was violently torn away. Our butcher was never able to deal with the new age, therefore he considers everything modern including modern behavior as disgusting, and he despises the modern era.\nI must kill...: Fresh Meat is not about jumpscares, but it is trying to pull in the player into the story with its atmosphere. The game is concurrently trying to show the player, that younger generation is addicted to modern technology, and is also disrespectful to each other.\nWho is the human pig then? Butcher? Or the other?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gaming Cats Studio","platforms":[{"id":0,"name":"PC"}]},{"id":19154,"name":"Californium","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b03/b03d2bcbbfeaa995d5840358a49e0281.jpg","description":"Explore the worlds of Californium, a first person exploration game where you are a writer trapped into shifting realities. Will you find what’s behind the simulacra ?\nBerkeley, 1967. You are Elvin Green, a writer whose career is not better than his sentimental life. Besides, the day starts badly : your wife Thea left you a break up letter. As for Eddy, your editor, he summons you : \"you are a writer who does not write\" - you should find yourself another editor. Your world is falling apart. Too much acid and cheap booze ? Too many sleepless nights stuck to your typewriter, powerless to tackle your first novel ? Your poor mental health is collapsing. Luckily this nightmarish world is unstable, you can extract yourself from it and thus access another reality! You have nothing to lose!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Darjeeling","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18501,"name":"Farm Machines Championships 2014","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b24/b24987a0d2ce292926550176b2253622.jpg","description":"The ultimate farmers' showdown returns with monstrous  new machines, brand new events and an expansive new terrain!\nAre you the fastest, most accurate and craziest farmer in the competition?\nClimb aboard  Farm Machines Championship 2014 and sit behind the wheel of tenacious tractors and humongous harvesters to compete in 40 various events. Test your skills in new events, such as racing with forage wagons or transporting grain. Tune up your machines by changing the gearbox, engine or brakes. And change your tractor's look by adding additional elements to its chassis to distinguish you from the rest of contenders including fresh paint, decals, pipes and more.\nJump behind the wheel and discover:\n11 dynamic event types\n12 brand new farming machines\ndynamic and challenging gameplay\nhuge new map with various landscape, architecture and plants.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Silden","platforms":[{"id":0,"name":"PC"}]},{"id":17418,"name":"Shad'O","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ed/2ed997c1e12dc5d793a80377fac93502.jpg","description":"In this unique Tower Defense, you will travel through William’s mind in a colored and dreamlike universe, made of a mix of pieces of memories, emotions and feelings.\nWill you be able to drive the fog of oblivion away and help the boy recover his memory?\nYour many companions’ light will be your best ally in this world distorted by fear and mystery.Key FeaturesA unique Tower Defense\nA captivating reversed narrative\nGreat freedom of action and tactics\nGorgeous procedural fog\nAwesome Boss fights","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Okugi Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16836,"name":"Back to Dinosaur Island Part 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47f/47f49cf18c0fe7dcc98712c842a44e72.jpg","description":"Oculus Rift DK2 and Controller required to playBack to Dinosaur Island 2 is an Oculus Rift DK2-exclusive Virtual Reality demo and requires an Oculus Rift DK2 HMD (SDK 0.8) to run.\nBack to Dinosaur Island 2 requires a Xbox 360 for Windows or Xbox One Controller for Windows to be played. Gameplay with only mouse and keyboard is not supported.\nAbout the GameReturn to Crytek’s Dinosaur Island and enjoy another glimpse into the developer’s exciting vision for VR. Back to Dinosaur Island 2 received a glowing reception when it was first shown to attendees at E3 2015 and has previously only been playable at select industry events. Now, gamers everywhere can sample the acclaimed VR demo firsthand – scaling a deadly cliff face as huge flying dinosaurs react to their presence and debris rains down from above. Mysterious landmarks on the horizon and stunning vistas on every side combine to immerse gamers in an entirely new reality.\nBack to Dinosaur Island 2 has been built from the ground up to take advantage of the Oculus Rift HMD, and requires an Oculus Rift DK 2 (SDK version 0.8) to run. Please check the system requirements below. Virtual reality games require a high frame rate to guarantee a comfortable experience for the user. Running Back to Dinosaur Island 2 on weaker hardware can cause lower frame rates, which can lead to users having a less than ideal experience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crytek","platforms":[{"id":0,"name":"PC"}]},{"id":15700,"name":"Caffeine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e2/1e2631b2f97cd6ce974c86945cc52d49.jpg","description":"Synopsis\nCaffeine is a quirky first person adventure game with environmental puzzles and a touch of psychological horror.\nSet in the near future, the entire population of Earth is vigorously addicted to coffee. Massive space stations built by the biggest corporations roam the stars mining minerals to create a synthetic caffeine.\nYou awaken aboard one of these caffeine mining stations alone. Before long you realize that you are a young boy with no memory of what has transpired on this seemingly empty space station.\nNaturally you set out to explore the depths of the huge structure to figure out what exactly is going on.\nCaffeine is a collection of three episodes, the first of which will be released on October 5th 2015.\nEpisode One is a 1 hour adventure which sets the story and tone of what is to come and be expanded upon in Episode Two and Three.\nEpisode Two and Three will be released as free updates to the Season Pass version of the Game in the not too distant future and will feature longer play times and challenging puzzles.Graphics\nCaffeine utilities various technologies like DirectX 12, Ray traced distance field shadowing and dynamic lighting to give players a visually stunning game which looks great on low and ultra settings.Audio\nCaffeine features stunning sound design from Jonathan Wachoru (Outlast) and a serene music score by Adam Klingman of Bay Drive Sound.Oculus Rift SupportOn release Caffeine will have full in-game Oculus Rift support by hitting alt+tab while in-game. The main menu and settings menus are currently displaying incorrectly while in stereo mode, this will be patched into the game later on in release week so we can iron out gameplay related issues first.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Incandescent Imaging","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]