[{"id":961200,"name":"The Talos Principle 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e4/4e42fc297c028630262a4abcc7769576.jpg","description":"The Talos Principle 2 is a thought-provoking first-person puzzle experience that greatly expands on the first game's philosophical themes and stunning environments with increasingly mind-bending challenges.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Croteam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":616677,"name":"Avatar: Frontiers of Pandora","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/983/9837c2e9a13a92c55c47327dfc22a81f.jpeg","description":"Avatar: Frontiers of Pandora™ is a first person, action-adventure game developed by Massive Entertainment – a Ubisoft studio, in collaboration with Lightstorm Entertainment and Disney.\r\n\r\nBuilt using the latest iteration of the Snowdrop engine, and developed exclusively for the new generation of consoles and PC, Avatar: Frontiers of Pandora brings to life the alluring world of Pandora with all of its beauty and danger in an immersive, open world experience.\r\n\r\nIn this new, standalone story, play as a Na’vi and embark on a journey across the Western Frontier, a never-before-seen part of Pandora. Explore a living and reactive world inhabited by unique creatures and new characters, and push back the formidable RDA forces that threaten it.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Massive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":311787,"name":"Madden NFL 20","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b8/0b8a262e733065e807995becfef6d9cc.jpg","description":"Face of the Franchise: QB1 - Be the Face of an NFL franchise where the decisions you make matter in your journey to become an NFL Superstar. Create your own College Quarterback to play through the College Football National Championship playoffs and the NFL Combine for your shot at the NFL Draft and to be the face of a franchise in a new and personalized career campaign mode centered around you.\n1-4 players\nNetwork Players 2-6 - Full game requires PlayStation®Plus membership to access online multiplayer\n52 GB minimum save size\nDUALSHOCK®4 Vibration Function\nRemote Play Supported\nHD Video Output 720p,1080i,1080p\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nConditions and restrictions apply. See https://www.easports.com/madden-nfl/game-disclaimers for details.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":270657,"name":"Clatter","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/43f/43f86f5399868848c5563252cfc37998.jpg","description":"Create and command your own customisable squads of fighting robots in this turn-based, arena tactics game.\nStrategiseBuild your own squads from a variety of units, including Grabbers, Flippers, Mortars and more. Each one has its own strengths, weaknesses and synergies with other units.Take on EveryoneBuilt for multiplayer, there's an ever-changing roster of maps available across both deathmatch and control game modes. Take your squads and strategies online and pit them against other commanders in a bid to climb your way up through bronze, silver and gold leagues. Can you make it to the top?Career ModeThe single-player career mode puts you in the role of player-manager, building and battling with your team across season-long leagues. Build your team from the ground up: buy and sell units, mod their stats, and grab sponsorships as you strive to take your team from chumps to champs.Daily ChallengesA new challenge awaits you every day! Battle against the AI on random maps with pre-made squads, competing for the top score on the daily leaderboards.CustomiseChange your appearance as often as you change your tactics: make your commander and arena your own and pick from an ever-expanding collection of interactive items. With hundreds of possible combinations, you can be sure you'll stand out from the crowd.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Facepunch Studios","platforms":[{"id":0,"name":"PC"}]},{"id":244746,"name":"Degrees of Separation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ff/5ffea4d92d0838d9387ca7958e32b42e.jpg","description":"Degrees of Separation is a 2D puzzle-adventure game that requires players to harness the elements of heat and cold to succeed. Two contrasting souls, Ember and Rime, are separated by an enigmatic force, and must use their respective powers to progress through a spectacular world of fantasy and adventure. Players take on the roles of Ember and Rime in single-player and cooperative multiplayer to solve the game's environmental obstacles, drawing on their unique skills to traverse through beautiful, puzzle-filled environments. The two will learn to lean on one another, their individual forces working to bring them closer together...or tear them apart.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Modus Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":31397,"name":"Full Throttle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7c/c7cec66d0ef731f891e413fc4c5dfa74.jpg","description":"One minute you're on the road, riding. Not a care in the world. Then some guy in a suit comes along, says he's got a deal for you and your gang. But when you come to, you've got a lump on your head, the law on your back, and a feeling in your gut that the road you're on is about to get a lot rougher...","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":23189,"name":"Startup Company","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc3/fc31fbf444f12d1eb6275b18018aaa5b.jpg","description":"About the gameStartup Company is a business simulation sandbox game. You play as the CEO of a newly formed software company. With an empty bank account you are forced to complete client contracts, but as soon as you get enough money you will be able to start competing against the largest tech giants, building your very own products and services.\nStartup Company includes:\n* Build Mode: Design your very own office.\n* Contract Work: Win contracts by competing on price and service.\n* Crafting System: Merge components to create modules. Use modules to create products.\n* Products: Build outstanding products by adding features, managing servers and running marketing campaigns.HiringA great company is built by great people. Optimize your staff benefits and working conditions to attract the best employees.Win ContractsYou'll be facing hundreds of available contracts, but not all of them will be good for your team. Work your way up and compete with the best in the industry to win the big contracts!Develop, Merge, RepeatThat's right, even software needs a little piecing together!\nNo matter if you want to deliver contracts or build your own product you need components and modules. Use developers, designers and lead developers to produce what you need.\nStartup Company includes a fully featured crafting/development system where you will be able to merge components into modules, servers or product features.Release, Update and ExpandCreating successful products is all about making the right decisions. Implementing or upgrading the right features is what generates hype. Hype generates users and users generate money.\nYou'll have to constantly pay attention to your hype otherwise users will start to drift away from your product. Keeping the product under constant development and releasing new versions is key to success.\nIt's your sandbox, let your imagination run wild!Development Stream on TwitchAll parts of the game development are being streamed on Twitch. Come join the community and the stream at:\nhttps://www.twitch.tv/jhovgaard","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hovgaard Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":18930,"name":"Bacteria","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ea/6eaf81a0325259f861fc4c15c46fda35.jpg","description":"More puzzle games!http://store.steampowered.com/app/415960/\nhttp://store.steampowered.com/app/375010/\nAbout the Game'Bacteria' - A new puzzle game from the creators of 'Energy Balance' and 'Energy Cycle'.\n\nThis game is based on the rules of the cellular automaton ‘Life’ devised by John Horton Conway in 1970.\n(You can read more about how it works in greater details here: http://en.wikipedia.org/wiki/Conway's_Game_of_Life )\n\nIn 'Bacteria' you have a square game field that is in some form of a stable state.  You need to add in a certain number of cells so that, after a few steps, the field will be halted (in colored mode) or even cleared (in \"hard\" black & white mode).  You could draw in single points, or use standard 'Life' patterns like \"Gliders\" (they move at an angle) and \"Lightweight spaceships (LWSS)\" (they move in a straight line).\n\nDepending on the difficulty level, the player can use a smaller area to add new cells.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sometimes You","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18034,"name":"The Dolls: Reborn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/062/0623a5d9eb22d43dd85c0d982071dc99.jpg","description":"The old doll factory was legendary. For years it turned out simple toys that children loved, but technology made a change and kids wanted things with more gadgets and the factory fell into disrepair. Most of the toys were sent away, but some had been left behind. They were cracked and broken or deemed unsellable so they were left with the remains of the factory to gather dust and slowly decay.\nHowever, a skillful toy business brought interest in the old style of toys and began production in the factory. They began to rebuild the old factory, bringing in new parts. Production began churning out shiny new dolls of every kind. The remnants of before were swept into closets or tucked under the old machinery, out of sight and out of mind. The owner said that competitors were behind the rumors that some of the construction workers had disappeared on projects after dark.\nYouíve been hired to keep watch on the factory at night and see that the automatic machines stay running. As your boss walks out the door leaving you with your company issued flashlight, he says, ďOh, and don't worry about those noises. We're sure it's nothing.\nFEATURES\nFIXED VIEW\n- Controlled Camera Angles\n- Limited Movement that enhances the experience\n- Tight Angles that limited what you see and what lurks in the shadows\nUNPREDICTABLE AI\n- Enemies that move via sound\n- Randomized Enemies in each game-play, keeping each game fresh\n- Enemies that teleport at will\n- Camouflage (Enemies that use items around to hide)\nHUD SYSTEM\n- Power System that drains when you use to much\n- Time System that acts as a survival tool\n- Lighting System that helps you survive enemies","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":14975,"name":"Streets of Rage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/687/687c7ac926491e65dcb8f0c9d45cab07.jpg","description":"Just UpdatedAll SEGA MegaDrive/Genesis titles now launch using the new SEGA MegaDrive/Genesis Interactive Hub, with all new features, UI and Steam Workshop Support!\nAbout the GameWhat was once a happy, peaceful, productive city, has fallen into the hands of a secret criminal syndicate.\nLooting, random violence and destruction are rampant. Nobody is safe. Despite repeated refusals by their superiors, three young police officers were determined to tackle the problem head on. Eventually they created a special attack unit the only way they could – they quit the force. Take control of one of the three ex-officers and make the city a place where people no longer have to walk the Streets of Rage™!","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"SEGA","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Linux"}]},{"id":12181,"name":"12 Labours of Hercules IV: Mother Nature (Platinum Edition)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aab/aab0c58b23a018c98eddc95a669698d6.jpg","description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other Hercules adventures:http://store.steampowered.com/app/342580/\nhttp://store.steampowered.com/app/360640/\nTry other Hercules adventures:http://store.steampowered.com/app/360650/\nhttp://store.steampowered.com/app/491330/\nhttp://store.steampowered.com/app/567800/\nAbout the GameThe legendary hero Hercules and his wife Megara are back, ready to embark on their next adventure! The Gods are outraged at their defeat and have summoned a fearsome beast who can match Hercules's god-like strength. The beast has trampled the countryside, turning lush gardens into desert wastelands! Restore the world's beauty by using everything at your disposal, from Megara's magical abilities to even a fire hydrant! Team up with friendly allies like King Midas and Epeius with his famous Trojan Horse to save Mother Nature from destruction.\n- Over 50 levels with new music and a new story!\n- Secret Challenges! Certain levels have hidden objects!\n- Atmospheric wallpapers and integrated Strategy Guide\n- Also features a bonus episode with a different story!\n- Build the mighty Trojan Horse!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":12058,"name":"Half Dead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/01b/01ba7e4fd25e0c57626923f0378e0b1d.jpg","description":"SUPREME COUNCIL OF THE COLONY P-9174\nNOTICE OF SENTENCING:\nThe Supreme Council of the Colony p-9174 wishes to inform you that your crimes have been analyzed and classified as \"crimes of a violent nature\". The Court has nobly decided to allow you the opportunity to choose a punishment from the list below:\n1. Participation in the entertainment show \"Half Dead\", which allows the possibility of a punishment exemption.\n2. Due process capital punishment.\nWe would like to remind you that the Council respects the rights of its citizens. Therefore, choose the penalty that conforms to your political conventions and religious beliefs. Your decision will be accepted without delay.\nExtra information about the \"Half Dead\" program and exemption conditions:\nThe show takes place in a facility composed of a network of rooms. Some are empty. Others, however, contain objects of perilous nature. Your goal is to locate the exit and escape from the complex.\nWin the game and you'll win your freedom.\nParticipation in the Half Dead Program is an opportunity to serve your country. All the proceeds earned by the show will be used to support our democracy and fight the insolent rebels who threaten our system.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Room710Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":2636,"name":"Catlateral Damage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9a8/9a805114b8cd7b0acd023c065a53d0e6.jpg","description":"Catlateral Damage is a first-person destructive cat simulator where you play as a cat on a rampage, knocking as much stuff onto the ground as possible. See the world through the eyes of a cat! Like other first-person games, you can walk and look around, jump, and crouch. Unlike other first-person games, your primary weapons are your two cat paws, which you can use to swipe at and knock objects onto the floor.\nPlay from the perspective of a crazy domestic house cat.\nDestroy precious collectibles and expensive electronics with your little paws.\nMake a mess of every room in the house, from the bedroom to the kitchen.\nProcedurally-generated houses for endless replayability.\nLoads of collectibles, unlockable cats, and power-ups.\nOver 230 photos of real-life cats to find and collect.\nEpilepsy warning: Some in-game effects may be problematic for some players. These can be disabled in the “Options” menu on the title screen or in-game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fire Hose Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2009,"name":"Warhammer 40,000: Regicide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bf9/bf95996c3518c8a29a6cd306aacdd6b8.jpg","description":"Warhammer 40,000: RegicideRegicide is a brutal take on one of the greatest turn based strategy games of all time. The game fuses multiple phases of combat with dynamic action. Manoeuvre your army into place and unleash a devastating array of tactical abilities to crush your enemies. The game offers two distinct modes:\nPlan the attack and command your soldiers through two phases of combat. Open fire on your enemies, utilise tactical abilities and unleash psychic powers to crush your foes. Fight your way through violent single and multiplayer battles to destroy everything that stands between you and certain victory.\nSharpen your tactics in both single and multiplayer games based on traditional chess rules, executing brutally violent kills in dramatic battlefield terrains. Select your race and go to war online against opponents from all over the world in the fully cross-platform multiplayer mode.\n2 unique game modes: Play in both Classic chess and extended Regicide game modes.\nOnline and single player: Test yourself against our AI in both Campaign and Skirmish and bring your new skills to bear against opponents in multiple online game modes.\nA cunning AI: Sharpen your skills verse 5 different AI difficulty settings in both Classic and Regicide.\nLocal multiplayer: Face off against live opponents in local hotseat matches.\nAsynchronous gameplay: Take your game with you and challenge your friends to multiple asynchronous matches.\nCompetitive online leaderboards: Compete against your friends and the world with live Classic and Regicide Leaderboards.\n50 mission single-player campaign: Join Captain Dracomedes as he fights for Hethgar Prime with the Sons of Sanguinius in the 50 mission, fully-narrated campaign: The Angels of Death.\n2 unique races: Play as the indomitable Space Marines or blood thirsty Orks, each with their unique strengths, weaknesses, abilities and strategies.\n11 unlockable Chapters and Clans: Requisition one of 11 iconic Space Marine Chapters or Ork Clans to field in multiplayer and skirmish matches\n36 exclusive models: Tailor your army's appearance by progressing through Campaign, Skirmish (VS AI) and Online Leaderboards.\n45 unique player and unit abilities: Unleash an overwhelming array of player and unit abilities to bring devastation to your enemies. Customise your ability loadouts to match your play style.\nLocalised in 8 different languages: Play in English, French, German, Norwegian, Italian, Polish, Russian, and Spanish.\nThis is only the beginning. The universe spans untold galaxies to conquer.\nThis is not just war. This is REGICIDE.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hammerfall Publishing Global","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":595,"name":"Mahjong Deluxe 3","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f72/f72f7959120f2c14300751899cafe943.jpg","description":"Mahjong Deluxe 3 is the newest entry in the popular Mahjong series of casual games produced by award-winning game developer EnsenaSoft. With more than 15 million downloads across versions, the blockbuster series of Mahjong Deluxe continues to impress with its ease of use, intuitive controls and family-friendly features and content.\nMahjong Deluxe 3 includes 8 different worlds containing a total of 640 exciting puzzle layouts to enjoy in classic 2D and glorious 3D. Puzzles are laid out using random tile orders, allowing you to replay each layout many times with a new experience each session. An exciting scoring system, great sound effects and relaxing music adds to the fun. Suitable to players of all ages and experience levels, Mahjong Deluxe 3 offers a modern rendition of the popular Chinese classic, and is a must-have download in your casual game collection.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":59227,"name":"Fist of The North Star: Lost Paradise","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/38e/38e483287f8e1cf6dd6aebba47d43770.jpg","description":"Year 199X, the world has been ruined by nuclear war, but humanity has survived. Centuries of civilizations are ruined forever, in this new savage era, only the strongest have access to food, water, and resources to live a little better life. In this world dominated by violence and mistreatment, there’s a place called Eden, also known as “the city of miracles”. This city is full of energy and water which is provided by a giant building, and this means that its citizens can live a relaxed life compared with the other people…\nOne day, Kenshiro, the savior of the century's end, and 64th successor of Hokuto Shinken – an ancient martial art which uses the opponent’s hidden meridian points – arrives in Eden to find his long-lost love Yuria.\nWhat destiny awaits them in Eden? Discover it with Hokuto ga Gotoku for PlayStation 4, developed by Toshiro Nagoshi, this new adventure game melt seamlessly the luxurious gameplay mechanics of \"Yakuza\" series with the exciting world of \"Hokuto no Ken\", the worldwide beloved manga series written by Buronson and drawn by Tetsuo Hara.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":28971,"name":"NBA 2K9","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/348/3486e874092065d27674684ea0968579.jpg","description":"NOTE: ONLINE MULTIPLAYER SUPPORT FOR THIS TITLE WAS TERMINATED ON 12/31/2009.  ONLINE/MULTIPLAYER FEATURES ARE NOT ACTIVE OR INCLUDED. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  The undisputed NBA franchise is back for its 10th season. Last year NBA 2K8 was the top selling basketball game on Xbox 360, and the NBA 2K series has been the #1 rated NBA simulation for six years running across all platforms. NBA 2K9 is for gamers and basketball fans everywhere who want to play the most fun, stylistic, and feature-rich NBA simulation on the market. With wholesale improvement across the board – from gameplay to graphics, presentation and online features - NBA 2K9 is the complete package and is poised to remain the category leader in next-gen sports gaming.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Visual Concepts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"}]},{"id":21591,"name":"BloodRealm: Battlegrounds","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c73/c73670b0463a8437ea8b7b5df738ec08.jpg","description":"BloodRealm combines all of the strategy and depth of a traditional collectible card game experience with the convenience of online gaming.  Build your own decks to play against your friends, compete in online tournaments, and explore a rich fantasy world in a single-player campaign mode.\nBloodRealm places you amidst the eternal warring of the gods. The covenant which decreed that the gods would respect the free will of mortals was broken by the powerful sun god Ra, who consumed a mortal mind to serve him as champion, leading his armies into war.\nThat champion is you; the game begins when you shrug off the mental bondage of Ra, an act so cataclysmic that reality broke, and all of the gods the heavens bore fell to the Earth. The gods are desperate to restore their immortality and regain their place at the zenith of the world. Only you possess the strength of will powerful enough to stop history repeating and end their tyranny once and for all.\nCan you make your own miracle and kill the gods?\nThere are Six Realms of Magic in BloodRealm: Chaos, Order, Nature, Myth, Shadow and Light.  Each Champion has access to 2 of these Realms in building a deck composed of powerful ally and spell cards. Champions also have a special unique 'Blood' ability, with additional Blood powers unlocked as they Ascend to become Gods themselves.\nThe free download of BloodRealm provides each player with the choice of one of three Champions, its starting Deck of Ally and Spell cards, 1000 Gold, and 36 single-player Campaign battles (each with 3 levels of difficulty). Additional Champions, single-player Campaigns, and card packs may be purchased using Gold, which may be earned by playing the game or by spending real currency.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Redpoint Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16601,"name":"Ame no Marginal -Rain Marginal","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f4/9f48ceb4116ceb6f2350d2a7189bd554.jpg","description":"The latest short, serious visual novel by Tomo Kataoka, the author of Narcissu 1st & 2nd, has arrived!Overview\nThere is nothing in this world.\nJust endlessly falling rain.\nThe population here is exactly one.\nGetting off the elevator one day, a mysterious world was waiting.\nNo one else was around, only endless rainy sky and weathered flagstones.\nIn this world, getting hungry and even death wasn't possible.\nIt was a world where time seems to have stopped.\nExcept one thing -- the rain continued to fall.\n\"This world has a population of just one. So get out.\"\nA girl named \"Rin\" told the protagonist.\nShe declared that she was the lone mistress of this rainy world.\nFor how many years, decades, even centuries...\nHas she lived all alone in this world?\nWill the day come when the rain stops falling? Narcissu Bonus Episode\nIncluded in the game is a copy of Narcissu 1st, as well as a brand new VERY short bonus episode.\nIt's very short, but hopefully is interesting for narcissu fans.Changing language region\nThe game is playable in either English or Japanese, but due to technical constraints,\nthere is no way to change the language within the game.\nHowever, it's possible to change the region for the game, as documented here:\nhttps://support.steampowered.com/kb_article.php?ref=8487-WSCN-4121\nNOTE\nTo play the game in Japanese, your Windows installation needs to be set to handle non-unicode text as Japanese:\nhttp://windows.microsoft.com/en-us/windows/change-system-locale#1TC=windows-7\nIf you experience issues, please email support(at)sekaiproject.com","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"stage-nana","platforms":[{"id":0,"name":"PC"}]},{"id":15405,"name":"Ratz Instagib","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f02/f026678b20a8ce9b132b01a619c242cd.jpg","description":"Fast, frantic and full of blasting fun – take to the rat-tlefield and join the Ratz Instagib revolution!\nDuke it out as a railgun-toting rat in household-themed arenas, with every shot being a potential kill – no shooting opponents repeatedly to little effect or suffering cheap deaths at the hands of people with an unfair advantage. It's every rat for themselves!\nOne Gun, One Shot – An even playing field means almost anyone can immediately pick up Ratz and start having fun, no matter what their FPS skill level.\nRocket Jumping – Use the dedicated 'Rocket Jump' button to mix up your movement; moving targets are harder to hit!\nMaps – Enjoy 13 different maps based on real-world household environments, plus tonnes of user-created arenas!\nCustomisation – Unlock loads of customisation items to jazz up your Ratz, then choose from loads of beam and frag types to really show off your style.\nModes – The best that FPS action has to offer: Deathmatch, Team Deathmatch, Capture The Flag and the almighty Freeze Tag!\nStats and Leaderboards – Fully integrated stat-tracking and leaderboards to help keep track of your progress… can you become the best rat around?\nRatzEd Map Editor – Create your own stages and share them with the community via Steam Workshop – easy to use, but incredibly versatile","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lino Slahuschek","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12286,"name":"Songbringer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da4/da4b683b236e80b0958a55844e92c8d4.jpg","description":"Songbringer: Procedural Action RPG\nSongbringer is a scifi action RPG with swords, secrets, dungeons, bosses and stuff.\nYou play the role of protagonist and accidental hero, Roq Epimetheos. With a propensity for partying and making music, he cruises the galaxy with his skybot Jib aboard the ship Songbringer, searching for verdant planets absent the presence of galactic police.\nWhen Roq finds the nanosword hidden in a cave on Ekzera, he unwittingly awakens an ancient evil. The sword is pretty fraggin' sweet though. It... hums.\nJib, the Skybot\nJib began life as a human boy on the skycity planet Yuerder. Growing up, he took an interest in programming artificial intelligence, eventually making a career for himself. On his deathbed, he illegally transferred his consciousness into a skybot, destroying the consciousness link thereby preventing overwrite.\nJib scans the bodies of your fallen foes, sometimes uncovering valuable loot. He can also gain the ability to stun foes. Jib is automatically controlled by AI, or player two can play Jib in local co-op mode.\nLacking the ability to grow one as a human, Jib is obsessed with mustaches.\nProcedural\nYou choose a 6-letter world seed when beginning a quest. This seed is used to procedurally generate the planet, overworld, secrets and dungeons.\nEntering the same world seed will always generate the same world, no matter which platform you are playing on. Thus lore and competition can be shared with others.\nPlay a new seed and surprise yourself with a new world. Or enter a seed you are familiar with for a speed run.\nOpen / Non-linear\nThe generated overworld is open and non-linear. Head in any compass direction you like or play dungeons out of order. You aren't even required to pick up the sword.\nOf the nine dungeons Roq and Jib can uncover in each world:\nSome are thematic, containing puzzles and items integral to completing the world.\nSome are secret, hidden side quests in which abilities can be gained.\nSome are tough as nails with overwhelmingly difficult foes, mobs and bosses.\nSecrets of the Cacti\nEverywhere one looks, there is much that is not seen. Concealed treasures abound. By eating cacti, Roq gains psychedelic powers and is able to perceive the secrets that lurk in plain sight.\nSome items Roq discovers can be combined to create distinct artifacts. Find a blink orb and a fire cube? Take these to the droidsmith aboard Songbringer to craft a fire orb enabling Roq to teleport forward a few steps while turning into a fireball.\nSongbringer features no experience points (no XP). Progress is made by crushing mobs, vanquishing bosses and claiming lost technological devices.\nLeaderboard\nOn completing a quest, several factors are quantified to produce an overall score:\nTime to complete\nPercentage of map uncovered\nPercentage of items obtained\nGame mode: regular vs permadeath\nYour score can be saved to a global leaderboard sorted by world seed. This leaderboard cycles through seeds by popularity and freshness. You can manually override to view a particular seed.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Double Eleven","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":334539,"name":"The Legend of Bum-bo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47e/47e433a9d3485ff799d947191a995341.jpg","description":"The Legend of Bum-bo is a puzzle based \"deckbuilding roguelike\" by Edmund McMillen (The Binding of isaac, Super Meat Boy) and James Interactive, where players collect hordes of items that can be modified, upgraded and comboed with others in many interesting ways. Play as one of many Bum-bo, each with its own unique abilities, as they smash, bash and splash their way through a variety of cardboard monstrosities, giant bosses and dark personal urges... \n\noh also its the prequel to The Binding of Isaac!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Edmund McMillen","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":244726,"name":"Ratchet & Clank (2002)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a86/a8679c1cb41f6be5cfaa5ab69a7f0943.jpg","description":"Ratchet & Clank is a 2002 3D platform video game developed by Insomniac Games and published by Sony Computer Entertainment for the PlayStation 2. Ratchet & Clank is the first game in the series and precedes Going Commando.\r\n\r\nThe game follows the anthropomorphic character Ratchet meeting the robot Clank on his home planet. Clank discovers that the villainous Chairman Drek of the Blarg race plans to create a new planet for his species, destroying other planets in the process. Clank convinces Ratchet to help him in his mission to gain the help of the famous superhero Captain Qwark.\r\n\r\nThe game offers a wide range of weapons and gadgets that the player must use to defeat numerous enemies and solve puzzles on a variety of different planets in the fictional \"Solana\" galaxy. The game also includes several mini-games, such as racing or hacking, which the player must complete to proceed. The game was very well received by critics, who praised the graphics, gameplay, voice acting, audio, soundtrack and comedic approach to the story; some criticism was leveled at the camera, the characterization of the lead characters and the low level of difficulty in early stages","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"}]},{"id":59868,"name":"Zup! X","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdc/fdc693edadd3f548f24db07c9fc79468.jpg","description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60+ Levels\n▪ 2880 Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic by Ann Sharova","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":30025,"name":"MineSweeper (Microsoft)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a9/0a916d963e3ce8aed9904d6757a15dfc.jpg","description":"Minesweeper is a Puzzle game, developed and published by Microsoft, which was released in 1992.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Microsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":17003,"name":"Sword of Asumi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7c/e7c3b3730e82b407b03183bb35cb68c7.jpg","description":"Welcome to Edo, an alternate realm where history took a different route. The Samurai of Japan were never outlawed and the emperor lost power preventing Japan from opening its borders to the other nations of the world.\nEdo is now a very different place from modern Japan, where tradition still holds sway other the people and it's leaders. As time has passed the Samurai have been given ever increasing levels of power by the Council of Nobles and their leader the Lord Regent.\nThis has given rise to the creation of a special core Samurai unit known as the Justicars, though members are appointed by the council, they remain an autonomous unit, able to investigate and judge any threat or criminal they find. It is their duty to safeguard the continuity and protect the people.  But Edo is not a land of peace and plenty, strife exists in all corners of the once great empire. Rival factions constantly battle for land and power whilst rebellion grows from within.\nEnter Asumi - A female samurai of the black clan, trained from birth to kill on command. Now newly appointed as a Justicar of Edo. Our protagonist finds herself in a place she never thought she would be, outside of the shadows, within an academy, trying to root out a rebel before civil war can engulf Edo and its people.\nGame Features Strong, Deadly, Female Protagonist\nPC, Mac & Linux Versions\n1280 x 720 Standard resolution + Full-screen Mode\nHuge amount of in game choices that effect the story\nMultiple Good and Bad Endings\nSeven major NPCs + Multiple minor NPCs\nFour Romantic Love Interests (2 male & 2 female)\nOver 45,000 word original storyline\nOriginal Musical Score\nMain Theme Ft. Vocals by Mika KobayashiAdditional Extras\nMusic Room - To play tracks from the game\nCodex - Lore on the world of Edo\nUnlockable CG Scene Gallery as you play\n48 Save Slots with mini Screenshots + quick & auto saving\nEasy Rollback and GUI removal\nSeparate Sound & Music volume controls\nAlso includes Steam Trading Cards***","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dharker Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":15630,"name":"Brief Karate Foolish","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07f/07fc691f1ccd08c3da6e3ce18a74ff51.jpg","description":"Here comes a new epic of live action fighting game!!\nWith 60fps smooth action, sexy and deadly guys fly into air and bounces their flab!\nLegendary underwear \"Black Briefs\"...\nIt is said that the owner of the briefs rule the world.\nNow, Brief Fighters from all over the world gathered and underground tournament for the Black Briefs has started.\nDefeat mighty enemies, and get the legendary briefs!\nS.Tamade\nA martial artist who pursuits strength.\nTo fight with stronger enemies, he decided to join the tournament.Tamano Hikari\nA wannabe sumo wrestler who always loses match after cheating.\nTo achieve upset win, he joined the tournament.Nininga-Shimaru\nA successor of the strongest school of Ninjitsu clan.\nHe looks like a berserker who brandishes cooking knives, but in his mind, he is a pure susceptible man.Kuranado\nA famous assassin who arrived to assassinate B.Zoro, who is organizer of the tournament.\nHe can breeze light bullets from his mouth, but can’t control them(so wearing mask)\nLover of anime figures and dolls.Stretch\nA precocious boy whose policy is health 1st, and underwear 2nd.\nAfter trying various healthy items, he found briefs are the best(just became exhibitionist)\nHe joined the tournament to display his beauty to the world.Garigari-kun\nA examinee who studied too much and lost his sanity.\nHe arrived at the tournament mistaking it examination(and still not noticed where it is)C.Gomadare\nA suspicious person who call himself French and Japanese half.\nTo display his beautiful(he thinks so) body, he joined the tournament.Bonsoir \"Nya\" Nekomimi\nA wild boy who has superb athletic ability.\nMake a fetish of Nekomimi(cat ears) and participated the tournament to be a superstar of Nekomimi.B. Zoro\nThe emperor of the darkness who wears Black Briefs.\nHe has extreme power and ruling over the world.\n9 characteristic, deadly,  and beautiful Brief fighters.\nFinish moves by command.\nHands, Legs, breast, and Hips! In the brief Karate, every part of the body are weapons!\nFunny and stupid movement of the live action characters.\nSupport (local) multi player.\nFree for all Briefs Lovers!\nThis game is optimized for good old Windows 98, and may have some compatibility issues running under Windows 8 or 10.\nUnfortunately we are not able to offer any official support for them.\nWe apologise for the inconvenience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"D.C.S","platforms":[{"id":0,"name":"PC"}]},{"id":15542,"name":"1979 Revolution: Black Friday","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c52/c52b91ce9b9cfbbceb30f0d02b2d6f53_eRrH0FL.jpg","description":"Based on real events and eyewitness testimonies.\nIn this authentic, historically accurate, stunningly engaging experience -- you must decide who to trust and what you stand for -- as the world is set ablaze around you.\n**Winner of Grand Jury Prize at IndieCade ‘16, Official Selection of The PAX 10, Game of the Year Finalist by TIGA, BEST OF E3 Nominee by IGN, People’s Choice Finalist by FoST, Medal Winner at Serious Play Awards.**Key Features\nCRITICAL CHOICES - The choices you make will shape your experience in the Revolution, and the fates of those around you -- both in the present and the future.\nCINEMATIC EXPERIENCE - Branching cinematic story told through motion captured animation and voice over performances. Discover the rarely seen world of Tehran in the 1970’s, through a striking visual style.\n\nEXPLORATION - Explore the world of the collapsing city under martial law: covert headquarters, rioting protests, bustling city streets and more.\nPHOTOGRAPHY - Take photos of the period accurate in-game world and compare them to the original archival photos captured by celebrated photojournalists.\nUNIQUE GAMEPLAY - Including urban triage, interactive action scenes and photo processing.\n\nKEY COLLECTABLES - Discover and unlock more than 80+ unique stories that color and enhance your experience of the Iranian Revolution: including primary sources like archival videos, home movies, graffiti, photographs and more.\nBASED ON TRUE EVENTS - Based on real first hand testimonies of freedom fighters, witnesses and casualties of the revolution which helped define the 21st Century, as well as those who were imprisoned in Iran’s notorious Evin Prison.Featuring Performances ByNavid Negahban (Homeland, American Sniper)\nFarshad Farahat (House of Cards, Argo, 300: Rise of an Empire, State of Affairs)\nOmid Abtahi (Damien, Hunger Games, Better Call Saul, Argo)\nBobby Naderi (Fear the Walking Dead, Under The Shadow)\nMozhan Marno (The Blacklist, House of Cards, A Girl Walks Home Alone At Night)\nNicholas Guilak (Of Gods and Kings, 24)\nRay Haratian (Argo, Under The Shadow)\nMary Apick (Homeland, Beneath The Veil)\nFariborz David Diaan (The Brink, Stoning of Soraya, Weeds)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15205,"name":"Nexus - The Jupiter Incident","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dac/dac89b69c58219b491125c2e0fcc0a33.jpg","description":"At the dawn of the 22nd century, the conquest of space and the colonization of the solar system is being monopolized by several huge and ambitious mega-corporations. Although extremely delicate and vulnerable, a balance is maintained by these companies. At the very edge of the solar system the companies make a discovery which will shift the technological advantage and upset the balance. And so a new conflict is born: \"The Jupiter Incident\".\nNexus - The Jupiter Incident is a real-time mission-based tactical space game featuring spectacular real time battles and breathtaking motion picture quality. Focus on tactics and action as you control up to a dozen battleships encountering aliens, unknown solar systems and astrophysical phenomena in your struggle to save Earth.\nAre you ready to take on the challenge?\nEpic campaign with 6 episodes and more than 26 thrilling missions\nDiverse mission types: espionage, fight, stealth, sabotage, rescue, science, etc.\nControl up to 10 extremely detailed, customizable spaceships from basic to simulation level\n6 different alien species with race-specific tactics and 30 alien spaceships\nMore than 50 unique characters and 90 different weapons and devices\nFlexible starmap system: animated map objects, light flares, etc.\nZoom in on more than 350 planets, moons, comets, etc. in a fully 3D environment\nPlanet movement based on real physics","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":14552,"name":"Holy Avatar vs. Maidens of the Dead","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc1/fc14053a0467585040c8bed449b1e3c5.jpg","description":"Following the success of the RPG-Parody Grotesque Tactics franchise, comes a spin-off nestled in the heart of a tropical zombie bevvy of beauties against the greatest hero of them all, conveniently titled: Holy Avatar vs. Maidens of the Dead\nAs the story goes...\n...after the last great battle, our hero Holy Avatar decides to grab a little R&R with his Guild of Maidens on a Caribbean island he recently purchased and renamed “Holy Island”.\nUpon arrival on the beach, he makes a gruesome discovery; numerous dead maidens, horribly mutilated, are scattered all over the island and what’s worse, they’re not staying dead! Holy Avatar must put down his mai tai and investigate this strange and unsettling turn of events. New adventures, new hazards and, did we mention the zombies… await our hero and his companions inside the dense woods and caves of this once idyllic island.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]},{"id":13762,"name":"Russian SuperHero Dead Ivan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/611/61164de1b27edd3108681208c0055384.jpg","description":"More games by Anatoliy Loginovskikhhttp://store.steampowered.com/app/449440/\nhttp://store.steampowered.com/app/474820/\nAbout the Game\nSomewhere, in the farthest corner of Russia, you can find him: the great Russian superhero Dead Ivan! Surrounded by the most common stereotypes, he's armed with a chainsaw full of magic and is always ready for a fight! Where else can you meet a bear in boots with a balalaika and ride along with him on the back of a dragon while shooting insidious geese?\nOnly here, at:\nMotherland of Dead Ivan!\n\nWithin this game you might find:\n- Many enemies: monsters, zombies, skeletons, Count Dracula, mushrooms, and the most terrifying of them all, geese!\n- 5 different types of magic!\n- Total freedom of action!\n- Puzzles!\n- Lots of gold!\n- Jokes!\n- Democracy and intriguing storyline!\n- And jokes! Oh, I already listed that, sorry.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Anatoliy Loginovskikh","platforms":[{"id":0,"name":"PC"}]},{"id":9517,"name":"Simutrans","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82e/82e826f32eb6115782c863a8b48e92d6.jpg","description":"Update NotesSteam Workshop integration has now been pushed out for the application for Windows and Linux. A windows only content uploader has also been made available as a separate DLC to allow uploading of already produced content. There are plans to make additional tools available at a later date.\nAbout the GameSimutrans is an open-source transportation simulation game available for Windows, Mac, and Linux. Your goal is to establish a successful transport company and build the necessary infrastructure to transport passengers, mail and goods between cities, factories and tourist attractions by land, air and water.\nEstablish a successful transport company\nTransport passengers, mail and goods by land, air and water\nInterconnect cities, districts, public buildings, industries and tourist attractions\nControl and watch your finances and the traffic of your vehicles and goods\nLots of graphics packages to choose from\nPlay with people from anywhere in the world in online gamesMultiple ChoicesGraphics Packages (Paksets)\nIn Simutrans you have multiple choices from the beginning to the end. Even before starting the game you have lots of graphics packages to choose from, every pakset giving you a different experience and play style.\nVehicles and Cargo\nThe success of your company will depend on good planning, and we give you the tools for it. Simutrans can have buses, trucks, trains, trams, ships, airplanes, monorails, maglevs and any other vehicle that goes through air, land or water. Choose them wisely and transport the immense variety of cargo each pakset has to offer, from passengers and mail to raw materials and consumer products.Dynamic and IntelligentCargo has Destinations\nSimutrans citizens and products don't simply jump in your vehicles and go to wherever you send them. They actually have individual destinations: people want to check out attractions, go shopping, or visit friends. Products also have their destinations - factories have contracts with each other and they won't sell or buy from anyone else. If you don't give them the possibility to go where they want, they simply won't use your transport company.\nComplete the Chain\nTransporting products not only gives you money, but makes the economy roll. As you transport products between factories, they start producing and selling. Every factory receiving the materials it needs starts producing new goods letting you connect more and more factories across the region.\nInfluencing Cities\nYour transportation affects city growth. Every unit of anything you transport will affect the nearby cities making them grow and prosper. Sometimes cities will create new attractions and places of interest, which attract a lot more passengers. Or maybe your service may attract new industries, that give you even more opportunities. But not everything you do leads to good things - as cities grow more cars are on the roads, and you will end up trying to deal with the traffic. What you do shapes the future.Control and CustomizeConfigure All or Nothing\nSimutrans has a lot of configurations that you can customize. If you're not a customization freak, don't worry, generally with a few options Simutrans will fit your play style. But if you are, you'll enjoy all the options and ways to change the game.\nBuild Your World\nWhen you create a new game, don't expect it to be a fixed world. You can shape the world to suit your needs, build roads, factories, houses, and buildings, raise and lower the terrain, create rivers, lakes, and seas, or beautify the world by planting trees.How You PlayMultiplayer\nTired of playing alone? Simutrans lets you play multiplayer. You can join a public server and compete and collaborate with people all around the world. You can also play with your friends creating a private online or LAN server.\nHardcore or Casual?\nYou can challenge yourself in a normal game, trying to make your company successful and rich. Or you can just relax and have some fun playing with no hurry or money, just for your enjoyment and the satisfaction of transporting everything.CostThis game will be Free on Steam.LanguagesSimutrans offers a range of languages, translated on a volunteer basis. Languages will be listed on the steam page when they reach at least 80% translation of Base Texts, and 65% translation of pak128.History of SimutransSimutrans is an Open Source game developed under the Artistic License.\nThis game was originally developed by Hansjörg Malthaner from 1997 till 2004, before being handed over the 'The Simutrans Team' in 2005. Since the beginning it has been upgraded and updated.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Simutrans Team","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":768,"name":"Dungelot: Shattered Lands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ca/7caba784b2fd55260cb271a53fed997b.jpeg","description":"Dungelot: Shattered Lands takes you on an epic roguelike dungeon-crawler adventure to defeat zombie cows, splat giant evil mushrooms, and generally get back home in one piece. Deceptively simple, ever so addictive.\nThree worlds to explore with endless modes unlocking after each one\n4 Characters to upgrade, each with distinctive play styles\n18 Dungeons to fight through\nMini games to uncover, side-quests to undertake\nBosses to fight, merchants to trade with, and secrets to uncover\nDeveloped by Red Winter, a two man studio based in Russia, Dungelot: Shattered Lands is the third part in the popular series, and tasked the player with traversing randomly-generated dungeons, smashing enemies in the face and hunting for the keys that will allow you to venture even further. Dungelot originally became a cult hit thanks to its addictive \"just one more go\" feel, and with Shattered Lands, the Dungelot formula has now been fully realized.\nDungelot: Shattered Lands will feature dozens of hours of content, with three worlds to explore, hundreds of items, spells and enemies, and epic boss battles that will burn your face off.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":406002,"name":"ONE PIECE: PIRATE WARRIORS 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a3/7a3f0042e23365c3bb4d4cf300e92d00.jpg","description":"The PIRATE WARRIORS series has successfully combined the popular anime ONE PIECE with the thrilling action of the WARRIORS series to create a worldwide phenomenon selling more than four million copies! Based on the concept of 'fighting hordes of enemies while adventuring with trusted allies,' experience awesome ONE PIECE action lifted straight from the anime!\nONE PIECE: PIRATE WARRIORS 4 is the latest evolution of PIRATE WARRIORS action! Based on the concept of 'experiencing a real ONE PIECE battlefield,' buildings will come crashing down during the action and attacks will throw up smoke and dust, placing you in the thick of the ONE PIECE world! Injecting fresh elements that couldn't be achieved in previous entries has now realized an even more thrilling brand of PIRATE WARRIORS action!\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\n1-2 players\nNetwork Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer\n34GB minimum save size\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©EIICHIRO ODA/SHUEISHA, TOEI ANIMATION\n©2020 BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":399391,"name":"Bendy and the Dark Revival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84f/84f1d4f189e5dd3772d2c01aee4e4922.jpg","description":"Bendy and the Dark Revival™ is a first-person survival horror game and the much anticipated sequel to Bendy and the Ink Machine™. Play as Audrey as she explores the depths of a curiously creepy animation studio that’s gone completely mad. Combat ink-tainted enemies, solve puzzles, and evade the ever-lurking Ink Demon while seeking your way back to the real world. You never know who or what is going to be around the next corner in this dilapidated realm of shadows and ink.\n\nDiscover the truth. Escape the studio. Above all, fear the Ink Demon…and survive.\n\nFirst-person survival horror and the much anticipated sequel to Bendy and the Ink Machine™.\nWander the vintage cartoon studio using agility, stealth and strategy to combat ink-tainted enemies.\nEarn powerful new abilities to help you in your escape.\nSolve environmental puzzles, ally with beloved cartoon characters, and elude the horror of the Ink Demon.\nDiscover the terrifying secrets of the creepy ‘rubber hose’ cartoon world of Joey Drew Studios™.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Joey Drew Studios","platforms":[{"id":0,"name":"PC"}]},{"id":354377,"name":"Super Mecha Champions","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b5e/b5ed91ad6b5ea20e3e00b6b646fe068a_9NXj1KY.jpg","description":"On your marks, set, go!\nSMC players from all over the world have descended upon a futuristic city to battle with marvelous Mecha!\nUnleash your Mecha and fight for the crown you deserve!\nExchange Fire! Incredible Mecha Brawls!\nSelect from an all-star lineup of Mecha and join the fierce clash with your skills.\nPilot your personal Mecha, quickly returns to battle, impose your superior resolve and abilities!\nCrazy Firefights! Thrilling Combat & Cool Weapons!\nAn explosive combo of man and Mecha! It's more than high-tech in this arena, but how you strategize and adapt!\nPlasma cannons, homing missiles, snipers, flamethrowers... Get a load of the ultra-cool weapons at your disposal!\nMan vs. man, Mecha vs. Mecha... All new exciting combat experience!\nAmazing Graphics! Manga-Style Cities!\nPilot Mecha through every corner and between the highrises of a contemporary ACG Japanese-style cityscape. From a pretty lass with double pony tails to a suave, winsome man, there's a parade of characters waiting for you to discover and unlock.\nThis is the dream arena where you're the star!\nHighly Flexible! Team Up & Claim Victory!\nExecute flawless attack and defense through impeccable teamwork! Utilize marvelous Mecha, diverse arsenals, and responsive control for unrivaled excitement!\nFly your Mecha through barrage of incoming shells in perfect evasion and return fire!\n[Contact Us]\nFacebook: https://www.facebook.com/SuperMechaChampionsGlobal\nOfficial Website: www.supermechachampions.com","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"NetEase Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":62775,"name":"Nova Drift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03a/03aa7cfa7201e6bf41036123ce69be93.jpg","description":"- SURVIVE - EVOLVE - DOMINATE -\nNova Drift is a \"Roguelite\" space shooter which melds a classic arcade experience with modern action-RPG elements. Your ship rapidly evolves as you defeat enemies, allowing you to shape its abilities and weaponry to your desires in a matter of minutes. Unlike many action-RPGs which can absorb hundreds of hours of time, Nova Drift allows you to take a ship build from inception to execution in a single game session.Features Create a unique build every run. Games are quick, allowing for rapid experimentation, iteration, and advancement.\nCunning and creativity are rewarded as you chain upgrade modules for powerful synergies.\nAccess over 100 weapons and mods as you progress and expand your arsenal.\nBuild to play how you want. Snipe, command a drone army, discharge your shields, charge up, burn enemies with your thrusters, or smash right through them... there's a way to make it work.\nUnlock modular challenge modes, providing greater risk and rewards. The stakes are high, as death is permanent!\nEvery game is randomly generated, keeping the fight intense and unpredictable. Fight through the campaign or play endlessly...\nNova Drift is a living game. Frequent updates will continue to expand the depth and content of the game world.\nShip EvolutionsMods & Gear can be unlocked, upgraded and combined to make unexpected and powerful combinations:Example Build #1: Seeking Cluster GrenadeGrenade + Body: Assault + High Explosive + Splinter Shot + Heat Seeking + Charged Shot\nThis build focuses on creating as many grenade splinters as possible using the Grenade weapon and sends them tearing toward targets using the Heat Seeking mod. The overlapping blasts from the initial explosion add up to a huge amount of damage at the epicenter, while the seeking clusters handle crowd control.\nExample Build #2: Celestial Shield-BomberHullbreaker + Amp Shield + Volatile Shields + Flash Shielding + Emergency Systems + Celestial Lance\nThis build takes advantage of the Hullbreaker's speed and resilience to crash damage to slam directly into enemies. The fragile Amp Shield is used not for defense, but to augment Hullbreaker's strongest aspects, gaining increased speed and force. The shield will break on impact, but we can capitalize on that using the Volatile Shields mod, which detonates the shield when it goes down, blasting all nearby enemies. Flash Shielding gets it running again quickly while Emergency Systems grant a moment of damage immunity, making charge attacks safer. Finally, Celestial Lance is used to deal burning damage to everything around the ship at high velocities!\nNova Drift is developed by Jeffrey Nielson of Chimeric, a 1-man development team, featuring music and audio by Miles Tilmann of Pixeljam.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pixeljam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":62406,"name":"Beyond Blue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef1/ef148c6705090fb534bd8f94e6be13b9.jpg","description":"Set in the near future, players will explore the mysteries of our ocean through the eyes of Mirai, the lead on a newly formed research team that will use groundbreaking technologies to see, hear, and sense the ocean in a more meaningful way than has ever been attempted.  The game will feature evocative narrative elements, exploration of this untouched world, and adventure that challenges the player to make high-stakes decisions during the crew’s expedition.\nEmbracing the same inclusive development process that was used to create Never Alone (Kisima Ingitchuna), E-Line’s BAFTA award-winning game about Alaska Native culture, the company paired world class game makers with some of the field’s leading ocean experts to craft an experience that reflects the awesome wonder and unbounded mystery that infuses our planet’s beating blue heart.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"E-Line Media","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":46689,"name":"Castle Clicker","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec2/ec28c18ea2b3cfa54cf3e019dbdb6dcd.jpg","description":"An idle tapping game with Farms, Mines, and Castles!  Dozens of buildings to unlock and upgrade!  Puts a new spin on both Tycoon and Clicker games!  A good game if you have some down time in between matches of better, more well made games.\nTired of mindless idle games and clicker games?  Play a Clicker game unlike any other!  Just tap and click to build a bustling City where you can manage your workers and resources.\nDiscover ancient Artifacts and recruit special Avatars to help you with new powers and abilities!\nFeaturing:\n- Beautiful, full resolution graphics and design\n- Buildings with special game play attributes, like the Bank that can generate interest on your Resources\n- Full control over time management, send your Ships out for only a few minutes or for several days for greater rewards!\n- Frequent feature updates, including new buildings!\n- Infinite Gameplay: Even when you think it ends, there's more!\n-Full featured Leaderboard system\nGo start building your first Farm and discovering your first Mine!\nThanks for playing Castle Clickers!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Autotelic Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42303,"name":"BioShock Infinite: Burial at Sea - Episode Two","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/649/6497e2bb100c6cffb3ac27a4fc014822.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Irrational Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]}]