[{"id":9545,"name":"Shadow Warrior 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b2/0b240149610b8b20eac098b8071f575a.jpg","description":"Shadow Warrior 2 is a first-person adventure and the second part of the original's title released in 1997 reboot. The company responsible for the original is 3D Realms. \n\n###Gameplay \nThe player controls the protagonist with the arsenal of 70 weaponry including melee weapons, firearms, and throwables. The weapons may be customized: there are three gem slots in each one with the gems improving different characteristics in the armament. Due to the detailed battle system, it is allowed to cut an enemy into pieces and tear him apart in different ways, shooting, for example, his limbs off. A hero moves through levels, overcomes obstacles and climbs walls. There is no linear structure to the game as early missions can be replayed and newer location re-explored — that is one of the contrasts with the previous installment the title is made. Non-story-related levels are generated procedurally — it means their layout differs from time to time. There is a four-player cooperative mode, in which a party can walk through the same campaign levels together.\n\n###Plot \nThe narrative centers around Yakuza — the gang is trying to force Lo Wang — the protagonist — to accomplish the job of reclaiming a piece of jewelry from a local Shrine. The story circles around relationships between the characters, mutations due to ancient relics and the adventures in Indiana Jones style.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":19685,"name":"Just Cause","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e60/e601c02ec49ef4f1d5ef147994b3935f.jpg","description":"Grand Theft Auto-like Just Cause features a unique setting and the ability to literally destroy everything.\n\nPlay as Rico Rodriguez, CIA agent that on a mission to topple the dictator’s rule in one small tropical island San Esperito.Agent Rodriguez can count on the help from fellow colleagues from the agency: Tom Sheldon and Maria Kane.\n\nThe game features non-linear gameplay and fully open world with more than 1000 square kilometres of tropical jungle, sandy beaches and cities to explore. There are 21 story missions and more than 300 side quests to complete in the singleplayer campaign. Just Cause uses Avalanche Engine that allows recreating detailed landscapes and more than 80 ways to travel around San Esperito via land, air and water: at player disposal bikes, cars, boats, submarines, helicopters and planes. Rico can perform stunts with any of them, jump to another car or use parachute while on the roof.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Avalanche Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":258322,"name":"Blasphemous","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b01/b01aa6b2d6d4f683203e9471a8b8d5b5.jpg","description":"Blasphemous is an action-platformer that combines the fast-paced, skilled combat of a hack-n-slash game with a deep and evocative narrative core, delivered through exploration of a huge universe comprised of non-linear levels.\r\n\r\nImmerse yourself in a dark fantasy nightmare that has been constructed PIXEL BY PIXEL by our committed artists.\r\n\r\nFeatures:\r\n- Explore a huge land, a universe that feels as open as it is oppressive, delivered through a non-sequential level design that puts you in control of where to go next.\r\n- We are putting great focus on achieving a very satisfying combat mechanics with very responsive control, smooth animations and lots of blood and gore.\r\n- Handmade pixel art, with large sprites and super smooth animations, created pixel by pixel, frame by frame.\r\n- Evocative narrative: Blasphemous’ levels are not just platforms; they tell a story to those who are interested, but don't get in the way if you just want the action.\r\n- Find your personal combat style by equipping rosary beads, or carrying around relics that boost your abilities.\r\n\r\nStory:\r\nSet in the savage land of Orthodoxia, a place where religion is of the utmost importance in the eyes of the populace, superstition runs amok, and churches outnumber people two to one. You will find yourself in this hellish territory in the wake of the Age of Corruption.\r\n\r\nTrailer:\r\nhttps://www.youtube.com/watch?v=t8zaNelwUU8\r\n\r\nKickstarter:\r\nhttps://www.kickstarter.com/projects/828401966/blasphemous-dark-and-brutal-2d-non-linear-platform","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"The Game Kitchen","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":1299,"name":"Mount & Blade: Warband","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccd/ccd40e8f86c0ae10a082b610d31d4475.jpg","description":"In a land torn asunder by incessant warfare, it is time to assemble your own band of hardened warriors and enter the fray. Lead your men into battle, expand your realm, and claim the ultimate prize: the throne of Calradia!\nMount & Blade: Warband is the eagerly anticipated stand alone expansion pack for the game that brought medieval battlefields to life with its realistic mounted combat and detailed fighting system.\nGraphical overhaul: Support added for HDR, FSAA, depth of field, soft particles, tone mapping, and many other effects\nNew models with greater detail and high-quality textures\nMultiplayer battles with up to 64 players. Multiplayer modes include Deathmatch, Team Deathmatch, Capture the Flag, Conquest, Battle, and Siege\nA campaign allowing you to become the ruler of a faction and convince lords to become your vassals\nThe ability to upgrade your companions to vassals by granting them lands\nThe ability to marry a lady of the realm for romance or cold political gain. Try to win a lady’s heart through poetry or bravery\nImproved mechanics for soldier morale: Soldiers will break and run away if their morale gets too low\nPick any projectile off the battlefield for use as additional munitions\nNew motion-captured combat animations\nNumerous improvements to the combat system: Your shield will still stop arrows even if you are not actively defending\nThe ability to play multiplayer matches on random maps as well as hand-designed ones\nMultiplayer equipment system: Earn money by fighting opponents or accomplishing goals\nThe ability to use most throwing weapons in close combat: Switch to using a javelin as a short spear when the enemy gets close\nSpend gold on more powerful equipment, using a carefully balanced system that will make combat more exciting without giving too much of an advantage to the leading team","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"TaleWorlds Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9853,"name":"H1Z1: King of the Kill","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/848/848253347dc93c762bfd51c7e4989b8f.jpg","description":"H1Z1 is one huge deathmatch in which every player tries to eliminate all others. Up to 150 players can compete at once, and the last survivor wins. There is also a team deathmatch option for groups of two to five.\n\nAt the beginning of each match, all players are dropped randomly across the map. Before they start killing each other, they have to find themselves weapons, armor, and other necessary supplies. They may even use cars and bikes found in the game area to move faster or run down their opponents. Crafting is also available, and players can use items they gathered to make improvised armor and weapons. \n\nSome players may decide to stay out of the fight for as long as possible to let their opponents eliminate each other. They can not bide their time forever, though: to prevent players from camping for too long, the game area will shrink over time. Poisoned gas will eventually cover larger and larger sections of the map, forcing the players to come together at last and indulge in the good old ultraviolence. The masks and hilarious motley outfits worn by the characters not only make them look unique but also bring into H1Z1 a distinct flavor of The Purge film series.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Daybreak Games Company","platforms":[{"id":0,"name":"PC"}]},{"id":2434,"name":"VVVVVV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fe/6fe228662a253cd929cc78a103541ee0.jpg","description":"VVVVVV is a 2D platformer designed in retro style. You play as Captain Viridian, the fearless leader of the team of conquerors of the dimension. And unexpectedly you crash and lose touch with each other. You will have to explore the world in which you are trapped and find your partners. You have the opportunity to plunge into the atmosphere of old-school accompanied by a great soundtrack.\n\nVVVVVV uses elementary mechanics, which does not allow to make a jump action, but you can flip the gravity. The whole gameplay consists of exciting tests built on this, in a sense, a unique mechanism.\n\nThe game is designed so that there are no artificial techniques that inhibit your passage. The game has no interactive objects, such as a lever, so as not to delay you on the way to the primary task - to save their partners.\n\nThis is an open world game where the story depends on the player and his actions. Some events will happen regardless of the player's choice.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Nicalis","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":4612,"name":"Renegade Ops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/31b/31b1a1a45ad7103e52eed8ef658209a2.jpg","description":"A rare opportunity to so wholly quench the thirst for total destruction. The game understands this desire and does everything to make it happen. Yes, there is a story in the game, but the main thing is that there are tremendous opportunities to see on the screen a bright consequence of all your destructive impulses.\nYour small car or helicopter rushes around the locations, bringing down the streams of fire. The game reality is repeatedly and colourfully detonated from every touch. The game continually offers more and more appetising victims - cars, flying and swimming devices, limousines and buildings, which can be destroyed entirely or in pieces, inflicting wounds one by one or killing with one blow.\nIt is clear that you are busy with all these mass destructions so you cannot observe the rules of the road - the game is favourably treated with the manner of your car to fly into a skid or to demolish fences not only by guns but also by bumpers. Navigation and management are also skillfully designed - and intended to not to distract you from the massacre.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3562,"name":"Styx: Master of Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd7/cd78e63236e86f97f4b2e45f3843eb3d.jpg","description":"Styx -- is a foul-mouthed two-century-old goblin that’s seen it all. \n\nHe sticks to the shadows to survive and reach for his goal -- a rare magic artifact that lays deep in the miles-long, multilayered Akenash tower. But the story is not that straightforward as it may seem at first and has couple twists that will keep a player interested until the end credits. Help Styx uncover secrets of his origin and grab all the goodies on the way!\n\nEmbark into the dark world of  Akenash tower with unforgettable grumpy commentary from the Styx himself. The world changes dynamically based on player input and developing as well as the story goes. Crawl your way through the tower by orchestrating accidents for your enemies, fighting them in close combat, or just by evading them using one of the Styx’s skills.  \n\nThis is the first take on the genre by french Cyanide Studio that fans may know by the Blood Bowl and Pro Cycling Manager series but a promising one: the game was well received among Steam users and console players all over the world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21926,"name":"Uncharted: The Lost Legacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/560/56056a71c74f751552c9baedebf8f317.jpg","description":"The first installment in the Uncharted series without Nathan Drake. This time the main protagonist is Chloe Frazer, an Indian-Australian treasure hunter and thief for hire. This new take is still a handcrafted action-adventure game by Naughty Dog studios the series is famous for. \n\nThe story starts at the market located in an Indian settlement, where Frazer is looking for an opportunity to make it through to the other part of town. The characters from the last game also appear in this one: Chloe must help renowned mercenary Nadine Ross from Uncharted 4: A Thief’s End. Together they are after a mysterious Indian artefact. \n\nLike other Uncharted games, The Lost Legacy’s plays from a third-person perspective. Chloe Frazer roams the game world both on foot and by using vehicle  To progress players are bond to use stealth tactics as well as firearms and melee combat. The game heavily emphasizes on solving puzzles and platformer challenges.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":1225,"name":"Warhammer: End Times - Vermintide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1dc/1dc45435c09f844b24eb96cd66eb6325.jpg","description":"This multiplayer-only game based on the popular Warhammer Fantasy franchise is set in the End Time era of this setting. The plot is centered around the city of Ubersreik that was recently taken over by a horde of rat-like monsters called Skavens. The players, who can team up in groups of up to four, are tasked with cleaning the streets from the dirty invaders. There are thirteen levels with different objectives, some of which involve collecting certain items or protecting a city well from being poisoned.\nThe gameplay is strongly reminiscent of that in Left 4 Dead series, in which the protagonists have to slaughter monsters coming in large numbers, using both melee and ranged weapons. There are five character classes, each with its unique specialization: the Dwarf Ranger and the Empire Soldier are strong and slow, the Witch Hunter and the Waywatcher are the fast scouts, and the Bright Wizard uses magic. On the levels, the players can find item perks that either restore health or ammo or buff the character. It is essential to fairly distribute the perks across the party, especially since every player can only have one perk in each category at a time.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fatshark","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2778,"name":"Surgeon Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca8/ca840f2a8ebfc74aac1688367dc1f903.jpg","description":"Surgeon Simulator is a medical simulation game that makes you a surgeon named Nigel Burke. You need to carry out different operations, firstly on people and later on aliens. Famous for its controls, Surgeon Simulator literally gives you the ability to control your virtual left hand’s fingers with A, W, E, R and Space buttons on your keyboard. The mouse is used to move your hand up and down.\nAs these controls aren't easy to master, it's quite hard to carry on the first operations. But the game starts to challenge you from the beginning, offering to operate a patient's heart, brains, and other important organs. The game's physics model reacts on every mistake you make with blood rivers and a patient's death. Because of this Surgeon Simulator became a meme among gamers with videos of its playthroughs gaining thousands of views.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":2559,"name":"Stories: The Path of Destinies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1aa/1aaf454e0d3809ba1c34df4514492237.jpg","description":"Stories: The Path of Destinies is an action RPG developed by Spearhead Games.\r\n\r\nThe story is set in a steampunk world on floating islands. You play as Reynardo, a corsair that had retired from his adventures because of his mother's dying wish. One day, the town he lives in is attacked by the ravens sent by the Empire. Reynardo survives the encounter and joins the rebellion to fight the Empire.\r\n\r\nThere are multiple choices in the game as the plot goes on. 24 endings are available for the player.\r\n\r\nThe players can move Reynardo between the islands using a grappling hook. At the beginning of the game, Reynardo has a basic set of attacks and blocks which can be upgraded using experience points gained during combat. If the player dies during an encounter, they are respawned at the nearest checkpoint. \r\n\r\nCrafting is also present in the game. Players can find treasure crates with materials which are used for creating new items of upgrades.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Spearhead Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17599,"name":"Mortal Kombat Komplete Edition","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/297/297a51aa1f0999016d5a35e2e1d6d8ab.jpg","description":"Mortal Kombat Komplete Edition is the embodiment of the dynamic, bloody and violent gameplay. Here you can scoff at your opponent. You can fight using an axe or a sword; you can shoot an enemy from a gun, try to burn it or freeze. And when the enemy is no longer able to resist you, you will perform the most popular reception - \"FATALITY.\"\n\nThe game includes several modes: Tag Team, Challenge Tower and a full-featured story mode. Players are wholly given the opportunity to choose legendary warriors from the expanded line, as well as the chance to challenge your friends in traditional one on one matches.  And as you progress through specific modes, players will also be able to access the achievements and statistics of the leaders.\n\nBrutal and unmerciful two-dimensional fighting game replenished with genre solutions in the style of X-Ray. Now, by the accumulating of a specific scale, the hero has the opportunity to use one of the unique techniques. Sometimes such an action can reverse the course of the battle.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"NetherRealm Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":715,"name":"Steep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b22/b227810b1a1bcbe9cf3dda22534c686e.jpg","description":"Ride a massive open world across the Alps, where the powder is always fresh and the run never ends. Defy and master the mountain alone or with friends on skis, wingsuits, snowboards and paragliders. Record and share your best stunts.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":3850,"name":"LEGO Marvel Super Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a87/a8743bdee8627c55bb9f2f01b9136ac1.jpg","description":"LEGO Marvel Super Heroes is an action-adventure video game set in Marvel universe where players have to play with Marvel characters as Lego heroes. The gameplay of LEGO Marvel Super Heroes is similar to other past LEGO games based on other super heroes yet it is one of the best-selling games in Lego video game series. You can control 180 different characters of Marvel comics like Spider-Man or Hulk, each with their own unique abilities. The main antagonist of LEGO Marvel Super Heroes is Galactus. Interestingly,the Marvel Comics co-creator Stan Lee is also playable in the Stan Lee in Peril missions and has lots of abilities from other Marvel super heroes. \nIn this game, players can explore a Marvel version of New York City. There are also side missions which are told by Deadpool and has their own unique storylines. In LEGO Marvel Super Heroes there are 15 main missions and 12 side missions in total.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"}]},{"id":3651,"name":"Sniper Elite 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fe6/fe68940746007261e34da4d9cce81423.jpg","description":"This prequel to Sniper Elite V2 is set three years before the events of the previous game, in Northern Africa during the World War II. The player assumes the role of US special forces operative Karl Fairburne. His task is to eliminate the Nazi German general Franz Vahlen before he completes his project of a doomsday weapon. The locations and background events are inspired by the real historical places and battles.\nThe gameplay is strongly oriented towards stealth action. Your protagonist is a talented marksman who can use a variety of sniper rifles. Finding a perfect spot to snipe from is as important as changing it, since you cannot hold one position for too long without being detected. Fairburne’s condition and the environment influence his accuracy; for example, he cannot shoot straight after running or against the wind. A unique targeting system allows you to see where your bullet will hit the enemy’s body or a vehicle and the amount of damage it can deal. Fairburne can also use other types of guns, as well as explosives. Kills earn the player the points that push your character towards higher ranks. Besides the story mode, there’s a co-op mode and five multiplayer modes, including the classic deathmatch and “capture the flag”.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":60179,"name":"Hellblade: Senua's Sacrifice VR Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/015/015988a097b5a0e78b4ecd631e85daba.jpg","description":"The VR Edition of the critically acclaimed BAFTA award-winning Hellblade: Senua's Sacrifice.\nFrom the makers of Heavenly Sword, Enslaved: Odyssey to the West, and DmC: Devil May Cry, comes a warrior’s brutal journey into myth and madness.\nSet in the Viking age, a broken Celtic warrior embarks on a haunting vision quest into Viking Hell to fight for the soul of her dead lover.\nCreated in collaboration with neuroscientists and people who experience psychosis, Hellblade: Senua’s Sacrifice will pull you deep into Senua’s mind.\nNote that Hellblade does not support motion controls.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ninja Theory","platforms":[{"id":0,"name":"PC"}]},{"id":17295,"name":"Enclave","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de4/de4b7cb80b39d95943f2931093b46932.jpg","description":"Enclave is a role-playing action game developed by Starbreeze Studios.\n\nA long time ago, the people of Celenheim are murdered by a demon known as Vatar. As a last resort, one of the high wizards created a rift around Celenheim which kept the armies of Vatar out. Years passed, Celenheim's citizens forgot about the war as their daily affairs became their only bother. But the rift is closing and the evil raises its head once again. The Protagonist is released from prison by strange coincidence. It is his choice whether to stand by the queen of Celenheim or join Vatar in his campaign.\n\nPlayed from a third-person perspective, Enclave offers the player a hack and slash experience. Players are free to use either magical or medieval weaponry on their quest. With each new mission, the player chooses which character they would like to play as and the equipment to use. It is possible to collect gems and gold to purchase new equipment at the start of the next mission.\n\nEnclave features a vast class system with different class rosters whether the player decides to join the Light or the Darkness.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Starbreeze Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3450,"name":"Saints Row: Gat Out of Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ad/1ad3737af2c4a4ff8e7f5540b5dcade8.jpg","description":"Saints Row: Gat Out of Hell is an action-adventure game, a standalone DLC that serves as an epilogue to Saints Row IV. The Boss is taken by Satan to Hell in order to marry Satan’s daughter Jezebel. Saints lieutenants Johnny Gat and Kinzie Kensington follow them to rescue The Boss. You can play as one of the lieutenants.\nThe game is set in an open world of New Hades, consisting of five islands, that you can explore flying around. This world is full of side quests, collectibles and other activities that you need to complete to progress through the story. While you can’t customize your character, you obtain superpowers, including summoning demons to support you during the battle, magic aura to confuse enemies, and demon weapons. The core gameplay is third-person shooting but with a twist: instead of bullets your new guns will shoot with explosive toads and locust.\nIn general, Gat Out of Hell follows the spirit of the franchise, supporting its fast pace and absurd tone that turns another mafia game in a colorful burlesque.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Deep Silver","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":22789,"name":"Serious Sam: The First Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f0e/f0e050dc774d4ae3afced76b33516295.jpg","description":"There were times when first person shooters were much simpler than now. There wasn't so much going on with the story or plot but rather the main purpose of shooters was nothing more but shooting. Serious Sam: The First Encounter, made by Croteam, was no different. It was the first game in the series. The difference from other first-person shooters of that time was slightly different setting. This time – not hell, or space but never-ending dunes of Egypt. The game is well-known for its design choices and enemy behavior - to run in big waves directly to a player. The story of the game is about extraterrestrial being named Mental who wants to destroy humanity and alien race called Sirians who left lots of artefacts to be discovered by humans. Humans in order to survive choose to use \"Time-Lock\" - an ancient Sirian artefact in hopes to kill Mental's army of grotesque monsters. Humanity chooses its last resort – brave and strong man named Sam \"Serious\" Stone who is the main protagonist of the game and only he has the honor to use \"Time-Lock\" against aliens.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":20760,"name":"FINAL FANTASY XIII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/943/9432de383089b0a427a3cdf3687b2b73.jpg","description":"FINAL FANTASY XIII is an action RPG with fast-paced combat, set in a science fictional world of the future. It's ruled by the Sanctum, a theocratic government, and a mechanical creature fal'Cie that has the power to make people its servants. You play as Lightning, a former soldier, who needs to save her sister Serah, who was marked by fal'Cie. She joins the resistance; however, they get marked by the creature too and have to fulfill its task to avoid death. \nThe key feature of the game is its complicated combat and development system. Three characters can take part in a battle, while you control only one of them. To fight you need to choose actions that will be used but their amount is limited with Active Time Battle bar. There’s also the Paradigm system that allows giving the characters certain roles to perform in the battle making it more effective.\nThe development tree in the game is called the Crystarium. It consists of ten levels to upgrade your stats, such as health, strength, magic and so on. Crystarium Points to progress are given for killing enemies.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":3251,"name":"F1 2015","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff6/ff66ce127716df74175961831ad3a23a.jpg","description":"F1 2015 is a racing simulator based on the 2015 Formula One season, but with teams from the 2014 season (including the Hockenheimring track, which is missed from the 2015 season calendar). Seventh in the series. It presents the crews and pilots who participated directly in this season. Unlike its predecessors, the game received a new engine, improved physics and graphics.\n\nA \"Pro Season\" mode was featured. This mode was different from the usual championship in a complete lack of interface and management assistance, as well as the highest level of complexity. The career mode, which was in the previous parts of the series, did not appear in the game.\n\nThe game is also compatible with the voice recognition  (available only on PlayStation 4 and Xbox One). With its help, players will be able to communicate with their teams during the race and learn about the weather changes, the condition of the car and tires, and to request an unscheduled change of tires.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":58585,"name":"Fallout 76","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/151/151e79f397328419c64aabe93d9d5a31.jpg","description":"Fallout 76 is a multiplayer-only game set in the universe of Fallout series. It is the first MMO game in the Fallout franchise and ninth installment overall. It is also the earliest game in the Fallout universe inner chronology, thus serving as a prequel to the whole series.\r\n\r\n###Setting\r\nThe game takes place in a post-apocalyptic world, a quarter century after a nuclear holocaust that turned most of the US into a radioactive wasteland. The players assume the roles of the various dwellers of Vault 76, presumably the first Vault-Tec bunker to release its inhabitants. Their goal is to reclaim the world. The vault is located in the Appalachian Mountains in West Virginia. Fallout 76 offers an open world with many locations based on real West Virginia places. Some of the new monsters are also based on the local folklore.\r\n\r\n###Gameplay\r\nUnlike all previous games in its series, Fallout 76 features no human NPCs (although robots and monsters are present). Instead, the game delivers the story through records and environment. Some of Fallout series famous mechanics return in Fallout 76. The character creation is based on a modified version of the S.P.E.C.I.A.L. system of abilities and perks. V.A.T.S. targeting system also appears, albeit this time it works in real-time. The game allows the players to build homes and establish settlements in any part of the map. There are also nuclear missiles that allow the players to annihilate each other's settlements.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":17925,"name":"Fable Anniversary","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/071/0715f91a89d634d9183e2f23c0cb1a98.jpg","description":"Fable Anniversary is a re-release of the 2004 game Fable. The Anniversary version includes higher quality graphics, different interface, and mod support.  \nThe game takes place in the fantasy land of Albion. You play as the nameless protagonist child whose village gets destroyed by bandits. He gets saved by a member of the Hero Guild, an institute that trains and educates heroes. Heroes are elite mercenaries that after graduation are entirely independent of Guild. The protagonist starts his training and guild to find his lost relatives and revenge bandits.  \nThe gameplay represents the open-world action-RPG game. There are several story quests, and many side missions and different kinds of optional activates like fishing, gambling and arena brawling. The combat mechanics are based around using ranged and melee weapons and different skills that can be acquired via gaining experience points. The game is also noticeable for its morality system that depends on the player’s actions and his chooses in story-missions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lionhead Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":516111,"name":"Mass Effect: Legendary Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/64e/64e2a77f37ddc48d102127234af99886.jpg","description":"One person is all that stands between humanity and the greatest threat it’s ever faced. Relive the legend of Commander Shepard in the highly acclaimed Mass Effect trilogy with the Mass Effect™ Legendary Edition. Includes single-player base content and DLC from Mass Effect, Mass Effect 2, and Mass Effect 3, plus promo weapons, armors, and packs - all remastered and optimized for 4k Ultra HD.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"BioWare","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2239,"name":"Furi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/556/556157feed9ee1f55f2b12b2973e30a3.jpg","description":"Furi is a game that consists of boss fights. It is set in a neon-bright futuristic world with some elements of traditional Japanese aesthetics. The game is accompanied by a synthwave soundtrack recorded by several popular electronic artists including Carpenter Brut.\nThe player assumes the role of the Stranger, a white-haired samurai wearing a red cloak. The Stranger was kept as a prisoner on an orbital station until he was released from his cell by an unknown benefactor wearing a bunny suit. The protagonist, now armed with a plasma gun and a katana, has to fight his way to freedom through a series of levels, each of them containing only one enemy, a boss who guards Stranger's prison. Each battle is preceded by a cutscene that further reveals the plot, and each boss requires a unique approach.\nThe game is played in an isometric top-down view. The combat system is very simple, it includes no combos and consists of only four basic movements. The Stranger can slash with his sword, fire his gun, block an incoming attack or dash forward to avoid it. Each action can be made more powerful by holding its button for several seconds, although it slows down your movement.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Game Bakers","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":22513,"name":"Uncharted 2: Among Thieves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74b/74b239f6ef0216a2f66e652d54abb2e6.jpg","description":"In Uncharted 2, as in the other Uncharted games, the hero is the adventurer and hidden treasure seeker Nathan Drake. Riddles are no less important part of the gameplay than fights, chases and travels through exotic landscapes and hard-to-reach places.\nDrake is well prepared for all this. He is provided with ammunition - he picks them up from the corpses of killed enemies, ably uses shelters, can run, climb, jump, kill with one blow and fight in hand-to-hand combat.\nIn Uncharted 2 you can find 101 treasures. Some treasures lie almost in sight, others will have to run. Treasures can be sold, and money can be spent on bonus content. Multiplayer mode allows you to play up to 3 people at a time - this is if players follow the adventure story of the game and solve problems together. There are also battle modes, where up to 10 people can participate simultaneously. There are several combat modes, they differ in their objectives and in some ways.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":137,"name":"Mass Effect: Andromeda","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9b/a9be26838e6d54d8fb008ffc70e0d59a.jpg","description":"The fourth Mass Effect stands apart from the original trilogy. No Shepard, no Normandy, and no characters from the previous games, although the \"high-tech\" visual style and the space opera setting are recognizable. Andromeda is set even further in the future, hundreds of years after Mass Effect 3. The protagonist (who is customizable) is a Pathfinder, a member of an expedition to the Andromeda galaxy. She or he bears the surname Ryder and has a twin - whatever gender you choose, it will be the opposite. Ryders traveled billions of miles from our Milky Way galaxy on the space ark Nexus. The ship is carrying thousands of passengers in suspended animation, and the Pathfinders’goal is to find them a habitable planet to call home. \nAndromeda is heavy on the plot, there are many dialogues and cutscenes that may make you feel like watching a movie. The dialogue options usually define how your character is perceived by the others rather than actual plot forks. The action is played like a third-person shooter, allowing you to aim and take cover. Enemy AI reactions will vary, forcing you to employ flexible tactics. Weapons and gear can be improved through an intricate crafting system that requires you to research an upgrade before it can be assembled.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BioWare","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":13469,"name":"Warhammer 40,000: Dawn of War - Game of the Year Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e6/0e60075818860647a1e6a9f9a8ebfada.jpg","description":"The game takes place in the universe of Warhammer 40,000: Dawn of War, on a planet called Tartarus.\n\nYou play as Gabriel Angelos, the commander of the Space Marines, who comes to the planet to fight the Armada of orcs because they have become a real problem of the star system. Later he learns that the Chaos forces are the leaders of the Orcs. The Sorcerer, Sindri Myr betrays his master, Baal. Then Gabriel was betrayed by his friend, who gave the sorcerer Sindri Myr a mystical artefact - Maledictum, but despite this, Sindri Myr leaves Isador to fight alone, and he dies. Sindri uses the stone to turn into the Daemon Prince with the stone's power.\n\nThe player is given the opportunity to collect resources and spend them on the construction of the base, the development of technology and the creation of military units. However, in this game, much attention is paid to the tactical component.\n\nFights, as a rule, are not large crowds of troops, but small groups of 4-8 people and the number of military equipment is calculated units. There are also personal limitations. For example, the number of Orc races and chaos builders is limited to 4-5 units.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":123,"name":"Titan Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/910/910d547965a5c4928ca19112778a1b4f.jpg","description":"The plot of the game is intimately connected with the mythology of Ancient Greece, Egypt and the East and tells about the campaign of the main hero against a trio of lesser Titans known as Telkines, massive creatures, who took advantage of depriving people of divine guardianship to give the Earth to the power of the Titans.\n\nIn the gameplay, the primary focus is made on destroying numerous monsters and developing character characteristics and skills. The plot is directly divided into three acts, and the game world, respectively, into three broad areas: Ancient Greece, Ancient Egypt and the Ancient East, as well as the final location - Olympus.\n\nOne of the features of the gameplay is the presence of many elements, borrowings and references to lands, characters, weapons and monsters from the ancient mythologies of the Greeks and Egyptians, and the plot bosses are the murderer of Hercules - Nessus, the huge scarab and demonic bull.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":28261,"name":"Serious Sam HD:  The First Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d07/d07a7e2f7be2428c51ad26326c84e21d.jpg","description":"Serious Sam HD: The First Encounter is an HD remaster of 2001 FPS Serious Sam: The First Encounter developed by Croteam.\n\nThe story takes place in a near future where humanity has unraveled an ancient artifact in Egypt which allowed for major technological advancements such as deep space travel. While exploring the space, Sam awakens an alien named Mental that destroys any intelligent life in the universe every 100.000 years. In an effort to save humanity, scientists send Sam back in time in order to kill Mental and prevent any destruction from happening in the first place.\n\nThe game features large-scale linear levels that are free for the player to explore as there are secrets hidden throughout them. Most of the levels follow a similar pattern of multiple arenas where players fight several waves of enemies connected by a pathway between them. The scoring system is also present. Player's score depends on the difficulty they play on and on the type of enemy they kill.\n\nPlayers can get additional information on the enemies, weapons or the surroundings via NETRICSA, an implant inside Sam's skull.\n\nSerious Sam HD: TFE also features multiplayer and co-op with up to 16 people.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Croteam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":2354,"name":"Mirror's Edge Catalyst","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/257/257c497aa4060f4a697ccbf5e99ec230.jpg","description":"Mirror's Edge Catalyst is the second part in the Mirror's Edge series. Like its predecessor, it is based around parkour simulation.\n\n###Plot\nThe game is set in the near future that is depicted as a cyberpunk dystopia. The story takes place in the city of Glass that is ruled by mega-corporations. Faith, the protagonist of the original game, returns in Catalyst. She is a Runner, a person who specializes in illegal delivery. Early in the game, Faith steals a valuable hard drive from a corporation. After reading its data, she learns about the Reflection project that will allow the corporations to control every resident in Glass.\n\n###Gameplay\nThe game combines platforming, parkour, and puzzles in the vein of Portal series. The player controls Faith from the first person view as she runs and leaps across the rooftops of Glass. Puzzle-like level design requires her to use pipes, wires, and ledges to get to her destination. Precision timing is important to perform jumps, slides, and rushes in a seamless flow.\n\nThe combat system in Catalyst changed dramatically. Unlike in the original game, Faith cannot use guns. She can fight in hand-to-hand combat but usually has to avoid enemies.\n\n###Style\nLike its predecessor, Catalyst is notable for its minimalist use of colors. Glass is mostly shining white and dark blue, while the occasional use of other colors signifies something important. The game is accompanied by the cold, atmospheric electronic soundtrack by Solar Fields.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":10049,"name":"Hitman: Codename 47","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f6/3f6a397ec36acfcc18bb6ab3414c7658.jpg","description":"The game that started the Hitman franchise. The protagonist is a talented yet nameless hitman, known only by his code number 47. He has no past, as he is a clone created by a mad scientist. In the beginning, 47 is being held in a mental hospital, before he escapes to become a killer for hire. His job is to eliminate high-ranking mafia bosses for large sums of money while attracting as little attention as possible. His missions may initially seem unrelated, but the plot eventually ties everything together.\n\nHitman has to use precise timing, unconventional tactics, and stealth skills to get to his targets and neutralize their bodyguards. He can attack from behind, use sniper's rifles, machine guns, or even improvised weapons, such as a halter. There are usually many ways to accomplish every murder. An important part of the gameplay is disguise: Hitman can attack people and steal their clothes to blend into any environment. Dead or unconscious bodies of Hitman's victims can be dragged away and hidden to avoid raising an alert. Money earned from previous missions can be used to buy additional killing equipment. Hitman may also lose a part of his reward if he kills civilians on a mission.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"IO Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":4744,"name":"Prince of Persia (2008)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/956/95640d5ea0288c187dbce849a4254a41.jpg","description":"Prince of Persia series is known for its acrobatic platforming gameplay, got a visual rehaul in this installment. It features an open-world ancient Persian city-state, that is fully available for the players.\n\nAt the heart of the game this time is not a fictional plot, but real Persian mythology. According to one of the legends, the god Ariman spewed out dark energy onto the Persian land. And the hero is to liberate it from this. This time, the main character has a trust-worthy sidekick. It is controlled by a AI and the interaction of two characters builds the basic gameplay mechanics.\n\nThe world of the game will have to travel a lot in the empty game world: the whole 24 levels of the game are populated with fewer than 10 NPCs. But hands down: visually they look like an illustration from the ancient Persian book. Acrobatic stunts were reinvented and the movement of the main character now feels more fluid and natural.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3772,"name":"Strider","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12e/12ee2600684863837596c0dbb1923fca.jpg","description":"Strider is a platforming hack and slash game developed by Double Helix Games. The game is a reboot of 1989 title, yet the developers didn't intend the game to be viewed as one.\n\nThe title retells the original game's story. In the dystopian future, the best assassin of an organization called Strider is sent to eliminate the dictatorship of Grandmaster Melo who took over Earth and is now based in Kazakh City.\n\nStrider features fast combat with the element of acrobatics. Similar to the original NES game, it is an intense side-scrolling action title. The players are free to explore Kazakh City in order to obtain new abilities and equipment. There are also several pickups scattered across the level. The pickups were intended to be found and collected rather than being temporary bonuses.\n\nThe game features three modes: Story Mode, Beacon Run, where the players have to reach multiple checkpoints as fast as possible, and Survival where players are put up against waves of enemies. The game features a ranking system and public leaderboards.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":401805,"name":"Genshin Impact","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c38/c38bdb5da139005777176d33c463d70f.jpg","description":"You have arrived in Teyvat — a fantasy world where the seven elements flow and converge.\r\n\r\n\r\nIn the distant past, the Archons granted mortals unique elemental abilities. With the help of such powers, people formed a bountiful homeland out of the wilderness. However, 500 years ago, the collapse of an ancient civilization turned the universe upside down...\r\nThough the calamity the world suffered has ceased, peace has yet to be restored.\r\n\r\n\r\nYou, as the main character, are a traveler drifted from another world who has awoken in this land. You will explore this wondrous world freely, make friends along the way, and look for \"The Seven\" — Archons of the seven elements. Every piece of your adventure will unearth something miraculous, and the lost will eventually be found.\r\n\r\nsource: https://genshin.mihoyo.com/en","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"miHoYo","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":14990,"name":"Viking: Battle for Asgard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1f/a1f93b9b287a0808161a35952635867e.jpg","description":"Hel, the daughter of the God of mischief Loki, rebelled against king Odin and was expelled from Asgard. Filled with anger, she tries to free the ancient wolf-god Fenrir and start Ragnarok - the death of the gods, the Great Asgard and the whole world. With her army of resurrected Viking warriors, Hel marches through unsuspecting Midgard. \n\nOdin's daughters Freya was instructed to stop Hel and defend humanity.  She has selected a young warrior Skarin as a partner. They will undergo an unprecedented battle, be at the forefront of a terrible war, to pass a single battle, be on the threshold of a terrible and bloody war. Risking their lives, they will try to save Asgard.\n\nViking: Battle for Asgard is an open world game, with three Islands in the Midgard world that can be explored by the player. You can search for Viking soldiers on these lands, and they can help in response to further battles. When the player completes missions on each island, he must take part in a massive action, which can be a siege or a fight between various armies consisting of hundreds of soldiers.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Creative Assembly","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":9465,"name":"Grim Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/920/92039cd19460532b76f6244b2bb3e4ac.jpg","description":"Grim Dawn is an Action RPG developed by Crate Entertainment.\n\nThe game is set in a gritty fictional world, which resembles the Victorian era. In a war-torn world of Cairn, humanity is close to extinction. Cairn became a battleground for two extra-terrestrial forces - the Aetherials and Chthonians. Both of which are eager to completely wipe out humanity for different reasons. The game tells us a story of several humans that try to adapt and survive the harsh times.\n\nLike in most Action RPGs, the main focus of the game is put on battling the enemies and gathering loot - armor, potions, weapons, and gold. Grim Dawn features a crafting system that is similar to the one in a popular mod DoTA. The developers put a strong emphasis on the enhanced physics in the game, environmental kills, enemies dismemberment and a totally new mission system. \n\nThe players are free to choose one of eight classes present in the game. Several factions are also featured. As the plot progresses, the player will have to choose which factions to join. Joining one faction will make the opposing one hostile to the protagonist.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crate Entertainment","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19458,"name":"DOOM 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3b0/3b01313965c19adc6b6c37a3d9d33576.jpg","description":"DOOM 3 is a first-person shooter, the third installment in the series, serving as a reboot to the previous games. \n\n###Plot\nAs the game is set in a science fiction universe, the events span accordingly. The year is 2145, and the technological progress has allowed humanity to set up different facilities on Mars. After an experiment goes wrong, the research center becomes inhabited by demons. The player controls a nameless space marine, fighting off hordes of enemies through a variety of levels. \n\n###Gameplay\nThe playable character employs a large arsenal of weaponry for his cause, from common firearms to the series’s trademark BFG9000. Each level of the game is linear, as the player must often either retrieve information, some device or reach the checkpoint. However, there are numerous obstacles on the way to the objective: the protagonist has to fight off not only demons and their servants, but also combat the natural enemy in the form of darkness. \n\n###Graphics and music\nThe engine of the game incorporates lighting and shadowing, making every object in the game feel real and natural. The textures are designed to be unappealing, as a psychological tool to ensure the player’s urge to get rid of the enemies and escape the dark and ruined corridors, but at the same time, the level of detail in each location and each enemy is very high.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"id Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox"}]},{"id":4923,"name":"Prototype","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b74/b74b15a48ac7bc37fbb42ee4afcc0b91.jpg","description":"New York, Manhattan Peninsula (very detailed), our days. The townspeople are struck by a mutation that turns people into bloodthirsty monsters.\n\nThe protagonist of the game is a seemingly unremarkable young man named Alex Mercer. At the beginning of the game, we know little about him, but it's still more than he knows about himself - Alex does not remember anything, does not even know that he has super abilities.\n\nAbilities are very useful to him, because he will have to stop the epidemic and at the same time hide from the army, police and mercenaries.\n\n###Plot\nAlex comes to the senses in Ghentec's morgue, located in its Manhattan headquarters. Apparently, the reason for his awakening was the noise produced by mercenaries of the organization Blackwatch, trying to break open the doors of this headquarters.\n\nAlex tries to hide, run away. The mercenaries try to stop him, but Alex discovers in himself one by one amazing abilities - he is not harmed by bullets, he can jump high, throw heavy objects, run on the walls of buildings. And he can \"absorb\" people, taking their appearance and gaining knowledge about everything that the absorbed people know and remember. For example, after the takeover of one of the commanders of Blackwatch, Alex finds out that he has a sister.\n\nAlex finds his sister and learns from her (this time without absorption) that he was an important employee of the company, at the headquarters of which we met him at the beginning of the game. Alex's job duties included working with biological weapons.\n\nDuring the game, the army and the police consider Alex guilty of creating and spreading the virus, Blackwatch pursues Alex for other reasons, and Alex himself tries to stop the mutants and other opponents with all the power of their super abilities. Soon it turns out that among these superpowers there is the ability to turn his body into almost anything, including weapons, shield and armor.\n\n###Gameplay\n\nAll of Manhattan from the very beginning of the game is open for the game. Outside of Manhattan, however, you can not get out. The player can follow the story, and can perform separate missions. Due to the presence of super abilities, the hero can move both horizontally and on walls. But not as an insect, but just running. Falling from the height does not hurt Alex, so he can use this trick to defeat opponents - literally falling on their heads.\n  \nAlex can jump very high, and manage to plan in the air.\n\nAlex fights, using the ability of his body to transform. His hands can turn into sledgehammers, blades, whips or shields. He can instantly increase the volume of his body's muscles to increase their strength - in normal mode, such a mass would have prevented him, so he does not wear all these muscles all the time. His skin can be turned into armor. He can also see in the dark and distinguish mutants from normal people by eyes.\n\nAll abilities can also be improved as you progress in the game and perform various tasks.\n\nIn addition to the super powers of the body, the hero uses assault rifles, machine guns, grenade launchers, rocket launchers, captures infantry combat vehicles, tanks, helicopters and uses their weapons.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Activision","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]}]