[{"id":40648,"name":"Back to the Future: The Game - Episode 5. OUTATIME","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38f/38f02dc0f7f2632d81d47e8e1edcdad4.jpeg","description":"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Telltale Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":16792,"name":"Worms Reloaded","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e4/3e411c02b4cd1fa35f77728268a36ff9.jpg","description":"Worms Reloaded is a two-dimension game developed by Team17. It is a remaster of Worms 2: Armageddon.\n\nThe gameplay is not much different from the other installments in the series. The game revolves around two opposite teams of worms that use everything in their power to eliminate each other.\n\nAt the beginning of the round, the worms spawn across the map. Each worm has a specific amount of health points. If a worm is attacked by an enemy, injures itself or falls down from high altitude, the health points are taken away. Health can be regenerated using medkits which are dropped down from the sky every several turns. Weapons and bonuses can also be picked up. \n\nThe game is turn-based. During a turn, the player can move around the map, attack the enemy and so on. Each turn has a time limit. The player wins when the opposing team is killed and at least one friendly worm survives.\n\nThe game features several game modes each with their own rules and differences. The players have the ability to create custom games. It is possible to make a completely new set of rules, pick a new map and other parameters in a custom game mode.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Team17 Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2570,"name":"The Cave","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3d/b3d76daf8412a4902f288926699cb7f6.jpg","description":"The Cave is a puzzle-platform/adventure video game developed be only one person – Ron Gilbert who previously worked in LucasArts. He had an idea for 20 years to create a game about cave that lures people in it to explore darkest sides of their personalities. The Cave uses similar concepts from other game made by the same creator – Maniac Mansion. There is a cast of seven different characters and the player should choose three of them to explore the cave. Most of the game’s puzzle require a cooperation of three characters in order to overcome tasks. Each character has its special abilities and some puzzles require specific abilities to overcome them. The game is designed to be replayed several times in order to know all the things, character combinations in puzzles and secrets. \nThe Cave tells a story about a talking cave which has labyrinthine set of tunnels within it. Seven different characters decide to go into the cave to learn something about themselves and who they might become.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SEGA","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":326239,"name":"Lego Star Wars: The Skywalker Saga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/292/2926f9fb089ab91a0dac754193b325e5.jpg","description":"The galaxy is yours with LEGO® Star Wars™: The Skywalker Saga! Play through all nine Star Wars™ saga films in a brand-new LEGO video game unlike any other. Experience fun-filled adventures, whimsical humor, and the freedom to fully immerse yourself in the Star Wars universe like never before.\n\nFor the first time ever in a LEGO video game, explore the galaxy your way as you fly to some of the saga's most legendary locales. You can start your journey with Star Wars™: The Phantom Menace for some podracing on Tatooine. Or choose to launch right into Rey's adventures in Star Wars™: The Rise of Skywalker. Players have the freedom to seamlessly travel to any planet, in any order, at any time.\n\nJourney to a galaxy far, far away with LEGO Star Wars: The Skywalker Saga.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"TT Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":3316,"name":"Ultra Street Fighter IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f49/f49248982c6e9d6e849d16b9f5d93ae4.jpg","description":"Ultra Street Fighter IV is a multiplatform fighting game developed by Capcom. It is an arcade version of the vanilla Street Fighter IV with minor changes.\n\n###Setting\nUltra Street Fighter IV takes place several months after the events of Street Fighter II and is a prequel to Street Fighter III. After the return of Bison, who was presumed to be killed in the last tournament, a weapon corporation named S.I.N announces a new event to gather all the world's mightiest fighters for the creation of a powerful weapon of mass destruction. \n\n###Gameplay\nAll in all, SF IV is a two-dimensional fighting game with post-processed cell-shaded graphics, resembling the art style of Japanese comics.\n\nThe game features the classic six-button control scheme with several additions that were made to refresh the gameplay. The combat system inherits the principles, that were introduced in SF III, such as the enhanced special attacks. Special button combos were added to implement fast movement inside an arena. \n\nThere are two energy bars in the game, one of which is used for Super Combos, special attacks called EX Special Moves, and Focus Cancels. The other one is called the Revenge Gauge and is used for executing ultra-combos.\n\n###Ultra Edition features\nThe Ultra Street Fighter was initially released on Japanese arcade machines but was later made available to the general public. Apart from the standard balancing changes and updated combat system, it features new characters and arenas.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":59346,"name":"Desperados III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/71d/71d5c7bed835c723486f7f6e78fca9fd.jpg","description":"Desperados III is a modern real-time tactics game set in a ruthless Wild West scenario.\r\nYou take control of a ragtag band becoming a highly functional group of unlikely heroes and heroines. The very different strong personalities struggle to cooperate at first, but ultimately join forces to combine their distinctive specialties and challenge a seemingly superior foe. Hunted by ruthless bandits and corrupt lawmen, the Desperados III need to turn the tables with every mission.\r\nOn an epic journey through 1870s USA and Mexico, the team will face incredibly difficult odds and must outsmart vastly outnumbering gangs. On their mission to track down a nemesis whilst derailing a relentless corporate tycoon, the five distinctive characters use a wide array of skills to infiltrate, spy, sabotage, elude, steal, abduct, deviate, assassinate, blow stuff up… and as a last resort: shoot 'em down.\r\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real time to sneak past your enemies while remaining undetected.\r\nCommand up to five Desperados and use their lethal skills to stealthily thin out the enemy rows\r\nApproach each mission with a big variety of different solutions and paths\r\nResolve seemingly impossible large enemy setups with careful planning and perfectly timed execution of the team’s special skills\r\nWitness the glory of classic Wild West scenarios like frontier towns, desert canyons, Mississippi swamps, sprawling modern cities and many more by day and night.\r\nDefeat your foes choosing between deadly and non-lethal options, stealth and blazing guns and further adjust the game to your playstyle with various difficulty settings and special replayability challenges","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mimimi Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42920,"name":"Resident Evil HD Remaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3cf/3cf4e76bfd5283331c83958c830a761c.jpg","description":"The game that defined the survival-horror genre is back! Check out the remastered HD version of Resident Evil.<br/><br/>In 1998 a special forces team is sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arriving they are attacked by a pack of blood-thirsty dogs and are forced to take cover in a nearby mansion. But the scent of death hangs heavy in the air. Supplies are scarce as they struggle to stay alive.<br/><br/>Graphics<br/><ul><li>More detailed graphics that retain the horror.<br/></li><li>The environments come alive with detail thanks to resolution upgrades and non-static 3D models.<br/></li><li>Post-processing effects like Bloom filters, which were not easy to do at the time of the original release, have been added to make the HD graphics even more realistic.<br/></li><li>High-Resolution Environments - We've increased the resolution of the background environments by recreating them with a mix of high-res static images, plus animated 3D models.</li></ul><br/>Widescreen Support<br/><ul><li>Widescreen (16:9) is supported, so players can experience a greater sense of immersion.<br/></li><li>In widescreen mode, the screen will scroll. The parts of the screen that get cut off on the top and bottom will scroll into view automatically depending on the character's position.<br/></li><li>You can switch the display mode during gameplay in real time.</li></ul><br/>Sound &amp; New Controls<br/><ul><li>High-Quality Sound - The audio has been remastered to increase the sampling rate, and of course 5.1ch output is also now supported.<br/></li><li>New Controls<br/></li><li>You can play using the original control scheme or an alternate control scheme that lets you just push the analog stick to move in the direction you want to go.<br/></li><li>You can switch the control scheme during gameplay in real time.</li></ul>","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":801032,"name":"High on Life","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e7/2e732a02c29c84ca177855848932a5aa.jpg","description":"From the mind of Justin Roiland (Rick and Morty, Solar Opposites) comes High On Life. Humanity is being threatened by an alien cartel who wants to use them as drugs. It’s up to you to rescue and partner with charismatic, talking guns, take down Garmantuous and his gang, and save the world!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Squanch Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":42230,"name":"Titanfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/979/979155841412068e7adf8c83dee94a4a.jpg","description":"Titanfall is a sci-fi multiplayer FPS developed by Respawn Entertainment.\n\nSet in the distant future, where the deep-space travel is finally available to the humankind, colonies are established on distant planets. Interstellar Manufacturing Corporation began exploiting the colonists, mining the resources on the so-called Frontier planets. Many of the colonists join the resistance to fight back.\n\nThe game features both infantry and mech combat. The mechs known as Titans are common in Titanfall's world. You play as a pilot. Pilots are elite spec-ops soldiers that use the battlefield as their playground. The loadout system is present in the game. The players are free to use whatever weapon they like and choose from a variety of different camouflages. Pilots are equipped with jetpacks that allow for wall running. Pilots also possess special hacking knives that are helpful in hacking the enemies robots. \n\nTitans are available for the players after they are built on the deployment ship which requires some time. This time can be shortened by killing enemy infantry. The Titans are dropped from the orbit, hence why the game is called Titanfall.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":533,"name":"Magic Duels","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41d/41da6c1f2d6ff1ea443e0c3ff6e64ddb.jpeg","description":"Magic Duels is a video game based on collectible card game Magic: The Gathering. It follows Magic: The Gathering – Duels of the Planeswalkers and its sequels. Unlike the predecessors, Magic Duels has a story mode that focuses on five original Planeswalkers. In general, the game features over 1300 earnable cards.\n\nThe gameplay repeats the one from the card game but is simplified. You participate in duels either with real players or AI opponents. Each player has a deck of cards consisting of lands and spells. To cast spells you need mana that lands produce. The duel stops when one player’s life is over. In the story mode you need to hold matches against an AI opponent using decks of five Planeswalkers.\n\nBesides the story, there are several single-player missions and online duels. For example, you can test your strategy during the Two-headed Giant mode when four players split into teams competing with each other.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Stainless Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":13833,"name":"Stronghold Crusader HD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/125/1258337895195f87eb5465eb9d5d5596.jpg","description":"The game is an addition to the game-strategy Stronghold.\n\n###The main thing about the series of games Stronghold\n\nThe game Stronghold - a simulator of three activities:\nthe construction of a medieval castle,\nmilitary actions - assault of the castle or its defense,\ncreation and management of the village.\n\n###The atmosphere and situation of the first game\n\nBriefly, this is the stylization of the Middle Ages. Game events begin in 1066, but there are often no time limits, so theoretically, missions can last dozens and even hundreds of game years.\n\n###The path of war and the path of peace\n\nThe game allows you to build - a settlement or a castle, carry out individual economic missions or just build freely, and destroy - invade the country, take the castle under siege or, on the contrary, crush the attackers. You can create your own maps and play in multiplay mode.\n\n###Gameplay\n\nYou are the ruler of the castle, you are responsible for both the economy and the war. Do not forget about the popularity - it's a separate indicator in the game.\n\nYou can build six types of buildings:\nthe castle and everything inside it - walls, towers, gates, barracks, ditches, etc.,\nsawmills, quarries, mines and other structures for extraction of resources - wood, stone, iron and oil.\nFarms that bring meat, milk, wheat, apples, hops, skins of cows,\ncity ​​buildings - houses, churches, wells,\nWeapon workshops, where they produce weapons and armor,\nBarns and shops for cheese, bread, ale\n\nBuildings are built instantly, it is only necessary to make such a decision. Just as quickly your soldiers are trained. But all this requires money obtained from the collection of taxes and trade.\n\nTo succeed in the economy it is not enough just to make calculations. We have to cope with unpredictable disasters like the invasion of rabbits or fire.\n\nThe war is fought by soldiers of close combat and distant combat: archers, crossbowmen, pikemen, swordsmen, spearmen, knights and even monks with clubs.\n\nTroops can shoot from towers, move around walls, destroy walls, use siege machines, including towers, while besieged have boiling resin tanks, pits with stakes and moats with water. You can dig trenches and even organize an epidemic in the enemy camp. For complex actions, except soldiers, you need to involve sappers and engineers.\n\n###Addition Stronghold Crusader HD\n\nExpands the set of game situations with the stories of the Crusades:\nThe first crusade of 1094-1099,\nSaladin's campaigns of 1187,\nthe expedition of Richard the Lionheart, Friedrich Barbarossa and the French Philip II in order to liberate Jerusalem\n\nThe way of the crusader is a campaign of 50 cards not tied to historical events, but in the same setting.\n\nOne of the unique innovations are the assassins - the warriors of special abilities, able to invisibly enter the castle and open the gate from the inside, interrupting the guard.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"FireFly Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":58914,"name":"Bloons TD 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/058/058195b9ed4c077838a3981eef800069.jpg","description":"The Bloons are back and better than ever! Get ready for a massive 3D tower defense game designed to give you hours and hours of the best strategy gaming available.\nCraft your perfect defense from a combination of awesome monkey towers, upgrades, Heroes, and activated abilities, then pop every last Bloon that comes your way!\nALL NEW 3D BLOONS TD\n* Vibrant new monkey animations and upgrade skins\n* Intense visual effects\n* 30 original maps, some with 3D objects that can block line of sight\nEPIC MONKEY TOWER UPGRADES\n* 20 powerful monkey towers, including 2 all new monkeys - Druid and Alchemist!\n* 3 upgrade paths - all monkey towers now have 3 amazing paths to choose between\n* Tier 5 upgrades - top upgrades so powerful only one monkey can have them\nHEROES!\n* Each game, place one of these unique and powerful monkeys with 20 signature upgrades\n* Two bloon-shredding activated abilities per Hero\n* Craft new gameplay strategies around each Hero's powers and synergies\nDEEP MONKEY KNOWLEDGE SYSTEM\n* Over 100 meta-upgrades that buff individual monkey towers or monkey groups\n* Adds late game power so you can win more maps and reach higher freeplay rounds\nMORE AWESOMENESS\n* Play anywhere - single player offline works even when your wifi doesn't!\n* New Bloons - tricky new bloon types like Purple, Fortified, and the relentless B.A.D.\n* New game modes added to each game difficulty, like Restricted Monkeys, Double Health MOABs, and the brutal CHIMPS rules\nAnd there's heaps more! We packed as much content and polish into this game as possible, and we'll continue to add new features, content, and challenges in regular updates. We truly respect your time and support, and we hope Bloons TD 6 will be the best strategy game you've ever played.\nNow those bloons aren't going to pop themselves... sharpen your darts and go play Bloons TD 6!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":15457,"name":"Cities in Motion 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ce6/ce6c9b58be2ca76688a768cffcb043d1.jpg","description":"Continuation of the game Cities in Motion.\nThe essence of the game is the construction of profitable transport networks in large cities. The player is the director of the company that manages all the transport of the city.\nThere are five types of transport: a bus, a tram, a metro, a river tram and a trolleybus (in the first game there was a helicopter instead of a trolleybus).\nYou can manage:\n- creating routes,\n- selection of models of vehicles,\n- salaries of drivers and other employees,\n- expenses for the maintenance of transport,\n- fare for different areas and categories of the population,\nThe reputation of the company also matters, it affects the preferences of passengers and, accordingly, on revenue and profits.\nThe route of each type of transport is constructed under certain conditions: for the tram rails are needed, for the metro you need a tunnel, a different number of stops for different areas. Residents are also divided into six classes, differing in income, needs and transport preferences.\nThe second game differs from the first by the absence of a helicopter as a mode of transport, the ability to build roads, the change of day and night, the introduction of depots instead of simple ring lines, and also the presence of a multi-player mode.\nThe player is provided with a data collection system that informs about people's places of residence and work, the functions of buildings, the number of stowaways and so on.\nThe \"sandbox\" mode allows you to operate with unlimited resources and the ability to arbitrarily change any parameter, cancel all restrictions. Campaign class modes have specific tasks, even a few, and only the execution of tasks opens the next campaign. Each campaign corresponds to a separate city, there are only six of them.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Colossal Order","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3993,"name":"FINAL FANTASY XIII-2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c6f/c6fc62de480c614fed2b88df0155cdcd.jpg","description":"Final Fantasy XIII-2 is a Japanese role-playing game, a direct sequel to 2009 title Final Fantasy XIII and the third installment in Fabula Nova Crystallis subseries. \n\n###Plot \nThe game takes place three years after the event of the original game. Final Fantasy XIII’s main character Lightning, appears only as a supporting character, while the story follows her sister, Serah Farron, and a new character Noel Kreiss. \n\n###Gameplay \nThe gameplay is almost identical to that of the original game. The battle system is presented as Command Synergy Battle. It is based on usage of Action Time Battle bar: the bar consists of several slots that are used to perform attacks or cast spells and gradually refills during the battle. \nHowever, the game has some significant differences compared to the original game. The areas are more opened and endorse exploration. The party consists only of two characters, while the third spot is reserved for tamed monsters. The game also uses a random encounter system from previous installments.\n\n###Plot \nThe storyline follows the events of the XIII. They, however, do not connect to the other Final Fantasies so any chapter of the series may be played in unspecified order. The protagonists of the game are six youngsters who are trying to prevent the end of the world.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":14346,"name":"SimCity 4 Deluxe Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/238/23827608952b34ed8f69c6bc3e4f6678.jpg","description":"SimCity 4: Deluxe Edition is a city building simulator developed by Maxis.\n\n###Deluxe Edition features\nDeluxe Edition features the base game and Rush Hour expansion pack.\n\n###Gameplay\nThe player becomes the mayor of a small town. Use terraforming to create a convenient building area or a unique landscape. Players are able to divide the town's areas into special areas: commercial, industrial, and residential. You also have to create a social policy, a transportation system and improve the quality of life for your residents. \n\nThe players are able to choose any area available for building a new city. It is possible to create several cities near each other. \n\n###Game modes\nThere are three game modes present in the game: God Mode, Mayor Mode, and Sim Mode.\n\nIn God Mode, the players build a new city and are able to inflict natural disasters upon it such as earthquakes or volcano eruptions. It is possible to choose the exact spot where the disaster will take place. \n\nMayor mode is endless. You take part in creating a city, maintaining it, and facing the typical city problems, such as the migration of its population or the drop in income per household. The game emulates the world's economy, financing, and city development.\n\nWhile in Sim Mode, the player creates a sim, which will live in a player-built city. You can't control the sim apart from choosing where will they live. The sims go through their whole life. After death, their relatives will take their place.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Aspyr Media","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16262,"name":"Commandos 3: Destination Berlin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8f/c8fb3e68985bac9456ebb8a66d2dc5a5.jpg","description":"The game is a continuation of the three previous games from the Commandos series.\nAs in other games of this series, the action takes place during WW2, and the player commands a detachment of saboteurs operating in the enemy's rear rear. All missions in the game are divided into three campaigns. Each campaign takes place in one of three locations: Stalingrad, Central Europe, Normandy.\nEach mission traditionally includes several tasks. The nature of the tasks is about the same as in the other games of the series: the destruction of objects, equipment, snipers, spies and commanders of the enemy, the protection of our soldiers and officers.\nThe game has a lot of new weapons and equipment. All this exactly corresponds to the real models of armaments of that time. As a result, the set of weapons and equipment in the game has become significantly more diverse and includes even mortars, motorcycles, jeeps. Another notable innovation: the review system now allows you to rotate the camera in all directions and scale the landscape.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Pyro Studios","platforms":[{"id":0,"name":"PC"}]},{"id":6641,"name":"Braveland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8a/c8a2d3c82dc11dcec380103d92580af2.jpeg","description":"Braveland is a turn-based game inspired by old-school strategies with hexagonal battlefield. You will start as a humble warrior's son whose village was cruelly raided and will end as talented commander of your army.\nThe story will take place in a hand-drawn world and cover many interesting places and characters. Various warriors will join your army - archers, scouts, healers, footmen, arbalesters and more.\nTurn-based battles in old-school style.\nCommand your troops and defeat enemies in hand to hand battles.\n26 various warriors and creatures from archers to golems.\nThree story chapters each in unique corner of the world.\nEvolve your hero, find awesome artifacts and learn battle magic.\nIntense boss fights at the end of each story chapter.\nHours of gameplay with 50 battles.\nHigh definition awesome illustrated cartoon art.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tortuga Team","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":662357,"name":"Vampire: The Masquerade - Bloodhunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba9/ba981ea851b2a85b78d63d9ec53c19e5.jpg","description":"A treacherous betrayal has stirred a war amongst vampires, who are also targeted for annihilation by the secret society known as the Entity. Use your supernatural powers, weapons, and wit in this third-person battle royale game to dominate the night and restore the masquerade.\r\nJOIN THE BLOODHUNT\r\nFeed on potent blood to grow in power then hunt using your supernatural abilities and senses. With Prague in lockdown, defy gravity and strike from anywhere in your quest to dominate the night.\r\nSHOW OFF YOUR VAMPIRE FANTASY\r\nChoose your Clan allegiance to define your playstyle and let your personality shine through as you create your most unique looks for rivals to remember.\r\nRESTORE THE MASQUERADE\r\nForm unholy alliances or fight alone away from human eyesight. As the hunters become the hunted, fight to the last drop to become the ultimate vampire and restore order.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sharkmob","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":428555,"name":"XCOM: Chimera Squad","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/172/172dd929a1f2fcca13c3da3d83605f06.jpeg","description":"XCOM: Chimera Squad delivers an all-new story and turn-based tactical combat experience in the XCOM universe.\n\nAfter years of alien rule, humanity won the war for Earth. But when the Overlords fled the planet, they left their former soldiers behind. Now, five years after the events of XCOM 2, humans and aliens are working together to forge a civilization of cooperation and coexistence.\n\nWelcome to City 31, a model of peace in a post-invasion world. However, not all of Earth's inhabitants support interspecies alliance. Chimera Squad, an elite force of human and alien agents, must work together to destroy the underground threats driving the city toward chaos.\n\nYour agents are unique: each of them equipped with special tactical abilities and driven by a different motivation for joining Chimera Squad. Deploy targeted team members to investigate and combat the dangers that pervade the districts of City 31. Lead Chimera Squad through a new experience that innovates on XCOM's turn-based legacy, utilizing strategy, teamwork, and new breach-and-clear gameplay to complete your mission objectives.\n\nThe future of City 31 depends on you.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Firaxis","platforms":[{"id":0,"name":"PC"}]},{"id":1984,"name":"Unepic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b49/b49f17ce8a4ec0ca0663103be8634421.jpg","description":"Unepic is a 2D platformer game with role-playing elements. The story follows Daniel, a sci-fi, and video games geek that one day was teleported into a fantasy world and found himself in a giant castle. The game’s dialogues, storyline, and aesthetics heavily relies on humor with a lot of geek-culture references and mocking on sci-fi and fantasy clichés.  \nThe gameplay can be described as a mix of 2D Metroidvania and role-playing game. The RPG elements in the game include acquiring levels, skills-points, and equipment. There are many types of armor and weapons in the that require the absolute level and skills to be used. The fighting mechanics are pretty simple and don’t have a lot of moves and abilities. Unlike many other metroidvanias, in Unepic you open new parts of the game world not by acquiring new abilities that let you go to the places you couldn’t reach before, but rather by collecting keys that unlock doors in different parts of the castle.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"@unepic_fran","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16253,"name":"Memoria","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc5/bc50266c05f2cc473bf98c4033c2f285.jpg","description":"Also known as The Dark Eye: Memoria, it's a point-and-click adventure game from a German developer and publisher of Daedalic Entertainment. The game is part of the series, based on the game The Dark Eye in 1984 and a direct continuation of the plot of Chains of Satinav.\n\nThe history of Memoria begins immediately after the end of the events of the previous game and tells the story of Geron's quest to find a way to help his fairy Nuri. The plot develops linearly. The developers use story-in-story method to tell two parallel telling two stories of two heroes. The camera in the game is in such a position that the player feels like an observer of the game world. To direct characters to a certain point on a screen it is necessary to click there. Clicking is also helping with interacting with objects, the characters comment on their possible use of items, and this is somewhat simplifying the task of the player.\n\nThe game tries to connect the classic point-and-click gameplay with the mysterious setting and features of The Dark Eye RPG universe.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14827,"name":"Just Cause 2: Multiplayer Mod","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fd/0fd83a4e2b6824d3edaf6c2be2e168e6.jpg","description":"In the original Just Cause 2 there was no multiplayer. This did not suit the two fans of the game Jaxm and Trix, who were engaged in mods for it. By joining forces, they developed their version of multiplayer. Later they were joined by other modders. The project was so successful that after the release it was recognized by game developers officially as the add-on and was officially added to all sold copies of Just Cause 2 on Steam as a free add-on. Mod also supports the achievements and the possibility of simultaneously playing several hundred players on one map at once. Pirated copies of the game are not supported.\n\nAs in the original game, the action takes place on the tropical island of Panau. In multiplayer, players arrange the chaos using the elaborated game physics and grappling hook. The capabilities of the players and variety of the game modes differ from server to server: for example, on some you can unite in groupings, buy real estate and make raids on enemy gangs. Also available races, Derby, Tron game and other game modes.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Avalanche Studios","platforms":[{"id":0,"name":"PC"}]},{"id":3219,"name":"ZOMBI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee9/ee96c492e11864f9a64ce2b19b53d85b.jpg","description":"The game takes place in London after the zombie apocalypse. London, according to the creators of the game, was chosen as a setting, because it combines new and old styles of architecture with a rich history. In addition to the architectural heritage, London gave the game a start to the plot, a real historical personality - John Dee, who in the game is called the author of the Black Prophecy, which is associated with the invasion of zombies.\nThe game has a place not only for battles for the immediate survival, but also for performing tasks to find the vaccine against infection - the player has to look for different places, people and information. The game encourages exploration, all the time opens up new spaces.\nThe player can find firearms, Molotov cocktails in bottles and even an indestructible baseball bat. Zombies are of several types: exploding, armored, spitting with acid.\nAmmunition, drugs and other useful things the player finds on the ground. If a player is bitten by a zombie, the player irreversibly turns into a zombie - but everything that he managed to find and collect before, remains the property of this zombie. And in the next game you can find this zombie and take back your possessions. In a multiplayer game, other players can do it.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":326248,"name":"Ghostwire: Tokyo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e85/e851f527ab0658519436342ee73da191.jpg","description":"After strange disappearances hit Tokyo’s population, it’s up to you to uncover the source and purge the city of a strange, new evil. Armed with your own mysterious spectral abilities, you will face down the occult, unravel conspiracy theories and experience urban legends like never before.\n\nDon’t fear the unknown. Attack it.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Tango Gameworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":494384,"name":"God of War: Ragnarök","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c3/1c305096502c475c00276c827f0fd697.jpg","description":"Kratos and Atreus must journey to each of the Nine Realms in search of answers as they prepare for the prophesied battle that will end the world. Together, Kratos and Atreus venture deep into the Nine Realms in search of answers as Asgardian forces prepare for war.\r\n \r\nAlong the way they will explore stunning, mythical landscapes, gather allies from across the realms, and face fearsome enemies in the form of Norse gods and monsters. As the threat of Ragnarök grows ever closer, Kratos and Atreus find themselves choosing between the safety of their family and the safety of the realms...","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"SCE Santa Monica Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":15687,"name":"Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76a/76a4511b693e10e282463b5904a2f450.jpg","description":"Dr. Langeskov is a single-player first-person exploration game. It’s a short story, and a linear experience, that attempts to show, what it might be like, to not be a center of a story driven game. Players are led to believe, that they are to embark on a great heist in a mansion with tigers and emeralds involved, but there’s a catch. They WILL play the actual game, but at the moment there’s another player going through the heist, and narrator, voiced by the comedian Simon Amstell, asks the actual player has to wait for their turn. Or help the narrator with some minor tasks, because the entire staff seems to be on strike.\nMassively story driven, Dr. Langescov allows really minor interactions, but it’s to be expected from the small complimentary game by the designer of Stanley Parable. Players will be shown the backstage and preparations, that are made in order for people to experience the heist and all inner workings of seemingly interactive experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Crows Crows Crows","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15017,"name":"Duck Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f20/f20b14c39b5387488236ff2d1d40f863.jpg","description":"Enter the futuristic year of 1984, an age where ducks run wild in a frantic battle for glory. Win over the crowd and gain a following by blasting your feathered friends with Shotguns, Net Guns, Mind Control Rays, Saxophones, Magnet Guns, and pretty much anything else a duck could use as a weapon. One hit and you're roasted. This is DUCK GAME. Don't blink.\n2 to 4 PLAYERS in either Local Multiplayer Couch Combat, or NEW Online Play!\nSingle Player challenge mode\nEasy to pick up, emphasizing strategy over twitch reaction\n50+ Levels, 50+ Weapons\nLevel Editor","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Adult Swim","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5615,"name":"Need For Speed Undercover","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ad/4ad6ab9cfe8146224330598a4a62fb14.jpg","description":"Need For Speed Undercover is a racing game and the twelfth installment in the twenty-four-title long series of the same name.\n\n###Gameplay \nAlmost every Need For Speed game features the same gameplay features, and Undercover is no different. There is an open world which is permitted to discover at any time in contrary with, for instance, Most Wanted, where the environment was zoned, and the locations opened as the story progressed.\nThe car collisions system has become more realistic compared to the previous parts of the game, but damage remained cosmetic only with no impact on performance. However, the car may be destroyed in Highway Battle — one of the game mods. \nThe title features some RPG elements — wheelman points, which grants the player access to bonus levels and car parts. \nThe police in the game are traced by the bar at the top of the screen varying between Busted and Evade modes. The capturing of the player results in the checkpoint restart.\n\n###Plot \nThe game's title suggests the protagonist role in the story — he is an undercover police agent given a task to infiltrate the group of street-racers to expose them to arrest. The background behind the races is taking down the criminal gangs and cliques. During the narrative player is faced with some dilemmas demanding a hard choice of him on which side to take.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"}]},{"id":3727,"name":"FINAL FANTASY XIV: A Realm Reborn","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/515/515e8cda2f9e3ea1ca2785e99c1a1893.jpg","description":"FINAL FANTASY XIV: A Realm Reborn is a massively multiplayer RPG developed by Square Enix. It is the direct continuation of FINAL FANTASY XIV.\n\nFFXIV: A Realm Reborn is a heavily updated version of the original FINAL FANTASY XIV with a different graphics engine, netcode, and storyline. The game was made because the game sold poorly and wasn't met with critical acclaim.\n\n###Plot\nThe game takes place in  Eorzea five years after the events of the original game. FINAL FANTASY XIV ended on an apocalyptic note - a dragon god destroyed most of the Eorzea. Thanks to the blessing of the Gods, the player-created characters were able to escape certain death and were sent five years to the future. In a rebuilt world they face the danger of invasion by the Empire of the north.\n\n###Gameplay\nIn FFXIV, the players interact with each other in a world that continues to live on even without any players on the server. At the beginning of the game, the players are met by a character creation screen where they choose the name, race, gender, build, appearance and the base class. It is also necessary to choose a game world for your character. \n\nPlayers level up their characters by gaining EXP. EXP is gained by raiding dungeons, taking part in server-wide events, killing monsters, and completing quests.\n\nThe game's combat system revolves around using a combination of character-specific weapon skills, the use of magic, and the physical attacks themselves.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":21119,"name":"One Finger Death Punch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91f/91f28302cc8a4fa13a7b59cf1b6f0a84.jpg","description":"This is a game in which the player has to withstand the waves of enemies on the right and left, using only the right and left mouse buttons. When pressed, the protagonist performs punches in the kung-fu style. The game has three levels of difficulty: Student, Master, and Grandmaster. The choice depends on how many enemies will attack the player, the duration of each round and the number of hit points in the main character has.\n\nThe story campaign consists of different levels, on which the player can use different types of weapons, which seriously change the gameplay. For example, when using Light Sword and Nunchaku, the enemies have only one hit point, but the duration of the round and the speed of their movement are increased. The game also features boss battles. This is a battle with a stronger monster, to win a player needs to execute a special key combination. The abilities of the main character can be improved with the help of upgrades, and there are a total of 21 of them. There are more than 250 stages and 13 game modes in the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Silver Dollar Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":28859,"name":"Warface","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/788/788959118998613640c18b13b498a6d2.jpg","description":"This is a free-to-play online first-person shooter, from Crytek and publisher My.com, a subsidiary of Russian Mail.ru Group, focused on the western market. The game was created by three teams: Crytek Kiev, Crytek Seoul, and Crytek UK. The game uses the power of Crytek’s own engine - CryEngine 3. Initially, the game was aimed at the Asian market but was also released in the west.\n\nThe game features more than two hundred weapons: from the vintage Mosin rifle to modern models like the Bushmaster BA50. There are no licenses for thorough weapon replication, but virtual models are based on real prototypes. All weapons can be modified. The game has four main classes: Sniper, Rifleman, Engineer, and Medic. Each has its own distinctiveness and unique gameplay: Medic, for example, is an exceptionally supportive class, which can bring back to life the fallen soldiers.\n\nThere are two main opposing groups in the game: Warface and Blackwood. The first is a private military organization that opposes the attempts of the latter to seize control of resources around the world, sell weapons and stops the killing of civilians. The game has many thematic events thanks to which game's lore is developing.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Crytek","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":545015,"name":"Disco Elysium: Final Cut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0af/0afe9e8ace196123d8c7cf22172cec63.jpg","description":"The final cut will be available at no extra cost to all current owners of disco elysium. original players expand their experience for free while new players can enjoy the new content from their first playthrough.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"ZA/UM","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":11350,"name":"The Whispered World Special Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/955/9554bcd979fc7cc52452c332547073db.jpg","description":"The Whispered World Special Edition is a quest game developed by Daedalic Entertainment.\n\nYou play as Sadwick the clown who lives in a fictional kingdom. He suffers from terrible nightmares in which a mysterious blue sphere prophecies that Sadwick will be the reason for the world's annihilation. The situation worsens as Sadwick is a whiny coward. With the help of a caterpillar named Spot, Sadwick passes various challenges that are typical for a fairytale humorous adventure. At some point, he restores the model of the solar system that is mystically linked to the prophecy. That's when the blue sphere appears before Sadwick. The clown has to confront it no matter the cost.\n\nThe Whispered World is a point-and-click game. There is an inventory system present in the game. The players have to use certain items in order to progress in the game.\n\nThe Special Edition features the exclusive commentary from the developers of the game, the original orchestral soundtrack, and new in-game achievements.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":29218,"name":"Minit","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9da/9dabe368eb7990788be1d8726ae56699.jpg","description":"Minit is a peculiar little adventure played sixty seconds at a time. Journey outside the comfort of your home to help unusual folk, uncover countless secrets, and overcome dangerous foes, all in hopes of lifting a rather unfortunate curse that ends each day after just one minute. Minit is a collaboration between Kitty Calis, Jan Willem Nijman, Jukio Kallio & Dominik Johann.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":17795,"name":"Mega Man Legacy Collection / ロックマン クラシックス コレクション","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/041/041026016869e440fb1fb2b6be5222c4.jpg","description":"Mega Man Legacy Collection is a celebration of the 8-bit history of Capcom’s iconic Blue Bomber. Featuring faithful reproductions of the series’ origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more!\nIn addition to the six Mega Man games, Mega Man Legacy Collection features new ways to experience the classic games with the Museum Mode and new Challenge Mode. Challenge Mode remixes gameplay segments from all six games, with plenty of scaling difficulty objectives for experienced players to conquer yet serving as a good starting point for new players, too. Museum Mode contains a comprehensive collection of history, high-res art and original concept pieces – a mega treat for any fan of Mega Man and video game history.\nFEATURES\nSix classic games in one – Play a piece of video game history with the original six Mega Man games and experience the origins of the classic series.\n8-bit style with HD flair – The games retain their retro 8-bit style with an added HD finish, giving a crisp, clean look to the charming, classic sprites.\nChallenge remix mode for new and veteran players – The robust new Challenge Mode remixes gameplay from all six games for a new type of challenge. It provides both increasingly difficult trials for experienced players and also teaches newcomers to become familiar with the style of the games and tackle some of the trickier areas.\nMuseum of the era – The Museum Mode features a massive repository of history and art collected from the era of the games in this collection. Take a look back at the history of Mega Man with loads of information, high-res art, concept pieces, sketches and more in the Museum.\nDeveloped with an all-new engine – Using the newly developed Eclipse Engine, Capcom and Digital Eclipse are able to archive these six pieces of video game history with faithful reproductions of the originals for a new generation of gamers.\nLeaderboards and video replays – Fans will be able to watch video replays of the top players on the leaderboards, showcasing a whole new generation of Mega Man talent!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":1378,"name":"Tower of Guns","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fe/1fe35f25a5cd4515f43767f999ba76ab.jpg","description":"The name of the game directly points to the setting. The game takes place in a tower filled with a variety of weapons. The player is inside the tower and gradually rises to its top.\nThe player goes through different areas, each area contains a number of battlegrounds, where the player enters into battle with various opponents. The main opponent on each level is the boss, the boss should be defeated to pass to the next level.\nAt the beginning of each game a certain story is shown, explaining what kind of tower it is and why the player must fight and go to its top. Before entering the Tower, a player can choose only one weapon and one perk.\nAs the game develops, the player can get different projectiles. These projectiles have a different effect, useful in combat. For example, fire damage, or launching the player into the air.\nDestroying enemies, the player receives tokens, which can be paid for increasing the power of the player's weapons. There are other ways to increase the strength of the weapons and combat capabilities of the hero, which player can unlock.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Terrible Posture Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":49874,"name":"Pillars of Eternity II: Deadfire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/86b/86bea42bc14fb1f9cb76b44c4450cbab.jpg","description":"Pursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of Eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the Deadfire. Bend the world to your will, as you explore the depths of infinite possibilities, including detailed character customization, total freedom of exploration, and more meaningful choices at every turn.\n•\tImmerse yourself in a deeper single player RPG game experience - enriched with cutting edge technology and features, Deadfire builds on the foundation of classic D&D gameplay with vastly improved graphics, deeper game mechanics and a whole new hand-crafted adventure where choices truly matter.\n•\tDiscover the new region of the Deadfire – plot your own course by ship and explore the rich and exotic islands of the archipelago region, discovering new places interacting with their inhabitants and engaging in a variety of quests at every port.\n•\tBuild your party and customize your companions – choose from 7 different companions to join you on your quest and assign multiple classes and deeper abilities for each. Witness their personal relationships and interactions unfold with the addition of the new companion system.\n•\tCaptain your ship across the seas – as your stronghold on the seas, your ship is much more than simply a vessel for exploring.  Upgrade your ship and crew and choose what skills you improve in order to survive dangerous encounters along the way.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":507152,"name":"Streets of Kamurocho","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbe/bbe47995ed6f8b054afa6110f522515d.jpg","description":"In celebration of SEGA’s 60th Anniversary, SEGA mashed Streets of Rage 2 with the ever-popular Ryu Ga Gotoku Studio’s Yakuza series, and Streets of Kamurocho was born.\n\nPlay as two of the most loved characters – Kiryu and Majima – to brawl your way through Kamurocho.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SEGA","platforms":[{"id":0,"name":"PC"}]},{"id":58386,"name":"S.T.A.L.K.E.R. 2: Heart of Chornobyl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e8/3e81585ecda204d4f4b80a041b069adb.jpg","description":"S.T.A.L.K.E.R. 2 is a brand-new entry in the legendary series, enjoyed by millions of players worldwide. \r\n\r\nThe explosive combination of first-person shooter, immersive sim and horror is back. It’s the ultimate S.T.A.L.K.E.R. experience of unprecedented scale, advanced graphics, freedom of choices and the thickest atmosphere of a deadly adventure.\r\n\r\nWelcome to The Zone — an area of exclusion around the Chernobyl Nuclear Power Plant. Full of radiation, mutants and anomalies, it keeps drawing adventurers from beyond the perimeter.\r\n\r\nBounty hunters dwell deep into the Zone, driven by its treasures and mysteries. These people are known as stalkers.\r\n\r\nAre you ready to become one of them?","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":7241,"name":"Botanicula","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed0/ed006da5dfcf9d97d34a7f065769d18b.jpeg","description":"Five unusual creatures living on the tree, trying to save the last seed from other creatures, arachnid parasites.\nUnique abilities of heroes:\nThe protagonist, Mr. Lantern, a small orange creature, can illuminate dark spaces. If he eats enough luminous seeds before that.\nMrs. Mushroom is able to create copies of herself and decrease to the size of her hat.\nMr. Poppyhead is the strongest of the characters.\nMr. Twig - can extend parts of his body - twigs. And he knows how to instantly grow flowers on his body.\nMr. Feather - small in size, but can fly.\n\nHeroes can unite their abilities, helping each other. Advancement in the game requires studying the environment, solving puzzles and collecting items necessary to overcome obstacles. Heroes can interact with other creatures that occur in the game.\nSeven locations of the game have their own ultimate goals.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Amanita Design","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]}]