[{"id":2552,"name":"Sonic the Hedgehog 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2c3/2c3363eb1ae202b9e4e7520d3f14ab2e.jpg","description":"Sonic the Hedgehog 2 is a platform game, the second installment in Sega’s Sonic the Hedgehog series.  \n\n###Plot \nThe story shares many similarities with the previous game. Once again, Sonic must halt Dr. Robotnik’s plan on collecting six Chaos Emeralds and using their power to take over the world. This time, Robotnik build a space station called Death Egg and the events take place mostly on West Side Island. The game also introduces Tails – Sonic’s best friend and important character for the series. \n\n###Gameplay \nGameplaywise the game is very similar to its processor. The game consists of eleven zones.\nAll zones, except the final one, are divided into two or three acts. In each act, your goal Is either to reach the finish of the level or to defeat a boss. The gameplay revolves around Sonic’s ability to run at high speed. The levels involve many objects that help Sonic gain high speed such as slopes, loops, and springs. Sonic can attack enemies and break certain obstacles by using Spin Attack. Like in previous game Spin Attack activates by gaining high speed while rolling on the ground or jumping but Sonic the Hedgehog 2 introduces new gameplay mechanic – Spin Dash. Pressing down and jump while stationary results in Sonic curling in a ball and then upon releasing the button launches launching forward at high speed. The game supports co-op multiplayer in which one player takes the role of Sonic and other plays as Tails.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"SEGA","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"GameCube"},{"id":0,"name":"Game Gear"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox One"}]},{"id":43362,"name":"Shenmue III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb5/eb5e27de42914c71aa0b688ae05b58f9.jpg","description":"Shenmue III is the third part in the Shenmue series of martial action games. Being the belated sequel to 2001 Shenmue II, the game also serves as the series' revival. \r\n\r\n###Plot\r\nShenmue III continues the story of the protagonist of the previous games: Ryo Hazuki, a young Japanese martial artist from the city of Yokosuka. His goal is to avenge the death of his father. Hazuki follows the murderer, Lan Di, to the mountainous region in China called Guilin. A young Chinese girl named Ling Shenhua, who shares a mysterious spiritual bond with Ryo, accompanies him on his quest. There's a prophecy that their destinies are intertwined. \r\n\r\nRyo and Ling walk through various Chinese villages, temples, and fortresses, fighting enemies on their way. They face not only Lan Di but also a new villain named Niao Sun. While the game is set outside Japan, Hazuki can stay in touch with his friends back home by calling them on the phone.\r\n\r\n###Development\r\nThe game spent more than ten years in development due to high costs of the original two games (the first Shenmue was the most expensive game ever at the time of its release). Shenmue III only came to be made because of a crowdfunding campaign. This is not the final part of the story, according to the series' creator Yu Suzuki, who is planning more Shenmue games.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":12341,"name":"King Arthur's Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb4/fb45927c6dace7fc6974721c80c1ffbf.jpg","description":"If you like total freedom in the way you conquer the enemy this is the ultimate war game for you. Build freeform constructions as a medieval Builder, fight in sword duels as a Knight or snipe with your bow as an Archer. KAG blends the cooperative aspects of Lost Vikings, mashes them with the full destructibility of Worms and the visual style and action of Metal Slug, brought to you by the creators of Soldat.\nBuild Defenses With Freeform Building\nDestroy the enemy castles with physics and explosives\nFreedom to move by land, water, dig tunnels or fly in the air\nUse the environment to burn or drown enemies\nInteract with a living animal and plant world\nDrive siege machines with your teammates\nFight with 32 unpredictable humans in multiplayer\nFreely change to one of 3 distinct classes\nSingleplayer, cooperative and competitive game modes\nCustomize with 60+ unique heads\nCreate your own adventure with community created mods & scripts","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Transhuman Design","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9028,"name":"Solar 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dfd/dfdb058ecbccbd3b26535f66e93affee.jpeg","description":"Solar 2 is a game about astronomy and a sequel to Solar. The game allows the player to control a celestial body and help it to become a planet or a star. \n\n###Premise and goals\nIn the beginning, the player assumes control over a small asteroid. As it grows in size, it becomes a dwarf planet, then a planet that can sustain life. Growing further, it may become a star with its own planetary system, and eventually a black hole. \n\nThe ultimate goal of the game is to gather all of the universe's mass into a big crunch. Then it will explode and recreate the space with a Big Bang. However, the player is free to stay at any size instead and not to complete the main goal. There are also optional missions that the player can complete to receive achievements.\n\n###Gameplay\nThe player navigates his or her astronomical object through space, which is a randomly generated open world. To accumulate your object's mass, you have to collide it with smaller objects and absorb their matter. The objects that are larger than yours will only take its mass away if you hit them. Your object can decrease in size, but it cannot downgrade from a planet to asteroid or from a star to a planet. If destroyed, it will respawn with approximately the same mass.\n\nAs your planet grows to the life-sustaining size, it will eventually develop a civilization that will launch spaceships. Other planets can have spaceships as well. They will attack other planets and asteroids to destroy them and engage in space wars with your civilization.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Jay Watts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":20218,"name":"Canyon Capers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2c/f2c1cda97fd642dc9809fee6b14728bf.jpg","description":"Canyon Capers is a 2D platformer game.\n\n###Plot\nThe main character, DinoJr, is out on a quest of exploring different dungeons, canyons, and caves and hunting for great treasures hidden there. Other characters are unlockable through playing, with their unique traits and different approaches to each level. The levels in the game vary in goals and activities, wherein some there is a time limit to complete the run, while in others the player has to score some points by collecting trophies and defeating enemies.\n\n###Gameplay\nThe game follows a pattern set by the classic retro platformers: the player controls a character who can jump, get rid of enemies by landing on top of them and collect different upgrades. While at that, the game offers different challenges in the form of puzzles to solve and 50 different levels with progressing difficulty. Various types of enemies and dangerous traps await at each map, but the player can restore his progress after dying - the character respawns at the last haven.\n\n###Visuals and other features\nAs mentioned before, the game aims at giving its players the feeling of playing a retro platformer. Thus, the graphics are very cartoon-like, with characters having a simple, yet excellent and loveable design, and the backgrounds and other textures having much detail and work into them. The game also has a variety of achievements to obtain, as well as Steam Marketplace integration with a plethora of Steam Cards awarded for playing the game and completing some achievements.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Crazy Moo Games","platforms":[{"id":0,"name":"PC"}]},{"id":290085,"name":"Ring of Pain","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b80/b80c3b10940c41dd354eee7923d35951.jpg","description":"Observe the Ring and plan your fate,\nPain is pending, contemplate.\nRing of Pain is a roguelike card game dungeon crawler played as a series of choices.\nFrail and fragile, you awake in the Owl's nest. Journey into the Shadow and expose the truth of your situation.\nCollect items that affect survival and mobility.\nManage your limited inventory and navigate wisely: Optimise, strategise, learn and adapt.\nPersistence favoured, grit desired,\nPatience good but not required.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Twice Different","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":236804,"name":"Super Animal Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd9/cd9b4b42455ca458425ee54052e61806.jpg","description":"Super Animal Royale is an intense, strategic and ridiculous twist on the battle royale genre, with exotic biomes and murderously cute animal characters, all vying to reach the top of the food chain.\nAtmospheric battle royale action from a whole new top down perspective.\nGet the jump on your opponents using a unique line of sight fog of war system that enables sneaking and close combat fighting.\nAdventure through a massive, beautifully illustrated island, filled with diverse biomes and topography. Find weapons and items to aid in your survival, and don’t forget to chop down tall grass. Everyone knows items love hiding in tall grass.\nThe top down view and streamlined mechanics make the game uniquely accessible and fun, but it’s no easy task to be the final survivor on an island filled with 64 wild and insane animals.\nThe island and roster of genetically modified animals are constantly expanding and changing with updates, and each animal can be customized with different outfits, tombstones, death explosions, weapons and more.\nThe game has also been designed to run smoothly whether you play on a Macbook or a beastly gaming PC.\nSo grab an umbrella and parachute off an eagle with us into Super Animal World. We hope you survive your stay.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Pixile","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":58815,"name":"Nioh 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a35/a359074cde22a4b23c54db44a592dc41.jpg","description":"UNLEASH YOUR DARKNESS\n\nMaster the art of the samurai in this brutal masocore RPG… for death is coming.\n\nJourney to 1555 Japan, a country gripped in endless warfare where monsters and evil spirits stalk a land of natural beauty and menacing peril.\n\nHunt down your enemies as a rogue mercenary wielding the supernatural powers of the mythical Yokai.\n\nCan you survive the treacherous Sengoku era and the new and terrifying Dark Realm?\n\n• Discover deadly weapons and skills in a revamped combat system.\n• Join friends online in multiplayer modes: summon allies to your aid in Visitors or play completed levels together in Expeditions.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Team NINJA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":2042,"name":"Organ Trail: Director's Cut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9c/d9c493b8ec38ee62ba50a3a3da1266ca.jpeg","description":"Organ Trail: Director's Cut is a parody zombie indie game developed by The Men Who Wear Many Hats. Initially, the game was developed on Adobe Flash but was later ported to Facebook as an app.\n\n###Director's Cut features\nIn the Director's Cut, the players are able to create a completely new character instead of choosing from the presets. Randomized zombie spawns, boss encounters, and achievements were also added to the game. The original game was described as a parody on the educational game named The Oregon Trail, while the Director's Cut should be considered as a new title that pushes the concept of its source.\n\nWhile the original game was free-to-play, the players have to buy the Director's Cut in order to play it.\n\n###Gameplay\nThe main objective of the game is to reach a zombie-free haven. In order to do so, the main character has to cross The United States in his old wagon. It is essential to manage food, water, ammunition, and car fuel in order to survive and arrive at your destination. Do not forget to take care of your party, by the way.\n\nAt the beginning of the game, the players have to either choose a preset character or create a new one. It is possible to choose from a cop, a lawyer or just a clerk. Every character has their own upsides and downsides. For example, while playing as a cop, the player will be able to search for supplies for a little longer, but the overall score will be smaller after beating the game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"The Men Who Wear Many Hats","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2970,"name":"The Lords of Midnight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f64/f64fc102b850732764dfd7c29cca3429.jpg","description":"Mike Singleton's '84 classic Adventure Strategy game, brought to and updated for iOS.\n\"The Lords of Midnight is not simply an adventure game nor simply a war game. It was really a new type that became known as an epic game, for as you play the Lords of Midnight you will be writing a new chapter in the history of the peoples of the Free.\nYou will guide individual characters across the land of Midnight on vital quests but you will also command armies that must endeavour to hold back the foul hordes of Doomdark, the witch king. Yours will be no inevitable victory.\" - Mike Singleton 1984\n\"Lords of Midnight does story-based, large-scope, high-fantasy warfare better than most titles I can think of, iOS or otherwise.\"\n- Rating 4/5- PocketTactics.com\n\"This is an outstanding remake and developer Chris Wild, should feel very proud of creating such a superb celebration of the man’s work.\"\n- Rating 8/10 - Metro\n\"#1 - Top 5 iPhone and iPad games of the week\"\n- AppMyWorld.com\n\"If you're interested in classic games, especially fantasy and/or strategy games, Lords of Midnight is a must-have.\"\n-  Rating 4/5 - TouchArcade.com\n\"App of the Year!\"\n- Rating 5/5, Mirror.co.uk\n\"It's an unmissable remake. Few titles weather the storms of time as well as this solid-gold classic.\"\n- Rating 4/5 - PocketGamer.co.uk\n\"A must own title; pure genius and extremely entertaining. Recommended.\"\n- Rating 98/100 - Arcade Life\n“Made of extremely bright colors and clean lines, a stylistic choice that was and still is very original.”\n– Multiplayer.it\n\"Despite the perfectly adapted touch controls and crisp graphic presentation, this is a proper 1980s they-don’t-make-’em-like-they-used-to game\"\n- PocketTactics.com\n\"#3 - Top 10 iPad games and apps of December 2012\"\n- QualityIndex.com\n\"If you love a game, love the game’s creator and want to produce an updated tribute – here’s your benchmark. Almost thirty years old and yet it feels fresh, relevant and completely at home on a touch screen. Recommended without reservation – so good it makes me want to cry.\"\n- Arcade Life\n\"Original, longed for and a perfect adaptation of a legendary game. Unlike those Spectrum conversions that are strictly for nostalgia lovers, Chris Wild’s Lords of Midnight will enthrall any gamer who thinks he has what it takes for a true battle of wits where only the most brilliant commanders will survive.\"\n- Louise Mensch, Mirror.co.uk\n\"Lords of Midnight is an experience that everybody with a remote interest in games should have, buying into your characters and developing your own war stories is a wonderful thing. It is a game with hidden depths that deserve to be plumbed and I cannot recommend it enough.\"\n- KoruCottage.com\niOS Best Port/Retro Gamer of the Year\"\n- Arcade Life\nPlease check out www.thelordsofmidnight.com/blog for news on updates and new features to come...\n** PLEASE NOTE **\nYou need iBooks installed to read the Novella.","review":"","timePlayed":0.0,"releaseYear":1984,"developer":"Chilli Hugger Software","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Commodore / Amiga"}]},{"id":62499,"name":"Trüberbrook – A Nerd Saves the World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/933/933b583d788f9d899805d4ae31bf0696.jpg","description":"»Trüberbrook« is a thrilling mystery-sci-fi adventure game. Enjoy an adventurous vacation to a 1960's parallel universe! A Sci-Fi-Mystery Adventure Game with handmade scenery.\nImagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; Hans Tannhauser. Yes, that's your name in this scenario. While you're at it, think of Trüberbrook, a remote village in rural, mountain-sloped and densely forested cold-war Germany. Because, that's where you somehow end up after hitting the continent. But who cares, you won the trip in a lottery! Or at least, that’s how it seems. But don't fear, instead of getting some rest, you could find yourself having to save the world …\nSuspense! Mystery! Thrills! After all, it's a single player sci-fi mystery adventure game. We want to keep you entertained!\nJoin American student Tannhauser, stranger in a strange land\nSet in cold-war rural Germany in the late 1960s\nInspired by Twin Peaks, The X-Files, Stranger Things & Star Trek\nIndulge in universal themes such as love, friendship, loyalty, self-discovery and dinosaurs\nHandmade miniature scenery!\nEnglish and German localization with full voice acting!\nAtmospheric, moody soundtrack\nComing to Windows, Mac, Linux, Xbox One, PlayStation®4 & Nintendo Switch\nA likely mobile port later!\nUp to 10 hours of super exciting gameplay!\nRelease scheduled for late 2018 – not the longest wait!\nTrüberbrook was successfully funded on Kickstarter in December 2017 within only 30 hours. The game will be enhanced by several new features thanks to the joint force of our 5078 wonderful backers! <3\nThe year is 1967. The world policy is dominated by the Cold War and Vietnam, Russia and America are racing to the moon. At the same time in Europe, students take to the streets from Paris to Berlin.\nOn a larger scale, the world is locked in turmoil, but most people are unaware of the events unfolding in an overlooked, sleepy part in the German province. Hans Tannhauser, an American student in his late twenties is caught by surprise: Out of the blue, he wins a trip to a small, German village, Trüberbrook. Truber-what? No idea! It doesn’t help he can’t remember taking part in any lottery in the first place … Happy to put some distance between him and his Ph.D. in quantum physics, he makes his way to Trüberbrook, Germany, bursting with curiosity.\nBut shortly after his arrival, inexplicable things start to happen: A mysterious stranger breaks into his room at the Guesthouse Waldeslust and steals a paper on physics. But who would do that? And why?\nGradually, he gets to know the various villagers and spa guests, one more peculiar than the other. Only young anthropologist Gretchen Lemke, who is on a research trip to Trüberbrook, seems normal to him. Before he knows it, Gretchen becomes Tannhauser’s accomplice on the adventure of a lifetime! It slowly dawns on the aspiring physicist that his presence in Tüberbrook is not accidental – he is here to save the world!\nAs the story proceeds, Tannhauser teams up with Gretchen Lemke, a student of paleoanthropology, and bumps into the enigmatic inventor Lazarus Taft.\nTannhauser is an American physics student in his mid-twenties – and a clever one at that. The adorable little fellow is well-read, always curious and of a deeply friendly nature. Tannhauser is played by Justin Beard.\nGretchen Lemke was always the fiercest kid in the sandbox; cute but merciless if someone dared interrupting her excavations of twig bones and toy artefacts. The somewhat overenthusiastic student of paleoanthropology arrives in Trüberbrook on an adventure to unravel the mysteries surrounding the village. Gretchen Lemke is played by Nora Tschirner.\nAs much a reclusive inventor as it gets, Lazarus Taft quickly became talk of the town due to his superior card playing. There must be a reason he bought this costly old mansion in Trüberbrook, of all places … What's up with Lazarus Taft? Lazarus Taft is played by Dirk von Lowtzow.\nTrüberbrook is full of quirky villagers, tourists and strangers – like the gruffy but warm-hearted innkeeper Trude or her daughter Leni, \"the weird kid\" from Trüberbrook Elementary. And there's the old baron, a veteran of two world wars, or Lessing, the prototype of modern day conspiracists. And of course Trübi, the legendary lake monster. To name a few.\nOne of the most distinctive features of the game is the unique visual style. The sceneries are purely handmade. 'Handmade' as in: 'Manufactured using real hands!' And fingers!\nNot the most efficient way of doing things, but certainly the most inefficient one. We're loving it, though! Look at what we do here, piece by piece, by the sweat of our brows. Every little detail is custom-made.\nThe models are digitized using a technique called photogrammetry and later retopologized. This way we get highly detailed polygon models that blend perfectly with our digital characters.\nIt is a lot of work, but also quite exciting! You may ask yourself, how can they reach this level of detail? Are there very tiny people involved? They can't accomplish all of this with mere human hands, right? Well yes, we can! The answer might be our abundance of professional hands. Twenty-four seven at our disposal in all shapes and colors, they get things done!\nEvery scene gets an individual treatment and is staged with actual physical lighting. This allows us to simulate different hours of the day or weather conditions. Even a change of seasons is possible just by redecorating the set with real tiny little snowflakes, no joke.\nThis way we achieve an exceptional and magical look that visually reflects the world of Trüberbrook.\nTrüberbrook is a story-driven adventure game with a strong focus on characters and the narrative, but includes a lot of puzzles that need to be solved to progress the story. The puzzles are designed to integrate into the narrative.\nYou navigate Tannhauser through the different sceneries from a third person perspective, usually in long distance shots to intensify the impression of peeking into a little diorama. The story unfolds as you interact with your environment, talk to other characters and solve puzzles. These range from inventory-based puzzles to social challenges (such as persuading other characters) up to passing unsettling psycho tests.\nFor the console versions, we came up with a very intuitive controller input, allowing you to move the line of sight and walking directions independently. For the PC versions, you can choose between classic point and click mouse controls, and the controller navigation.\nThe soundtrack of Trüberbrook is an original composition to fit the mood of the game – sort of a tranquil doom jazz. Inspirations come from the works of Tom Waits, Angelo Badalamenti, Mark Lanegan, Timber Timbre or Bohren & der Club of Gore. The soundtrack is directed by Sebastian Nagel & Albrecht Schrader.\nWe've spent a lot of time working on a voice acting concept that joins in with the genetic code of the game. Since the protagonist is an American in the midst of a bunch of Germans, we wanted to reflect this in our choice of actors.\nIn the international English version, the main character Tannhauser speaks American English, while the townspeople of Trüberbrook sport a (more or less) German accent. In the German version, it's vice versa: the protagonist might have a modest American accent, while the townspeople welcome him in regular German, most likely with a dialect. Both approaches bear a certain degree of entertainment, each in their own way.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Headup Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"}]},{"id":11192,"name":"Shelter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb7/eb70b94188815efea35b95222561e37e.jpg","description":"Shelter is a game where the main character is a badger who takes his cubs from one place to another.\n\n###Gameplay\nOn the way the cubs need to be fed - five cubs regularly want to eat. Food for them can be obtained by hunting or finding - if it's fruits and vegetables.\n\nCubs need to be protected from dangers. Difficulties and threats along the way are numerous - these are predatory birds, other predators, forest fires.\n\nThe goal of the game is to lose as little cubs as possible on the way to a new place to live.\n\n###Episodes\nThe game consists of several episodes. In each episode, the conditions differ from those of other episodes.\n\nFor example, in the first and last episodes, the badger and her cubs have to go through open spaces. In these open spaces, they are threatened by birds of prey that can dive down and take someone away if the badgers stay long in the open.\n\nThe action of one of the episodes occurs at night, when visibility is limited. In this darkness, badgers can get frightened of sudden calls and run away in different directions, disappear from the mother's field of visibility, they will have to be looked for.\n\nAnother episode is a river crossing.\n\n###Sequel\nThe game has a sequel, where you need to play for a female lynx. Unlike the first game, in the sequel it is possible to grow those who can be brought to a new shelter, and then they will become the next generation operating in the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Might and Delight","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":4751,"name":"The Legend of Heroes: Trails in the Sky","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/172/172198bbcf9680d00fb621b50cbe630c.jpg","description":"Modern society owes much to a mystical technology known as “orbal energy.” Fifty years ago, during what’s come to be known as the “Orbal Revolution,” the invention of this technology and the “orbments” developed from it led to a period of rapid human advancement, birthing innovations of all shapes and sizes -- not the least of which was the airliner, or “orbalship” industry. Although the positive impact of this revolution is obvious, every coin has a flipside; for every beneficial device developed with these new materials, so too were advanced weapons and other implements of war. Thus, the land became mired with turmoil, and remains in such a state even now.\nEnter, the bracers: an organization established to serve as police and intermediaries alike, holding above all else the peace and safety of the lands under their jurisdiction. Whenever a citizen is in need of assistance, he or she may place a request at the local Bracer Guild -- and be it monster extermination, crime prevention or even peace talks among warring nations, the bracers will do whatever they can to resolve the matter cleanly and efficiently.\nSome matters require a gentler touch than others, however. When an orbalship transporting a legendary \"S-rank\" bracer named Cassius Bright suddenly goes missing, said bracer's daughter, Estelle, and adoptive son, Joshua, must join forces in search of him across the entire Kingdom of Liberl.\nAnd what they find along the way could change both of their lives forever...\nHailed as one of the largest, longest and most meticulously detailed turn-based JRPG series of all time, this first chapter in the ongoing Trails saga sets the stage for what's quickly become Ys developer Nihon Falcom's most popular and best-selling franchise in their entire 30+ year history. Introducing people, places, ideas, events and lore that rival in complexity those of even the most highly-regarded fantasy epics in literature, the care and attention given to each and every NPC, location and historical in-game event is what sets The Legend of Heroes: Trails in the Sky apart from its contemporaries.\nCome join Estelle, Joshua, Scherazard, Olivier and the rest of the cast as they uncover the secret underbelly of Liberl in their first 50+ hour masterpiece, and see what Japanese gamers have been raving about for over ten years.Key Features:The original version of the first chapter in this historical series, featuring strategic turn-based combat with unmatched customization.\nOver 50 hours of gameplay on average, with countless side-quests, collectibles and secrets to encourage replay.\nA vast world where every NPC has a name and personality, every town has its own unique politics and economic concerns, and no detail is ever trivial.\nSupport for a wide variety of fullscreen and widescreen resolutions, including true 1080p HD.\nFully adjustable controls supporting virtually any USB gamepad, as well as a standard keyboard and mouse setup.\nOver two dozen unique Steam Achievements, Steam Cloud support and Steam Trading Cards featuring gorgeous anime-style art from the franchise's original artists.\nNumerous updates previously seen only in the handheld version, including:\n- Selectable difficulty level and new game+ features on subsequent playthroughs\n- Full voice-acting during combat\n- \"Retry Offset\" feature to lower the difficulty of battle with each attempt if desired","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":3364,"name":"Shovel Knight: Treasure Trove","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/136/1369a40d031777815fbb5d7bc4dd2f86.jpg","description":"Shovel Knight: Treasure Trove is an indie platformer game developed by Yacht Club Games. The development of the game was funded through Kickstarter.\n\n###Treasure Trove Edition features\nTreasure Trove is a complete Shovel Knight package. This edition features all the campaigns released to this day. \n\n###Setting\nThe base campaign named Shovel Of Hope tells the tale of a vigilant Shovel Knight. He got separated from his lover, Shield Knight while exploring the mysterious Tower of Destiny. Devastated from such an event, the Shovel Knight lives alone, until the mysterious Order of No Quarter emerges. The Knight can cope with all of this and abandons his boring life in order to save the valley he lives in and enter the Tower of Destiny once again. \n\nAll other campaigns add details to the story of the base game.\n\n###Gameplay\nShovel Knight: Treasure Trove resembles a classic 2D sidescroller. It was heavily influenced by the Ninja Gaiden-era platformers. The main objective of the game is to finish all the main stages. The players unlock new levels by completing a certain number of previously unlocked ones. \n\nThe game features numerous boss encounters, most of which appear at the end of the stage and serve as a finishing point of the level. This makes the defeat of the boss need to be achieved to complete a stage. \n\nOn his way through the levels, the Knight can stumble across several treasures which can be used for purchasing equipment upgrades.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Yacht Club Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":868085,"name":"Marvel Snap","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f7/1f73ddf4231f9296d73358ddd5d54e29.jpg","description":"Assemble your MARVEL dream team from a super roster of your favorite heroes and villains—then make your move. MARVEL SNAP is fast-paced, adrenaline-pumping, strategic card battler that puts you in control of it all.\nSUPER FAST\nNo more waiting around! Every game lasts only around three minutes. We cut out the fluff to focus more on the good stuff.\nEVERY MATCH FEELS DIFFERENT\nPlay your cards at 50+ different locations from across the Marvel Universe, each with iconic game-changing abilities. From Asgard to Wakanda, new locations are introduced weekly to put your creative problem-solving skills to the test.\nPLAY MIND GAMES\nFeeling confident about your chances of winning? Just \"SNAP\" to raise the stakes during a match. Hey, even if you're bluffing—you could double your rewards!\nI AM GROOT\nI am Groot. I AM Groot. I am GROOT. I am Groot? I am Groot. I AM GROOT! I am GROOT. I am Groot?\nFLEX YOUR OWN STYLE\nNo other game lets you collect, mix, and match hundreds of hero and villain variants from the entire MARVEL Universe—and beyond. You might have a classic comic inspired Iron Man card, but do you also have the Chibi, 8-bit, and Cartoon variants? Endless art styles let you flex your favorites in unique new ways. You do YOU!\nFRESH CONTENT ALWAYS\nMARVEL SNAP stays fresh and exciting with new cards, new locations, new cosmetics, new season passes, new ranked seasons, new challenges, new missions, and new events on the regular.\nCome harness the power of every Cosmic Cube in the Multiverse and see how you measure up against the competition. That's MARVEL SNAP! See you in game.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Nuverse","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":28601,"name":"Gotham City Impostors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c11/c119cc720082bb941218a41c5f6ed796.jpg","description":"Hatched from the twisted minds at Monolith Productions, Gotham City Impostors is a download-only multiplayer FPS that pits violent vigilantes dressed up like Batman against craven criminals dressed up like the Joker in open warfare on the streets of Gotham City.Key FeaturesWhy fight crime when you can kill it… Gotham City has gone insane! Batman is up to his pointy ears in unwanted \"helpers\" determined to dish out their own bloodthirsty brand of vigilante justice in his name (and image). Meanwhile, a small army of self-appointed junior Jokerz has turned the streets of Gotham into a barmy battlefield of bullets, bodies, and bear traps.\nMore customization than you can shake a shotgun at… Packing more customization than you can shake a shotgun at, you get to choose the guns, gadgets and even the hairdos that fit your personality and play style. It doesn't matter if you want to be a mighty muscleman on roller skates with a hunting bow or a lithe lassie packing a homebrew rocket launcher and glider wings, Gotham City Impostors does not have rigid character classes and lets you play the way you want.\n1000 levels of player advancement overflowing with upgrades and unlocks… A robust level up system lets you unlock all the items required to make your impostor as crazy as you desire. Whether you prefer to develop your impostor by proving your prowess in solo challenges designed to test your skills and reflexes or by battling your way to the top of the scoreboard in several delightfully over-the-top multiplayer modes, there's a surefire way for you to realize your preposterous potential!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":22960,"name":"Doomdark's Revenge","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50a/50a9a4ecdfc1cd4a303da493ca88f5c3.jpg","description":"Mike Singleton's '85 classic Adventure Strategy sequel to The Lords of Midnight\n\"It is many moons now since the Lords of Midnight first appeared out of the soft, wearing gloom. Those of you who took up their challenge and rode with them to battle against the cruel Witchking will need no reminding of that epic struggle. But now a new epic tale unfolds, the story of Doomdark’s Revenge.\nThe game itself involves both quest and warfare, both exploration and careful strategy. You can play on your own or with friends; there are enough different characters at your command for all the family to join in and struggle against Shareth Heartstealer, Empress of the frozen Empire!\" - Mike Singleton - 1985Retro style high resolution graphics.\nStory Based Adventure - complete with Novella.\nEasy dip in/dip out, turn based game play.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Mike Singleton and Chris Wild","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":4187,"name":"PlayStation All-Stars Battle Royale","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/596/596215939911a0d97facfc224b1bca30.jpg","description":"PlayStation All-Stars Battle Royale is a crossover 2.5D fighting game, including a big roster of Sony’s signature characters. It’s a quick paced game, similar to Nintendo’s Super Smash Game, where characters fight each other on the battle arenas with a lot of stage unique hazards. Each stage combines two different games, presenting 15 levels of varying difficulty and layouts. 20 playable characters and 4 DLC exclusives, and not all of them are from Sony exclusive titles.\nPlayStation All-Stars Battle Royale has multiple modes, offering single-player arcade mode that shows off game’s story. A mysterious being is searching for the strongest warriors from all the worlds, and heroes and villains alike are trying to locate the new threat. Arcade story mode will match players against a group of randomly selected characters, before facing off with the interdimensional threat. And multiplayer modes are all based around either reaching the set amount of kills first or getting the most kills in a set time.  There are three types of special moves, based on the number of AP players use, and they gain the AP by hitting other players.  PlayStation All-Stars Battle Royale has a cross-platform play feature for PS3 and PS Vita.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":558980,"name":"Neon White","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a12/a120fc7faed7666f8c320a755137e316.jpg","description":"A lightning fast first-person action platformer set beyond the pearly gates of Heaven.\nNeon White is a lightning fast first-person action game about exterminating demons in Heaven. You are White, an assassin handpicked from Hell to compete with other demon slayers for a chance to live permanently in Heaven. The other assassins seem familiar, though… did you know them in a past life?\n\n \n\nFeatures:\n\n• You play as Neon White, an assassin plucked from Hell to compete with other demon slayers for a shot at redemption.\n\n• Collect “Soul Cards” to attack your foes or discard them to use unique movement abilities.\n\n• Compete for the best times by cleverly combining cards to discover massive shortcuts.\n\n• Uncover Heaven’s mysteries by getting to know the other assassins… did you know them in a past life?","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Ben Esposito","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":275636,"name":"Daymare: 1998","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/52c/52cd2071a3d6b9930bf7453cc3832bee.jpg","description":"DAYMARE: 1998 is a third person survival horror with hardcore survival mechanics, hard to kill enemies, strategical approach to combat and puzzles, with a multi-character point of view on the story, and a deep and obscure lore. A secret research facility, a deadly chemical weapon and three people who play crucial roles in finding the truth about an incident with a potential to become more than just a security breach. Follow the steps of an elite soldier, a helicopter pilot and a forest ranger, as they become the main characters in an event that transforms one peaceful small town into a deadly zone and its citizens into bloodthirsty monsters. Make sure to take them down first, before looking for clues and evidence to bring more sense to the mess. Keep track of your itinerary, as resources are scarce in a situation like this! And anything can happen when your daymares become real…\nAll fans of the 90s’ iconic cinematographic brands and classical gloomy survival horror games will be thrilled, seeing how DAYMARE: 1998 recreates the atmosphere of the most beloved works from the end of the millennium and places a typical yet fresh story in the middle of it. The plot unfolds through the eyes of various characters, putting players in the shoes of different personalities that will guide them through their theories and doubts about the situation. Backtracking, managing ammo, collecting lore items, solving environmental puzzles and the overall difficulty will help players jump a couple decades back and get chilled to the bone in their first real daymare.\nMain features: Multi-character POV – see the story from different angles and discover the truth\nRealistic HUD – check inventory, health and position on a special piece of gear\nEnvironmental puzzles – finding your way is not always easy, look for clues\nClassic mechanics - limited ammo and save points, backtracking, collectibles, tough enemies and more\nModern graphics and effects – not all is classic thanks to Unreal Engine 4\nExperience 90s – homage to the era with tons of references","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Invader Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":19565,"name":"Dark Sector","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9fc/9fccb768165df246b64051a2fdae6dfd.jpg","description":"Dark Sector thrusts players into the role of Hayden Tenno, a covert operative sent on a dangerous mission into Lasria, an Eastern European city on the brink of ruin that hides a deadly Cold War secret. In the midst of this mission, Hayden is attacked by an unknown enemy and infected by the Technocyte Virus, a brutal bio-weapon that twists its victims into mindless killing machines. Surviving this attack, Hayden finds that the Technocyte virus has granted him powerful, inhuman abilities unlike anything he has ever seen. Now, he must evolve with his powers, survive and become a hero.\nAll new, all original action-shooter - Throughout the course of the game, players will witness Hayden's transformation into something more than he was as he fights against the Technocyte Virus taking over his body and the effects it has on his psyche.\nEvolution powers - Hayden gains incredible superhuman powers - including the deadly, bladed glaive that he can grow from his arm and use and throw with deadly accuracy. Hayden will grow with these powers as they evolve and become more powerful throughout the game.\nCinematic and immersive experience - Through the use of no HUD, intuitive controls and a 3rd-person over the shoulder viewpoint everything about Dark Sector is designed with the goal of keeping the player immersed in the game.\nInnovative multiplayer component - Dark Sector features an innovative and exciting multiplayer gameplay that will allow players to utilize the skills they have learned in the single-player game to excel in a competitive environment","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Digital Extremes","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":419297,"name":"Horizon Zero Dawn Complete Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d71/d7103d99d17e4b66acd1d6ad746e5bd5.jpg","description":"Experience Aloy’s legendary quest to unravel the mysteries of a future Earth ruled by Machines. Cast out from birth, the young hunter must fight to stop a threat to all mankind. Use devastating tactical attacks against the Machines and explore a majestic open world in this award-winning action RPG","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":39727,"name":"Enslaved: Odyssey to the West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9e/f9e94108f254649089ffbbfe9140d638.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ninja Theory","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":9687,"name":"CrossCode","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd6/cd6825467cb0f6a478a016b242d5d247.jpg","description":"This retro-inspired 2D Action RPG might outright surprise you. CrossCode combines 16-bit SNES-style graphics with butter-smooth physics, a fast-paced combat system, and engaging puzzle mechanics, served with a gripping sci-fi story.\nCrossCode is all about how it plays! That's why there is a free Steam demo! Go give it a try!\nTake the best out of two popular genres, find a good balance between them and make a great game. That’s what CrossCode does. And it works pretty well. You get the puzzles of Zelda-esque dungeons and are rewarded with the great variety of equipment you know and love from RPGs. During the fast-paced battles you will use the tools you find on your journey to reveal and exploit the enemies' weaknesses and at the same time will be able to choose equipment and skills for a more in-depth approach in fighting your enemies.\nCheck the Reviews to see who loves the game. We're sure you will, too!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Radical Fish Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":4808,"name":"Metal Slug X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1b/f1b0278f9274c835814a4bdbbd5d0cee.jpg","description":"“METAL SLUG X”, a masterpiece in SNK’s emblematic 2D run & gun action shooting game series, still continues to fascinate millions of fans worldwide to this day for its intricate dot-pixel graphics, and simple and intuitive game controls. One of the most highly praised titles in the series among Metal Slug fans for its refined balance and game volume, heads out to the Steam gaming platform! MAIN FEATURES・ARCADE MODE (MAIN MISSION):\nPlay the original arcade version of  “METAL SLUG X” from Missions 1 to 6, and fight your way through the battlefield to foil General Morden's new coup attempt!!\n・MISSION MODE (STAGE SELECT):\nPlay your favorite stages at will and train alone or with a brother-in-arms on the missions you have unlocked so far!\n・MULTIPLAYER:\nConnect to Steam and clear missions with friends far away via Online Co-Op Play.\nFind a fellow countryman or foreign ally and let the mission begin!\n・SETTINGS:\nConfigure control, language, video display, and sound volume settings.\n・LEADERBOARDS\nCheck your current rank and score in“METAL SLUG X” at any time,\nand compete with other players to become the world's No. 1 soldier!\n** WILL NOT RUN ON WINDOWS XP **","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"}]},{"id":46431,"name":"Forza Motorsport 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23d/23d69e394c94b3be23365eca161b2846.jpg","description":"Forza is a long-running series of racing game that took a standard formula and adds several personal touches. Realistic and bright car designs, energetic soundtrack, and racetracks that will test the driving skill of every player.\r\nForza 5 was brought to the players with 200 different cars from more than 50 manufacturers and brands, and after the initial release, there were eight monthly car packs. Each of them consisted of 10 cars and could be purchased as DLC. Each car can be individually upgraded and purchased from the main menu. \r\nSoundtrack took a turn from the licensed songs, creating an original orchestral score, mixed with a previously established in the series ambient electronic sounds. More than 2 hours of original music, released and distributed digitally.\r\nMost racing tracks in Forza are a detailed representation of real-life locations or transferred fictional tracks from previous titles of the franchise. One of the tracks is a recreation of a Top Gear test track after the promotional Xbox One reveals by the cast of Top Gear.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Turn 10 Studios","platforms":[{"id":0,"name":"Xbox One"}]},{"id":11765,"name":"EVGA Precision XOC","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4b/f4ba1654a40a4ba12320d2497e88a8f4.jpg","description":"The next generation of EVGA Precision has arrived with EVGA Precision XOC. This software allows you to fine tune your NVIDIA graphics card, maximizing cooling and performance. This new version of Precision is built for the latest NVIDIA graphics cards and combines the best of EVGA Precision and EVGA OC Scanner to give you never before seen overclocking features and built in automatic tuning.\nKey Features\nFull support for NVIDIA GeForce GTX graphics cards\nDynamically set independent voltage/frequency points for ultimate control\nLinear mode gives you one click overclocking\nUse the Scan mode to find the optimal voltage/frequency curve for your card!\nFull support for Microsoft DirectX 12 (EVGA card required)\nOSD interface with RGB color support\nGPU, Memory and Voltage Control\nCustom Fan Control/Fan Curve\nProfiling system allowing up to 10 profiles with hotkey\nIn game screenshot hotkey supports BMP and JPG\nMuch more!\nNote: This application has many features and achievements that may void your graphics card's manufacturer warranty. Please consult with your video card manufacturer before using this application. If the card is an EVGA graphics card, overclocking is covered under the warranty term.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"EVGA","platforms":[{"id":0,"name":"PC"}]},{"id":21246,"name":"Floating Point","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62a/62a736a41f437fb8cf1424d194d16298.jpg","description":"Floating Point is a free casual game consisting of hooking onto platforms suspended both in the air and underwater in a 2D environment. \n\n###Gameplay\nFloating Point has a simple gameplay. The players aim to use a grappling hook to swing themselves, fight gravity, avoid obstacles and get through several areas; each one is generated randomly.\nIf the players dash down beneath the water, they have to fight buoyancy to go deeper into the liquid. The main difficulty is that the players have to withstand weightlessness or buoyancy to swing themselves further into the area. Another purpose is to collect points. The players' points are increased when they swing swiftly and efficiently; when they fly through the area without hitting anything. \n\n###Key features\nThe movements which let the player fly through the area form a special source of energy. Then the protagonist starts to glow, the bars he's collecting rise up. When they do, the music rises, and the player's trajectory burns a bright red line in the air. Each line acquires big mathematical curves of the arcing flight. If the protagonist doesn't fall during the flight, the collectible bars in the level get more relevant and grow taller, so they’re easier to tap. Gradually the area's appearance changes, receiving a special heat signature.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Suspicious Developments","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17374,"name":"ArcheBlade","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/024/0248ef29635319b17b2f2549ea821d28.jpg","description":"ArcheBlade is a free-to-play multiplayer action game with elements of the fighting game and multiplayer online battle arena. \n \n###Gameplay \nThe gameplay is a match-based multiplayer third-person action game. In ArcheBlade you can choose from 14 different characters, each with its unique fighting style, weapons, and abilities.\nThe combat system attempts to incorporate elements of fighting games such as Street Fighter and Tekken into the free-roaming 3D arena. Each character has a general set of moves, its unique set of combos and abilities. The basic controls consist of jumping, primary and secondary attacks, dodging, blocking, power attacks, special moves, and two rage skills for every class. The player performs combos by combining these moves according to combo list, individual for every character. The rage skills are special abilities that require rage meter to be filled up which in its turn require to engage in combat. There are two types of rage skills: a regular one and ultimate. Ultimate rage skill uses most of the rage guide, so it requires a strategical approach to be used effectively. The game modes are mostly typical for multiplayer action games: Domination, Capture the Flag, Last Team Standing, Free for All. Most of the maps include individual elements such as high-speed trains that can instantly kill any player or jumping platforms.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"CodeBrush Games","platforms":[{"id":0,"name":"PC"}]},{"id":44972,"name":"Danganronpa V3: Killing Harmony","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef2/ef2fded04fb3ed42a84bcd4cb5f7fb18.jpeg","description":"Welcome to a new world of Danganronpa, and prepare yourself for the biggest, most exhilarating episode yet. Set in a “psycho-cool” environment, a new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished. Reimagine what you thought high-stakes, fast-paced investigation was as you investigate twisted murder cases and condemn your new friends to death.\nKey Features\nA New Danganronpa Begins: Forget what you thought you knew about Danganronpa and join a completely new cast of Ultimates for a brand-new beginning.\nMurder Mysteries: In a world where everyone is trying to survive, nobody’s motivations are quite what they seem. Use your skills to solve each new murder or meet a gruesome end.\nLie, Panic, Debate! The world is shaped by our perception of it. Fast-paced trial scenes will require lies, quick wits, and logic to guide your classmates to the right conclusions.\nNew Minigames: Between the madness of murdered peers and deadly trials, enjoy an abundance of brand-new minigames!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":9626,"name":"RUNNING WITH RIFLES","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/983/9836b294521963a13c3974939d2b70ee.jpg","description":"RUNNING WITH RIFLES is a top-down tactical shooter with open-world RPG elements.\nIn RWR, you join the ranks of an army as a common soldier, just like the thousands around you.\nThe open world approach lets you define your own path and story in the campaign. Push back the enemy with your comrades or go deep behind enemy lines to sabotage their efforts and loot valuable items.\nAs you gain experience, you are promoted with higher command over soldiers and equipment. Call in artillery fire missions or paratrooper reinforcements when the situation gets tight! Use your squad to man armed boats, tanks and APC's, or, become the expert lone wolf you always aspired to be - it's up to you!KEY FEATURES hundreds of locations to explore from trenches to towns, deserts to snowy valleys\nemergent AI that will question if you're as smart as you think you are\nrealistic cover system\ndozens of different weapons, support and cover items, radio calls, vehicles\nside objectives to keep you busy: destroy radio towers and other assets, steal cargo trucks, rescue prisoners\n40+ multiplayer support, dedicated servers,  coop, PvP, PvPvE\nspeech bubbles!\ndeaths and fails, a lot of them, including your own!\n...and of course, mods!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Osumia Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":3396,"name":"Slender: The Arrival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/075/075356e985aa6918c30442c1bc2046a6.jpg","description":"You're on your own. No one to come for you. No one to help you. No one to hear you scream. Slender: The Arrival is the official videogame adaption of Slender Man, developed in collaboration with Eric \"Victor Surge\" Knudson, creator of the paranormal phenomenon that has been terrifying the curious-minded around the world since its inception, with Mark Hadley and Blue Isle Studios.\nBack in 2012, Mark Hadley (AgentParsec) created a game that captivated gamers around the world. Slender: The Eight Pages was a short, experimental first-person game that helped breathe new life into the horror genre through its use of unadulterated tension and fear.\nExperience the horror all over again.\nSlender: The Arrival is the official re-imagining and expansion of the original game created by Mark Hadley, teamed up with the writers behind the Marble Hornets series and the development team at Blue Isle Studios. The Arrival features a brand new storyline, improved visuals, great replay value, and most importantly, survival horror at its best.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Blue Isle Studios","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"}]},{"id":388309,"name":"Diablo IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/77d/77d51f8f4a07c3eecb0f8504027b1bf0.jpg","description":"Meet Your Maker\n\nLilith has returned to Sanctuary, summoned by a dark ritual after eons in exile. Her return ushers in an age of darkness and misery.\n\nSanctuary, a land once ravaged by war between the High Heavens and Burning Hells, has fallen once more into darkness. Lilith, daughter of Mephisto, Lord of Hatred, has been summoned by dark ritual after eons in exile. Now, hatred threatens to consume Sanctuary as evil spreads and a new wave of cultists and worshippers arise to embrace Lilith’s coming. Only a brave few dare to face this threat…\n\nForge your path through the corrupt lands of Sanctuary – a continuous, ever-growing, and fully explorable world, teeming with choices, quests, corruption, and loot. Join fellow adventurers, retake besieged towns, delve into nightmarish dungeons, and uncover lost secrets as you fight for the fate of the world. Every inch of Diablo IV is built for adventure, with multiple zones to explore freely, each ripe with non-linear quests, epic bosses, discoverable towns, and multitudes of demons to slay.\n\nCreate and customize your character to become steadfast in the face of darkness. Choose from one of five classes and forge your hero from an abundance of different cosmetics, talents, and abilities, creating a character that is uniquely your own. Grow stronger as your character progresses through powerful Skill Trees, developing even more unique end game specializations with Paragon Boards to dramatically impact your gameplay.\n\nDefeating great evil requires great gear. Discover and experiment with a vast arsenal of powerful weapons, armor, and more to fight back against the demons threatening these lands. Embrace the many powers of your collection by exploring unique combinations to battle in immersive, action-packed combat against the deadliest of enemies with devastating results.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Activision Blizzard","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":318347,"name":"Tom Clancy's Ghost Recon Breakpoint","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0a/b0aa291a4f8e49f389f2785b7f449328.jpg","description":"Tom Clancy’s Ghost® Recon Breakpoint is a military shooter set in a diverse, hostile, and mysterious open world that you can play entirely solo or in four-player co-op. Injured, without support, and hunted down by ex-Ghosts, you must fight to survive while lost in Auroa. Choose the right alliances and decide how to take down your toughest enemy.\r\n\r\nKEY FEATURES\r\n\r\nDISCOVER A MYSTERIOUS AND DIVERSE ARCHIPELAGO\r\nExplore Auroa, home of the Silicon Valley giant Skell Technology, both on- and off-road, in the air, on land, and at sea. Immerse yourself in a mysterious place where the most architecturally advanced buildings meet the wildest and most untamed nature. From the highest fjords and snowy peaks to the deepest swamps, meet different factions – from Skellers to Homesteaders to Outcasts – that will impact your mission. What happened to Jace Skell? Who is pulling the strings? Find the truth and clear the plot!\r\n\r\nTAKE DOWN YOUR EX-BROTHER-IN-ARMS\r\nFace your toughest enemies, the Wolves, a lethal ex–US military unit gone rogue, ready to use the most effective killing machines to take you down. The Wolves used to be you. They have the same training and experience as you have. They have seized the archipelago of Auroa, taking control of the most important resources of the island: the drones. And they are led by your ex-brother-in-arms, Colonel Cole D. Walker, so you will have no choice but to confront your former teammate.\r\n \r\nLIVE THE LIFE OF A TRUE GHOST STRANDED BEHIND ENEMY LINES\r\nTest your survival skills and adapt to the varied terrains of Auroa. Steep slopes, accumulating injuries, and fatigue are the new challenges for you to tackle. Set up a camp with your teammates, manage your equipment, class, and weapons in your bivouac, and fine-tune your strategies. If you’re wounded in battle, you’ll have to crawl to the safety of cover to heal yourself, or if a teammate goes down, you’ll need to pick them up and carry them to a safe place before treating their injuries. Use new tools, like the mini drone, that will allow you to sync shot several targets, even in solo.\r\n\r\nCUSTOMIZE YOUR GHOST AND EXPERIENCE FULL FREEDOM OF APPROACH\r\nCreate your character and choose among thousands of customization combinations to create your perfect Ghost. Loot materials from the world, craft and upgrade your weapons with multiple attachment possibilities, and customize your gear in order to adapt your Ghost to any situation and to fit your playstyle. Experiment with a brand new class system to give you more chances to defeat your enemies. Do you want to play assault? You can go berserk. Do you want to play sniper? You can get special ammunition that gives you more range and accuracy. You can also play stealthy with the Panther class, and use a smoke bomb to get away from your enemies. Tom Clancy's Ghost Recon Breakpoint is all about your choice, your way to have fun.\r\n\r\nENJOY A TRUE SOCIAL EXPERIENCE WITH NEW SHARED PROGRESSION AND BEST-IN-CLASS ENDGAME CONTENT\r\nHowever you decide to play, in Tom Clancy’s Ghost Recon Breakpoint, you will always keep the same character: the same customization, the same skills, and the same weapons. You keep and improve your progression across both our PvE and PvP experiences. Tom Clancy’s Ghost Recon Breakpoint is also a truly social experience. Find your friends in the new Social HUB, play the campaign together, or enter a PvP arena to take on an intense 4v4 match. The adventure does not stop there! The game will be regularly updated and supported years after launch. New story arcs will keep expanding the story, new features will be continuously added, and new classes and gameplay possibilities will available to players, as well as events and a brand-new type of endgame content: Raids.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":282834,"name":"Inmost","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13e/13e63111b49551ea3227cd74ff6c2105.jpg","description":"Inmost is an atmospheric, story-driven puzzle platformer, following three playable characters within one dark, interconnecting story. In an old abandoned castle, you’ll need to explore every nook and cranny, avoid detection, slice your way through enemies and spring deadly traps in order to escape the evil that lurks within…","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hidden Layer Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":257206,"name":"Warhammer: Chaosbane","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/382/3825ef8a6143ac0622758d6e0f5ae46e.jpg","description":"“Keep your eyes on this one, because it’s one quality Action RPG” – Entertainment Buddha\nIn a world ravaged by war and dominated by magic, you are the last hope for the Empire of Man against the Chaos hordes. Playing solo or with up to 4 in local or online co-op, choose a hero from 4 character classes with unique and complementary skills, and prepare for epic battles wielding some of the most powerful artefacts of the Old World.\n• THE FIRST HACK AND SLASH set in the Warhammer Fantasy world, told through an all-new story written by Mike Lee (a Black Library author) and featuring a soundtrack composed by Chance Thomas.\n• FEROCIOUS BATTLES: from the sewers of Nuln to the ruined streets of Praag, fight your way through monster hordes using over 180 different powers. Activate your bloodlust, a devastating skill, to escape the most perilous situations.\n• 4 CHARACTER CLASSES, each with unique skills and customisation: a soldier of the Empire who can take heavy damage, a Dwarf specialising in melee combat, a High Elf who deals ranged damage by manipulating magic or a Wood Elf who lays deadly traps and wields the bow like no other!\n• AN XXL BESTIARY with over 70 monsters aligned with the Chaos Gods and unique bosses. Battle Nurgle's minions, Khorne's spawn and waves of other vile creatures!\n• OPTIMIZED FOR CO-OP: solo or with up to 4 players, local or online, the class synergy and interface have been designed for co-op. Combine different skills and powers to create even more devastating effects.\n• HIGH REPLAY VALUE: Story mode, a boss rush mode, countless dungeons and regular updates offer a rich and varied gaming experience. And with 10 difficulty levels, you can find the right challenge to test your abilities.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Eko Software","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":62558,"name":"Prismata","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83a/83a437aa1bd73d45c25aba54eabda56c.jpg","description":"Free Upgrade to the Founder's Edition!All players who purchase Prismata during our Early Access period are eligible for a free upgrade to our Founder's Edition, which includes the complete 5-episode single player story campaign and a load of other perks. Just grab the \"Prismata: Founder's Edition\" bundle to claim your upgrade!\nItems included in the Founder's Edition include:\nPrismata Single Player Campaign Episode 2: Recombination (out now)\nPrismata Single Player Campaign Episode 3: Keystone (coming in June 2018).\nPrismata Single Player Campaign Episode 4: Lockdown (coming summer 2018).\nPrismata Single Player Campaign Episode 5: Pulse (coming summer 2018).\nThe golden pass—unlimited free golden boosts.\nAn equippable in-game \"supporter\" badge.\nA permanent 20% Ranked Play cosmetic loot bonus.\nThe \"Sweet Treat Steelsplitter\" unit skin.\n2000 shards and 5 Power Cores (for unlocking skins/emotes.)\nNote that none of these items provide any advantage in competitive play.\nAbout the GamePrepare yourself for the ultimate strategy game.\nPrismata—the gripping debut from Lunarch Studios—radically redefines the strategy genre by combining elements of real-time strategy, card games, and tabletop strategy games to create something entirely new and unique.\nCompeting against other humans or ruthlessly efficient AI, you'll plan devastating attacks through a series of quick-fire turns. Will you outwit your opponents by striking at the perfect moment? Or will you fall victim to a devious trap?Game Modes Campaign: an enthralling 40-mission story-based single player adventure\nCasual Match: play friendly games against other humans or one of 30 different AI personalities\nCombat Training: over 50 hand-crafted puzzles and scenarios dripping with fascinating strategy insights\nRanked Play: get paired against opponents of similar skill and compete for a spot on the leaderboards\nCustom Games: play bots or friends with fully editable unit pools, time controls, handicaps, AI difficulty, and more\nExpert Challenge: ultra-difficult mission variants for players seeking extreme challenges\nEvent Mode: heart-pounding blitz brawl tourneys and crazy mode-of-the-week events with prizes\nThe StoryHundreds of years in the future, humans have engineered a prosperous new civilization on the distant planet Beacon, where the sun never sets. Meanwhile, the planet's frigid dark side has been colonized by an enigmatic faction of intelligent machines that threaten humanity with conflict.\nIn these new cybernetic times, human soldiers are obsolete. Instead, warfare is conducted swiftly with massive armies of robots. The Swarmwielders—human commanders of these mechanical forces—are the defenders of society, training relentlessly for the day when the machines strike again. However, when their own robots start to mysteriously malfunction, the humans find themselves endangered by something much closer than the machines lurking beyond the fringe.\nFeatures State-of-the-art enemy AI created by Professor David Churchill, winner of the 2013 StarCraft AI competition\nA custom replay browser where you can watch, share, and analyze game replays\nNew Prismata units added regularly, each with a unique role and purpose in combat\n100+ Steam Achievements to unlock\nReal-time spectator mode: watch live matches featuring top players\nAbsolutely zero pay-to-win—no card packs to open; all units are free for all players\nOver 500 customizable emotes and 250 awesome unit skins to collect\nNo randomness! Your fate is determined by your skill alone\nOver 100 trillion unique gameplay scenarios, each with a different optimal strategy to discover\nGameplayIn Prismata, you’ll collect resources, create workers and technologies, assemble an all-conquering army, and trade blows with your opponent until one of you is obliterated. Prismata blends elegant turn-based mechanics with the tactical decision-making elements that are at the heart of real-time strategy games.\nFeaturing simple and intuitive economic and combat systems, Prismata is incredibly easy to learn. However, no two Prismata matches are ever the same. Every game, players get a new pool of extra buildable units that must be used to their fullest potential. There are always new builds to plan and discover, and new threats to respond to. Each battle is fresh and unique.\nContaining no pre-built decks, random advantages, or luck-of-the-draw moments, Prismata’s cat-and-mouse duels celebrate quick-fire tactics, deep thinking, and decisive strategy. Will you execute a perfectly-timed attack, or will you build up a monstrous economy and overpower your opponent with a massive army?Testimonials from supporters and Kickstarter backers:\"Almost nothing comes close to achieving this level of polish, depth, and replayability.\"\n- Kevin \"qxc\" Riley, retired StarCraft pro-gamer and game designer\n\"Full skill, full focus, no RNG. It is beautiful!\"\n- Adrian \"Lifecoach\" Koy, Hearthstone and Gwent professional\n\"It's so good. I wake up and I'm like 'Yes, I get to play this game again.' I love it.\"\n- Frederick \"Freddybabes\" Bird, Gwent Challenger, Open, and Slam champion\n\"I'm over-the-top addicted. Best game I've ever played.\"\n- Mike \"Timex\" McDonald, poker professional\n\"A game I have been looking for all my life.\"\n- Steel_hs\n\"One of the most intricate, well-thought-out, and best games I have ever played... the first and only game of its unique genre.\"\n- Rachenite\n\"More worthwhile than any other game.\"\n- Aetherllama\n\"Truly unique in its ability to refine RTS and card game themes down to the core strategic decisions without the RNG or APM.\"\n- DiamondGP\n\"Finally, a card game that removes the ‘luck’ aspect.\"\n- hepcecob\n\"When I start Prismata, it feels like my inner child is opening a bottomless toy box that's always holding something new and exciting.\"\n- daxtrax\n\"I honestly feel like a genius after I play a good game.\"\n- DDarkray\n\"Prismata is very approachable, yet there's always more to learn.\"\n- zihkrihk\n\"I'm a filthy casual and I love playing a quick competitive game.\"\n- RupertE\n\"10/10 strategy game! Phenomenal concept, unlimited replay value.\"\n- 4nonym0u5\n\"Why did I even bother with those other games.\"\n- arisuMizuki\n\"I feel fortunate to live in the age of Prismata—the best game I've ever played.\"\n- Gameking511\n\"No mortal has 400 real APM. That's why we play Prismata, and leave StarCraft to the demigods.\"\n- jrkirby\n\"If you ever thought you'd be great at StarCraft if only you had the APM, now you can prove it.\"\n- Lenor4ever\n\"After 3 years and 11,000 games, I'm still innovating new strategies, and I don't expect that to ever stop.\"\n- Apooche\n\"Prismata is the best thing that ever happened to me.\"\n- Arkanishu\n\"It's as good as they say.\"\n- Naitso","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lunarch Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17674,"name":"Weird Worlds: Return to Infinite Space","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67e/67ed02eae8de073929c3d0809f60c65b.jpg","description":"Weird Worlds: Return to Infinite Space is space-strategy exploration game, a sequel to Strange Adventures in Infinite Space. \n\n###Gameplay \nYou play as a commander of the spacecraft on a mission to explore a part of the galaxy. You explore the map from the top-down perspective.\nThe galaxy layout is procedurally generated each time you start a new game. You have the freedom to explore the galaxy at your pace. The game does not force you to follow your initial task. Different planets can contain useful items or be a home for an alien race. There are several types of aliens, some of them are friendly a let you trade with them, and some are hostile and trying to attack you. The battles are real-time and require both right equipment and strategical usage of it to win. Space is filled with black holes that can destroy your ship or slow down time for you. \nThe game’s main feature is that it is strictly time-limited and each new playthrough takes up to half an hour. After the time is over, you either return to your home or vanish in outer space. \nThe game offers three different roles for you that affect your initial mission and equipment: military ship, pirate or science ship. The military ship allows you to carry more weapons, while the science ship has a scanner that allows getting information about aliens in nearby systems from the safe distance.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Digital Eel","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15198,"name":"King's Bounty: Warriors of the North","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dff/dffd5c251998e28db27c344e58998647.jpg","description":"King’s Bounty: Warriors of the North is the next chapter in the cult RPG/adventure saga. The new tale takes place in the familiar world of Endoria featured in the previous games, but begins in the Viking lands, which the celebrated hero Bill Gilbert never visited during his famous quest in King’s Bounty: The Legend.\nThe Mighty Olaf, son of the Konung of Northlings, has dedicated his life to battling the undead who have infested the northern lands of Endoria. He seeks to liberate the snowy wastes, dwarven dungeons, and the very heart of Endoria, the kingdom of Darion itself, from the dark grip of necromancy. On his quest towards immortal glory he will encounter cunning foes and new friends, hard battles and amazing adventures.Key FeaturesThe unique race of furious Vikings, as well as new neutral creatures;\nNew main hero - Olaf the Viking;\nValkyries! Five magnificent warrior maidens accompany Olaf, which he can call up during battle by expending his Rage points;\nImproved skill tree and new unique talents;\nNew awards that grant special benefits;\nAdditional battle spells and a completely new magic school - Runic Magic;\nModified battle system based on the use of Runes;\nChant - a unique ability of the Skald class which can turn a likely defeat into an overwhelming victory;\nThe ability to forge new items;\nFull Steam services integration, including Steam Cloud, Achievements and Leaderboard.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"1C-SoftClub","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13530,"name":"Aura Kingdom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/739/7391608c2eea1fce7519adee05364067.jpg","description":"Aura Kingdom is a majestic new MMORPG published by Aeria Games. From the developers of popular fan-favorite MMOs like Eden Eternal and Grand Fantasia, Aura Kingdom uses state-of-the-art graphics and a detailed anime art style to depict a sprawling fantasy world for players to journey through.\n\nGuiding a hero from humble beginnings, players will soon discover a menagerie of loyal companions that will prove to be invaluable in their journey. They will quickly become a players best friend as they make their way through a myriad of environments and take on formidable foes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"X-Legend Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]}]