[{"id":282882,"name":"Through the Darkest of Times","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/174/17474950cb5c8248b1c603979b2b3537.jpg","description":"Through the Darkest of Times\nA strategy game, where you take the lead of resistance group in Berlin during the Third Reich. The game covers the entire time from Hitler’s seizure of power 1933 to Germany’s unconditional surrender 1945. You plan actions of your group while at the same time try to balance the morale of your members, get resources needed for the actions and avoid getting caught by the Gestapo (Germany’s Secret Service Police during the Third Reich).\nBig political events follow the actual historical time-line and influence your options and what happens to your group. Your members are fictional and procedurally generated on each playthrough. They come with different personalities, abilities and views. As leader of the group, it’s your job to fight the regime by winning hearts and minds of the people, holding your group together and leading them through the darkest of times.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Handy Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":46165,"name":"Fight'N Rage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/90e/90eed978c827e31cbe576cff0a083909.jpg","description":"Description\nFight’N Rage is a brand new old-school side-scroller beat’em up. Inspired by the classics from the “golden age”, and with an art style that mimics the aesthetic from the 90's arcade gems, this game pays homage to all classic gameplay features that makes this genre one of the best from its time!Details\nGenre: Classic 2D side-scroller beat’em up / brawler.\nNumber of players: From one up to three players local co-op.\nAvailable languages: English and Spanish.Features\nA lot of Combinations: Alternative paths, cutscenes and endings that can change based on the selected characters and your own decisions!\nFast and intense single-session gameplay: Each possible route in the arcade mode can be finished in less than one hour! (at least if you have mastered it.)\nExplosive Combo System: Characters are capable of performing several skillful juggle-based combos that can make your enemies blow up into pieces!\nSimplified Controls: Using only three buttons (attack, jump and special attack), you will be able to combine lots of movements in order to perform amazing combos!\nEasy to Play, Hard to Master: Difficulty is not about bad controls or unfair rules… it is about mastering your character’s moves and dealing with tough enemies!\nLocal co-op mode: Up to 3 players with optional friendly fire (which is even more challenging!).\nCustom Display Modes: Display settings includes optional CRT feels, scanlines and various color styles and more!\nLots of Unlockables: Earn in-game coins with your scores and get extra content like character’s costumes, extra difficulty settings, more gameplay speeds, new game modes, new characters to use on these modes and much more!\nPlay as Enemies: More than 20 unlockable characters to play in the extra modes!\nTraining Mode: You can practice a lot of techniques and combos while earning new belts! Are you good enough to get the Black Belt?\nDifferent Weapons: Each protagonist handles them in their own way.\nSpeedrun Timer: An exclusive in-game gadget compares current stage times against your best ones! (Of course, the cutscene time does not count, in order to let your fingers take a break… believe me, you will need that.)\nFully Skippable Cutscenes: All cutscenes can be skipped or fast-forwarded in order to provide an (even more) intense gameplay.\nFair Score Rules: There’s no easy way to increment your score while playing… the score is directly related to your skills.\nVS Mode: Perfect to play one vs one battles against another player or the CPU, or simply watch CPU vs CPU battles.\nParry System: A parry system lets you take the advantage even in the most dangerous situations!\nReal challenges: It is all about how good you are at the game, not about an “exp” system or other RPG elements that reward your patience. The full moveset of every character is available from the start, so, you do not have to worry about leveling-up anything except your own skills as player!\nAdditional Insane Difficulties: Near impossible extra challenges for pro-gamers (which are not mandatory to unlock all game content).\nExtremely Polished Gameplay: The playability is focused on fully responsive controls and intuitive commands. The characters can cancel normal attacks into special attacks, release themselves from enemy grabs and perform several chain movements. You will feel the power of controlling a character that perfectly responds to your actions!Story\nIn a far future, Earth was devastated by mutants who took control after a worldwide catastrophic event known as “the big pulse”, a global scale electromagnetic pulse that put an end to all electronic technology on the planet. Humans are now enslaved by mutants led by “The Boss” in a world ruled by “the law of the jungle”.\nHowever, not everything is lost… two humans and a mutant rebel are willing to fight in order to stop this madness. Will they be strong enough? Well... that's up to you!Main Characters\nGal: A girl who escaped from traders of humans. She’s an expert in her own kick-boxing-derived martial art. While her attacks don’t have a long reach, her speed and agility have no equal and her technique and endurance are pretty good too. She is capable of avoiding almost every attack, an ability that comes in handy when facing multiple foes.\nRicardo: A minotaur human-rights activist and a powerful wrestler. He’s not very fast and his technique isn’t as good as his comrades’, but he has a pretty long reach, and his power and endurance are amazing. He’s capable of destroying any enemy in record time!\nF. Norris: A runaway ninja whose past is a mystery. He’s the one who mastered the ninjutsu style known as “the forbidden technique”. While he might be pretty fragile compared to Gal or Ricardo, he has a great combination of reach, power and speed, plus an amazing technique that (when mastered) can take control of any situation.Credits\nAll the game (graphics, design and programing) was created by Sebastián García, while the full OST (composed of more than 40 great tracks!) was created by Gonzalo Varela.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"sebagamesdev","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":499258,"name":"Midnight Fight Express","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd2/cd28a066e3a8d602e1ebbff8111fd10a.jpg","description":"Fight your way across the city in a brutal romp that mixes old school brawlers and fast-paced motion-captured combat. Battle across multiple, distinct hand-crafted levels on foot or a variety of vehicles","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Jacob Dzwinel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":61645,"name":"Secret Neighbor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae1/ae1d93f1c29850a246cd6480a7b8ebdf.jpg","description":"Events take place between Act 1 and Act 2 of Hello Neighbor.\nA group of kids are trying to break into their suspicious Neighbor's basement to rescue their missing friend. Only problem is that one of the kids is a traitor - a Secret Neighbor in disguise. His job is to gain the trust of other players and betray them. Kids win if they get into the basement.\nPlaying as a child:\nCollect keys\nSave you friends from the Neighbor\nCooperate but don`t trust anyone\nIf you are lucky enough to play as Neighbor\nThe house is your territory! Use it to separate, scare and confuse intruders.\nUse your gadgets to get advantage over the kids' team.\nGain trust amongst your foes and attack in the right moment.\nProtect your basement!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"tinyBuild","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":19881,"name":"Flesh Eaters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/816/816e0c769b29a66c053c21e15033f022.jpg","description":"Flesh Eaters is a real-time strategy zombie survival game developed by 16 Bit Nights. There is no plot present in the game. Just plain old survival.\n\n###Gameplay\nFlesh Eaters features a retro pixel-art style. The game revolves around controlling a team of survivors that defends their shelter, goes out for scavenging resources and staying together.\n\nIt is necessary to build up your defenses as zombies profoundly affect the team's morale. If the morale falls too low, the team's members might attempt suicide, or refuse the orders you give them. It is possible to level up your survivors. Upon leveling them up, their health, morale, and weapon handling skills get increased.\n\nEach survivor has their own skills. It is possible to hire a medic to treat the team's wound, a soldier to defend a specific area assigned to them, or an engineer to build up the base defenses. The medics and engineers can only equip melee weapons, while only the soldiers can only equip armor sets and firearms.\n\nThe players have to get out their hideout to get new supplies such as food, water, and ammo. It is possible to find new weapons and armor during such scavenger raids. The weapons you find can be further upgraded by an engineer. Upon upgrading, the weapons might acquire a rare damage stat, that will one-kill any zombie you find in the game, yet the chance of that happening is very low.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"16bit Nights","platforms":[{"id":0,"name":"PC"}]},{"id":10357,"name":"The Lion's Song: Episode 1 - Silence","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c3/0c3dd7df5f8aa5012cc6d8c46a57a1e6.jpg","description":"„The Lion's Song: Episode 1 – Silence\" tells the story of Wilma, a talented young musician student. Wilma’s talent was discovered by Arthur Caban, a wealthy university professor, who invited her to Vienna. Arthur is profoundly convinced Wilma is going to play a major part in the future of modern music. Since Wilma is fighting writer’s block trying to finish her career defining composition, Arthur sends her to a solitary alpine cabin to recover her inspiration and muse.\nWill Wilma be able to finish her breakthrough composition in this small cabin, surrounded by high mountains and stormy weather? In her creative crisis Wilma suddenly has an unexpected encounter.\nThe choices players make in this episode will have a direct impact on the storylines of all episodes and ultimately determine if the protagonists find the success they are working for.\nPlease take also a look at the other episodes from The Lion's Song:\nhttp://store.steampowered.com/app/477030","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mi'pu'mi Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4037,"name":"Guilty Gear XX Accent Core Plus R","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/316/31651e0ec39c6718c5136ab624431e7f.jpg","description":"Ultimate battle action!Using the previous installation, \"GUILTY GEAR XX ΛCORE CORE\" as the base, players can perform \"Gatling combos\" by simply pressing attack buttons in sequence; or launch their opponents into mid-air with the overhead \"Dust\" attack; or cancelling their character's current motion to allow for more follow-ups with the \"Roman Cancel\"; keeping everything that makes a GUILTY GEAR game, while fine-tuning everything to reach optimal balance!Full 25 characters cast!Accent Core Plus marks the return of fan favorites Kliff Undersn and Justice, rounding out the cast of 25 playable characters. And in the latest Plus R version, they have been fine-tuned for more competitive play!Refined skills, polished strategiesBased on the large amount of players' feedbacks on the previous installation, \"GUILTY GEAR XX ΛCORE CORE\", all characters have been closely examined and further tweaked for optimal battle performance! The entire cast have their core concepts revised and re-evaluated; balances are in place to bring out the most variation among the cast, with the ultimate aim to liven up the heat of every battle!\nDevise new strategies with each character as you play!Multiple game modesAll-time favorites \"Survival Mode\", \"M.O.M. Mode\", \"Training Mode\" and \"Mission Mode\" all included! In addition, you can view over 100 special illustrations in the \"Gallery Mode\" by various artists!Ranked Match & Player Match Online ModesPlayers can test their strength online, with the 2 network matching modes \"Ranked Match\" and \"Player Match\"!\nRaise your rank with each win from the \"Ranked Match\" mode! Or, you can simply have fun online with your friends with the \"Player Match\"! Wins and losses are not recorded here, so you don't have to worry about a bad record!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arc System Works","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":2480,"name":"Shadow Complex Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/025/025d2c20f235272e8ed4bede370446b2.jpg","description":"Powered by Unreal Engine technology, the “modern and masterful side-scroller” Shadow Complex became an instant classic when initially released in 2009, exclusively for Xbox 360. The fan favorite won more than 50 Game of the Year and Editor’s Choice Awards and was one of the most popular console games of the year. Shadow Complex Remastered features all the great content from the original game updated with exciting new enhancements and achievements to support its debut on Steam.\nGiant Bomb - \"5 out of 5 Stars - Amazing from start to finish!\"\nIGN - \"The classic, exploration-heavy gameplay is a winner.\"\nGameSpot - \"An incredible adventure that won't be forgotten.\"\nWorthplaying - \"A love letter to Super Metroid\"\nGame Play Overview:\nChAIR’s fresh twist on classic side-scrolling design with modern, cutting-edge gameplay is amplified in Shadow Complex Remastered, featuring all the content from the award-winning original game, updated with graphical enhancements, all-new dynamic melee take-downs, and additional Achievements and Master Challenges.\nThrough 10+ hours of exploration and fast-paced combat, you’ll discover game-altering power-ups to overcome obstacles, thwart legions of enemies, and delve further into a mysterious and challenging, non-linear game world.\nCore Game Play Elements:\n- Original single-player experience inspired by classic non-linear exploration side-scrolling genre\n- Open world design that evolves as the player explores and progresses through the game\n- Huge, mysterious game world populated with legions of enemies, challenges, and jaw-dropping boss battles\n- Dozens of unique game-altering power-ups and more than 100 additional items and enhancements to discover\n- Intense game play infused with a compelling action-thriller storyline\n- Incredible graphics with robust physics, made possible by Epic Games’ Unreal Engine 3\n- Bonus Proving Grounds game mode provides side-challenges to help players become the ultimate Shadow Complex master\nUpdated Features:\n- Up-rezzed characters, enemies, environments, and interface\n- Updated lighting, post-processing, and visual effects\n- New contextual melee take-downs\n- New Achievements and Master Challenges\n- Supports keyboard/mouse and PC controller with customizable controller and key bindings, and up to 4K resolution support\nStory Synopsis:\nShadow Complex propels lost hiker Jason Fleming into the hollows of government conspiracy, dark political motives, and military upheaval. When Jason and his girlfriend Claire accidentally stumble upon a rogue paramilitary group called The Restoration, it soon becomes clear that the faction’s intent is to set in motion a chain of events that will cause America to collapse into a new civil war. Along the way, Jason acquires many high-tech “toys” The Restoration is developing, and eventually becomes a super-powered engine of destruction.\nFollow Shadow Complex for the latest updates, discussions and more:\nForums: https://www.epicgames.com/shadowcomplex/forums/\nFacebook: https://www.facebook.com/Shadow-Complex-167583452520/?fref=ts\nTwitter: https://twitter.com/shadowcomplex\nTwitch: http://www.twitch.tv/shadowcomplex\nInstagram: https://www.instagram.com/chairgames/\nYoutube: https://www.youtube.com/user/TheChAIRGAMES","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5677,"name":"The Chronicles of Riddick: Assault on Dark Athena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9fd/9fd154d9405fba7b6718aa46a46aa82a.jpg","description":"Be Riddick, the most ruthless criminal in the universe. In his latest chronicle, Riddick has been captured by The Dark Athena, a mercenary ship hell-bent on eliminating him once and for all. Using his intense hand-to-hand combat skills, explosive firepower, and lethal stealth, Riddick must shut down the maniacal Captain Revas and her deadly crew. When Riddick steps into the darkness, no one is safe.\nBefore battling the Necromongers on Helion Prime even before the crash landing of the Hunter-Gratzner on a deserted planet in Pitch Black Riddick stalked his enemies across the universe. Play the award-winning Escape from Butcher Bay campaign, which has been re-mastered with top of the line graphics specifically for next-gen systems.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Starbreeze Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4284,"name":"SSX","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/566/566c25b3814c8b35bce7375e22d11748.jpg","description":"SSX is the return of the beloved franchise on the current generation of consoles where you can own the Planet across real-world iconic mountain ranges, compete and compare with friends online in totally new ways, and defy reality on a snowboard through Race it, Trick it and Survive it events.  Defy Reality and Own the Planet with SSX.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\n© 2012 Electronic Arts Inc. EA, EA SPORTS, the EA SPORTS logo and SSX are trademarks of Electronic Arts Inc. All other trademarks are the property of their respective owners. *INTERNET CONNECTION required for online play.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3291,"name":"Shantae: Risky's Revenge - Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0b/d0bd38b1d03f28c65c9b0e242e408214.jpg","description":"By popular demand, Shantae: Risky’s Revenge – Director’s Cut is now available on Steam for Windows PC!  This brand new version combines all of the award-winning content from previous releases – and adds even more!  The pixel-based masterpiece remains intact, newly augmented with HD portrait artwork and extra challenge.  New illustrations, Steam Trading Cards, Achievements, Emoticons, Controller Support, fully configurable controls, and an unlockable Magic Mode with alternate costume round out the package.  This Director’s Cut also introduces a re-imagined Warp System, perfect for speed runners and returning players alike!  Play one of the most critically acclaimed handheld series of all time, now on your PC!\n\nShantae: Risky’s Revenge – Director’s Cut is a powder keg of high octane, hair-whipping, hip shaking action, now available on Steam!  Features thousands of frames of animation, huge multi-sprite bosses, and a quest so big it’s bursting at the seams. Guide “half-genie” Shantae through haunted wastes, burning deserts, enchanted forests, dripping caverns and deadly labyrinths. Discover magical attacks, brew zombie coffee, save golden babies, and master the art of belly-dancing to transform Shantae into more powerful creatures. Use your powers to foil the lady pirate Risky Boots and save Sequin Land from certain doom! With its infectious characters, flirtatious humor and deliciously outlandish action, Shantae: Risky’s Revenge offers up all the hair-whipping, belly-dancing action you can handle!\nAwards:\nMetaCritic: Highest Rated Portable Game of the Year*\nIGN Editor’s Choice\nIGN Best Visuals*\nIGN Best Game of the Year*\nNintendo Power Game of the Year*\nNintendo Power Best Graphics*\nNintendojo Editors' Choice\niTunes Editor’s Choice*(awards for various platforms)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":416034,"name":"Sludge Life","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c3/3c32db726351c9604b1e8c549af2655d.jpg","description":"SLUDGE LIFE is a first-person / open-world / vandalism-centric stroll through a polluted island full of cranky idiots and a vibe so thick you can taste it.\n\nRoam a tiny island stuck on a sludge covered planet as an upcoming tagger GHOST set on staking their claim amongst the graffiti elite. Traverse the corporately branded landscape, chat up other taggers, and discover secrets and idiots along the way. Will you become the king of the island and tag every open inch, infiltrate sludge-pumping corporation GLUG to find a way out, or just take it all down in flames with you?\n\n\n\nExperience the thrills of vandalism from the safety of your computer.\nCuriosity and free will are your only motivators - roll as you please.\nFind and download apps to your laptop and waste your life away playing a game in a game.\nSmoke Ciggy Cigs brand cigarettes. Smoke ‘em up real good.\nTake photos of exotic fauna and ambivalent NPCs.\nDedicated fart button.\nA huge baby, community basketball court, and a cat with two buttholes. [no extra charge]\nThree distinct endings and a pretty robust credits.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Terri Vellmann","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":17921,"name":"NaissanceE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f6/8f608c5aae578bc1e4810921fd9fcd69.jpg","description":"NaissanceE is a first person exploration PC game developed on UDK by Limasse Five with the participation of Pauline Oliveros, Patricia Dallio and Thierry Zaboitzeff.\nThe adventure takes place in a primitive mysterious structure and the game mainly consists to explore and feel the deep and strong ambiance of this atemporal world but platforming and puzzles areas will also enrich the experience.\nNaissanceE is a game, a philosophical trip and an artistic experience.\nThe game is constructed along a linear path punctuated by more open areas to freely explore, some puzzles to solves and some more experimental sequences.\nGoing deeper and deeper in a primitive zone from “Naissance” world, the player will meet entities or mechanical systems. Whether those entities are life forms or pure machines, they react to player presence, to light and shadow and they may open access to the following.\nIf most parts of the journey will require only curiosity and logic, a good control and coordination on running, breathing and jumping actions will help to go through rare but exigent sequences, as an homage to old school die an retry games.\nThe main idea behind the game is to make the player appreciate the loneliness, the feeling to be lost in a gigantic unknown universe and to be marvelled by the beauty of this world. A world which seems to be alive, leading the player, manipulating him and playing with him for any reason.\nImagination is an important key to enjoy and understand NaissanceE. Walking in an undiscovered abstract structure brings questions about the nature of this world, about the meaning of this trip. Evocating and symbolic, the architecture and events will lead player’s imagination to find an answer, if it only matters.\nWarning! This game is not recommended for people with epilepsy.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Limasse Five","platforms":[{"id":0,"name":"PC"}]},{"id":15479,"name":"Overture","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/851/851e812422c3d989508cb594596a8984.jpg","description":"Overture is a rogue-like 2D action game developed by Black Shell Games.  \n \n###Gameplay \nThe game shares many similarities with other rogue-like games. In Overture, you take a role of one of 24 characters and explore the randomly-generated dungeons for loot slaying hordes of monsters and fearsome bosses.\nThere are four types of characters in the game: warriors, rogues, mages, and shamans. At first, you only have one character per type. Like most other games in the genre, Overture uses a permadeath system which means that there is no way to respawn and after you die battling in a dungeon you start next run from the beginning. After game over you gain some amount of money depending on how well you made this time. You can spend it to unlock new characters or upgrade the ones that you already have.  \nYou control your character using mouse and keyboard. The control scheme reminds of twin-stick shooters. You walk with WASD, aim with mouse and attack with mouse buttons. You can also use magic spells and special abilities. The most notable gameplay mechanic in Overture is running away from enemies. To do so, you have to stop attacking and start going in the direction of the mouse pointer. Mastering this mechanic is essential for surviving in the dungeons. Throughout the dungeons, you can find various useful weapons and items that can boost your stats.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Black Shell Games","platforms":[{"id":0,"name":"PC"}]},{"id":61900,"name":"Night Call","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aea/aeaccb51ac50d9e7f9c88d8119740ec1.jpg","description":"A serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and the last person to see the most recent victim alive. These next few shifts will be far from ordinary or safe…\n\nNight Call is an investigative noire game with two goals: solve a murder mystery and make enough money to pay your bills. Your shift starts at night and ends at daybreak, as you try to earn enough to pay for your cab, your apartment, and just make a living. But when the police investigation gets nowhere, the officer in charge forces you to help by doing what you do best: getting passengers to talk in the little time that you have their attention.\n\nThe two roles you must play (investigator and cabbie) each have a set of priorities that may at times conflict with each other. You need to get enough information from the right passengers - but you only have them for so much time. Pick up the right passengers and ask the right questions to obtain new clues. Follow the right leads and uncover new info about the suspects… And never forget that your life is in the balance.\n\nCan you solve the mystery before it’s too late? Better hurry - both the clock and the meter are running…\n\nKEY FEATURES:\n🚖 **GORGEOUS GAME NOIRE STYLE:**  Every character and location are lovingly hand-drawn in stunning black & white, evoking the pure tension of the noire style of art.\n🚖 **A VIVID AND ORIGINAL CAST:** Meet dozens of original, surprising, realistic characters and share their lives for a few brief moments. Listen and help - they might have something useful for you.\n🚖 **INVESTIGATION VS. SURVIVAL:**  Will you forsake information for more money, or sacrifice your income to get the info you need? Make your choices quickly - time is running out!\n🚖 **MULTIPLE ENDINGS, MULTIPLE KILLERS:**  Can you uncover the identity of the killer each time? Be careful: a guilty suspect in one playthrough may be completely innocent in the next.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Monkey Moon","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":29593,"name":"Diablo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/923/923a5dd13b6e79dd23ab2d09934f0e8d.jpg","description":"Traveler, stay awhile and listen...\n\nDarkness stirs beneath Tristram. An ancient evil sweeps across the land, plunging it into civil war and terrorizing the populace. A mad king, his missing son, and a mysterious archbishop are all pieces of the puzzle you need to hack through. You have journeyed to the source of this evil. The town of Tristram - now inhabited only by a handful of survivors, broken and twisted by the madness that has befallen them. A cathedral stands there, built over the ruins of an ancient monastery. Eerie lights and ungodly sounds are heard echoing through its abandoned halls, and that is where you shall venture.\n\nEmbark, if you dare, on a quest to destroy The Prime Evil…\n\n    Experience the legendary action/RPG that influenced an entire genre.\n    Storm Diablo's halls as either a Warrior, a Sorcerer or a Rogue - each with unique skills and abilities.\n    Unite to destroy Diablo - up to 4 players can band together via Internet, or play head-to-head via LAN.\n    Unprecedented replayability - over 200 different monsters inhabit Diablo's ever-changing labyrinth. Equip epic items to conquer fearsome bosses and their minions.\n    A spine-chilling story - experience the horror of a world held in the grasp of The Lord of Terror.\n\n\nAhhh, fresh meat!\n\nTravelers looking for the authentic Diablo experience can play the game as it was in 1996, with period-appropriate 20 FPS SVGA graphics, and the ability to matchmake through the classic version of Blizzard’s Battle.net® online-gaming service.\nFor those wanting something a bit more modern, Blizzard and GOG.COM have collaborated on an updated version of the game tuned for today’s gaming PCs, which includes out-of-the-box Windows 10 compatibility, a host of bug fixes and high-resolution support via aspect ratio-correct upscaling.\n\n    The most voted game on the GOG.com wishlist, finally trapped in a DRM-free soulstone!\n    Return to the beginning of this dark saga, now in digital format for the first time ever.\n    Better value than Wirt's wares, guaranteed.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Blizzard North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation"}]},{"id":15389,"name":"Strife","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f96/f96481281b9e3f62f5d3f64f94fc27ff.jpg","description":"Strife on Steam Celebration!To help celebrate the launch of Strife on Steam, we are unleashing 3 Steam-exclusive packs practically bursting with goodies!\nAdditionally, for the first week only, we will be offering a 10% early-bird discount on Steam purchases!\nDon't want to buy anything? That's cool too! All Strife Heroes are free and they always will be! Strife is truly free-to-play.\nAbout the GameEnter the HeroIn Strife®, you will assume control of a powerful hero. Each hero is uniquely designed to embody a play-style or idea, and heroes are by far the most important aspect of any game of Strife. As a hero, you will decide how the game flows, how quickly it progresses, and whether the outcome is favourable for your team. All Strife heroes are freely available from your very first match!Community FirstHow your fellow players behave matters a lot in online multiplayer games. Strife is designed from the ground up to encourage cooperation and reduce toxic conflicts.Customize Your ArmouryCrafting enables you to change item components and recipes, allowing any item to be part of your arsenal.Every Hero Needs a SidekickA Pet will accompany you onto the battlefield, offering you unique advantages. Play to unlock more pets to expand your options.Shared Last Hit GoldFight your opponents, not your allies. Last Hit bounties obtained from brawler and hero kills are split between contributing teammates.Out of Combat RegenerationStaying out of combat for a short period of time will significantly increase your Health and Mana regeneration, allowing you to stay near the action instead of going back to base.Personal CourierEach player has an invulnerable personal courier to automatically deliver purchased items.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"S2 Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":2858,"name":"Costume Quest 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d9/7d9ce4933d93667a64d9d62cadd3e6a4.jpg","description":"Trick, treat and pick a fight with villianous dental soldiers in Costume Quest 2, the sweet sequel to Double Fine’s hit original, Costume Quest, that turned fans of all ages into candy obsessed crusaders. This inspired RPG adventure includes a range of new features and gameplay improvements to double the amount of mischievous fun. Explore spooky time-traversing landscapes, don adorable new costumes that transform into powerful Hallo-warriors, and collect even Creepier Treat Cards to wield in combat against a legion of hygiene obsessed baddies. Only heroic siblings Wren and Reynold can save Halloween forever!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":274815,"name":"Destiny or Fate","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/269/2697fd618c8083a3eb6de10b75e3d277.jpg","description":"Fantasy rogue-like card battleWe're a big fan of the strategic card battle game from Magic the gathering, Hearthstone, and to Slay the spire. Therefore, the game we're developing also has the main feature of that genre - rogue-like element is also included.\nThe routes and events for your adventure are newly generated each time you play. Consider the strengths of the heroes and monsters in your party and how well they work together before you head for the boss. It may be wiser to collect treasures and cards and recruit heroes first.\nGame over just means a new beginning. On each playthrough, all the features are randomly rearranged. Everchanging gameplay means there’ll always be new surprises. No map is ever the same, and you’ll always lead new bands of new heroes. You’ll always be reborn as a new commander with a different deck of Battle Cards.\nMore than 15 heroes with unique skills\nEvery time you start a new game, you will start your journey with a various heroes. They might have a fearsome attack skill, or might have a healing skill for support your party. The hero character can be improved with specific resources, and they will get a new ability as they get stronger. The hero and card deck will affects to your game play strategic a lot.\nHeroes in Destiny or fate, like the other strategic card game, 'cannot be controlled' by a player. However, you can choose when to use hero's ability by use your card to fulfill specific condition for ability.\nOutside of that, hero has a passive skill which will affects to the whole party of yours.\nBring your own bands\nAll the monsters that you will encounter can be recruited except for bosses. You can play with the most annoying monster you've met as your reliable company. Every recruitable monster can be improved with specific resources, and they will get a new ability as they get stronger.\nGame feature - More than 15 heroes with unique skills\n- More than 150 cards for heroes and monsters\n- Possibilities of hundreds of battles with more than 100 monsters.\n- 3 chapters with generated stages that always offer something new.\n- Discover more heroes, cards, and artifacts in new playthroughs.\n- Capture monsters and recruit them into your party (except for bosses).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Blaster","platforms":[{"id":0,"name":"PC"}]},{"id":19677,"name":"Avadon: The Black Fortress","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ac/1ac8953624b97643e7892ee6963c7c10.jpeg","description":"Avadon: The Black Fortress is an indie role-playing game developed by Spiderweb Software.\n\n###Plot\nLynaeus is divided between two opposing factions - The Pact and the Farlands. The fortress called Avadon is sided with The Pact. It is a small nation of warriors, soldiers, and spies that protect The Pact from any threats to it. Avadon is not bound by the laws of The Pact, however, a major conspiracy within The Pact is revealed by the leader of Avadon, Redbeard. The players step in the shoes of the commander of Hands of Avadon, an elite force under Redbeard's command who investigate the conspiracy.\n\n###Gameplay\nAvadon: The Black Fortress is a singleplayer-only game. At the beginning of the game, the players choose one out of four classes - a Shadowwalker, a Shaman, a Blademaster, and a Sorceress. All these classes differ in their gameplay and play styles. The players can also recruit two characters to complete missions with.\n\nAll the classes have multiple abilities that are unlocked by progressing through the game or completing all the objectives in missions. They focus on damage dealing, healing, inflicting temporary de-buffs upon your enemies or reviving downed party members. There are multiple scripted encounters featured in The Black Fortress that require a certain degree of tactics to be completed successfully.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":10557,"name":"The Mean Greens - Plastic Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb3/fb32ed3152c3643e8bf988b314f7568b.jpg","description":"Take part of history’s greatest battle of Green VS. Tan. Fight amongst and against others online. Jump, shoot and roll your way into victory with fast paced objective based gameplay. Sometimes the greatest battles are fought by the smallest of soldiers.\nThe Mean Greens is a 3rd-person shooter played from the perspective of toy army soldiers. Match up with others online for some friendly multiplayer competition. Enjoy a huge battle of up to 10 players in each environmentally unique map.10 Modes\n10 Maps\n6 Weapons\n5v5 Multiplayer Battles\nFull Controller Support\nVoice Chat\nText Chat\nParty Matchmaking\nDedicated Servers\nWhat does a bathtub, sunken boats, rubber ducks and a giant octopus have in common? The Mean Greens Bathtub Bash that’s what! Hop onto the floating rubber ducks and ride to the sunken ships in the middle of the map. Avoid crossfire, grab a flag off of the ship, and carry it to your base. The team with the most flags at the end of the round wins.\nIt’s game night! As The Mean Greens battle against each other in an all-out paper-craft war, more than dice will roll across this table. Go head-to-head as tan and green teams fight for control of the city. The objective is simple, be the first team to reach 30 kills.\nEven a beautiful aquatic adventure has its dangers. Run over aquarium décor and capture flags in sunken ruins as you square off in an underwater playground. Fight your way across the duel bridges to steal the flag that sits in the sunken temples.\nThis map puts a whole new twist on the traditional capture the flag mode with its “Low – gravity” action and captivating nautical theme.\nIt’s full on war to conquer the countertop in this decked out kitchen! Push the other team’s cup off the counter and destroy their only way to zipline into your territory.\nThe mood is a bit chilly as you fight your way through this food-filled freezer. Everyone melts the ice cube in the center to get to the lower level, and then it’s a mad rush as you try to free your frozen dinosaur before the opposing team releases theirs.\nThis train is leaving the station with or without you! Enjoy this Christmas themed level while you travel over holiday sweets to claim your capture points on this nostalgic toy train. It’s tug-of-war, as both tan and green teams battle back and forth to maintain control of all three capture points.\nThis farm style soccer match is a new take on Foosball that you’ve never experienced before. Shoot, blast, and push the ball into the enemies’ barn to score the most points. Don’t drop the ball and watch out for the moving 3-rod pigs and cows.\nGot game? Explore a colorful world on top of chessboards, boxes, and racetracks. Hold the center of the map in this traditional King of the Hill game mode.  Just don’t get hit by the other team or the racing cars.\nIt’s birthday time, but the other team is full of party-poopers that don’t want the festivities to begin. Fight your way up the cake and start the celebration by lighting all the candles on each layer. The attacking team must jump from the gelatin launch pad and onto the multi-layered cake to light each candle. The defending team must fend off the other team’s attempts to light each wick until time is up.\nTurn the tables on your opponent in this death match. Be as crafty as you can to survive and mark your territory. Perfect the art of combat and chalk up those points to make it into the Champions Circle!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Virtual Basement","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":8062,"name":"Hexcells","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5a/c5aeaed5c1c58e57de76341ed746345b.jpeg","description":"Hexcells is an ambient logic puzzle game for PC, Mac and Linux.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Matthew Brown","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":61377,"name":"The Stillness of the Wind","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ce/0cef0abb92096dc21bd1d41b41b72ac6.jpg","description":"One by one, everyone left the once bustling village for the city. Everyone, except Talma. Now approaching the end of her days, she maintains a simple, solitary way of life, surviving, subsisting, tending to her homestead and her goats.\nDevelop your own personal routine as you care for your farm and your animals. Tend to your goats, make cheese with their milk, collect eggs and cook meals, grow vegetables and barter with the travelling merchant who brings increasingly disturbing letters from your family in the city.\nA follow up to the critically acclaimed Where the Goats Are, The Stillness of the Wind is a quiet rumination on life and loss.\nBreed and look after your goats, make cheese from their milk, grow vegetables, water your plants, collect eggs, scare off the birds. It’s a hard but simple life of peaceful subsistence.\nThe travelling merchant brings letters from your family and friends and with them a view into a city that feels both very far away and as if it threatens to wash away the world you know.\nIt's up to you how you spend Talma’s time each day and what your routine will be. Focus on your chores, wander in the desert, reminisce about the past or draw patterns in the dirt.\nTrade cheese and other items in return for hay for your goats, seeds to plant, fables, exotic items and shotgun shells, whilst exchanging conversation with the travelling merchant, your only human interaction.\nWhere the Goats Are was Memory of God's first game. The Stillness of the Wind will be a follow up, expanding on the original concept.\n- - -\n\"While Tikvah and her goats might meet an ultimately tragic end, the fleeting, quiet moments before this asked me to appreciate the small things while I could. \"\nLewis Gordon, Waypoint\n\"Where the Goats Are seems to unfold like a tableau.\"\nStephanie Chan, GamesBeat\n\"I like its simplicity, and the solace that comes from designing your own daily routine.\"\nSamuel Horti, Rock Paper Shotgun","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Fellow Traveller","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":3855,"name":"NBA 2K14","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/872/8721094b44212218051621bc6fbee27d.jpg","description":"NBA 2K14 is the ninth installment in the 2K series of basketball simulators. This game is centered around LeBron James, the famous player from the Miami Heat club.\n\n###Modes\nThe game has a traditional MyCareer mode as well as an arcade mode. It also features a variety of online multiplayer modes.\n\nThere are two new modes introduced in NBA 2K14. The story mode, called \"LeBron: Path to Greatness,\" was inspired by Jordan Challenge mode from the NBA 2K11. It follows an imaginary version of LeBron's career, in which the players control LeBron in a sequence of matches. The other mode, Training Camp, is a tutorial mode that allows the players to get used to controls\n\n###Changes from previous games\nNBA 2K14 didn't change much since the previous parts of the series. Besides the aforementioned new modes, there are a few slight additions. The AI was improved to become less predictable, especially while defending. The controls now include a pass assist option that allows the players with the perfect timing to perform precision passes. The game introduces European league teams, although they do not have a separate mode.\n\n###Soundtrack\nLeBron James has personally selected the playlist for the game. It includes mostly hip-hop music by artists such as Kanye West, Kendrick Lamar, Jay Z, and Eminem, but also a few pop-rock songs by Imagine Dragons, Coldplay, and Phil Collins.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2K","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":51292,"name":"Russian Fishing 4","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3a/d3aa4dc06b2ace5f936c2c94f3e421cc.jpg","description":"Russian Fishing 4\ndynamic and engaging fishing simulator that features unique natural physics, conditions and fish behavior.\n50+ Fish species.\n8 Lakes and rivers.\nSpinning, Bait casting, Feeder and Float fishing.\nPlayers ratings, achievements and statistics.\nDozens of fishing techniques.\nBait crafting and Harvesting.\nSkills development and progression.\nComplete player freedom in game world is the core feature of «Russian Fishing 4».\nTake your time to discover many stunning locations and find your very own perfect fishing spots.\nGain your knowledge and develop your skills to apply them in setting up any kind of fishing rig and catching that special trophy you’ve been searching for.\nTremendous amount of fishing gear, equipment and fish species awaits you in your journey into the world of «Russian Fishing 4».\nAbove all, «Russian Fishing 4» constantly evolves, so there will always be a place for the unknown.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Russian Fishing","platforms":[{"id":0,"name":"PC"}]},{"id":29227,"name":"Ashen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dda/dda3cb07abd07d5b44f46fbd7c9533e7.jpg","description":"Ashen is an action RPG about a wanderer in search of a place to call home. This is a world where nothing lasts, no matter how tightly you cling to it. Players may cross paths with one another, and choose to guide those they trust to their camp, encouraging them to rest at the fire and perhaps remain. When someone joins your settlement, they come with unique skills and crafting abilities to bolster your chances of survival. Together, you might just stand a chance.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"A44","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":18097,"name":"Duskers","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/772/772ca4d6d009c3d2f20efd19a982d4c2.jpg","description":"In Duskers you pilot drones into derelict spaceships to find the means to survive and piece together how the universe became a giant graveyard.ExploreYou are a drone operator, surrounded by old gritty tech that acts as your only eyes and ears to the outside world. What you hear comes through a remote microphone. What you see is how each drone sees the world. Motion sensors tell you something's out there, but not what. And when you issue commands, you do it through a command line interface.AdaptYou have to earn everything in Duskers, scavenging drone upgrades, drones, and even ship upgrades. But dangerous creatures lurk in these derelict ships, and weapons are rare, so you may need to think of a clever way to explore a military outpost using only a motion sensor and a lure.\nBut even if you find a way, the sensor that you rely on may  break down, or you may run out of lures, even your drone's camera feed can start to fail.  A favorite strategy can't be exploited for long, so you'll have to continually adapt.SurviveDuskers is set in a procedurally generated Universe, and when you die you lose everything. You not only need to worry about what hazards lay waiting for you in the derelicts, but also running out of fuel, or parts to modify your drones and ship.\nYou are alone, isolated in the dark reaches of space. Only by sifting through what ship logs remain un-corrupted can you piece together what happened.\nFeatures\n- Use a Command Line Interface to control drones & ship systems\n- Explore procedurally generated derelict ships and universe\n- Upgrade and modify drones with the salvage you find\n- Discover ship logs and piece together what happenedAbout UsWe previously made A Virus Named TOM and then were fortunate enough to get Indie Fund to help us fund Duskers. More about us HERE","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Misfits Attic","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16990,"name":"Mount Your Friends","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd3/cd3ef14c10c1e66df8fcc0847e044250.jpg","description":"Experience the extreme simulated sporting sensation that's sweeping our digital nation! Mount Your Friends is a fiercely competitive sporting event for you to play with your friends in the contextual security of your own home, assuming that your home is not composed of sexual innuendo. If it is, we may suggest buying a new home or at least getting the current one cleaned professionally.\nMount Your Friends is a physics based competitive climbing game where what you climb is each other. Players take turns climbing to the top of a tower of previous climbers (and a goat) working to become the new highest point before time runs out. If you run out of time before reaching the top, you're eliminated. It's simple to get into, but difficulty to master. Adept competitors can create massive towers by flinging themselves faster than simple climbing methods can attain. Of course, you may also end up just falling all the way down a tower if you miss!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stegersaurus Software","platforms":[{"id":0,"name":"PC"}]},{"id":52372,"name":"Pokémon Ruby, Sapphire, Emerald","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e5/7e56cc0421adcea354ed6b85057f2caa.jpeg","description":"The race to catch 'em all is on again in Pokémon Ruby. This entry in the Pokémon series features an all-new storyline, awesome new Pokémon, and addictive RPG gameplay. One of the biggest additions to Pokémon Ruby is the two-on-two battle system, which allows you to link up with three friends to battle competitively or cooperatively. You can also showcase your Pokémon's coolness, beauty, cuteness, smartness, and toughness in Pokémon contests. With new Pokémon, two-on-two battles, and an all-new region of Hoenn to explore, Pokémon Sapphire takes the Pokémon experience to the next level.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Game Freak","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":272483,"name":"Whispers of a Machine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1e/a1e4ac4a6250cd633e760a10de4bde19.jpg","description":"Whispers of a Machine is a Sci-Fi Nordic Noir that tells the story of Vera, a cybernetically augmented special agent tasked with investigating a string of murders.\n\nDue to the wounds of our past, AI is outlawed and now nearly non-existent. However, as the threads of Vera’s case begin to unravel, she is pulled into an invisible war between two opposing forces — those who are intent on destroying AI, no matter the cost, and those who seek to awaken it again, regarding it a lost deity in a godless world.\n\nTo help in her mission, Vera has been equipped with an advanced nano-substance called Blue. This rare and sought-after technology allows her to develop superhuman abilities adapted to her psychological mindset.\n\nChoose your methods and utilize these augmentations to investigate, gather information, and solve puzzles with solutions shaped by your choices.\n\nIn this gripping story with existential twists and multiple endings, what Vera uncovers will have monumental consequences for humanity — will we be able find a way to peacefully coexist with AI, or will one of us inevitably destroy the other?\n\n• INVESTIGATION, AUGMENTED: Will Vera approach situations with a more empathetic, analytical, or assertive style? Your choices will impact her augmentations and subsequent puzzle solutions.\n\n• A POST-AI FUTURISTIC DYSTOPIA: Immerse yourself in a realized world of beautifully hand-drawn pixel art design and gorgeous settings influenced by the Nordics.\n\n• POINT-AND-CLICK INNOVATION: A groundbreaking entry to the point-and-click adventure game genre by the experienced developers of Kathy Rain and The Samaritan Paradox.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Raw Fury","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":5611,"name":"Need for Speed: ProStreet","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/269/269cd0c0a196e87ece216b534813df50.jpg","description":"Compete at the highest level of street racing with Need for Speed™: ProStreet. It's no longer good enough to simply rule your local neighborhood; in ProStreet, you need to dominate on a global stage. Build the ultimate battle machine, take it to multi-disciplinary showdowns and pit your skills and reputation against the world's best street racers.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":479671,"name":"Post Void","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ab/8ab4066bdd1423944b159b2e4663039c.jpg","description":"We move forward_____________\n_____________We aim to progress.\n\n(Challenging arcade style first person shooter with one objective: be fast)\n\nTry not to____________Try to avoid\nlook back____________lingering on\ntoo much.____________mistakes.\n\n(Move forward and keep your idol filled with liquid by getting kills)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"YCJY Games","platforms":[{"id":0,"name":"PC"}]},{"id":19360,"name":"Alien Rage - Unlimited","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45a/45afc017c00d13e135894b179346e3e8.jpg","description":"Unleash a fury of powerful weapons as you blast your way through armies of Alien forces hell-bent on taking you down! Battle through 14 intense levels and prepare to face a barrage of beastly-sized bosses that will test your every skill. Each of your 10 weapons comes with two firing modes and you’ll need all of them! Battle hardened Alien forces will attack you from every direction using various flanking and attack moves. Built with powerful up-to-date graphics technology, awesome physics, destructible environments… experience a truly intense, oldschool styled shooter game!Key Features\nWide variety of Alien enemy forces including Infantry, Warriors, Flying Drones, Spiders\nHuge boss fights – Over 21 enemy types including 8 beastlysized bosses to challenge and destroy through 14 Levels\nStrong thru-the-gun experience with 10 powerful weapons each with two firing modes\nSkill shots, head shots and shooting accuracy heavily rewarded\nPlayer-triggered destruction of environments and cover helps to advance through levels\nBuilt with powerful up-to-date graphics technology, awesome physics, destructible environments","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"City Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":12136,"name":"Shoppe Keep","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/959/959f9586c0799088524ccb38daf3c7ae.jpg","description":"If you haven’t played Shoppe Keep yet, why not join nearly 100,000 gamers who are already enjoying this unique business management game, and create your own fantasy retail consortium?\nShoppe Keep challenges you to shrewdly set the price of each item and watch the money roll in – but if your stock is too expensive, you will find your supplies shrinking as stealing increases! Stop Thieves quickly, with a swing of your sword or a zap of a lightning spell! (Or maybe both, if you’re really bloodthirsty.) Price your wares competitively and great adventurers will travel from miles away to your one-stop shop to spend their gold – the gold that they probably found conveniently placed on a cave floor! Shoppe Keep delivers deep gameplay mechanics in a memorable, tongue-in-cheek world.\nGone are the days of testing the theoretical water – we’re now a fully-fledged, fully-opened store! Despite reaching full release, developer Strangefire will continue with our planned seasonal updates – after all, we all know that Shoppe Keep is the true meaning of the holidays - but the especially fantastic news is about the brand new Inn!\nThis building has been blocked off for some time, and many have speculated that it will be an Inn – well, the sneaky players were right! The Inn is best used at lower levels and a lower gold count. For a small amount of kPoints, you are able to unlock the Inn with a single table for four guests.\nAn inn with a single table? What complete rubbish! Additional tables can be purchased by speaking with the innkeeper, as well as additional upgrades that will help your Inn deliver serious coin. Adventurers traveling through town might want to visit the Inn and enjoy some food and ale – if they haven’t found some randomly laying around on their travels already. We all know that fantasy worlds cater for their heroes – but with Shoppe Keep, you’ll be able to make sure that catering doesn’t equal ‘potato in a toilet’!\nVarious members of four completely original and never before seen character classes will visit your store, including hardened warriors, magical mages, sneaky rogues and wise druids. (As you can tell, we’re taking this description text VERY seriously!) Each of these character types will seek to purchase items relating to their unique skill set - a warrior will be hard-pressed to take a flimsy magical robe into close quarters’ battle, for instance! Mages, however, will be perfectly happy with a wooden stick. It’s ‘magical’, or something ridiculous those absurd mages believe. Will you be able to accommodate for all four classes of customers?\nYou have a completely unreasonable clientele to add pressure to your role as a Shoppe Keeper. After a day of heroism, beating up goblins and even battling the great ol’ Dragonclaw, your customers can be just a little short-fused. This means your displays can be spoilt and your tables may be damaged by angry customers! The renegade ‘heroes’ are not too worried about bringing in dirt from the street either!\nHowever, help is at hand! As the owner of the store you’ll be armed with various exciting tools for combating these issues. The mighty wooden broomstick will sweep away dirt brought in from your customers, and the great hammer will repair furniture damaged by these ‘extraordinary’ visitors. A few sweeps and a couple of swings means that your shop will be in tip-top shape. Grow your business, and you can employ an army of ‘Helper Bots’ to take care of this for you – the cutting edge in imaginary technology that totally exists.\nSet your prices too high and your customers may think twice about investing their hard won (or stolen) gold in your shop. They’ll take the plunge and attempt to steal stock right under your nose! With no CCTV available in ye olde world of Shoppe Keep, you have to rely on your combat skill! A sharp swing of the sword or the zap of a magic spell can make quick work of these pesky Thieves. But be cautious not to hit any innocent bystanders or you’ll suffer a monetary penalty, as well as a life riddled with guilt! Not to mention the hideous moral conundrum of whether or not to tell your family or- look, just don’t kill innocent people.\nAnd let’s not forget the ferocious Barbarians! They live on the outskirts of the city, looming like an ancient race of organic-synthetic hybrids that invade the gal- wait, wrong game.\nRegularly invading the town, Barbarians will cause as much damage and destruction as possible! They will even fight you directly if you try to stop them. Eliminate a few dozen Barbarians and they’ll invite a much… larger friend to come and visit you. But what will you do with all the bodies? Unless you wish to display the corpses as examples to your customers, you monster, you’ll need to use either the broomstick or the grinder.\nIt’s tough running a shop (especially one that may or may not be the venue of a murder-fest); there are not enough hours in the day to go out and procure new items for yourself. Thankfully, you can employ a Champion, unlocked via the skill tree. Select a class, equip the Champion with your finest armour and weapons, and send them out to bring home rare new wares. Despite that awful half-rhyme, some of these items can be sold, some are junk and others can be crafted into more powerful gear.\nYour Champion will need to gain experience, just like the fantasy heroes you’re familiar with. During their first outing, they may fall in battle (and regret not saving more recently!), and whilst they will not return with any new goods, the experience will have taught them valuable skills that will improve their chances next time.\n‘Helper Bots’ are your robotic staff team. The MK III charts the latest iteration of this tech, increasing the artificial intelligence of this mechanical chap. We all knew that true AI technology would be created before CCTV – it was inevitable.\nThe ‘Helper Bot’ has three duties; zapping Thieves who attempt to steal from your shop, picking up items that customers may have thrown to the floor, and restocking items back on the shelves. You can purchase several ‘Helper Bots’ to, well, help run your shop.\nMake a living for yourself in a tongue-in-cheek fantasy worldFEATURESMake a living for yourself in a tongue-in-cheek fantasy world\nManage your own Shoppe, from ordering stock to setting prices\nDesign your own Shoppe layout by ordering tables, shelves and weapon racks\nThe world of Shoppe Keep reacts to your every Shoppe decision, including prices and stock quality\nUnlock new abilities and perks in the skill menu, including alchemy, harvesting, and the capability to own a grinder and a high tier stock. We’ll let you decide what to do with the grinder\nUse the ‘Helper Bots’ to collect items thrown down in disgust by customers, zap Thieves and restock items\nCreate a Champion, select its class and send them out on grand adventures\nArm yourself with a sword and magic spells to defend your Shoppe from cheeky Thieves and destructive Barbarians\nMaintain your Shoppe by using the hammer to repair furniture and the broom to sweep away dirt, as well as the occasional corpse\nThe world cycles through 4 seasons, each featuring a most wanted item. Frost Resists potions sell best in Winter, for example.Other titles from Excalibur Games","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Excalibur Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21448,"name":"Zombie Shooter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/573/573ef6db94da7b04c9f32344c08dbe00.jpg","description":"Where is the line between life and death? How far can human science go trying to understand this?\nTake part in the great battle to rescue humanity and find out what's happening! The human race is in danger again. This time scientists could not cope the imminent threat and became monsters themselves. Crowds of zombie people filled the secret research base. The dreadful contagion is about to spread earth wide. Use the last chance to save the humanity from total annihilation!\nFind the answer to the main question - what caused the catastrophe? Who knows, maybe on the final stage you'll face something terrible?..\nTry your monster fighting skills in two additional game modes - Survive and Gun Stand. Only these modes will really show how good you've become.\nFight your way through contaminated hordes\nUse 10 types of weapons\nImprove the character's skills\nUpgrade available arms with the money earned\nAbout 1,000 zombies on each map, showing up to 100 zombies simultaneously on one playing screen\n3 game modes: Campaign, Survive and Gun Stand\nFull-on-action male or female character\nCharacter upgrade facility\n9 upgradeable weapons of mass destruction\nRed or Green blood selection\nHighly imaginative selection of zombies\nReactive music which helps to drive the action\nUseful gadgets - flash lights, medkits, battle drones and radar.\n","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Sigma Team","platforms":[{"id":0,"name":"PC"}]},{"id":18704,"name":"The Guild II - Pirates of the European Seas","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4b/b4bc9b2b8be2fb16d20d7d437f86cd72.jpg","description":"The Guild II - Pirates of the European Seas is a stand-alone add-on for the 2006 role-playing game with real-time strategy and life-simulation game elements The Guild 2.  \n \n###Gameplay \nIn Guild II – Pirates of the European you play a popular townsman in Europe at the dawn of the XV century. You create your character, choosing its appearance, statistics, and profession.\nYour goal is to create an influential and thriving dynasty of medieval burghers (or rouges if you choose a similar profession). You start with almost no property or money and have made a living off your skills. The profession you chose at the beginning determents your primary source of income, your skills, what structures you can build and other aspects of in-game economics.\nAfter some time, you make enough money to make your first investment. You can build some structure like farms, churches, mines, smuggling holes. You can find somebody to marry and start a family. With time your family gets more productive and more powerful expanding your business or criminal empire. \nThe game offers four game modes and an online multiplayer where you have to compete with other dynasties.  \n \n###New features  \nThe main new feature of the addons is the inclusion of sea trades and piracy. It also adds new maps, scenarios, three new professions and changes a few gameplay aspects.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"4Head Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2321,"name":"Anomaly Defenders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfb/cfb52437c8f509bd29d25586f5361cb3.jpeg","description":"Anomaly Defenders is the closing installment of the Anomaly series. The original incarnation of the Tower Offense sub-genre had players controlling humans fighting alien invaders. Now, the tables have turned. The human counterattack is underway and the alien homeworld is under threat. Defend the planet from the human scum in the final battle of the series.\nAnomaly Defenders is a fast-paced Tower Defense game where attacking human troops can damage and destroy your defenses. You have to react and counterattack enemies on the battlefield at all times. Each time you start a campaign, the unique tech-tree technologies can be tailored to your needs. Killing humans is easier due to 8 upgradable towers and special functions: repair your towers, make them go berserk, sacrifice them in explosions that are harmful to nasty humans, and use other tricks. This is the final battle against the humans. For the Hive, Commander!Key Features:Functions to fix and boost your towers: Repair, Rage, Explode and others\nFull-blown tech-tree to tailor unique strategies\nAttacking forces can damage and destroy your towers - watch out!\nOutsmart humans by deploying towers that force them to change their movement path\nFight the humans on the orbital stations and undiscovered lands – 24 unique levels are waiting for you to protect them\n8 unique, upgradeable towers\nThree difficulty levels adjusted for both new and hardcore players","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":14685,"name":"PixelJunk Monsters Ultimate","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a59/a595606ae7a64643d164dc0072777120.jpg","description":"Tikiman the Forest Defender is in trouble. Hordes of monsters are sweeping through his realm, hoping to chow down on his offspring – and it’s up to you to defend them.\nBy placing weapon towers at strategic points around the landscape, you can destroy the invaders and save the little ones. Collect treasure along the way to build up your arsenal and pay for new towers – countless waves of monsters are out to get the Tiki babies, so you need to be prepared to fight hard!\nKey FeaturesPlay four game modes: Single player campaign, local co-op play, online co-op, and a host of additional challenges.\nPlay Together: Local and online co-op will have you sharing your machine or playing with your friend over the net for a shared memorable experience. Online leaderboards show you how you stack up against your friends and everyone else in the world!\nTikiman will travel across three distinct islands, spanning 47 unique environments to protect his offspring from clever monsters that attack by land and air. He’s going to use every tower in his arsenal to protect them: Arrow Towers, Cannon Towers, Anti-Air Towers, Ice Towers, Laser Towers, Fire Towers, Tesla Towers, Mortar Towers, special power ups and more!\nThere is also the mysterious Tum-Tum island, that randomly generates levels for near infinite replayability!\nThis amounts to literally hundreds of hours of game play, all set to an awesome soundtrack to keep you in the zone!\nWe have also included unlockable content including concept art, music videos, sound tracks and more!\nFor Steam we have created over 20 brand new achievements, giving the game 52 in total for you to unlock! Not to mention trading cards and badges!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Double Eleven","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"}]},{"id":176,"name":"Ravensword: Shadowlands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f19/f19ab9f5dce2738d0fec875b249f90fc.jpg","description":"Ravenswood: Shadowlands is the second installment in the Ravenswood series and the sequel to Ravensword: The Fallen King. It is an open-world fantasy game reminiscent of Gothic and The Elder Scrolls series. It was one of the first notable RPGs designed for iOS, although the game is also available on other platforms.\n\n###Plot\nThe story is set in a medieval fantasy world of Tyreas and follows a customizable protagonist. At the beginning of the game, he or she fights in the Battle of Heronmar against the dark elves and trolls. An earthquake erupts, killing all combatants except the player's character. The protagonist awakes in the city of Aven, revived by the local healers. Eventually, the protagonist meets Archmage, who sends him or her on a quest of the worldwide importance. The character has to gather artifacts called Ravenstones to open the gate to Shadowlands, the world of demons. There, the protagonist will have to kill the demon king.\n\n###Gameplay\nThe player controls his or her character from the third person view in a 3D environment. The world of Ravenswood is open for exploration. The player can accept side quests or even go hunting to gather food and experience. When the character levels up, the player can use experience points to improve the protagonist's skills and attributes. The character can also learn some of the skills by repeating them. There are no character classes, and the character can become a warrior and a magician at the same time.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Crescent Moon Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":481908,"name":"Gotham Knights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/067/067480b8c161115c90e60fd120b1570e.jpg","description":"Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos.\r\n\r\nYour legacy begins now. Step into the Knight.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]}]