[{"id":1571,"name":"FINAL FANTASY","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa5bb7cabd8aff744f8d3aa6acf4875a.jpg","description":"FINAL FANTASY\nInitially released in Japan in 1987, the original FINAL FANTASY amazed audiences with its rich story and stunning graphics.\nPlayers guide the Warriors of Light as they set out on a quest to restore the crystals to their former luster. Its side-view battles, choice and promotion of character classes, and sprawling world explored with fantastic vehicles quickly became standards of the series. This game set the stage for all FINAL FANTASY games to come.\nThis release also contains the bonus dungeons added to later editions of the game--the Soul of Chaos and the Labyrinth of Time.\nAdditional Information (reference only):\nESRB Rating: E10+ with Mild Fantasy Violence and Suggestive Themes\n* This app is not compatible with \"FINAL FANTASY (Portal Version).\"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Square Enix","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"PSP"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":300689,"name":"Tails of Iron","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27e/27e46821c94d9f3853bb30fb1157b0ab.jpg","description":"Tails of Iron is an Adventure RPG-lite game set in a charming and brutal world. Playing as Redgi the Rat, you are heir to the throne when your kingdom is raided by the Iron Frog. Players face challenging, tactical and stunning combat encounters in order to rebuild the Rat Kingdom.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Odd Bug Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":7757,"name":"Lume","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e9/0e946c62b3527c26692c3b65eb9892b4.jpeg","description":"Lume: An illuminating puzzle adventure!\nWith a set built entirely out of paper and cardboard, and sumptuously filmed, Lume is a game with a style unlike any other.\nPower to your grandad’s house has failed. What’s more, he’s nowhere to be seen.  Immerse yourself in Lume’s photoreal world, solve perplexing paper puzzles to help restore the power, and uncover a deeper mystery behind the blackout.\nThis game forms Part 1 of a larger, ongoing story.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"State of Play Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":4195,"name":"Tekken Tag Tournament 2","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ad/3adf409c2dd25ddb042a37ae9d3251e7.jpg","description":"WE ARE TEKKEN!\nDownload the full TEKKEN TAG TOURNAMENT 2 game! Join the world's greatest fighters to swap blows in action-packed battles! Choose from a massive cast of characters and unleash your most vicious combos to claim ultimate victory!\nNOTE: This game's downloadable content are the same as the packaged version, and includes the online pass but none of the pre-order downloadable content.\nPS3™ system software v3.60 or higher, HD 3D display with compatible 3D active glasses and highspeed HDMI cable (sold separately) required for 3D features.  Visit www.us.playstation.com/support/3D for details.\n1-4 players\n46MB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-6\nStereoscopic 3D compatible\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nTEKKEN TAG TOURNAMENT ™ 2＆© 2012 NAMCO BANDAI Games Inc.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"}]},{"id":401818,"name":"LEGO Builder’s Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/348/3485bd1bfce1d9025cd5bd8f9fc8a356.jpg","description":"LEGO Builder’s Journey is an artistic, nonverbal puzzle adventure with meditative music where players build to solve challenges, while moving through brick built universes, which showcase the endless possibilities of the creative play material and deliver a poetic narrative highlighting the importance of play in our lives.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Light Brick Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":58998,"name":"Mega Man X Legacy Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/250/250a012af7e4cd0d24863e5993e0620c.jpg","description":"The celebrated Mega Man X series returns! Play as Mega Man X – the\npowerful successor of classic fighting robot Mega Man – as he battles a\nvariety of deadly bosses known as Mavericks in four hit titles. Mega Man\nX Legacy Collection includes the legendary 16-bit titles and the series'\nexciting foray into the 32-bit era: Mega Man X, Mega Man X2, Mega Man\nX3, and Mega Man X4. The heroic robot grows stronger as he takes down\nMavericks and steals their weapons, and can dash and wall jump making\nfor a thrilling, fast-paced combat experience.\n\nMega Man X Legacy Collection comes with an armory of new features. Test\nyour skills in the new X Challenge mode, which pits players against two\ndeadly bosses in two-on-one battles. Explore a huge museum filled with\nrare production art, catalogs of classic merchandise, a playlist of\nnostalgic commercials, and more.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17414,"name":"Accounting","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/482/4824e9d8ab139780b13a5a3396593383.jpg","description":"Content warning: cartoon violence, gore, suicide, tax work.\nNumbers. What do they mean?\nThe modern field of Accountancy is a serious and honorable profession. Many human beings have spent their lives toiling over the hard science of numbers. Thousands have died so that we may get to the level of understanding that we have today. Thousands have died. However, as Accountants and Numbersmiths embraced the abacus and the calculator, today we must embrace the latest technological advancement.\nVirtual Reality.\nIn early 2016, three highly qualified Accountants came together to see what potential economic savings and visualisations could be achieved with The HTC Vive. These Accountants were quickly and discreetly discarded to be replaced by award-winning game studio Crows Crows Crows and the newly announced VR studio Squanchtendo, to create the ultimate electronic number-crunching program.\nLet’s get one thing straight: Accountancy is a mature profession and is not for children.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crows Crows Crows","platforms":[{"id":0,"name":"PC"}]},{"id":892902,"name":"Armored Core VI: Fires of Rubicon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c97/c97aba78a97038867d4b32a81fe48567.jpg","description":"Dynamic, Fast-Paced Mech Action\nBased on the knowledge gained during joint development of their recent titles, Bandai Namco Entertainment and FromSoftware seek to deliver a new action game. By combining FromSoftware’s longstanding expertise in mech games and their signature robust gameplay, ARMORED CORE VI FIRES OF RUBICON will be a new action experience.\n\nIn ARMORED CORE VI FIRES OF RUBICON, players will assemble and pilot their own mech with 3D maneuverability to move freely through three dimensional fast-paced missions. Take on difficult challenges and overwhelm your enemies with dynamic movements that make full use of ranged and melee combat. Players can enjoy a variety of actions that can only be truly realized with mechs.\n\nStory Overview\nA mysterious new substance was discovered on the remote planet, Rubicon 3. As an energy source, this substance was expected to dramatically advance humanity’s technological and communications capabilities. Instead, this substance caused a catastrophe that engulfed the planet and the surrounding stars in flames and storms, forming a Burning Star System.\n\nAlmost half a century later, the same substance resurfaced on Rubicon 3, a planet now contaminated and sealed off by the catastrophe.\n\nExtra-terrestrial corporations and resistance groups fight over control of the substance. The player infiltrates Rubicon as an independent mercenary and finds themself in a struggle over the substance with the corporations and other factions.\n\nDevelopment Team\nHidetaka Miyazaki will be involved as the Initial Game Director. Based on the initial development, Masaru Yamamura has taken over as Director.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"FromSoftware","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":816326,"name":"Moonscars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/236/236729a999d0be4cb3c60297d264492a.jpg","description":"Push the limits of your combat skills, and master new abilities to progress through an unforgiving nonlinear 2D world. Face off against the relentless darkness that seeks to destroy you. In Moonscars, every death is a lesson learnt—and as you overcome each challenge, new truths will be revealed.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Black Mermaid","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":22230,"name":"Vampire: The Masquerade - Redemption","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/299/299bbd6e2c355789b5fe094a415f7e15.jpg","description":"Before your fall, you led a crusade against evil.  Now you've become one of the undead creatures you once battled - a Vampire.  Inhabiting the World of Darkness, you must face a series of brutal confrontations with your nemesis Vukodlak, a powerful vampire lord.\nYour unholy showdown begins in medieval Europe and rages on into the modern day, as you track a soulless enemy in an eternal struggle to destroy him.  For this is the only hope of vengeance for your tortured immortality.\nA storyline that begins in Middle Ages and ends in the present\nA well-known universe as the game’s setting: World of Darkness\nYour decisions during both gameplay and conversations will determine the final outcome of the story","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Nihilistic Software","platforms":[{"id":0,"name":"PC"}]},{"id":14559,"name":"Red Lake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b6/1b65f85b25adf599ffadd087f6181d78.jpg","description":"Red Lake - horror shooter with elements of quest.\nThe protagonist works in a department that is looking for a variety of paranormal places in order to hide them from humanity and prevent someone from using them for their own purposes.\nThere are rumors of a lake not far from the small village somewhere in Siberia, has changed color and became red. At the same time the behavior of animals around it began to change and strange things started to happen in there.\nWhen the forester, the first who noticed these things stoped communicating, then a agent was sent to investigate. His main task - investigate what happened with the forester and the situation around the lake.\nTowards the end of the game, when the main character finds a lake, a large open area for exploration. In order to perform the tasks of the scene, the protagonist will have to survive. During the night, dangerous creatures starts creeping arround the lake, you need to find a place to sleep before the sunset.\nSome of the enemies you meet in the game:\nDogs - they behave very aggressively. The skin made ​​black slime, as if they are infected with something.\nSphere - flying metal spheres. When they notice around them living beings - immediately emit a deadly electric shock. It is better to avoid them.\nCat-like creature - a creature whose body is composed of bluish crystals. They are very agile and hostile.\nAlso in the game you expect creatures that cause hallucinations, infected animals and other enemies, you'll need a different tactic to fight or avoid each one of the enemies.\nInspired by the object SCP-354.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Talentplace","platforms":[{"id":0,"name":"PC"}]},{"id":13367,"name":"Cat on a Diet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ff/1ff70369c650b1e3a3a7b157c01b42ca.jpg","description":"Soft, fluffy, and a little on the chunky side — the podgy pussycat Dr. Meow can’t stop munching on delicious cookies and needs your help getting his greedy little paws on more! While his owner sleeps, steal away into the kitchen and help tumble this tubby tabby cat into the prized cookie jar.\nGet stuck in!\nSwipe and prod to claw away at wooden blocks, unscrew bolts, control powerful magnets and explode highly volatile uranium – anything to reach those cookies!\nThe hand that feeds?\nWhat are the owners hiding from you? Find out as this pot-bellied kitty’s journey for sweet treats takes him up into the attic and down into the secret laboratory.\nSnack happy!\nMunch all the snacks in each level and spend them on new power-ups, hats, masks and even more cookie-heisting helpers.\n- witness the shenanigans of Dr. Meow in a Physics Puzzler for all ages\n- visit 4 game worlds (Dr. Meows Home, Spooky Attic, Mysterious Laboratory and visit the middle ages!)\n- Over 100 challenging levels to complete\n- two diverse game modes\n- Collect over 50 fabulous cat costumes\n- Use fun tools and inventive methods to reach the cookie jar!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nawia Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":10940,"name":"Alwa's Awakening","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/73e/73e2509fef0e46cdbea86e5e8f8822ca.jpg","description":"In Alwa's Awakening you play as Zoe, a heroine sent from another world to bring peace to the land of Alwa. Equipped only with a magic staff she awakens in a distant land and must set out to help the people. Traverse dangerous dungeons, meet interesting and fun characters and explore the world in this 8-bit adventure game. Just like the old classics you won't have a flashing arrow telling you exactly where to go and what to do next. Instead you are free to find your own way and by using your magic staff you can progress through the over 400 unique challenging rooms in the game.\nAlwa’s Awakening is a game that tries to stay as close as possible to the authentic 8-bit look with sweet pixel art, a soundtrack filled with catchy chiptunes and so much charm it’ll bring you right back to the NES era. With easy to understand controls the game is easy to learn but tough to master, just like how games were in the old days!\nA retro game with an authentic feelA new challenging NES-inspired adventure game with the authentic feel and look of a Nintendo 8-bit game. Inspired by classics such as Battle of Olympus and Solstice.Use your magic staffEquip a magic staff that holds many mysterious powers. Use it to solve puzzles and defeat enemies in over 400 unique rooms. Upgrade your staff by finding new gemstones.You are ZoePlay as Zoe who has been sent for to help free the land of Alwa. With easy to understand controls, you'll jump and fight your way through the many different challenging rooms.Explore the land of AlwaExplore a large interconnected map in true ‘Metroidvania’ style. Play the game any way you want and find your own way through the land of Alwa.Find new items and learn new abilitiesFind and unlock a slew of different objects throughout the adventure that will both give Zoe new abilities as well as unlock new areas.An 8-bit soundtrackListen to a completely new 8-bit soundtrack with over 25 new original tracks composed by Robert Kreese. Also features a guest track by Prof. Sakamoto.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Elden Pixels","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"NES"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":2395,"name":"Pandemic: The Board Game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/047/047d40b633e4ca4142d353f64fae3d91.jpeg","description":"As skilled members of a disease-fighting team, you must keep four deadly diseases at bay while discovering their cures. Travel the world, treat infections, and find cures.\nYou must work as a team to succeed. The clock is ticking as outbreaks and epidemics fuel the spreading plagues. Can you find all four cures in time? The fate of humanity is in your hands!\n\nPandemic: The Board Game is a family-friendly cooperative game. Simple to understand and lots of fun, Pandemic: The Board Game puts you in an apocalyptic situation where you must work as a team to save the world.\n\n###How to Play\n\nIn Pandemic: The Board Game each player has a unique role with different abilities. On a turn, players will have four actions in order to cure diseases and save the world. They can remove disease cubes from the board; fly to a city in need; trade cards with fellow players; and much more.\n\nAt the end of every player’s turn, new cities are infected with disease cubes and Epidemics may arise. You must fight to prevent the outbreaks before they spin out of control.\n\nIn Pandemic: The Board Game, there is only one way to win: cure all four diseases before you run out of time!\n\n###Features\n\n* 7 Role Cards With Unique Abilities\n* Supports games for 2, 3, or 4 players, but can be played solo if you play multiple roles\n* Pass-and-play multiplayer (2-4)\n* Three difficulty settings make the game suitable for beginners, intermediate players, and experts\n* Fully guided interactive tutorial; plus “Info Mode” for in-game reminders of the rules\n* Full rulebook included for easy access and detailed reference at all times\n* Animated interface gives clear indication of the game's progress and hotspots\n* “Undo” system\n* Adaptive soundtrack\n* Complete implementation of the board game suitable for expert play\n* Interface designed and tested for ease-of-use\n* Supports landscape or portrait orientations (iPad only)\n* Supports multitasking","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":2367,"name":"Pixel Heroes: Byte & Magic","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b2/3b2f1c56ea6059e483a2fd3fd8bdedc7.jpeg","description":"„Listen! The end is nigh!! Hear my words and prepare! An ancient cult has set foot in our lands! They call themselves -The Sons of Dawn- and pray to some dark elder god. They have started recruiting people for their cause all over the country. I fear that they want to try to awaken something which should be left sleeping. Something dangerous and sinister! Something that might destroy us all. Spend your last of days wisely...“\nEnter the world of PIXEL HEROES and prepare yourself for a thrilling RPG/Roguelike experience like you have never seen before!\nExplore a randomized world full of hilarious events, deadly dungeons and the weirdest NPCs you will ever meet in a game!\nChoose three heroes for your party and take them on a journey that will be completely different each time you start a new game. Bath in a pool of procedurally generated loot and defeat the evil forces that threaten the township of Pixton!\nFeatures:\n30 unique hero classes to unlock, each with individual skills and attributes.\nMore procedurally generated axes, spears, maces, swords, shields, bows, crossbows, spells and prayers than a lama has hair on its body.\n13 mystic and beautifully cruel dungeons to explore. With epic bossfights waiting!\n3 campaigns to unlock, each with its own final dungeon and boss.\nPermadeath! You know you want it.\nA detailed graveyard where you can mourn your dead heroes, compare their statistics and see which of their choices led to their tragic death.\nCompletely crazy NPCs, each one of them with a significant storyline that you can follow to unlock cool stuff!\nTons of random events that you will encounter on your way, expecting you to make important choices. Will you yell at the cat like a crazy idiot?\nMany achievements and unlockables, try to get them all and become the most badass Pixel Heroes player in the world!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":1637,"name":"Sid Meier's Starships","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c6/6c6c825c7b8e295b0d75f269ee4dd115.jpeg","description":"Take command of a fleet of powerful starships in this adventure-driven strategy game from legendary designer Sid Meier. Travel to new worlds, completing missions to help save and protect the planets and their people from dangerous Space Pirates, to powerful Marauders and other hostile factions. Build a planetary federation as you strengthen your fleet and secure your homeworld as you attempt to preserve intergalactic peace and your vision of humanity. Set in the universe of Civilization: Beyond Earth after the age of the Seeding, Sid Meier’s Starships offers sci-fi/strategy fans a full stand-alone game experience that also features cross-connectivity with Beyond Earth, expanding the depth of both games.  See if you have what it takes to rule the universe!\n• Tactical Space Combat: Encounter unique tactical challenges in every mission, with dynamically generated maps, victory conditions, and foes.\n• Fully Customizable Starships: Create an armada that fits your tactical plan with modular spaceship design.\n• Diplomacy, Strategy, and Exploration: Expand the influence of your Federation and gain the trust of the citizens of new planets. Use the unique abilities of the each planet to enhance your fleet and Federation, and keep your opponents in check. Build improvements on worlds to increase the capabilities and resources of your Federation.\n• A Galaxy Of Adventure: Explore the galaxy as you lead your fleet to distant worlds and complete missions to help the citizens of these planets. Fight pirates, protect colony ships, destroy rogue AI, and more.\n• Multiple Paths To Victory: Will you win by conquering the greatest threat to the galaxy? Or will you unite a plurality of worlds in your Federation? Perhaps you will lead your people to push the frontiers of science. Each choice you make carries consequences on your path to victory","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2K","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20676,"name":"Digger Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/97e/97ee7d967cc0f75e6a0b6ece449a7c28.jpg","description":"Building\nIn this game you have available 249 unique types of building blocks! More than 100 different scenery! 25 unique characters! 8 game modes\nYou can create levels of the game with your friends, traveling on someone else's map and easy evaluate them. The game has a top list of cards that will allow the best cards to be seen.\nAlso \"Kopatel-Online\" gives you a large number of different decorations, which will be constantly updated. You can vitalize your card with animals, fish and birds.\nYour card can be a serious puzzle for the other players, because you can hide a variety of traps , door keys, do the secret hiding place there, such as gold cups, for example.\nThe game has well-developed characters for each kind of person : knights, pirates, vikings, skeletons, zombies, today's soldiers, many of whom will have their own unique abilities.\nAlso \"Kopatel\" has several combat playing modes such as :Hunger GamesModern WarZombie VirusRun!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DiggerWorld","platforms":[{"id":0,"name":"PC"}]},{"id":14088,"name":"Neon Prism","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/279/2799973dedbe801eb1e9a61fcf27babb.jpg","description":"Neon prism is a fun and simple but at the same time highly addictive game.\nThe goal of the game is to drive your little ship from one end to another, dodging numerous obstacles, solving puzzles, opening new passages with checkpoints and discovering unique game mechanics by yourself. There are 50 levels, and there is also a cool medal system so you can always try your best for that shiny gold medal.\n**Slow ability- allows for the player to slow down everything except for the player itself.\n**Blink ability- allows you to jump a short distance. If you manage to time it right, you can even jump through some of the obstacles in the game.\nEnjoy the uplifting music, breath taking visuals, solve puzzles, don't be afraid to fail, the game might be a bit tricky towards the end, but everyone can master it.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10871,"name":"STAR WARS: TIE Fighter Special Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71c/71c5da4df97e92d838bcd3f0f3614af2.jpg","description":"Become a recruit of the Imperial Navy under the command of Darth Vader, and pilot space vehicles that will leave you breathless.\nIn the wake of the Battle of Hoth, through their treachery at Yavin, the alliance of Rebels and other criminals have threatened the very foundation of the peaceful Empire. The Imperial Navy is called upon to eradicate the last of the rebellion and restore law and order. As an Imperial navy starfighter pilot, you will safeguard imperiled lives thoughout the galaxy. Join the Emperor's cause in eliminating the Rebel uprising as the Empire strikes back!\nKey features:\nIncludes STAR WARS™: TIE Fighter and STAR WARS™: TIE Fighter - Defender of the Empire, both 1994 (DOS) and 1998 (Windows) versions, and STAR WARS™: TIE Fighter - Enemies of the Empire 1998 (Windows).\nGet swept away in story line loaded with spectacular cinematic cutscenes!\nStep into a 3D world filled with Imperial and Rebel starfighters!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Totally Games","platforms":[{"id":0,"name":"PC"}]},{"id":5598,"name":"NARUTO SHIPPUDEN: Ultimate Ninja STORM 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/993/993d8949c9cc2611219267291d77cf03.jpg","description":"NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 is the newest title in the hit STORM series. Command your army as the ninja world is plunged into war, and unmask the sinister forces orchestrating the conflict.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":631942,"name":"RoboCop: Rogue City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ae/2ae4150474a27f90595c9092917ab2d3.jpg","description":"Become the iconic part man, part machine, all cop hero as you attempt to bring justice to the dangerous, crime-ridden streets of Old Detroit. Armed with your trusty Auto-9, factory-built strength, years of experience on the force and a variety of tools at your disposal, you will fight forces seeking to destroy the city you call home in an all new first-person, explosive hunt for the truth. You have the power to decide how to fulfil prime directives in your own way, but as the story unfolds proceed with caution because corruption and greed know no limits.\r\n\r\nPrepare yourself to...\r\nPROTECT THE INNOCENT AND UPHOLD THE LAW","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Teyon","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":37967,"name":"Scratches: Director's Cut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdf/fdf67506b5a48d0a910f97606184a465.jpg","description":"Dark Legends surround the old abandoned Blackwood house, secluded far away in the northern wastelands.\nFor writer Michael Arthate, this cold, solitary atmosphere is fodder for his restless imagination. But Michael soon becomes distracted by the mysteries offered up, as he follows a trail exploring and delving into the secrets of the past. As he is drawn deeper into the story, his sleep is shattered by mysterious noises, and he is plagued by nightmares that cross into reality.\nWhose shadows lurk in the dark corners? Is that lonely house inhabited by restless spirits of the past or something more sinister? What is that sound that chills to the very bone...scratching?\nJoin Michael in a suspenseful adventure, as you explore beautiful and chilling environments. Prowl dark corners and solve puzzles leading to the solution of a tale begun with obsession, and ending with madness and murder.FeaturesEerie and immersive story\nHaunting soundtrack\nFull 360 degree panoramic viewing\nPuzzles and challenges throughout\nNumerous hours of gameplay\nExplore a Victorian mansion, sinister chapel, forbidding crypt, musty rooms, greenhouse…Director’s Cut includes:An alternate ending that might be more shocking than the original\nA new chapter: “The Last Visit” will have you back at the house 10 years after the events of the original game\nMichael’s diary with more clues and thoughts from the main character\nUpgraded graphics and an eerier soundtrack","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nucleosys","platforms":[{"id":0,"name":"PC"}]},{"id":24877,"name":"Harry Potter and the Order of the Phoenix","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5e1/5e1b388efe99ea9561363262fda06f23.jpg","description":"The close and synergistic relationship between book, film and videogame\nis more defined in the Harry Potter and the Order of the Phoenix\nvideogame than ever before. Players will be able to explore the many key\nlocations within Hogwarts in minute detail, each one a visual match to\nits film equivalent, while being engrossed in the thrilling adventures\noutlined in the rich narrative of the book.\n\nIn Harry Potter and the Order of the Phoenix, Harry returns for his\nfifth year of study at Hogwarts and discovers that much of the wizarding\ncommunity has been denied the truth about the teenager’s recent\nencounter with the evil Lord Voldemort. Fearing that Hogwarts’ venerable\nHeadmaster, Albus Dumbledore, is lying about Voldemort’s return in order\nto undermine his power and take his job, the Minister for Magic,\nCornelius Fudge, appoints a new Defense Against the Dark Arts teacher to\nkeep watch over Dumbledore and the Hogwarts students. But Professor\nDolores Umbridge’s Ministry-approved course of defensive magic leaves\nthe young wizards woefully unprepared to defend themselves against the\ndark forces threatening them and the entire wizarding community, so at\nthe prompting of his friends Hermione and Ron, Harry takes matters into\nhis own hands. Meeting secretly with a small group of students who name\nthemselves “Dumbledore’s Army,” Harry teaches them how to defend\nthemselves against the Dark Arts, preparing the courageous young wizards\nfor the extraordinary battle that lies ahead.\n\nWith the ability to play multiple characters, including Harry Potter,\nDumbledore and Sirius Black, the videogame of Harry Potter and the Order\nof the Phoenix offers fans the opportunity to wield a wand, explore all\naround Hogwarts and experience one of the most exciting and dangerous\nyears in the life of the Boy Who Lived.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"}]},{"id":20253,"name":"Jones On Fire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42b/42badfc6efefb44a3f7c8096a306b4d6.jpg","description":"Jones On Fire is a 2-button infinite runner about being a firefighter and saving kitties - originally released on mobile, now everywhere. It's also the precursor to Hot Tin Roof. Grab Jones On Fire to see how the story of Jones and Franky begins, save some kitties, then try its Metroidvania meets Adventure Game successor...\nhttp://store.steampowered.com/app/253390\nOriginal Description\nBecome Emma Jones, firefighter extraordinaire, tough cookie and kitten lover. Beat 10 levels of dangerous mountain terrain, improving Jones’ skills with every fluffy life saved. Strive for ever higher scores, and gain the adoration of millions of cats!\nSave the kitties! You’re their only hope!\n- Fast, frenetic, side-scrolling fun\n- Intuitive controls\n- Juicy running and jumping physics\n- Fun in short bursts, but addictive enough for longer plays\n- Upgrade Jones with increasingly spiffy fire-fighting skills\n- Blocky, retro visuals with just a touch of the modern\n- Rockin' tunes","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Joindots","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":17315,"name":"Escape This","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c43/c43ae8f5b793a966787bd703c67f6551.jpg","description":"Escape This is a casual puzzle game where the main objective is for the player to complete the given stage.\nEach stage is selected at random.\nAll maps can be edited and you are also able to create your own unique maps and share them with the rest of the community.\nCan you escape?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Four Winged Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14015,"name":"Dungeons - The Dark Lord","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99e/99ebcc3deff316368da21406b1df4ef0.jpg","description":"Steam Exclusive OfferDungeons - The Dark Lord Steam Special Edition contains three exclusive multiplayer-maps. The maps Dunst, Playfreight and Labda were specifically designed for the brand-new game mode Piñata and are ideal for fast and thrilling multiplayer battles.\nAbout the GameDungeons: The Dark Lord is the sequel to Dungeons, the game where the more evil you are, the better! There are a slew of exciting new features, including four-player multiplayer in four modes! Along with the addition of multiplayer modes such as Deathmatch and King of the Hill, there’s now the ability to play as some of the game’s popular bosses (Minos, The Dungeon Lord, the Zombie King and more) in multiplayer, along with the addition of an extensive single-player campaign, a new dungeon setting and 25 new prestige gimmicks.\nKey Features\t\t\t\t\t\tFour multiplayer modes for up to four players: Deathmatch, King of the Hill, Piñata and Survival\nEntirely new, fully scripted and voiced single-player campaign\nNew dungeon setting (ice crystal cave) with new graphics, unique prestige gimmicks and a new boss monster\nPlayable bosses in multiplayer modes (Minos, Zombie King, Calypso and Dungeon Lord)\nVarious dungeon graphics sets and inventories are now available\nNew set of skills specifically for multiplayer modes\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Realmforge Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10150,"name":"City Car Driving","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a05/a05f58a6311d0e6b1807f4a660fbcdca.jpg","description":"City Car Driving is a driving game that will help you to master the basic skills of car driving in different road conditions, immersing in an environment as close as possible to real.\n\"Smart\" traffic that accurately simulates traffic in the current, unpredictable pedestrians and sudden dangerous situations will not let you relax and will maintain the atmosphere of a real traffic situation. Also full range of weather conditions and times of a day from rain and morning fog to night ice and snow will help to prepare for driving under the most unfavorable conditions.\nUsing the traffic rules compliance monitoring system and the instructor hints you will fix the knowledge of traffic laws in different countries of the world. The list of these countries will expand in updates. On special autodromes you will be able to work out different types of exercises, both basic, for instruction in driving, and special, for working out the elements of extreme driving and counter accident training.\nKey Benefits:\nPractical driving skills in the city and on the autodrome training.\nMechanical and automatic gearboxes are supported and work in accordance with real analogues.\nTraining of counter accident driving at a specialized autodrome.\nRealistic traffic behavior which can violate traffic rules.\nSudden dangerous situations such as: going to the oncoming lane, a sharp stop, an unexpected car order change in traffic, pedestrians running across the road, broken traffic lights etc.\nA wide selection of cars. In addition to the various versions of cars in the game are presented: a small truck, minivan, SUV, pickup and subcompact as well as cars with the right-hand drive. These cars have the entire set of controls including the sound signal and lights.\nRandom routes in free driving mode with customizable parameters.\nIt is possible to choose the time of day and weather conditions (rain, snow, ice, night, fog etc.)\n\nNarrow tangled courtyards and multi-level parkings with lots of cars.\nTrams as full-fledged participant of traffic.\nSupport of traffic rules of different countries: the USA, Australia, the European Union, Germany, the Russian Federation including the right-hand and left-hand traffic regimes for the respective countries.\nRecording/playback function for later analysis of driving errors.\nSupport of racing wheels, gamepads and joysticks.\nSupport of virtual reality devices: Oculus Rift and HTC Vive as well as TrackIR head tracking system.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Forward Development","platforms":[{"id":0,"name":"PC"}]},{"id":894472,"name":"PROJECT: PLAYTIME","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9f/c9f646248d4331fce1f56810c5727116.jpg","description":"PROJECT: PLAYTIME is a free-to-play multiplayer horror game where six players attempt to create one giant toy while surviving a terrifying monster that roams the toy factory. A seventh player controls the monster and is given only one goal: Find and kill everyone.Can you hear us?Welcome to your job as a Resource Extraction Specialist here at Playtime Co., the largest toy company in the world! You've been assigned to a special unit responsible for extracting giant toy parts from closed off areas of the factory. The parts are locked behind cryptic puzzles and guarded by freakish monsters that've taken over these once magical locations. Retrieve the parts, avoid any kind of contact with the monsters, and most importantly... don't die.Can you see this?Prepare yourself for a 6v1 battle of survival. Six players will take the role of a Survivor. Together, they must solve puzzles and forge together a toy of epic size, all while trying to stay alive. One player will take on the role of the Monster. There are several characters to choose from, all offering a unique set of skills used to catch and kill their prey.Give us a sign.• THE GRABPACK - Survivors wield a powerful tool known as the GrabPack. With two long, extendable arms, you can do most anything. Whether it be carrying a heavy object, grabbing something from far away, completing puzzles, or gripping doors to slam them shut in the face of the monster, the GrabPack is more than capable.\n• MANIC MONSTERS - As a monster, you have three distinct characters to choose from, each one a living, gargantuan monstrosity based off a Playtime Co. toy. Huggy Wuggy, Mommy Long Legs, and newcomer Boxy Boo all offer their own sets of abilities and unique styles of play. Whether you wish to be a manic brute with Huggy, quick and nimble with Mommy, or a springy hunter with Boxy, there's a monster to fit the bill.\n• SABOTAGE - Monsters will always want the element of surprise. Using Toy Tickets (Toy Tickets are an in-game currency that can only be earned by playing the game. You cannot purchase these tickets, there is no pay-to-win), you can purchase and upgrade new abilities called Sabotages. These allow you to get the jump on players. Use these to blind the survivors, boobytrap their path, destroy their GrabPacks, and so much more.\n• FEAR FACTORY - Playtime Co. is the king of the Toy manufacturing industry- and you're inside it. Explore two massive maps that feature many different sections of this crooked factory. A state-of-the-art theater with statues of fake gold, and a manufacturing area where toys are a'plenty.\n• BETTER & STRONGER - Survivors won't be limited to any default abilities. Stretch further and build your own class with Perks! You can purchase and upgrade perks with Toy Tickets (Toy Tickets are an in-game currency that can only be earned by playing the game. You cannot purchase these tickets, there is no pay-to-win). With these perks, you can be whatever type of Survivor you dream of. Be it a Puzzle Master or Medic, Speed Demon or Shadow Walker; however you want to play is covered.\n• LOOKING GOOD - Wanna take the looks of your character to the next level? PROJECT: PLAYTIME offers a rotating shop with new cosmetics constantly, and a seasonal TOY BOX, which offers 100 levels of cosmetic glory. Look fantastic as you fight to survive. Or, if you're the monster, look fantastic as you rip everyone apart.\nPROJECT: PLAYTIME has lots to offer... and much more to come.\nWon't yo̷͔̎u̷͉̅ p̷͎̫̜̍̄̏̅l̸̨͉̿̄͝aå̴̡͇̪̽̑͗̉͜ÿ̴̰̯́́͂͑͌͠ ̵̡̭̪̖̣̰̿͑͛f̸̟͒̅͐͠a̸̫̬̻̹͘i̸̛̤̮͓̜͔̰̎̓̎̿r̶͚̣̘͛͝.̷͍̻̙͔̄̽̊̈́͗̕THE BIGGER BODIES INITIATIVE WILL FAIL.WE WILL PREVAIL.STAY ALERT.WE WILL BE IN TOUCH.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"MOB Games","platforms":[{"id":0,"name":"PC"}]},{"id":510043,"name":"Impostor Factory","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/050/05097833adfeedffb4897e98d8510c4a.jpg","description":"A bonkers time-loop tragicomedy murder mystery thriller featuring multiple casualties and a suspicious cat, from the creator of To the Moon.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Freebird Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":57885,"name":"Assassin’s Creed Rogue Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ef/1efc680174828ac07312dbb1f6265ba9.jpg","description":"Experience the darkest chapter in Assassin’s Creed lore yet, remastered for next-gen platforms. Assume the role of Shay, an Assassin during the French and Indian War, and witness the cataclysmic events that force him to betray the Brotherhood in order to prevent further catastrophe. Play the most visually stunning version of Assassin's Creed® Rogue, with remastered graphics for next-gen platforms. Become the most feared Assassin hunter in history as you battle former allies as a member of the Templars. Cast off in your ship, the Morrigan, and set sail with improved naval gameplay featuring new weapons and enemy tactics.  Assassin’s Creed Rogue has also been remastered for Xbox One X (featuring native 4K) and Xbox One (featuring 1080p).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":31724,"name":"Need for Speed: Hot Pursuit 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/907/90794495addba417489b92bf64054889.jpg","description":"Need for Speed™ (NFS) is back and better than ever in Need For Speed™ Hot Pursuit 2! Engage in the next generation thrill of arcade racing with the successor to Need for Speed™ III Hot Pursuit.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Electronic Arts Black Box","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":14353,"name":"The Deed: Dynasty","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/467/46712c18c62d4cb5abce2d2d2b8fa981.jpg","description":"The Deed is a game in which you must commit a murder and then, through a process of making the right choices and planting the appropriate evidence, convince the authorities of your innocence and somebody else's guilt. The stand-alone expansion Dynasty offers three new scenarios based on this original concept.\nTaking place in three different eras, each of these new scenarios allows you to explore the sordid ancestry of the Bruce family as you take control of a character who aims to commit a murder and escape free of suspicion by framing one of the other characters in the game. You will explore a 15th century English castle and a wild west frontier saloon, before finally returning to Dunshiel House fifty years prior to the events of the original game.\nJust as in The Deed, every decision you make can influence the outcome and lead to one of many possible endings, which are even more varied and numerous this time. There are many ways to do the deed, multiple pieces of evidence to use to your advantage and a wide selection of characters to frame for your crime.\nExplore the Setting\nThis expansion aims to provide richer and more varied environments which immerse the player in the various historical time periods of the game, whether it's Medieval England under the reign of Henry IV, a violent frontier town in the Old West or a grand old estate in the Victorian era.\nMeet the Characters\nEach scenario contains a number of non-player characters, some of whom are based on real historical figures, and almost all of whom can be framed for the murder. The conversation system has been developed and improved, offering a greater amount of control for the player and more branching options which will lead to a more unique experience every time.\nChoose the Murder Weapon\nChoose from various murder weapons appropriate to the time period in which you find yourself, whether it's a medieval greatsword, a pair of household scissors or a good old-fashioned six-shooter. Figure out which method of murder is likely to point towards a character other than yourself.\nPlant the Evidence\nItems of evidence can be used in multiple ways to raise the suspicion of the authorities. Think carefully about which piece of evidence could be used to frame which characters, depending on where you plant it.\nFace the Authorities\nThere's no question that the stakes are higher this time. Life in prison is one thing - but what about finding yourself on the headsman's block or strung up at the gallows for a grisly public execution?\nLife could be brutal in the olden times, and so could the death of a convicted criminal. Can you manage to do the deed while also avoiding such a terrible fate?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":816311,"name":"The First Descendant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a7/7a7ea9668c41b7c9cc7c1f5d188a2571.jpg","description":"The First Descendant is a free third-person cooperative action RPG shooter featuring high-quality graphics. Experience the fun of strategic boss fights through 4-player co-op and various unique characters, exciting gunplay, and looting. A variety of equipment is necessary for growth, and you can obtain them through clearing scenario missions within the game or in the World Missions where cooperation is crucial and battles with huge bosses.\n\nThe player becomes a Descendant in the game and is given a mission to fight against the invaders for the survival of humans and to protect the ‘Ingris continent’. The player can experience a spectacular story by growing stronger through various missions and stories to finally discover the Descendants' secret. You can also feel the First Descendant’s unique atmosphere through high-quality fields developed with Unreal Engine 5 and gain a new experience of reality and SF fantasy coexisting in one place.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Nexon","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":56097,"name":"Mario Kart: Double Dash","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/379/379d8862e9dfccb12bfba3a131d99dd8.png","description":"Mario Kart: Double Dash!! (Japanese: マリオカートダブルダッシュ!!, Hepburn: Mario Kāto: Daburu Dasshu!!) is a racing game developed by Nintendo Entertainment Analysis & Development and published by Nintendo for the GameCube in 2003. The game is the fourth installment in the Mario Kart series and the third for home consoles after Mario Kart 64. It was preceded by Mario Kart: Super Circuit from 2001 and was followed by the handheld game Mario Kart DS, which was released for the Nintendo DS in 2005.\nSimilar to previous titles, Double Dash!! challenges Mario series player characters to race against each other on Mario-themed tracks. The game introduced a number of new gameplay features, such as supporting co-op gameplay with two riders per kart. One player drives the kart, and the other uses items. Players can switch at any time. Double Dash!! is the only game in the Mario Kart series to allow cooperative gameplay so far. Double Dash!! supports LAN play using the Nintendo GameCube Broadband Adapter, allowing up to 16 players to compete simultaneously. There are 20 characters to select from in total, each of which with a special item, and with eleven characters being new to the series.\nDouble Dash!! received positive reviews by critics; it attained an aggregated score of 87 out of 100 on Metacritic. Reviewers praised the graphics and the new gameplay features, but elements of the voice acting were poorly received. It was commercially successful, with more than 3.8 million copies sold in the United States, and more than 802,000 copies sold in Japan. It is currently the second best-selling GameCube game of all-time, selling around 7 million copies worldwide.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Nintendo","platforms":[{"id":0,"name":"GameCube"}]},{"id":37413,"name":"Colin McRae: DiRT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfb/bfb28df4f345165327555507c955a62a.jpg","description":"DIRT™ takes players on an adrenaline fueled ride through a massive range of off-road racing. Dedicated hardcore fans of the series will love the new evolved McRae experience while the diverse selection of off-road competitions will provide a high-speed ride for newcomers to the game.\r\n\r\nGet ready for total mud splattering, gravel churning, handbrake turning, off-road racing in DIRT™.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":29207,"name":"Zombie Panic! Source","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b4/2b450973601a3fef6ea27f24583154f0.jpg","description":"Dive into the zombie apocalypse with Zombie Panic! Source: a cooperative, survival-horror first-person-shooter. One of the most popular Half-Life 2 modifications of all time.\nChoose your team as the undead or a survivor. Enjoy their unique abilities, weapons, and challenges in this high-paced, action-packed thriller.The TeamsAs a survivor, unlock large arsenals of firearms, explosives and improvised melee weapons. Can you stop the waves of undead? Will you engage the horde head-on, or barricade and fortify while your friends play sniper?  If all else fails, Panic! Then run as if your lives depend on it… for they surely do.\nAs a zombie, you’re free to hunt the living like the rabid beast you are. Feast upon their flesh and unlock your inner berserker. Heightened zombie night-vision gives you the upper hand in dark environments. Infect survivors as the carrier zombie (patient zero), to weaken their defenses, then sadistically watch them turn on each other. Use it all to your advantage to strategics, ambush, conquer and destroy your oblivious living counterparts.GamemodesZombie Panic! Source hosts a variety of game modes for excellent replayability. Explore the zombie apocalypse with:\nSurvival Mode: Put your ability to scavenge and survive to the test. Easily the top player choice.\nObjective Mode: You’re on a mission. Whether it’s to escape or defeat the horde, you’d better use your brainz to find those keys, get the power back on, hack that computer, and get to the chopper! Otherwise… I think you know what happens.\nHardcore Mode: For experienced zombie connoisseurs, you and your teammates get to enjoy pitting yourselves against extra tough foes, and even rougher odds.\nAssault Mode: Capture the Point. Points are awarded for completing side objectives, adding to the overall score of the players’ team which in the end decides the victor.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Zombie Panic Team","platforms":[{"id":0,"name":"PC"}]},{"id":11559,"name":"Jack Orlando: Director's Cut","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ef/6efef7bd794f09f66cec11f0b2f44ced.jpg","description":"1933 will go down in the history books as the year America passed the 21st Amendment to the Constitution. Prohibition is over. To the delight of millions, alcohol can now flow freely across the thirsty land. Two days before the official announcement, bars and clubs across the land are stocking up on quality whiskey. This is the absorbing story of a scruffy but shrewd private investigator who becomes the prime suspect in a mysterious murder case through no fault of his own. Jack now has only 48 hours to slip the noose and find the real offender. The sands of time are rapidly running out for Jack – he must unravel the threads of the mysterious plot in which he finds himself – a race against time!\nYou, my friend, are the main suspect in a murder case! You’ve been given a chance to prove your innocence, so you better get your Sherlock Holmes act together – fast! In the character of JACK ORLANDO - the down-at-heel detective who’s never at a loss for words – you’ll come across cunning characters, garrulous gangsters, endless enigmas and tense situations throughout this fantastic comic-style adventure. There are 4 entire episodes containing over 200 action-packed scenes in dark alleys, fine saloons and seedy brothels – and the actors are a multitude of tough and sly underworld characters. You’ll have to keep your eyes wide open for clues, no matter where you are... only by putting two and two together will you reach your objective.\nThe Director's Cut Version of the game offers six new scenes, normal and easy game mode as well as a lot of additional puzzles.FEATURESHand-drawn animated 2D graphics adventure\nProfessionally synchronized voices\nSmooth scrolling and light sourcing\nOver 200 Scenes in 4 episodes\nNearly 100 characters and thousands of dialog lines\nPlayable in window and in full screen mode\n2 difficulty modes: Easy and Normal\nMusical Score in 5.1 composed by Grammy Award Winner Harold Faltermeyer","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":797882,"name":"Rollerdrome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc5/fc559aef4747196196f7780dd55bc2bc.jpg","description":"Rollerdrome is a singleplayer third person action shooter that seamlessly blends high-octane combat with fluid motion to create an action experience like no other. Dominate with style in cinematic, visceral combat where kills net you health and pulling off tricks and grinds provide you ammunition, in this adrenaline-pumping action shooter.\n\nThe year is 2030. In a world where corporations rule and the lines between reality and performance are blurred, the public are kept distracted by the violence and excess of a brutal new blood sport — Rollerdrome. Will you have what it takes to become the Rollerdrome champion and unravel the mysteries behind the Matterhorn corporation’s true intentions?\n\nFrom Roll7, the minds that brought you the award winning and critically acclaimed OlliOlli series comes Rollerdrome, an intense shooter-skater hybrid set in an evocative retrofuture.\n\nKey Features:\nA third person action shooter like no other – an original hybrid shooter-skater that blends high octane, visceral combat with fluid movement and tricking mechanics into one complementary and challenging whole.\nA test of skill – Take on a unique challenge throughout the Rollerdrome tournament. Establish your dominance in the field with online leaderboards and push yourself to the limit with the unlockable \"\"Out For Blood\"\" mode for the most extreme test of skill and agility.\nAn original identity – An all-new fully original soundtrack that merges iconic era sounds and tones with cutting edge production to provide a heart-thumping backdrop to the carnage, brought to life with a unique comic-book inspired art style.\nA dark conspiracy – Discover a mysterious, sinister plot in this distinct retrofuture universe.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Roll7","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":704789,"name":"Sonic Frontiers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2b/f2bc84509d92c95a8ad22caa8c8afa06.jpg","description":"Worlds will collide in Sonic the Hedgehog’s newest adventure. An experience like never before, accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzling deserts and more! ! This Holiday 2022 - Journey into new realms.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sonic Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"}]},{"id":494379,"name":"The Invincible","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a41/a41faac69727bc7766b3b78f0acfec2f.jpg","description":"The Invincible is a first-person Sci-Fi thriller set in a retro-future timeline. Waking up as a space scientist on a hostile planet, you embark on a mysterious mission to find the missing crew of your spaceship. Survival is a matter of your correct choices, taken whilst uncovering the secrets of the planet, bigger than anyone thought.\n\nYou are a scientist onboard an interstellar scientific expedition, suddenly thrown into a life-or-death rescue mission. Landing on a planet Regis III you have to find the missing crew members using some advanced space equipment, whilst relying on your brains and instincts to survive on the planet which quickly occurs to be unwelcoming. Soon you’ll discover that Regis III holds terrifying secrets which are uncovered while you’re piecing together the fate of your crew. And as you delve deeper into the mystery, you realise that perhaps you are not alone, and that some places like this planet are better left untouched. But it’s too late to turn back.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Starward Industries","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]}]