[{"id":28532,"name":"Banjo-Kazooie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0d/f0da831778e57b58636ccaf20a7cc6e6.jpg","description":"The bear and bird's first ever outing available in full. Loads of rollicking fun to be had here and with the legendary Stop N Swop feature reinstated. You’ll never look the same again at a jigsaw.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Rare","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":327239,"name":"The Legend of Zelda: Tears of the Kingdom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/556/55684bfd048706f4266d331d70050b37.jpg","description":"An epic adventure across the land and skies of Hyrule awaits in The Legend of Zelda™: Tears of the Kingdom for Nintendo Switch™. The adventure is yours to create in a world fueled by your imagination. In this sequel to The Legend of Zelda: Breath of the Wild, you’ll decide your own path through the sprawling landscapes of Hyrule and the mysterious islands floating in the vast skies above. Can you harness the power of Link’s new abilities to fight back against the malevolent forces that threaten the kingdom?","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":251598,"name":"Project Warlock","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/def/def19f4d1cac3e18e0d1e0d2ab2f18a6.jpg","description":"One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll!\n\nExplore 60 vast levels in five settings, from frozen Antarctic base to the sands of Egypt to the medieval castles’ courts and graveyards. Find keys to unlock passages, reveal secret caches with ammo and gold, use lifts and hidden buttons to access new areas. Finally descend to hell to face the ultimate challenge and emerge victorious.\n\nCombat tons of enemies from flying demons to five-storeys robots, splashing walls and floors with their blood and chunks. Dodge bullets and projectiles, figure out strategies and weapons that work best against each of the nasty villains. Learn their moves and stay one step ahead to survive through the levels. Face megabosses in vast final arenas to complete each world.\n\nExpand your arsenal with new weapons found along your way. From powerful blades to massive guns, collect and develop your favourite gear and master the craft of carnage. Reach into vast arsenal of 38 types of weapons and learn their secret tricks to deliver maximum damage, fast! Grab ammo and spit out series of bullets, walls of flames, and bursts of magic shots to bring down enemies foolish enough to stand in your way.\n\nDevelop your hero the way you like, by assigning upgrade points and perks to the favourite skills between each level. Develop and upgrade spells and weapons to create your unique character through the game, and use their powers to master the game in higher difficulty modes.Features:60 levels\n5 worlds\n72 enemies\n38 weapons\n8 spells\n12 perks","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Buckshot Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":17590,"name":"Devil Daggers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9cf/9cfb04d5480b105075226f02121ed3ae.jpg","description":"Devil Daggers is a shooter developed by Sorath. This is the only game in the franchise. \n\n###Plot \nThe player aims to survive through attacks by armies of demonic monsters for as long as possible. To survive, the player must defeat enemies or avoid contact with them; as the game goes, the monsters become more. The action is taken on a field shrouded in darkness. As a weapon, the protagonist can fire daggers from fingers. \n\n###Gameplay \nDevil Daggers is a first-person shooter. As the game starts, the player fetches fire daggers.\nThen he is transported to the dark arena, where monsters begin to spawn. The goal is to fight off every appearing enemy. More exotic creatures appear throughout the game; later on, the player can recognize the type of a monster based on the unique noise one makes. There are two alternatives in using the daggers: the protagonist can either fire a shotgun-like blast with a widespread (the player clicks the left mouse button) or fire a continuous stream of them (the player holds the mouse button). The player can die if he touches an enemy, or if he falls off the stage. After that the player can fetch the red crystals dropping from the top of the screen – it lets them upgrade the daggers. \n\n###Key features \nThe game design uses distorted effects like texture warping and polygon jitter. That makes it look like an old shooter game from the 1990s.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sorath","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":367197,"name":"Ni no Kuni: Wrath of the White Witch Remastered","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b8/0b8beb60852f43eb3e5e57b1b7ce209d.jpg","description":"Journey back to the other world in Ni no Kuni: Wrath of the White Witch Remastered. LEVEL-5’s classic tale returns better than ever, with improved graphics and performance. Join Oliver as he embarks on an adventure through a world inhabited by new friends and ferocious foes alike in the hopes of bringing back his mother after a tragic incident.\nThis charming tale unfolds through the use of animation storyboarded and created by the legendary Studio Ghibli and music composed by the renowned Joe Hisaishi. Ni no Kuni: Wrath of the White Witch combines beautiful animated visuals, masterful storytelling, and a sweeping score to create an epic role-playing adventure like no other.\n1 player\n20GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nNi no Kuni: Wrath of the White Witch™ Remastered & ©2019 LEVEL-5 Inc.\nPublished by BANDAI NAMCO Entertainment America Inc. in the Americas.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Level 5","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":428559,"name":"F1 2020","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd6/cd64ec71d501de0eb32f6b1f50e4c060.jpg","description":"DELUXE SCHUMACHER EDITION\n10% OFF THE DELUXE SCHUMACHER EDITION IF YOU OWN F1 2019!\nThe entire F1® 2020 game and the “Deluxe Schumacher Edition” DLC Content plus the “Seventy Edition” DLC Content and 3 days early access.\nCelebrate the record-breaking F1® career of the legendary Michael Schumacher. Take to the circuit in four of his most iconic cars and receive exclusive content including Michael Schumacher-themed multiplayer car liveries, helmets, race suits, and a podium celebration emote. You can also embark on your career using a Michael Schumacher driver model.\n•\tx4 iconic Michael Schumacher cars:\n•\t1991 Jordan 191\n•\t1994 Benetton B194\n•\t1995 Benetton B195\n•\t2000 Ferrari F1-2000\n•\tExclusive Michael Schumacher in-game model, race suits, helmet designs and podium celebration.\n•\tUnique Schumacher-inspired multiplayer car liveries.\nPre-Purchase Offer\nThe entire F1® 2020 game and the “Seventy Edition” DLC Content.\nCelebrate the 70th anniversary of F1® with unique in-game customisation items - car livery, podium celebration, helmet, race suit, gloves, boots and player badge.\nAbout the GameF1® 2020 is the most comprehensive F1® game yet, putting players firmly in the driving seat as they race against the best drivers in the world. For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top.\n•   Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple seasons, career.\n•  The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level.\n•  F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort.\n•  Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.\n•  THE OFFICIAL VIDEOGAME OF THE 2020 FORMULA ONE WORLD CHAMPIONSHIP™\n•  NEW MYTEAM MODE - An immersive driving game, players can now create their own F1® team.\n* Create a driver, then choose a sponsor, an engine supplier, hire a teammate and compete as the 11th team on the grid.\n* Build facilities and develop the team over time and drive to the top.\n•  NEW - Two new races: Hanoi Circuit and Circuit Zandvoort. NEW - Split-screen racing.\n•  NEW - Casual race options for more relaxed racing.\n•  NEW - Shorter season-length options: 10, 16 or full 22 race options.\n•  All the official teams, the drivers and circuits from the 2020 Formula One World Championship™.\n•  Acclaimed ten-year career mode.\n•  Formula 2™, the ultimate training ground for F1®, is also included, now with new half or full season options and 2019 and 2020* season content.\n•  x16 classic F1® cars from 1988-2010.\n•  ESports - in-game area for the online qualification events, latest news and even watch the new F1® ESports Challenger and Pro Series races.\n•  More ways to race: Time Trial, Grand Prix™ Mode, Championships and relive your glory with saveable automated highlights.\n•  Compete online in Multiplayer: Ranked and Unranked races, Leagues, Customisable Liveries and Weekly Events.\n•  10% OFF THE DELUXE SCHUMACHER EDITION IF YOU OWN F1 2019!\n*Online connection required to download the final teams’ 2020 cars (as applicable) and the F2™ 2020 season content post-launch.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":514,"name":"Sine Mora","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9c2/9c24c4e02fcfc6838df00858a4d11cce.jpg","description":"Sine Mora is a side-scrolling shoot 'em up game developed by Digital Reality.\n\nSet on the distant planet, that is ruled by the Layil Empire, the race of Enkie is being enslaved and exterminated. The story revolves around two resistance groups that fight for different goals and in different parts of the planet. They eventually get together and cooperate. Enkies are able to time travel, so the story is set in different timelines both in the past and the future. \n\nEvery level of the game has to be completed before the time limit expires. Players gain more time by destroying enemy targets and lose time for getting hit. There are multiple weapons in the game such as seeker missiles and energy beams. The players can slow down time. Powerups are also scattered around the levels which increase the rate of fire or replenish ammo. There are 18 bosses featured in Sine Mora. The players have to figure out the weak spots and the tactics of their enemy in order to pass the level.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":22510,"name":"StarCraft II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/960/9605c08bf8535c00adbb0a3896f0c484.jpg","description":"StarCraft II: Wings of Liberty is the long-awaited sequel to the original StarCraft, Blizzard Entertainment’s critically acclaimed sci-fi real-time strategy game. StarCraft II: Wings of Liberty is both a challenging single-player game and a fast-paced multiplayer game, and it also taps into Battle.net – Blizzard Entertainment’s fully-featured online gaming service.\nStarCraft II features three distinct ’races’ whose armies comprise entirely unique units and structures. Each race has its own strengths and weaknesses, and knowing their tactical profiles can mean the difference between glorious victory or crushing defeat.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3232,"name":"GALAK-Z","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e57/e5779687f672459951d364b2cc66dc35.jpg","description":"Brand New features!! The Void DLC offers endless gameplay, Online Leaderboards, and a Daily Challenge that allows players to compete worldwide for the top score.\nPrepare for the bar to be raised on deep-space 2D dog-fighting! GALAK-Z is a modern, A.I. and physics-driven open-world action game, viewed through the lens of the classic 16-bit space shooter. Powered by the next-generation Cyntient AI platform, GALAK-Z puts players in control of anime-inspired spacecraft inhabiting procedurally generated worlds.\nIn GALAK-Z both stealth and skill are required to defeat truly intelligent enemies. You will be forced to outsmart enemies that think, react and cooperate like seasoned pilots! Master your ship’s sublimely-honed controls as you blast enemies, unleash missile salvos, and even toss your opponents, mech-style, to their explosive demise.\nRecently added, Arcade Mode lets you replay failed missions any number of times without losing all of your saved progress. Rogue Mode retains GALAK-Z’s original white-knuckle roguelike challenge that harkens back to the 16-bit era of gaming. Rogue mode will always be available if and when you’re looking to test your skill and bravery by putting everything on the line, every mission.\nPlayers will be forced to outmaneuver, outgun and outsmart enemies that think, react and cooperate like seasoned pilots. Both stealth and skill are required to defeat enemy squads in a brutal game of cat and mouse. Prepare for an enemy that comes alive like never before!\nExclusive Guest Star: Juan from Guacamelee featured as an enemy unit in the game!\nNew The Void DLC w/ endless gameplay and Online Leaderboards and a Daily Challenge\nARCADE mode with per-Mission checkpoints\nProcedurally-assembled levels\nPhysics based combat simulator!\nAdvanced enemy A.I for intense dogfights!\nScripted missions and ‘roguelite’ structure\nResource-based, progressive weapons system\nInspired by 70s / 80s anime and arcade shooters","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"17-BIT","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":692541,"name":"Tiny Tina's Assault on Dragon Keep: A Wonderlands One-shot Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfa/cfac855f997f4877b64fc908b8bda7b7.jpg","description":"Play Tiny Tina's Assault on Dragon Keep, then wishlist its full-size follow-up Tiny Tina's Wonderlands!\n\nSmash skeletons, defeat dragons, and battle giant golems in Tiny Tina's Assault on Dragon Keep: A Wonderlands One-Shot Adventure. Experience the acclaimed 2013 quest that started it all in this standalone campaign jam-packed with fantasy, fun, and mountains of magical loot!\n\nThe Queen's been captured and her kingdom is in peril; only you and your friends have any chance of restoring peace to this eccentric, enchanted land. Blast your way through treacherous forests, spooky crypts, and fearsome fortresses, but beware—your journey can change in an instant on account of Tina's gleefully chaotic whims. Dive into this epic tabletop romp and get ready for the fantasy fight of your life!\nPick-up-and-play Action\nChoose your character from a roster of six unique Vault Hunters, each with their own signature abilities and powerful builds, and jump into chaotic fantasy battles right away in solo or co-op\nA World Of Adventure & Danger\nThere's no telling what'll happen next with Tina as your Bunkermaster! Be ready for anything (especially hungry Mimics masquerading as treasure chests)\nWhere Shooting & Looting Met Casting\nVanquish any villains who get in your way using a huge assortment of souped-up firearms, all while firing Lightning Bolts and Fireballs from your fingertips with spellcast-style grenade mods","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":548148,"name":"Yakuza 3 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/372/372ad5555afd1c58e39914600a412b84.jpg","description":"Experience the third chapter of the Kazuma Kiryu saga with restored content in 1080p and 60fps.\r\nA year after the Kanto-Kansai all-out war, Kazuma Kiryu and Haruka Sawamura have left the unforgiving streets of Kamurocho for the island of Okinawa to run the Morning Glory Orphanage. Despite his efforts, shadows of Kiryu's past threaten to entangle the Morning Glory Orphanage in a deadly power struggle involving the Tojo Clan and political world.\r\nThus begins a dramatic tale set in the \"\"sleepless city\"\" of Kamurocho in Tokyo and the tropical lands of Okinawa. Can Kiryu rescue the children of the orphanage from the looming threats emerging from the depths of the underworld and state power?\r\nComplete The Dragon of Dojima’s journey.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":52201,"name":"Yakuza 6: The Song of Life","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e35/e355efef97722d50bec3482a2263b962.jpg","description":"How far will you go for family? Three years after the events of Yakuza 5, Kazuma Kiryu, the Dragon of Dojima, returns in Yakuza 6: The Song of Life with the dream of living a quiet life. Upon his arrival, he discovers Haruka has been involved in an accident and has slipped into a coma, leaving her young son, Haruto, without care. To protect this child, Kiryu takes Haruto to the last place Haruka was spotted, Onomichi, Hiroshima. There, a new and merciless world of Yakuza awaits the unlikely pair. Who is Haruto’s father and why are the Tojo Clan and Yomei Alliance both after him? With some unlikely friends, Kiryu will have to navigate through the criminal underworld he left behind and fight for the answers to keep the family he loves safe.\nYakuza 6 features an emotional story that examines the strength of family relationships, and highlights an improved battle systems that seamlessly transitions between battles and between explorable areas.\n1 player\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© SEGA. SEGA, the SEGA logo and Yakuza are either registered trademarks or trademarks of SEGA Holdings Co., Ltd. or its affiliates. All rights reserved. SEGA is registered in the U.S. Patent and Trademark Office. All other trademarks, logos and copyrights are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":28422,"name":"Crackdown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e0e/e0e00170997566985f989abe60040320.jpg","description":"###The start of the series\nCrackdown is a series of sandbox games in the open world for Microsoft's Xbox 360 console. The game, released in 2007 is considered the first in the series.\n\n###Key features\nThe action takes place in the fictional Pacific City. The player is given control over the biologically improved Agent. The agent is the representative of the Agency, it was called to Pacific City because of the sudden increase in crime. The main task is to eliminate three criminal bosses and organized crime syndicates: Los Muertos, The Volk and Shai-Gen Corporation. In order to get to the very top and overthrow every villain, the player will have to travel around the city and defeat the first level of the criminal hierarchy: thieves and bandits. Each gang is assigned its own district - so capturing an offender in one area leads to the next level in the hierarchy of one of the gangs. Having defeated the kingpins the player can challenge the head of the criminal organization.\n\n###Game mechanics\nThe game is typical for the third-person-action set in a sandbox environment, like the games of the Grand Theft Auto and Saints Row series. Like other ones in the genre, Crackdown uses a huge set of cold weapons and firearms. As well as various skills and skills that you can upgrade: for example, for more distant jumps on the roofs, hijacking cars and studying the entire game world. For upgrading it is enough to accumulate the necessary amount of Experience Orbs. The entire territory of Pacific City is available for exploring right after the start of the game.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Realtime Worlds","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":18848,"name":"Hector: Episode 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Hector Episode 1, subtitled We Negotiate With Terrorists, is the first chapter of a three-part episodic quest by Straandlooper. You play as Hector, a police officer, permanently drunk and doesn’t fit the description of a “good cop”. However, this time the police needs Hector’s help because only he can calm down a very nervous sniper.\n\nThe goal of the game is to hold a successful negotiation with a terrorist who keeps hostages and kills passers-by. The story is based on a series of quests. There aren’t many environmental puzzles while some decisions are not quite clear; instead, the game focuses on dialogues. Choosing the right lines can lead you to solving multiple issues and simplify your way to the goal. \n\nThe game is created in 2D cartoonish style but it’s restricted for kids. Hector is full of dirty humor and controversial situations. This tone is kept in other two episodes subtitled Senseless Acts of Justice and Beyond Reasonable Doom.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Straandlooper","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1433,"name":"Verdun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/908/9084d12f0a3fbde04b483f8e147eeae5.jpg","description":"Verdun is an indie multiplayer squad-based FPS developed by M2H and Blackmill Games.\n\n###Gameplay\nVerdun is set in the World War I period and is inspired by the French Battle of Verdun. The game is historically accurate, featuring multiple WWI weaponry, uniforms, and equipment. To display the horrors of war, the game also features a detailed injury and decapitation models.\n\nMost of the matches of Verdun feature 32 players, yet it is possible to up that number to 64 in a private Frontlines mode match.\n\nThere are four game modes in Verdun:\nThe main mode is Frontlines, in which two teams fight over the sectors of an enormous and authentic frontline maps. Depicting the typical trench warfare of WWI, the players attack and counter-attack each other in turns. Each player is a part of a 4-player squad, with each squad having its own perks. 12 types of squads are available. Upon joining a squad, the players have to choose a class available to their squad type.\n\nThe Attrition Warfare mode is basically a common Team Deathmatch. Each team spawns with a number of tickets that deplete when a team member dies. The first team to lose all their tickets loses the match.\n\nSquad Defense is a cooperative horde mode when a squad of players defend themselves from waves of opposing forces.\n\nIn Rifle Deathmatch, the players participate in a free-for-all deathmatch, where every player fights for themselves. Players can purchase attachments for their weapons after killing their enemies.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"M2H","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":799265,"name":"The Last of Us Part I","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/71d/71df9e759b2246f9769126c98ac997fc.jpg","description":"Revisit the game that set a new bar for single-player narrative storytelling with The Last of Us™ and explore a ravaged and hardened world, where every action has a brutal consequence for Joel and Ellie.\n\nExperience the emotional storytelling and unforgettable characters in The Last of Us™, winner of over 200 Game of the Year awards.\n\nIn a ravaged civilization, where infected and hardened survivors run rampant, Joel, a weary protagonist, is hired to smuggle 14-year-old Ellie out of a military quarantine zone. However, what starts as a small job soon transforms into a brutal cross-country journey.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":28633,"name":"Forza Horizon 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9a8/9a8be216c8907959a9984eec3a2cc8d1.jpg","description":"The open world car racing simulator, part of the Forza game series, or rather the sequel to the Forza Horizon game, which was released in 2012. The game has a continuation - Forza Horizon 3.\n\n###Gameplay\nIn the story of the game, the player participates in the fictional Horizon racing festival, taking place in southern France and northern Italy.\n\nThe game world of Forza Horizon 2 is about three times larger than the world of the game Forza Horizon.\n\nIn total, the game has more than two hundred different cars, among which there are exotic, rally, trucks and \"hot\" hatchbacks. Among them: Lamborghini Huracán LP610-4 and Lamborghini Aventador in the version of Veneno, McLaren P1, LaFerrari, Koenigsegg Agera, Bugatti Veyron in the version of Sport.\n\nPlayers explore the terrain in which the races take place, take part in races and other events - without all this, you cannot advance further in the game. Time of the day, day and night, were present in previous games, and in Forza Horizon 2 for the first time in the Forza Motorsport series a dynamic weather system was implemented.\n\nTo the modes of the game, known from previous games, new modes are added. For example, the Bucket List is a group of competitions, the result of which is taken into account for all group competitions in total. In multiplayer mode in the Bucket List, you can invite a friend or a random player, this mode has its own name Co-Op Bucket Lists. Another mode, also multiplayer, Car Meets, allows players to compare their cars. For multiplayer ringing modes are also available, sprint races, off-road racing and others.\n\n###Additions\nThe first addition to Storm Island (for the Xbox One version of the game) contains a new terrain - Storm Island. It has its own tracks, five new types of competitions, the expansion of the game engine weather system, five new cars and one car in the hangar.\n\nThe supplement dedicated to Porsche cars contains ten cars, including the Porsche 944, Porsche 911 GT3 RS, Porsche Macan Turbo, Porsche Cayman GT4.\n\nForza Horizon 2 also has a Fast & Furios cinema franchise - Forza Horizon 2 Presents Fast & Furious. In this supplement, nitrous oxide appears for the first time in the Forza Motorsport series.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sumo Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":14352,"name":"Bionic Dues","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e5/1e552b9e7c1ab540fd4dff175e1590e9_sgvReqK.jpg","description":"Bionic Dues is a futuristic game where you have to prepare your defenses before the rise of the machines.\n\n###Plot\nThe game is set somewhere in the future, just a few weeks before a robots' rebellion. Rogue machines are about to wipe out a city of 12 million people. The defenders have only 50 days left to prepare before the final battle begins. The protagonist is a pilot who drives Exos, the game's equivalent of mechas.\n\n###Gameplay\nThe player controls a group of four Exos. Their movements and attacks are turn-based. During the 50-days period, the player has to gather details and HPs to upgrade his or her Exos, explore the map, prepare defenses, and set traps. On the final day, the player's preparations will be tested by the enemy invasion. Preparation is everything in this game. Stealth and tactical use of the environment are also important since Exos often cannot withstand against a horde of enemies in an open battle.\n\n###Difficulty\nLike many roguelike games, Bionic Dues is unforgiving. It uses trial and error gameplay model so that the player usually has to fail many times before he or she can succeed. However, there are six difficulty levels that make it more tolerable for less experienced players.\n\n###Visual style\nBionic Dues' visuals are minimalistic, cold and \"robotic\", complete with \"mechanical\" voices and high-tech unit design. It presents the player with a top-down view of the map that looks almost like a circuit board.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":663742,"name":"Marvel's Spider-Man Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f1/5f1399f755ed3a40b04a9195f4c06be5.jpg","description":"This isn’t the Spider-Man you’ve met or ever seen before. In Marvel’s Spider-Man Remastered, we meet an experienced Peter Parker who’s more masterful at fighting big crime in New York City. At the same time, he’s struggling to balance his chaotic personal life and career while the fate of Marvel’s New York rests upon his shoulders.\r\n\r\nDiscover the complete web-slinging story with the Marvel’s Spider-Man: Miles Morales Ultimate Edition. This unmissable bundle includes a voucher code** for Marvel’s Spider-Man Remastered – the complete award-winning game, including all three DLC chapters in the Marvel’s Spider-Man: The City That Never Sleeps adventure – remastered and enhanced for the PS5 console.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":4772,"name":"Alien Breed 3: Descent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8e/e8e185ed388d6a98679d850b4423ac26.jpg","description":"Initially, a series of games with the same name and plot was developed for the Amigo gaming computer, and in this series several games with sequels were released. The new incarnation of the series was created on the Unreal Engine 3 for the PlayStation 3, Xbox 360 and PC.\n\n###The general plot of the series - a brief overview\nAlien Breed: Impact\n\nTheodor J. Conrad is a mechanic on the Leopold spacecraft. In space, the ship is faced with a huge unknown ship, inhabited by hostile creatures. These creatures sneak aboard the Leopold and begin to destroy the crew.\n\nKonrad fights to save his life and the ship.\n\nHe is helped by the female android MIA, she gives advice, helps to find the right items.\n\nThe action takes place both on the \"Leopold\" and on a hostile ship.\n\nAlien Breed 2: Assault\n\nThe game begins where the history of the previous game ended. The hero of this game is the same Theodor J. Conrad, but his ship Leopold is already critically damaged and impossible to save.\n\nMIA is still trying to help Conrad, but becomes a victim of Klein - a man who managed to load his intellect into a computer that controls the alien ship. When trying to influence this computer, MIA fell under the influence of Klein's intellect and now cannot help Theodor.\n\nKlein tells Theodor that the ship was not really created by aliens, but by the inhabitants of Earth and is a huge scientific station, where earthlings explored alien beings.\n\nAlien Breed 3: Descent\n\nTheodor's situation becomes even more complex. Now the only one with whom Theodor can communicate is Klein's intellect, loaded into a computer. However, this is quite a developed \"creature\" that fully controls the ship, or rather, the scientific station, along with all the aliens on it. And this intelligence is able not only to control the aliens, but also to modify them.\n\nAs it turned out, Klein is able to send against Theodor his last ally MIA - MIA did not die, but turned into a fully manipulated Klein artificial intelligence, opposed to Theodor. However, Theodor manages to win over her and she even tells him how to defeat Klein. This is not easy, because Klein directs against Theodor all the systems of a huge ship.\n\n###Gameplay\nThe gameplay has common features in all three games of the series.\n\nAll games are shooters, the action of which takes place in the futuristic interiors of space ships.\n\nEach level contains several tasks, such as finding keys or restoring ship systems to work.\n\nBefore leaving the level, the player must complete all tasks.\n\nOpponents are aliens.\n\nInterestingly, you can save the game only in special places. The same places serve as shops where upgrades and other useful things can be purchased.\n\nInformation about opponents is revealed as the hero finds relevant sources of information in the game space.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":47270,"name":"Driftland: The Magic Revival","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/664/6641780de3a7f6c4bd93b73042b5ca91.jpg","description":"After a devastating war between the mightiest of ancient mages, Driftland has become a shattered planet, held together by a powerful spell. In the face of the destruction of an entire civilization and life on the planet, warring parties decided to call a truce and tried to repair the damage. For that, however, was already too late. Using all the remaining magic resources to cast a powerful spell, they managed to keep their world in a relative balance.\nMany dark ages have passed, but when all seemed lost, a spark of hope shined once again: new sources of magic appeared and the whole planet began to give birth to new mages. Now, the rediscovered power can either restore Driftland to its former glory or devastate what's left of the planet, when the old conflict inevitably returns.\nYou take the role of a Mage Overlord with your own castle, tower, and a small realm on one of the islands. With your unique powers, you can explore a procedurally generated world and connect floating islands, expand your increasing kingdom.\nGameplay focuses on setting general goals for all the units, without the need for micromanaging each one of them. Under your command, warriors, archers and mages are able to tame and ride different types of flying beasts, creating various aerial units.\nprocedurally generated world\nresources and magic based economy\nmove and terraform scattered islands by magic\ntame and ride dragons and other creatures\nexplore and fight on the same map\nset goals instead of directly control units\nsingle player campaign and multiplayer","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Star Drifters","platforms":[{"id":0,"name":"PC"}]},{"id":2490,"name":"Alienation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/160/1606b42f329ca35685a448d4c127f4cd.jpg","description":"Alienation is an isometric shooter with RPG elements, employing a futuristic setting where the planet Earth is under siege by alien forces. The game aims to offer the players an equally satisfying experience of both single-player campaign and a cooperative multiplayer, where up to 4 players can join together on the field of battle.\nThe game features 3 playable classes of soldiers, each with their set of weapons, traits, and tactics to work around. Different enemies fight players through every level, with rewarding loot to help the characters, such as new weaponry, which can be further upgraded with individual cores. With the progression in the story, new content becomes available, such as loot hunts and PvP arena for competitive play.\nThe in-game graphics and physics provide the players with a great deal of immersion on the futuristic battlefield, with explosions trembling the earth, the surroundings crumbling around, stunning the eye with every little detail.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":18142,"name":"Oil Rush","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/799/7993e4e11727bf33f36e4d6f68bf568c.jpg","description":"This game is a genre of naval strategy with elements of tower defense from the Russian studio Unigine Corp. The game uses the graphics engine Unigine, which is known by most gamers thanks to the benchmark Unigine Heaven. The game takes place in the post-apocalyptic world, in which the remaining factions battle for the remaining oil reserves. In the game, developers tried to abandon the micromanagement of all units, but it does not lose the depth of control, and the game is not that simple to master. In addition to managing units, the player will manage the settlements, controlling their economy and development.\n\nThe player follows the story of the protagonist Kevin, a technical worker who begins his journey from protecting the oil fields from The Raiders. The game boasts dynamic gameplay, massive battles, and beautiful graphics. 16 story missions are available for passage. Players can also play against each other on multiplayer maps, and there are a total of 15. There is also a cross-platform multiplayer.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Unigine","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15731,"name":"Hitman GO: Definitive Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8b/e8bfeeaf0459b9fd8b4ac6633d5cb5da.jpg","description":"Hitman GO is a simple to play, but difficult to master turn-based strategy game set in a stunning interpretation of the Hitman universe. You will strategically navigate fixed spaces on a grid to avoid enemies and take out your target or infiltrate well-guarded locations. This award-winning, beautifully rendered diorama-style turn-based strategy game focuses on forward thinking to progress through challenging levels and stylish freeze frame environments, to challenge even the most accomplished Hitman fan.\nWith Hitman GO, you’ll experience:\nChallenging puzzles that put your assassination skills to the test\nBeautiful scale model-style visuals\nEnvironments with secret passageways and off-limit areas\nAgent 47’s tools of the trade: Distractions, disguises, hiding spots, sniper rifles and even the iconic Silverballers\nDifferent enemy types with unique and deadly behaviours\nDifferent ways of completing each level, silently or forcefully","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix Montréal","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2848,"name":"Gravity Rush Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/71e/71e2dd25cc5265930e1c13b5e360bb0c.png","description":"Gain a new perspective as Kat, a strong-willed girl trying to protect her future in a world that's crumbling to pieces. With incredible gravity-altering abilities, Kat is the only one who can salvage the floating city of Hekseville – if only she could remember who she is…\n• Dive into a world of beautifully enhanced graphics to explore the unique 3D world, stunningly revamped from the award-winning PS Vita original.\n• Manipulate gravity with the DUALSHOCK 4 wireless controller, using its built-in motion sensors to give you a new level of control.\n• Enjoy extra missions, challenges and costumes with the Maid Pack, Spy Pack and Military Pack, all included in the game.\n• Enjoy Gravity Rush Remastered’s unique comic book art style with over 600 illustrations available to view in the new gallery mode.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2015 Sony Computer Entertainment Inc. 'Gravity Rush' is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":669363,"name":"Dagon: by H. P. Lovecraft","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/525/525ddc0a9f22c944af01f074e8983ffe.jpg","description":"Featured DLChttps://store.steampowered.com/app/1722010\nAbout the Game---------------------------------------------------------------------------------\nPlease note: THE GAME SUPPORTS BOTH MOUSE & KEYBOARD AND CONTROLLERS. WE'RE CURRENTLY EXPERIENCING A TECHNICAL ISSUE WITH A STEAM NOTICE CLAIMING OTHERWISE\n---------------------------------------------------------------------------------\nThe VR version of Dagon will be made available in October as a free update\n---------------------------------------------------------------------------------\nI am writing this under an appreciable mental strain, since by tonight I shall be no more.\nDagon is a 3D narrative experience in madness based on the cult short story of the same title by the master of cosmic horror and weird fiction, H. P. Lovecraft himself. It’s an interactive portal into the world of the controversial genius and his highly acclaimed Cthulhu Mythos, open to both newcomers and long-time devotees.\nThe change happened whilst I slept.\nStep into the shoes of a former ship officer and morphine fiend, and dive into the Stygian Abyss of a drug-addled mind. Uncover the unspeakable, long-drowned horrors on a distant eldritch island and wallow in Lovecraftian dread.\nI think I went mad then.\nSo make yourself comfortable in front of the screen or put on your VR headset, and experience cosmic horror first-hand in this 100% faithful adaptation of the original story. It will only take about 30 minutes, but you may never look at the ocean the same way.Features:immerse yourself in a fully-voiced narrative experience in real-time 3D\ndiscover the origin of the Cthulhu Mythos and the twisted world of H. P. Lovecraft\ntreat yourself to a short, free horror that can be experienced in 30 minutes\nlearn about the original story, its author and their impact on culture etc. while playing\nbuy an optional DLC to support our future projects and get additional goodies (including an audiobook and a screenshot-filled e-book)\nWarning: side effects may include insomnia, delirium and acute cosmic horror.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Bit Golem","platforms":[{"id":0,"name":"PC"}]},{"id":262389,"name":"Cloudpunk","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e1/3e18633e2f84a141e2336368517caf27.jpg","description":"Your name is Rania. This is your first night working for Cloudpunk, the semi-legal delivery company based in the sprawling city of Nivalis. You go everywhere, from the Marrow below to the spires that pierce the grey clouds high above before scraping the edge of the troposphere. No delivery job is too dangerous, and no one is faster than a Cloudpunk driver.\nIn this story-based cyberpunk game, you will meet a diverse range of characters including androids, AI and unscrupulous humans at every level of society. Everyone has a story, and in the course of one night in Nivalis, everything will change.\nFeatures:\nExplore an immense vertical cyberpunk city with your hover car and on foot\nUnravel mysteries in a world of corporate conspiracy, hackers and rogue AI through the eyes of Rania\nMeet a diverse range of characters and immerse yourself in their everyday lives\nYour decisions will have a lasting impact on the inhabitants of Nivalis\nDiscover hidden places and items unlocking additional stories","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ION LANDS","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":50675,"name":"Bridge Constructor Portal","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc2/cc2a1f137e7166adebe419cbcc86d207.jpg","description":"Enter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal™ and Bridge Constructor™ games.\nAs a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 test chambers and get the Bendies safely across the finish line in their vehicles.\nMake use of the many Portal gadgets, like portals, propulsion gel, repulsion gel, aerial faith plates, cubes, and more to bypass the sentry turrets, acid pools and laser barriers, solve switch puzzles, and make it through the test chambers unscathed.\nLet GLaDOS guide you through the tutorial, and learn all the tips and tricks that make a true Aperture Science employee.\nThe bridge is a lie!\nFeatures:\n-    The merging of two worlds: the first Bridge Constructor™ with an official Portal™ license\n-    Create complex constructions in the Aperture Science labs\n-    Let GLaDOS accompany you through tricky physics adventures\n-    Use portals, aerial faith plates, propulsion gel, repulsion gel, and much more to master the complicated tasks\n-    Evade dangers such as sentry turrets, emancipation grills, laser fields, and acid\n-    Help your Bendies cross the finish line – on their own or in a convoy","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Headup Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":44265,"name":"Cat Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a7d/a7d57092a650030e2a868117f474efbc.jpg","description":"Cat Quest is an open world RPG set in the pawsome world of cats!\nLeap into a grand adventure in purrsuit of the evil Drakoth and your catnapped sister! Explore Felingard's huge overworld map, risk life and limb delving into dungeons for epic loot, and lend a paw to a furry cast of characters in a flurry of side quests.\nReal-time Combat\nCombat in Cat Quest takes place entirely in real time, allowing you to get close to enemies with a slash of your blade, dodge roll to avoid a counter-attack, and then finish them off with powerful magic! Wield the ancient spells of Lightnyan, Flamepurr, and Healpaw to vanquish your foes! (Fur real!)\nEquipment Customization\nOutfit your catventurer with a whole basket of equipment! Prefurr casting spells? Don an arcane hood, robes, and a staff to bolster your mana reserves! Want to protect yourself from attack? Deck out your catventurer with chainmail armor to increase your health and provide an extra level of protection. Weapons, armor, and spells can be mixed and matched to create the purrfect combinations for your playstyle!\nWorld Exploration\nThe world of Felingard is littered with interesting places and people! Discover a possessed town whose residents lust for obscene amounts of meat, assist the mages Mewlin and Meowgan in their search to break a magic seal, and locate someone's missing delivery of \"House of Parchments\" and \"The Pouncing Dead\". Exploration is one of the main scratching posts of Cat Quest, and with locations such as Bermewda's Triangle, the Furbidden Fields, and Pawt City to explore, it's time to get pawing!\nSoundtrack\nExperience an enchanting orchestral score inspired by classic RPGs!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Pqube","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":16029,"name":"Block N Load","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a1/0a11da6832223c0a41b5307a9112c3e7.jpg","description":"Block N Load is a team-based multiplayer shooter game developed by Jagex. It is a spiritual successor to Ace of Spades and improves on the ideas that were first laid there. It was later made free-to-play.\n\n###Gameplay\nBlock N Load is a 5v5 multiplayer game that takes inspiration from Minecraft and Team Fortress. Each team build up their base and tries to destroy their enemies. Featuring a completely destroyable environment, it is possible to catapult over the enemy defenses, blow their walls up or simply dig under them. This results in a high degree of replayability as no match will play the same.\n\nIn Block N Load, the players will put up buildings for offense or defense. The game features a class system - at the beginning of the match, you choose a character each of which has unique combat and tactical skills.\n\n###Characters\nBlock N Load features 12 characters which differ in their gameplay. For example, Sarge is a tank-type character, who pushes his enemies head-on to deal the most amount of damage possible, while Juan Shinobi is a stealth-based character that relies on his fast movement and teleportation skills to get behind his enemies, slice them up, and vanish.\n\nEach character is capable of building up defenses and is equipped with a shovel. The players are free to use blocks and build up something new or choose the pre-made buildings and put them up in a matter of seconds.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jagex","platforms":[{"id":0,"name":"PC"}]},{"id":840788,"name":"The Finals","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa2/fa28280bb6f7bec50b94bc821d412795.jpg","description":"GOT WHAT IT TAKES?\nViewers at home, here's the news you've been waiting to hear: THE FINALS is accepting new contestants, and that means YOU! That's right, soon the world could be watching YOU tear apart our newest dynamic arenas and seize everlasting fame!\n\nAs you know, THE FINALS is the world's greatest free-to-play combat game show! Our contestants plug in to our virtual world and join teams in escalating tournaments. They fight it out in our beautifully-rendered arenas based on real-world locations that they can alter, exploit, and even destroy.\n\nSure, you can aim and shoot, but contestants that add our carefully curated virtual environments to their arsenal are more likely to advance, so do anything you can imagine in the name of victory! Burn arenas to the ground! Send wrecking balls crashing into your opponents! Don't just pull triggers - pull down buildings!\n\n\nTHE WORLD IS WATCHING\nTHE FINALS thrives on spectacle, so drive your fans wild with thrilling combat and your own personal flair as you compete for worldwide fame and the support of our discerning and stylish sponsors.\n\nPlay Your Way - Whether it’s sneaking up on enemy squads with a katana in hand or ripping an entire building out from under their feet with explosives, THE FINALS lets YOU make the call! With different skills across body builds and a wide array of weapons and gadgets, you'll have all the tools to make your playstyle your own!\n\nThe World Is Your Weapon (And Enemy) - A skilled contender might go in guns blazing, but with environmental destruction in your arsenal, that’s just the start of what you can wield against your foes! All of our arenas can be altered, used, or reduced to rubble - and not just by you.\n\nYour Rising Star - Ready for your close-up? Standing out in THE FINALS means the eyes of the world will be upon you, so you’d better look your best! Gather fans and fame as you craft a unique avatar with the help of our generous sponsors and dazzling customization options!\n\nGET FAMOUS\nThis is the opportunity of a lifetime. Arenas based on iconic places, unparalleled destruction, and endless tactical possibilities await - make them your own, and the floodgates of fame will open. Your competition will have the same opportunities, so it’ll be up to you to be more clever and attention-grabbing. Are you up to the challenge? Are you the world’s next all-star?","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Embark Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":19625,"name":"Unreal Tournament 2004: Editor's Choice Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c02/c027f7cf3d558f9072b2c27a3955f256.jpg","description":"###From demo to a series\nUnreal Tournament series began life as a technological demo, which showed the graphics capabilities of the Epic Games’ engine Unreal. It was first shown in 1998 together with the first game of the series. The fourth part of the game uses version 2.5 and is the sequel to Unreal Tournament 2003.\n\n###The story\nFamous designer Cliff Bleszinski led the team of developers on this one. He is known for such games as Jack The Jazz Rabbit and Gears of War. The game takes place in a fictional universe where people are involved in an endless war with aliens named Skaarj. For the moral support of the colonists, who need to restore their home planet, the Liandri Corporation came up with a gladiatorial tournament where miners compete with each other. The action of Unreal Tournament 2004 begins in the tenth anniversary year, in which the Skaarj Empire sent its representatives to participate.\n\n###Key features\nGameplay-wise game is a first-person shooter, with the ability to participate in single battles and in multiplayer matches. The game has more than a hundred maps and ten game modes, which at the time when the game was released made it almost the most massive of all online shooters. Vehicles also appeared in UT2004, - to get around huge open maps.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Epic Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14219,"name":"Blockstorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/038/0387a4e4accde7c52d1a005e6928e000.jpg","description":"Blockstorm is an indie-made multiplayer first-person shooter developed by GhostShark.\n\n###Gameplay\nBlockstorm's world is fully destructible, as it consists of building blocks. This allows both the players and the developers to create highly interactive maps and even worlds of large scales. \n\nAt the beginning of the game, the players create their own character out of the same building blocks the whole world consists of. You are free to make whatever you come up with as long as it follows the community guidelines. The players can also edit their weapons the way they see fit. For example, it is possible to edit the basic in-game rifle into an M60 machine gun. The players can also choose a preset character model if they don't feel like creating something new.\n\nAfter that, the players are free to engage in multiplayer battles in one of the five game modes or launch up an in-game editor to create a new map or a so-called battlefield - a giant map, on which a match can be played for several hours.\n\nThe five game modes mentioned above are: Deathmatch, Team Deathmatch, Capture The Flag, Assault, Castle Battle, and Hunt. Assault and Castle Battle can only be played on battlefields, as they require a specific map size. In Hunt, the players look for one of the players that have enhanced speed. The players have to find the chosen one in a limited amount of time.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GhostShark","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":7955,"name":"Morphopolis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df7/df7314ef7e0ab35865c1584b120bd630.jpeg","description":"Morphopolis is a point-and-click adventure game developed by Dan Walters. \n\n###Setting and art-style \nThe game takes place in the real-life setting and based on the theme of insect microcosm. The player controls an aphid grub during the process of metamorphosis. The game lets the player explore familiar environments from the insect’s perspective. Morphopolis is completely hand-drawn, uses bright colors and contrast pallet. \n\n### Gameplay  \nThe gameplay is very reminiscent of other point-and0click adventures. The developer mentions Machinarium and Tiny Bang Story as the main sources of inspiration.\nThe primary goal of the game is to achieve the spawning ground. To do so, you must travel to various locations like gardens and fields. Each level consists of two parts. First, you have to find several items on the screen, such as eggs, flowers, parts of other insects. Then you solve a quick puzzle a get another list of items that you have to collect. \nThe gameplay itself, however, is not the focal point of Morphopolis, but rather a reason to explore unique environments. The game is centered on its art-style and unusual setting, making it mostly an aesthetic experience.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Dan Walters","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":59700,"name":"Warhammer 40,000: Mechanicus","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/511/511659166b4ecf074d77ff129ac41731.jpg","description":"Omnissiah Edition\nPre-order Warhammer 40,000: Mechanicus ‘Omnissiah Edition’ now and get the full game on release plus:\nThe atmospheric soundtrack featuring the highly acclaimed music of Mechanicus\nThe stunning digital artbook containing an array of new and previously unseen concept illustrations and art from the development of the game\nEnhance your close-quarters arsenal with the hard-hitting power of the Arc Scourge.\nMay the Omnissiah protect!\nAbout the Game\nTake control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you’ll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations using the Noosphere technology and control your Tech-Priests every move.\nYour every decision will shape the missions ahead and ultimately decide the fate of the troops under your command. However, choose your path carefully - the Imperium depends on it.\nAugmentFlesh is weak! Upgrade your Tech-Priests limbs with mechanical augments made from the blessed metals of the Omnissiah. Customize your team with hundreds of possibilities, creating a squad to suit your playstyle.\nDifficult DecisionsMake tough decisions that will forge the future from your Ark Mechanicus, The Caestus Metalican, and send you towards alternate endings for a truly unique playthrough.\nExperience the NoosphereUse the Adeptus Mechanicus’ evolved human cognition to scan unexplored tombs for valuable data in order to gain a tactical advantage over your enemy.\nThe LibraryA compelling story written by Black Library author, Ben Counter, specifically crafted to fit the unique personality of the Adeptus Mechanicus faction.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Bulwark Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":11069,"name":"Home","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/234/2341a78cfc68acd460228fafcf7f9ccc.jpg","description":"Home is a 2D pixel horror that offers a player to try on the role of a character who does not understand where he is and how he got there. The development of the game involved only one person - it's Benjamin River, and his take is similar to such games in the genre as Lone Survivor and Amnesia, only corrected for pixel graphics. \n\nThe main decisions in the game are made using a simple binary system: you just have to answer the questions with Yes / No. Based on the answers, the plot of the game develops, which narrates the mysterious murder. There are several unexpected twists in the plot based solely on the player's choices.\n\nThe game is very short and requires a lot of replays to fully understand its story - each time the player can experiment with the answers and get new answers from the game. However, you will not get all the answers - the game is not so elaborated. Home can create the right atmosphere, which, however, will not appeal to all fans of the genre: here you will have to read a lot and think through every answer.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Benjamin Rivers","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":2226,"name":"Type: Rider","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dfc/dfcb531e89791246e33fb6d46cb28127.jpg","description":"A 2D platformer from an independent Spanish studio. As two points, the player will reveal mysteries and secrets in the history of printing and font development, learn the history of the origin of typography. The plot begins in prehistoric times when people's writing was petroglyphic and reaches our times when the world is captured by pixelated nostalgia.\n\nThere are ten worlds in total, which are associated with specific periods in the history of typography development. Each level is backed by a ton of documents and historical references, which reveal the context even wider. The developers did not make the game too complicated - its task is enlightening, and it should reach to the broader audience. All riddles are built on physics of game objects.\n\nOne of the main puzzles is the controls. It is unusual and sometimes difficult to master. The game was praised by critics as one of the most innovative, offering the original concept. Available on mobile devices, consoles from Sony and on PC.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":1063,"name":"FINAL FANTASY VI","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/98c/98c87b286cd2a2ba942167df384a9bd3.jpg","description":"Final Fantasy VI first debuted in 1994 as the sixth installment in the iconic Final Fantasy series. Innovations included the ability to play all the main characters as the game's protagonist, and to this day, its epic story intertwining each of their fates is still highly rated and wildly popular.\nWith plenty of abilities available and the magicite system for controlling spells/summoning, players can develop their characters any way they want. This was also the first Final Fantasy game to include the Ultima Weapon, the most powerful sword of all and a recurring item in subsequent titles within the series.\n\nThe War of Magi left little but ashes and misery in its wake. Even magic itself had vanished from the world. Now, a thousand years later, humankind has remade the world through the power of iron, gunpowder, steam engines, and other machines and technologies.\n\nBut there is one who possesses the lost power of magic--a young girl name Terra whom the evil Empire has kept enslaved in an effort to harness her power as weapon. This leads to a fateful meeting between Terra and a young man named Locke. Their harrowing escape from the Empire's clutches sets in motion a series of events that touches countless lives and leads to one inevitable conclusion.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Square Enix","platforms":[{"id":0,"name":"SNES"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Game Boy Advance"}]},{"id":59098,"name":"NARUTO TO BORUTO: SHINOBI STRIKER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b56/b56c8500b4760e23ccc1f42e4f10a642.jpg","description":"Digital Deluxe Edition\nPurchase NARUTO TO BORUTO: SHINOBI STRIKER Deluxe Edition and get the most complete experience from NARUTO TO BORUTO: SHINOBI STRIKER! This edition includes the full NARUTO TO BORUTO: SHINOBI STRIKER game and all additional content eligible to the Season Pass.\nAbout the GameThe Naruto franchise is back with a brand new experience in NARUTO TO BORUTO: SHINOBI STRIKER! This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, SHINOBI STRIKER is also built from the ground up in a completely new graphic style. Lead your team and fight online to see who the best ninjas are!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":17841,"name":"Gauntlet Slayer Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a1/1a15a05213f0a7f170b22015382da027.jpg","description":"Gauntlet is a top-down hack-and-slash game a part of the long-running Gauntlet series. \n\n###Gameplay \nLike the original 1985 arcade game, in Gauntlet player takes a role of one of four characters and fights their way through several dungeons. The game revolves around slaying hordes of enemies, killing bosses, acquiring points and unlocking new abilities. There are four players to choose from Barbarian, Valkyrie, Elf, and Wizard. Each of them has the unique set of weapons and abilities. The Barbarian is the strongest melee fighter in the game; Valkyrie has a shield and spear that allow her to pierce enemies from a distance, Elf can shoot arrows and throw bomb and Wizard can combine three elements to create different spells. \nThe game heavily relies on multiplayer. Up to four players can play cooperatively. Playing with other people requires coordination since some of the players’ abilities can hurt other players. Besides, all the loot and extra items in dungeons, such as food that recovers the characters’ HP, accrue to the first player that collects it. \n\n###Slayer Edition \nThe game was initially released only for PC. In 2015, it received an updated PlayStation 4 port with Slayer Edition subtitle. The update brought a new “Endless” game mode, new weapons and abilities, and some gameplay tweaks such as increased difficulty and replacement of the in-game shop with loadout system. The PC version also received the update.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Arrowhead Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]}]