[{"id":3650,"name":"Puddle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea5/ea51039fd84fdf75e108c33585048777.jpg","description":"Dive into Puddle, a game unlike any other where you have to guide a puddle of fluid by tilting the environment to the left or right!  Play carefully taking friction, gravity and temperature into account, and by using the unique properties of each type of fluid (water, oil, nitroglycerin, molten lava...) in a range of original environments.  Conserve as much fluid as possible when crossing a variety of obstacles such as burning passageways, carnivorous plants and electric currents!Key Features\n49 levels\n2 difficulty modes: normal and extreme\nLeaderboard: see the scores of players from all over the world.\nMedals: compare the medals you have won with those of your friends.\nLaboratory mode with dozens of objects, backgrounds and liquids to unlock!\nSupport for Bluetooth or USB game controllers.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Neko Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"}]},{"id":804753,"name":"Dragon’s Dogma 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/679/679d7a18e220025bdd83dff484d6ea64.jpg","description":"The story begins in an underground gaol where the Dragon's voice echoes in the fog of lost memories.\n\nAscend, Arisen, and best me, in accordance with the dogma of this world.\n\nBetwixt the domains of human and beastren, A hero must fulfill their forgotten destiny.\n\nWhat dogma does your heart see through your eyes?\n‘Tis a tale of one who shall slay the Dragon and claim the throne.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":319143,"name":"Killsquad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0e/e0ec4788a286aef109574c324e97d135.jpg","description":"This is not the future you dreamt of. The Galaxy is in chaos, planets go rogue, and mega-corporations assemble Killsquads to raid whatever riches and bounty are left. Welcome to Killsquad: a hardcore action RPG done by hardcore RPG fans. A game that blends the best of the genre and presents a new universe for you to discover. Set up your team, choose your heroes, weapons and gear, and unleash hell on a fast-paced battle through hordes of monsters and deadly bosses.\nKEY FEATURES\nHIGH INTENSITY GAMEPLAY\nKillsquad looks like an RPG but plays like an action game. This creates a unique gameplay style you can enjoy with a keyboard or gamepad. Our focus is on short, adrenaline pumping missions you can enjoy solo or 4 player coop.\nCHOOSE AND CUSTOMIZE YOUR HEROES\nPlay as any of the four unique space bounty hunters, each with a class and a skill tree you unlock as you progress. Each is highly specialized, and has a set of starting skills and passive abilities. Then, on each level up, you get an opportunity to customize your character with new skills to adapt to your play style.\n\nA COMMUNITY OF BOUNTY HUNTERS\nKillsquad is a game designed for the community: contracts are offered in real time for squads to embark on. Sign up for a contract with your squad, or join other bounty hunting squads who need help. Compete with all squads worldwide to earn contract rewards and progress on the game Meta on an ever-evolving universe.\nTHE PLANET IS YOUR ENEMY\nOur planets are built on the fly, so each mission is designed to be highly replayable. And they come with a selection of nasty surprises: from meteor storms, to minefields, from huge bosses to an assault by the Federation Forces, our planets want to make sure you understand you're not welcome here.\nA RICH UNIVERSE\nThe Killsquad universe is rich and expanding: dozens of weapons for you to unlock, alien races you can browse in our encyclopedia, resources you can collect and then use to unlock exclusive perks for your weapons... and more coming soon!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Novarama","platforms":[{"id":0,"name":"PC"}]},{"id":64173,"name":"Hypnospace Outlaw","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/112/112ebaa7f44e9b720d6a47a16af245d2.jpg","description":"Greetings Enforcer, and thank you for enlisting in the Hypnospace Patrol Department! As the corporatocracy sleeps, outlaws are out there committing terrible transgressions all across our beloved Hypnospace, and these virtual streets aren't going to police themselves!\nHypnospace Outlaw is a a '90s internet simulator, that requires you scour the Hypnospace and hunt down wrongdoers, while also checking out a wide variety of weird and wonderful websites, keeping an eye on your work email, and downloading a plethora of apps that may or may not be useful.\nAs part of your job as a Hypnospace Enforcer, you'll be watching out for copyright infringement, internet bullying and more, with reports and rewards coming direct from the Hypnospace Patrol Department to your inbox. In your spare time, you can customize your HypnOS desktop however you see fit, with a variety of downloads, wallpapers, screen savers and helper bots to keep you company.\nSo slip on your Hypnospace Headband™, and keep these key directives in mind:\nCrawl through Cyberspace: Scour the darkest corners of the Web for scumbag users who violate Hypnospace law!\nDangers and delights: Download groovy GIFS and MIDI files, but watch out for adware, toolbars and hackers!\nTreasure hunting: Do your job to earn Hypnocoins, or ignore your inbox and go hunting for hidden pages, downloads and secrets!\nRelive your childhood: Equip obnoxious screensavers and skins for your desktop, and wiggle your mouse pointer around to make pages load faster!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tendershoot","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":49354,"name":"Farmer's Dynasty","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4c/b4cba6a3136ca3e0c70472a2f98b06f4.jpg","description":"FARMER’S DYNASTY – the unique REAL-LIFE SIMULATION offers a totally new farming simulation experience and mixes elements of a Life Simulation and Role-Playing with a classical Farming Simulation game.\nRemember the good old days visiting your grandfathers farm? The time when you were sitting on your grandfathers tractor together with him driving around and working on your fields. You are back on your farm now. The past years have been full of work for you in the city but you still remember the good old times when you dreamt of being a farmer. This dream is still in your heart: Rebuilding grandfathers farm again and building your own Dynasty – let’s make it come true!\nLIVE a real farmer’s life, BUILD up your farm, your life, your family and FARM your fields!FEATURESA unique mix of building, farming and life simulation\nRepair, rebuild and expand your farm\nInteract with the extensive Open World and collect Social Points\nFollow unique characters through special quest lines\nControl original machines and tractors","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"UMEO Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":18263,"name":"Wasteland Angel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13e/13e58ff253cc6b0986f38c0bde183bdb.jpg","description":"Bummer! World War III happened and killed most of the world’s population. The ones that got toasted were the lucky ones. Survivors live in constant fear of being murdered or enslaved by violent gangs, renegade military units and, of course; mutants.\n\nOutfitted with a heavily armored car, unlimited firepower and a thirst for vengeance, our Heroine – the Wasteland Angel roams the radioactive wastes, travelling from one God-forsaken town to the next, protecting survivors from being enslaved. She’s on a mission, to defend those that can’t defend themselves.\n\nWasteland Angel is a throw-back to the era of vintage arcade shooters, where players fend off waves of enemies and ultimately face-off against epic end-level bosses.  From a top-down isometric view, players pilot the Wasteland Angel’s overpowered vehicle as its dual machine guns cut a swath across the terrain.  To handle whatever the gangs, muties and renegades throws her way, Wasteland Angel has upgradeable weapons and ammo that can rip enemies from this life and toss them into the next.\nKey features:\n\n24 Levels of fast-paced action across 6 ravaged landscapes\n3 Enemy Factions including Gangers, Renegades and Mutants\n4 Difficulty Levels from beginner to suicide\nDifferent mission objectives from escort to an all-out offensive\nSuper weapons increase the carnage, including: Mines, Napalm, EMP and Nukes\nHuge boss battles to test your skill and stamina\nBonus levels featuring FPS driving/shooting mayhem\nOnline Scoreboards for each Difficulty Level\nStar ratings for all levels and 40 achievements for all completionists\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Meridian4","platforms":[{"id":0,"name":"PC"}]},{"id":17324,"name":"A Detective's Novel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/048/0489476789f4e4865f314ae1eb4c05ed.jpg","description":"On a cold November night in a desolate estate deep in the mountains an innocent life has prematurely perished. Surrounded only by his family and closest friends, a controversial yet immensely successful businessman William Goldberg passed away under mysterious circumstances. Being an upstanding member of society and the owner of Goldberg Industries, a multi-million dollar arms company responsible for providing the military during the World War 2, news of his death caused an uproar at the local police department. It seemed the case was tailor-made  for the legendary detective Knox, a prodigy who successfully solved over hundred cases. Accompanied by an aspiring young detective Clark assigned by the Chief to keep an eye on him, Knox departs towards the Goldberg's estate to discover the truth behind the incident.\nMiles away from nearest settlement in a mansion hidden from the eyes of public, it is only natural to presume that only those present at the time could have been involved. Follow clues, look for evidence and discover key information by interrogating the suspects. All pieces of the puzzle will be presented and it's up to you to deduce who, how and why the murder happened. A mystery visual novel inspired by classic novels from Arthur C. Doyle and Agatha Christie and \"When They Cry\" series.\nCHARACTERS\nAge: 29\nProfession: Senior Detective\nBlood type: B\nOne of the most famous detectives in the entire state,  Knox has yet to stumble upon a mystery he is unable to unravel. Despite his young age, he decisively solved over 100 cases.  A prodigy by nature, he rarely puts any effort in his detective work often neglecting it to enjoy cigarettes and coffee.\nAge: 26\nProfession: Junior Detective\nBlood Type: A\nA young and naive detective working on his first case, eager to prove himself. According to Knox he is a narrow minded simpleton sent by the Chief to ensure Knox plays by the book.\nAge: 32\nProfession: Ex-Soldier 1st Class\nBlood Type: 0\nEldest son of the deceased who has just returned from the Second Great War. His intellect and bravery allowed him to prove his worth on the front lines in the Pacific. Being the eldest heir, he is the first in line to inherit his father's fortune.\nAge: 58\nProfession: Businessman\nBlood Type: 0\nWell established businessman and a close friend of the deceased. He helped Goldberg create his financial empire during the war. Despite his short temper his charisma makes him beloved by his employees.\nAge:35\nProfession: Housewife\nBlood Type: AB\nThe widow of the deceased. Although their marriage lasted very short she claims that she loved the deceased deeply. Ms. Goldberg is a very emotional person that can change her attitude very quickly if provoked.\nAge: 65\nProfession: Butler\nBlood Type: B\nThe family butler that has served the Goldbergs for decades. Calm and patient man which despite his old age still chooses to work instead of retiring.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":2112,"name":"Nightmares from the Deep: The Cursed Heart","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/acf/acf8f669f1356993c9fd7e5712ba069c.jpg","description":"Would you like to enter a thrilling Pirates world where danger lurks in every corner?\nYou are a museum owner pursuing an undead pirate who kidnapped your daughter. You quickly realize that the villain is entangled in a tragic, centuries-old love story, and wants to resurrect his mistress with the girl’s life force. You feel sorry for the pirate, but you have to stop him before it is too late for your daughter…\nYou will leave the modern museum quickly, and find your way to rundown pirate settings, all of them three centuries old. Since the time of the golden age of piracy, the locations have become neglected, deserted and overgrown with plants. Full moon, bones laying on the ground, and a skull-shaped rock add to the dark atmosphere of the mysterious island.\nWhat tragic events took place on the island before your arrival? What evil powers can make an old, rotting ship sail? Is the horrifying, undead pirate really as evil as he seems?\nYou will find answers to these questions during your trip through the ghost ship haunting the seas of the Caribbean, the grim Skull Island where pirates’ bones cover the ground, a ruined fortress ridden by cannonballs and catacombs stretching below the island’s surface. Are you strong enough to save your daughter? Will you dare to lift the curse?\nFeaturesSpecial Collector’s Edition version full of exclusive extras!\nSwitch between Hidden Object and Mahjong puzzle!\nAmazing storyline;\nAAA-quality cinematics;\nAstonishing sceneries;\nClever puzzles;\nCollect 12 Cursed Doubloons!\nFace the fearsome Captain Remington and his crew!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":1601,"name":"Lumo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31a/31a598e802da34d983812913036dff84.jpg","description":"Digital Deluxe Edition\nDirector's Commentaries\nGo behind the curtain on the making of Lumo with exclusive director's commentary videos from Triple Eh's own Gareth Noyce. Updated regularly – don't miss them!\nAbout the Game\nWitness the rebirth of a genre in Lumo – a classic isometric adventure with a modern twist for gamers young and old alike!\nAs a contemporary take on the long-lost isometric platform genre, Lumo can be enjoyed by anyone looking for an absorbing, challenging and rewarding adventure. But for those who lived through the golden age of videogames – the 80s and early 90s – or know about the games and culture from that time, layer upon layer of nods, winks and touches to those times help build upon an experience that’s as heart-warming as it is exciting!\nWith over 400 rooms across four unique zones, six hidden mini-games and all kinds of secrets to uncover, Lumo is a true voyage of discovery. How much you discover just depends on how hard you look…\nLumo revives the long-lost art of isometric platforming, while bringing a charm of all its own to the genre.\nOver 400 rooms will test your skill, each one a self-contained challenge to overcome.\nThe more you look, the more you'll find – from a hugely absorbing adventure on the surface to all kinds of secrets to find underneath!\nA true love letter to the golden age of gaming… adventures don't get much more heart-warming than this!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rising Star Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":59356,"name":"Deathgarden","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/af8/af8eb3684d5990e3414aeb2949a5352c.jpg","description":"OVERVIEW\nDigital Deluxe EditionThe Deluxe Edition includes the base Game, the Silent victory Hunter set (one male Armor, one female Armor, one Weapon skin, and one helmet), the Sentinel Runner set (one male Outfit, one female Outfit, one Vambrace skin and one Mask), the digital Art book, and the Digital soundtrack.\nAbout the GameENTER A SPECTACULAR DYSTOPIAN BLOOD SPORT\nSet in the near future, DEATHGARDEN™ revolves around a spectacular real blood sport that became the most popular entertainment on the planet. Players choose to team up as one of the five agile Runners or to embody the Hunter, a heavily armed competitor whose mission is to kill the Runners, preventing them from escaping The Garden.\nDeathgarden pits individual cunning against strategy and teamwork–a lone but lethal Hunter against a team of dextrous Runners. Both sides must prove their skills and take control of the procedurally-generated Garden.\nAsymmetric Confrontation\nPower vs Agility: In this fast-paced action title, one powerful Hunter must hunt down five agile Runners, who seek to complete an objective and escape the Garden.The Garden\nA Procedurally Generated Garden: Each map is procedurally generated within the ‘Garden’, a nano-printed environment in which Runners willingly enter to compete against the powerful Hunter. Each match boasts a different ‘Garden’ layout, which forces both sides to adapt their strategy to the environment and creates exhilarating, memorable moments.Long Term Support\nGameplay First: Deathgarden embraces the “no grind” or “no pay to win” philosophy. New gameplay content (Gardens, Weapons, Abilities & Perks, etc.) will be instantly available to all players upon the content’s release.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Behaviour Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":50372,"name":"Treasure Hunter (2018)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/836/8366a7b113889032cb411fcefb262e5e.jpg","description":"Treasure Hunter is about setting off into interesting locations that have been of some significance in the past and using metal detectors to uncover that past by finding interesting artifacts and get to know they historical significance.\nWith locations scattered all over the world, you’ll need to find something interesting and valuable in your local woods to gain the prestige and funds needed for better equipment and  travel expenses to exotic, remote locations. You can decide to keep artifacts for your collection or to auction them off to travel even further or get even better gear.\nTreasure Hunter is not a metal detector simulator per se, but rather a mix of arcade and simulation. With streamlined detector mechanics the game is enjoyable not only for the fans of the genre, but casual gamers as well. Simple, intuitive gameplay elements combined with beautiful landscapes make for a truly enjoyable experience.\nKey features:\n• 10/12 beautiful, handcrafted locations\n• 8 different metal detector types to upgrade\n• 100+ artifacts to find\n• 10+ legendary artifacts\n• Artifacts can be found in various conditions\n• Identification and collection of artifacts\n• Artifacts can be sold to bolster funds for better gear and travel expenses to remote locations","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Drago","platforms":[{"id":0,"name":"PC"}]},{"id":28315,"name":"Viva Piñata: TIP","genre":"Family","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81e/81e17d5b2a1cb89835234fe2d28950bd.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish, Japanese, Korean, Chinese. Welcome back to Piñata Island where Prof. Pester's latest scheme has lead to disaster. Visit the scorching desert or icy wastes to trap new species. Train them, dress them, then send them to a party! We’ve new Piñatas, new activities, new features and new secrets, so come visit and find out why people never want to leave. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":17449,"name":"THOTH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7e/b7e8b764a79c31c533fccad365d8e230.jpg","description":"\"There's a ruthless intelligence at work, a sense that the genre’s rulesets and iconography have been crushed to the size of an atom, to the point of implosion.\" - Rolling Stone\nFrom the creators of the award-winning '140' comes an innovative and intense new entry in the twin-stick shooter genre. Though it’s deeply rooted in the arcade tradition, THOTH also brings something unique to the table. Each stage in the game is specifically designed to require both puzzle solving and finesse to get through. Players constantly need to think about positioning and timing while making sure to both dodge enemies and avoid collisions.\nAesthetically, THOTH is a vibrant rush of colors, shapes, and patterns accompanied by a brutal soundtrack by electronic music pioneers Cristian Vogel & SØS Gunver Ryberg. The imposing aesthetics and the relentlessly demanding gameplay eventually induces a trance-like state in the player.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Carlsen Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3335,"name":"Nom Nom Galaxy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b62/b6264b884fd583f52612de6a0cbd0de8.jpg","description":"Welcome to Soup Co., Astroworker! After crash-landing on an alien planet, explore the environment, create huge factories and ship delicious batches of soup into space to earn gold for weapons, vehicles and more!\nNom Nom Galaxy blends tower defense, sandbox exploration, co-op platforming, resource management and construction into a unique interstellar experience!\n• Build and grow your soup factory to stay ahead of rival companies\n• Harvest indigenous plant life and enemies for ingredients\n• Unlock new robots to automate and increase production\n• Build towers and missile turrets to defend your base from enemies\n• Earn rewards by racing, defending, collecting and fighting in Galactic Challenges\n• 2 player split screen / 4 player online drop in and out co-op\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1 player\nNetwork Players 2-4\n416MB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Double Eleven Limited and Q-Games Ltd. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Double Eleven","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":324199,"name":"Quake II RTX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6e/e6eb9e747fd7021dba6073e0cab30c91.jpg","description":"Download Quake II RTXQuake II RTX is fully ray-traced and includes the 3 levels from the original shareware distribution.\nGame DescriptionShortly after landing on an alien surface, you learn that hundreds of your men have been reduced to just a few. Now you must fight your way through heavily fortified military installations, lower the city's defenses and shut down the enemy's war machine. Only then will the fate of humanity be known.\nAbout Quake II RTX Quake II RTX builds on the work of Christoph Schied and the team at the Karlsruhe Institute of Technology, who added ray tracing to Quake II to create Q2VKPT (in turn building upon the Q2PRO code base). NVIDIA has introduced new path-traced visual effects, has improved texturing, and has made dozens of other changes and improvements, resulting in an experience that rivals games created today, and pushes your RTX hardware to the limit.\nBuy Quake IIPurchase the game to access all levels as well as multiplayer support.\nhttps://store.steampowered.com/app/2320/QUAKE_II/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Lightspeed Studios™","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":249973,"name":"Lorelai","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/138/138fc988b301a59f14aa2495b0343cc0.jpg","description":"Lorelai will never forget that day. The little she had, it was taken away. Her whole world disintegrated. She never really had a chance, but Lorelai refused to give up. She will fight. And not even death will stop her from getting it all back.\nLorelai, by Harvester Games, is the conclusive part of R. Michalski's Devil Came Through Here adventure game trilogy, alongside The Cat Lady (2012) and Downfall (2016).\nA brand new horror adventure with an immersive story and world in full HD. An engaging soundtrack by micAmic and guest artists, English voice acting and Xbox controller support.\nLorelai will take you on a whirlwind journey through an engrossing psychological thriller suitable for adults, soon! More information, screens and trailers forthcoming.\nhttp://store.steampowered.com/app/253110/\nhttp://store.steampowered.com/app/364390/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Harvester Games","platforms":[{"id":0,"name":"PC"}]},{"id":35325,"name":"Spider-Man 2: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1cc/1cc86be85294d9d3cf2fc95d696ce819.jpg","description":"Two years after becoming Spider-Man, you face your toughest enemy yet - the dangerous Doo Dok! Now the city of New York is relying on you to save it from the reckless rampage.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Treyarch","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20725,"name":"Marlow Briggs and the Mask of Death","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7a/c7ab8e83121e4fba6704770c4689960a.jpg","description":"A new breed of WARRIOR returns, committed to destroying the enemies of FREEDOM\n\nWhen ONE angry man, has a world to protect - There is only ONE future – HIS OWN\n\n\n\nNo-nonsense hero Marlow never shied away from danger or trouble. But now he faces his ULTIMATE challenge. After crash-landing in Central America, he has an industrial evil to defeat whilst bound to an ancient Mayan Death Mask who’s had no-one to talk to for 2000 years. Another day at the office only this time Marlow is PUSHED TO THE LIMIT , his sweetheart has been abducted, the bad guys are making up  their own rules and only one man can judge them – and EXECUTE THE SENTENCE . \n\n\n\nFearlessly fighting through Mayan temples and towering valleys, monstrous machinery, nothing, but nothing, will stand in the way of this bad ass warrior, his girl and the crushing of all opposition.\n\n\n\nThey told him to go to HELL, he was DEAD ready!!!\n\n\n\nWith cliffhanger over the top action and cinematic gameplay, Marlow Briggs takes inspiration from the best of blockbuster films, comic book heroes, and action games with its focus on relentless high-octane combat, exotic and danger filled environments and epic set pieces.\n\n\n\n•Fight the enemies of FREEDOM with stacks of awesome combos and magic abilities,\n\n•Single handedly destroy HUNDREDS of enemies\n\n•Deploy MIGHTY weapons of destruction\n\n•Leap out of HUGE EXPLOSIONS in slow motion\n\n•Reveal the DEADLY secrets of the Mayans\n\n•Save the ENTIRE planet","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zootfly","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":13711,"name":"Rock 'N' Roll Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c12/c124a91cda59449e2e484884cd0648f9.jpg","description":"Rock 'N' Roll Defense is a small tower defense game, where you should defend a rock concert from the bad music menace.\nPerfect to play while in a queue for another game (the enemy waves are not released until you want to).\nDefend the rock from different types of enemies, passing trough pop, country, dance and even on hell. Try to beat 40 stages counting with multiple types of speakers (towers) and get all the 250 achievements.\nEasy to learn and hard to master mechanics.\nBeat 40 stages and hundreds of enemies counting with 8 types of speakers and a special when as your last resource to defend your concert.\nUse strategy to get coins to place and upgrade the best speakers.\nAddictive hard to get 3 star gameplay.\nCartoon visuals.\n40 stages, 20 enemy types (4 bosses), 8 different speaker (tower) types.\nSteam trading cards, achievements and cloud saving.\n10 different tracks with multiple rock/metal styles (download it for free).\n5 different languages (English, Português, Deutsche, Español, Česky).\nNukGames is a solo indie dev, based in Brazil working to bring small and enjoyable games to Steam.\nRock 'N' Roll Defense is my first project to see the sunlight, I hope you have fun with the game.\nPaulo Brunassi\nNukGames","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NukGames","platforms":[{"id":0,"name":"PC"}]},{"id":59,"name":"Anoxemia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1b/e1ba70b0da3b80b9691a7a2db2fcd395.jpg","description":"It was supposed to be a simple mission. All I had to do was collect some samples from a contaminated area under the sea. As soon as I left the ship, everything went wrong. Communications were lost and my submarine crashed on the ocean floor. I survived, but my oxygen is running low and I can't contact anyone for help. All I can do is move forward with this operations drone as my only companion. Trouble is, it's been acting sort of weird lately. Almost as if it's trying to sabotage my mission...\nAnoxemia is a story-driven exploration game that puts you in control of the scientist Dr. Bailey and his operations drone, ATMA. Search the ocean floor as you discover and extract samples from the bowels of the underwater caves. Danger lurks in each passageway, everything from poison drifts to powerful ocean currents, mines leftover from the war, and mobile machines running haywire. There's also the ever-present risk of running out of oxygen. Fortunately, ATMA can help guide you to your destination using a few special tools and upgrades. Assuming you can find them, that is.\nThe world of Anoxemia is both breathtaking and perilous. The seas are quiet most of the time, but as soon as you see a flashing light or hear a noise echoing from the distance, you know it's time to run. Of course, there are some dangers you just can't run from. Dangers you don't even know exist. Dangers from within...\nAlso available in Bosnian, Serbian and Croatian languages!Features Unique sci-fi horror story that unfolds while you play.\nExplore 38 levels of unique underwater terrain.\nFind and equip several different items and upgrades.\nSolve puzzles that require quick reflexes and clever thinking.\nVoiced narrative that gives insights on the main character's thoughts.\nGame is hard.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Badland Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60670,"name":"AI War 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a34/a34bc816e30ce3036ae416bd66549fef.jpg","description":"AI War II is a grand strategic RTS against an overwhelming, inhuman enemy who has conquered the galaxy.  The enemy has made only a single error: underestimating you.\nYou must steal as much technology as you can, and take enough territory to fortify your bases and launch your attacks.  But every conquest you make turns the attention of the AI ever more in your direction... so choose your targets with care.\nIt's \"a sequel to [Arcen's] enormo-space RTS AI War, which we called'one of this year's finest strategy games' back in 2009\" (Tom Sykes, PC Gamer)What's New?We still have a lot of work to do on the game, and we're undergoing some major work with our beta testers before heading to Early Access, but a lot is already awesome:\nThe game is crazy moddable.\nIt's multithreaded to take full use of modern computers.\nThe new 3D graphics are working out great.\nThe UI has already been dramatically improved by the introduction of a tabbed sidebar in the main view, and streamlining of several other mechanics that felt very difficult in the past.  More to come, there.\nWe’ve got art for over 130 distinct units (not counting different mark levels), and there's more to come.\nWe’ve got over 1500 lines of spoken dialogue from more than 25 actors, focusing primarily on the human side at the moment; we have a few hundred lines of AI-side taunts and chatter, some of which is recorded but just not processed yet.\nThere are hundreds of high quality sound effects for a varied battlefield soundscape (with distance attenuation if you’re far away, and positional 3D audio if you’re down in the thick of it), all routed through a tuned mixer setup for optimal listening to all the various parts.\nWe have a set of music from Classic that is over four and a half hours long, and the new music from Pablo is partly in, but mostly set to be mastered and integrated within the next week or two.\nThere’s also a ton of map types, many of them new, and with a lot of sub-options to make them even more varied.\nAnd a whole lot more.\nWishlist the game to be notified when it becomes available!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":28515,"name":"R.U.S.E.","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/afa/afa602076baf54380b3630b60de5c75e.jpg","description":"The Games on Demand version supports  English, French, Italian, German, Spanish, Polish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   In R.U.S.E.™, players use their brain as the ultimate weapon, fighting a war of perception, where the ability to deceive and mislead the enemy determines success. A first in a strategy game, R.U.S.E. reinvigorates the genre by using deception to give new-found depth to the game play.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":20984,"name":"Peggle Extreme","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d36/d36db902d539d09a390b1e71f43adc06.jpg","description":"Mayday! The Peggle Institute has been invaded by a host of other-worldly creatures. It's up to you, Peggle Master, to report to duty and shoot and bounce the critters to oblivion. Take your best shot with energizing arcade fun, now exclusively themed with art and sounds from The Orange Box!\nPeggle Extreme delivers fast-paced puzzle action that combines elements of pinball and pachinko to create a truly unique game experience. As with the original Peggle, Peggle Extreme requires players to fire a metallic silver ball from the top of the screen, relying on gravity to propel the ball downwards while ricocheting off orange and blue \"pegs\". The goal is to clear all the orange pegs from the screen before running out of balls. A moving \"bucket\" at the bottom of the screen offers free balls, while green power-up and purple \"bonus multiplier\" pegs provide additional twists. Peggle Extreme features one power-up in the form of Bjorn the Unicorn, whose special takes the form of a \"super-guide\" sighting capability which enables players to see where there next shot will go beyond one or two initial bounces.\nMaster 10 levels of \"Extreme\" challenges\nConquer 5 Master challenges\nPlay against a friend or the computer in Duel Mode\nRevel in breathtaking artwork and sounds from Half-Life: Episode 2, Portal, and Team Fortress 2\nReplay and save your best shots","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"PopCap Games","platforms":[{"id":0,"name":"PC"}]},{"id":20300,"name":"Continent of the Ninth Seal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/253/253b79aa59924fee25d9fb33152bcac5.jpg","description":"The Continent of the Ninth Seal (C9) is an action MORPG. Players take part in the game as heroes of Glenheim to stand against Nefer, an evil villain trying to open a gate to the Netherworld and swarm the land with his infernal legion. C9 showcases quality visuals, strategic combat, and a gripping story. Choose a character that best represents how you want to experience the game. The four base classes -- Fighter, Hunter, Shaman, and Witchblade -- can each upgrade into multiple advanced classes, all of which are unique in their skills, visuals, and play styles. The console-like controls, various skill combos, and RPG-based elements, make C9 a satisfying choice for all fans of action games.Key Features:Unrivaled Action RPG\nThe Continent of the Ninth Seal is a wholly unique action MORPG experience. With its non-targeting combat, you no longer have to suffer with “locking on” to a single enemy! C9 gives you the freedom to lay waste to any enemy foolish enough to get in range of your sweeping weapons. This unique system has earned C9 five awards, including Grand Game Award Korea in 2009.\nVarious Skill Combos\nEnjoy the complete freedom of combining skills and commands with cancellations and evasions to create an almost unlimited number of combos. Chain your attacks together and see just how much damage you can do in a single frenzy of attacks! Hack through every enemy that gets in your way!\nPrecise Controls\nC9 features precise, customizable controls using either a mouse and keyboard or a gamepad. Unlike other RPGs, the way you control your character determines whether or not you survive! No more pushing the same four buttons over and over in a tedious rotation. Your hands will never be at rest during combat. With enough skill and practice, you can learn how to juggle and control your enemies with such precision they never have the chance to fight back!\nPvP\nPlayer versus player is a core element of C9. Players can use the combos they have perfected in various PvP modes. Use your skills with just the right timing, and chain your combos together perfectly to secure your victory!\nUltimate Fury Skills\nUltimate Fury Skills are the most powerful skills a player can learn. These skills boast supreme damage with very impressive visual effects. Each advanced class has its own, unique ultimate fury skill.\nDiverse Content\nC9 allows you to enhance items, build guild housing, craft items, and remodel equipment; very popular features to players of online RPGs. The game also features a unique Legend system to display your in-game achievements to other players and express the personality of your character.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cloud 9 Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16071,"name":"Space Run Galaxy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/def/def2333020a6cf3d68c812e404064e5b.jpg","description":"Twitch Dev Session\nWatch the Replay\nAbout the GameSpace Run Galaxy is the sequel to Space Run, the game from one-man studio Passtech, which seduced hundreds of thousands of players with its dynamic and original gameplay. By twisting the tower-defense game style, Space Run offered an addictive real-time spaceship construction strategy experience. Space Run Galaxy expands and refines the original’s unique gameplay, introduces a persistent online universe and takes-off again with plenty of new features!\nSet 20 years after the original game, Captain Buck Mann has now set up his very own intergalactic courier service. You’re a member of Mann’s team of space runners, racing to deliver precious goods from planet to planet! Reinforce your modular ships with armaments including laser turrets, missile launchers and energy shields, while leaving enough room for your cargo. Fly fast – the quicker you arrive at your destination, the better the rewards!\nVenture into the depths of space spanning an entire galaxy, with 4 solar systems and over 50 zones to visit across 100+ runs. Space Run Galaxy offers limitless gameplay, while fresh new features expand the original experience:\nUser-created contracts – Take on contracts from other players for better rewards and unlimited replayability.\nIntergalactic player market – Trade hard-earned goods with your fellow space runners to sell off extra supplies, or snap up a tidy bargain.\nNew corporations offer riskier jobs – Carry the extra fragile cargo of XenoPrime, or risk transporting The Force’s highly dangerous weapon prototypes (which may even endanger your own ship!)\nFresh dangers await – Face off against brand new boss-type enemies, such as deadly pirate ships and huge space monsters…\nDeep customization – Customize the shape and size of any ships you acquire during your adventure. There’s no restriction for what ship you use in each mission, letting you get creative with every run!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Passtech Games","platforms":[{"id":0,"name":"PC"}]},{"id":13972,"name":"Jagged Alliance - Back in Action","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/238/23822e4fc15e7a5069049e5bdb90a245.jpg","description":"Jagged Alliance Back in Action is a contemporary remake of the latest title in the much-loved Jagged Alliance series of turn-based mercenary-themed strategy games.\n\nDesigned from the ground up to offer a modern gaming experience, Back in Action showcases an updated isometric 3D look and interface, highly detailed character models and a variety of new gameplay features.\nBack in Action takes players to the fictitious country of Arulco, where a ruthless dictator has seized power and only a small group of rebels stand to resist her. Tasked with freeing the island from the dictator’s iron grip, players will command rebel and mercenary forces while using tactical, diplomatic and economic tools to keep troops supplied and ready for the next flight, all while commanding them directly in nail-biting battles.\n\nBack in Action’s innovative “plan & go” combat system combines real-time strategy (RTS) with turn-based elements to guarantee that the intricacies of tactical warfare are rendered in dynamic, exciting gameplay. This challenges would-be commanders to master not only strategy and tactical combat, but also to maximize their team’s capabilities through RPG-like character advancement.\nKey features:\t\t\t\t\t\tUnrivaled mix of combat (tactics), roleplay, business and strategy\nInnovative “Plan & Go” combat system combines RTS gameplay with turn-based elements\nRealistic war setting with authentic-looking firearms\nLaptop/computer menu as a central anchor point for the player\nAssemble your own unit of mercenaries from numerous unique mercenaries\nSimultaneous control of multiple squads using a strategic map\nConvincing characters who interact with and comment on the game events\nAll the dialog has audio\nAcquire resources by capturing mines and encampments\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bigmoon Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":127659,"name":"Kingdom Hearts II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92b/92b781d88f6d047b1c61b6e0d157343b.jpg","description":"It has been a year since the events of \"Kingdom Hearts.\" Sora and friends are joined by a vibrant new cast of characters, including the king himself. Together, they will face countless dangers in worlds both familiar and brand-new. It seems the Heartless still exist. A new villain also awaits - but is it an old foe behind the mask, or a new menace? This mystery and others will be solved as the story unfolds in a grand adventure.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":21546,"name":"Jet Gunner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/896/89669cd0b8a279004625576380afc252.jpg","description":"Jet Gunner is a 2D platform action indie game that's full of Nestalgia. Full of action, gunfights, bosses and explosions so if you're into the whole 8-Bit vibe you should love this. From the sound, to the graphics to the flicker, this should pay tribute to those classic hard as nails, run 'n' gun games. Hopefully this should wet your appetite for re-living the good ol' days.\nSIX Stages - From cities to flying airships.\nHEAPS of weapons - From beam blasts to circle-ly side shooting thingies.\nRETRO soundtrack - Made from the juiced tears of a Game Boy brick.\nCHALLENGE MODE: Try and complete 25 extra difficult challenges.\nSTEAM ACHIEVEMENTS: Unlock 31 Steam Achievements! (More to be added with upcoming updates.)\nHARDCORE MODE: Is the game too easy? How about trying the extremely challenging Hardcore mode!\nFREE ADDITIONAL UPDATES/CONTENT: Extra levels, challenges, modes to be updated through the upcoming months.\nLEADERBOARDS. So show off to all your friends how great you are!\nSeptember - Game Boy Version Released\nOctober - Extra \"Lab\" level released to tie in with the release of I Want To Be Human\nDecember - Extra \"Winter\" level released to celebrate the Holiday season.\nMore Updates to come...","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sinclair Strange","platforms":[{"id":0,"name":"PC"}]},{"id":1347,"name":"Pro Evolution Soccer 2017","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/537/5370caa62388062ccb3d4a1f9ca0e2e1.jpg","description":"The award winning series returns taking the famed gameplay to a new level by achieving interactive reality in both control and new authentic visuals.\nControl Reality in Pro Evolution Soccer 2017 with these new features:\n• Real Touch – Players control the ball in unique ways based on where and how you control them\n• Adaptive AI – For the first time in a football game, the AI will learn how you play  and adapt accordingly\n• Natural Player Movement – Hundreds of new animations have been added to bring the players to life\n• Goalkeepers – Keepers see a great jump in their quality, through added motions and animations\n• myClub – Buy the players you want with the new myClub Scout/Auction feature","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PES Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":1253,"name":"Steredenn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a6/6a64771d6056f4f3d2f0b68c9ca8f60a.jpeg","description":"Steredenn is a frenetic and chaotic space shooter, carved in big beautiful pixels, with insane boss battles. Embark in your ship and engage the fight against dreadful space pirates in a never-ending combat for your survival.\nSteredenn is at the crossroads between a shmup and a rogue-like. Enjoy the infinite replayability of the game with its unforgiving gameplay, intense boss fights, (almost) randomly generated environments, twisted space events and a surprisingly large arsenal of weapons. Enhance your ship during your flight with many upgrades and forge your own path across the universe!\nBeautiful art and spaceships.\nAwesome boss fights.\nAddictive, ruthless.\nEndless arcade gameplay.\nQuick and intense sessions.\nINFINITE REPLAYABILITY: levels are (practically) randomly-generated.\nARSENAL: 35 weapons and 25 upgrades with many interactions and combos.\nSCORING: beat your friends and be the best!\nDAILY RUN: everyday, try to be the first in a special leaderboard where all players share the same run, guns and bosses. Beware, you only get one chance per day!\nARENA: Unlock a boss by defeating it in the normal mode. Then, train against it in a 1 to 1 duel. Your guns, your laws, your fight.\nWebsite: http://steredenn.pixelnest.io\nDevblog: http://steredenn-game.tumblr.com\nRelease: 01/10/2015","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":51177,"name":"Leisure Suit Larry - Magna Cum Laude Uncut and Uncensored","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/952/952d3b4ae24ed26fa1d7270a3974d485.jpg","description":"With gorgeous co-eds everywhere, college dweeb Larry Lovage is chasing around more than his diploma. He's trying to live up to the legend of his uncle, Larry Laffer, everyone's favourite polyester playboy. Larry Lovage is a typical college student. He lives in a dorm, has a crush on his biology professor, and goes to bars with his buddies. But when a TV dating show comes to campus, Larry gets a chance for national sexposure. If he can show that he can make any girl on campus swoon, he will become a campus legend.\nFollow Larry's hilarious exploits and misadventures in the wackiest college story ever. Updated with 3D graphics, engaging real-time conversations, and a fully realized college campus, Larry is back to give gamers some lovin'. Remember, it's not about who you impress, but who you get to undress!\n-   Explore 25 different locations including college campus and adjoining parts of town.\n-   Create custom conversations in real time as you speak with any character in the game - be funny or fresh if you like.\n-   Over 12 types of mini-games, including Quarters, Tapper, Trampoline, Whack-a-mole, and more.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":17926,"name":"Space Run","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/282/2824a1b82f4625432fece85df0c62626.jpg","description":"Space Run is a «real-time spaceship construction strategy game». Space Run takes the well-known Tower Defense-style gameplay and twists it, challenging you to manage and protect a spaceship and its cargo against the hazards of deep space!\nSpace can be a dangerous place. You’re one of the most daring «Space Transporters», people who carry the dangerous task of transporting valuable shipments from one place to another across hazardous space. This supposedly simple task gets tricky once you add dense asteroid fields that regularly cross the space lanes, the armed-to-the-teeth pirate starfighters and spaceships all too willing to shred your ship for your cargo, as well as the other Space Transporters you are competing against!\nTake on increasingly difficult missions as your reputation grows: bringing more expensive cargo to their destination will earn you credits to unlock new ship modules and upgrades that will help you survive the lethal threats of space: laser turrets, missile launchers, protection shields, thrusters, power generators... you name it! You’ll have to quickly adapt to every new situations if you wish to survive, building modules on your ship as you fly across space. The faster you fly and reach your destination, the better your reputation, allowing you to unlock more difficult delivery missions!\nSpace Run boasts high replay value: replay earlier missions with the new modules you unlocked in order to complete them faster and score higher... and show your friends you’re the fastest, most daring Space Transporter ever!\nMain Features:\n•\tAccessible and extremely dynamic gameplay that puts a new twist on the well-known Tower Defense genre\n•\tBuild your spaceship on the fly to adapt to every situation, protecting your valuable cargo and beating your competitor in deadly delivery races\n•\tEarn credits to Unlock & Upgrade new ship modules, allowing you to better defend yourself, attack other cargo, and complete your missions faster to gain higher reputation\n•\tHigh replay value: replay earlier missions with the modules you unlocked to best your friends’ and your own scores!!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9283,"name":"Bulb Boy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/60d/60d68be8a7d0ada5df88bd18acaff0d0.jpeg","description":"One gloomy night, Bulb Boy wakes suddenly from a frightening nightmare to discover that evil has overshadowed the Bulbhouse. His family has disappeared and there are horrid monsters lurking in the shadows. Gather the courage and use his glass head to save everything he loves. Find light in yourself!GameplayBulb Boy is an intuitive 2D point & click horror adventure about a boy with a glowing head (alright, it's a bulb...) inspired by Machinarium and Gobliiins. Solve puzzles, defeat wicked monsters and reveal bulby's abilities to unfold a twisted tale. Ohhh... And don't forget to save your Grandpa-raffin and Mothdog from the frightening darkness..Key Features DEFEAT THE MONSTERS -Explore the Bulb house, that is full of frightening creatures. Defeat the evil in all its forms and bring the light back.\nBULB'S TALENTS - Being a boy that is a bulb comes with many talents. Not only does your head light up and allows you to survive electrical shocks, but it can also be unscrewed for use in strange places.\nPLAYABLE FLASHBACKS - Play as other family characters. Relive Bulb Boy's childhood memories to uncover the mystery of the story.\nBUBBLE SPEECH - No dialogue, just bubble speech. Watch the story unfold in animated clouds.\nSECRETS - There are things in the house waiting to be revealed.\nPOOP -  In many sizes and proportions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":2820,"name":"Pneuma: Breath of Life","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12c/12c86061f7068f98df3d618b9b3c746a.jpg","description":"Pneuma: Breath of Life is an enthralling first person puzzler putting gamers’ minds to the test in a visually stunning world using the power of Unreal Engine 4. Pneuma provides players with a sense of awe and a relentless determination to solve every puzzle and progress through a narrated story of self-discovery, exploring the fundamental nature of being. This is the first person puzzler of 2015 which is designed to force players think outside the box and explore beyond what they know as reality.\nPlay as a god, ‘Pneuma’, and listen to his comical self-obsessed inner monologue whilst he takes you on a journey exploring and traversing his puzzling world in a story that can only be told through the interactive medium of video games. Rack your brain and progress through a series of environmental challenges that require perception, observation, and lateral thinking skills to succeed. Lift bridges, rotate platforms and move entire buildings all with the power of your mind. This game isn't about your skill with a controller, it's about how you perceive and analyse situations.\nPush your brain to its limits in this exciting new first person puzzler as Pneuma contemplates the nature of reality and you explore the ontological mystery of the Breath of Life.\nKey Features:\nManipulate unique lateral thinking puzzles based on perception, observation, and attention to detail.\nBecome immersed in Pneuma’s story and witness the genesis of the universe as he wrestles with the nature of reality. Pneuma's story is one that can only be told through the interactive medium of video games.\nUnleash the power of Unreal Engine 4 and physically based rendering inside a world that constructs around you.\nExclusive to PC Gamers – Virtual Reality Support:\nPC players will be able to experience Pneuma’s unique puzzles in an exclusive virtual reality mode through the power of the Oculus Rift DK2. The game play mechanics in Pneuma revolve around your observation skills. Actually being able to physically move your head to look at and control objects to solve puzzles with the combined power of your sight & mind is something we feel Oculus Rift users need to experience. Pneuma is a challenging and mind bending puzzling game with an immersive story, and virtual reality only adds to that experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Deco Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":370143,"name":"Monster Prom 2: Monster Camp","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/607/607a887083f681e4e3cbc49cde6594f0.jpg","description":"\"Monster Prom 2: Monster Camp\" brings you more of the world's best (and maybe only?) multiplayer dating sim; but in a way you've never expected!\nThe original Monster Prom is a multiplayer dating sim that shines for its beautiful art and unapologetic humor.\nThe sequel brings you into a new setup (summer camp) with new characters to romance, including old faces and new ones: Damien, Calculester, Milo, Dahlia, Joy and Aaravi. But that's not all, Monster Camp comes with twists here and there: from the campfire mechanics to a new stage full of magic mixed drinks.\nWe're repeating the best from the popular \"Monster Prom\" formula, but adding some new spices to it. You will see ;)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Beautiful Glitch","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17528,"name":"Chronology","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/120/120530499012ea0149cfe358330b10c9.jpg","description":"Chronology is a mind-bending mix of puzzle, adventure and platform game where you defy time by manipulating the past and the future, in order to fix the present. Play as the Old Inventor and his sidekick The Snail, and take advantage of their special abilities - travel back and forth in time, stop time, manipulate objects and solve puzzles.Key Features\n• Time changes everything - Solve puzzle by travelling back and forth in - or freezing - time\n• Characters with heart and soul - Switch between two lovable characters with different abilities and combine their strengths\n• A mind-bending story line. As the story unfolds, learn how the main character has already played a central role in shaping the future of his world\n• A magical, colorful, vibrant and living universe that mixes elements from different times and cultures\n• Amazingly animated characters, machines and creatures, inspired by Hayao Miyazaki(Howls Moving Castle, My Neighbor Totoro)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bedtime Digital Games","platforms":[{"id":0,"name":"PC"}]},{"id":5137,"name":"Resident Evil 3: Nemesis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b2/1b28e8ecb335bfdfbb85510d82810fbb.jpg","description":"Join Jill Valentine, the heroine and amazing survivor of the notorious disaster at the mansion, as her nightmare continues.  The next terrifying drama from the blockbuster Resident Evil® Series. This unique adventure intricately reveals more of Umbrella Corporation’s nightmarish plot and picks up just hours before the events from Resident Evil® 2.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Capcom","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":957,"name":"The Amazing Spider-Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f35/f351524037fe40b677c570acbe218d05.jpg","description":"Optimized for the 4-inch Retina display on iPhone 5!\nTHE OFFICIAL GAME FROM THE 2012 MOVIE \"THE AMAZING SPIDER-MAN\"\nGet ready for intense web-slinging action with the Amazing Spider-Man! Join Spidey in the official game app of this highly anticipated 2012 blockbuster! Play through the movie storyline as Spider-Man faces off against the Lizard and rampaging gangs. Web-sling and crawl your way through an open, fully 3D New York while using your amazing skills to save the city.\nTHE OFFICIAL GAME OF 2012’s HIGHLY AWAITED SUPERHERO BLOCKBUSTER\n• Fight the Lizard and his minions to put a stop to his dark schemes.\n• Play the Amazing Spider-Man through more than 25 immersive missions inspired by the upcoming movie's storyline.\n• Climb, jump and web-sling from building to building for an aerial thrill like never before!\nFREE NEW YORK CITY\n• Explore the city through its five distinctive districts (Central Park, Business, Downtown, Pier and Residential)\n• An exciting and enjoyable fighting system with melee, ranged, combo attacks and much more\n• A wide selection of upgrades to customize your style, attacks and skills\nA HIGH PRODUCTION-VALUE GAME\n• Explore an open-world Manhattan, teeming with action. Discover random missions, collectibles and more secrets in the City that Never Sleeps!\n• Fight in a fully 3D New York City with cutting-edge graphics.\n• Advanced shaders and visual effects make Spider-Man more realistic than ever before!\n\n** Confirm that your device is compatible. The Amazing Spider-Man is only compatible with 4th generation iPod touch devices (16/32/64GB) along with iPhone 4, iPad 2, and the New iPad. Before downloading, please check the back of your device to make sure that it meets the system requirements**\n----\nVisit our official site at http://www.gameloft.com\nFollow us on Twitter at http://glft.co/GameloftonTwitter or like us on Facebook at http://facebook.com/Gameloft to get more info about all our upcoming titles.\nCheck out our videos and game trailers on http://www.youtube.com/Gameloft\nDiscover our blog at http://glft.co/Gameloft_Official_Blog for the inside scoop on everything Gameloft.\nCertain apps allow you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.\nPrivacy Policy : http://www.gameloft.com/privacy-notice/\nTerms of Use : http://www.gameloft.com/conditions/\nEnd User License Agreement : http://www.gameloft.com/eula/","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Beenox","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"}]},{"id":49788,"name":"Life is Feudal: MMO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/03b/03b98789e89e9f8fde939a09f1f7b0c7.jpg","description":"Life is Feudal: MMO enables you, along with thousands of other players, to dive into a living, breathing - and ever-evolving - world. You can create and influence the history in the land of Abella and have those events ripple through eternity.\nBegin your journey by stepping into an enormous 21x21km, fully realized world, complete with naturalistic weather, day-night cycles, and changing seasons. Various areas produce differing amounts of region-specific resources, while the weather alternates throughout the land, and can play a vital role in successful crop growth and availability of natural resources. Each region can offer unique advantages and favorable conditions for brave adventurers.\nExplore a vast world; choose a suitable location for your humble home, walled city or strapping fort. Level and terraform to perfect the area before getting to work. Set out to meet new friends and forge alliances with neighbors — imagine the possibilities with a team of people. Excluding the starting city, everything will be built by you - the players, as you cooperate to build majestic kingdoms and thriving communities.\nKingdoms will rise and kingdoms will fall. The pen can be mightier than the sword if wielded properly. Guild holdings can turn into towns; towns into cities and cities into kingdoms, stretching across the land. Do you have what it takes to form coalitions and alliances to defend your lands and rule over Abella?\nWhen diplomacy fails, it is time to reach for the sword. During this era, there was always that bright, shining light of peace and prosperity, but, alas, civilizations were usually mired in the dark, brutal and often violent reality of medieval life. Take up arms against your foes, utilizing the non-target, physics-based combat system. With realistic player damage you can create deadly combos to deliver bleeding wounds and fractured bones, and in the end... conquer the battlefield.\nEstablish yourself as an entrepreneur; watch your wealth and influence grow as you build an empire with a completely realistic economy. Barter for goods with others through player-built trading posts across the world. Set up trade routes and recruit competent guards to escort you and your caravans, offering protection from raiders and brigands on your journey.\nEngage in fun minigames to earn high score results, which you can use in-game to improve mass production actions to maximize the quality of your crafted items results and the speed in which you complete them. If you suck at these minigames (or if they’re just not quite your thing), never fear, you can get your friends involved by simply generating a code on your account to share - you will be able to use these results in your crafting!\nCarve out your legacy; be a part of the history of Life is Feudal: MMO.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bitbox","platforms":[{"id":0,"name":"PC"}]},{"id":43624,"name":"Eastshade","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/558/558d29cc36d10afae417542ee54a1823.jpg","description":"You are a traveling painter, exploring the island of Eastshade. Capture the world on canvas using your artist’s easel. Talk to the inhabitants to learn about their lives. Make friends and help those in need. Discover mysteries and uncover secrets about the land. Surmount natural impasses to reach forgotten places. Experience how your actions impact the world around you.FeaturesInteract with the locals through dynamic conversations with discoverable topics and branching dialogue.\nCompose paintings anywhere in the world and offer them to characters to gain items, knowledge, and unlock secrets.\nAcquire materials and schematics to surmount obstacles.\nActions and dialogue decisions affect future interactions and outcomes as you meet new characters.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Eastshade Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]}]