[{"id":50214,"name":"Ring of Elysium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41b/41b396a56bcce431dfe1beb920e9faf5.jpg","description":"<h3>About Ring of Elysium</h3>A sudden volcanic eruption has filled Europa Island with deadly volcanic ashes, and you will have to do whatever it takes to stay alive.<br/><br/>With the deadly ashes spreading across the island, the only way out is a rescue flight which arrives in around twenty minutes, the helicopter can only save up to four people, and will only stay for a short period of time.<br/><br/>So now, prepare yourself to survive this astonishing disaster and SURVIVE!<h3>Classic mode</h3><br/><strong>1.Regional Transformation</strong><br/>The map will be divided into different zones, and with time, the concentration of ashes will increase drastically.<br/><strong>2.Various Player Abilities</strong><br/>Gliders, BMX bikes, grappling hooks... Throwing extreme sports into the mix creates new playstyles limited only by imagination. While players fight their way through the disaster, how best to utilize these abilities often mean the difference between life and death.<br/><strong>3.Rescue Helicopter</strong><br/>Unlike the traditional winning condition, your ultimate goal is to board the rescue helicopter, which opens new strategic possibilities in the Battle Royale genre.<br/><strong>4.Convincing Natural Disaster</strong><br/>Highly detailed presentation of natural disaster- simulating surreal weather conditions: Sunny, Cloudy, Foggy, Heavy Rain, Thunderstorms...<h3>Ashen Eye</h3><strong>1.No zone shrinking</strong><br/>There will be no \"zone shrinking,\" the only safe haven from the deadly fumes will be the  ever-moving \"Ashen Eye\". Being stranded in this volcanic apocalypse, this would be an unprecedented test of survival.<br/><br/><strong>2.Oxygen is key</strong><br/>Time will be tight, and you will have to do whatever it takes to scavenge as much oxygen as you possibly could to survive. This breathtaking competition of survival is on the verge of breaking out!<br/><br/><strong>3.Escape</strong><br/>The helicopter will only rescue the survivor with the most oxygen. However, with the arrival of the helicopter, your location will be revealed to all enemies on the map. Do you have what it takes to survive until the very end?<br/>","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"个人","platforms":[{"id":0,"name":"PC"}]},{"id":441,"name":"Deus Ex: The Fall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24d/24df5a8d70c80c15dade8304dd4370a5.jpg","description":"Deus Ex: The Fall is a first-person role-playing stealth-action game developed by Eidos Montreal. It is the fourth installment in the series. The game serves as a prequel to Deus Ex: Human Revolution.\n\nThe year is 2027. Human augmentations are a common thing. Bex Saxon, an ex-SAS, gets employed by a PMC called Belltower Associates. Hiding from the Illuminati in Costa Rica, Ben starts to experience augmentation rejection syndrome because of a global shortage of Neuropozyne which suppresses the symptoms. Ben unravels a global conspiracy revolving around the drug and tries to warn the World Health Organization.\n\nLike the previous installments, the game features a high degree of role-playing. Players are able to upgrade their augmentations, unlocking more and more abilities. An inventory system is also present. Players have the option to use lethal or non-lethal approaches using different takedowns, and a wide range of weaponry. The levels are fairly open-ended so it is possible to complete a mission without even confronting the enemies.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"N-Fusion Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":17545,"name":"Assassin’s Creed Rogue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c4/3c4a44ed99c87c56e0cdcfaaaf5c3628.jpg","description":"Assassin’s Creed Rogue is an action-adventure game developed by Ubisoft Sofia. It is the seventh game in the series, continues the story of Black Flag and serves as a prequel to Assassin's Creed 4. Its final mission is also a set up for Assassin's Creed Unity.\n\n###Plot\n The game's story takes place both in the past and the modern times. During the Seven Years' War, a young American assassin Shay Patrick Cormac trains with his old French friend. After an unsuccessful mission, Shay is disappointed by the Assassins Brotherhood and goes rogue.\n\nMeanwhile, in the present, a virus attacks Abstergo Entertainment servers. A major conspiracy is revealed by the player after fixing the servers.\n\n###Gameplay\nThe players can explore the northern part of North America - a frozen seashore of the Atlantic, the territory of the Apache, the Valley of Rivers, and New York, that got remade with respect to the real city of the eighteenth century. \n\nThe game features the same ship sailing mechanics as features in Assassin's Creed IV. It is essential for Shay to escape the Assassins he will encounter, minimize the casualties of his sailors, and destroy enemy ships. Shay's ship named \"Morrigan\" is well-adapted for sailing through the ice and the seas of the Atlantic. It is equipped with barrels of oil and Puckle guns.\n\nIn his inventory, Shay has several swords, an air gun, a pistol, and several grenades. The game rewards creative mission approaches and does not restrict the players in any manner.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":28589,"name":"Halo 3","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/982/982ff61d574fed5e416cb1867b40d9b0.jpg","description":"Halo 3 is a first-person shooter from Bungie and another installment in one of the most popular gaming universes. The third part of the franchise completes the story begun in Halo: Combat Evolved.\r\n\r\nThe action takes place in years 2552-53, in which humanity colonized the distant boundaries of the universe and met the aliens The Covenant. As a result of the conflict, a war begins between two species. Play as the Master Chief, who suffers a crash in eastern Africa. He is found by his allies Johnson and the Arbiter and together they are sent to repel the alien aggressors.\r\n\r\nHalo 3 is a traditional first-person shooter, with a well-designed game world and mythology. The series is known for its multiplayer, which many consider the best in the genre. Matches can fit up to 16 people, who fight in several game modes. They are a variation on the Deathmatch and Capture the Flag modes. In addition to multiplayer battles, players can go through the campaign together with 3 friends in a cooperative mode.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bungie","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":19655,"name":"Guacamelee! Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2eb/2eb8f1b4787c3beaa568bc52c0580cba.jpg","description":"Guacamelee! Gold Edition is the enhanced edition of Guacamelee! that features all downloadable content for the original game and supports Steam Workshop to create and share custom character skins. In its core Guacamelee! is a 2D Metroidvania with platforming and brawling elements.\nGuacamelee! is set in an open Mexico-stylized world, full of stereotypes and cultural references. You take on the role of an ordinary farmer named Juan Aguacate. Killed by an evil skeleton, you are brought back to life to save your love interest. The game follows the rules of the Metroidvania genre but has a twist: as you are revived, during your adventures you can switch between the land of the dead and the world of the living.\nAside from that Guacamelee! is focused on exploration and hand-to-hand fights. While progressing through the story, you get new abilities such as movement upgrades and the necessity to match colors of your attacks and certain obstacles.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4031,"name":"Dead Island Riptide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/569/5695d8534579129ad6b40fefa2ef360c.jpg","description":"Riptide is a standalone expansion pack to the game Dead Island from the Polish studio Techland. The action takes place immediately after the end of the original game: the main characters assumed that they escaped danger, but fate decreed otherwise and they find themselves on a ship full of zombies.\n\nAccording to the schedule and the gameplay, the game was not far from its predecessor. The game is still a mixture of first-person action-RPG and survival horror. Just like in the first game, the character gains new levels, upgrades skills and buys new equipment. Structurally, the game has changed little: the player is again forced to perform repetitive tasks and seek salvation.\n\nThe campaign can be completed in solo or in a cooperative mode. The level of complexity, in this case, increases accordingly. The game realistically recreates the process of dismembering the bodies of zombies which is franchise is known for. Developers also tuned the game setting a bit, fixed the bugs and shortcomings of the previous game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":17854,"name":"Teleglitch: Die More Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7b/f7be8b51b1f9d94ddeac27f7b7229440.jpg","description":"Steam Big Picture\nAbout the GameIn a cold, dark future dominated by mega-corporations, a small lonely planet on the edge of habitable space is the site of a shadowy research facility specializing in necrotic tissue reactivation. You are a scientist who has suddenly awoken to the realization that you are the lone survivor. The rest of the facility’s personnel have all been killed – micro-chipped and reactivated as combatants by the facility’s central processing AI.\nTeleglitch: Die More Edition is a roguelike top-down shooter with retro pixel graphics. Featuring procedurally generated maps that change with each play through, you will never experience the same facility twice.  Clutch your gun, walk down the dark corridors and enter each new room hoping those last few rounds of ammunition will be enough. Feel the anxiety, the paranoia and the sheer terror of Teleglitch.Key Features Over 20 types of enemies to combat\nMore than 40 types of weapons and items\n10 levels that radically change their structure every time you play\n10+ hours of play time (it gets harder the further you get)\nDetailed database with full dossiers of each monster\nScavenge random equipment to craft new and deadly gear like The Can Gun (empty can + nails + explosives)\nA sinister narrative filled with greedy military corporations covert experiments\nThe risk of permanent death creates an atmosphere of fear and dread\nThe Die More Edition features:\n5 bonus levels\nAdditional items and weapons\nUpgraded and more deadly enemy AI\nExpanded dossiers and lore content","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Test3 Projects","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":464,"name":"Baldur's Gate: Enhanced Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/313/3136687fb0b34490d082b7272a0868e2.jpg","description":"Baldur's Gate: Enhanced Edition is a fantasy role-playing game, a remake of the original 1998 release.\n\n###Plot\nThe plot follows a player-created character in the world of Forgotten Realms, mainly in the location known as the Sword Coast. Set out on a quest for vengeance and resolving a crisis, the hero finds many friends and enemies, and ultimately, reveals his origin and the circumstances of the game’s introduction.\n\n###Gameplay\nThe player can choose from different classes and in-game races, each with their advantages and disadvantages, and equip the corresponding gear to utilize the character’s skills of choice further. The role-playing system in the game is rich with dialogues and interactions with NPCs, as they often provide valuable information, quests or items. Combat in Baldur’s Gate is made through real-time actions and planning in pause mode, allowing players to create different strategies for more tough encounters.\n\n###New in enhanced edition\nThe remake brought various bugfixes and overhauls for current-gen gaming systems, allowing for bigger screen resolutions and overall higher quality of graphics while retaining the key gameplay features. New NPCs and related quests, as well as an expansion pack, were added to Enhanced Edition, and new difficulty levels were implemented, either for players who only want to immerse in the story, or those who prefer a real challenge to their skills.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BioWare","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":271,"name":"Kingdom: New Lands","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f6/5f691054fdbec8705491fa1f54a06b8a.jpg","description":"Tales spread of far off isles with mysteries waiting to be discovered. Rulers will need all the strength of their subjects to sail away and find new kingdoms in these New Lands.\n\nKingdom: New Lands builds upon the award-winning gameplay and mystery of Kingdom by introducing an abundance of new content to the IGF-nominated title while maintaining the simplicity and depth that legions of monarchs have come to experience and enjoy. Travel to the New Lands and welcome the deluge of new mounts, merchants, and vagrants that call these isles home, but be wary of the new obstacles that threaten your arrival -- for not just the greedy creatures block your way but even the environment itself can defeat you.\n\nKingdom: New Lands asks you to puzzle things out on your own. You'll come across items, NPCs, and mysterious statues to help you but you'll have to figure out just how exactly they'll aide you in building and defending your Kingdom.\n\nKingdom: New Lands features:\nLook, we REALLY didn't want to have to give you a feature list... but if you insist...\n• One ruler, their horse, and a bag of coins\n• Greedy creatures trying to take your coins and crown every night (stop them!)\n• Loyal subjects who will help build, attack and defend your Kingdom\n• Multiple upgrades for your homestead, different unit types to attack and defend, and secrets littered throughout the land\n• Beautiful soundtrack that has received two honorable mentions from the Independent Games Festival\n\nBe brave, ruler, and fight to the bitter end, lest these New Lands conquer you instead.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Raw Fury","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":9659,"name":"Bulletstorm: Full Clip Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ec/4ec6786820944f923eb212a3ed8d23be.jpg","description":"Step into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Grayson’s blind desire for vengeance finds his crew stranded on Stygia where he can finally confront the commander behind his betrayal—or get his team off the planet alive.\nBattle your way through throngs of Stygia’s mutated inhabitants, performing masterful kills throughout the single-player campaign—or one of 30 competitive score-challenge or 12 co-operative multiplayer maps—using Bulletstorm: Full Clip Edition’s unique “Skillshot” system that rewards you for executing the most creative and deadly kills imaginable.\nBulletstorm: Full Clip edition is the definitive Bulletstorm experience that includes all existing Bulletstorm add-ons, plus brand-new content exclusive to Full Clip!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"People Can Fly","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":19908,"name":"LEGO Batman 2 DC Super Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c1/3c139f67a73f0bf5ce0d8f2abf83c0d0.jpg","description":"This sequel to LEGO Batman: The Videogame is set in the LEGO version of the DC Universe. It features trademark LEGO bricks aesthetics and comical portrayals of popular DC characters.\n\n###Plot\nSet in the Gotham City, the story starts when Bruce Wayne is competing with Lex Luthor for an award. As Wayne is about to receive it, Joker and his cronies invade the ceremony. Bruce has to don the Batman's cape to stop and catch the villains. Soon it turns out that Luthor was behind the plan all along. He releases Joker and other supervillains, such as Harley Quinn, Two-Face, Poison Ivy, Catwoman, and Penguin, from Arkham Asylum to wreck chaos on Gotham City. In turn, Superman and other superheroes come to Batman’s help.\n\n###Gameplay\nThe game is set in an open world shown from the third person perspective. Over the course of the game, the player will control not only Batman but also a variety of LEGO versions of the famous DC superheroes and other characters. A total of 75 playable characters includes Superman, Wonder Woman, and The Flash, among others. Occasionally, the game will require the players to build objects, such as vehicles, using LEGO bricks to solve puzzles or access certain areas. The player can scavenge bricks from the fully destructible environment that is completely made of LEGO.\n\n###Multiplayer\nThe game allows two players to join forces in a local cooperative mode. It uses a split screen to allow full freedom for each player. There’s no online multiplayer.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii U"}]},{"id":16161,"name":"Hard Reset Extended Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e29/e29ce2369152515e9ae20c6e217cbe81.jpg","description":"In the only remaining human city of Bezoar, Major Fletcher, an Army Combat Veteran and soldier of the CLN, is dragged into a conflict between two of mankind's greatest enemies. He is to discover that nothing is what it seems to be.\nHard Reset is an action-packed, single-player shooter for the PC. With over-the-top destruction, loads of enemies, great weapon variety and a beautifully realized cyberpunk setting, Hard Reset is sure to shake up the shooter scene.\nKey features:\t\t\t\t\t\t\tA haunting cyberpunk / dark sci-fi setting\nFast-paced, old-school shooter gameplay\nHordes of enemies to destroy\nEpic boss fights\nA deep, experience-based weapon upgrade system\nHigh-fidelity graphics with full dynamic lighting\nExtensive use of physics and dynamic environments\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"PC"}]},{"id":16813,"name":"Mount & Blade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee7/ee7e7b6d5dbf0adf7705eff6912a3e60.jpg","description":"Not every medieval game has to have fantasy elements, magic and the prophecy of a great hero. Mount & Blade is an action RPG set in the sandbox kingdom of Calradia. Players are creating their characters at the beginning of the game, by answering some multiple-choice questions about their past and then pick the appearance. After the quick preparations, the character is dropped in the world where they can choose their own adventure, by either joining one of the combating factions, becoming an outlaw or a mercenary. By traveling to different locations, player will find some quests to follow, gaining renown for winning battles in order to level up skills, attributes, and weapon proficiency.\nMount & Blade offers a different take on the combat. The player can clash on the open map with an opposing army or join the already ongoing conflict between two or more hostile parties. Sometimes a tournament is organized in town arenas.  If players gain the control over the fort or are attacking one, they participate in the siege combat where the player can either defend or attack a fortification. And when players are given control over a settlement, they might be involved in conflict after a triggering event.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"TaleWorlds Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":709,"name":"Hawken","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9da/9da42a4da370cc386c8578f0b2578e2c.jpg","description":"Hawken is a multiplayer fighting game that places you in front of the control panel of a huge robot. There are 12 mech models, and each of them has its own unique characteristics: while the first ones are faster, the second are stealthier, and the third are stronger. Additionally, every mech has a special ability. You can choose the robot that fits your playstyle - or try them all one by one.  \n Mechs can be upgraded with experience points, gained during battles, or with modules and gadgets, you can buy in stores. While the experience develops passive initials characteristics, gadgets work as boosts and additional abilities.  \nMaps in these game deserve special attention as they are not flat and linear - instead, each of them has several levels to demonstrate mechs’ ability to jump and fly. Map design is another challenge for you along with the development as it needs you to be careful and quickly respond to your opponents’ moves and attacks.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":22397,"name":"Command & Conquer: Red Alert 3 - Uprising","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a1/4a1e460708b6c2114e4735e04dc58510.jpg","description":"An expansion to Command & Conquer: Red Alert 3 that can be played without the original game. Uprising features additional campaigns for three factions: the Allies, the Soviets, and the Empire of the Rising Sun. The plot continues the events of Red Alert 3, making Allied victory in previous game canon.\nThe Soviet Union fights for its very existence because Allied corporation FutureTech is developing a weapon that can freeze time. Its leaders want to erase Soviet Russia from the history once and forever. The war in Allied-occupied Japan continues, as there are still pockets of resistance that Allies have to suppress, and there are two Russian generals taking over parts of the Empire. There's also a standalone campaign that reveals the origins of Yuriko Omega, a Japanese girl with psionic abilities, and follows her as she becomes a commando for the Empire, and later a prisoner of the Allies.\n\nUnlike some of the previous games in the series, Red Alert 3 – Uprising allows no multiplayer modes, neither cooperative nor competitive.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"}]},{"id":479694,"name":"Inscryption","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/73e/73efc5c0ac6f354271dae610276f617c.jpg","description":"From the creator of Pony Island and The Hex comes the latest mind melting, self-destructing love letter to video games. Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie. Darker still are the secrets inscrybed upon the cards...\r\nIn Inscryption you will...\r\nAcquire a deck of woodland creature cards by draft, surgery, and self mutilation\r\nUnlock the secrets lurking behind the walls of Leshy's cabin\r\nEmbark on an unexpected and deeply disturbing odyssey","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Daniel Mullins Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":58890,"name":"Need For Speed: Most Wanted","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41b/41ba37b6a3e706dc1d27d49afbf0f72a.jpg","description":"Wake up to the smell of burnt asphalt as the scent of illicit street\nracing permeates the air. Need for Speed Most Wanted challenges you to\nbecome the most notorious and elusive street racer.\n\nFeatures\n\n• Master the art of cop evasion in Barricade Runner and other new race\nmodes.\n• Modify your ride to beat any tuner, muscle, or exotic.\n•\nCustomize the look of your car to elude police pursuit.\n• Win races,\nclimb the Blacklist, become the Most Wanted.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Electronic Arts Black Box","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PSP"}]},{"id":58835,"name":"Yakuza Kiwami 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b32/b32735e3f7d95959cc39265f555f2aa8.jpg","description":"Kazuma Kiryu thought his Tojo Clan days were behind him. He and the young girl in his care, Haruka Sawamura, have built a peaceful life from the ashes of conflict. All it took was a single gunshot to shatter that peace. Yukio Terada, the Fifth Chairman of the Tojo Clan, has been assassinated. With war on the horizon, the legendary Dragon of Dojima is pulled back into the world he wanted to leave behind. \nKiryu must travel to Sotenbori, Osaka in an attempt to broker peace between the rival clans, but Ryuji Goda, known as the Dragon of Kansai, will stop at nothing to get his war. In this world, there can only be one dragon.\n\nRebuilt from the ground up, Yakuza Kiwami 2 uses the Dragon Engine to update one of the series stand-out titles into a modern classic. The PC version includes all the enthusiast features you’ve come to expect: 4K resolution, unlocked framerates, customizable controls, and robust graphics options.\nPlay fan favorite minigames including updated versions of the Cabaret Club simulator and Clan Creator, or check out all new additions like an arcade port of Virtual On, golf bingo, and Toylets. \nAlso new to Kiwami 2 is the 'Majima Saga' which features Goro Majima in his own playable adventure revealing events that occur prior to the game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":339958,"name":"Persona 5 Royal","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9c/a9c789951de65da545d51f664b4f2ce0.jpg","description":"Wear the mask.  Reveal your truth.\nPrepare for an all-new RPG experience in Persona®5 Royal based in the universe of the award-winning series, Persona®! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona®5 Royal is packed with new characters, story depth, new locations to explore, & a new grappling hook mechanic for access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona®5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Atlus","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":10665,"name":"POSTAL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ab/7ab68441389f60523d2f6cb75c6393f2.jpg","description":"POSTAL is the first part in its series of shooting games. It is best known and somewhat infamous for its uncanny violence, cynical black humor, and a highly controversial theme. The game offers the player to \"go postal\" on a spree shooting across the city.\n\n###Plot\nThe player controls the protagonist, nicknamed The Postal Dude: a homeless middle-aged man who apparently goes crazy and hears disembodied voices. He believes in a conspiracy theory that US government has poisoned his hometown with a nerve agent, and he's the only sane person around. He tries to eliminate the crowd he considers \"infected\". His goal is to fight his way to the US Air Force base which he believes is responsible for the presumed attack.\n\n###Gameplay\nUnlike its better-known sequel, POSTAL is 2D and uses top-down and isometric views. On each level, the player has to kill a specified share of enemies: civilians, military, and police alike. When this goal is complete, the door to the next level will appear. The player can complete the level even if The Postal Dude is killed, as long as the number of his own kills is satisfactory. The character can carry up to 8 types of weapons with varying strength and ammo limit. His basic gun is the weakest but has indefinite ammo supply.\n\n###Expansions and adaptations\nThere's an expansion pack Special Delivery that adds more levels and characters. In 2016, the game was remastered and re-released as Postal Redux. The game was unsuccessfully adapted to film by Uwe Boll.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Running With Scissors","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10309,"name":"Endless Space 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/72b/72bf31a664fcbcb079baf4ef8221f308.jpg","description":"Digital Deluxe EditionOfficial Digital SoundtrackAll Endless Space 2 tracks created by FlybyNo in mp3 format.Pathfinder Hero Ships’ Skin (Cosmetic)Adds a selectable alternate “Pathfinder” skin set for all hero spaceships.Pathfinder Academy Heroes (Cosmetic)Adds “Brunem Berto-Lancellum” and “Kinete Muldaur” to the hero cast of the game.\nAbout the GameEndless Space 2 is a strategic space opera, featuring the compelling “just one more turn” gameplay, set in the mysterious Endless universe. As the leader of your civilization, will you impose your vision and build the greatest stellar empire?\nYou will explore mysterious star systems, discover the secrets of ancient races, develop advanced technologies of unthinkable power, and, of course, encounter new life forms to understand, to court or to conquer.\nYour story unfolds in a galaxy that was first colonized by a people known as the Endless, who rose and fell eons ago. All that remains of them are mystical ruins, powerful artifacts, and a mysterious, near-magical substance known as Dust.EXPLORE the Endless universe\nThe new Galaxy Generator has been completely overhauled to provide unique star systems and curiosities to explore, different planet types to colonize, luxuries and strategic resources to exploit, the mysteries of the Dust and new lifeforms to master, and a host of strange cosmic anomalies to deal with.EXPAND beyond the unknown\nClaim new systems by establishing outposts, and develop your planets into feared stellar fortresses or fabulous utopias full of wonders. Train your heroes to become fleet admirals, system governors or influential senators to guide your populations and make your galactic civilization thrive.EXPLOIT every opportunity\nCollect Dust, luxuries and strategic resources that are tradable on the marketplace, discover amazing new technologies, and keep one step ahead of the competition through trade corporations and subtle diplomacy.EXTERMINATE all resistance\nDesign your ships, build your fleets and carefully choose your battle plans to overcome up to seven opponents in online confrontations. Watch epic real-time space battles unfold, and improve your strategy for your next confrontations.EXPERIENCE a galactic saga\nDiscover each civilization’s story, from the Sophon’s AI gone berserk to the traditional Lumeris families facing an ambitious young upstart. Learn more about the origins of the lethal Endless creation called the Cravers. Find out more about the Heretic, a mysterious and powerful character hunted by the Vodyani… The galaxy will belong to the civilization that controls Dust and uncovers its secrets… but were the Endless alone in the galaxy? What is the true origin of Dust? Are the rumors around a mysterious organization called the Academy real?AMPLIFIED REALITY\nPress Space anytime to activate the Amplified Reality view and reveal in-depth contextual information about your systems, trade routes, diplomatic stances and even your ship stats during battle!GAMES2GETHER\nFollow the development of the game and get to know the talent behind the scene. Make your voice count by giving feedback on the game, submitting ideas, and voting for Art and gameplay elements. Participate in contests and design content that will be created by the studio and added to the game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amplitude Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":51687,"name":"Two Point Hospital","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b9/2b90a0b4cafe05eefaa2698d6613dc7f.jpg","description":"## Design Your Hospital\n\nBuild and customise your hospital - it is yours after all - with specialist diagnosis and treatment facilities, as well as the very latest in ornamental technology!\n\n## Cure Your Patients\n\nFeeling light-headed? Just wait until you see the other unusual illnesses afflicting the people of Two Point County. Care for, and profit from, the ill: that seems like it’s probably a win-win. They’ll need feeding, entertaining and curing if they’re going to recommend you to all their equally unwell friends! That cash isn’t going to make itself, now.\n\n## Manage Your Staff\n\nHire your staff, juggle their demands and cater to their personalities. Train a crack team that can handle every sickly challenge that’s thrown at it, and fire anyone that can’t.\n\n## Expand Your Organisation\n\nGrow the sickness business across the beautiful Two Point County. Research illnesses and develop new inventions to compete with rival healthcare companies.\n\n## Collaborate and Compete with Friends\n\nOnce you’ve conquered the world with your medical empire, contribute to Two Point County’s global medical community with collaborative research projects, or demonstrate your medical prowess in competitive multiplayer challenges.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Two Point Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":46560,"name":"Stick Fight: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/424/4246b028e70891609700f1566db8b8dd.jpg","description":"They might be 5 inches thick, but they are 17 inches of stupid. After peaceful negotiation breaks down, violence erupts. Stickfight pits four idiots against each other in physics based combat. Defeat your enemies in order to prove that you are always right, no matter what. Stick Fight: The Game was made by some people at Landfall during their spare time and is published by Landfall.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Landfall","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":637477,"name":"Splitgate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/278/27873379c6d27b968babbeefa9b44da3.jpg","description":"Splitgate is a free-to-play, fast-paced multiplayer shooter that features player-controlled portals. This sci-fi shooter takes the FPS genre to a new dimension with its portal mechanics, delivering high-flying, multi-dimensional combat. Evoking memories of the most revered shooters of the past two decades, Splitgate embraces the classic and familiar feel of close-quarters combat while adding a unique twist. IGN describes Splitgate as “Halo meets Portal.”\nPortal Combat: a New Kind of Shooter\nKeep your head on a swivel and experience intense, traversal action as you fly, flank, and frag through the air using portal combat to constantly out-smart and out-maneuver your enemies. There’s nothing quite like landing a no-scope headshot from behind after portalling circles around a confused enemy, who still thinks you are standing in front of him!\nComprehensive, Feature-Filled Multiplayer Experience for FREE\nAlong with grindable challenges, dozens of customizable characters, a competitive leaderboard and ranking system, and over 15 casual and competitive game modes, Splitgate offers more than 20 maps, each with its own unique setting and play style. The maps include a research facility inside an active volcano, an underwater luxury hotel, an alien crash site, and much more. Each map has its own look and feel and plays differently, rewarding players for adapting their tactics in the fast-paced, portal combat that only Splitgate offers. And it’s FREE.\nParty Up with Your Friends Across Multiple Platforms\nCross-play functionality lets you play with or against your friends across multiple consoles and PCs. Standard FPS controls and intuitive portal mechanics mean beginners are up and running right off the bat, and with competitive and casual modes, you can party up with friends of any skill level. You can even create a custom lobby with modifiers to play any way you like. We highly recommend Big-Head Mode with low gravity and unlimited ammo!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"1047 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":28613,"name":"Halo: Reach","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/045/0457f748c9492261ccb46147edf9c761.jpg","description":"Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". From the beginning, you know the end. Halo: Reach. Fall 2010. There are no refunds for this item. For more information, see www.xbox.com/live/accounts. (Online Interactions Not Rated by the ESRB)","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bungie","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":11164,"name":"A Hat in Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/594/5949baae74fe9e399adbce0c44e28783.jpg","description":"A Hat in Time is a cute-as-heck 3D platformer featuring a little girl who stitches hats for wicked powers.A little girl and her spaceshipIn A Hat in Time you play as a tiny space-travelling girl with a big tophat. Her adventure is halted when all her fuel, the Time Pieces, is lost and scattered across a nearby planet. Hat Kid must now jump, fight and stitch new hats to make her way into every nook and cranny of this new world in order to restore her fuel and resume her journey. On her way, she'll bump into the menacing Mafia of Cooks, the goofy birds of Dead Bird Studio, the spooky shadows of Subcon Forest, and more!Murder on a train! Parades! Trespassing in a movie studio?Every mission in A Hat in Time is unique! At one moment you'll be solving the Murder on the Owl Express by finding clues and interrogating the locals, the next moment you'll be the band marshal in The Big Parade, or sneaking through the bird-run Dead Bird Studio!Small child, giant worldsJump freely around in 5 massive worlds with new adventures to discover around every corner! Just like any child, Hat Kid loves to climb and explore, no mountain is too big for her sense of adventure. She can do multiple jump moves, as well as climb walls, and swing over gaps!Cute hats, magical yarn and snappy badgesBy finding and collecting rare magical yarn, Hat Kid can stitch new cute hats with a variety of abilities, including a witch hat that allows her to cook explosive concoctions, and a wooden ghost mask that allows her to peek into other dimensions. Hats can become even more powerful, by attaching badges that are found, sold and traded by the locals!Community-funded, community-focusedA Hat in Time was successfully funded on Kickstarter, reaching nearly 10 times its goal! In order to celebrate our community, A Hat in Time is releasing with full modding and Steam Workshop support, an in-game screenshot mode, and more!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Humble Bundle","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10023,"name":"Geneshift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80a/80a0d07be6109fde6b92ac5283e7056c.jpg","description":"Geneshift is a top-down shooter bursting with brutal gunplay and insane vehicle action. Unlock mutant skills and blast your way through the online co-op campaign. Then use miniguns, car bombs, invisibility, and more to outplay your friends in tactical online combat.\n4 Player Co-op Campaign\nPlay the story solo or with friends online and save the world from a mysterious outbreak.\n5v5 Multiplayer Combat\nBattle in game modes such as Capture the Flag, Checkpoint Racing and Zombie Survival.\nInsane Vehicle Action\nRide with allies to do drive-by shootings, detonate car bombs and capture key objectives.\nOver 30 Tactical Skills\nCreate complex skill builds as you gain experience and permanently level up your mutant.\nOver 20 Brutal Weapons\nFire pistols, shotguns, snipers, explosives... or save cash for the deadly superweapons.\nSecret Base Building\nPlace hidden chemicals to gain secret benefits like spying on enemies and teleportation.\nDeception & Deduction\nPlay mind games. Discover and destroy enemy chemicals by observing their movements.\nCompetitive Servers\nEarn ranks in competitive servers that balance teams with a unique ELO rating system.\nLeaderboards & Difficulties\nReplay the campaign in 4 difficulty levels and set high scores on various leaderboards.\nUser Generated Maps\nCreate maps in the editor and unlock sexy cosmetics whenever your maps are played.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nik Nak Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":43,"name":"Full Throttle Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ab1/ab1b125c1bf4899c58fe90226b9a1f5b.jpg","description":"One minute you’re on the road, riding, not a care in the world. Then some guy in a suit comes along and says he’s got a deal for you and your gang. But when you come to, you’ve got a lump on your head, the law on your back, and a feeling in your gut that the road you’re on is about to get a lot rougher…\nOriginally released by LucasArts in 1995, Full Throttle is a classic graphic adventure game from industry legend Tim Schafer, telling the story of Ben Throttle; butt-kicking leader of biker gang the Polecats, who gets caught up in a tale of Motorcycles, Mayhem and Murder.\nNow over 20 years later, Full Throttle is back in a remastered edition that features all new hand-drawn and 3D high-resolution artwork with 4k support, and with remastered audio and music. Blow your speakers with movie-quality sound and a full digital score featuring the GONE JACKALS - an authentic hard-hammerin' biker band!\nPlayers will be able to switch back and forth between classic and remastered modes, and mix-n-match audio and graphics options to their heart’s desire. Also included is a concept art browser with work from Peter Chan, and a commentary track with the game’s original creators.\nFull Throttle was the first game with Tim Schafer as sole project lead, and a much beloved cult classic! This special edition has been lovingly restored and remade with the care and attention that can only come from involving the game's original creators. It’s headed to PS4, PS Vita and PC in 2017.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":23479,"name":"Observеr","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f4/0f4f4764555736eebfeb01571e44e99e.jpg","description":"What would you do if your fears were hacked? >observer_ is a cyberpunk horror game from Bloober Team, the creators of Layers of Fear. Discover a dark cyberpunk world beset by plagues, war and squalor. Play as the new front line of neural police as you hack into the jagged minds of the insane.\nFeatures:\nObserve and Report - You are Dan Lazarski, an elite neural detective known as an Observer, and part of a corporate-funded police unit whose purpose is to hack and invade suspects’ minds. In this future, anything you think, feel, or remember can be used against you in a court of law.\nA Dark Dystopia - The year is 2084. If you somehow survived the Nanophage, odds are you were killed in the War. Those who live have turned to drugs, VR, neural implants— anything to distract themselves from this new reality. But they can’t hide from you.\nInteractive Insanity - As you hack into the unstable minds of criminals and victims to look for clues, you will relive their darkest fears, forcing you to question your own reality -- and your sanity.\nA New Horror from the Creators of Layers of Fear - The largest and most frightening world yet from Bloober Team! Lose yourself -- and your sanity -- in the dark dystopia that is 2084. >observer_ is a horror experience meant for mature audiences. What you see will disturb you.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bloober Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":22846,"name":"Thief 3: Deadly Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f89/f899f0bdeb6bcd7419d9b2281a693ad8.jpg","description":"Thief 3: Deadly Shadows is a stealth-action game developed by Ion Storm Inc. It is the third installment in the Thief franchise.\n\nThe game is set in a Steampunk world that resembles both the middle ages and the Victorian era. Besides that, there are several fantasy elements in the game. The thief named Garett is a member of the thief guild. He receives a letter in which the guild invites him to listen out the new prophecy. In order to be let in the palace where the prophecy will be unraveled, Garett has to steal two sacred relics. His new adventure begins.\n\nThe game can be played both from first-person and third-person perspective. The player may steal from innocents and avoid, distract, knock out or kill guards. Loot and weapons are picked up just by standing close enough to them. Locked areas can be unlocked using a lock-picking minigame. The player has to stick to the shadows during the missions, as running or walking will alert the guards who will come looking for Garett. \n\nThe levels are fairly open-ended and have different paths for the player to choose from. After completing each mission, the player is free to explore the City for loot. City areas unlock as the game goes on.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Ion Storm","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":17844,"name":"Divine Divinity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7d8/7d89761cadbd930a2e3cf7ff2679882f.jpg","description":"The first game in the Divinity franchise introduces the player to the medieval high fantasy world of Rivellon aka Land of Divinity. There’s an extensive backstory of the setting in the game. Rivellon is a troubled place torn by wars and rebellions and threatened by the awakening forces of Chaos. The protagonist starts his journey in the city of Aleroth. His or her first mission is to save the city’s chief healer who was cursed into madness by an evil wizard. After that, the protagonist is free to explore the world and accept a variety of side quests from NPCs.\n\nThe main character is fully customizable. At the start, the player is allowed to choose between six characters, who are male and female versions of the same three classes (Warrior, Mage, and Survivor). Each class has its own set of skills and attributes. However, over the course of the game, the character can learn virtually any skill regardless of his or her class. The game is played from an isometric view using point-and-click controls, thus being quite similar to the Diablo series. Unlike Diablo, it has a stronger leaning towards the classic RPG genre. Divine Divinity includes complex dialogue options, skill trees, and a reputation system.\n\nThe game’s soundtrack was composed by ex-Aria keyboardist Kirill Pokrovsky.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Larian Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1073,"name":"Keep Talking and Nobody Explodes","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e88/e88ccd83bb2d69ad04d18b06c5e0df3d.jpg","description":"Keep Talking and Nobody Explodes is a game about defusing a bomb. It was initially made for virtual reality headsets but also supports traditional screens and controls.\n\n###Player cooperation\nThe game is meant to be played by at least two people in cooperation. Only one of them is wearing the VR headset or actually interacts with the computer. He or she acts as the main defuser who has to deactivate the bomb. All other players assume the roles of the experts. Their task is to help the defuser by reading aloud a manual about bombs. The experts need to be either in the same room with the defuser or to contact him or her over an audio messenger. \n\nThe defuser is the only player who can see the bomb. He or she has to describe it in details to other players. The experts, in turn, have to find the described blocks in their manuals and tell the defuser what to do to solve the puzzle. \n\n###Bombs as puzzles\nThe composition and other attributes of each bomb are randomly generated for each level, and the players can customize them. The bombs consist of individual blocks, which are puzzles on their own. Some of the blocks require regular attention from the defuser, while others can be disarmed once and for all. \n\nThe time for each level is limited. When the countdown reaches the end, the bomb will explode. Defuser's errors may also speed up the countdown or even activate the bomb and \"kill\" him or her. Each bomb has its own limit of time and errors.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Steel Crate Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":2659,"name":"Trackmania Turbo","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/82e/82eeea65ebb047cc7f366faf2fb062b6.jpg","description":"Test your skills in outlandish tracks and challenge your friends at home (offline splitscreen) or online.\n4 ENVIRONMENTS = 4 GAMEPLAYS\n- Rollercoaster Lagoon: Defy gravity in a tropical paradise, racing on magnetic tracks.\n- International Stadium: Use your driving skills to master the tracks of this worldwide competition.\n- Canyon Grand Drift: Drift your way through  narrow tracks in this red canyon landscape.\n- Valley Down & Dirty: Use air control and jump through the hills in this countryside setting.\nCAMPAIGN MODE\nUnlock up to 200 unique tracks in over 5 difficulty levels. Drive your way to the tops of worldwide rankings!\nDOUBLE DRIVER\nFor the first time in a racing game, team up with a friend and control one car with two controllers!\nTRACKBUILDER\nDesign your own tracks or simply generate random ones.  Save and share your best tracks to make the competition last forever.\nVR COMPATIBLE\nThe immersion in the arcade racing univers goes to another level with 40 exclusive VR tracks.\nVR recommended system requirements:\nGraphics Card: GeForce GTX 970 or AMD Radeon R9 290 or better.\nCPU: Intel Core i5 4590 / FX-8350.\nRAM: 8GB or more.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":46508,"name":"Return Of The Obra Dinn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/052/052f9afc7aaeea3e2c5d46eafa92c64e.jpg","description":"In 1802, the merchant ship \"Obra Dinn\" set out from London for the Orient with over 200 tons of trade goods. Six months later it hadn't met its rendezvous point at the Cape of Good Hope and was declared lost at sea.  \r\n \r\nEarly this morning of October 14th, 1807, the Obra Dinn drifted into port with sails damaged and no visible crew. As insurance adjustor for the East India Company's London Office, find means to board the ship and recover the Crew Muster Roll book for assessment.\r\n\r\n(\"Obra\" is pronounced like \"Cobra\" without the C).\r\n\r\nFrom the author:\r\n\r\nGoals\r\n\r\nI want to challenge myself so this'll be a very different game from anything I've done before, including Papers Please. There'll be less creativity with the gameplay and instead I want to experiment with the rendering, story, and a few technical features. Right now I have only a rough idea about the narrative. I'm hoping to capture a compelling mystery with suspense and twists in the limited space of an old merchant sailing ship. It won't be the typical \"collect items and look for clues\" structure. There's a slightly cool gameplay hook but I won't go into details on that until much later.\r\n\r\n\r\nDevlog\r\n\r\nI'll try to keep this (https://forums.tigsource.com/index.php?topic=40832.0) devlog lively as I make progress. Because the gameplay itself is more standard, there probably won't be as many creative updates as the Papers Please devlog. I will post lots of pictures and builds as soon as I'm able. Things will likely also move slower than Papers Please did too, at least at the start. P,P still takes a good amount of my time so there's less chance for me to maintain a laser-like focus on one project like last time. The lower bound for finishing this game is around 3 months but realistically I think it'll take me around half a year. My Maya skills are pretty rusty so I expect the modeling/animation to take the most time.\r\n\r\n\r\n1-bit Rendering\r\n\r\nMy first computer was a Mac Plus. I've always had a nostalgia-softened spot in my heart for 1-bit graphics. I'd like to capture the detailed black & white look of old Mac games in a realtime 1st person game. I plan to push it grittier and less cartoon-like than those old games; the hard part will be keeping everything legible without it becoming an unreadable mess of dithered pixels. One interesting problem with 1-bit rendering is that it doesn't scale well for images and it compresses to video like shit - so YouTube stuff may look really poor. We'll see how it goes.\r\n\r\n\r\nUnity 3D\r\n\r\nI'm gonna use Unity for this one. I fell in love with Haxe/OpenFL on my last project but unfortunately the 3D situation is not that great there yet. Also, it's time to finally see why 90% of the indie scene is using Unity. I have a good amount of experience with 3D games and the few days I've played around with Unity so far have been pretty productive. The animated title screen scene up there (with post-processing shaders and all) was created in one day. I now have unrealistically high hopes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"3909","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58859,"name":"Marvel’s Avengers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1eb/1ebef06e55f756974654c35b9aedb127.jpg","description":"Marvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend the Earth from escalating threats.\n\nThe game features iconic Heroes as you’ve never seen them before, notable villains, recognizable locations, and awesome powers set in an original Avengers story.  Unlock powerful skills, heroic abilities, and unique gear for each of Earth’s Mightiest Heroes to suit your playstyle.\n\nUp to four players assemble online to defend the Earth from escalating threats that only the Avengers can overcome.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":28418,"name":"Diablo III: Reaper of Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/202/2023cb28ef354720a2ca4652727687d0.jpg","description":"Reaper of Souls is an expansion of Diablo 3 that introduces an additional story campaign and some new gameplay features. The plot continues the events of Diablo 3. A renegade angel Malthael decided that he should clean the world of demons. He stole the Black Soul Stone and is going to use it to imprison all the demons’ souls. As a collateral damage, however, it will also devour the souls of all humanity. Since you, the Nephalem, have already defeated demons in Diablo 3, it is your duty now to save the world from an angel.\r\nIn addition to five original Diablo 3 character classes, Reaper of Souls introduces a new one, Crusader – a heavily armored holy knight who uses large melee weapons and clerical spells. The maximum experience level the character can reach is raised up to 70. There’s also an Adventure Mode that allows you to wander the randomized world, complete tasks and take rift crystals as a reward. The expansion adds more enemies and items and improves the loot system: as you progress, you will find less loot, but the items themselves will be more valuable.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":14156,"name":"ENSLAVED: Odyssey to the West Premium Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/780/7804a1ce365e2c30d51007b910b14acf.jpg","description":"ENSLAVED: Odyssey to the West Premium Edition is one of those unexpected surprise games which one could call a forgotten gem. It tells a story about two characters who go to the journey and try to survive in a post-apocalyptic America. The game takes place in the future, about 150 years from now, war has destroyed the world and left it in ruins, and only a small amount of characters survived and yet they are imprisoned in slave ships who takes them to the west without turning back. \nThere are two main characters – a young woman named Trip, who manages to escape the slave ship and Monkey, who also escaped the prison ship with a help of his powers. Trip with her hacking skills hacks a slave headband and links Monkey. Now if she dies, Monkey will die too. Player gets a control of a Monkey and goes into a journey into the unknown post-apocalyptic world where one has not only to maintain deep relationship with his partner but also to survive in the dangerous world corrupted by sinister machines. \n\nThe Premium Edition includes not only an original game but also an additional DLC content and new character skins. Enslaved is based on 400-year old novel “Journey to the West”, co-written by famous novelist and screenwriter Alex Garland. Enslaved delivers an unforgettable and deep cinematic experience, shows one of the most believable post-apocalyptic worlds and offers interesting and deep combat mechanics.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ninja Theory","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":38965,"name":"Star Wars: The Old Republic","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/baa/baac774072d6319a166a453b8b3506df.jpg","description":"STAR WARS™: The Old Republic™ is the only massively multiplayer online game with a Free-to-Play option that puts you at the center of your own story-driven STAR WARS™ saga. Play as a Jedi, a Sith, a Bounty Hunter, or as one of many other iconic Star Wars roles and explore the galaxy far, far away over three thousand years before the classic films. With 5 narrative expansions, become the hero of your own STAR WARS adventure as you choose your path down the Light or Dark side of the Force™.Create your legacy. Make meaningful choices throughout your journey and become the hero of your personal STAR WARS saga. The game includes an interactive storyline with cinematic dialogue and full voiceover for all in-game characters.A growing world awaits. For more than 8 years, players have been able to live out their own Star Wars stories. With the most recent Onslaught expansion, STAR WARS™: The Old Republic™ continues to deliver ongoing content through regular updates.\n8 playable classes. Do you prefer the elegance of a lightsaber or the reliability of a good blaster by your side? Choose from one of 8 iconic roles and make your mark on the galaxy!  Each class has a unique storyline, allowing you to create your own personal STAR WARS story.\nExplore numerous planets. Hoth, Tatooine, Alderaan, and over 20 other unique and vibrant planets offer exciting exploration and thrilling adventures around every corner!\nMultiplayer gameplay.  Gather your allies to face challenging encounters against enemy bosses in Flashpoints and Operations, or battle against other players in Player vs. Player Warzones, Arenas, or Galactic Starfighter missions!\nGalactic Strongholds Want to take a break from the inter-galactic traveling and adventure? Kick back and relax with our player housing system called Galactic Strongholds! Whether it’s overlooking the sandy dunes of Tatooine, the bright cityscape of Nar Shaddaa, or the tranquil mountains of Alderaan, there’s a Stronghold for everyone. These destinations and more are available for your galactic homestead!\nCartel Market. Only the slickest items can make their way to the Cartel Market, the premium marketplace for the galaxy’s most sought-after commodities. Players wishing to buy things here will need to purchase in-game currency called Cartel Coins. Learn more about what Cartel Coins can unlock on our Cartel Coins Page.\nSubscriber Benefits. STAR WARS™: The Old Republic™ offers an optional subscription that allows you to experience even more of the STAR WARS universe.  Benefits include an increased level cap of 75 and access to the most recent expansions: Onslaught, Knights of the Eternal Throne, and Knights of the Fallen Empire. In addition, you will receive a monthly Cartel Coin Grant, increased XP, and more. Details on Subscriber Benefits can be found on our Subscriber Page.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BioWare","platforms":[{"id":0,"name":"PC"}]},{"id":11460,"name":"Astroneer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/02f/02f775a806c6cd64c28d5aeca928dc76.jpg","description":"Explore and reshape distant worlds! Astroneer is set during a 25th century gold rush where players must explore the frontiers of outer space, risking their lives in harsh environments for the chance of striking it rich. \r\n\r\nOn this adventure, a player’s most useful tool is their ability to shape their world, altering the terrain and extracting valuable resources from planets, and moons. Resources can be traded or crafted into new tools, vehicles, and modules to create everything from massive industrial bases to mobile rover bases.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"System Era Softworks","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":28619,"name":"Gears of War 2","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/51b/51ba5f9b280c6fec71c293fe276e24ec.jpg","description":"Continuation of the history of Marcus Phoenix, a soldier guarding the exoplanet Sera. the game is also a representative of the genre of military sci-fi, gameplay, it's a third-person shooter from the same developers. The game is famous for its signature assault-rifle with a chainsaw attached.\n\nThe second part of the COG troops continues to fight against The Locust Horde, which wants to destroy all the cities of people on the planet. This time, the main events unfold in the territory of The Horde: Delta Squad led by Marcus Phoenix, sent to the very abyss of the enemy rear. The plot campaign can be held alone or in a cooperative mode: the second player takes control of the best friend of Marcus Dominic Santiago.\n\nThe game almost did not change its mechanics, new ones were added to the existing multiplayer modes: five to five battles between humans and aliens and The Horde mode, in which players need to stand in front of the constantly growing forces of the rival.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]}]