[{"id":40086,"name":"Tropico 3: Absolute Power","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d7/4d75f689464c309f5817abe8cce484d8.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PC"}]},{"id":28832,"name":"Kinect Me","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/949/949c8a31cb4b64e607540a7a237a698a.jpg","description":"Create an avatar that looks just like you simply by standing in front of the Kinect sensor. Kinect scans in your clothes, face and voice to create your avatar. Pose for a photo shoot, then share your pictures or a personalized flip book with friends!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Good Science Studio","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":18995,"name":"Weapon of Choice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f28/f28794966875ce1d241466e3f719b4ed.jpg","description":"The world is being taken over by gene-combining beings from beyond the stars!\nHideous new creatures are popping up everywhere, and it's up to the Solus Operatives to grab their unique weapons and split some disgusting alien skulls!\nHigh-resolution and carefully hand-drawn art style breathes life and originality into this bizarre game world.\nDynamically branching levels are tied together by an intriguing story with multiple endings, giving the player tons of replay-ability and chances to master each operative’s Weapon of Choice.\nFeatures:\nCHOICE is your Weapon!  Play through non-linear levels and make dynamic in-level branch decisions!\nEach playable character has their own special weapon of choice with primary and alternative fire modes! Jet-engine guns, plasma-saws, limpet grenades and more!\nRescue unique playable characters and add to total number of playable lives!\nExperience Death Brushing! Unlike traditional one-hit kill games, Weapon of Choice gives you the opportunity to get out of a tight spot. Death Brushing automatically kicks in when danger is near.\nReap revenge for your downed Operatives with the Vengeance Missile!\nScale walls and attack from anywhere with the automated Spiderpack!\nReplay to experience different storylines with completely distinct endings!\nRock out to original music with a heavy metal guitar soundtrack!\nNew for the Steam version, widescreen 16:9 format!\nAll new Steam Achievements--try finding the MBG pies in each level for a new adventure!\nEnough gameplay to rot your teeth!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mommy's Best Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":17797,"name":"Realms of Chaos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/816/816e2852f7c8e2d43eb667bc6401a34c.jpg","description":"The story of the darkness is revealed as you finish each of the three game chapters. Each chapter, or episode, has three unique realms. Each realm has new enemies, new graphics, new traps and new challenges - all in 26 killer levels!\nPlay as two different characters: A male warrior with a devastating sword attack and extra stamina, and a female sorceress with a long-range fireball attack and leap ability. Switch characters at the stroke of a key and decide which character is best to handle each challenge.Features\nA World of its Own: Vibrant, realistic VGA graphics with a high-speed, 360-degree scrolling playfield, viewed at a tilted perspective.\nBoss Battles: Five bosses: four incredible bosses and a final super boss!\nBrilliant Bobby: MIDI music and digital sound effects by Bobby Prince, known for his award-winning work in Wolfenstein 3D, DOOM I & II, and Duke Nukem 3D.\nDare to be Dangerous: Five difficulty levels: \"Super Easy\" to \"Psycho Warrior.\" Higher levels introduces new hazards and challenges.\nSave Your Game: Save and restore as you play (save anywhere) - plus convenient quick save and restore buttons\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"3D Realms","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16643,"name":"Dogs of War Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fe/7fe62d74b32fd74332d2fa7b24c62d6d.jpg","description":"Deploy your troops, unleash your champion, dominate the battlefield !\n\nThe world of Aarklash is at war, into the jaws of incessant conflicts between the forces of Light, Dark and Destiny. In each of these alliances, some free companies are forming and traveling across the continent in search of glory. Veterans with heavy past, greedy bandits and other disreputable guys group together in spite of their differences.\nBased on the famous miniature board game “Confrontation”, Dogs of War Online is a free, turn based, tactical game  where your will build your own team of mercenaries and lead them to victory against other players or the AI.\nThe whole game is truly available for free. Play to unlock 54 units with unique set of skills and abilities and 9 Champions to lead your armies. Progressively learn how to master the dozens of skills and abilities available and how to maximize the synergies between your units.\nWether you choose to play with the mighty Wolfen warriors, the brave soldiers of Alahan or the undead of Acheron, remember that only your tactical skills can lead you to victory on the battlefield.\nKey features :\nBalance and game rules based on the miniature tactical game Confrontation.\n3 factions with different play style : Light, Darkness and Destiny.\n9 Champions to lead your companies.\n54 unique units to unlock, thousands of company combinations available.\nInnovative game mode with multiple objectives.\nMonthly tournament.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16054,"name":"Super Star","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f78/f788c17bd7e98642b2fb144f30843b56.jpg","description":"This is a simulation game on the theme of the cultivation of a “celebrity”.\nYou are a star agent in show biz as well as a fan of video games and animation as well. You have recently set up your own management company and are looking for someone with the talent. Although you have been trying hard, no one talented has been spotted yet. On night, you decided to play H-Game to cheer yourself up. After you finished the game, a strange thing happened: a pretty girl was found in your bed…\nThe player needs to play the lover and tutor of the role at the same time, and live with her under the same roof. Your goal is to create her into a superstar in three years. During the process, you must arrange trainings, part-time jobs, performances and others into her schedules according to her situations. You two are designed to get attracted by each other as the game progresses, also will be in the social networks of other show biz celebrities, as well as to be engaged in the competition against Tianhuang Entertainment, a giant of the industry.\nThis game takes the demand of players into account in terms of the individualized cultivation of the role, which has been reflected in the multiple choices of cultivation results. Besides, it provides the “CG album” in the settings, which will catch and save the moment of each special event, and the upmost number could be collected is 80!\nMoreover, the most attractive part about the game is the infinite variety of costume options provided. Players are able to choose costumes for the role according to their preferences. And different combinations will lift the ability points of the role to different extent.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SakuraGame","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15734,"name":"IKEA VR Experience","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/858/858279c7ab87e609ba6fc5f9e6a63df8.jpg","description":"This is an experience where we expect you to spend about 5 minutes.\nIt is a pilot/test that we will support/update until December 2016 (new end date).\nPut on your VR headset and prepare to explore our kitchen in full 3D.\nEnjoy walking around and interacting with some parts of it just like you were there.\nInstantly change the look and feel of the kitchen by selecting a different material finish.\nExplore the kitchen from a child’s point of view or as a tall person.\nFind the drawers that can be opened. Pick up a frying pan and place it on the stove.\nRecycle the vegetable skins in the waste sorting station.\nTry our “teleport” function.\nThis kitchen is very similar to a kitchen in the 2016 IKEA Catalogue, can you find it?\nFind press release here:\nhttp://www.ikea.com/us/en/about_ikea/newsitem/040516_Virtual-Reality\nFeedback:\nWe would love to get your input on what you would like us to change/add/create in this kitchen or in our next VR experience.\nSend feedback to vrdevelopment@ikea.com\nFor best experience read below\nFor best experience the virtual floor have to match your physical floor. If not, the room will feel slightly to small or to big. Calibration instructions below. You also should set the IPD (distance between the centre of your eyes in millimeters) on the headset to your personal values.\nFine calibrate floor Height Calibration:\n1. Put one of the hand controllers or HMD on the floor\n2. Use PageUp/PageDown to move floor up or down 1 centimeter so the HMD/controllers rest on the floor\n3. Press \"S\" on keyboard to save to next session","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"IKEA Communications","platforms":[{"id":0,"name":"PC"}]},{"id":14880,"name":"The Last Federation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32c/32c3d3a8d24103e8565ed8801f9ee5f3.jpg","description":"From the creators of AI War: Fleet Command.\nTurn-based tactical combat, with up to 5 factions competing at once.\nExtremely deep simulation of an entire solar system and its billions of inhabitants.  Even just watching everything unfold in Observer mode is entertaining, as nations rise and fall.\nNew-player-friendly ramp-up of complexity as you play, which you can disable if you're already a veteran.\nEight races each have very distinct personalities and attributes.  Each one even has its own completely unique political system.\nDifficulty levels split between the grand strategy and turn-based combat portions of the game, both ranging from quite casual to incredibly hardcore.\nSave and reload your game with ease any time, or tough it out in ironman mode.\nComposer Pablo Vega's best soundtrack to date, featuring 54 minutes of music and the vocal finale \"Lay Down Your Arms.\"\nMore Details\nGreetings, Hydral.  I will be your computer for this \"grand strategy campaign with turn-based tactical combat.\"  I think that's code for \"we're going to die.\"\nOur solar system is vast and complicated, and I sense you are a little dimwitted -- so I tell you what, let's start with the simple stuff.  Like escaping with this flagship you just hijacked from a bunch of angry robots.  That seems important.\nPlease excuse my impertinence, but I believe you are the last of a murdered race, yes?  My records note you Hydrals were the dictators of the solar system, so basically you had it coming.  And by \"it,\" I mean the moon that smacked into your homeworld.  Hmm.  So people really aren't going to like you until they get to know you.  Well, only you can use the scattered remnants of advanced Hydral technology, so that's something.\nLook, I'm not going to tell you what to do.  My understanding is that you're trying to form the solar system's first-and-last unified federation, and that's noble enough.  But right now nobody wants that except you, and you've got 8 very diverse, very angry races to either unify or exterminate.  So... good luck with that.  I'll help how I can.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Arcen Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9851,"name":"Kingsway","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c2/5c221ab336c20c6bfd48108f0150ecd1.jpg","description":"Kingsway is an RPG in which you use a mock operating system to manage your adventure. Every element of the game is a part of the operating system. Enemies and traps are popups, backpacks are the file folders where you organize your items, and quests are emails. The world of Kingsway is randomly generated every time you play, and death is permanent.\nChoose from various character types each with their own special skills.\nDiscover a strange land of monsters, bandits, and other adventurers.\nChoose to be good or evil by choosing to help your fellow adventurers, defeating powerful monsters, or steal and murder your way to the top.\nDefeat enemies and plunder crypts and caves for treasure.\nComplete Quests for extra special treasure.\nOrganize the interface to suit your play style.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Andrew Morrish","platforms":[{"id":0,"name":"PC"}]},{"id":6628,"name":"WRC 6 FIA World Rally Championship","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/634/63488d9f225c4004caf8f8f962fc2199.jpg","description":"On a race track, it's the car that makes all the difference. In a rally, it's the driver. WRC 6 puts you to the test: fog, mud, punctures, night racing, engine breakdowns... you have to deal with it all. WRC 6 also includes: all of the official 2016 content, including Rally China, 11 Super Special Stages on a 1:1 scale, local split-screen multiplayer, worldwide leaderboards and new online challenges every week, all the designated cars and courses in very high definition, two brand new modes, even more spectacular game cameras and free access to the entire 2017 eSports WRC!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":3007,"name":"Castle of Illusion Starring Mickey Mouse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a15/a15d5b657e00fc60b0efaba33eb9458e.jpg","description":"PLAY AS MICKEY IN THIS MAGICAL DISNEY ADVENTURE! ALL-NEW HD GRAPHICS AND GAMEPLAY!\nThis app is optimized for iPhone 4S/iPad3 and above.\nMickey Mouse returns to star in Castle of Illusion, a fantastical reimagining of the Sega Genesis classic. When the evil witch Mizrabel kidnaps Minnie, it’s up to Mickey to brave the dangers of the Castle of Illusions to rescue Minnie.  Gather your courage and traverse enchanted forests, take on hordes of rebellious toys and navigate mazes of living books.  Play as Mickey and save Minnie from Mizrabel’s evil clutches!\nGAME FEATURES –\n-Play as Mickey Mouse in this reimagining of the classic Sega Genesis/Mega Drive game!\n-Experience a world of wonder, brought to life with all-new graphics and magical adventures!\n-Journey across five magical worlds filled with Mizrabel’s powerful minions!\n-Complete hidden challenges to customize Mickey with classic costumes!\nFor additional information about our practices in the United States and Latin America regarding children’s personal information, please read our Children’s Privacy Policy  at https://disneyprivacycenter.com/kids-privacy-policy/english/.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":427892,"name":"RESIDENT EVIL 2 R.P.D. Demo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/635/6356d3eb5796b1b42f0b2dae63a3b99f.jpg","description":"A deadly virus engulfs the residents of Raccoon City in September of 1998, plunging the city into chaos as flesh eating zombies roam the streets for survivors.\nAn unparalleled adrenaline rush, gripping storyline, and unimaginable horrors await you.\nWitness the return of Resident Evil 2.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Capcom","platforms":[{"id":0,"name":"PC"}]},{"id":392411,"name":"Blood of Steel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/435/4357dbb41d90738be13db754ceef4ae0.jpg","description":"How will YOU claim victory in battles fought with cold hard steel? Troop organization and cunning strategies for engaging the enemy are of utmost importance. That's what is key in Blood of Steel: to gain the strategic advantage and crush the enemy beneath your fist, you must first familiarize capability of your troops with various weaponry and legion equipment, as well as utilize the terrain to its fullest.\nApart from legion-based warfare, Blood of Steel also hosts duels and multiplayer Heros Aerna. We've expanded on classic Mount and Blade-like's 4 attack and block directions style, adding in defense-breaks, rolls, sidesteps, charge attacks and heavy attacks to create a completely new and varied battle system.\nTerrain played an important role in the battles of the Middle Ages. As such, in Blood of Steel you can fight on open plains, lush grasslands, snowfield, city streets and many other locales. Add in dynamic weather systems, with rain, snow and mist, and you have plenty of dynamic and authentic battlefields to wage war upon.\nIn Blood of Steel, you'll meet heroic generals from the four corners of the world, brought back from the annals of history. Take command and summon your subordinates before leading them to conquer the world in its entirety.\nIn Blood of Steel, everyone has the opportunity to seize cities and take over lordships. Play as world-famous generals, and ride into bloody battle with your brethren as you strive for world domination.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"YC Games","platforms":[{"id":0,"name":"PC"}]},{"id":295080,"name":"Going Medieval","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e7/7e7d737fcc663acd6d8356c4ec3f236f.jpg","description":"Going Medieval is a realistic medieval sandbox colony sim where you guide a group of survivors in a disease-stricken world and protect them from outlaws, barbarians, and the folly of their ways.\nEnter a classless, borderless, lawless post-calamity age. What happened in the past depends on who you ask - there are as many versions of the story as there are villagers, but they know that they must adapt in order to survive. Give them a job and they’ll work hard - they just might make it.SURVIVEYour villagers are autonomous creatures who will perform any tasks you assign them. The more time Dave spends hunting, the more efficient he’ll get, bringing home better quality meats that’ll keep you through the winter. Restore your position as an apex predator and look at who‘s no longer afraid of the big, bad pack of wolves! All it takes to get there is to...PRIORITIZEThe villagers can do anything you set their mind to. Use the Schedule Board to see who got good at what, and let them do more of that. Achieve peak productivity by balancing the villagers possibilities with your present needs, prioritize their tasks to let your village grow efficiently. Check in often to see if you have any spare hands about, because if you want to survive, you've got to…PROGRESSThe medieval ages weren't very fun, and you can help your villagers grow right out of them. Amidst the Stoves, Tailor emporiums, Stonemason’s benches and more, look for a Research station. Not everyone‘s cut out for physical work – you might have a scholar in your midst! Let him figure out the riddle of steel and lead the way to better technology and quality of life.\nDespite your best intentions, everything you do in Going Medieval has consequences. Any number of threats can manifest outside your village walls:\nPacks of wild animals – fire keeps feral creatures away\nEnemy raids – less likely to happen in fortified villages\nCatastrophes – some natural, some frankly self-inflicted\nPoor town management – a total village wipeout is the best teacher\nOptimize your village into a fortified utopia or drive it into the dirt. The foundation of Going Medieval is a realistic sandbox where you must learn from your experiences and environment, and then use this knowledge to adapt faster and optimize smarter.Realistic Medieval TechnologyGoing Medieval building, production, agriculture, and architecture are almost as demanding as their real world counterparts, abstracted only so much to make the game fun. The 3D grid even enables multi-story building. We’re not saying you could build a real house after playing Going Medieval, but… maybe a yurt?Early AccessIt is our obligation to present as many meaningful mechanics as possible for you to feel like a real medieval lord, so Going Medieval will be first launched with a functional set of rules and features. The rules, features, options, and technology trees will evolve according to player feedback and community suggestions.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Eipix Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":61030,"name":"Soulfire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/818/8183862e7eb4dded1633994e2f7547d4.jpg","description":"Soulfire is a battle royale fighter that pits more than 20 teams against each other in a struggle for win.Compared to similar games, it features a 2.5D souls-lite combat system.\nKey words: Battle Royale / Multiplayer / Action / Side Scroller","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"AyDream Co","platforms":[{"id":0,"name":"PC"}]},{"id":50771,"name":"The Lord of the Rings Living Card Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f97/f97e617d356f55ee180340f1cd877282.jpg","description":"Build your deck and face the Dark Forces of Sauron!\nBattle Uruks, spiders, orcs, and more as you journey through Middle-earth, earning cards and devising new tactics along the way. In The Lord of the Rings Living Card Game, players lead their own fellowship of heroes through quests that will test their leadership, tactics, lore, and spirit. Ready your weapons, gather your heroes, and create your own story.Key FeaturesBased on the hit Fantasy Flight LCG® The Lord of the Rings: The Card Game\nThe Lord of the Rings Living Card Game adapts the strategic gameplay of Fantasy Flight Games' award-winning Living Card Game to digital platforms.\nConstruct your Deck\nWith numerous cards available day one and more on the way, decks in The Lord of the Rings Living Card Game are fully customizable. Build the perfect deck to topple your foes.\nAssemble your Heroes\nLead a team of up to three heroes through five distinct quests, with many more to come.\nPreset Packs\nThe Lord of the Rings Living Card Game introduces an innovative economy system built around preset card packs. Get the cards you want to play with and enjoy all the depth and customization of card games.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Fantasy Flight Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":16433,"name":"Sinking Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/deb/debf57caa132cc080ccc437b079c4636.jpg","description":"At the base of a cliff on Sagorah Island, 82 year-old American billionaire Walter Jones is found dead next to his life's work; a massive Art Deco tower he had dreamed would become an elite getaway for international jet-setters. The only clues found at the scene include his wheelchair, abandoned at the edge of the cliff, and multiple scratches on his face. One of these scratches appears to have been made by a woman. Ten people were present on the island at the time of his death, among them the heirs to his vast fortune and legacy. Was his death an accident or murder?\nPlayers assume the role of Jack Norm, a federal agent turned private dectective, who is taking a break in the atolls of the Indian Ocean when an old friend requests his assistance with the case. Jack has just three days to complete 10 gameplay missions, collecting valuable clues and storing evidence in his PPA (Personal Police Assistant). He will interrogate each of the 10 unusual suspects, using his keen deduction skills to determine who among them may have the most to gain from Walter Jones's death.KEY POINTS:An engaging and innovative game.\nChoose between two styles of gameplay to carry out your quest: Time Mode or Adventure Mode\nAnother classic adventure game by French author Benoît Sokal\nInterrogate each of the 10 unusual suspects, using your keen deduction skills to determine who among them may have the most to gain from Walter Jones's death.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"White Birds Productions","platforms":[{"id":0,"name":"PC"}]},{"id":13160,"name":"Sakura Magical Girls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e16/e164e17070cb151749524f9a49835dbb.jpg","description":"Taichi’s in a rough spot in his life. In debt and without any other options, he ended up with a low paying cleaning job at a resort with a manager who won’t get off his back. He thought that it would be boring and uneventful… But then, two wand wielding girls appear before him. In the few moments that follow, he learns that evil is a real, tangible force and that magic is also real.\nAlthough he tries his best to avoid getting involved, the two girls drag him into their battle with the forces of evil. A third girl later appears, tempting him with work that is a bit darker than what he is used to. Will he be able to resist temptation and defeat the evil that is accumulating in the resort?\nYuki is someone who wholeheartedly believes in her mission as a magical girl. She is energetic and performs her job with a passion. There is a slight awkwardness about her when she ends up in an embarrassing situation. She possesses a number of powerful spells and techniques, some of which hardly seem befitting of a girl who supposedly uses the power of love to cast magic.\nAlthough she enjoys her work as a magical girl, Hikari seems to treat it as she would any other job. She is kind, and the more level headed girl between her and Yuki. She believes in eradicating evil, and is someone who very much holds love dearly in her heart. She seems to be troubled by something at times, but does her best to make sure that she gets the job done.\nAlthough she is a magical girl, Ayame is very different from Yuki and Hikari. She does not draw her power from love, but rather through the manipulation of what she calls ‘negative karma’. Through this power, she is able to control evil entities she encounters. She is a domineering personality and seems to relish teasing Taichi, saying whatever she can to get a reaction out of him. However, Taichi suspects that her actions and words do not reflect who she truly is.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"}]},{"id":4885,"name":"Blade Kitten","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94e/94e8ee97544ef7a5b601a3941f41ce19.jpg","description":"Hollow Wish CollectionThe Hollow Wish Collection Contains:\nThe original game (Episode 1)\nEpisode 2\nThe Hollow Wish Collection comic\nSoundtrack and Other Comics PackageThe Soundtrack and Other Comics Package contains all the content found in the Soundtrack and Remixes and Comics Pack - Dirty Angels DLC at a discount.\nAbout the GameWelcome to Hollow Wish... On the surface, it’s your typical lawless frontier. Yet this mysterious shell planetoid is filled with dark secrets and cloaked figures. It’s here Kit Ballard, aka Blade Kitten, works as one of the best bounty hunters in the business. Don’t let her pink hair fool you, Kit is part cat, part girl, and wholly lethal. She is one of the last of her species, having fled her homeland after the genocide of her people at the hands of the ancient and mystical race known as the Darques.\nKit has since made a name for herself rounding up some of the most deadly scum in the galaxy. With her unique Darque Blade hovering at her side and obeying her every command, Kit can cut through even the toughest rogue drone while hunting down soft targets to make the planet a safer place to live. Also along for the ride is Skiffy, Kit’s laid-back little sidekick who, when needed, serves as her protector.Key features:\nAn epic “tail” like no otherFollow Kit through 13 levels including 2 exploration levels with her rideable alien mount Noot, as she travels around the colorful, frenetic world of Hollow Wish.Intuitive “scramble style exploration”Kit’s innate feline abilities enable her to easily traverse environments and find hidden areas.Pick-up-and-play arcade actionJump right in and easily begin exploring and fighting your way through multiple levels loaded with secret areas and hidden collectibles.Fully voiced dialogueFeaturing a cast of 9 professional voice actors playing a total of 23 characters.Join Kit, Skiffy and the Darque Blade in this all new action adventure game!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Atari","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":748636,"name":"Tap Ninja - Idle Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ed/6ed9f124116deafb14c4a53cd078e8e8.jpg","description":"Start your adventure as a Ninja in this incremental game, destroy incoming enemies with a well-timed Katana Slash, increase your Speed Step combo to multiply your gold and build up your own village.\nStart up from nothing and rise to a true Ninja Master status.Key FeaturesDestroy incoming enemies, collect coins, earn gold\nBuild up your village to earn even more gold even while you are offline!\nBuy Research Upgrades to increase your power\nAscend and learn epic and permanent Skill Upgrades\nChallenge levels to perfect\nUnlock hundreds of Achievements\nUnlock characters and customize them with dyes\nCrossplatform cloud saving - take your game on the go!Roadmap for future:More Upgrades and Ascension Skills\nMore Achievements\nQuests\nCollectable Pets\nConquest mode\nForgeable Artifacts\nYour idea? Share it on the Discord","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Broken Glass","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":650667,"name":"Eiyuden Chronicle: Rising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e77/e77462cb5eb12827d0506c6c6feedbc0.jpg","description":"Eiyuden Chronicle Rising is a town-building action RPG set in the same world as Eiyuden Chronicle. It weaves together the pre-war tales of various characters who will eventually become your companions in Eiyuden Chronicle. The game will introduce a portion of Eiyuden Chronicle’s cast of characters in an original story with thrilling action and engaging town-building elements. There might even be some small perks for players that link the game with Eiyuden Chronicles.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Rabbit & Bear Studios","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":51143,"name":"Eden Rising - Supremacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eec/eecf07e7c2abc6f9d0488f61233ffbef.jpg","description":"Unite with your friends to become tribal warriors fighting for survival on the savage world of Eden.\nExplore a beautiful, mysterious planet littered with ancient ruins and rife with danger, and home to many dangerous creatures.\nDefend your Crucible refuge from waves of vicious attacking fauna. Trade your humanity for power, seize the machines of the ancients and destroy your alien masters.\n●\tCustomize your own server and let your tribes actions shape the world of Eden.\n●\tPlay with up to 8 friends on your own server, or join an open server.\n●\tCraft a variety unique weapons and armor, traps and defenses.\n●\tExplore a massive open world full of exotic flora and fauna.\nPlay on your own persistent universe, where the actions of your tribe determine the events to follow. Unite with up to 8 friends as a tribe of nomads on a strange alien world, in a unique co-op experience. Take on co-op challenges and take on deadly enemies with a variety of combat styles and weapon types.\nVenture into the vibrant, untamed world of Eden, a vast, mysterious alien realm rife with both intrigue and danger. The world of Eden is made up of unique biomes to explore and master, laden with environmental hazards and precious materials. Discover new items and gear as you explore, gather and hunt together to survive.\n\nLocate, gather, and combine resources into useful items, weapons and armor. Use the right tools for the job to gain an advantage over strong foes and stay ahead of the curve by creating cunning traps and ambushes!\n\nDevise traps, gather supplies and strategize with your tribe to fend off waves of vicious creatures and protect your territory from falling to the siege. Stand united against hoards of enemies to defend your territory and grow in power and mastery. Over 200 unique siege challenges to overcome!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Nvizzio Creations","platforms":[{"id":0,"name":"PC"}]},{"id":44377,"name":"Next Up Hero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5a/a5ab753de7f3f1d87597af3612aae16f.jpg","description":"So you think can slay all the monsters and win eternal glory, is that it? Bad news, hero. In the Spiral Shards, we can only send in one hero at a time to fight the Ceaseless Dirge. At some point, a flaming blue fireball, mech mortar rocket, or giant spike of doom is going to hit you in the face, and you’re going to die. That’s when the fun begins.\nWhen you die, you’ll leave behind an Echo of your hero on the battlefield. The next hero in line will be able to resurrect your Echo as an AI battle companion. Take turns continuing each other’s games, fighting and dying with friends until you have an entire army of Echoes by your side. Everyone dies. Heroes continue.\nNext Up Hero is a 2D action adventure driven by Community Continue. Next Up Hero is inspired by friends taking turns at the arcade to beat unfairly difficult games, and designed so beating a session is a shared victory and more fun than playing on your own.\nChoose from nine heroes with an assortment of weapons and abilities to suit your playstyle, from swords and rocket launchers to laser turrets, bongo drums, and boomerangs. Coming this fall, Heroes who complete feats of greatness will gain entry into the Champions Trials, a monthly contest in which Digital Continue throws the hardest monsters they have at you.\nDeveloped with community feedback, Digital Continue will incorporate community ideas to improve characters, gameplay, weapons, attacks, and enemy types for the final game.\nNext Up Hero is the first game from Digital Continue, founded by Joe Tringali, the co-founder of 5TH Cell, creators of Scribblenauts, Lock’s Quest and Drawn to Life.\nFeatures:\nCommunity Continue - Engage in a cutting edge style of cooperative play, Community Continue, where beating community sessions is a shared achievement, and more fun than playing on your own.\nChampions Trials - Heroes who complete feats of greatness will gain entry into the Champions Trials, a monthly contest in which Digital Continue throws the toughest challenge they have at you in specially-designed levels. Work together with the community to solve puzzles, defeat challenging enemies, and unlock new rewards. You will probably die.\nSpotlight Sessions and Leaderboards - Compete with the community in daily, weekly and monthly leaderboards! Play in sessions with your favorite streamers, or join celebrities in exclusive VIP sessions!\nCustomized Heroes - Defeat monsters and steal their abilities. Combine monster attacks, character skins, and Ancient abilities for thousands of deadly potential loadouts!\nChoose Your Own Achievement - Customize your next goal using a Mad Lib style journal system. Complete those goals to earn the Grand Tokens necessary to gain entry into the deadly Champions Trials.\nSupported Gamepads:\nLogitech RumblePad™ 2\nLogitech™ Dual Action™\nMicrosoft® Xbox® 360 Controller for Windows® (Wired)\nMicrosoft® Xbox® One Controller (Wired)\nMicrosoft® Xbox® One Elite Controller\nPDP Rock Candy\nPDP Afterglow\nRazer Sabertooth\nSONY® PS4 DUALSHOCK®4 wireless controller (Wired)\nThurstmaster GPX","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":44300,"name":"Blocks by Google","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f01/f01225ffc0547812f01857de9a506785.jpg","description":"Blocks lets you easily create 3D objects in virtual reality, no matter your modelling experience. Using six simple tools, you can bring your applications to life, create a volumetric masterpiece, or simply let your imagination run wild.\nGet inspired by others’ creations or publish your own to inspire the world around you. No matter your modeling experience, you’ll create beautiful 3D objects in no time.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Google","platforms":[{"id":0,"name":"PC"}]},{"id":28170,"name":"Material Girl","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d9/3d9b60ff80afad660a177c8d2925adaf.jpg","description":"Sakuraâs parents used to give her only a little money for her living costs. Now they donât give her money anymore, so Sakura has no choice but to find a part-time job. She has to work part-time to earn money and meanwhile goes to school. All of her classmates think that Sakura doesnât like talks, and they donât know what she is thinking about at ordinary times. In fact, there is always a dream in Sakuraâs heart, that is, to get out of poverty and become rich. She has been striving to realize her dream all the time.\nCV: Lianggui\nShe usually has worries in her mind, and doesnât speak often. Therefore, her classmates believe that she is unpredictable. As a born beauty, she is busty. She could have become a popular beauty in the school. However, she is not so popular, because she is not good at social contact. She only has some fans who admire her secretly. She is able to peacefully accept things unacceptable to ordinary people, which probably results from her fatherâs job, a war photographer. She often followed her father to many places when she was very young, and also encountered dangerous situations. Therefore, she has excellent physical fitness, which is enough for her when she deals with hooligans. She is somewhat insensitive, so itâs hard for her to understand how others feel. A neighbor, who is a childhood partner of her, often comes to her house to have dinner with her, but she has never perceived the boyâs admiration for her.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dieselmine","platforms":[{"id":0,"name":"PC"}]},{"id":18630,"name":"Quest for Glory 1-5","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/966/966d60353ed08b527e131ced447ed3af.jpg","description":"Are you feeling adventurous, Hero? The world of Gloriana, with all its wonderful diversity, awaits you. In this pack of five classic Sierra adventure games you will create your character (a warrior, thief, or magic user) and set out on a grand journey for fortune and fame! You will solve quests and puzzles, fight monsters, and save innocents.\nIn the Quest for Glory pack, which contains all five parts of the classic action RPG games by Sierra, you create your own character, choose his class and abilities and then set out on your grand voyage. Quest for Glory games are universally acclaimed as one of the best adventure games ever developed. After completing a part, you can import your character into the next one, keeping your skills and some special rewards you've hoarded, like magic items.\nThe story is another of the Quest for Glory series' strong points. It's very solid and immersive, with a light-hearted and humorous narrative that will keep you glued to the screen throughout each of the five installments.\nIncludes both: VGA and original version of Quest for Glory 1.\nVenture across five huge worlds, each based on a different culture and mythology, from Germanic fairy tales, through Arabian and Slavic folklore, right down to Greek mythology.\nThree starting character classes to choose from (fighter, magic user, and thief). This decision not only modifies the gameplay but also the story, providing for excellent replayability.\nYou can transfer your character from one game to the next. The skills and wealth you worked for so hard are not lost!","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":18528,"name":"Epic Battle Fantasy 3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/244/244907d30ea60cdaa5d67f0ed9f6efa7.jpeg","description":"Epic Battle Fantasy 3 is a silly turn-based JRPG, full of useless NPCs, rabid cats, childish humor, unreasonably large weapons, anime boobs, and other nonsense. It's a hefty adventure with over 10 hours of content and hundreds of items to collect.\nEpic Battle Fantasy 3 is completely free, but if you enjoy it, please consider buying the sequels and spinoff games!\nhttps://store.steampowered.com/app/432350\nhttp://store.steampowered.com/app/265610\nhttp://store.steampowered.com/app/412670","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Matt Roszak","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17619,"name":"Cannons Lasers Rockets","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec6/ec6576c6592bc580d38f82d36f73423a.jpg","description":"For victory you need only three tools - Cannons, Lasers and Rockets! Discover a spaceship MOBA game with 2D combat in 3D environment, wide variety of play styles and fun gameplay for casual and pro gamers alike.\nWe wanted to make something that we ourselves would like to play - a game chock-full of what’s cool about spaceships shooting each other up and with none of that boring stuff.\nWe set out to make a game with both a light-hearted gameplay that is hard to find today and deep tactical potential that allows for sophisticated approach to team play.\nSo we made Cannons Lasers Rockets - a fast-paced, bright and colorful space arcade equally enjoyable for hardcore and casual gamers.\nIn our game you will discover that:\nSPACE COMBAT IS EASY\nA videogame spaceship is usually not an easy ride - three-dimensional navigation makes you dizzy and disoriented. But in CLR you struggle against your opponents, not against your controls. We simplified gameplay just enough so you wouldn’t need to BE a great star pilot to FEEL like one.\nSPACE COMBAT IS INTERESTING\nNo boring parts, only what you come for - going into combat to send some rockets into the other guy’s hull.\nAnd if you eventually get a little tired of shooting, and start looking for more - be sure that we will give you more. Multiple game modes, a metric ton of different tactical situations, a MOBA core that creates many possibilities for fun and meaningful gameplay - and even more!\nSPACE COMBAT IS FUN\nWe don’t really know what «realistic» starships will look like, so we don’t really care. A ship in a game should be fun to look at and fun to ride in, period. We want ships to be weird, plentiful and different - everyone will find one that is suited just for them, both in visual style and the distinct way of playing that comes with every ship.\nWe streamlined our gameplay as much as we could, and then we turned the coolness knob up to eleven!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Net Games Laboratory","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13277,"name":"A Mortician's Tale","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/79f/79f10cd27fc8f4a0df6683beac7e81c9.jpg","description":"A Mortician's Tale is a narrative-driven death positive video game where you play as a mortician tasked with running a funeral home. Take on the role of recent funeral direction graduate Charlie as she learns the ropes of the business and industry. Prepare the cadavers of the deceased (via embalming or cremation), attend their funerals and listen to their loved ones' stories, and interact with Charlie's coworkers, clients, and bosses.\n\nA Mortician's Tale is an informative, honest, and sometimes humorous look at the current state of and the future of the western death industry.\n\nKey Features:\n- Explore the colorful world of Rose and Daughters Funeral Home — from the morgue itself to the viewing room where funerals take place\n- Prepare 8 different cadavers using realistic tools and procedures involved with traditional burials and cremations\n- Talk to the deceased's loved ones, discover their stories, and learn how each of them mourns in different ways\n- Follow Charlie's journey at Rose and Daughters Funeral Home as it transitions from a family-run business to being bought and owned by a massive funeral conglomerate and beyond\n- Discover some real life truths about the current state of and future of the western funeral industry","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Laundry Bear Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":9762,"name":"Idling to Rule the Gods","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f37/f377e61200dc834ecd236c715547fe55.jpg","description":"Idling to Rule the Gods is a free to play Idle-Game with a lot of content and some Minigames.\nDepending on your play-style, you can play it fast or slow. Either way it can be fun for hundreds of hours!\nIn the year 9001, humans destroyed all habitable planets in the known universe. On the last planet, they managed to create a space dimension device. With this device, they were able to travel to a different dimension. The world of Idling to Rule the Gods.\nIn the first habitable planet they found, they noticed the world works different than the known universe. It is ruled by gods. Soon after, Hyperion, the first god found the humans and fought them. After a long lasting fight, all humans but you – the player – died. While surviving the whole time, you developed your own special ability: to create shadow clones.\nThe game starts here.\nYou create shadow clones, they train, learn skills and fight monsters for you, while you absorb their power until you are powerful enough to beat the first god “Hyperion”. After beating Hyperion, you find many, much stronger gods. To be able to defeat all of them, you must find various ways to become more powerful. You rebirth, create your own monuments, train pets and fight ultimate beings.\nYou feel like doing nothing?\nEven though you want to become rich?\nYou are lazy?\nBut you want to be stronger?\nYou have two left hands?\nBut you want to create something new?\nThen fear not!\nThe solution is here.\nYou will become divine!\nYou will become strong. Stronger than gods!\nYou will create anything. More than anyone ever has!\nIn the virtual world of Idling to Rule the Gods.\nWhat you have to do for this?\nNot much!\nJust sit any play: \"Idling to rule the Gods\".\nThe game where you can create your own universe!\nYou will become stronger when not even playing!\nJust go offline and sleep and wake up much stronger.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Shugasu UG","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4004,"name":"Mountain Crime: Requital","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bf/4bffdbc1d61fdf4c68a2682bc9847eca.jpg","description":"Someone is killing the guests at a mountain resort, and you could be next if you don't solve the mystery at the heart of this chilling thriller! Take the role of a doctor who's summoned to a remote hotel to tend to a patient, and hold on to your sanity as you discover the first victim moments upon arriving at the retreat. As you search for clues, crack brain-bending puzzles and read newspaper clippings that reveal the hotel's horrific past, two questions will take shape in your mind: What ties do you have to the hotel? And why did one of the victims claim you are the killer? The answer will shock you! Play Mountain Crime today to discover the truth!\nKey features:\n•\tTwo difficulty modes\n•\tMap with available actions\n•\tInteractive conversations\n•\tFully-voiced characters\n•\tStep-by-step tutorial","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3176,"name":"Kitten Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/507/50733bcd1fab588bf0527c4f8b54c45e.jpg","description":"Sadistic robots have enslaved orcas at SeaLand Marine Park. The evil Sheep Puncher robot has kidnapped sheep for the twisted wool industry. Only the Kitten Squad is up to the task of saving these gentle animals. Players must guide the Kitten Squad, armed with weaponry ranging from carrot rocket launchers to yarn ball guns, on missions to defeat the evil robots and free the animals in this action game brought to you by PETA.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Arcade Distillery","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":2105,"name":"Shooting Stars!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/137/137ba1202f0504e35127490d993ff8fa.jpeg","description":"Shooting Stars is a refreshing colorful and funny take on the classic arcade shoot'em up, bullet hell, shmup, space invader like, whatever you want to call it – but finally, with evil aliens disguised as superstars, cats and rainbow lazers. Superstars like Justin Belieber, PewDerPie, Kanye East, Han so low and many more.\nDid you just say rainbow lazers? Yes! Rainbow freakin’ lazers!\nShooting Stars has over 50 stunning ultimate weapons and items to collect. Every item will completely change the way you play. Don’t be afraid to use attacks like Clone Warriors, Freedom Sheeps, a Ro-Cat launcher, the Disco of Doom and so much more. Every game you play will be completely different. And the best part is, pay once – play forever!\nSave planet earth in various game modes. Challenge your friends with daily generated levels or go at it alone in the rogue like Card Hunt mode.\nShooting Stars is the complete package of quirky internet awesomeness and shoot‘em up retro feeling.\nFEATURES:\n* over 20 “celebrity” bosses and 16 beautiful collectible cards\n* challenge your friends in a global and daily highscore battle\n* collect up to 50 amazing ultimate attacks and superfoods\n* two different game modes\n* weird and funny satire on pop culture\n* every game will be totally different\n* ride a freakin’ hoverboard\n* Rainbow Unicorn Approved","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":571696,"name":"9 Years of Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dae/daee60e083357d4777f4ae649cbe4c52.jpg","description":"9 Years of Shadows is an emotionally-driven metroidvania enhanced by healing music that tells the story of Europa, a young woman of noble birth tasked with ending the curse that plagues her people and restoring color to all lands.\n\nImmersive gameplay\nShape your way into this dark 2D side-scrolling single-player adventure as you explore a timeworn mechanical giant; battle hidden bosses with an intuitive combat system, scavenge collectibles, gain power ups and discover some classic metroidvania easter-eggs. Combine Europa’s melee prowess with Apino’s ranged spirit magic as both cleanse the corrupted world around them.\n\nCompelling story\nTake the role of Europa and brave the empty halls of Talos Castle as you uncover the disturbing truth of its inhabitants’ fate. A moving coming-of-age tale that stresses the importance of embracing our feelings in order to heal. Embark on a journey of friendship, where Europa and her loyal companion Apino learn to rely on each other to overcome any obstacle and help others as well.\n\nElemental armor\nHarness the wrath of nature and access both special abilities and restricted areas as you bend fire, water and earth to your will. Equip either the Helios, Gaia or Poseidon armor and experience a fresh take on how to explore a vast world and face unwavering foes in the battlefield.\n\nRestoration through healing music​\nExperience a game unlike any other, with an entrancing and soothing soundtrack tuned to 432Hz composed by ​Michiru Yamane (Castlevania), Manami Matsumae (Mega Man), and ​Norihiko Hibino ​(Metal Gear Solid).\n\nStunning pixel art​\nDynamic lighting and colorful characters create a vivid setting awaiting a hero to explore it. The attention to detail in every hand-crafted scenery is a welcoming sight for metroidvania enthusiasts and newcomers alike.\n\nLore-infused universe\nWhat remains of the giant mechanical castle left as a shelter by an ancient ruler is preserved in peculiar paintings, gateways to other worlds that speak the echoes of the past. Meet enigmatic artists and travel through their depictions of eerie atmospheres.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Halberd Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":484716,"name":"Operation: Tango - Demo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5cf/5cf43b40ffdcf2f5dd985c361d2e7755.jpg","description":"Add full game to your Wishlisthttps://store.steampowered.com/app/1335790\nAbout the GameThis DEMO contains the introduction chapter to Operation: Tango.\nOperation: Tango is an espionage-themed cooperative adventure challenging you and a friend to complete dangerous missions across the globe in a high-tech near-future world.\nAs an exclusive team of two, you and your partner will become AGENT and HACKER, working together to infiltrate, investigate, and eradicate the forces threatening the free world. Work in tandem from two different points of view with only your voice to link you. Teamwork is crucial, and communication is key!\nNOTE: Operation: Tango requires both players to have access to a PC-compatible microphone.\nSuperior TeamworkBe observant, keep talking, and make sure nothing explodes. Combine complementary skill-sets to overcome intense challenges against \"impossible\" odds.Authentic EspionageExotic locations filled with thrilling scenarios create classic “Hollywood” spy moments. Experience the ultimate secret agent fantasy!Technological ToysEnjoy the visual splendor and technological advances of a fully-connected augmented world.Innovative BrainteasersOvercome obstacles in ways you’ve never dreamed of. Each mission features unique challenges, keeping you and your partner on your toes while delivering some of the most satisfying \"eureka!\" moments in modern gaming.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Clever Plays","platforms":[{"id":0,"name":"PC"}]},{"id":373511,"name":"Ring Fit Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/edf/edf0e3551971bcf668e27512eed199f8.jpg","description":"Traverse grass-swept plains by jogging in place, attack enemies with overhead shoulder presses, and refill your health meter by striking some yoga poses. Two new accessories, the Ring-Con™ and Leg Strap, measure your real-world actions and help turn them into in-game movements. With additional minigames and customizable workout routines, Ring Fit Adventure is great escape for players of all skill levels and schedules. In Adventure mode, defeat enemies with attacks based on real-world exercises as you traverse more than 100 levels in over 20 worlds. As you work through each level (and possibly work up a sweat), you’ll earn experience points. Between fights, you may encounter some unusual methods of transportation such as squat-powered launch pads. Then, pass around the Ring-Con and leg strap accessories and select from a few minigames: break boxes with gusts of air, craft pottery using squats, and more.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":304182,"name":"Beyond a Steel Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d27/d274e234022ba38095c23c061a2dfb9e.jpg","description":"You are Robert Foster. A child has been abducted in a brutal attack. You have vowed to bring him home. The trail has led you to Union City, one of the last remaining mega-cities in a world ravaged by shattering wars, and political meltdown.\n\nUnion City is a utopia, its people loving life under the control of an altruistic AI: ever-attentive androids, designer living, piazzas and bars. What's not to love? But this City has a dark underbelly...\n\nFrom multi-award winning Revolution comes 'Beyond a Steel Sky', a groundbreaking 3D adventure thriller, set in an AI-driven future. Subvert the world, hack the systems and solve dark conspiracies to uncover the devastating truth.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Revolution Software","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":28392,"name":"Pinball FX","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/119/1199278050879cc1d4a368050bfdf11e.jpg","description":"Single Player, Xbox LIVE Multiplayer 2-4, HD (High Definition). Pinball FX sets a new standard for realistic ball physics and graphical detail in pinball video games. The FULL version supports the Xbox 360 Live Vision camera, which lets you control the flipper arms with hand/arm motions or chat live. You can also play in online multiplayer competitions, and download new tables from Xbox LIVE Marketplace. Pinball FX is pinball at its best! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Zen Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":25178,"name":"Paper Mario (2000)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/062/0622bec29ae3ef0e8762a9c9f3e7b0f4.jpg","description":"After Bowser™ steals the Star Rod and kidnaps Princess Peach™, Mario™\nplots to rescue the seven Star Spirits and free the Mushroom Kingdom\nfrom the Koopa's rule. As Mario travels from the tropical jungles of\nLavalava Island to the frosty heights of Shiver Mountain, he'll need all\nthe help he can get. Master the abilities of the seven Star Spirits and\nthe other allies joining the adventure to aid our hero on the\nbattlefield. There are over 50 Badges to locate that, when equipped,\nwill grant special abilities and powerful attacks. The turn-based battle\nsystem will make fighting Bowser's baddies equal parts strategy and\ntiming. Discover over 100 items, mix them together, and cook up\nfantastic creations that will send your enemies' spinning and fleeing.\nClose the book on Bowser's story before his evil deeds turn the world\nupside down and only his wishes come true!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":21147,"name":"Escape Rosecliff Island","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e1/4e11b22df3cb1658c98367761eaafc07.jpg","description":"An unexpected storm has left you shipwrecked on a mysterious and remote private island. Seek & find cleverly hidden objects and solve puzzles to find a way off the island!  Find over 2100 hidden objects in 25 intriguing and mysterious locations to find items that will help you escape!\nPlay 5 different types of mini-game puzzles to collect inventory items from each location that will be needed to help you escape the remote Rosecliff Island.  Play 3 different game modes: Escape the Island, Unlimited Seek & Find, and a Mystery Bonus Game.\nFind over 2100 cleverly hidden objects.\nExplore 25 mysterious island locations to find a way off.\nThree fun game modes: Escape Mode, Unlimited Seek & Find, & a Mystery Bonus Game.\nPlay 5 unique mini-games: Match 3, Word Search, Puzzle Rotation, Memory Match, Jigsaw plus a unique final puzzle.\nLocate all the hidden locks to reveal two bonus games.\nGo for a Perfect Search & back-to-back speed bonuses to beat your high score.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"SpinTop Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]