[{"id":330615,"name":"Pokémon Black, White","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3dd/3ddf27683a9aecf1cf39605100651a99.jpg","description":"Pokémon™ Black Version and Pokémon White Version are\ncoming to the Nintendo DS™ family of systems in Spring 2011. Travel\nthrough the Unova region to discover new Pokémon, tough trainers, and\nmany exciting adventures!\n\nPokémon Black Version and Pokémon White Version\nwill feature a new generation of amazing Pokémon. Several of these\nPokémon have been revealed so far: the Legendary Pokémon Reshiram will\nappear on the cover of Pokémon Black Version and the\nLegendary Pokémon Zekrom will be seen on the cover of Pokémon\nWhite Version. You will also begin your adventure with your choice\nof Snivy, Tepig, or Oshawott—Pokémon who are eager to join you on your\nepic journey!\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":60594,"name":"Family Man","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc4/cc4bb179065c693c65621f93655ec641.jpg","description":"Family Man is a first-person story-led RPG that asks the question: When pushed to the limits of your own morality, how far would you go for the sake of your family?\nYou owe money to the mob, and you've got 30 days to pay it back. Will you flip burgers and earn an honest living while scrapping the money together... or will you take on some dirty jobs for more cash, but potentially push your family away?\nEvery decision you make not only affects the neighborhood, but directly affects your family. Your choices impact how your family sees you, and can lead to your household becoming stronger than ever... or the breakdown of your marriage and relationship with your son.\nIt's your life: Decide how you want to deal with each situation that arises\nMoral compass: Earn cash the hard (legal) way, or break a few rules here or there\nFor the sake of your family: Every choice you make affects your family\nBuild relationships: Unlock bonuses for every person you help (or hinder)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Broken Bear Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":14354,"name":"Space Pilgrim Episode III: Delta Pavonis","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d7/5d71534b2f35b5932586541d258757cd.jpg","description":"Still reeling from the life-changing events of the previous episode, Gail seeks out a safe haven with her father in the Delta Pavonis system.\nHowever, she soon learns that the politics of Planet Leto can be as treacherous and unpredictable as the local weather. What's more, her father seems to have disappeared under suspicious circumstances ... can she find him before her enemies catch up with her?\nIn this third episode, explore the largest and most varied environments in the series so far as Captain Gail Pilgrim and her colleagues travel across this new world from space port to city and out onto the treacherous oceans of Planet Leto.\nExperience a new chapter of Gail's story, become involved in planetary politics and interact with dozens of new characters.\nEnjoy 3-5 hours of gameplay in this extended episode of the Space Pilgrim saga.\nAcross the four episodes in this saga you will travel to space stations, colonies, cities and islands across an immersive and intricate futuristic universe, interact with dozens of unique characters and enjoy 10+ hours of gameplay (Please note: this purchase is for episode three only)\nMouse, keyboard and controller support.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":5665,"name":"Stranglehold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/909/909f20ae2181edfe413e4b672d712474.jpg","description":"Continue the story of John Woo’s influential action film, Hard Boiled starring Chow Yun-Fat. Engage your enemies in intense cinematic gun battles and cause extensive environmental damage using a full arsenal of deadly weapons.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Midway Studios Chicago","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3830,"name":"Tearaway","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/91f/91f3cdc8fe08ea2585a37ee3846ffdcd.jpg","description":"Tearaway is a 3D platformer set in the world where everything is made out of the paper. It is the only title within the franchise. The remake for home consoles Tearaway: Unfolded, was released two years after the initial game.\n\n###Gameplay\nThe player takes a role of either Atoy or Yota — a male or a female character correspondingly and goes out for an adventure to deliver a letter to the outside world — personally in the hands of the player himself. The gameplay involves all of PS Vita specials: the rear touchpad, microphone, and both cameras.\nThe only obstacles in the way of the player are scraps — little papercraft creatures emerging from the ground from time to time.\nThere are drums, for instance, that bounce the papercraft protagonist into the air while the player snaps a rear touchpad. Moreover, the photos of a real environment can be used to decorate some of the in-game's elements — to sum up; one may stick as many stickers to the ground making the world look like his own. Some of the obstacles during the playthrough may be overcome by player blowing into the microphone and creating wind consequently by this. \n\n###Key features\nThe plot regularly breaks the fourth wall — a protagonist delivers a message directly to the player, and the latter has many means of communicating with him.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Media Molecule","platforms":[{"id":0,"name":"PS Vita"}]},{"id":970321,"name":"PlanetSide 2 - Test","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/294/29470cb2e6acc215feae6fdeed8d2e09.jpg","description":"PlanetSide 2 is a free-to-play, massively multiplayer online first person shooter (MMOFPS).\nEmpires and their soldiers battle in an all-out planetary war on a scale never before seen, in stunning, breathtaking detail. PlanetSide 2 battles persist and the war never ends, offering constant challenges of individual skill, team grit, and empire-wide coordination. Take up arms and drop into intense infantry, vehicle, and air combat.\nPlayers come together in enormous battles across four massive continents to win control of critical territories, gaining key resources for their empire. With an extensive skill tree and class-based system, players can customize their soldier, weapons, and vehicles to match their playstyle and meet the needs of their squads, outfits, and empires. In the world of PlanetSide 2, every soldier makes a difference.\n\nTHREE WARRING EMPIRES: Players will choose to align with one of three empires: the militaristic, authoritarian Terran Republic; the rebellious, freedom-fighting New Conglomerate; or the technocratic, alien-influenced Vanu Sovereignty. Each empire has access to empire-specific weapons, attachments, vehicles, abilities, and more.\nMASSIVE WARFARE: Battles take place not between dozens of soldiers, but between hundreds. They fight on foot. They pile into vehicles. They take to the skies in devastating aircraft. Each battleground holds valuable resources and strategic positions, and the empire that can conquer and hold these territories will be rewarded with the resources and the means to achieve victory.\nENORMOUS MAPS: PlanetSide 2 features four incredible and diverse continent maps with dozens of square kilometers of seamless gameplay space, every inch of which is hand-crafted and contestable. Whether in open fields, barren desert, in armed and armored bases, or in the skies, victory will rely on knowing your surroundings.\nPERSISTENCE THAT PAYS: In PlanetSide 2 the war isn’t won by a single base capture. The core gameplay of PlanetSide 2 is about holding crucial territories and controlling resources. Working strategically as a team to secure tactical positions has long-lasting effects that can shift the tide of battle.\nCLASS-BASED COMBAT: Players can build their soldier to match wants and their allies' needs. Six distinct classes provide a wealth of squad options and combat tactics. Grow your soldier over time as you master each combat role, weapon, and vehicle, laterally unlocking hundreds of weapons, attachments, gear, skills, vehicles, and more.\nHeavy Assault: Rush into the battle guns blazing. You are the dedicated foot soldier of Auraxis.\nLight Assault: Go where the Heavies can’t with your short-burst jetpack. Pick a high spot, throw a grenade, and out maneuver your foes!\nCombat Medic: Keep your fellow soldiers alive and in fighting shape. You are the beating heart of any squad.\nInfiltrator: Stay silent. Stay invisible. You are death from the shadows, whether with a knife from behind or a single shot from a sniper's nest. You are the enemy's constant fear.\nEngineer:  Deploy crucial equipment. Resupply your allies. Fix the thing, then fix it again. You keep the machines running, the tanks firing, and the war effort moving forward.\nMAX: Step into your Mechanized Assault Exo-Suit (MAX). Cannons for hands, armor for flesh, and a disposition to match, you are a walking mass of nigh unstoppable death.\nOUTFIT TEAMWORK: Join or form your own Outfit, a like-minded group of soldiers who train together day in and day out. Whether a small rapid response team or a massive clan, Outfits are vital to each empire's strategic organization.\nVEHICLES & WEAPONS: Train and equip your solider how you want, with a huge array of weapons and vehicles which can be extensively customized by preference or purpose, using attachments, upgrades, and add-ons earned in the war.\nPLAY FOR FREE: PlanetSide 2 is free to play with optional in-game purchases.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Rogue Planet Games","platforms":[{"id":0,"name":"PC"}]},{"id":427490,"name":"Sea of Stars","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1de/1de8ff69ed31d7a47d4f7770f23f20b8.jpg","description":"Promising the Sabotage touch in every system, Sea of Stars aims to modernize the classic RPG in terms of turn-based combat, storytelling, exploration and interactions with the environment, while still offering a hearty slice of nostalgia and good old, simple fun.\r\nKey ingredients\r\nEngaging turn-based combat - Combat gameplay includes active player input during attack animations (timed hits), multi-character combo attacks, boosting, and strategic defense options to hinder enemies while they are channeling a powerful attack or spell. For a more immersive experience, there are no random encounters or transitions to separate battlefields, and no grinding. Both navigation and combat happen in the same environment.\r\nUnshackled traversal -  Swim, climb, vault, jump off or hoist up ledges as you run through the world with a navigation system based on platformer expertise that breaks free from the classic bound-to-the-grid tileset movement.\r\nPrequel story set in The Messenger’s universe - Dozens of original characters and story arcs will take you on a captivating journey. Sometimes epic, sometimes silly, and other times emotional, Sea of Stars does its RPG duty of exploring classic themes of adventure and friendship, while also being chock-full of the unexpected twists and events you’d expect from a Sabotage production.\r\nFull-on dynamic lighting - Our custom-made render pipeline allows the creation of a breathtaking world coming to life by pushing the limits of 2D pixel-art games.\r\nThe Sabotage treatment on the turn-based RPG genre - Every system has been deeply analyzed to create an experience that pays respect to retro classics, while reworking some elements to offer a modernized experience free of irritants and timesinks.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Sabotage Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":366889,"name":"Monster Hunter World: Iceborne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/543/543e7e11e48333820aaa3d38f778c434.jpg","description":"A diverse locale, rich with endemic life.\nNumerous monsters that prey on each other and get into turf wars.\nA new hunting experience, making use of the densely packed environment.\nMonster Hunter: World, the game that brought you a new style of hunting action,\nis about to get even bigger with the massive Monster Hunter World: Iceborne expansion!\n\n- All-new Hunting Mechanics\n\nAll 14 weapon types have new moves and combos. Each weapon has more unique actions than ever before. Every weapon now lets you use the clutch claw, a new function of the slinger, to grapple onto monsters. You'll drain your stamina while clinging onto monsters, but it opens up various new ways of controlling their movement!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":51175,"name":"Leisure Suit Larry 1 - In the Land of the Lounge Lizards","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/459/45908d995dd17bb01544006856dd5087.jpg","description":"Larry Laffer is a short, tacky, balding, forty-year-old man who has been living with his mother until recently. He used to be in the software business, but decided to leave everything behind as he moved to the city of Lost Wages in pursuit of sexual fulfillment. Clad in a white polyester leisure suit, Larry finds himself outside of Lefty's Bar, determined to finally lose his virginity - or commit suicide if he is unable to achieve that goal before dawn.\nLeisure Suit Larry in the Land of the Lounge Lizards is the first game in Al Lowe's Leisure Suit Larry series, largely inspired by the text adventure Softporn Adventure, though with a greatly enhanced script containing more humorous descriptions and dialogue. A text parser is used to input commands for interaction with a graphical environment. Progress is achieved by collecting various items and figuring out which of those may be essential for conquering the hearts of the several female characters appearing in the game.\n-    Includes Leisure Suit Larry 1 - In the Land of the Lounge Lizards and its VGA Version\n(The VGA Version of the game is available through steam. Right click on the game in the steam library -> properties -> betas and choose the VGA version.)\n-    Play as one of gaming’s longest lasting legends: Leisure Suit Larry!\n-    Al Lowe’s famously risque humor and bodacious babes that are waiting to “work out” with you!\n-    Use text commands for interactions with the environment!","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Apple II"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"}]},{"id":19278,"name":"Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/60b/60b74fccd30274db00ef51b97b41862c.jpg","description":"You'll battle cultists, gargoyles, zombies, hellhounds, and an unholy host of other terrors in your quest to stop Tchernobog. You must not only defeat the Cabal - you must scour its dread name from human memory. If that means eradicating everyone and everything the Cabal has ever tainted, so be it. Of course, you'll first have to make your way through fortresses, castles, mines, mansions, and estates guarded and kept by Tchernobog's malevolent servants. Fortunately, it is wits that make the hero, and although you're in serious danger of losing yours, you've got enough left to improvise some pretty effective tools of destruction. Aerosol hairspray can be frightening enough on its own, but apply it to a lighter flame and you've got an instant flamethrower (kids, don't try this at home!). Likewise, a flare gun can brighten your prospects considerably against even the grimmest odds, which is to say nothing for shotguns, Tommy guns, and dynamite. Who knows, you may even find that there are some spirits on your side when you find yourself clutching a voodoo doll.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19268,"name":"Head Shot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f91/f91bbd72a3f810643d4deec2b4d59648.jpg","description":"Take a role in a caroonish styled FPS multiplayer game. Choose among 5 characters and bunch of weapons and play Head Shot online with friends and strangers.\nFeatures:\n-5 classes (Assault, Sniper, Engineer, Medic, Machine Gunner);\n-Various types of weapons including  Assaults, Equipments, Machine Guns, Pistols, Rocket Launchers, Shotguns and Snipers;\n-Vehicles;\n-Different game modes (currently Death Match and Team Death Match)\nPlanned features:\n-More weapons;\n-More game modes;\n-More items and various other content that will bring more fun into the game.\n-Open chest system and various other stuff...\nMore features coming soon.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Indie Game Group","platforms":[{"id":0,"name":"PC"}]},{"id":16917,"name":"Before the Echo","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/2167956e19f9f5b55727f9855bd47afa.jpg","description":"Before the Echo combines elements of both rhythm and role-playing games to create an entirely unique experience. Join Ky on his ascent of a mysterious Tower, guided onward by a mysterious girl named Naia. Encounter deadly monsters and ridiculous characters, and discover the grand scheme behind Ky's mysterious imprisonment...that is, if you can survive the journey.\nKey Features: \t\t\t\t\t\tFully voice-acted, 10+ hour story mode\nWith music by Ronald Jenkees and Michael Wade Hamilton\nDeep item synthesis and spell customization mechanics provide a full RPG experience\nFull integration of Steam achievements and cloud saves\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Iridium Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14417,"name":"the static speaks my name","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/677/6777e1cf5b08317eb42efb2564793def.jpg","description":"A dark/sad/weird/funny first person exploration game. You play a man on his last night alive as he obsesses over a mysterious painting. More of a story game in that it emphasizes mood and character over gameplay. Takes ten minutes to play and has \"next-gen\" features like a shrimp tank with pet shrimp. Be warned, the game contains explicit handling of suicide.\nFor people that have played the game elsewhere, this is the original version, not an expansion or HD remake.\nFollow me on twitter at @jessebarksdale. I post updates about new things there.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"thewhalehusband","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9998,"name":"Nation Red","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/344/344a6b4703fb034f9bb0faf9de957cd1.jpg","description":"Reviews\n\"To cap off our trilogy of zombie indie titles, this is easily the best one I've ever played. Enjoy it, it's fantastic.”\nTotalBiscuit, The Cynical Brit\nhttps://www.youtube.com/watch?v=1ILeY_O4ouY\nAbout the GameNation Red is an ultra fast infinite play arena-based shooter providing an exceptional close-quarter battlefield experience. Fight thousands of zombie mutants and their bosses in frantic bloody gameplay while earning close to 100 perks. Fight in Barricade, Survival or Free Play mode. Play On-Line in coop, in single player or in local coop!\nAugust 17, 1977\nScattered groups of zombies infiltrate remote Midwestern towns. Incapable of using tools or weapons, the invaders are resisted until they retreat back into the desert. Special elimination posses are set up to hunt down any of the surviving undead. Six weeks after the squads started their search-and-destroy mission, the last known zombie was shot and killed.\nPresent-day\nOver thirty years had passed when a truck driver traveling down a desolate Arizona road plows into a wall of undead. Before the driver's phone signal went dead, he reported some were carrying guns...  They're back and now they are hunting us.\nSteam Exclusive Features:\t\t\t\t\t\t\tLocal and On-line Coop — Take on the horde and earn perks together\nBarricade Mode — Defend your base against zombie attack\nOver 100 Steam Achievements and a dozen Leaderboards\n30 Additional Steam User-designed Perks\nXbox 360 Controller support for single or multiplayer\nSteam Hammer — Rips the skin off your opponent (nice)\nNew Steam User designed weapons — Minigun, AA-12, MP5, Beretta 93R, Super Shorty and more\nNew Levels and New Enemies — Zombie patients and caretakers in a desert asylum, Brawler boss zombies, Suicide bomber zombies..\nPneumatic Destroyer — Detonates the Rammer they are surrounded by zombies\nKey Features:\t\t\t\t\t\t\tUltra Fast Action — Fight armies of hundreds of zombies and their bosses in an exceptional close-quarter battlefield experience\nDeadly Weapons — Use machetes, axes, jack hammers, dual Uzis, flame throwers, grenades, poison and a dozen more including a Steam Hammer, exclusive to Steam purchasers\nCustomize Yourself — 100 player modifiers combine with two dozen power-ups for limitless gameplay\nFour Game Modes — Free Play, Survival, Barricade and 18 increasingly brutal missions await\nZombies with Guns — They wield axes, cut-off saws, AK-47s and more\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"DiezelPower","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":474,"name":"Moto Racer 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf8/cf82e7d8179ea7105a47415eb306e838.jpg","description":"Digital Deluxe Edition\nThe deluxe edition includes the game and the Season Pass.\nThe Moto Racer 4 season pass gives you access to 3 big upcoming DLC packs, including an additional game mode.\nWith the season pass, show what you're made of online or off with three free customization packs.\nEach pack contains:\n- 1 Rider\n- 2 New bikes\n- 2 Horns\n- 1 Emblem\nAbout the GameOVERVIEW:\nIn a world where freestyle and risk-taking dominate, impose your riding style all around the world. Impress your opponents and win races with class!\nMoto Racer 4 is racing game you can play on asphalt or dirt in single or multiplayer mode (up to ten players).\nMaster drifting, wheelies, sharp turns and other techniques to earn a place on the podium!\nCustomize and upgrade your bike! Progress through Moto Racer 4 and take in the stunning environments.\nFrom the United States to the Asia by way of the desert, Moto Racer 4 takes you through perilous, breathtaking courses at 100 miles an hour.\nObstacles, hell-bent opponents, traffic and even police will get in your way to try to stop you. Go off road and use each course's  unique features to your advantage to find the best shortcuts.KEY FEATURES :\n1 GAME, 2 CATEGORIES: ASPHALT & DIRT\nEVEN MORE CHALLENGES -  In Progression mode, advance through the game and complete challenges to unlock even more content!\nIMPRESSIVE, VARIED ENVIRONMENTS -  From the Bay Area to the Asia by way of the desert, become the freestyle king by stringing together tricks on the most unlikely of terrains.\nCUSTOMIZABLE BIKES - Customize your bike however you like to reflect your unique style.\nCHALLENGE YOUR FRIENDS - Face your friends on split screen or on line in multiplayer mode with up to 10 players at one time!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Anuman Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":532482,"name":"Legends of Idleon MMO","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ef/3ef39ba4743f7d6ffe1aa586c88d6133.jpg","description":"Create your own guild of adventurers, and specialize each one into unique classes!\nEvery character serves a purpose! Your miner will get ores, for your smithy to make into armor! Your DPS main can use those equips to defeat monsters, and progress your entire guild forward in the wordl! More gameplay systems are unlocked as you continue progressing!\nEach class grants a permanent 'family' bonus to all your characters, which only grows stronger every time that class levels up!\nExperiment with weird builds -- How about a full LUK strat to get a high % drop rate, so you can farm bosses for rare drops to use on other characters?\nLove MMO's for the grind? I've got you covered!\n- Destroy maps full of monsters, complete quests, fight daily bosses, and micromanage all your characters for maximum efficiency!\nToo busy to play all day? I've got you covered!\n- Your characters will continue their tasks after you leave! You'll get less gains, but will make steady progress!\nAn MMO cake with idle icing!\n- At its core, this game is similar to traditional MMOs. While idle-game fans will feel right at home, don't be dissuaded if you're not an idler! Expect a welcoming experience -- not one with confusing, complex charts and graphs!\n\nExplore a world full of unique NPCs, monsters, and secrets!\n- Over 40 different NPCs, that give out 135 unique quests! Maybe you'll have to kill monsters without equipment on, or help a piggy reach 1M social media followers (that last one will make more sense in game)\n- 70 different locations, spread out across different scenery -- Jungles, forests, deserts, oceans, sewers, caves, and quite a few others!\nNo corporate business practices!\n- Made by just 1 guy, so there are no stockholder expectations to meet, and no ludicrous CEO bonuses to pay! I don't have to rely on scummy practices to pay off unnecessary business expenses  -- and instead, I can just focus on making a pure gaming experience, with monthly updates to spice things up!\n- With an active discord of 20,000 users, I place a huge importance on player feedback. Weekly polls and custom suggestions drive the direction of the game, so you can rest assured this game will always be for gamers, made by a gamer!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Lavaflame2","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":452648,"name":"Demon's Souls (2020)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc4/cc4a56d9e4c2a230293e335000469453.jpg","description":"From PlayStation Studios and Bluepoint Games comes a remake of the PlayStation classic, Demon’s Souls. Entirely rebuilt from the ground up and masterfully enhanced, this remake introduces the horrors of a fog-laden, dark fantasy land to a whole new generation of gamers. Those who’ve faced its trials and tribulations before, can once again challenge the darkness in stunning visual quality and incredible performance.\r\n\r\nIn his quest for power, the 12th King of Boletaria, King Allant channelled the ancient Soul Arts, awakening a demon from the dawn of time itself, The Old One.\r\nWith the summoning of The Old One, a colorless fog swept across the land, unleashing nightmarish creatures that hungered for human souls. Those whose souls were stripped from them, lost their minds – left only with the desire to attack the sane that remained.\r\n\r\nNow, Boletaria is cut off from the outside world, and the knights who dare penetrate the deep fog to free the land from its plight, are never seen again. As a lone warrior who has braved the baneful fog, you must face the hardest of challenges to earn the title “Slayer of Demons” and send The Old One back to its slumber.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bluepoint Games","platforms":[{"id":0,"name":"PlayStation 5"}]},{"id":21958,"name":"Yakuza 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a7/8a71061c3b098f8ea4b9657ab473445a.jpg","description":"Yakuza 3 is the next cinematic chapter in the prestigious video game saga offering an authentic, gritty and often violent story set in modern day Japan. Following the events of the previous game, Kazuma and Haruka (his adopted daughter) have left Kamurochoto to seek a new life in Okinawa where they manage an orphanage for children. However, their peaceful life is soon interrupted when a series of events unfold pulling Kazuma back into the shadowy past he thought he had left behind. Making its first appearance exclusively on the PlayStation 3 platform, the rich story and vibrant world of Yakuza 3 lets players engage in intense brutal clashes within the streets of Okinawa, and the pulsating and often dangerous city of Tokyo where only the strongest will survive.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":20418,"name":"Gnomoria","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe0/fe0e1e1de961d71562818c27d488ee90_NK2EqJ7.jpg","description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!Key Features:Procedurally generated world - Every game is different\nFully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\nOpen sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\nCrafting - Tons of items to craft at different workshops\nMechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Robotronic Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20227,"name":"Corporate Lifestyle Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32b/32b4a023ceb179ecc5e05cd090591c47.jpg","description":"An isometric orgy of big smashy pixelart and big smashy chiptunes.\nBattle your way through corporate architecture and brain dead, buzzword-spewing, middle managers using office supplies as weapons to work through your Jungian shadow issues...\nFight back against the forces of tyranny and liberate your fellow coworkers from the oppressive evil that dominates them...\nSmash ALL THE THINGS!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"DolphinBarn","platforms":[{"id":0,"name":"PC"}]},{"id":20114,"name":"Speed Kills","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8e/a8ede101d19772775c1e9efb0ed91e58.jpg","description":"Action-packed death racing, this is what Speed Kills is about!\nTraditional, isometric, powered by Unreal Engine. Players compete in various championships, ranging from bootleg rallies on the outskirts of the galaxy to big-league circuits set against the goliath skylines of metropolis cityscapes. You can purchase offensive and defensive vehicle upgrades, buy new cars, collect power-ups and earn bonuses.\nFEATURES\n• Classic gameplay, inspired by the 16-bit isometric racing games\n• 5 planets/championships to compete\n• Over 50 unique tracks\n• 8 fully customizable and upgradable vehicles, ranging from beefed-up pickup trucks to futuristic hovercars","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Black Wing Foundation","platforms":[{"id":0,"name":"PC"}]},{"id":12914,"name":"Morphblade","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c87/c870e98bbb9843aebfe1ac546d573fbb.jpg","description":"In Morphblade you move around a grid slicing, smashing and bursting waves of nasty red bugs. Each tile you move to transforms you into a different weapon: on a Blades hex you can slice enemies on either side of you, on an Arrow you can launch yourself through two enemies in a row. Between waves, you choose how to build out the grid, and upgrade your most used hexes with new abilities.\nHammer: lets you stay put and smash a single enemy in front of you\nBlades: kill enemies on either side as you move\nArrow: plunge right through an enemy and come out the other side\nRepair: repairs any damage you've taken when you move here\nTeleport: move to anywhere else on the grid\nAcid: strips tough enemies of their armour, leaving them vulnerable\nKilling bugs earns you upgrades for your hexes, and each hex type can be cross-bred with every other type to take on some of its properties. Upgrade an Arrow with Acid and it can kill armoured enemies. Upgrade a Hammer with Blades and you can kill three enemies at once without moving. Upgrade a Teleporter with a Repair and you'll be healed each time you teleport.\nUpgrades can even be stacked, so you can end up with an Arrow that propels you with infinite range, kills everything in your path, penetrates armour, knocks back everyone near your destination, heals you, and doubles as a teleporter.\nThe idea for tiles determining your weapon came from the iOS game Imbroglio by Michael Brough, which is great, and Morphblade is developed and released with his permission.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Suspicious Developments","platforms":[{"id":0,"name":"PC"}]},{"id":10613,"name":"Slime-san","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d5/8d50d0026781f80f9e48c0a80dcec1a3.jpg","description":"SynopsisSlime-san was minding his own business, sliming around in a peaceful forest when suddenly…A giant worm appeared and gobbled him up!\nNow deep within the worm’s belly, Slime-san has to face a decision: Be digested by the incoming wall of stomach acid... Or jump, slide and slime his way through the worms intestines and back out its mouth!\nFeaturesIncredibly fast-paced and twitch-timing platforming madness!\nNo time to stay still as you are chased by a wall of acid at every corner! Run, run, run!\nBeing a slime has its perks. Slime your way through cracked walls and surfaces!\nBust through brittle obstacles or tense situations with a speedy dash move.\nSlime to slow time, dash to speed it up. Feel like an absolute badass with pixel precise maneuvers!\nA game filled with content: 100 levels made out of 400 rooms combined with 100 newgame+ levels totaling to a staggering 200 levels and 800 rooms!\nCollect partially-digested apples to unlock different play styles, outfits, shaders and mini games!\nUnlock competitive multiplayer arcade games that recalls titles of the past!\nGet your shopping done in a town of survivors within the worm, home to colorful characters and surprising secrets.\nEach level is timed with online rankings, for the competitive and score-oriented.\nUnlock extra game modes like New Game+, Speed Running and Boss Rush modes!\nGet engrossed in a flexible, 5 colored, pixelated world…found… within… the worm?\nAdhesive Wombat, Tiasu, MegaNeko, Kommissar, Richard Gould... Over 10 composers contributed with over 20 songs for a chiptune album that you can't help but groove out to!\nBlackbird's KrakenThis version comes bundled with the Blackbird's Kraken downloadable content!HistorySlime-san is the third major game developed by Fabraz. The two previous titles being Planet Diver and Cannon Crasha. Slime-san is a game that is fun down to its very core. A silly story, with an unlikely character and gameplay that is addictively fast. It offers hours of single player content yet is tailored for speed runners as well. The very core mechanics and level design lend themselves to be played competitively online. It is a visually unique adventure using a carefully crafted, 5 color palette world that is filled with fun and goofy Japanese references. It also has a soundtrack that is worth the price alone, featuring some of the most popular chiptune composers in the world! Published by Headup Games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Fabraz","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":61717,"name":"Radio Commander","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f75/f75c8788016f035782af11b108a032b5.jpg","description":"In Radio Commander you are playing as an American military commander serving in US Army during the Vietnam War. You will be carrying heavy burden as your mission is to coordinate military operations taking place between 1965 and 1967. But this is not just another RTS, in which you are an invisible being hovering over the battlefield. In Radio Commander situation reports are given to you in form of dramatic radio statements sent by troops fighting on the ground. And your only accessory is a strategic map, on which you can place tags and notes. Will you be smart, fast and cold-blooded enough to carry the responsibility and save your men?\nUNIQUE VIEW ON REALISMRadio Commander offers an unique experience very different from classic real time strategy games. It’s a bold try to redefine the genre, as player will be involved in decision making process much more realistic than those pictured by casual RTS. Ask for situation reports. Listen what your men have to tell you. Send evac choppers and nape drops. Defeat the invisible enemy.DIVE INTO THE STORYExperience the story of soldiers and their commander, trapped in the middle of bloody, chaotic, morally ambiguous Vietnam conflict. Dive into a scenario that doesn’t avoid the difficult issues of civilians trapped in the theater of action, shady CIA operations, and cynical political pressures. Discover those uneasy situations, presented in such cult classics as Platoon, Full Metal Jacket or Apocalypse Now, which were happening on a daily basis for those serving in Vietnam. See for yourself how hard it is to make the right choices in the middle of a fire exchange with Vietcong.DECIDE WHO LIVES AND DIESDecide the fate of your soldiers. The choices you face will have a direct impact on the course of the game. They will also define views of your hero. Or maybe those are your views? Playing Radio Commander you must be prepared to answer tough questions about the righteousness of your actions, price of a human life, and the toxic power of propaganda and stereotypes.USE YOUR IMAGINATIONRadio Commander is not another empty action game. You will play as the commander operating from his tent, using only a radio and a map. You will be staring at the map for hours, listening carefully to the reports. Your decisions will affect life of many people. Just like in real life, there are no fancy graphics and animations to help you imagine what’s happening on battlefield. Only you, your map, and skills. You have to listen and be smart. Thanks to this, level of immersion is much greater than in normal real time strategy games.\nCHOOSE BETWEEN VARIOUS MEANSYou will take under your command not only units of infantry, air cavalry or field artillery, but also powerful units of air support. It’s in your will to order the jungle-burning nape drops, or devastating bombings. Are you ready to bring the rain of fire and burn the enemy positions to the ground? Are you sure that your soldiers are far enough and won't take damages? And does the ends always justify the means?EXPERIENCE DEEP IN-GAME SYSTEMSBeneath the narrative layer, hidden from your eyes, a deep and complex simulation is taking place. In Radio Commander every unit is described by unique set of statistics. You will have to worry about your platoons morale, supplies, and even stamina. All those factors will be important during your soldiers' confrontations with enemy, unfriendly terrain and extreme Vietnamese climate. What will you do, when your choppers report, that they are out of fuel and forced to land in the middle of the jungle? Will you send the rescue mission risking the life of even more soldiers?BOND WITH YOUR BROTHERS IN ARMSTroops under your command are not just pawns on the map. They are complicated, multi-layered human beings, with their own voices, problems, strengths and weaknesses. Mutual trust is essential. They depend on your judgment and cool decisions, while you are hoping they’re giving their best. Discover hundreds of original dialogues and scenarios. Play the same mission another time making different decisions and listening to different replies.HOURS OF GAME EXPERIENCERadio Commander includes:\n- 10 campaign missions (every mission is possible to complete in several different ways),\n- 10 animated briefings,\n- 15 units types, including: infantry, evac choppers, gunships, field artillery, aerial reconnaissance, armored personnel carriers M113, and napalm-carrying F4 Phantom jets (every unit is described by a unique set of statistics and communicates with commander using a different voice),\n- full voice over,\n- over 200 dialogue blocks, used to construct radio messages,\n- over 600 story dialogues between units and the commander.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Games Operators","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":19104,"name":"Red Risk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d8/5d81bd5f1007cd3cac8d7598435577a6.jpg","description":"Red Risk\nVolunteers fight in a bloody contest for freedom and money.\nYou'll play as one of three volunteers armed with their favorite weapons.\nSurvive waves of enemies with a large quantity of rounds, enemies and bosses.\nYou will need to eat, drink and fill your ammo in order to survive.\nElite monsters will cast an unique set of skills to hunt you down.\nThis game requires a lot of strategy and rational thinking.\nKey Features\n3 Players Co-op\nOriginal Soundtrack\nDeadly traps\nSkilled Enemies\nBlood, gore and dancers!\nLevel Up System\nSteam Achievements/Trading Cards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Microblast Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14485,"name":"MirrorMoon EP","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a55/a552a4660ec049c305633077c1e0239b.jpg","description":"MirrorMoon EP is a game about mystery and exploration set in outer space.\nThese space travels begin on a red planet and its unique moon and extend across galaxies.\nThe single player part of MirrorMoon EP blends adventure and exploration with navigation-based puzzle solving.  The multiplayer of MirrorMoon EP lets players share Galaxy Maps with other players: the first explorers to land on a planet will be able to name its Star System and that name will be forever bound to the star for any other fellow traveler who encounters it.\nEach Galaxy consists of a thousand Systems: it will be possible to fully discover the mysteries of MirrorMoon EP only while collaborating with other players.\nThrough the apparently indecipherable cockpit of an unknown spacecraft, players will be able to locate and travel to mysterious planets. Each planet has artifacts, buildings, and puzzles on its surface, hidden in astonishing low-poly sceneries.\nMirrorMoon was nominated for the Nuovo Award for innovation in games at Independent Game Festival 2013 and was also part of the Official IndieCade and Fantastic Arcade 2012 selections. Since then, MirrorMoon has grown considerably.  EP stands for Extended Play, representing all the new content that we added for the official release.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Santa Ragione","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":635386,"name":"Symphonia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e79/e798477413a08e16369dc064dc55524b.jpg","description":"In the realm of Symphonia, music acts as a source of life and energy. But since the founders and their orchestra vanished the inhabitants are divided, and the world slowly falls into silence. What if there was a way to gather a new orchestra? That's the question Philemon, the mysterious musician in Symphonia, will have to answer. Embody a mysterious violinist, brought back to life in a declining world. Your violin and bow are both your instrument and a means of transport. Catapult yourself through the world, and complete levels by solving exciting platforming challenges while re-activating the machinery that brings life and energy back to this world. Discover a musical world, based on the symphonic orchestra, and filled with colourful characters. Each area in Symphonia has its own distinct feel and characters, and each room is hand-crafted. Meet prodigious musicians and try to convince them to join the orchestra. A unique soundtrack, based on the romantic musical period, crafted by composer Olivier Esman. Enjoy the performance of the Scoring Orchestra Paris, recorded specifically for Symphonia and written by composer Olivier Esman and his partners Alexandre Bucas-Français and Lou Corroyer. Play engrossing concerts, each centred around one of the families of instruments – Strings, Brass and Woodwinds.  Explore, navigate, play the violin, gather musicians. Awaken Symphonia.Experience and overcome great platforming challenges with all of Philemon's abilitiesDiscover various environments which combine music and machineryPlay the violin to activate level elements and bring life to the realmGather musical Prodigies and play breathtaking concerts to bring music, joy, and glory, back to the land","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"ISART DIGITAL","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":327209,"name":"Songs of Conquest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f08/f08d246877a729a89ad00c8d3da43348.jpg","description":"Songs of Conquest is a turn based game where you build a kingdom, raise armies and control powerful magicians called wielders. You’ll quest around for loot, fight monsters, optimize build orders and strategies to pick off the enemy teams. We call it Classic Adventure Strategy, for short.\n\nCombat will be a major part of the game. You’ll recruit troops and your wielders will command them on the battlefield. The wielders harness a magic called “The essence”. By combining your wielders skills with the essence of the troops you get access to powerful spells.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Lavapotion","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":37898,"name":"Mercenaries 2: World in Flames","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b87/b87ca2bba819d4d44c38088ca3d8228d.jpg","description":"Play throughout the varied terrains of Venezuela that is larger than all the Mercenaries maps combined.  You decide the factions to work for, when. From one-off pickup jobs to multi-objective missions, your choices will determine which faction wins the war.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":28570,"name":"Trials HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63f/63fa1dca3cee707a9711711d0d759972.jpg","description":"(Online Interactions Not Rated by the ESRB) Fasten your helmet…and unlock the full version of Trials HD. This physics-based motorcycle game has over 50 brilliant tracks and amazing HD graphics, in two unique game modes. Customize your rider, unlock bikes, climb global leaderboards, and compete with new in-game friend-scores. With the level-editor, create and share an unlimited amount of new tracks. Trials HD is an experience you haven’t seen before! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Redlynx","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":21054,"name":"The Troma Project","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd6/dd6949e74be3329af4230f08e284af15.jpg","description":"WARNING: Originally completed in the year 2001 this game was never released. It contains extensive swearing, rude language, sex, crime, splatter Horror - everything what was not acceptable for a Video game 15 years ago. If you play this game, please do not take anything too serious.\nThe Troma Project is the exciting turn based strategy game which puts you in the world of Troma and Toxic Mayhem! Featuring The Toxic Avenger, Sgt. Kabukiman N.Y.P.D. and Super Tromette Tiffany Shepis, Toxic Mayhem is the fun and addictive game which allows players to mindlessly kill anything and everything that moves! And, at the beginning of every mission, Lloyd Kaufman will give you advice on how to get through it! Toxic Mayhem is the greatest video game since Toxic Crusaders for the Sega Genesis and Nintendo! Features: Turn-based Strategy featuring The Toxic Avenger and Sgt. Kabukiman NYPD! Seven chapters full of Fun & Gore! Be prepared for a long journey across the globe: Travel to Tromaville, Arabia, Motumbuland and other strange places! Meet Nelson MacMengele and dozens of other fucked up enemies! Amazing interactivity: go after hundreds of Tromatic weapons, drugs and other useful items. Mix your own drinks! Use your inventory to mess around with your equipment, make target-shots and blow up cars! Check out the Tromatic movie cutscenes in full-screen blood & gore while you follow the thrilling storyline to its dramatic conclusion! More than 25 tracks of music, featuring Nevermore, The Loose Nuts, songs from famous TopWare games and Troma movies, and many more! -","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nekrosoft","platforms":[{"id":0,"name":"PC"}]},{"id":10376,"name":"Deadfall Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/674/674ab5ca590818a998852356db5016f3.jpg","description":"Deadfall Adventures is an action-driven first-person shooter, spiced up with elements from action-adventure games. Become an adventurer, hunt for treasures, explore unknown regions of the world and rescue the damsel in distress from the clutches of enemies, both earthly and not-so-earthly. Join James Lee Quatermain on his journey across the globe!The StoryThe year is 1938. James Lee Quatermain is a man of many talents, yet holding on to money isn't one of them. James is an adventurer by trade, just like his legendary great-grandfather Allan Quatermain. And he knows how to squeeze money out of this famous name of his, while at the same time despising it. Despising those who believe his great-grandfather's tales of the supernatural and those who make fun of them alike.\nAccordingly, Quatermain isn't all too keen on escorting Jennifer Goodwin, an US agent and former colleague of his, to an Egyptian temple structure in order to retrieve an ancient artifact - The Heart of Atlantis. Neither does he believe in the reputed invigorating qualities of this artifact, nor does he care the least that a division of the Ahnenerbe, the Nazi department specialized in the occult, is after The Heart as well.\nBut life has its ways of changing one's perspective. Quatermain soon finds himself part of a hunt across the globe - from the stormy deserts of Egypt to the icy depths of the Arctic, and all the way to the steaming jungles of Guatemala. In long forgotten temple structures the thrill of the chase awakens the true adventurer in Quatermain, as he and agent Goodwin strive to be one step ahead of the Nazis and the Russians, one step closer to obtaining the Heart of Atlantis. And deep in these temples, where age-old guardians awake from their eternal slumber, James soon learns that his great-grandfather's stories are not as crazy as he had always believed. For all things live forever, though at times they sleep and are forgotten...Key FeaturesAction -Adventure gameplay from a first-person perspective\nSet in the Quatermain-universe, created by H. R. Haggard\nFast-paced action and intense, accurate FPS gun battles\nAdventurer equipment: compass, treasure maps, notebook and flashlight – necessary to solve ancient puzzles, find treasures and even to defeat certain types of enemies\nPuzzles that encourage you to explore the game environment and interact with it\nEnvironmental traps that can be used to eliminate enemies in many spectacular ways\nExotic, picturesque locations from around the world – Egypt, Arctic and forgotten\nMayan ruins in the jungles of Guatemala\nCompelling story faithful to the spirit of classic action-adventure movies\n1930’s setting, including detailed weapon designs\nUnique adventurer-style multiplayer features and modes","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Farm 51","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3731,"name":"Sonic Unleashed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/553/553274881e0897c95ad75de9627265c3.jpg","description":"Sonic the Hedgehog is on an adventure unlike any other! Powered by an all-new engine, Sonic Unleashed™ merges classic Sonic gameplay with the latest in next-generation innovation. Merging blistering 2D action with meticulously rendered 3D environments, players race through intriguing locations across the globe as Sonic to save a chaotic world.\nOn a quest for domination once more, Dr. Eggman unleashes a slumbering beast from the center of\nthe world. The event causes a devastating tremor that splinters the world into seven continents and\ntriggers a hair-raising transformation in Sonic. With the world divided and Sonic altered with new\nabilities and powers, the stage is set for a climactic battle… for when the sun sets, a whole new\nadventure awakens!\n1 player\n1MB minimum save size\nHDTV screen resolution: 720p\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© SEGA. SEGA is registered in the U.S. Patent and Trademark Office. SEGA, the SEGA logo, the SONIC TEAM logo, and SONIC UNLEASHED are either registered trademarks or trademarks of SEGA Corporation.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"}]},{"id":620042,"name":"Citizen Sleeper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/391/391954934d459b8fe78d87a8a68c71c6.jpg","description":"From the developer of In Other Waters, and featuring the stunning character art of Guillaume Singelin, Citizen Sleeper is a narrative RPG set on Erlin’s Eye, a ruined space station that is home to thousands of people trying to survive on the edges of an interstellar capitalist society.\n\nYou are a sleeper, a digitised human consciousness in an artificial body, owned by a corporation that wants you back. Thrust amongst the unfamiliar and colourful inhabitants of the Eye, you need to build friendships, earn your keep, and navigate the factions of this strange metropolis, if you hope to survive to see the next cycle.\n\n\n\n\nAn abandoned station on the edge of a system in crisis. Run down, chaotic, unruly, and alive—it was founded by idealists in the shadow of a corporate collapse. Now it is held together by anarchic alliances, ramshackle factions and a shared desire to be free from the gravity of corporate control.\n\n\n\nEvery cycle you get up and choose what to do with your time. Toil in the yards, or take a bar shift. Search the markets for rare components or grab some street food. Make or break alliances, uncover truths and escape those that hunt you. Learn to survive and ultimately thrive, one cycle at a time.\n\n\n\nThe station plays host to characters from all walks of life, trying to eke out an existence among the stars. Salvagers, engineers, hackers, bartenders, street-food vendors, each has a history which brought them here. You choose which of them you wish to help, and together you will shape your future.\n\n\n\nHack into the station’s cloud to access decades of digital data, uncover new areas and unlock secrets. This is your unique power, and with it you can change your future. Corporate secrets, rogue AIs and troves of lost data await those willing to dive into the depths of the station’s networks.\n\n\n\nEssen-Arp: to them you are just property, one more asset in a portfolio that stretches across the stars. You are the product of an abusive system, in a universe where humanity’s expansion is marked by exploitation and extraction. Escape the makers of your decaying body, and chart your own path in a richly imagined, deeply relevant sci-fi world which explores ideas of precarity, personhood and freedom.\n\n\n\nEach cycle you roll your dice. Assign them to vast range of actions available on the station. With every action, choose what, and who, matters to you, shaping the lives of those around you, and ultimately the future of the station.\n\n\nClocks track both your actions and the actions of others across the station. From becoming a local at the Overlook Bar to protecting a friend from Yatagan enforcers, clocks allow you to track your own progress and the influence you have on the world around you.\n\n\nFollow drives not quests, allowing you to pick and choose the stories and activities that matter to you. As you do, you will shape your character's five skills (Engineer, Interface, Endure, Intuit and Engage), unlocking perks and bonuses that reflect and change how you choose to live in this world.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Jump Over The Age","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":560792,"name":"Pixel Puzzles Illustrations & Anime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fe/6fe9e78f525de7daf8fbd66f451aa385.jpg","description":"Pixel Puzzles Illustrations & Anime, Bringing puzzles to the digital age.\n\nWith many FREE puzzles included, Pixel Puzzles Illustrations & Anime has a large range of puzzles in various sizes for you to solve and enjoy.\n\nShaped to perfection and with piece counts ranging from 96 to a huge 1410 pieces. Pixel Puzzles Illustrations & Anime brings you full size professional puzzles to the digital market place. No longer will a puzzler be left looking for that last piece, never again will the kitchen table be covered in tiny wooden shapes.\n\nFrom square to rectangle to huge panorama images, with a massive variety of separately themed puzzle packs containing only the best images possible, each having a unique cut like no other jigsaw could.\n\nPixel Puzzles Illustrations & Anime gives you the choice to play only the types of puzzles you really want to solve. It's the definitive way to puzzle, customize the game the way you want, with a full range of options to tweak the game as you see fit. Multiple themed play environments, all fully customizable for you to fine tune the jigsaw puzzling experience you’re looking for.\nPixel Puzzles, the number one place for digital jigsaws.\n\nFEATURES:\n- Full range of sizes from 96 to 1410 pieces.\n- Beautiful puzzle images.\n- Auto saving, never lose your progress.\n- Peaceful puzzling atmosphere.\n- Traditional puzzle gameplay.\n- Many customization options.\n- Multiple interactive play environments.\n- Hint tools to help solve puzzles.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"The Digital Puzzle Company","platforms":[{"id":0,"name":"PC"}]},{"id":61889,"name":"Radical Heights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b47/b47771f8468b6bb7451a5915f103b23c.jpg","description":"Welcome to RADICAL HEIGHTS, a free *X-TREME Early Access* BATTLE ROYALE shooter. Partake in high-stakes battle royale gunplay in a sunny SoCal dome as contestants drive-by on BMX bikes or stalk other contestants from the shadows in search for weapons and prizes...but also CASH that you can bank - win or lose! Whether you spend that cash on righteous customization in your personal prize room or pull it from an ATM to purchase weapons early in the next game -- building a wealth of cash is as important as taking down the competition in this irreverent 80s-themed action game show where everyone wants to be rich and famous!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Boss Key Productions","platforms":[{"id":0,"name":"PC"}]},{"id":51328,"name":"Metal Gear Survive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/85e/85e4c8a78cf9b82b5ed19262fe00c00f.jpg","description":"METAL GEAR SURVIVE builds upon METAL GEAR SOLID V’S enduring stealth action gameplay while introducing the new elements of exploration and survival to create a bold new experience.\nMETAL GEAR SURVIVE is a spin off from the main METAL GEAR SOLID V story that takes place in a strange alternative universe.\nCreate your own character and learn to survive. Scavenge resources, craft weapons, build a base camp and explore the unknown while developing the survival skills necessary in this hostile environment.\nIn CO-OP mode, assemble a team of four players to infiltrate and defend areas from hordes of creatures. Place fortifications and defensive weapons strategically to give you an advantage against ever intensifying enemies. Team work and resourcefulness are key in these fast paced co-op missions.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17946,"name":"Carrier Command: Gaea Mission","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7b/d7b5c30794636298bd74f39a81184242.jpg","description":"From the creators of the award-winning Arma™ tactical military shooter series comes a next-gen re-imagination of a groundbreaking 80s classic. Set in a vast open archipelago, Carrier Command: Gaea Mission brings a breathtaking combination of action game and strategy elements!\nAs a result of a catastrophic war between the United Earth Coalition and the Asian Pacific Alliance, Earth has been rendered an almost uninhabitable wasteland. The only hope lies in a distant planetary system, where the moon Taurus holds the key to restoring Earth's dwindling water supply. As a battle-hardened member of the surviving UEC forces, Lt Myrik is put in command of an armed vehicle carrier. By traversing the seas and establishing a network of island bases, his mission is to hunt down the enemy and conquer the Dead Zone on the planetoid Taurus. Key Features\nStory-Driven Campaign\nFollow the immersive storyline as you evolve from underdog rookie to Carrier Commander in a battle against overwhelming odds.\nStrategy Campaign\nExperience the original 80s classic; select startup settings, the balance of power and challenge the enemy carrier to an ultimate strategic duel. Explore 30+ unique islands in 6 distinct climatic zones.\nIsland Network\nRoam the seas to establish a network of island bases for defense, mining and manufacturing. A steady supply of resources is vital to your campaign’s success.\nUnit Customization\nBuild new upgrades and weapons for your Carrier and combat units, but keep an eye on fuel and ammo.\nJoin the Action\nGet into the heart of the action by taking direct control of any unit. Shift seamlessly from combat vehicles to strategic map via the unique Picture-in-Picture window.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":16828,"name":"Loot Hero DX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94a/94a57ad88333a8682f6fcc19b4b6dcbe.jpg","description":"A legendary Dragon is haunting the lands.\nTowns are set ablaze, and its magic power resurrects the evil creatures of the world.\nA hero is needed to travel to the corners of\nthe lands and slay the beast to restore peace.\nRPG grind-fest! Run, Battle ever harder enemies, Collect XP and Loot, Buy better equipment, Level Up, Do it all over again!Features\nA huge cast of different enemies and bosses\nTons of different equipment upgrades\nIncludes Idle elements where your miners collect gold while you are away from the game\nLovingly crafted Retro graphics\nAchievements to unlock\nBestiary to fill out\nCards to collect\nController support\nPossibly infinite gameplay\nRidiculous amounts of Loot and XP!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"VaragtP","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":10612,"name":"CRYPTARK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da2/da29085c0722832b406f952edd9a6dc8.jpg","description":"Cryptark is a 2D roguelike shooter that challenges players with boarding and neutralizing procedurally generated alien starships to earn income for their Privateering enterprise. Purchase improved equipment and weapons to tackle more dangerous targets, but be cautious as failure will result in a loss of investment and profit. The decaying alien arks will defend themselves from intruders with a wide arsenal of cyborg monstrosities, robotics, and security systems, all obstacles that must be surpassed to achieve victory, the destruction of the ship’s central System Core.\nComplex, procedurally generated alien space-hulks to board and defeat.\nChallenging, re-playable campaign that tests your strategy and tactics.\nOver 70 weapons and items, including frag-cannons, tractor-beams, flamethrowers and nukes.\nHigh-score leader boards to rank your skills.\nFully lip-synced voice acting brings your fellow shipmates to life.\nBlood-pumping soundtrack perfect for intense firefights.\nGame Wiki: http://cryptark.gamepedia.com/Cryptark_Wiki","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alientrap","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]}]