[{"id":16886,"name":"Hidden Object Bundle 5 in 1","genre":"Adventure","price":0.0,"description":"This bundle includes 5 well-known Hidden Object games:\nBehind the Reflection 2: Witch's Revenge:\nA witch's quest for revenge spells trouble for a young mother and her son in this haunting hidden object adventure! Guide the mother as she pursues the witch through time and space to save her son from a fate worse than death. Interact with a variety of characters, find useful objects, and then use the items to solve cunning puzzles. The variety of quests you must take on will keep you pressing forward to the game's shocking conclusion: Collect battle armor for a talking skeleton, assemble a special key belonging to an exorcist and save a witch from burning at the stake, all in an effort to stay on the trail of your nemesis! Beautiful artwork brings each scene to life, while the use of pictures instead of word lists simplifies the process of looking for hidden objects, even as the creators of the game employ clever new ways of hiding things in plain sight. Can you rise above every challenge and triumph over evil?\nMountain Crime: Requital:\nSomeone is killing the guests at a mountain resort, and you could be next if you don't solve the mystery at the heart of this chilling thriller! Take the role of a doctor who's summoned to a remote hotel to tend to a patient, and hold on to your sanity as you discover the first victim moments upon arriving at the retreat.\nAs you search for clues, crack brain-bending puzzles and read newspaper clippings that reveal the hotel's horrific past, two questions will take shape in your mind: What ties do you have to the hotel? And why did one of the victims claim you are the killer? The answer will shock you! Play Mountain Crime today to discover the truth!\nVampire Saga: Pandora's Box:\nWith a chilling crime at the center of its spellbinding story, Vampire Saga is not intended for the faint of heart. Join Matthew Ward as he steals aboard a cargo ship to escape the violence of the Spanish-American War, passes out and then wakes up to find himself alone with several sinister-looking coffins. Explore eerie locations, search for hidden objects and follow a story full of nerve-pricking encounters. Without a doubt, this captivating mystery thriller will give you the creeps!\nWeird Park: Broken Tune:\nA haunted amusement park is the backdrop for a twisted tale of terror in Weird Park: Broken Tune!\nTake the role of a private detective hired to investigate a rash of \"accidental\" deaths that befell those who worked at the park before city officials shut it down. Search for clues as you explore creepy carnival environments, solve puzzles as you pursue a mysterious joker down shadowy paths, and find hidden objects that can help you solve the mystery of a portal that leads to a realm beyond insanity. With its gripping story, intense atmosphere, and challenging puzzles, Weird Park: Broken Tune is a game no hidden object fan should miss!\nTwisted Lands: Shadow Town\"\nWhy does your heart beat faster when you peer into a dark room? What makes the hair on your neck bristle when something invisible whispers in your ear? And why do you jump when something that should not be real appears in the corner of your vision?\nWelcome to Twisted Lands: Shadow Town, the first game in a new saga that will explore the emotion of fear. Guide the actions of a man as he searches a deserted island for his wife, who disappeared when their boat crashed on the shore. Along the way, gather hidden items, solve hair-raising puzzles and make one spine-chilling discovery after another as you draw ever closer to a shocking conclusion!","imageUrl":"https://media.rawg.io/media/screenshots/e78/e780b25ac17d50b132a3ed619543535d.jpg","releaseYear":2015,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15920,"name":"The Infinite Black","genre":"RPG","price":0.0,"description":"Fleet up with thousands of players in The Infinite Black -- The wildly popular online space combat and adventure game for desktop and mobile devices!\nCommand massive spaceships, form powerful corporations, and battle it out in never-ending intergalactic warfare!\nHunt bounties, fight aliens, loot treasure, earn achievements, and customize ships with thousands of items!\nGlobal cross-platform servers connect friends and enemies from around the world! Play the same character from any device with anyone else on Windows, Mac, Linux, Android, and iOS!\nThere is no cost to play and no marketing tricks: No DRM, no DLC, no subscriptions, no account limitations, no time restrictions, no selling your personal info. We don't even ask for an email address.\nThe Infinite Black is truly free and does not require any purchase to experience the FULL game!","imageUrl":"https://media.rawg.io/media/screenshots/7e0/7e02f2b8eb37a554971125101ec38808.jpg","releaseYear":2016,"developer":"Spellbook","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14754,"name":"The Apotheosis Project","genre":"Adventure","price":0.0,"description":"Penelope Barker and Aaron S. Reid are agents of the extra-governmental Pandora Global Corp, which works in parallel with the CIA. Unbeknown to them, they are also guinea pigs in an ambitious and dangerous project...\nThe corporation is experimenting with a modification to DNA that is capable of altering the faculties of the guinea-pig subjects, thereby granting them powers beyond the ordinary.\nBut for what purpose? Find out as you venture into mysterious settings, unravel the adventure and come to understand The Apotheosis Project.\n+ A budget point and click science fiction adventure by Midian Design\n+ Full English voice acting starring Jesse Gunn (Warmer) & Donna Preston\n+ Full original soundtrack by dagaz (also comes included in My Library > Music)\n+ Control 2 characters, switch between agents to further your adventure!\n+ In-game score system, can you reach the top?\n+ Find over 30 extra hidden Steam achievements!\n+ Soundtrack included in Library > Music\n+ Suitable for younger players, lighthearted story & simple controls","imageUrl":"https://media.rawg.io/media/screenshots/384/384e77a72b52bed9f2319d1a6e2f4642.jpg","releaseYear":2015,"developer":"Midian Design","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13865,"name":"RED","genre":"Action","price":0.0,"description":"Summarize:\nRED is a game which made by three university students. They use FLASH and RPG MAKER to make RED and the post-production is PS (PhotoShop). This game is an action and side-scrolling video game. The whole stroy is rewrited from the story \"Little Red Riding Hood\".\nRED芮德兒為三位大學生用FLASH，RPG MAKER所製成，後製工具為PS，遊戲為橫向式捲軸動作遊戲，整體故事以小紅帽為故事藍本改寫。\nThanks for Adrián Palomino del Moral 's help. Because his translation in Spanish, we are able to launch the Spanish version.We appreciate your help, the game in  Spanish version is launched. We will tag you on our shopping page to present our gratitude.\n感謝Adrián Palomino del Moral的西班牙文翻譯幫助，使得遊戲能推出西班牙文\nFB：\nhttps://www.facebook.com/Ｌｅｍｏｎ-Ｂａｌｍ-300168673452940/\nTwitter：\nhttps://twitter.com/storyk21674/media\n遊戲資訊Information\n遊戲名稱：芮德兒 ( RED )\n遊戲類別：2D橫向卷軸遊戲 ( 2D side-scrolling Game )\n遊戲時間：約20分鐘左右 ( About 20 minutes )\n結局數量：2個 (普通結局&真結局) ( Both Endings )\n製作軟體：RPG Maker XP\n畫面尺寸：640 x 480 pixel\n系統需求：Windows XP以上\n檔案容量：140MB以下\n語系：繁體中文、 English、Spanish\n*Alt+Enter：全螢幕切換／Fullscreen\n*Shift+Enter：快轉對話／Message Skip\n*Esc：暫停／Pause","imageUrl":"https://media.rawg.io/media/screenshots/28b/28be33ac6284a6abd907e0a2de22a6c4.jpg","releaseYear":2017,"developer":"貓蛋","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":13274,"name":"I Am The Hero","genre":"Action","price":0.0,"description":"I Am The Hero is a pixel art, beat 'em up, fighting game that tells the story of a \"Hero\" with a glorious but mysterious past. Is he the hero he thinks he is or is there another side to this legendary figure?\nI Am The Hero is a love note to retro gaming, ripped from the fuzzy memories of the developer’s childhoods and seasoned with a wild passion for fighting games. If you want a truly modern re-interpretation of classic gaming, then it’s time to join the fate and answer one simple question, “are you the hero?”FEATURES:\nLocal and Online Co-Op\nFast Moving, Fluid Combat\nFree Style Combos : trample, juggle, rush, and crush your enemies into submission with your own unique fighting styles\nCritical Blink : by timing your attacks perfectly you can unleash massive damage on your foes with Critical BlinkGAME MODES:\nSingle Player Campaign\nLocal Co-Op\nOnline Co-Op In Survival Mode\nEnjoy fast paced, retro action inspired by modern and old-school classics. I Am The Hero will give you shot of nostalgia and adrenaline that you’ve been crazing.\nSo what are you waiting for? It’s time to join the fight!","imageUrl":"https://media.rawg.io/media/games/2ac/2ac478686d6f6090ed9a76996bfc5e70.jpg","releaseYear":2017,"developer":"Ratalaika Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":12391,"name":"GE Neuro","genre":"Simulation","price":0.0,"description":"Take a journey through the mind of musician Reuben Wu who scored an original soundtrack to this experience. Travel through his imagination to amygdala while listening to his original scored soundtrack.\nReuben's real life brain data was scanned with an MRI to allow you a portal into the human brain, allowing viewers to enter, view, and explore the mind in a brand new way. Debuting the world's first-ever animated VR neuro experience powered by AMD's pioneering virtual reality technology LiquidVR™, GE is bringing viewers into the imagination and brain of accomplished photographer and DJ Reuben Wu, for a journey through Reuben’s neurological responses to his thoughts, ideas, fears and memories.\nCreated by Kite & Lightning in partnership with GE & AMD , “Neuro” gives a peek into how scientists are breaking new ground to understand how the brain works through advanced imaging technology.","imageUrl":"https://media.rawg.io/media/screenshots/7cc/7cc8efcd54dbe72c628d6531312c7e30.jpg","releaseYear":2016,"developer":"Kite & Lightning","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12210,"name":"Nash Racing","genre":"Racing","price":0.0,"description":"NASH RACING\nBuckle up! Get ready for Nash Racing, an upcoming indie racing game\nNash Racing is a racing game with 2 game modes:\nIn the first one, you race against your opponents on different tracks and with different cars. Choose from 10 different cars. Every AI opponent has different driving skills.\nThe second one is a time trial. Here, the player drives alone on different tracks and tries to beat the track‘s target time. If unsuccessful, the player will have to do better next time!\nThere is a tuning system where the player can modify cars.\nBe the fastest driver and challenge your opponents!Game features: -\tSingle race\n-\t10 different cars\n-\tAI Opponents\n-\tLap time and best lap time scoring system\n-\tDrive 1-4 laps race\n-\t21 tracks\n-\tAn open world to test your car\n-\tCar damage system, not realistic\n-       \tTime trial game mode\n-\tNot fully realistic physics yet\n-\t3 different cameras\n-\tTuning system with painting car, changing tires, bumpers, wheels etc.\nController support","imageUrl":"https://media.rawg.io/media/screenshots/c5c/c5c3252759e9aadb1be22bf9913915e0.jpg","releaseYear":2017,"developer":"Tero Lunkka","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11254,"name":"A Lenda do Herói","genre":"Adventure","price":0.0,"description":"Plataformas voadoras, inimigos coloridos, armas mágicas e física inexplicável. Isso tudo com uma música de fundo que acompanha a saga de um cavaleiro. Eis um breve resumo do que poderá ser encontrado em A Lenda do Herói - O Jogo, que homenageia vários clássicos das eras 8 e 16 bits, como The Legend of Zelda e Wonder Boy in Monster Land, e ao mesmo tempo tira sarro de diversos clichês encontrados no mundo dos games.\nUm dos diferenciais do projeto é sua trilha sonora dinâmica e bem-humorada que narra os feitos do jogador e responde a seus comandos, tornando-se um elemento-chave para a progressão da história. Tudo isso será complementado com puzzles, itens especiais, batalhas épicas e tudo que um bom jogo de videogame precisa ter.","imageUrl":"https://media.rawg.io/media/screenshots/b70/b70030b6e79fc5eabe608f330dd2c0bf.jpg","releaseYear":2016,"developer":"Castro Brothers","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10706,"name":"Illyriad - 4X Grand Strategy MMO","genre":"RPG","price":0.0,"description":"Build a city, create an Empire!\nForge Alliances with thousands of players. Craft and Trade 380+ resources and items in an entirely player driven market, across a vast, varied world. Side with 100+ warring NPC factions and their 700+ unit types.\nThe Steam purchase of Illyriad comes with 200 Prestige (in-game currency) plus an additional 25 for starting a new account, as well as more than 525+ Steam Achievements and in-game music!\nResearch 400+ technologies, and build 70+ building types to create your own specialised cities. Gather exotic resources, craft rare items, master mighty magics, command thieves and assassins, explore and settle new lands in the 8.6 million square world of Illyriad®.\nIllyriad is a strategy game of extraordinary depth and variety. With a great community, multiple paths for city specialisation, and frequent updates and new releases, this is a vast fantasy world where you can be the kind of ruler that you wish to be.\n\"Solid and deep MMO play experience. This is certainly a sweeping, epic strategy game.\" – Independent Games FestivalBuild, plan, gather, craft, trade, scheme and fight in this strategy epic!","imageUrl":"https://media.rawg.io/media/screenshots/eb1/eb14b24b57577d7d6db5a2e560c1576a.jpg","releaseYear":2017,"developer":"Illyriad Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10630,"name":"Low Magic Age","genre":"Adventure","price":0.0,"description":"Low Magic Age is a fantasy RPG that focused on turn-based party-based tactical combat. Field of View, Fog of War, Cover, Zone of Control, Charging and Flanking, various and abundant tactical elements are implemented in the combat system of Low Magic Age.\nThe game rules are evolved from the Open Game License (OGL), the set of rules based on the pen-n-paper version of fantasy role-playing games of all time, made by Wizards of the Coast.\nNormally, you'll create and customize a small party of 4~6 characters: choosing from multiple races, classes, dozens of feats and spells, or choosing a character template directly. And then fight with all kinds of monsters!\nFeatures:Inherited from classic game rules: Evolved from historic pen-and-paper game rules, plus well designed information display UI, clear prompt of hit percent and damage range, help players to learn and immerse in the fantasy world. The innovative combat system, flanking, charging, full-attack, etc., various circumstance bonuses bring more meaningful tactics selections.\nClassical fantasy monsters: 7 categories, 100+ classical fantasy monsters. Goblins, trolls, giant ants, basilisks and much much more. Different monsters need different strategies and tactics to defeat.\nTons of equipment and wondrous items: 60+ common items, 90+ wondrous items, 80+ enchantments. Slashing, piercing and bludgeoning, different weapons against different monsters. Gloves of Dexterity, Counterstrike Bracers, Ring of Regeneration, Belt of Magnificence, Cloak of Thorns, Elemental Gem, collecting powerful magical artifacts to create the hero character in your mind.\nWell designed skills and spells: Fighters own a variety of martial arts movements, not only basic attacks. All of the arcane spells and divine spells of caster classes are greatly improved, too.\nAbout graphics similarity with another game ToME4:We purchased and used a tileset of monsters/items from the Norwegian artist Raymond E. Gaustadnes (Shockbolt). He made another tileset for ToME4. So, both tilesets share the similar style and a few same tiles.Thanks to the Open Gaming License (OGL) from Wizards of the Coast:It has been stated explicitly by Wizards of the Coast that anyone can make a computer game using the open game content under the terms of the OGL. The OGL can be viewed on the OGL section of their official website, or the help system of this game.\nIn order to apply a set of rules designed for a pen-and-paper game to a computer game, many rules in the OGL had been adjusted or improved.","imageUrl":"https://media.rawg.io/media/screenshots/c4e/c4e4c40890111b078123579f562df2c6.jpg","releaseYear":2017,"developer":"Low Magic Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10224,"name":"A Magical High School Girl / 魔法の女子高生","genre":"Adventure","price":0.0,"description":"\"The magic beckons you.\"\nA Magical High School Girl is a magic crafting rogue-like RPG!\nThe only weapon you possess is the magic you conjure from within.\nYou can freely name your magic. The elemental properties and effects are generated automatically with what you typed in.\nDevelop the magics you obtain, gain magics from magic stones within the dungeon, and combine to develop even stronger magics.\nA high school girl lost in a magical world against a variety of unique monsters with a mysterious coven of witches. Her survival in this cruel yet alluring world all depend on your crafting skills!","imageUrl":"https://media.rawg.io/media/screenshots/c24/c246161032a9b36f4254e8d56b63c2b3.jpg","releaseYear":2016,"developer":"illuCalab","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10099,"name":"Drift Horizon Online","genre":"Action","price":0.0,"description":"Drift Horizon Online\nSingle Player Mode\n- Collect drift point and earn cash\n- Find hidden bonuses in the city\n- Get drift achievements\n- Try different physics (Tarmac & Snow)\nMain Menu & Garage\n- Buy new cars\n- Upgrade your cars\n- Buy new parts from store\n- Collect all parts in your inventory (up to 100 slots!)\n- Install or sell any part\nOnline Mode\n- Play with friends or other players over the world!\n- Explore city map with firends\n- Try to drift better than others\nGameplay\n- Nice & optimized graphics!\n- Optimized performance!\n- Realistic car sounds (Blow off, Exhaust, Backfires, Skids, etc)!\n- Realistic physics!\n- Dynamic camera movement!\n- Steering Wheels Support!\n- Fuel!\n- Tires Wear!\n- Engine Wear & Repair!","imageUrl":"https://media.rawg.io/media/screenshots/f39/f397e996b0e06dd58d3e7f46e8c8aaf7.jpg","releaseYear":2017,"developer":"Stas Tkachuk","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":9955,"name":"ConflictCraft","genre":"Strategy","price":0.0,"description":"\"ConflictCraft” is a simple strategy game set in an alternate reality where you control the battle against the armies of ISIS. Your goals are to control all points on the map, destroy all enemy bases, and defend your units and strategic resources.\nYour bases generate unit points every 10 seconds, and you can send half of the units from your bases to any position on the map.\nTo destroy your enemies, you have tanks, attack helicopters, support helicopters, jets, and rocket missiles. Forces can be upgraded, allowing for customized strategies and tactics.\nThere's local multiplayer mode with full controller support, play with your friends and compete against each other.\nYou can even create new maps with the built in level editor and challenge the community!","imageUrl":"https://media.rawg.io/media/screenshots/6a9/6a9283ae466fddee7966ae9e71796636.jpg","releaseYear":2016,"developer":"Badim","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9821,"name":"SimAirport","genre":"Strategy","price":0.0,"description":"SimAirport is a modern tycoon-style simulation & management game where you design, build, and manage an airport.\nConstruct an airport from the ground up, hire your staff, choose airlines to work with, customize flight schedules, build out your infrastructure -- baggage conveyer systems & luggage services, public access roads, fuel pipelines, runway upgrades and maintenance, aircraft navigation aids, hangars and service vehicles, etc -- and much more.Your Airport: Completely built by you... Roads, taxiways, runways\nTerminals, food courts, first class & coach queues, every detail\nControl towers, runway navaids & lighting, baggage systems, hangars, etc.Two Gameplay Modes Sandbox -- unlimited funds, no bankruptcy\nCareer -- challenge yourself & try to turn a profitFeaturesDeep Systems-Based Gameplay:  everything has purpose, nothing is purely aesthetic\nAirlines: 15+ each with unique liveries, desires & cares, and passengers\nAircraft: assortment of 14+ aircraft, twin turboprop to 4-engine turbine\nActively developed with regular ongoing updates; developers active in communityEarly AccessSimAirport is being released as an Early Access title.  The game is not yet finished and there are gameplay aspects that are missing or incomplete, and you may encounter bugs.  We plan to be in Early Access for quite a while, most likely 6-12 months or more -- there are a lot of gameplay elements that we'd like to add to the game as well as tons of additional content.\nPlease purchase ONLY if: you are excited to play the game as it is now AND you are interested in actively providing feedback & participating in the community to aid future development efforts.","imageUrl":"https://media.rawg.io/media/screenshots/8d4/8d44ca1c0738f1a52ed542253bdb9899.jpg","releaseYear":2017,"developer":"LVGameDev","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":8324,"name":"SimpleRockets","genre":"Simulation","price":0.0,"description":"CREATE\nConnect parts together to build rockets. You can choose from a variety of rocket engines, fuel tanks, and other gizmos. You can even build rovers with powered wheels.\nEXPLORE\nBlast off from any planet you want. You can fly through the intense atmosphere of Venus, or you can take advantage of the low gravity of Mercury. Whip around the sun and launch yourself out to the far reaches of the solar system.\nCHALLENGES\nSeveral challenges are built into the game so you can have fun while learning about real rocket science. Challenge yourself to orbit with the least amount of fuel, land on the moon, and so much more.\nPERSISTENT SANDBOX\nBuild space stations, moon bases, refueling stations, and more with support for multiple launches. Save your sandbox at anytime or upload it and share it with your friends.\nROCKET SCIENCE\nKepler wrote the equations 400 years ago, and SimpleRockets uses those equations to model extremely realistic orbital physics. Players will learn about rocket science and astrodynamics while they are having a blast exploring the solar system.","imageUrl":"https://media.rawg.io/media/screenshots/145/145c8ac43f27c87acf283daf76b8448b.jpeg","releaseYear":2013,"developer":"Jundroo","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":5406,"name":"Magic Orbz","genre":"Puzzle","price":0.0,"description":"Magic Orbz offers a fresh spin on classic brick-breaking gameplay, in which players bust apart a 3D environment, piece by piece.  Using realistic physics and an advanced system of object destruction, Magic Orbz features PS3™ trophy support and almost 50 levels to demolish and conquer. Smash your way through dozens of colorful and stylized levels including pirate islands amid shark-infested waters, and castles filled with noble knights and courtly ladies. Power up your paddle with special enhancements like cannons and laser attachments. Plus, powerful earthquakes that rock the whole level and fiery meteor showers that rain down from the sky make Magic Orbz a fun, action-packed and engaging experience in single, cooperative and competitive multiplayer modes. Magic Orbz is presented in stunning 1080p and its Multiplayer Online game mode supports in-game live voice communications.\n\nCreat Studios, Inc. © 2008-2009, Creat Studios, Inc. All rights reserved.\n\nTikGames, LLC. © 2008-2009, TikGames, LLC. All rights reserved.\n\nMagic Orbz is a trademark of Alawar Entertainment, Inc. Game is developed under license from Alawar Entertainment, Inc. Alawar Entertainment, Inc. © 2008 Alawar Entertainment, Inc. All rights reserved.\n\nAll trademarks, trade names and logos are the property of their respective owners.\n\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","imageUrl":"https://media.rawg.io/media/screenshots/5ab/5abb1d06dc33ec7b9e1f565c96495d2a.jpg","releaseYear":2009,"developer":"Creat Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3854,"name":"Dynasty Warriors 7","genre":"Action","price":0.0,"description":"In DYNASTY WARRIORS® 7, follow the captivating story of four Kingdoms battling for rule of China! Experience the individual tales of the Shu, Wu, Wei and the new Jin kingdoms as they shape China from the warring chaos of the Later Han period to the division of the Land into Three Kingdoms.\nPS3™ system software v3.60 or higher, HD 3D display with compatible 3D active glasses and highspeed HDMI cable (sold separately) required for 3D features.  Visit www.us.playstation.com/support/3D for details.\n1-2 players\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-2\nStereoscopic 3D compatible\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nDYNASTY WARRIORS 7 ©2011 TECMO KOEI GAMES CO., LTD. All rights reserved. Dynasty Warriors, the KOEI logo, and the TECMO KOEI logo are registered trademarks of TECMO KOEI GAMES CO., LTD.","imageUrl":"https://media.rawg.io/media/games/b46/b468ecfb53822e49aa75458227d968e4.jpg","releaseYear":2011,"developer":"Koei Tecmo","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":840827,"name":"Outbreak Island: Pendulum","genre":"Action","price":0.0,"description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1442530/Outbreak_Island/\nAbout the Game\nWelcome to Outbreak Island: Pendulum, a free version of the open-world survival simulator Outbreak Island.\nAfter a mysterious experiment, the entire population of Erlsen Island goes crazy and declares a hunt for the survivors. The authorities isolated the region from the outside world and classified the \"incident\". Now a Center for Advanced Studies in a former nature reserve is becoming a dangerous place, where ominous green radiation shines in the sky at nights.\nFace-to-face with the horrifying consequences of Project Pendulum, start your survival journey as experienced detective Howard Chapman, who secretly arrived on the island to investigate the causes of the disaster.\nSurvive\nWith nowhere to retreat, there is a whole island ahead, full of secrets and dangers. Survive by fortifying and equipping your base to ward off the attacks of the Transformed.\nCollect resources and craft useful tools, equipment, weapons - they will grant you a chance to hold out more than one night. And when the next day comes, it's time to think of a survival strategy - attack enemies or use stealth to avoid them, stock up on food or even grow your own!Explore a living open world\nThe outside world is full of threats and obstacles to overcome. Survival in conditions of limited resources can be a real challenge even for a veteran detective.\nEven nature is challenging you with thick fog, heavy rains and aggressive wild animals. And the distraught inhabitants of the island are preying on you at night!Do your own investigation\nBy being in the right place at the right time, you will be able to discover secrets of the island that are hidden for most explorers. Use your camera to collect clues and secret files that will shed light on what is happening, and put the disaster puzzle together.\nFind the underground research facility and get ready to discover the biggest secret of the island!\n📒Twitter: https://twitter.com/OutbreakIsland\n☎️Discord: discord.gg/DPC98xU","imageUrl":"https://media.rawg.io/media/screenshots/965/96589bbcf528011488e935e8c9aa5ba3.jpg","releaseYear":2022,"developer":"Tiny Magicians","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":627602,"name":"Idle Wasteland","genre":"RPG","price":0.0,"description":"Idle Wasteland is an Incremental Idle RPG in a post-apocalyptic world.\nYou stand alone in the wasteland and must fight monsters, salvage resources and refine materials to survive!\nKey features:Strength Skill - Defeat monsters, gain power, unlock new zones and hunt down bounties!Salvaging Skill - Gather a large variety of loot and discover rare salvaging spawns!Crafting Skill - Use resources gathered to refine materials, craft permanent power-ups and suit upgrades, enhance item efficiency and more!Biomagic Skill - Unlock and cast fighting and utility spells, discover unique essence to enhance your spells!Hunter Skill - Hunt 20+ munant creatures that appear during gameplay, each with their own loot table!Pet Taming - Earn and level up companions to unlock powerful bonuses!Tasks and Missions - Complete various Tasks and Missions to unlock stat enhancements!100+ Items - Find and use items to make yourself more powerful and provide helpful utilities!But Wait.. There's More! - Idle Wasteland has a plethora of content, play the game to discover much more!","imageUrl":"https://media.rawg.io/media/screenshots/831/8314e3bcda7acc77e4b356b0b0a315f2.jpg","releaseYear":-1,"developer":"Checkbox Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":615092,"name":"Out of Line","genre":"Action","price":0.0,"description":"Add Out of Line to your wishlist!\nAbout the GameCollect great memories with this artful game experience.\nFind and help new friends and yourself.\nJourney through this beautiful 2D puzzle platformer.\nExplore a unique and unfamiliar painted world with San.","imageUrl":"https://media.rawg.io/media/screenshots/18b/18b805acc96f573788fb1a53ad979b60.jpg","releaseYear":2021,"developer":"Nerd Monkeys","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":566563,"name":"Chicken Invaders Universe","genre":"Action","price":0.0,"description":"INTRODUCTION\nChicken Invaders needs no introduction.\nWell, fine, if you insist. Chicken Invaders is the most successful chicken game of this millennium (not to mention the previous one). The game puts you at the forefront of a battle against invading intergalactic chickens, bent on revenge against the human race for our oppression of Earth chickens.\nIn Chicken Invaders Universe, you assume the role of a new recruit in the United Hero Force (UHF), mankind's last hope against the fowl Henpire. You start your UHF career deployed in some backwater galactic star system, and it's up to you to advance through UHF ranks and earn your place in the honorary annals of Heroes Academy. Travel across the galaxy, explore strange new worlds, seek out new life and new civilizations, and exterminate any Henpire forces that cross your path. And do so in style.NEW IN THIS GAME\n1,000+ star systems to explore\n20,000+ missions to fly\nChoose from 15 unique mission types\nParticipate in competitive challenge missions delivered to your inbox daily\nBuy, sell, and upgrade your equipment\nJoin squadrons with your fellow UHF recruits\nComprehensive leaderboards and rankings\nFully customizable fleet of spacecraft FEATURES\nFinger-blistering shooting action with over 200 chickens on-screen simultaneously\nGigantic boss fights\nDiscover 15 awesome weapons, each upgradeable to 11 levels (plus a secret 12th!)\nCollect 30 unique bonuses and 40 medals on your way to glory\nBreathtaking graphics and original orchestral soundtrack","imageUrl":"https://media.rawg.io/media/screenshots/a47/a47517dec980170cee8d2f7c7d950eef.jpg","releaseYear":2021,"developer":"InterAction studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":513062,"name":"Witches x Warlocks","genre":"Simulation","price":0.0,"description":"Witches x Warlocks is a cute and light-hearted Halloween Raising Sim; featuring a customizable protagonist and 4 love interests of different genders!\nWitches x Warlocks will be available as a free version with 3 love interests (male, female, nonbinary).\nThe DLC will contain additional illustrations and one additional romance route.\nSeven days until Halloween!\nSeven days until the final exams!\nSeven days until Fay Nightshade gets booted out of school for being the only witch unable to cast a single spell.\nTake control of Fay and help them cram a semester's worth of studying in the last week before the exams!\nHow many spells can you learn? And will you manage to find Fay a date for the Halloween festivities afterwards?\n♦  Customizable protagonist (hair colour, skin colour)\n♦  Custom name & pronoun\n♦  4 romantic interests (2 male, 1 female, 1 nonbinary)\n♦  28 spells / scenes to unlock\n♦  Partial VA\n♦  6 endings\n♦  Around 1 hour per playthrough","imageUrl":"https://media.rawg.io/media/screenshots/a8b/a8b75c188572bc0ee2499c258f93d11a.jpg","releaseYear":2020,"developer":"Nifty Visuals","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":328676,"name":"No Straight Roads","genre":"Action","price":0.0,"description":"Fight the massive EDM empire as an indie rock band in our unique PC & PS4 action game! Directed by Wan Hazmer, lead game designer of Final Fantasy XV, and Daim Dziauddin, concept artist of Street Fighter V, No Straight Roads was made with the intention of elevating the role of audio in game design without turning it into a rhythm game, and using strong visuals to tell a story of music cultures and ideals.","imageUrl":"https://media.rawg.io/media/screenshots/0e8/0e86c1f3a1dc83096bbc2c70b6234a75.jpg","releaseYear":2020,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":281853,"name":"Ib","genre":"Adventure","price":0.0,"description":"Ib (pronounced Ee-b; a phonetic translation of Eve) is a free-ware Japanese horror adventure video game that was developed by kouri using RPG Maker 2000. It was released on February, 2012. It was translated into English by vgperson.\n\nA young girl named Ib visits an art gallery with her parents.\nWhile observing the many exhibits, she suddenly realizes she is alone.\nAnd in her search for others, she finds things awry in the gallery...\n\nThe game is focused on exploration and puzzle-solving. There are no battles, and it does not demand quick reflexes. It's designed to be accessible to all kinds of players, so enjoy.","imageUrl":"https://media.rawg.io/media/screenshots/02f/02f82d645e35a0f7f7e34fa843081b01.jpg","releaseYear":2012,"developer":"kouri","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":274783,"name":"Hentai Mosaique Puzzle","genre":"Casual","price":0.0,"description":"Dive into the magical eye candish world of Mosaique Puzzle!\nMosaique Puzzle is an undressing game with 4 girls. Match the pieces and unlock new stages, each with less clothing\nChallange yourself and try to finish each of 12 puzzles with as little clicks as possible, or just chill, do whatever you like, get the highest level, you are the boss.\nHentai Mosaique Puzzle is a relaxing clicker! It is super easy to get into! No need to head bang over super complex visual puzzles and bore yourself to death... Every puzzle is a scrambled mosaique and pieces just snap together perfectly\nFeatures:\n- Navigation that enables close ups\n- Each stage gets more challenging\n- Don't ever get stuck! Use the sneak peak ability to uncover the missing pieces! Refill your ability by clicking.\n- Optionally hide all the menus and just focus on the puzzle\n- Customize your settings, sound, navigation speed and such","imageUrl":"https://media.rawg.io/media/screenshots/a50/a507f336062e069f9acd1fc6a0f016fb.jpg","releaseYear":2018,"developer":"Lil Hentai Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":236833,"name":"LoveChoice","genre":"RPG","price":0.0,"description":"Early Beta AccessLoveChoice is designed to be consist of multiple independent stories. However, for now, we only completed one of them.\nPlay through this story once will likely take 15 minutes. Most of our testers played the same story 2-3 times. So the total playtime of our game will be like 30~40 minutes.\nWe do think it will be a short but meaningful experience for you. However, if you don't feel satisfied with it. Because of the game' short playtime, you can still get your money back after playing through our game under the policy of STEAM.\nAbout the GameLoveChoice is a Japanese-AVG-like game, which we try very hard to make every choice in our stories will be meaningful and reasonable. Every choice can make a difference in this game and leads to different endings.FEATURE:· Meaningful Multiple-ending Stories\n· Lovely Art\n· 6 Original BGMs\n· Translations are all done by the main designer. NOT MACHINE!\n· Collectable Cute Wallpapers\n· We will create more stories and all the stories will be updated for FREE!\n· This game will make you surprise in a way.Our Team· EC:\nThe main artist, and participle in design too.\n· Zhao:\nArtist, provide the arts of ending scenes.\n· MIDIPanda:\nProvide most of the music.\n· Heng:\nDo the rest of this game and writing this...","imageUrl":"https://media.rawg.io/media/screenshots/a25/a256c27f189770baf8d32addd90ff809.jpg","releaseYear":2018,"developer":"Akaba Studio","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":65205,"name":"Death Crown","genre":"Action","price":0.0,"description":"The Story\nAt the end of the millennial war, when all the cemeteries were overcrowded with the bodies of the dead warriors, came the one who was called The King. Thanks to his unyielding will, King managed to subdue and unite all the lands. The Kingdom appeared, and the era of the Human began.\nThe King ruled wisely and fairly, but his time on this land ran out: Death came after him. But the will of the King was so strong that he could deny Death.\nHe was so proud that he humiliated Death itself. The idea of the overwhelming power and immortality didn't leave his mind. The King realized that power over the living was not enough for him.\nThe King decided to get the powerful artefact known as the Death Crown. Thus begins the War of the Death Crown.About\nDeath Crown is a dynamic strategy game with local multiplayer, easy controls with retro 1-bit visual style.\nYou need to destroy the stronghold of the enemy, before your enemy will destroy yours. Correctly chosen strategy determines the winner of the battle.Features:\nFast battles (5 min or less)\nEasy gamepad control\nEasy to learn\nReplayability\nDesign without words\nClassic retro art","imageUrl":"https://media.rawg.io/media/games/1dc/1dc2e3ec0318f039ffe0021576755334.jpg","releaseYear":2019,"developer":"CO5MONAUT","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":65019,"name":"Where Time Stood Still","genre":"Action","price":0.0,"description":"Your plane has ditched on a mountain plateau somewhere in deepest Tibet. You and your companions are alive, but recovery from the impact is short lived; a large shape is moving towards you. As it gets closer you rub your eyes in disbelief: a Dinosaur! Where are you?... and when? Now learn to survive in a world untouched by modern life; a world frozen in time.\nStunning graphics and startling action in this thrilling innovative game.\nHazards to be faced include the aforementioned dinosaurs and cavemen, as well as sea monsters, precarious mountainous ledges and dilapidated bridges. Objects including weapons and first aid kits can be collected. Each character has his own distinct behaviors - one becomes hungry easily, while another is only really competent while his fiancée survives. Although the ultimate aim is to save all four characters, you can continue while at least one is alive.","imageUrl":"https://media.rawg.io/media/screenshots/e82/e829d9446d3df9a322ba143efe5d8caf.jpg","releaseYear":2018,"developer":"Ocean Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":64253,"name":"Psychiatrist Simulator","genre":"Simulation","price":0.0,"description":"Have you ever wanted to be a psychiatrist? Now you can! Be a shrink for 14 days. Meet 14 patients with unique stories of their lives. Help them with their problems, give them medication, say good word to them or lock them in mental hospital. The choice is yours. Diagnosis, treatment, chosen dialogues have impact on history of patients, so make your choices wisely. There are three patients each day, so there are total 42 visits. Nearly 5 hours of possible dialogues with unique characters. Patients have animated faces that express their emotions.\nWant to see Lukas Eathrabari nightmares in game? Play Nightmare Simulator.\nNo more text-to-speech - 5 patients have dubbing!\nLukas Eathrabari has professional dubbing made by Mr. Jacobs (Youtube: English teacher plays).\nAnna Abrahimovic has dubbing made by LunaPodcast ASMR kitty\nIvan arash has dubbing made by Pika Pika piekar666soad\nMathew Blaze has dubbing made by mikewoodsays\nEric Harris has dubbing made by Dayton Does Gameplay\nI am searching for volunteers who would like to do dubbing for other characters. Contact: s8cusyqr@gmail.com","imageUrl":"https://media.rawg.io/media/screenshots/70f/70fe628a896adbf98bec189d367e7f74.jpg","releaseYear":2018,"developer":"Eathrabaria","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":63683,"name":"StrikeForce Kitty","genre":"Casual","price":0.0,"description":"Parodic platformer with RPG elements, Deceptively Simple, Insanely Fun! You will lead a squad of four brave kittens, whose task is to save the princess from the clutches of the cunning king of foxes!\nThe game's main feature is the suits that you receives for victories over the foxes.  The suits make the characters stronger and give them abilities that open new ways of completing the levels. Each suit is a reference to pop culture: movies, games, comics, anime, cartoons.  In addition, you can pump the cats up by training them in the gym, making them stronger, faster and more resilient.\nEach level is about finding the optimal path. With new abilities, you can discover new ways of completing the level and find rarer suits. Searching for these paths often becomes a puzzle of its own.\nFeatures:\n•\tOver 350 Costumes for your kittens!\n•\tOver 30 Artifacts! Reincarnate your kittens with super costumes!\n•\tA lot of Big Bosses!\n•\tEntangled levels with the search for the ideal path.\n•\tOver 100 teams with special skills!\n•\t12 unique passive and active!\n•\tArts, music, animations give you many hours of fun!","imageUrl":"https://media.rawg.io/media/screenshots/8b5/8b5188d7d79dba62f0fed526e7550d1b.jpg","releaseYear":2018,"developer":"Deqaf Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Web"}]},{"id":62456,"name":"Google Spotlight Stories: Back to the Moon","genre":"Adventure","price":0.0,"description":"Back to the Moon\na celebration of Georges Méliès\nA charming illusionist, an adventurous queen of hearts and an evil green man journey through early cinema, film magic and love. Back to the Moon VR is an animated, interactive short celebrating the artistry of French film director and magician Georges Méliès. Directed by Fx Goby and Hélène Leroux. Produced by Nexus Studios.","imageUrl":"https://media.rawg.io/media/screenshots/b2e/b2e3d86dc5210f00924c1c3175556115.jpg","releaseYear":2018,"developer":"Google","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61469,"name":"Idle Heist","genre":"Action","price":0.0,"description":"Welcome to the deep vaults within the world of Idle Heist.\nYour goal is to take as much money from the vault before you are caught!\nHire and upgrade your crew in order to help you earn money faster. Utilise your crew's abilities for maximum earnings while online.\nThe concept is simple... Just Click!\nStart by earning $1 per click and work your way up through upgrades and skills to potentially TRILLIONS and more dollars per click!\nThis is the perfect game to play when you don't want to pay 100% attention or want to do something else in the meantime.\nFeatures: Upgrades\nUnique Visuals\nA unique animated world to get lost in\n25+ Different crew members to hire.\nWeapon and Vehicle Skins\nHire over 25 different crew members to aid you in your quest to beat the system and loot all of the money from the grand vault. Each crew member is unique and will provide a different amount of help depending on their level. Upgrade your crew members for maximum profits.\nYour crew will continue the heist even while you are away! They will deposit what they have taken from the vault into your account whenever you return! The higher your crew's skills, the more you will earn while offline. Increase your offline multiplier by buying your crew members custom masks which will help them to be more undercover whilst you are away. This is the ultimate cover-up while you are away from the game!","imageUrl":"https://media.rawg.io/media/screenshots/b71/b716caf015c77a5868dc675b0e34d3ec.jpg","releaseYear":2018,"developer":"ChimpLabs","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":61048,"name":"Rocket of Whispers: Prologue","genre":"Adventure","price":0.0,"description":"Rocket of Whispers: Prologue is a short narrative game with a very short playtime.\nIt takes place before the main game, OPUS: Rocket of Whispers, and tells the story of Fei Lin’s first waking moments.Story\n“Fei... Have you awakened?”\nWhen I awoke, I was all alone.\nThe familiar scenery around me, were in ruins.\nIn a chilling cellar below the apocalyptic snow, Fei Lin the witch wakes up from hibernation, and ventures into the forsaken world. Guide her through the process of escaping the cellar, and seeing the changed world for her first time.\n“If you awaken to a world in ruin, please... return us...” - Church Elder\nWith an important mission and the hopes of the people resting on her shoulders, Fei Lin takes her first steps into a lonely, empty world that has been forgotten by time itself.Game Features\nExplore Fei Lin’s origin\nEscape the cellar!\nA hauntingly beautiful world\nAn audiovisual marvel\n==========================================\n※ This is a free mini companion piece for OPUS: Rocket of Whispers, created for our fans.","imageUrl":"https://media.rawg.io/media/screenshots/77b/77be89a094db0a4f6952ea31995d5a67.jpg","releaseYear":2018,"developer":"SIGONO","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":60515,"name":"Wintermoor Tactics Club","genre":"Adventure","price":0.0,"description":"A light Tactics RPG inspired by Final Fantasy Tactics and Steven Universe. Fight for survival in thrilling tactical combat!  Unravel the sinister mysteries behind the bizarre tournament!  And don't forget to make some new friends.\nIt was hard enough for Alicia to make friends at prestigious Wintermoor Academy before the whole school erupted into a snowball tournament!  Now, her tiny Tactics Club must transform from nerdy nobodies into the heroes they play in their tabletop campaign, or they'll be disbanded forever.FeaturesTactical Combat: Play Curses & Catacombs, the premier roleplaying game of 1981.\nExplore the School: Make friends and solve mysteries in an evolving environment.\nMeet the Clubs: Young Monarchists. Psychic Detectives. Your opponents burn with conviction and uncanny snowball prowess.","imageUrl":"https://media.rawg.io/media/screenshots/609/609c2e97cb7b0a6a713480867ac1b5fc.jpg","releaseYear":2020,"developer":"EVC","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":59999,"name":"My Free Farm 2","genre":"Adventure","price":0.0,"description":"Experience a Unique Farm Game\nYour ambition got the best of you: This little plot of land can be shaped up into a thriving farm – you just knew it the first moment you set foot on it. In this entertaining building game, you can be a successful online farmer. You've set lofty goals for yourself: A flourishing farm with its own gastronomic business and extensive productions. Better get started! A wonderful farm simulation full of limitless opportunities awaits you!\nAn Extraordinary Farm Game – Organize, Structure, Invest\nOrganize and structure your farm, expand your animal stock, process plant and animal products into sought-after goods for your virtual customers, increase your profits and invest them in the continuous expansion of your farm. Over the course of the game, you'll be able to try your hand at a wide variety of exciting farm game challenges and experience fantastic features:\nSeasonal events\nRegular updates and patches\nCustomizable farm design\nFriendship features\nExpansive quests\nAnimal agriculture with cows, pigs, chickens, goats, and more!\nSowing and harvesting of cereals, fruits, vegetables and other farm simulation crops\nProcessing of plant and animal products\nColorful 3D cartoon setting\nIntuitive controls\nLong-lasting tycoon fun\nNew challenges\nDay and Night on the Farm\nNighttime adds another riveting component to the farm simulation. Certain crops such as mushrooms can only be grown at night.\nA beautiful riverside bistro is another intriguing aspect of the game – serve customers with home-cooked meals made from  your farm's produce. The possibilities are endless in this captivating farm game!\nDownload and Get Started\nStart your farming career! Prove your strategic talent in this thrilling farm game – grow and sell crops, keep animals, increase your profits and design your property in the farm simulation. Let's go!\nMy Free Farm 2 can only be played online. You can link My Free Farm 2 app accounts to your Steam account.","imageUrl":"https://media.rawg.io/media/screenshots/901/9015e27722d05484a675edf9fae23542.jpg","releaseYear":2018,"developer":"Upjers","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":50923,"name":"Uptasia","genre":"Casual","price":0.0,"description":"Build factories, expand your production lines, conduct trade and build your own economic empire in the 19th century. Experience this fascinating epoch. Uptasia provides an extraordinary mix of tycoon and hidden object game. Explore the age of industrialization and master exciting hidden object games by finding items and differences in detailed pictures. Put your keen eyes to the test and prove your skill. Create your own town. Play for free now!\nI Spy with my Little Eye\nThe villa is the central building for all hidden object game challenges. Here, you'll find a wide variety of scenes to check out. Find the required items and click on them. The faster and more accurate you are, the more points you'll get. Solve brainy riddles and build your own business empire. Fantastic features await you. These include:\nEntertaining Magic Tower events with plenty of different themes\nRegular updates and new hidden object games\nSeasonal events and promotions\nEngaging social guild features\nVirtual friendship system\nVisually appealing design with countless customization options\nCaptivating hidden object game and tycoon concept\nBuild, Expand, Produce\nAs you progress through the game, you'll be met with more opportunities to open new factories and produce a broad array of goods. Production sites – and thus settings for hidden object games – ranges from a drug store and instrument maker over a leather factory and ship yard to the animal shelter and glassblower. The products you can make are just as diverse – perfumes, sinks, padlocks, gramophones, pain pills, and artistic masterpieces.\nQuick and Precise\nSolve hidden object puzzles that get more and more tricky. Find the required items within the 60-second time limit and be as accurate as you can when clicking – because if you miss or go over the time limit, you'll lose out on valuable points. Discover and explore the fascinating world of hidden object games!\nExperience the manifold possibilities! A tycoon game like no other, this game lets you both build and actively play games to get ahead.\nA stable internet connection is required to play Uptasia. Browser game accounts for the game of the same name cannot be linked to the Steam version.","imageUrl":"https://media.rawg.io/media/screenshots/96c/96cfd169deb05d0d45b215cb069b940c.jpg","releaseYear":2018,"developer":"Upjers","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":49252,"name":"Google Spotlight Stories: Son of Jaguar","genre":"Adventure","price":0.0,"description":"Emmy Award-winning platform, Google Spotlight Stories, presents Son of Jaguar VR. In the most important match of his life, the once mighty masked luchador, Son of Jaguar, faces his legacy, his family, and what it means to be a part of something bigger than himself.\nDirected by Jorge Gutierrez, creator and director The Book of Life.\nProduced by Google Spotlight Stories with Reel FX","imageUrl":"https://media.rawg.io/media/screenshots/058/058cd0bb1ed6ca0149d6183c037f2ac6.jpg","releaseYear":2017,"developer":"Google","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44759,"name":"Dragon Lords 3D","genre":"Strategy","price":0.0,"description":"Dragon Lords is a massively online PvP strategy game. It's set in a fantasy world inhabited by dragons, elves and other magical creatures as well as steampunk-tech monsters.\nBuild a fearsome castle, gather an indomitable army of elves and dwarves, recruit legendary heroes, use the magic of nature and the crushing power of dragons to make battles go your way. Prove that you are a wise commander, unite with friends into an unbreakable guild and become stronger together. Only the greatest have a chance to win!\nWe got:\n* Fantasy setting with dragons, elves, dwarves mixed with steampunk stuff on the higher level\n* MMO Strategy with guild wars and singleplayer campaign\n* All running full 3D, with HD textures and great FX\n* More than 20 units and heroes to combine and use in online PVP and 80 campaign missions\n* Cross platform everywhere (iOS, Android, Amazon, Facebook Gameroom and soon Windows Store)","imageUrl":"https://media.rawg.io/media/screenshots/349/3499a70101576a839c6801482412d221.jpg","releaseYear":2017,"developer":"FX Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":44675,"name":"Bang! Howdy","genre":"Strategy","price":0.0,"description":"Bang! Howdy is an online strategy game. The setting mixes elements from a variety of related genres, such as steampunk or Native American myth. Several of the players' available units are entirely mechanical, including artillery and a \"steam gunman\", a robot boasting large wagon wheels for movement while wearing a cowboy hat. Other, more conventional units include cavalry and gunslingers.","imageUrl":"https://media.rawg.io/media/screenshots/a77/a77ffe3c50b7b2d267236bd972d0dc78.jpg","releaseYear":2017,"developer":"Grey Havens","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":43875,"name":"Homeworld: Emergence","genre":"Desconocido","price":0.0,"description":"Homeworld: Emergence was originally released as \"Homeworld: Cataclysm\". \"Cataclysm\" is now a registered trademark of Blizzard Entertainment, Inc., and the game has been renamed to avoid confusion. Other than the subtitle change, the game is identical to the game released in 2000.\n15 years ago, we were awakened from the cryo-trays. We had survived the journey to Hilgara, our lost homeworld. Then they told us that the plant we left behind had been destroyed. Our families... friends... everyone not on the mothership - killed. Destroyed by an enemy we never knew.\nWe realized there was nothing for us on Hilgara. No property, no rights, no future for the \"Sleepers\". So we returned to the stars, fully awake this time, to work and rebuild our lives.\nIt is ironic, then, that we are the ones to discover an alien capable of exterminating all life in the galaxy. And only we are in a position to destroy it.\nFifteen years after returning to their homeworld, a Hilgaran sect unwittingly releases an alien horror. Now it's up to you to commandeer the Kuun-Lan, a Hilgaran mining vessel, and transform it into a combat-ready mothership. Build and control a fleet of ships, research technologies, and harvest resources while you search for a way to eradicate the alien threat before it is too late.\nNew Ships & technologies - 18 individual new ships with unique unit stats and capabilities plus 25 new technologies to research.\nEnhanced Fleet Management - Time compression hastens travel and resource gathering. Fog-of-war and waypoints improve navigation. An upgradeable and moveable mothership improves gameplay.\nFull-Length Campaign & Multiplayer - 17 new singleplayer missions or play through LAN with up to 8 others.","imageUrl":"https://media.rawg.io/media/screenshots/912/9122c3ee05e9da75bc249c4fb126b2a5.jpg","releaseYear":2000,"developer":"Gearbox Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]