[{"id":42997,"name":"Lambda Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/113/113d1bb49badfbee359609282343ccde.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Vortal Storm","platforms":[{"id":0,"name":"PC"}]},{"id":3820,"name":"Gran Turismo 6","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d9/0d9d8b49fd76d9ea437f0d52fc2c31a4.jpg","description":"Your Legacy Begins Here\n- Unlock your racing passion with 1200 cars on more than 100 circuit layouts\n- Drive future automotive designed vehicles with Vision Gran Turismo*\n- Access and create online events with web based enabled devices\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\n\"Gran Turismo\" and \"Gran Turismo The Real Driving Simulator\" are registered trademarks of Sony Computer Entertainment Inc. ©2013 Sony Computer Entertainment Inc. Developed by Polyphony Digital Inc. \"Polyphony Digital” logo is a registered trademark of Sony Computer Entertainment Inc. Manufacturers, cars, names, brands and associated imagery featured in this game in some cases include trademarks and/or copyrighted materials of their respective owners. Any depiction or recreation of real world locations, entities, businesses, or organizations is not intended to be or imply any sponsorship or endorsement of this game by such party or parties.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":648,"name":"I Expect You To Die","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ed/1eda623ed162d69ca96ae926d08f1ce6.jpg","description":"** AGENT, YOUR EXPLOSIVE, FINAL MISSION 'OPERATION: DEATH ENGINE' IS NOW AVAILABLE **\n​​I Expect You To Die is a virtual reality puzzle game that places you in the well-polished shoes of an elite secret agent. You must attempt to survive deadly situations in immersive and dangerous locales. Complete each operation using problem-solving skills and wits… oh, and the power of telekinesis that all our agents are equipped with. Use it and whatever resources you can find to escape each situation... or die trying.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Schell Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":763608,"name":"Stacklands","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35e/35e72a4d7e9be35051f5e1df77edce75.jpg","description":"Stacklands is a village builder where you stack cards to collect food, build structures, and fight creatures.\nFor example, dragging a 'Villager' card on top of a 'Berry Bush' card will spawn 'Berry' cards which the villagers can eat to survive!\nSell Cards 💰\nYou can also sell cards to get coins which you can then use to buy Card Packs. Packs contains multiple cards that you can use to expand your village. Every pack has a focus such as Cooking, Farming or Building.\nAt the end of every Moon you'll need to feed all your villagers - so make sure you have enough food, or your villagers will starve! 💀\nFeatures 🔥\n🃏 100+ Cards to collect\n💡 25+ Ideas to find\n✅ 50+ Quests to complete\n📦 7 different Card Packs to buy\n🕒 3-5 hours of playtime\nCombat 🗡️\nA Villager bumping into an evil creature will engage in an automatic battle. Fight Goblins, Bears, Rats and more! Improve your Villager's combat abilities by giving them weapons or by making them team up against enemies.\nFind Ideas 🧠\nExpand your knowledge by finding Idea Cards. An Idea Card will tell you how to create new cards, for example: stack 2 Wood, 1 Stone and 1 Villager to build a House.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sokpop Collective","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":59261,"name":"Vigor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbe/bbec05fb0c57c24c92dbe09699d4968d.jpg","description":"This game is a work in progress. It may or may not change over time or release as a final product. Purchase only if you are comfortable with the current state of the unfinished game.\nWhat if humanity falls? 1991. The nuclear war is over. Central Europe is devastated, Norway has become the last stand. You start as a nameless outlander, but who will you become? No time for uncertainty. Turn a shelter into your home. Fight, run or hide. Take risks, claim rewards. Survive this cut-throat experience.\nVigor is an upcoming free-to-play shoot 'n loot game where you must survive cut-throat encounters to build your very own Shelter amid post-war Norway, 1991.\n* Survive cut-throat encounters for 8-16 players\n* Claim precious resources and valuable rewards\n* Improve your safe shelter and vital equipment\n* Become the courageous Outlander in post-war Norway\nThe Vigor Founder’s Pack will be available exclusively during the Xbox Game Preview for $ 19.99 / € 19.99 and will come with several bonus rewards:\n* Unlimited access to the game during the Xbox Game Preview phase;\n* Exclusive cosmetic items (a particular Outlander outfit including the iconic Vigor shirt, a trucker cap, and the “dusting” hand gesture);\n* 1400 Crowns, with a value of more than double the price of the Founder’s Pack (can be used to buy new cosmetic items once Vigor’s in-game store is added to the game at a later date);\nPlease note that each of these items will be shipped to your character at separate times during the Xbox Game Preview period (not all together at once).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":7695,"name":"Spoiler Alert","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/384/3841af071978d6b9bde14951cf5da846.jpeg","description":"Spoiler Alert is a video game that tests your platforming skills… in reverse. It’s a comedy platformer that you play backwards.\nWhen you pick this game up, it has already been beaten. The big bad boss is defeated, the coins are collected and the princess has been rescued. Why, oh why?\nUnraveling this mystery takes you through the entire game, from the last level to the first. You must uncollect the coins, revive the enemies and avoid nasty time paradoxes. In other words, you must uncomplete the game by playing it backwards.\nEverything in this game is so familiar, yet so different and new. You have played it a thousand times before, and at the same time, you have never tried anything like it.\n100 Levels in 4 worlds\nSpeedRuner Mode\nStart playing at the end and make your way back\nClassic platformer gameplay mashed with simple controls\nBeautiful handdrawn graphics\nOriginal soundtrack by Roland La Goy\nEpic boss fights, upgrades and many different and unique enemiesThe Steam-exclusive Collector's Edition version includesLevel editor with Steam Workshop\nThe original soundtrack, including a new bonus track and deleted tracks\nThe original Game Jam version of Spoiler Alert - see how it all began\nExclusive hi-res desktop art and concept art\nScreensavers, deleted graphics, and more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"tinyBuild","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":402508,"name":"Lake","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/39c/39cf070df0b9fc65e49db51a47025629.jpg","description":"It's September 1, 1986. You take on the role of forty-something Meredith Weiss, who returns from the big city to her quiet hometown. She exchanges her busy career at a software company to fill in for her dad, the local mail carrier.\n\nDuring her two-week stay in beautiful Providence Oaks, Oregon, she runs into a few familiar faces as well as plenty of new folk. As Meredith, you get to decide who to talk to, who to befriend and perhaps even start a romantic relationship with.\n\nWhatever happens, at the end of her stint she'll have to make up her mind: return to her demanding job in the big city, or stay in the town she grew up in?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Gamious","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":28533,"name":"Dead Rising 2: CASE ZERO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/089/089e5b789ee3edeafb35385f7482e862.jpg","description":"Get a taste of what Dead Rising 2 has to offer in this full-featured prologue! Chuck Greene and his daughter Katey have barely escaped the Las Vegas zombie outbreak with their lives. They arrive in the lonely desert town of Still Creek looking for some rest, but unfortunately there is no rest to be had as this sleepy town has become overrun with zombies. Chuck must kill zombies, rescue survivors and escape from the zombie nightmare that is Still Creek before time runs out. Any PP, clothing, and Combo Cards gained in CASE ZERO will carry over into your Dead Rising 2 game! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Blue Castle Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":19407,"name":"Wargame: Airland Battle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08f/08f861f3999fd86336a7917d6947c9a5.jpg","description":"2 SIDES, 12 NATIONS, 750 UNITS: THE STRATEGY GAME REFERENCE IS BACK!\nRicher, more beautiful and more accessible, Wargame AirLand Battle is the sequel to the explosive real-time strategy game Wargame European Escalation!\n1985. After several months of tension between NATO and the Warsaw Pact, an incident in the North Sea suddenly sets the world on fire, starting an all-out war.\nCommand the entire military resources of the period, and plunge into the heart of a new dynamic campaign! With the arrival of air forces, select from a phenomenal array of 750 units (including tanks, planes, helicopters, and infantry) to build your army. Engage in spectacular battles with unmatched strategic depth, on huge battlefields as large as 150km², powered by a new graphics engine.\nImpressive in solo play, Wargame AirLand Battle is even more engaging online. The game features ultra-complete multiplayer modes, where up to 20 players do battle simultaneously!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Eugen Systems","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17339,"name":"Tea Party Simulator 2015","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d0/9d00cd5ebbc4ffb3ea8aa1d7ffc3dc66.jpg","description":"Ever wanted to be a tea party extraordinaire? Well now you can.\nBrew the tea, pour the tea, serve the tea.\nServe biscuits and cake.\nTry not to mess it up too bad, or your guest will get angry\nFind the hidden easter eggs\nYou know... all that good tea party stuff\nEach new level brings it's own challenges you must overcome on your quest to become the ultimate tea party master.\nComes with the original Tea Party Mode and now a Mode 2 (after beating all the levels), for a whole new tea experience!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Power Up to Maximum","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17248,"name":"See No Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42a/42a234cf0a0eeb70cab2174475e8e9da.jpg","description":"See No Evil is a dark, isometric puzzle game about sound manipulation. A harsh fantasy where the willingly blind are hostile to the nonconformist. Sometimes, the world seems darker with your eyes open.\nBecome a Seer and explore the beautiful, mind bending, twisted fantasy that is the world around you. Guided only by a journal left in your decaying prison, and opposed by an army of those afraid of what they don't understand, you seek to learn why the world went dark.\n\"Noetic spared no expense when it comes to great ambience, FX, and scoring.\"- Indie Game Magazine\n\"See No Evil is a simple, pretty puzzle game for people who find beauty in strange things.\" -indielove\n\"It is both pleasing and exciting to see gaming evolve as an art-form. To take a game and make it not only deliver a story, but also highlight key aspects of life and tackle some of humanity’s flaws without compromising in gameplay, takes a great deal of skill\" -in2gpu","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gabriel Priske","platforms":[{"id":0,"name":"PC"}]},{"id":17202,"name":"Cataegis: The White Wind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a92/a92e331e7f290ba5dd79f88a1cec5581.jpg","description":"Welcome to Cataegis - The White Wind: Ziggurat Chapter, a frantic 2D arcade action retro-style game that pays homage to the glory days of 8-bit side scrolling gaming.\nPlaying as Cataegis, enforcer for the ‘Order of Caeliger’, take on the self-proclaimed deity ‘Ishtar’ and her followers in war for the future of Earth.  With a combination of agile movements and an arsenal of weapons at your disposal (including double jumps, sliding and dual wielding weapons), face your foes toe to toe and battle your way to victory!\nKey features:\nClassic old school side-scrolling gameplay\nExciting Retro soundtrack\nFast and fluid gameplay with a myriad of techniques and varied weapons;\nGorgeous pixel art cinematics\nUnlock art and background information on the game\nAn engaging storyline\nOver 20 endings available based on the choices you make in the game","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Acido Cinza","platforms":[{"id":0,"name":"PC"}]},{"id":16563,"name":"Prime World: Defenders","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/185/185c23bb122968ab9b814acd06e596d6.jpg","description":"Just UpdatedNival officially announces that long awaited sequel of Prime World: Defenders is now available on iOS and Android!\nPrime World: Defenders 2 - new TD strategy game in the legendary Prime World series with unique combination of the tower defense and collectible card game!\nEnter a mysterious and magic land stricken by a cataclysm and now thriving with powerful artifacts and immense treasure guarded by furious monster hordes. Build up your defense and fight against the waves of evil with magic and tower power! Let the world knows who is the real TD master here!Key features:Collect all 40 unique towers and 20 deadly magic spells - the ultimate TD arsenal;\nCustomize your tower and spell collection with powerful Runes;\nUse your defenses to crush Underground, Intelligent, Swarming, Exploding, Phantom and 20 other monster types and 29 unique bosses!\nPlay the game the way you like - find the unique combination of tower and magic arsenal to build the superior defense!\nFight with other players to pump up your tower collection into monster-slaughtering war ma-chines!\nUsed to good weather? Test your defense with survival night levels filled with tornado and storm power challenges!\nDifferent TD game modes - Hunt, Raid and Assault levels and the rule-them-all Hard mode for truly tower defense fans!\nTry it today!\nPlay Defenders 2 on iOS\nPlay Defenders 2 on Android\nAbout the GameFight off hordes of monstrous mutants created from a strange cataclysmic event in the new tower defense game, Prime World: Defenders. Join a group of exile treasure hunters who have ventured into the capital of an ancient empire, vast with mystery and danger.\nPrime World: Defenders merges classic tower defense gameplay with collectible card mechanic. Your towers, your spells, your traps - all are magic cards, that you can collect and upgrade. You'll have to develop your own strategy, because you'll get your random set of cards after each battle.\nFreeze, burn, poison, explode and slash countless enemies that will try to stop you from gathering artifacts of old kingdom. Choose your cards carefully, play them strategically and expect some heavy resistance along the way – from small and almost harmless mutated fungi to powerful giant goblins and nagas.\nDid we mention? In addition to story-driven single-player campaign Prime World: Defenders has randomly generated missions, newly added endless mode and New Game Plus!Key FeaturesA mix of tower defense strategy with collectible card mechanics!\nNo micro-transactions or additional payments!\nRandom cards drop means different strategy for every player!\nSeveral game modes, including heroic mode and two special endless maps!\nUpgrade and mix cards for maximum destruction!\nCustom deck lets you pick perfect cards for each mission!\nPerk system for your hero!\nStory-based campaign with 23 missions!\nMission generator offers infinite replayability!\nEnemy buildings in game heal and buff attacking creeps!\n24 towers, each with up to 25 upgrades!\n13 magic spells that can be upgraded too!\n38 types of enemies!\nBosses, mini-bosses and huge bosses.\nFlying battleship!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nival Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":15923,"name":"Zup!","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/881/881311283e8b912535100b8cd0af9584.jpg","description":"Minimal physical puzzle with explosions\n▪ 40+ Levels\n▪ 110+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic: bensound.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":11814,"name":"NEO Scavenger","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/327/327e3b77e7a89ce5b6da47fb9c4588cd.jpg","description":"NEO Scavenger is a game where you must survive in the wasteland long enough to figure out who you are. Each turn, you must decide where to go, how to scavenge for supplies, and how to deal with anything and anyone you encounter. And with each passing minute, the pit in your stomach grows, your dehydration worsens, your muscles tire, and your body temperature drops in the cold autumn air. Choose your starting abilities carefully, because they and your wit are the only tools you have in the apocalypse!FeaturesUnique Setting - Near-future, post-apocalyptic Michigan with local cryptids and folklore. And something else beneath the surface...\nTurn-Based Play - Take your time with each turn, and play at your own pace. Save and quit when you want, and resume later.\nPermadeath - If you die, that's it. NEO Scavenger is balanced around a single difficulty level: permadeath. Your save will be deleted if you die. So choose every action carefully!\nNo Grinding - There is no XP in NEO Scavenger. No levelling-up. Instead, progress comes from learning how to play the game better, and using your strengths to your advantage.\nSemi-Random - Much of the map is randomized each game, including the location of ruins, creatures, weather, and certain quest branches.\nSandbox or Story - Search for clues to your identity, what happened, and who's hunting you. Or simply test your mettle against man and nature alike. Play how you want!\nAbilities and Flaws - Choose abilities and flaws each time you play. Different combos unlock different abilities and quest branches.\nCrafting - Extensive crafting system which allows for substitutions of similar items. Make a rifle scope from half a pair of binoculars, or a noise trap from a pill bottle and pebbles.\nDesperate Combat - Detailed combat with moves like \"Tackle,\" \"Lure,\" \"Kick While Down,\" \"Demand Surrender,\" and \"Threaten.\"\nRealistic Wounds - Creatures have complex wound simulation, with multiple wound locations, infection, bleeding, and pain management.\nRealistic Metabolism - Hypothermia, fatigue, thirst, hunger, disease, intoxication, shelter...everything is tracked.\nRealistic Inventory - Complex inventory system with slots for holding, wearing, containers, and more. Fit items in grid spaces, and manage encumbrance.\nHex-Based World Map - Navigate ruins, hills, forests, and plains in a hex-based map. Line-of-sight, elevation, and daylight matters.\nTracking - Creatures leave their tracks and spoor on the map, which can be followed by others. Players can also hide their tracks.\nHiding - Players can use hiding to avoid being seen while traveling the map, as well as during story encounters.\nHunting - Trap small game for food and fur, or track and kill larger prey on the map for butchering.\nHacking - Use hacking skills to unlock scavenged laptops, cellphones, smartphones, and tablets. Mine them for paydata, or snoop through personal files.\nForaging - Search for edible plants and water, and use special skills to identify what's safe to eat.\nHaunting Soundtrack - Music composed by Josh Culler, specifically for NEO Scavenger, plays periodically, lending an atmosphere of loneliness and desperation. (Also accessible as mp3s outside game.)\nCreature AI - Wandering creatures go about their own business, hunting, scavenging, and hoarding. Morale affects their choices, and some will gang-up and cause trouble.\nDynamic Weather - Temperature, rainfall, and night/day are based on real-world data for autumn in the area. If you live long enough, you may see snow fall.\nDetroit - Take refuge from the wasteland in one of mankind's last bastions of safety. Buy supplies, get medical care, and seek clues in a cyberpunk-styled city.\nTrading Cards - Collect NEO Scavenger trading cards, badges, emoticons, and profile backgrounds!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Blue Bottle Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4632,"name":"Hamilton's Great Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/304/3046ab794438498d808d861631e8ca66.jpg","description":"Hamilton's Great Adventure puts your problem solving skills and reflexes to the test. Outsmart the enemies, rush through the levels and collect all the bling to ensure your place on the leaderboards.\nIn single player, switch between Hamilton and Sasha the bird to get through more than 60 challenging levels, or play the game in offline co-op mode and control one character each! The game supports both keyboard/mouse and game pads.\nThe increasing difficulty will keep even the most seasoned gamers on their toes and only the most skilled players will make it to the end.\nWill you be one of the select few in the world to complete the infamous Toader level 100%?Key Features:Highly addictive puzzle adventure!\nCompare scores with your friends using in-game leaderboards!\nEmbark on a fantastic journey & unravel an ancient mystery!\nPuzzle solo or take a friend along on the adventure with simultaneous local coop!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":3954,"name":"Stealth Inc: A Clone in the Dark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c20/c20b09187629ea6b47d8b3e9132bf839.jpeg","description":"Stealth Inc is a fast-paced stealth platformer featuring brutal hazards, ruthless enemies, fiendish puzzles and red pixels galore. Jump, sneak, and be chunked through 80 levels. Will you make it out alive?\nArmed with only your wits and a pair of top of the range Stealthing Goggles, it's your job to sneak your way through a deadly facility that's determined to extinguish your fragile little life. With no weapons and no armour, being seen means instant death.\nStay out of the light to avoid the attention of deadly security robots! Leap like a lusty salmon to avoid those zap-happy lasers! Think fast as the walls close in around you! And once you've defeated these deadly chambers (or they've defeated you), create your own fiendish death-rooms in Stealth Inc's fully-featured level editor!\nPurchasing this content entitles you to both the PS3™ system and PS Vita system versions!\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\nNetwork Features\n2048KB Minimum\nTouchscreen\nDual Analog Sticks\nCross-platform play (PS3™)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\nStealth Inc ™ & © Curve Digital.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Curve Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"}]},{"id":1352,"name":"Unholy Heights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44b/44b2fe06f4cb86b280704119e7db26c5.jpg","description":"Welcome to Unholy Heights, a mashup of Tower Defense and Apartment Management Simulation! The Devil has converted a tenement building into monsters-only housing, and has big plans for the future. Sucker monsters into moving into your building, charge them rent and keep them happy by buying them furniture.\nUnfortunately, heroes have caught wind of the Devil's plan, and will stop at nothing to wipe him out. Knock on residents' doors to call them to battle, trap heroes in devious pincer formations, and command your troops to victory. Monsters get jobs, fall in love, have children, and even skip out on their rent. Keep them happy or you might not have anyone to fight for you when heroes come knocking. But don't be too soft: there's always prospective baddies looking to move in, so kick out the freeloaders when the time is right!\nBeing a landlord is a difficult job, but it can't be harder than running Hell...right?\nEvery monster is different. Some are lazy. Some are strong. Some are perverts.\nUse an intuitive mouse-based control scheme to command your troops into battle.\nEncounter more than 20 different monster species, and take their money.\nBuild a reputation with different monster families based on your performance and play style.\nTake on quests at your pace to unlock new monsters and furniture.\nBuild a stronger army as residents have children far stronger than themselves.\nGet monsters in the mood for love with inappropriately shaped erotic cakes.\nLook on in horror as lovingly hand-drawn monsters and humans horribly slaughter each other over money.\nMonster occupations, hobbies and desires are all procedurally generated to keep you on your toes.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Teyon","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":484718,"name":"Nongunz: Doppelganger Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52f/52f6b83818f182f8316706c84c228b54.jpg","description":"Hundreds of levels plagued with dozens of different enemies\nUnforgiving gameplay that will challenge both your skill and your wits\n\n\n\nIntense run-and-gun combat\nCard based perk system granting you powerups and passive stats such as speed boost and bigger bullets\n\n\n\nMany weapons, items and equipment to unlock and master\nThe unyielding pressure of your own mortality\n\n\n\nA kill-chain combo meter to keep you forever moving forward\nThe everpressing guilt of your past wrongs.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Brainwash Gang","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":61073,"name":"Touhou Luna Nights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a4/4a42502b3420a6edb928ec9ed6e66d80.jpg","description":"Touhou Luna Night's is a 2D search action (Metroidvania)  Touhou game.\nAfter creating many action games, this is a new project from Team Ladybug.Story\n\"--Now, let's begin my world.\"\nThe vampire from the Scarlet Devil Mansion ,\"Remilia Scarlet,\"\nsuddenly sends her maid, \"Sakuya Izayoi\" to a parallel universe\nsimilar to Gensokyo.\nA strange world, strange youkai, and unable to use the power to manipulate time.\nWhat is Remilia up to……?What's special about this game\n・Time stop system from character's Ability and Gimmick maps that use special abilities like time stop.\n・Adapt the \"graze\" system of the Touhou Project into a 2D game, giving you a sense of tension in approaching to the enemy.\n・Graphics that bring out the appeal of Touhou world, such as attractive dot Graphics.\nA word from the publisher\nTeam Ladybug began with \"Pharaoh Rebirth,\" continuing with other enjoyable games including\n\"Resurrection of Beldia\" and \"Shin Megami Tensei SYNCHRONICITY PROLOGUE.\"\nSince, I have been waiting in anticipation for their next project.\nThis time, they have created a fan fiction game based off the world-renowned \"Touhou Project.\"\nFrom the background to the character's movements and various skills,\none can feel the creator's passion for games and love of the Touhou project.\nWhile it is a 2D search game similar to Castlevania, the game can easily progress without\nthe insistence of repeat elements or collecting items. This has resulted in a spectacular game\nborn from the game production skills cultivated by Team Ladybug.\nAnd I personally want to highlight the beauty of the anime sprite.\nYou can see the attention to detail the creator put into not only the leading character's movements,\nbut the effects and enemy characters.\nTouhou Luna Night's is not only for Touhou fans but one that can be enjoyed by anyone who loves 2D action games.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team Ladybug","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10660,"name":"Voxelized","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31b/31b64e2b47ed7c37be34a8667a69ec14.jpg","description":"Please consider purchasing only if you wish to support the development of Voxelized.\nYou should wait before purchasing if you want to play a game with more content on it.\nThere will be frequent updates.\nFrom next update there will be multiplayer support. (0.4.3)\nThat will transform the game in to a\nPolygon-medieval-multiplayer, in a closed enviroment.\nThe randomly generated voxel terrain might be deleted from the game. But it is not yet decided.\nPlease understand that it is in development, and it is not finished.\n\"An Early Access title, may have random crashes and bugs\"\nPlease read the Early Access Description above.ConceptIn Voxelized, you gain a control of a knightPlanned Features\nOther game Modes&Scenes\nAlmost anything YOU want. I will add most of the requested features in game.\nPlease note that Voxelized is in very early stages of the development.\nEven though you can get it now for cheaper at early access, please remember that it is unfinished, but it is fully playable.\nAs mentioned on the Short Description:\nThis game is on Early Access, and it means this game is not yet finished.\nIt is under development as you play and i will keep on updating as much as possible.\nThere will be many bugs, mayby even crashes. I´ll always fix them as soon as possible.\nI cannot promise that you will get to keep your saves, but i´ll work hard to make sure your saves will be saved\nI want to point that out because there have been too much confusion within the Early Access games.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lord Kres","platforms":[{"id":0,"name":"PC"}]},{"id":19740,"name":"Super Space Pug","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87a/87ad35122ac5865b95ddaf6a4951f45c.jpg","description":"Super Space Pug is a classic arcade shmup. Take control of 'Demetrius the Third'(Space Pug) to defend your personal space from the evil, fish flinging cats and random rocks because its a space shmup, and without rocks it would be rather non-space-y.\n- Difficult, speedy, bullet hell gameplay.\n- Evil Cats, monsters and more!\n- Go up against your friends on the competitive leaderboards.\n- Take advantage of power ups like Poop cannon, Triple fire and Ninja stars!\n- Community voted monthly or bi-weekly power ups.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digital Dawn Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19294,"name":"Scribblenauts Unmasked: A DC Comics Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a4/1a4696a657ac99bdfccdf9350b9a9220.jpg","description":"In Scribblenauts Unmasked: A DC Comics Adventure, Maxwell unites with Batman™, Superman™ and the rest of The Justice League™ to restore order to the DC Comics Universe.\nChallenge your imagination as you battle the mightiest villains in an exciting, action-filled adventure through GOTHAM CITY™, METROPOLIS™, ATLANTIS™ and other iconic locales from the DC Comics Universe. Bring out your inner super hero (or villain!) with the all-new Hero Creator by crafting completely original objects out of parts of existing DC Comics characters. Then assign unique properties to your creations and use them to solve puzzles, or share them online with friends – which they can use in game or further modify as they like.Key FeaturesThe DC Comics Universe: Summon thousands of your favorite DC Comics characters and objects - all drawn in the unique Scribblenauts art style!\nHeroic Feats: Enjoy addictive replayability with new, dynamic puzzles that continuously generate different missions every time you play it.\nThe Hero Creator: Create, edit and share your own personalized super hero or villain by using parts of existing objects from the expansive DC Comics universe. How will your Wonder Joker stack up against your friend’s Bat Bain?\nIntroducing the Batcomputer: Need help looking for that perfect object to summon? Reference the in-game encyclopedia that lists the names and description of every object from the DC Comics universe.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"5TH Cell","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"}]},{"id":4476,"name":"WipEout 2048","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/983/98387b9caeb7496d3e8df567ef4f762b.jpeg","description":"Hyper-Velocity Racing Powered by PlayStation®Vita\nExperience the thrill and speed of antigravity racing with PS Vita system's enhanced controls, including motion active tilt and touch interface. WipEout® 2048 also supports Cross Play between PS Vita and PS3™ players. It's a never-ending battle to stay atop the online leaderboards.\n• Touch and tilt to victory — tilt to steer, use rear touch to accelerate and front touch to fire weapons\n• Multiplayer Cross Play — race with up to 8 players on either PS Vita or PS3™ systems\n• Comprehensive campaign and online modes\n©2011 Sony Computer Entertainment Europe. WipEout is a registered trademark of Sony Computer Entertainment Europe\nOnline Pass code may be redeemed once and becomes associated with the PlayStation®Network account used to redeem it. Online Pass access rights cannot be transferred once the voucher is redeemed. Online Pass codes cannot be returned for cash or credit.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item's use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SCE Studio Liverpool","platforms":[{"id":0,"name":"PS Vita"}]},{"id":60586,"name":"ΔV: Rings of Saturn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/434/434f32759aba648c73c68eb576e3e978.jpg","description":"The year is 2273\nThe unexpected discovery of valuable minerals within the rings of Saturn has sparked a thriving space excavation industry. You control an asteroid excavation ship hoping to make it rich out on the rings, but soon you find out that all is not as it appears. Experience a hard sci-fi story backed up with real physics and science.Key FeaturesRealistic top-down hard sci-fi space flight experience. Every aspect of gameplay is backed up by real science. Ships fly just as starships should.\nJump into action in seconds with autopilot assist or save fuel by manual thruster maneuvers.\nDetailed ship simulation down to every subsystem - upgrade your ship, fix or even jury-rig broken systems on the fly. Every system failure will impact gameplay - adapt to survive in the hostile environment of space.\nDiscover the mystery of the Rings, or just try to get rich leading your excavation company.\nPlan your strategy back on Enceladus Prime station. Sell your output, upgrade your ship, hire the crew and manage your company.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Kodera Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17731,"name":"Sherlock Holmes: The Silver Earring","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18e/18e2099432c937034331609b49b5e42f.jpg","description":"At a reception organised in honour of his daughter, Melvyn Bromsby, a rich tycoon, is about to make an important announcement concerning his future business affairs when, all of a sudden, a shot rings out. Sir Bromsby collapses, having suffered a mortal wound to the heart...\nA baffling murder, dozens of witnesses and numerous places to visit around Victorian London. You play Sherlock Holmes, and use all your skills to shed light on this mysterious case.\nAssume the role of Sherlock Holmes and Doctor Watson and meet all the heroes of the novels: Inspector Lestrade, Wiggins, Mycroft and many others!\nInvestigate 5 murders! Over 40 witnesses to question, 200 clues to uncover and over 25 hours of gameplay to solve the mystery.\nExplore Victorian London, which is magnificently and faithfully reproduced in 3D.\nBetween each level Sherlock Holmes sets you a quiz which will validate your progress in the case.\nThe adventure is full of vivid cut scenes to heighten the dramatic aspect of the story.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":834,"name":"Yesterday Origins","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a3/3a38d98a736f610afe997d61b2a1a75f.jpg","description":"DEMO NOW AVAILABLE\nIn this demo, enjoy the two first chapters of the game for free!\nAbout the GameOVERVIEW:\nDiscover the latest adventure from Pendulo Studios, creators of the Runaway series!\n\"Yesterday Origins\" will take the immortal heroes, John Yesterday and his other half Pauline, not only across the world, but across history itself. This interwoven narration gives the plot its depth and richness.\nIt's 1481. In the dead of night, young John is publically humiliated and dragged through the street. He is imprisoned by the Spanish Inquisition under suspicion of witchcraft.\nLater, he undergoes an alchemical transformation making him immortal. But something goes wrong, after each resurrection, John completely forgets who he is.\nIn the current day, John is living with Pauline in Paris his immortal partner. They are searching for an artefact that is needed to make the potion again. During their investigation, they will have to face dangerous new protagonists who want to steal their secrets...KEY FEATURES :Pendulo Studios: over 20 years of adventure gaming experience\nAn original story taking place over several different eras\nA mix of different styles: investigation, thriller, adventure, occultism\nOff-the-wall dark humor typical of the studio\nOver 10 different places to visit, and over 50 backgrounds\nMore than 25 colorful characters\nAn original soundtrack\nAdapted to mouse and controllers","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Microids","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":977316,"name":"Balatro","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/821/821a40bd0cc0ac7dfb3fe97a7878dc1f.jpg","description":"Balatro is a poker-inspired roguelike deck builder all about creating powerful synergies and winning big.\nCombine valid poker hands with unique Joker cards in order to create varied synergies and builds. Earn enough chips to beat devious blinds, all while uncovering hidden bonus hands and decks as you progress. You’re going to need every edge you can get in order to reach the boss blind, beat the final ante and secure victory.\nThe definitive poker roguelike experience.\nEndless possibilities - every pick-up, discard and joker can dramatically alter the course of your run.\nIn-depth campaign mode complete with 8 difficulties, as well as challenge, daily and seeded runs.\nDeftly deploy an array of potent tools: different Decks, Jokers, Tarot cards, Planet cards, Spectral cards, and Vouchers. Use these versatile instruments to ignite a combo frenzy and turbocharge your poker hands, crafting electrifying, adrenaline-fueled synergies.\n150 Jokers, each with their own unique abilities\n15 Decks with distinct modifiers to choose from for each run\n5 potential variants of each Joker which add further abilities\n22 Tarot cards variants that can enhance your regular playing cards\n11 Planet cards that help level up your possible poker hands\n32 Voucher cards to help provide permanent buffs for your current run\nImmerse yourself in Balatro’s distinctive psychedelic world. Let the synthwave soundtrack wash over you -  wind down, escape the daily grind and prepare to enter the ultimate roguelike flow state.\nImprove your collection and discover new cards and secrets with every single run.\nMake use of the in-depth stats screen to study your best hands, most used Jokers, and more!\nImmerse yourself in the CRT fuzz and enjoy detailed, hand-crafted pixel art.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"LocalThunk","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":23300,"name":"Nongünz","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27f/27f5389d302107cbc341873b5d2c11ee.jpg","description":"NONGÜNZ IS OUT! THANK YOU!\nNongünz finally arrives at Steam!! It has been an intense way with a lot of people backing the game, giving Nongünz a lot of love, now we are very happy with the reception of the game, we love there are so much people discovering Nongünz secrets... Now it´s time to play it!!\nThe game has all the personality and crazy way of their devs @verz_edu (Producer, Game designer, Main Pixel Artist, and Creative Director) and @ezrubiera (Main Programmer), the music has all the charm and style of @beibeicoli.\nWe also want to thank all those people behind of the development:\nMarcos a.k.a Muffin de Sepia (an insane level designer) Charly Santafé and Guille Laorga (lovely guys with magic on their hands) \"our\" Rafer Labarta (keep an eye on this promising guy!) Bakir Khawam a.k.a. Moha (the finnest pixel artist of Persia)\nFor all of you guys, our infinite LOVE <3\nIf you want to keep up to date, just follow us:\nhttp://www.twitter.com/SindiecateArts\nhttp://www.twitter.com/Brainwash_Gang\nhttp://www.facebook.com/Sindiecate\nWe will be updating and very aware of every comment you made :)\nNow is time to Nongünz!\nJoin our DISCORD!\nChat with Nongünz developers at the DISCORD group we´ve created.\nYou can discover the latest and exclusive info about Nongünz in our channel:\nhttps://discord.gg/AUJPTV\nNONGÜNZ is closer than ever...\nThis Friday...We NONGÜNZ!\nThe release date for Nongünz is really really near and the most early twitchers and youtubers have started to streaming our game.\nYou can see NONGÜNZ in action if you follow us or follow Brainwash Gang on Twitter and Facebook.\nAlso you can add this game to your wishlist NOW!!\nSAVE THE DATE. MAY 19!!\nhttp://www.twitter.com/SindiecateArts\nhttp://www.twitter.com/Brainwash_Gang\nhttp://www.facebook.com/sindiecate\nAbout the GameNongünz is a nihilistic action platformer which combines hectic shootouts with the management of a mysterious idle game.\nEach run will have you parting from a black and white graveyard into an ever-changing gothic dungeon full of nightmares fleshed out of human viscera. Surviving this distraught roguelike will not only require skill but style, since Nongünz rewards you for long-lasting combos and challenges... moreover, score will play a key role in the progress of the idle game: the formation of your very own band of lost souls and death cultists.\nAs the world of Nongünz evolves, you will meet special characters that will inhabit your graveyard: praying cultists, self-scourging martyrs, somber gravediggers... which will either help you widen your killing skills or improve the performance of the insidious idle game built around the graveyard.\nFeatures\nUnforgiving gameplay that will challenge both your skill and your wits.\nThe whole game is a riddle. Unveil the mystery behind the nihilistic universe of Nongünz.\nBeautifully crafted black and white pixel environments and characters.\nHundreds of levels plagued with dozens of differents enemies.\nMany weapons, items and equipment to unlock and master.\nThe potential to change your perception about existence, violence and mankind.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Brainwash Gang","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19716,"name":"One Troll Army","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2c/a2c6606af679d878bff75dc239756de3.jpg","description":"Crush hundreds of minions as the powerful giant troll!\nTiny Goblins call on you to protect their fort, in exchange for armor, money and new moves to smash and loot minions!\nGoblins build towers, barracks and catapults over each wave to help you fight back bigger minions and bosses!Play Against The Twitch Chat! Enable Twitch integration to allow your viewers to directly control units\nFight as a boss troll with 12 upgradeable skills. Kick, Knock, Wheel, Quake, Taunt, Jump, Ram and Loot your way through the horde!\nDefeat various enemies: from small rats to huge ballista-wielding rhino and buffalo bosses. 21 types of enemies and 15 bosses.\nManage the crowd of goblins. Make them builders, looters, miners, loggers and more to harvest resources, restore the fort, get the loot and build new structures.\nManage the fort. Build and upgrade 7 buildings with 3 levels of upgrades from small huts to great castles.\nBuild and upgrade defense towers. Each fort has 4 towers with 4 types of weapons (stone-thrower, archer, catapult, bomber). Also upgrade weapon types at the barracks.\nHire and upgrade orc mercenaries for support- but don’t let them die on the battlefield!\nMore than 50 goals and achievements.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FlyAnvil","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":692669,"name":"Epic Chef","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b46/b46912034e3c991f6cfd51017a975484.jpg","description":"SAVE UP TO 20% FOR A LIMITED TIME!\nAbout the GameEpic Chef is a story-driven adventure game flavoured with life-sim farming, and crafting elements, blended together into one delicious dish via an interactive cooking experience - all served with a side of humour and elaborate cast of characters inspired by classics such as Mister Ajikko, or the writing of Sir Terry Pratchett. Grab your spatula and start on your journey to become... Epic Chef!\nIn Epic Chef you will combine ingredients, stirring and tossing with culinary precision to bring out the flavour elements of Vigor, Sophistication and Spirit in your dishes. This forms the core of the cooking experience that you must master in order to become the very best chef in Ambrosia.\nDish synergy and ingredient properties combine with a dynamic recipe creation system, meaning that you can experiment with thousands of different combinations to create a unique menu of decadent delights. Serving Rats with Tomatoes and Potatoes? Don't you mean Tomato Soufflé and Vermin Slices in Starchy Cream?!\nTake on bitter rival chefs in epic culinary clashes to see who is crowned cooking king of Ambrosia! Dishes are scored on a variety of things from ingredients, to flavours, strength and more, with no two judges having the same taste. Become an even greater chef by utilising the addition of sauces to alter the properties of your dishes and influence the judges to win their favour.\nLive off your land by growing foods such as fruit and vegetables, gather resources to craft specialised machinery that can process your ingredients further, and even create new recipe components whilst you tend to an eclectic mix of animal livestock from cows to unicorns! And don't forget to repair and customise your dilapidated (and slightly haunted) villa!\nWelcome to Ambrosia, a place of gastronomic delight and agriculture wonder, renowned the world over. You are free to explore all that Ambrosia has to offer, from winding narrow streets to lush green fields, from quaint restaurants to bustling taverns, all full to the brim with 'friendly' locals eager to meet you.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Infinigon Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":10168,"name":"Boring Man - Online Tactical Stickman Combat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/216c309847a8507b44831b96f42e7d4b.jpg","description":"Boring Man - Online Tactical Stickman Combat is the greatest 2D shooter you've never heard of. From a selection of 70 weapons, battle and destroy your enemies using a variety of guns, parkour abilities, dynamite, swords, and so much more.\nBoring Man features a wide selection of game modes, and a even more vast collection of mutators that turns your vanilla game mode into a chaotic madhouse.\nWith 70 weapons to choose from, Boring Man offers a huge range of load out customization that can fit nearly every play style.\n7 different game modes! Get in touch with your competitive side with classic Capture the Flag, or survive with your friends in the Zombrains game mode.\nHost your own server for your friends and explore the many mutators in the game, such as the Low Gravity mutator or the Rocket Madness mutator that changes every projectile into a deadly explosive rocket!\nTraverse the difficult climb maps that will leave you crying!\nMake your own maps with the BoringEditor map tool!\nWant even more? Get the Boring Man Premium! edition and have extra customization features for your stick figure soldier, such as hats and colored bullets.\nIn Boring Man, it's everything but boring.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spasman Games","platforms":[{"id":0,"name":"PC"}]},{"id":9936,"name":"Glass Masquerade","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/258/2581fdba1cb70f37efc3a505154977db.jpg","description":"Welcome to Glass Masquerade - an artistic puzzle game inspired by Art Deco & stained glass artisans of the 20th century. You need to combine hidden glass pieces to unveil clocks and themes exhibited by various cultures of the world at the 'International Times Exhibition' - an interactive electronic show.\n25 countries attending:\nArgentina, Australia, Brazil, Britain, Canada, China, Egypt, France, Germany, Greece, Greenland, Iceland, India, Indonesia, Iran, Italy, Japan, Madagascar, Mexico, Mongolia, Portugal, Russia, Sweden, Tanzania, USA\nThis journey around the world will take only 3-4 hours of your time. All exhibits have been carefully crafted for your eyes' joy and pleasure - don't just pass by!SOUNDTRACKDeluxe Edition of the soundtrack for the game, created by Nikita Sevalnev, can be purchased on his official website: http://www.nikcomposer.com/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":20003,"name":"Outrage","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dca/dca7c9749d3b72c74284cd0babf5d479.jpg","description":"Outrage is a short cyberpunk dungeon crawler. You manage a team of vigilantes and must undertake various missions in the city to strengthen your team and your cause in order to bring a powerful enemy to justice. However, you will not be able to undertake every single mission and therefore have to choose them wisely.\nSome missions will bring you valuable new gear or a new teammate, whilst others will give you useful intel or advantage in an upcoming main story mission. In addition, most missions will affect your reputation, either positively or negatively.\nWill you hunt down petty criminals and help the police or will you do questionable acts to further your own goals? Either path can lead you to victory, but beware – your overall reputation will affect what happens in the end.\nGeneral Features:\nBuild a team of vigilantes and undertake missions in the city to deal your own brand of justice!\nChoose your missions wisely, for you have a limited number of days between the main story tasks.\n6 different vigilantes to choose from. Pick any 2 to start with and recruit the others as you progress through the story.\nReputation system: Most missions either increase or decrease your reputation. With positive reputation, police will tolerate you, whilst underground movements will despise you. Negative reputation does the exact opposite!\n3 different endings, depending on your overall reputation in the endgame.\nCustomize your team with a large variety of weapons, armour, and add-ons\nSemi-random rewards: Loot found in supply boxes and given upon quest completion will not be the same on every playthrough.\n3 difficulty modes: Casual, Normal, and Tough.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Astronomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":19754,"name":"Star Drifter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fa/5faa2e624ed1e51537fa9340d2bdcbcc.jpg","description":"Features:Level up your space pilot. Earn points by destroying enemies and surviving. Spend your points at the shop, upgrade your ship and equip a variety of defence and weapon systems.  A massive amount of randomly generated enemies, power ups, secret weapons and huge bosses. Protect your ship! Exit your ship and attack the aliens while your shields are regenerating.An awesome authentic chip sound track.Disclaimer:Star Drifter is a full screen action space shooter. You play with your keyboard. We have developed the game to feel like an old school arcade, hard, very hard, super punishing space shooter. The game is not easy and you will die a lot. Please take caution, if you're in the mood for something that will hold your hand or let you win, you're in the wrong place. Star Drifter is ideal for casual gamers that enjoy a real challenge. Prepare to be destroyed over and over again, lose your score and rage at the computer.\nThank you and good luck!\nDan and Martin.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PiGravity","platforms":[{"id":0,"name":"PC"}]},{"id":19404,"name":"Nexuiz","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d1/2d1551f737ac3a6494522d818c64cac6.jpg","description":"Powered by CryENGINE 3, Nexuiz reinvents Arena FPS gameplay.\nFor centuries the Kavussari and the Forsellians have waged war. They have a fragile truce but due to their seething disgust of each other they still pit their warriors against each other in arenas rather than on the fields of war.\nThose episodes of lethal combat are now broadcast throughout the galaxy, as entertainment… a spectacle known as… The Nexuiz Competition: An arena based first person shooter where you can alter the rules of the match and laws of physics while you dominate opponents in ever-changing hostile environments bleeding with hatred.Key FeaturesArena FPS is back – inspired by the giants of the Arena FPS genre, Nexuiz reinvents twitch gaming for next generation consoles and PC\nOver 100 ‘Dynamic Mutators’ serve as game-changing power-ups – Jetpacks, Uber-Nuke, Low Gravity, Big Head Mode and many more...\n9 deadly arenas – powered by CryENGINE 3, Nexuiz sets a new graphical benchmark for a digital-only release\nDesigned for competitive play - a superbly balanced weapon set, classic game modes, and extensive stat tracking, Medals and Leaderboard support\nPlay solo or online – hone your skills against bots, then wage war online against the best in up to 32 player matches","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"IllFonic","platforms":[{"id":0,"name":"PC"}]},{"id":6446,"name":"Plantera","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b43/b43b0f638f56310c8c99d1a89be3ed37.jpg","description":"In Plantera you build your own garden and watch it grow with new plants, bushes, trees and animals.\nAs you play and expand your garden you will attract helpers, round blue creatures that will help you pick up things and harvest your plants.\nIf you want you can pluck trees and harvest plants yourself, or let your helpers do the work for you while you watch or build and invest in new plants. The helpers will even continue to work while you are not playing the game, and some new gold should always be waiting for you on your return!\nIt's good to keep your eyes open though, as sometimes mean critters may invade your garden. Hunt them out yourself or invest in a guard dog to keep the order.\nGo up in level to unlock new plants, bushes, trees and animals and continue to expand and improve your garden!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":667350,"name":"Deltarune","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a9/7a907fb5e158c8dc34e783d9c22674c3.jpg","description":"Here to download the game? Download Chapter 1 & 2 for free now using the orange \"Download\" button at the bottom.\nChapter 1&2をダウンロードしたい方は、このページの下にあるオレンジ色の「Download」ボタンをクリックして下さい。\nOK, now onto the description...\nThe next adventure in the UNDERTALE series has appeared!\nFight (or spare) alongside new characters in UNDERTALE's parallel story, DELTARUNE...!\nFeaturing\nA massive soundtrack and story written by Toby Fox!\nMeet new and endearing main characters, as well as familiar faces like Toriel, Sans, as more. Huh? Papyrus? No, he's busy. Sorry\nSmooth and expressive pixel-animation by Temmie. She also has a new hat (in-game)\nA linear, chapter-based system that you can pick up from anywhere.\nCreative bullet-dodging based battles inspired by games like Touhou and Chrono Trigger.\nJevilishly difficult hidden bosses.\nAnd...\n...\n... only 1 ending...?\nChapters 3-5 are now in development and will someday be available as a paid release. Follow the official twitter for extremely sparse up to date info!\nWant to support the game? Buy the soundtrack!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"8-4","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":380786,"name":"Pilgrims","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/50b/50bf95cebe56f66457ec696c44e0508e.jpg","description":"Roam the land as you please and make new friends, share a laugh with your fellow travelers and help them complete their little stories, your way. How many different solutions can you find?\r\n\r\nPilgrims is a playful adventure game, created by the team behind Machinarium and Samorost. Roam the land as you please and make new friends, share a laugh with your fellow travelers and help them complete their little stories, your way. How many different solutions can you find?\r\n\r\nIt is most enjoyable if you’re into:\r\n- Playfulness: Don’t beat it - play with it! Solve the various tasks using dozens of items and unique characters without being obliged to follow a single designated path.\r\n- Replayability: Packed with 45 achievements, Pilgrims is a game designed to be played through more than just once. Can you collect them all?\r\n- Hand-crafted appeal: Hundreds of unique animations and custom made sound effects result in countless humorous and unexpected outcomes. Try to discover as many as you can!\r\n- Original music: Floex (Machinarium, Samorost 3) is back at it with his mix of live instruments and organic electronics, joined by guests on guitar or clarinet.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Amanita Design","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":367194,"name":"Ghostbusters: The Video Game Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1d/d1d60b2fce4d651bab8fc108432b5ec0.jpg","description":"The beloved and critically acclaimed Ghostbusters video game is back and remastered for modern consoles and PC!\n\nStrap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York!\n\nAuthentic Ghostbusters Experience - The game features the voices and in-game likenesses of Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson in an original story penned by the writers of the original films - Dan Aykroyd and Harold Ramis.\n\nUnique Gameplay - Experience unique ghost hunting, wrangling and trapping with upgradeable weapons in widely destructible environments. Test the team's mettle with large scale boss fights.\n\nStoryline Campaign - Play through a unique storyline as the player battles and captures ghosts - both well-loved and brand new - throughout New York.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]}]