[{"id":23873,"name":"Super Paper Mario","genre":"RPG","price":0.0,"description":"Mario flips out on an adventure through eight exciting and vibrant worlds! Switch from 2D to 3D to avoid enemies, find secret passages, grab hidden items, and shake the Wii Remote for stylish moves! Uncover hilarious plot-twists as you power-up with new friends and even play as Peach and Bowser!","imageUrl":"https://media.rawg.io/media/screenshots/d35/d35fae8baf39ca7e2b3d825d6ecb21db.jpg","releaseYear":2007,"developer":"Intelligent Systems","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"}]},{"id":23489,"name":"Sudden Strike 3","genre":"Strategy","price":0.0,"description":"NOTICEThis is a re-release of a classic game. Even though it was tested on a variety of modern Windows PC configurations, unwanted side effects such as video/audio glitches and crashes may occur. If you are encountering technical issues with this game, please visit the community forums for assistance and support.\nAbout the GameExperience the hit World War 2 real-time strategy game for the first time in full 3D glory, expanding on all strategic and tactical options. Command joint operations of naval, land-based and airborne units on the largest maps in the series. Newcomers and veterans alike will be right at home with an innovative user interface and improved AI.Features\nHuge variety of landscapes, sceneries and destructable environment fully detailed in 3D\nMassive operations on huge maps of several square kilometers\nMore than 300 tanks, ships, soldiers, guns and aircraft in historically accurate 3D reproduction\nUse an advanced AI to help command your massive army\nRealistic lines of sight, projectile ranges and impressive visual effects simulated in real-time\nFive campaigns for American, British, German, Imperial Japanese and Soviet Russian Armies\nContains \"Sudden Strike 3: Arms to Victory\" and \"Sudden Strike: The Last Stand\" sequel\nContains map editor for user-generated maps and missions","imageUrl":"https://media.rawg.io/media/screenshots/566/566a2afe066e53a65640250b47434f26.jpg","releaseYear":2007,"developer":"Fireglow","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22385,"name":"The Good Life(2012)","genre":"RPG","price":0.0,"description":"Like so many, Derek Hales is fed up and is dreaming about ditching the nine-to-five lifestyle. When he learns that his late uncle made him the sole heir of Carpe Diem Boats, a boating company on the tropical complex of the Jo Jo islands, he does not hesitate for a second. A new life awaits! After a long voyage, he and his striking girlfriend Michelle Joyce finally arrive at their destination, enjoying the beautiful sunrise, with a Boating Company of their own. Compared to the dull office life, this new life looks much better. Finally but suddenly, life is good!Features:With an array of luxury vessels at your disposal, take on various missions across ultra-realistic tropical waters, in order to make your fortune.\nExperience vast, beautiful tropical locations, with more than 50 harbors and dozens of diverse places to explore.\nBecome an adept skipper and progress across 6 different ship types.\nRealistic weather conditions and 24hr day/night cycle.\nSeek treasures in the deep, rescue people from drowning, avoid pirate attacks and become rich and famous!\nUse your earnings to build your commercial empire, buy and sell properties in this tropical paradise, progress from sun beds, beach houses and bungalows, to restaurants, villas and even hotels.\nPlay against 9 other NPC Skippers who compete for business against you, become the best skipper, earn more money and become the ultimate tycoon of the JoJo Islands!","imageUrl":"https://media.rawg.io/media/screenshots/cd7/cd7de876a3aa12ec7ccf4369d2114693.jpg","releaseYear":2014,"developer":"White Owls","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":18976,"name":"Explosionade","genre":"Action","price":0.0,"description":"All your friends are storming the Horronym Fortress but Colonel Bouche left you to guard the supply depot. Disregarding orders you open the depot to find a gigantic, prototype mech!\nFEATURES:\nINFILTRATE subterranean strongholds manned by cunning bipedal aliens and their mind-blasting hellions!\nRecharging MegaNades, and an earth-shaking machine gun rip DESTRUCTIBLE environments to hand-drawn bits!\nDozens of CHALLENGE-ROOM style gameplay with a zoom function that let's in you close or zooms out to see all the action!\nBattle tricky aliens that can run, dodge, take pot-shots and throw grenades to blow you to bits!\n2-PLAYER LOCAL COOP so you can share the alien-stomping, grenade tossing joy!\nBlast screen-filling bosses deep, deep down in the unexplored depths!\nMultiple difficulty modes, and gameplay speed control to find just the right challenge!\nNew for Steam version - Steam Leaderboards, Achievements, and Trading Cards!\nHand-drawn, SILKY-SMOOTH effect animations just like Mom used to make! (If your mom was SNK)","imageUrl":"https://media.rawg.io/media/screenshots/307/307fcd4b3e93d64038982f0052163a37.jpg","releaseYear":2015,"developer":"Mommy's Best Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17693,"name":"FLASHOUT 2","genre":"Action","price":0.0,"description":"NOW WITH FREE ADDITIONAL CONTENT - MP3 music tunes and wallpapers (refer to game manual for details)!\nFLASHOUT 2, the sequel to the highly-acclaimed anti-gravity racer FLASHOUT 3D is finally here! Get into one of many ultra-fast ships and use your arsenal of rockets, guns, bonuses and upgrades to fight your way to victory!\nFLASHOUT 2 offers a fresh and addicting racing experience featuring a redesigned and enhanced Career Mode with story elements, massive improvements in matter of steering, physics, opponent’s AI, and other gameplay elements, an Online Multiplayer Mode and introduces completely new and exciting game modes, such as Destruction, Elimination and Versus!\nFLASHOUT 2 also features high-quality colorful graphics, some of the best and most accessible controls to allow you to focus on pure action, amazing licensed electronic music and game controllers support! Additionally the game offers a unique interactive equalizer, that analyzes in-game music and accordingly determines, in real-time, what the visual effects look like!\nFeatures and highlights:\nAmazing racing experience!\nAddicting and enhanced Career Mode!\nFree Online Multiplayer with different game modes!\nLicensed electronic music!\n10 highly-detailed futuristic circuits (Los Angeles, London, Paris, Warsaw, Moscow, Frankfurt and more)!\nDozens of challenging races!\nNew and unique game modes (Destruction, Elimination, Versus)!\nUpgradeable, super-fast ships!\nWeapons and guns!\nPrecise, fun and awesome controls!\nMany cool and useful bonuses!\nClever AI, adapting to your style of play!\nInteractive Equalizer – music affects graphics!\nGorgeous visual effects!\nSeveral control layouts!\nSteam Achievements!\nFacebook and Twitter integration!\nCertified game controllers support!\nFREE EXTRA CONTENT: 13 MP3 FLASHOUT 3D music tunes!\nFREE EXTRA CONTENT: 3 HD FLASHOUT 2 Wallpapers!\nAnd more!","imageUrl":"https://media.rawg.io/media/games/819/8190f6c5a499c934cd88ed001d33761f.jpg","releaseYear":2014,"developer":"Jujubee","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":16015,"name":"Pixel Survivors","genre":"Strategy","price":0.0,"description":"Pixel Survivors is a real time strategy - management game.\nCreate some land and help your initial villagers to survive during the first period of time.\nBuild houses for hosting your citizens, create chicken pens and farms to feed them.\nElevate forges and tailors to keep the population well dressed and with the necessary tools for working.\nContruct mines and foresting towers to get new resources once the surface has been wiped.\nImprove the efficiency of your work by adding windmills and sawmills.\nOnce you've got a stable village, all you can do is expand your village and try to get a bigger population stable.\nHave fun, and see how far you can get your village to grow!\nMusic made by:\nBenjamin Baldassini\nhttp://www.benjaminbaldassini.fr","imageUrl":"https://media.rawg.io/media/screenshots/d75/d75fd35139714eda90e4c0312a33928b.jpg","releaseYear":2016,"developer":"Sachonski","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15960,"name":"PaintLab","genre":"Desconocido","price":0.0,"description":"Paint or sculpt your own 3D creations and play around with them in Virtual Reality!\nIt’s free, easy to use and a lot of fun to use PaintLab with friends and family!\nWith PaintLab you can:\nBe a graffiti artist! Spray paint the iconic Volkswagen van!\nSculpt your own sculptures and 3D objects, being completely free to move anywhere you like\nEnlarge your creations to be so high they ‘scrape’ the clouds! Or ‘minify’ your PaintLab to be as tiny as a ladybug!\nUse different PaintLab sculpt types. Just select another brush and sculpt type in the menu on your right or left controller and create whatever you like, such as camouflaged dinosaurs, flying bees, rainbows, a castle, Superman or a lion!\nPick up your 3D creations, put it somewhere else, throw it away or play around with it!\nMake a selfie with your PaintLabs!\nRecord and stream video's while PaintLabbing!\nPhotograph your work from every angle thanks to the build in camera and share your work with the world!\nImmerse yourself in creative VReedom!\nPaintLab is made by LAB4242. We are a creative Virtual Reality Development company based in The Netherlands, Amsterdam. We develop Virtual and Augmented Realities that matter!","imageUrl":"https://media.rawg.io/media/screenshots/f2d/f2d35c95861258ffb3d7752ce0da078b.jpg","releaseYear":2016,"developer":"LAB4242","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13967,"name":"Kingdom Wars 2: Battles","genre":"Strategy","price":0.0,"description":"Free Undead Cometh Expansion\nFree Undead Rising Expansion\nAbout the GameKingdom Wars 2: Battles brings a fresh perspective on the fantasy real-time Strategy genre, combining the best of Zombie survival and long term crafting with complex fast-paced city-building and skirmish siege combat. All in a beautifully, yet gory game world where players fight across the epic battlefields in multiplayer skirmish and coop with thousands of other players. And with an episodic singleplayer campaign bringing epic storytelling, with countless battles and adventures. New Episodes will be released as a free expansion pack, every few months.\nEpisodic Singleplayer Campaign\nKingdom Wars 2: Battles comes complete with an epic story-driven singleplayer campaign, as well as progressive multiplayer storytelling. Providing hours of engaging cinematic narrative, and original gameplay, campaign tells the story of the three great races, trying to survive in a world engulfed by total war. Each new episode will continue both the singleplayer and multiplayer story-arcs as well as introduce new races and locations. And in best Reverie World Studios traditions, new episodes will be released as a free expansion pack, every few months.\nStunning Siege Combat\nRealistic medieval siege combat brings fresh gameplay to the Strategy genre, with intricate stronghold construction, and over 25 defensive and offensive siege weapons. Ram the enemy gates, scale the walls with ladders and siege towers, and unleash trebuchet bombardments, while building your own strongholds and citadels protected by boiling oil and wall-mounted catapults.\nComplex Crafting System\nTo provide meaning long-term gameplay, KW2B features full crafting system, with over two hundred combinations, from dozens of components from blueprints and materials to legendary items and relics. Crafting is tied into every aspect of the game, from crafting new deadly siege weapons and buildings, to creating new game cards, or researching new industrial technologies. This minigame is complete with intricate ways of acquiring crafting components, and full support for player to player trading, and persistent item crafting economy.\nMMO Community Environment\nWhile all online interaction is completely optional, players can experience persistent mmo environment, with huge player community waiting to welcome you. Make friends, join guilds and alliances, master player driven crafting economy, engage friends in coop and challenges, or compete to become the ultimate warrior in progressive player ranking and tournaments.\nSkirmish Gameplay\nKW2B offers complex city-building and economy model in a fast paced skirmish environment, offering extremely wide range of short-term and long-term strategic options. With free base building, intricate stronghold design, realistic siege combat, complex economic model, and dozens of units – players can craft the ultimate playing style – from numerous rushing opportunities, to a defensive play-style, that can still bring victory.\nLong term tech-tree progression\nAs players fights across the battlefields, his avatar level ups unlocking various crafting combination to create one of many game cards. This complex system adds a great deal of management and long-term strategic thinking as players unlock and build their card decks to ensure victory in battle.\nThree truly Distinct Races\nFeaturing three truly distinct civilizations: Humans, Orcs and Elves – KW2:B brings players three unique was to play the game, and countless hours of late-game progression for each race. Every aspect of each race was designed to be unique – from economy, to base building, unit roles and tactics. Each race comes complete with over 60 unique crafting opportunities, with unique tech-tree progressions and their own deck of playing cards.\nStrategic Card Game\nAs players’ fights across the battlefields, strategic card game comes into play. Players can build endless combinations of playable card decks that they acquire through crafting. During multiplayer battles players will pit their decks against each other to try and turn the tide of a battle. This complex system adds a great deal of management and long-term strategic thinking.","imageUrl":"https://media.rawg.io/media/screenshots/742/74248ad3af9e14c91f99aa9161664c39.jpg","releaseYear":2016,"developer":"Reverie World Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13266,"name":"Hooligan Vasja","genre":"Action","price":0.0,"description":"Hooligan Vasja that is a colorful and entertaining time killer.\nYour goal is to reach the roof, fighting with different opponents. There is a powerful boss just under the roof. Be careful, the obstacles are extremely dangerous but you can knock them down. The first level is easy but the following ones are progressively more difficult. The opponents become faster and meaner. Your weapon is a sturdy slingshot and firecrackers. Protect your friends who are helping you.FeaturesOnline Leaderboard, various achievements and collection cards will warm up your gaming experience.VasjaVasja is a hooligan. He is always up for some mischief.MashaGrammy Masha is a kind person but likes to spread gossip.StepanGramp Stepan is very grumpy and always displeased.SvetlanaSvetlana is a blonde girl neighbor who just loves herself.SlavikSlavik dreams of becoming a chef. A big foodie.ClownThe clown loves his job but hates children.","imageUrl":"https://media.rawg.io/media/screenshots/3eb/3ebd784272683451ca752211442b9eec.jpg","releaseYear":2016,"developer":"Trident Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12105,"name":"Imagine Earth","genre":"Strategy","price":0.0,"description":"Planetary Colonization\nImagine Earth is a real-time planet simulation and a build up strategy game. Your job as a space colony manager is to explore and populate distant planets. Build up thriving and profitable colonies on a global scale and trade resources and goods into space.Expansion & Research\nRaise great cities and satisfy their appetite for resources by building power plants, farms and factories. Dig for ideon crystals, pacify riots, research technologies and constructs and maximize your growth while maintaining a healthy ecosystem.Allies, Threats & Enemies\nGet ready to deal with threats like asteroid strikes, twisters, wild fires, volcanoes and rising sea levels. Fend off space raiders and alien investors. Coexist and trade with natives, merchants and hostile colonies.Capitalist Space Age\nIn 2048 huge corporations have divided Earth among themselves and exploited its natural resources to a large extent. Now the discovery of ideon crystals allows journeys into space, while technologically and ideologically almost everything remains the same. The laws of the market are being spread into the universe.Competition and Economic Warfare.\nOn each discovered planet a competition for economic dominance breaks out. To expand your colony as fast as possible and overcome your opponents you exploit the freely available fossil resources and minerals. Additional money is provided by selling shares of your colony. Take over opposing companies by buying up their shares.Trade Resources and Technologies\nMerchants and technology traders organize the interplanetary trade and will happily buy all minerals and resources you extract from your territory while selling expensive technologies. The same goes for cooperating colonies and alien tribes that live on some of the planets.Profits vs. Ecocide\nYou will experience a massive conflict between the profit goals of the interstellar corporations and the need to preserve living conditions for your people. Exhaust emissions and ground pollution impact the global climate as your colony is growing. Increasing temperatures melt down polar caps and your colonies are destroyed by rising sea levels.Features Global and realtime world experience instead of playing on limited square maps.\nFully playable and story based campaign with 7 planets / missions.\nFreeplay mode with a procedural planet generator for endless worlds and challenges.\nCompetition mode for matches against up to 4 AI corporations per planet.\nPlanet Editor for terraforming, building and customizing individual planets which can be saved and shared.\nDevelopment of over 30 colony buildings with individual upgrades\nGlobal simulation of local pollution and worldwide emissions\nDisasters: Chemical spills, oil slicks, radioactive contamination, wild fires, tornadoes, volcanoes, dying forest and growing deserts, alien and robotic invaders, etc.\nMelting polar caps will raise sea levels and flood your coasts in case of global warming[/list]","imageUrl":"https://media.rawg.io/media/screenshots/110/1108855a4eafa7184ac58a6fcb1d7db1.jpg","releaseYear":2021,"developer":"Serious Brothers","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10290,"name":"Ballistic Overkill","genre":"Action","price":0.0,"description":"\"It's insane, fast paced, and action packed in a way that's fun, and tactical.\"  Spifferino, Steam User\n\"Can be enjoyed by both casual and competitive gamers.\" Skyrunes, Steam User\n\"I've really enjoyed playing this game through different versions to watch it evolve and once it's finished it's going to be a really fantastic game.\" Liamdawe, Gaming on Linux\nBallistic Overkill is a fast paced PvP shooter. Easy pick up and play, no complicated setups or rules: it’s kill or be killed!\nOver 80 weapons\n7 Classes\n10 Maps\n4 Game Modes\nSteam Market integrationClasses\nSelect one of 7 classes, each with their own skills and weapons. Make multiple loadouts with each, creating different builds within the same character. No wimpy support classes, in Ballistic everyone is a killer!\nBerserker – deadly close combat rushdown expert\nVanguard – master of field survival and assault specialist\nWraith – infiltrator and ranged assassin\nShadow – master of speed and stealth assassinations\nGrenadier – bane of the campers and explosions maniac\nTank – towering machine-gun toting survival expert\nMarksman – perceptive and adaptable intelligence specialistSteam Market\nWith over 80 weapons ingame, there's ever a new way to kill your enemies in Ballistic. But even better, all weapons have droppable skins that you can trade and/or sell through the Steam Market system. Every couple of months, the drop Season changes, allowing players to drop different skins and seek different accessories.\nClass based lockboxes\n2-4 drops per week\nNo keys required to open lockboxes\n5 different item rarities: common, advanced, special, elite and legendary\nCollect skins to gain access to special season based accessoriesMaps and Modes\nFrom parks, to malls, to abandoned hospitals and factories, Ballistic covers a wide variety of locations in its 10 maps. Some are large and some are small, but all of them have personality and something that makes it unique. All maps have multiple game modes available, including:\nTeam Deathmatch\nFree for All\nCapture Point\nKing of the Hill","imageUrl":"https://media.rawg.io/media/screenshots/cea/cead8f8b8e34f96d6f222d66a0395ac9.jpg","releaseYear":2017,"developer":"Aquiris Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9624,"name":"Herald: An Interactive Period Drama - Book I & II","genre":"Adventure","price":0.0,"description":"Media\nhttps://www.theguardian.com/technology/2017/feb/27/games-reviews-roundup-herald-tank-troopers-she-remembered-caterpillars\nhttp://nl.ign.com/herald/96673/review/herald-review\nhttp://www.polygon.com/features/2017/3/9/14862444/herald-review\nAbout the GameHerald is a choice-driven adventure game set during an alternate 19th century in which the West is united as a colonial superpower: the Protectorate.\nHelp tell the story of Devan Rensburg, a man of mixed heritage who became steward on board of the HLV Herald, a merchant ship set for his country of birth.\nAs Devan it is your job to keep the peace among the crew and passengers by resolving their daily squabbles. Set during a time of widespread inequality and injustice, you are challenged to uncover a great mystery that surrounds the Herald's perilous voyage.\nTogether, Herald Book I & II have around 4 hours of gameplay. Each Book has its own contained story. Book III & IV will tell new stories of Devan's adventures and will be released as episodic content at a later date. Key Features\nA branching narrative that changes depending on how you decide to play. Do you choose to be bold and stand up for the downtrodden, or would pleasing the elite be the safer and smarter choice?\nUncover all of the secrets aboard the merchant clipper Herald, as you explore its many nooks and crannies.\nThe Herald is a microcosm of 19th century society. The crew and passengers all have their own dark secrets and often use sly coercion to convince Devan to help them. But who can you trust?\nHerald's diverse cast of characters is brought to life by beautifully animated portraits, and the performances of thirteen talented voice actors.\nHerald is set during an alternate 1857 in which the West has been united as a single global superpower: the Protectorate. Governed not by kings but by an elected 'Lord Protector’, the Protectorians believe they are morally superior. But are they?\nA gripping tale about finding your place in a world divided by race, class and culture.\nCONTENT WARNING: Emotional and physical violence, suggestive themes and infrequent use of strong language. Suitable for ages 12 and up.","imageUrl":"https://media.rawg.io/media/screenshots/424/42488e955ee7fcb9219d38ff44b88573_Qj2anIL.jpg","releaseYear":2017,"developer":"Wispfire","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1525,"name":"Masquerade: The Baubles of Doom","genre":"Action","price":0.0,"description":"Masquerade is an action-adventure set in the fantasy world of The Realm, centered around a battle for the mythical Druid Orbs, the most powerful pair of balls in all the land. For it was said that whomever possessed the Orbs, possessed the power to rule all. From foreign shores came the Clowns, an army of morose maniacs determined to find the Orbs. And so began the Great Clown Invasion.\nJoin Jaxx, the wise-cracking jester, and his beautiful enigmatic partner in crime, Comedia. Armed with a map that reveals the secret location of the Orbs, Jaxx and Comedia soon find themselves on the run from the Clown Army. With Comedia captured, you must guide Jaxx to rescue her AND stop the map from falling into the hands of those diabolical, evil, merciless, despicable, Clowns!","imageUrl":"https://media.rawg.io/media/screenshots/bc7/bc767c12c34c1f5b37bdfc75e3551713.jpg","releaseYear":2016,"developer":"Big Ant Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":517,"name":"Alto's Adventure","genre":"Action","price":0.0,"description":"Above the placid ivory snow lies a sleepy mountain village, brimming with the promise of adventure.\n\"A piece of interactive art\"\n– WIRED\n\"Best of 2015\" and \"15 Most Beautiful Games\"\n– Apple\n\"Favorite Apps of 2015\"\n– The New York Times\n\"One of the best mobile games\"\n– The Verge\n\"Alto's Adventure demands your attention\"\n– IGN\n\"2015 Game of the Year\"\n– Product Hunt\n\"Best 2D Visual Experience\"\n– 2015 Unity Awards Finalist\n\"One of the best-looking games on the App Store\"\n– VICE\n“The visuals really are incredible”\n– TouchArcade\n“Simply stunning”\n– Red Bull\n\"Best Looking Video Games of 2015\"\n– TIME\n\"Wonderfully tranquil and beautiful\"\n– Engadget\n\"Best iPhone apps of 2015\"\n– Mashable\n\"I couldn't let Alto's Adventure slide by me\"\n– Destructoid\n\"Alto’s Adventure for iOS may be the most beautiful endless runner you’ve ever played\"\n– The Next Web\n\"Pristine and refined\"\n– LA Times\n\"An engaging, relaxing, and beautiful experience.\"\n– MacStories\n\"Satisfies the soul\"\n– TechCrunch\n\"Alto's Adventure is the endless runner matured\n– Kotaku\n\"Alto’s Adventure is remarkably soothing\"\n– The New York Observer\n\"Favorite game of the year\"\n– BuzzFeed\n\"A joyous experience\"\n– GameSpot\n\"One of my favorite games\"\n– AppAdvice\n\"Alto is lovely\"\n– Eurogamer\n\"It’s seriously stunning\"\n– Macworld\n\"Alto's Adventure is a brilliant mobile game\"\n– PocketGamer\n\"A beautiful visual experience\"\n– CNET\n\"An elegant ride down nature's greatest landmarks\"\n– Kill Screen\n\"A compelling game to play\"\n– The Washington Post\n\"Every inch of this game is visually impressive and delightfully charming\"\n– Business Insider\nJoin Alto and his friends as they embark on an endless snowboarding odyssey. Journey across the beautiful alpine hills of their native wilderness, through neighbouring villages, ancient woodlands, and long-abandoned ruins.\nAlong the way you'll rescue runaway llamas, grind rooftops, leap over terrifying chasms and outwit the mountain elders – all while braving the ever changing elements and passage of time upon the mountain.\nFeatures:\n• Fluid, graceful and exhilarating physics-based gameplay\n• Procedurally generated terrain based on real-world snowboarding\n• Fully dynamic lighting and weather effects, including thunderstorms, blizzards, fog, rainbows, shooting stars, and more\n• Easy to learn, difficult to master one button trick system\n• Chain together combos to maximize points and speed\n• Test your skills with 180 handcrafted goals\n• Discover six unique snowboarders, each with their own special attributes and abilities\n• Challenge your friends with Game Center. Compete for best high score, best distance, and best trick combo!\n• Acquire the wingsuit from Izel’s workshop for an entirely new gameplay dynamic\n• Beautifully minimalist and evocative visual design\n• Original music and handcrafted audio for an ambient and immersive experience (headphones recommended!)\n• Universal app with iCloud support. Play on your iPhone and iPad and your progress will always be in sync.","imageUrl":"https://media.rawg.io/media/screenshots/4db/4dbe6762d5b7721e7ac412d6ab7661db.jpg","releaseYear":2015,"developer":"Noodlecake Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":360,"name":"Final Fantasy Tactics: The War of the Lions","genre":"Adventure","price":0.0,"description":"※This is an important notice for players of SQUARE ENIX games on the iOS platform.\nApple has officially announced the release of its iOS 9 Beta.\nHowever, since our apps are not compatible with the iOS 9 Beta at this time, we regret we are unable to provide customer support for any trouble arising from installation of this OS (including, but not limited to, data recovery or undelivered in-game currencies).\nhttp://www.jp.square-enix.com/info/1507_ios9en.html\n[Version 1.2.0]\n■Refined Graphics\nAll of the game's unit graphics have been redrawn in high-resolution. Don't miss this chance to play the sharpest, most beautiful FINAL FANTASY TACTICS yet!\n■Improved Draw Speeds\nThe graphic drawing processes have been optimized for mobile devices. Say goodbye to choppy motion and crash bugs, and play with the quickest, smoothest abilities effects and animations to date!\n■iCloud Support\nA save slot which allows game data to be saved to iCloud has been added. It is now possible to migrate game data across multiple devices.\n----\n■ Important information\nYour auto-save data will be erased when you update. Please use the normal save function before performing the update.\n---\n-Supports iPhone 3GS, iPod touch 3rd generation and later devices. For the best experience, play on iPhone 4, iPod touch 4th generation or later devices.\n-Runs on iOS 4.0 or later.\n-This app is for iPhone, so may not work correctly when played on iPad.\n---\n[Version 1.1.1]\nThe following features have been added:\n- Added ability to skip cut scenes.\n- Other minor bug fixes.\nThe following updates are planned in order to further improve your enjoyment:\n- Higher resolution unit character graphics.\n- Added ability to fast-forward battle scenes.\n---\nFinal Fantasy Tactics: The War of the Lions has arrived for iPhone/iPod touch!\nReleased as the Final Fantasy series' first tactical RPG in 1997, Final Fantasy Tactics on Playstation went on to sell over 2.4 million copies worldwide. The game grew in popularity upon its re-release in 2007 as Final Fantasy Tactics: The War of the Lions for the PSP with added features such as new movies, scenarios and Jobs.\nNow, in 2011 the game has finally arrived for the iPhone/iPod touch! You can enjoy the game whose story gave life to the world of Ivalice, and whose high strategy battles bring tactical games to a whole new level.\n■Game features\n- Intuitive Touch Screen Controls\nThe complex tactical game can be effortlessly and intuitively controlled by simply tapping units and menus. Gone is the old method of switching fixed map views - you can now rotate, move and change the size of maps as you please by sliding and pinching.\n- Improved Loading Times\nLoading times have been improved to get you into the action quicker than ever. What's more, you can even skip certain cut scenes.","imageUrl":"https://media.rawg.io/media/games/d0a/d0affccf7936505528f278a597b9422e.jpg","releaseYear":2007,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PSP"}]},{"id":163,"name":"Planar Conquest","genre":"RPG","price":0.0,"description":"Planar Conquest is a 4X turn-based strategy game inspired by Master of Magic. Created to give you that awesome feeling of the gameplay of the past, wrapped into modern look. “eXplore, eXpand, eXploit, and eXterminate” are the four words which are here to provide fun and challenge.\nCustomize your character and become all powerful Sorcerer Lord to rule the empire or choose a pre-generated character. Select from 13 spell circles that will determine which of the over 300 spells your lord can learn. Choose from over 40 disciplines that give your lord specific advantages or disadvantages, and will allow you to adjust your character to your gameplay style. Magic, military, diplomacy and economy can be harnessed to serve you.\nSeven procedurally generated Planes of Existence all with their own special features, that can be customized with the shape, landmasses and size even up to 128x128 tiles. Over 40 types of locations that can be examined in search of various loot and fight with the guardians that protect those.\nOver 40 different kinds of buildings to improve your settlements, over 150 unique military units to recruit and magical creatures to summon among with possibility to found new settlements to increase your empire's power and conquering neutral and enemy cities to extend your borders gives long hours of gameplay.\nUse diplomacy to get an edge over your enemies.\nPlay out combat on a tactical battle board.\nHire heroes and equip them with magical weapons and armor.\nRecruit unique and powerful Titans and make them to follow your orders!\nGain experience and make units more powerful as they achieve victory after victory.\nUse tactical, strategic, and global spells to destroy your enemies.","imageUrl":"https://media.rawg.io/media/screenshots/762/762a9a2a959c97e9164f36f22a4adff1.jpeg","releaseYear":2016,"developer":"Wastelands Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":692672,"name":"I MAED A GAM3 W1TH Z0MB1ES 1N IT!!!1","genre":"Action","price":0.0,"description":"After over a decade of top-secret research, an international cabal of neuroscientists, systems engineers, and Chaucer scholars is pleased to announce the re-release of I MAED A GAM3 W1TH Z0MB1ES 1N IT!!!1 .This release represents the culmination of 12 years of focused interdisciplinary investigation and improv cults, and its groundbreaking achievements in design, philosophy, and metaphysics are poised to disrupt, enthrall, and terrify.\nThis top down twin-stick shooter will bring you tremendous amounts of fun. The best selling Xbox Live Indie Game of 2009, I Made A Game With Zombies In It!!! has been revamped with a whole new engine! The game now supports keyboard and mouse, has a flashing lights reduction mode, and will soon even have ONLINE MULTIPLAYER!! Despite being free, we will be adding a few new features and bugfixes over time to improve the game even further. Despite only taking 10 minutes of your time, we know this is a game we just know you will play again and again! There’s a reason why Youtube videos of this game have comments sections filled to the brim with requests for a Steam port.\nSo what are you waiting for?!\nLET’S KILL SOME ZOMBIES!!!1!","imageUrl":"https://media.rawg.io/media/screenshots/81e/81e3cf5ff659fae7ac891f0c6d18acb2.jpg","releaseYear":2009,"developer":"Ska Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":663740,"name":"MADiSON","genre":"Action","price":0.0,"description":"What would you do if you woke up locked in a dark room, with your hands covered in blood? Play as Luca, and endure the brute torture of MADiSON, a demon that has forced him to continue a gory ritual started decades ago, making him commit abominable acts. Will you be able to finish this sinister ceremony?","imageUrl":"https://media.rawg.io/media/games/0d6/0d663de3fb5447f292dd0630d1a93802.jpg","releaseYear":2022,"developer":"BLOODIOUS GAMES","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":499350,"name":"Creatures of Aether","genre":"Strategy","price":0.0,"description":"Creatures of Aether is a free to play card game created by Tako Boy Studios in collaboration with Dan Fornace and the Rivals of Aether team. Collect elemental creatures from around the world of Aether including powerful Rival cards from the indie fighting game, Rivals of Aether!\nInspired by the card game, Triple Triad, Creatures of Aether blows the doors off the formula with its elemental gameplay. Once you learn the basics of flipping cards, you'll need to account for the four elements and powerful abilities to turn the board to your favor.\nCreatures of Aether features a ranked ladder with online cross-platform PvP matches. Matches are around 3 minutes long and matchmaking pits you against players with similar skills.\nEarn Medals to climb the ladder and reach the Master tier to earn yourself a free Rival card! Once you hit Master, the race is on to the top of the leaderboard, but be careful because you can also lose medals in the Master tier!\nCreatures of Aether features over 150 unique elemental cards each with their own set of numbers. The four numbers on the cards determine it's power in that direction. Place a card with a higher number facing a card on the board to flip it to be under your control!\nBut where Creatures of Aether really shines is the card abilities! After you master the 15 unique card abilities, you'll be able to build a deck that can counter any strategy. Multiple deck types are viable at the top level and its up to you to decide what kind of deck you want to build!\nCreatures of Aether features a fun single player experience to obtain more cards known as Dungeons. These miniature roguelite experiences require Abyss Orbs to enter in exchange for fantastic rewards. Players are given a new dungeon deck and must improve their deck by defeating computer opponents in 3x3 and 4x4 board battles.\nThroughout the Dungeon, you'll encounter some awesome rewards including chests, boosters and even a safe that allows you to add a card from your Dungeon deck to your loot. At the end of the Dungeon, is the Dungeon Boss who has powerful cards from a single element. Beating the boss allows you to take a large stack of one of their cards!\nOne of the most exciting features in Creatures of Aether are the Rival cards! These cards act like classes or heroes in other card games and give your deck its flair. You need to have a Rival card and can only have one in your deck. Your opponent can also see which Rival you are using.\nThere are 16 Rivals in the game and each of them mix up your strategy. The cards are pulling from characters across the Aether Universe featuring favorites from both Rivals of Aether and the upcoming Dungeons of Aether.\nCreatures of Aether is the perfect card game if you are looking for deep and strategic gameplay with a short match time. There are always improvements you can make to your deck and strategies you can adjust in order to make sure the board ends in your favor!","imageUrl":"https://media.rawg.io/media/screenshots/0e8/0e8511e78126c3e9a9170488c4e94863_OpbDrMQ.jpg","releaseYear":2020,"developer":"Dan Fornace","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":392381,"name":"Paunch","genre":"Action","price":0.0,"description":"SEASON I Map: Highlands\nCharacter: Bob\nAbout the GameWith 12 lives for two, players must fight to gain points from each kill. The containers of life are boulders freely moved by characters in the arena and used for throwing. In melee the characters interact using their muscles and initiate aimed hits. Having exhausted all containers, the game enters the final stage, where the victorious player takes the points earned.\nMECHANICS\nProcedural placement of arena\nInteraction with environments\nProcedural melee attacks\nMATCH OPTIONS\nQUICK - duel with a random opponent (season points)\nFRIENDLY - invite an opponent for training from your friends list","imageUrl":"https://media.rawg.io/media/screenshots/182/182fd7676b1b6442b3a5a5104e14961d.jpg","releaseYear":2019,"developer":"Kozhakov","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":375285,"name":"Voidtrain","genre":"Action","price":0.0,"description":"A fresh take on the survival genre - you control and upgrade your own train in an endless adventure full of surprises and dangers.\r\nYou play as mechanics who have fallen into a new world for them with their own rules and laws. Discover it, learn to survive in it, explore it. Immerse yourself in a new amazing adventure.\r\nOn the way you will meet outlandish creatures, many secrets, puzzles and challenges. Gather resources for crafting useful items and structures that help in your survival. Customize the train the way you want to, as you adventure between the amazing worlds of Void Train.\r\nFeatures\r\n- The Interdimensional Express\r\nStart with a tiny trolley. What comes out of it further depends on you. Build, expand, customize, choose the type of engine between different eras - and play the game your way!\r\n- Discover the void world\r\nTogether with your mechanic, learn to survive in a new environment. A unique world with its own rules - where gravity sometimes does not apply. Gather resources, explore the stations and islands scattered along the way, and hunt the creatures that inhabit them.\r\n- Unique adventure\r\nThe generation of the environment, events and objects around the player, as well as the choice of the player himself, will make every adventure you have in Voidtrain truly stand out. Each time there's a new path to go on, new lands to discover, and a new train to build!","imageUrl":"https://media.rawg.io/media/games/22e/22e49e87493d05768f5c9dd3b07ce603.jpg","releaseYear":2023,"developer":"Nearga","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":359368,"name":"Miss Neko","genre":"Action","price":0.0,"description":"Together the full picture of all the lovely beast ladies with your own hands, play Yakyuken with them, collect their portraits. Hope you have a relaxing and enjoyable game time:)\nGAME FEATURES:\n- Many different attributes of the lovely beast ladies\n- - The most classic YAKYUKEN\n- - -  more Super puzzle challenge levels\nInstall the free DLC to unlock some adult content :)\nThank you very much for supporting this game.\nIf you like this game, please recommend it, thank you again!","imageUrl":"https://media.rawg.io/media/screenshots/7a0/7a01490bf5f9b8a3a9aadd7a9b2d1b34.jpg","releaseYear":-1,"developer":"Double W","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":62134,"name":"Good Pizza, Great Pizza","genre":"Simulation","price":0.0,"description":"Ever wanted to know what it feels like to run your own Pizza shop? Do your best to fulfill pizza orders from customers while making enough money to keep your shop open. Upgrade your shop with new toppings and equipment to compete against your pizza rival, Alicante!GAME HIGHLIGHTS\nFeaturing Pizza News Network (PNN), the first newscast about all things pizza.\nOver 80 customers with unique pizza orders and personalities.\nPizza toppings including pepperoni, sausage, onions, and more.\nEquipment upgrades to help you become the master ovenist.\nSimple, fun and challenging gameplay.\nCreated by pizza making professionals; the game artist worked in a pizza kitchen for four years!\nGOOD PIZZA, GREAT PIZZA has been downloaded over 20 million times and is now available for Steam! This is a premium version of the game with new game balancing and no in-app purchases.","imageUrl":"https://media.rawg.io/media/games/5e8/5e855f2573af62ba6554f89e225e8573.jpg","releaseYear":2023,"developer":"TapBlaze","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":57049,"name":"Golden Axe III (1993)","genre":"Action","price":0.0,"description":"Golden Axe III (ゴールデンアックス III) is a side-scrolling beat 'em up video game developed and published by Sega, released for the Sega Mega Drive in Japan on June 25, 1993. A North American version was released only for the Sega Channel. The game was later re-released a number of times, as part of the Sega Genesis Collection for PlayStation 2 and PlayStation Portable, Sonic's Ultimate Genesis Collection for Xbox 360 and PlayStation 3, and digitally on the Wii Virtual Console.","imageUrl":"https://media.rawg.io/media/screenshots/2f3/2f357294ebdc208724ed2dd433edf3a6.jpg","releaseYear":1993,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Genesis"}]},{"id":53232,"name":"Desert Strike","genre":"Desconocido","price":0.0,"description":"Desert Strike: Return to the Gulf is a shoot 'em up video game released by Electronic Arts (EA) in February 1992 for the Sega Genesis. The game was released on several other formats such as the Super Nintendo Entertainment System, including a much upgraded version for the Amiga home computer. The game was inspired by the Gulf War and depicts a conflict between an insane Middle Eastern dictator, General Kilbaba, and the United States. The player controls a Apache helicopter and attempts to destroy enemy weapons and installations, rescue hostages and capture enemy personnel, while managing supplies of fuel and ammunition.\nLead designer Mike Posehn had no video game experience prior to developing Desert Strike. Inspired by Choplifter, he aimed to create a nonlinear game with smoothly animated vehicles. Posehn developed a camera system with momentum to mimic realistic helicopter movements. Three-dimensional (3D) modeling was used to generate the vehicle sprites, which were later touched up on the pixel level with color.\nDesert Strike was a commercial success: it was a chart-topping best seller and at the time Electronics Arts' highest selling game. The game also received a favourable critical response, with several magazines awarding scores of over 90%. Reviewers praised the game's enjoyability, mix of action and strategy, graphics and sound. There was some controversy regarding the game's subject matter, with commentators criticising it as in poor taste due the proximity of its release to the recently ended Gulf War.","imageUrl":"https://media.rawg.io/media/screenshots/be2/be2a71bfbcb742306eee40fdfc6e6948.jpg","releaseYear":1992,"developer":"Electronic Arts","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Genesis"},{"id":0,"name":"Commodore / Amiga"}]},{"id":50125,"name":"Star Wars: Imperial Assault - Legends of the Alliance","genre":"Adventure","price":0.0,"description":"Legends of the Alliance is a companion app for the Star Wars: Imperial Assault board game, a scenario-based game of tactical combat. When you play with Legends of the Alliance, the app assumes the role of the Imperials, while you and your friends form a team of Rebel heroes fighting to bring down the Galactic Empire.\nLegends of the Alliance introduces a completely cooperative way to play Imperial Assault, freeing you and your friends to work together to overcome challenges set before you by the evil Empire. With a full campaign featuring exciting new missions and the ability to incorporate your entire collection of physical Imperial Assault products, Legends of the Alliance provides a thrilling new way to experience Imperial Assault!","imageUrl":"https://media.rawg.io/media/screenshots/0ca/0ca21c323db76bed15463a364d0e8e53.jpg","releaseYear":-1,"developer":"Fantasy Flight Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":49963,"name":"PRO EVOLUTION SOCCER 2018 LITE","genre":"Sports","price":0.0,"description":"A free-to-play version of \"PES 2018\" is here!*\nNow you can play the Online myClub and PES LEAGUE Mode, as well as the Offline Exhibition Match and Training Mode all for free!\nCreate your very own dream team with myClub, where current and historic superstars can be signed. World renowned legendary players like Beckham and Maradona feature, as well as partner club legends Liverpool's Gerrard, Owen, McManaman, and Inter's Zanetti, Stanković, and Toldo. More Legend players will appear in-game throughout the year in myClub!\nAim to be the best PES player in the world by competing in this season's PES LEAGUE. Users will be able to qualify for global events by participating in the  CO-OP (3v3) ONLINE Championship, tournaments in limited term, or the newly introduced PES LEAGUE myClub - either in 1v1 or  CO-OP competitions.\nPES LEAGUE is an online mode which features exciting tournaments to compete against each other to become the best PES player in the world.\n(*Offers in-app purchases)","imageUrl":"https://media.rawg.io/media/screenshots/5ee/5ee90cffecffd4d14505069bb43a04a8.jpg","releaseYear":2017,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":46779,"name":"Humanity Must Perish","genre":"Simulation","price":0.0,"description":"Humanity Must Perish is a short, comedic visual novel. It has only one choice, which determines the ending.\nAs an android whose sole purpose is to save planet Earth from destruction at the hands of mankind, Kyuu minces no words as she announces her plans to extinguish the human race.\nFor the sake of preserving planet Earth, humanity must perish. Failing that, mankind must be enslaved. Those are the only two options, and if Kyuu has her way, the former will soon become a reality.\nBefore she can do so, however, her creator makes a proposition: Kyuu will spend one day among regular, everyday human beings, judging for herself whether they are capable of meaningful change or not.\nKyuu accepts this proposition, and thus sets out into the world for the first time, coming face to face with a variety of odd individuals as she decides the fate of mankind.\nWill Kyuu's colorful encounters show her the good in human society? Or will the bizarre antics of those who she meets reaffirm her belief that mankind must be destroyed?\nWhatever her decision may be, the impressions Kyuu leaves on those she meets won't soon be forgotten. She is a harsh critic, and for a race as flawed as mankind, her observations and misunderstandings will be boundless.","imageUrl":"https://media.rawg.io/media/screenshots/727/727624c37cd4302c61e16d87d7814f01.jpg","releaseYear":-1,"developer":"Zetsubou","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":45709,"name":"Robothorium","genre":"RPG","price":0.0,"description":"Robothorium is a futuristic turn-based RPG combining rogue like gameplay and turn-based combat. Lead a robotic uprising by playing the AI, choose your allies by taking decisions and manage your team of robots to free them from the Human domination. Get the best items for your characters and specialize them through their talent trees to succeed in an advanced combat system!Synopsis\n2052. Planet Earth. BreakTech, an enterprise specialised in robotic construction, is flourishing thanks to thorium, an unlimited and innovative power source. After many years of exploitation, robots are finally protesting for their rights. But the peaceful movement is quickly escalating to riots and the human repression is near. Now seen as a first degree threat, robots are hunted down and culled throughout the planet. You, S.I.A, an enhanced artificial intelligence, have to end this surrounding chaos and build a future for your robots. Unite with the new rebel factions, which have been engaged in turf war for months, then deal with cyborgs, humans and robots to lead your own robotic uprising.Gameplay\nPlay an AI to lead your own robotic uprising and deploy your robots in many places from factories to highly secured laboratories with different objectives to achieve. Select the best robots combination to succeed in your missions and to overcome traps and enemies guarding experimental projects or top secret datas. Upgrade the skills of your robots with their talent trees to make them even more efficient and dispose them strategically to achieve victory. Craft your equipment with components gathered during your missions thanks to an intuitive but deep crafting system. Complete randomly generated campaign levels and take decisions to choose your allies and your enemies. Build your own factory, orbital base or hangar in which you can spread traps and guards to prevent other players to steal your datas!Features\nCampaign mode with different types of missions and a storyline\nRandomly generated levels and enemies scaled with your level\nWide assortment of exciting environments, locations and fearsome enemies\nDeep sci-fi universe with a lot of philosophy and reflection\nDecisions to take to choose your allies and your enemies\nVisual evolution of your robots when you equip them with different weapons and armors\nTactical turn-based combat with advanced mechanics\nWide array of skills and Ultimates to choose for your robots\nRandomly generated stats on items depending on their level\nCrafting system featuring many recipes to unlock\nHigh replay value thanks to the random missions generator and level scaling\nOnline arena system with matchmaking and rankings","imageUrl":"https://media.rawg.io/media/screenshots/f07/f07273850ef77200faa153143bee9bbb.jpg","releaseYear":2019,"developer":"Goblinz Studio","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":43764,"name":"TUNNEL DIVERS","genre":"Action","price":0.0,"description":"Welcome to your new line of work, pilot.\nTUNNEL DIVERS is an online free to play action game featuring futuristic space fighters that are specialized in destroying hordes of robots in enclosed spaces. With plenty of ships and weapons, claustrophobia won't be the most dangerous thing in the tunnels.\nTUNNEL DIVERS is free to play and has no pay-to-win attached. Play online with your friends and against other pilots without feeling disadvantaged because you didn't pay for any DLC. The only one who should be paying are the suits from TAC-CORP!\nTUNNEL DIVERS is a lightning fast twin stick shooter, you need to keep your ship on the move while combating hordes of robots or enemy players. Only those with the best reflexes and aim can come out as the top pilot.\nPlay cooperatively with your friends in missions, run the flag in Capture the Flag or just slaughter your enemies in Dogfight mode. More game modes on the way.\nVaporize your enemies with powerful weaponry, from long range laser guns to destructive miniature nuclear bombs.\nCompletely customize how your ship of choice is loaded out with weapons and special modules that can give you an edge in a fight. Earn money by completing matches and unlock more and more equipment.\nPlay missions and competitive levels designed by pilots all around the world. With painless map sharing, you can join a server without worrying if you have the correct files on your computer or not, as the game can automatically pull level files from the Workshop or the server host itself. Using the Workshop is completely free, however you will need to own the TUNNEL EDITOR DLC to create or edit levels.\nEnjoy the musical talent of Gergely Kovács, who composed a full soundtrack for the game. If you like the music, please consider buying the game's soundtrack from him, a link will be available in the game's main menu!","imageUrl":"https://media.rawg.io/media/screenshots/809/809e9cb57d22d689b0a797ab349d5ff9.jpg","releaseYear":-1,"developer":"Spasman Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":35205,"name":"Face of Mankind","genre":"Action","price":0.0,"description":"Face of Mankind is a Massively Multiplayer Online Role-Playing Game (MMORPG) in a persistent world. You control a single character in the science fiction game-galaxy and have access to a variety of ever-changing game-worlds. Thousands of players throughout the game galaxy co-operate, compete or co-exist in a realistic and futuristic world of the 24th century. The plot is constantly evolving, with new missions created constantly. The skill and luck of the players from rival factions change the balance of power. High ranked players create missions which are split and handed down through the hierarchy. The objective of the game is to evolve your character to its ultimate potential, whether that is the accumulation of wealth, power, social status or all three. This may lead you to form an economic faction, a  mercenary faction, or a cybersecurity faction. The game mechanics allow factions to take control of land by planting a hightech flag device which gives them options to install shops, machinery or taxable market terminals on their land. Face of Mankind is a one of a kind sandbox that allows for dimensions of play most games do not offer. Create a government, a crime syndicate, go to war, explore the galaxy.","imageUrl":"https://media.rawg.io/media/screenshots/931/9316d5b7e0b90863ab3e8666df558dbd.jpg","releaseYear":2006,"developer":"Duplex Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":23958,"name":"Metroid Prime: Trilogy","genre":"Action","price":0.0,"description":"Metroid Prime 3: Corruption set a new standard for first-person\nmotion controls in video games. Now it's bringing those controls to the\nrest of the celebrated series, allowing players to experience the entire\nMetroid Prime story arc with the peerless precision of the Wii Remote.\nNintendo announces Metroid Prime Trilogy, a new premium\nthree-game collection for the Wii console that bundles all three\nlandmark Metroid Prime games onto one disc and revamps the first\ntwo installments with intuitive Wii Remote controls, wide-screen\npresentation and other enhancements.\n\nEach game maintains its original storyline and settings, but now Metroid\nPrime and Metroid Prime 2: Echoes let players use their Wii\nRemote to aim with precision as heroine Samus Aran. Based on the\nbreakthrough control system that debuted in Metroid Prime 3:\nCorruption, these new Wii controls bring an entirely new level of\nimmersion and freedom to these milestone games.","imageUrl":"https://media.rawg.io/media/screenshots/b86/b864ce981ace01517c6674723085a0bc.jpg","releaseYear":2009,"developer":"Retro Studios","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"}]},{"id":22175,"name":"Ways of History","genre":"Strategy","price":0.0,"description":"Early Access\nImportant!\nWe are glad to announce that the game has finally been released on Steam.\nA new world is already born and waits for its heroes.\nWelcome!\nAbout the GameHardcore real-time strategy about developing your civilization from the Stone Age to Space Age. Huge world. Thousands of players. 240+ sciences and technologies. About 100 troops. 4 races. 50+ resource deposits. War, trade, science, construction...\nA serious game for adepts of serious strategies. A game round is long enough, but during those months the player dives into a colourful world full of action. And a peaceful flow of life turns into a tornado of actions, events and decisions.Main features in short\nFull 3D battles. Epic fights of thousands men of your army.\n240+ sciences and technologies from the Stone Age to modern times. Development depends on choice of what to research.\nAbout 100 troops. Infantry, artillery, aircraft, fleet, cavalry. Battle elephants and jet bombers. Dirigibles and jaguar-warriors...\nVaried map with 4 climates, full of seas, islands, rivers, mountains and hills. More than 50 resource deposits.\nConstruction of improvements, roads, bridges and new cities.\nMore than 100 different Wonders of the World and buildings. Banks, temples, barracks, recycling stations, castles, market squares etc.\nEverybody can find the suitable role. Bloodthirsty warrior or greedy merchant. Wise scientist of reckless prowler. Purposeful ruler of peaceful farmer.Development, sciences, space (Scientific tree and all the rest...)\nMany features of this real-time strategy are known to all Civilizers.\n\nYou start from a Stone Age little village with a bunch of tribesmen. Development follows the Scientific tree that is already known to some people. It contains almost 250 sciences and technologies.\nNew buildings, possibilities and troops are gradually unlocked.\nThe path of a small village to modern megapolises net goes through Medieval wars, technological revolutions and ages of bloody terror. Players start Nuclear wars or step into the Golden ages while exploring new territories.\nAnd, finally, the SpaceShip...Countries (you are not alone)\nPlayers start to merger into countries soon. This changes the gameplay, bringing it to the new level. Global wars and continental trade unions. Diplomatic collusions and treacherous plots.\nIn general, gameplay is full of different mechanics. A lot of ways to interact with the world and other players.A bit of epicness (you don't need to read this, but we had to write it... moreover, that's the way)\nEverybody can become a great general, and numerous armadas will turn enemies into ashes.\nSomeone, who chooses the way of genial scientist, will find out all the secrets of the Universe. And maybe nations will obey the speeches of the experienced and insidious politician. Perhaps, your cunning merchants will connect powerful empires and remote villages with their caravans, bringing the whole world under control of money...In conclusionIt will be a very long description of the entire Ways of History universe if we start it. The shortest way is to dive into it. And it's worth it...","imageUrl":"https://media.rawg.io/media/screenshots/1e3/1e326a7eccb640c59e984c1a73d6a8df.jpg","releaseYear":2017,"developer":"Glyph Worlds","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21081,"name":"Siege Wars","genre":"Arcade","price":0.0,"description":"Long time ago, when mages ruled the land, common people raised the rebellion against their magic, arrogance and tyranny. They used catapults, ballistas and bombs in the battle against magic castles and powerful spells. Now their destiny is in your hands\nEpic catapult-shooter arcade game. Crush your enemies and their castles before their magic crash you! Unlike most modern catapult games, enemies in Siege Wars can act - periodically cast harmful spells upon your weapons!Features Features:\nmedieval siege weapons - catapults, ballistas, trebuchets and others\n90 unique levels in 5 scenarios\n10 enemy types including bosses!\n32 weapon upgrades\n7 construction materials with different properties\nvarious magic shields, healing spells and much more\nepic music and sound effects","imageUrl":"https://media.rawg.io/media/screenshots/6bc/6bc64d988e6e42b0c72de9d6ecc99f03.jpg","releaseYear":2015,"developer":"RunServer","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":20580,"name":"The Prism","genre":"Adventure","price":0.0,"description":"The Prism is a 2D puzzle platformer about two pixels, 02 and 03 lost inside a vast prison. Unlike a normal prison, this one is alive. It is called the Prism. Its eyes stare from a distance and watch its prisoners carefully, analyzing their actions and breathing down their necks. You will face many challenges but you don't have to do it alone. You can play by yourself or locally with a friend.\nThe game holds many challenges and puzzles. Different elements and environments are added to create more unique situations using the abilities you have been given. As well as that, you will need to use each other as a means of getting past puzzles, opening doors and continuing your journey. The puzzles are challenging, the prism is dangerous and the world is cruel. It is possible to escape, but at what risk?","imageUrl":"https://media.rawg.io/media/screenshots/16f/16f2c4ffc19b42626a5074825b468ace.jpg","releaseYear":2015,"developer":"Nikhil T","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20389,"name":"Commander Cool 2","genre":"Action","price":0.0,"description":"Commander Cool 2 is a four player local coop retro-styled adventure that is destined to be one of coolest game in 2015!\nIT WILL BE FUN THEY SAID, PLAY CO-OP WITH FRIENDS!\nAnd they were right! You need not travel through time alone to find the scoundrel who took off with the time traveling technology! Play in local co-op with up to 4 friends as you battle death dealers dinosaurs!\nTime Travel\nTime travel is the order of the day for Commander Cool and yourself if you can handle the excitement!\nWhen an evil genius, err…curious janitor, gets his hands on a time travel device in a secret lab, the scientist loses his mind and calls in Commander cool to use the rickety prototype in order to hunt down the thief through the stone age.\nWeapons? You say… But of course! And many of them!\nYou will be issued up to 9 crazy weapons of doom and destruction as you adventure through the dangerous eras of the stone age. Use weapons like RS-182 Rainbow Spitting Unicorn and the formidable VW-21.2 Volcano Weapon to annihilate all threats!\nFeatures\n4 Player co-op and deathmatch\n34 exciting levels of game play that takes you back to the Stone Age\n90 Missions\nLevel Editor - {LINK REMOVED}http://workshop.commander-cool.com\nPlay custom levels created by the community\n14 funny player costumes\n9 Crazy weapons of doom and destruction (Rainbow Spitting Unicorn)\nFull controller support\n27+ Achievements\n6+ Steam Trading Cards\n5+ Steam Backgrounds\n5+ Steam Emoticon\nLeaderboards for each level (Speedruns!)","imageUrl":"https://media.rawg.io/media/screenshots/c39/c39a30255be4eb8693ab4ab323a80c27.jpg","releaseYear":2015,"developer":"Orlyapps","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20188,"name":"Elliot Quest","genre":"Action","price":0.0,"description":"Elliot can’t die—but he’s still running out of time. In Elliot Quest, the victim of a rare curse must find a cure before he’s transformed into a demon.\nAfter Elliot’s wife disappears, he falls sick and attempts to take his own life--only to discovers that he can’t die. Plagued by nightmares and growing weaker by the day, Elliot seeks out a local Sage, who tells him that he’s the victim of a rare curse. A demon called a Satar is slowly consuming Elliot’s vitality.\nIf Elliot can’t find a cure to the curse before it’s too late, he will become a Satar. His only hope is to ask for the help of one of the island’s Guardians, who have kept the Satar from taking over Urele. Elliot can’t die—but he’s still running out of time.\nGameplay:\nElliot Quest is an adventure/RPG where players explore the mysterious Urele island in search of an ancient demon. With 5 dungeons to conquer, 16 bosses to defeat, and countless treasures to discover and hidden areas.  Well-balanced gameplay easy to pick up but challenging to master.\nElliot Quest features:\n•\tAn expansive island to explore with over 16 unique bosses\n•\tCustomize your character with an engaging Level Up System\n•\tChain attacks to make enemies drop more items\n•\tExperiment with different magic attacks to defeat Elliot’s enemies\n•\tSolve puzzles to find hidden crystals and access secret areas\n•\tHunt powerful monsters to find powerful weapons\n•\t3 unique endings based on your decisions\n•\tWell-balanced gameplay that’s easy to pick up but challenging to master","imageUrl":"https://media.rawg.io/media/screenshots/9f0/9f02e3f2052be73c37c4451dd63da73c.jpg","releaseYear":2014,"developer":"PlayEveryWare","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"}]},{"id":19984,"name":"Shmadow","genre":"Action","price":0.0,"description":"Inspired by “shmups\" and shadows, Shmadow is a modern twin-stick side-scroller that nods to retro arcade gameplay. Use your light to blast through hidden enemies, unlock new powers, and rack up a high score before the darkness takes over. Upon destruction, bosses drop power-ups that correspond to their defenses.  These power-ups, used in combination with your customized starting ability, will help you fight the next threat that comes your way.  Destroying bosses, dodging bullets,  and the element of darkness create an action-packed experience that will put your speed, skill, and strategic thinking to the test!Features\nInfinite gameplay: Fight your way through endless streams of deadlier enemies\n4 player local co-op: Recruit friends to help you beat back the darkness\n12 special weapons and power-ups\nLeaderboards: crush your friends’ scores and beat players from around the globe\nOriginal adaptive soundtrack\nFull controller support: enjoy the game with controller of your choice\nThree difficulty modes: play in casual, normal, or if you dare, nightmare mode","imageUrl":"https://media.rawg.io/media/screenshots/d82/d82c25a8aa7e7bb20d14702784fc6bc4.jpg","releaseYear":2015,"developer":"Extrokold Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19815,"name":"Mathoria: It All Adds Up","genre":"RPG","price":0.0,"description":"A free educational math RPG that caters to children. The game helps in practicing basic addition skills through drills while adventuring in the land of Mathoria. The game also aims to target educators and gamer parents alike, so that Mathoria can become a bonding tool between them and the children they care for.FEATURES:- Original exterior tileset art by Jeremy Plana.\n- Original music by Nhyne Junio.\n- Drills, drills, drills wrapped in a light-hearted RPG package!\n- Three difficulty levels to choose from. (Difficult mode requires extreme patience.)\n- Simple dialogues that should make it easier for very young children to understand.\n- Fight goons using basic addition skills.\n- Learn new skills as you battle more difficult enemies.\n- Help villagers with their daily math problems and be rewarded with useful items.\n- Collect armor sets that bestow various advantages.\nOUR STORY:The game began as a capstone project from students at the De La Salle - College of Saint Benilde (B-Team). The team had noticed that many elementary school kids are afraid of math, and tried to figure out how we can ease up the situation in our own small way. Perhaps creating a math RPG could be a fun experiment, we thought. The game was tested by kids ages 10 and below, and just before graduating, the team decided to push for publication. We were joined by Asia Pacific College interns for the music and quality assurance.\nOUR TEAM:Lead Designer: Steven Escarlan\nLevel Designer: Blue Vergara\nProgrammer: Francisco Bate\nExterior Tile Artist: Jeremy Plana\nComposer: Nhyne Junio\nLead QA: Neil Alcuran\nProducer/Programmer/Designer: Arvin D. Cabang\nExecutive Producer: Beatrice M.V. Lapa, PhD","imageUrl":"https://media.rawg.io/media/screenshots/a9a/a9a9bd495d0aef9d3a7df83daa4645b7.jpg","releaseYear":2016,"developer":"Senshi.Labs","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19431,"name":"A Golden Wake","genre":"Adventure","price":0.0,"description":"The Roaring Twenties: a bygone era of glitz, glamour, and promise. Nowhere is this more apparent than Coral Gables, Florida. The real estate market is booming and even an ordinary guy like Alfie Banks has a chance to strike it rich.\nBut with the mob on his back, the Great Depression on the horizon, and the Sunshine State’s idyllic waterfront only a hurricane away from total devastation, Alfie finds much more than he bargained for.\nBased on actual events and featuring real life locations and historical figures, you must guide Alfie on his journey to reach the top of the real estate game as he deals with shady salesmen, cutthroat bootleggers, corrupt politicians, and much more, all while swept up in the events surrounding the inception of Coral Gables, The City Beautiful.","imageUrl":"https://media.rawg.io/media/screenshots/5c8/5c84bb06c5bfb3a368eaf06d987ede29.jpg","releaseYear":2014,"developer":"Grundislav Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]