[{"id":1259,"name":"Machinarium","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8cd/8cd179c85bd3de8f79bef245b15075fb.jpg","description":"In the city of robots Machinarium, a gang called \"Black Cap Brotherhood\" is dominating. At first, it all started with the usual hooligan antics, beginning with a slingshot and ending with the theft of the gramophone. However, one of the gang members decided to attack the mayor, infecting his brain with parasites. The mayor manages to call the robot scavenger that will send the bandit to a dump. However, the scavenger by mistake sucks the cleaner Joseph (you play as him). And the bandit washes off, kidnaping Joseph's girlfriend, Berta. From this moment the game begins. \n\nThe most significant difference from other games made in this genre is that the interaction occurs only with those objects that the protagonist can reach. You can also increase and decrease your height (three positions: low standard and high). Also in the game, there are no dialogues, instead of which the system of animated clouds of thoughts is used.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Amanita Design","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":3965,"name":"Binary Domain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bcd/bcd9896b7c3b9fa80e5dcb67c961e2be.jpg","description":"Humanity has just solved problems like global warming - with the help of robots. Robot assistants were American, behaved correctly and differed from people clearly. But one madman from Tokyo began to produce robots that do not know that they are robots - and this can be understood because they look and behave exactly like people. This is a violation of the law, and the team of pros from different countries flies to Japan to forever stop the conveyor of the insane inventor. Robots with problems of self-identification can provide a variety for those fans of tactical shooters who are tired of terrorists and zombies.\nThe game has visually attractive features. The style of opponents, the style of equipping the team of heroes are very attractive and original. Some details of the battles are well presented - bullets knock out picturesque clouds of debris. Locations are less expressive - apparently, so as not to interfere with focusing on the actual combat. A notable feature of the gameplay is the dependence of the relationship in the team on the player's actions. If the team has bad mutual support - lower trust, lower trust - lower effectiveness in combat.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":19056,"name":"S.T.A.L.K.E.R.: Call of Pripyat","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ad/5adab016a307c2902a82b60d487fe287.jpg","description":"With over 2 million copies sold, the new episode of the most internationally successful S.T.A.L.K.E.R. series seamlessly connects to the first part of the Shadow of Chernobyl.\n\nS.T.A.L.K.E.R.: Call of Pripyat takes PC gamers once again into the vicinity of the Chernobyl nuclear reactor that exploded in 1986. This so-called \"Zone\" is a highly contaminated area cordoned off by the military and now is combed through by the so-called stalkers, modern fortune hunters, in search of unique artifacts. In the role of Agent Alexander Degtyarev, who is dressed up as stalker, the player has to investigate the mysterious disappearance of five military helicopters and thereby stand one’s ground against the various stalker groups.\nOne of the first DirectX11 games\nStory begins where S.T.A.L.K.E.R.: Shadow of Chernobyl has ended\nPhotorealistic exclusion Zone : All locations are recreated by their true-to-life prototypes based on photographs\nNew exciting storyline with a number of unique characters\nExtended system of handmade side quests\nNew monsters: Chimera and Burer. New behavior and abilities for all monsters\nNew A-Life system, created using the players’ best-liked elements of the first two games in series\nEmissions considerably influence the world of the Zone\nSleep function added into the game\nNew player’s interface\nPossibility to continue the game after completion in a free play mode\nUp to 32 players can compete in the multiplayer part. Four different play modes and a countless amount of maps are available","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"GSC Game World","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":15642,"name":"The Elder Scrolls IV: Oblivion Game of the Year Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/886/8868f9ea0c91d45316319ebf5dd4fc64.jpg","description":"Oblivion is the fourth part of the acclaimed The Elder Scrolls series. It is set in the high fantasy world of Tamriel, in the Septim Empire. The emperor was recently killed along with his sons, except one that was hidden far from the capital. Before he died, the emperor gave his Amulet of Kings to the protagonist, a prisoner whom the emperor believed to be a future hero he saw in dreams. \r\nThe main character is fully customizable. His or her character class race, gender, age and other attributes are chosen by the player. His quest is to escape prison and find the royal heir. However, since the game is open-world, the player may abandon the central storyline and just wander around Tamriel. You can complete a variety of side quests, join various guilds and factions, or just fight monsters to gain experience. There's an option of \"fast travel\" that allows you to instantly move to an already discovered location.\r\nGame of the Year Edition also contains two expansion packs: Shivering Isles and the Knights of the Nine that expand the game’s storyline. The packs introduce several new locations, two additional factions (the Court of Madness and Knights of the Nine), and a number of new armor, weapons and other items.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":4581,"name":"Crysis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/90f/90fd5e569bc4c4a666c588a732124908.jpg","description":"The game that started the popular Crysis series. You control a member of Delta Force special military squad, codenamed Nomad. Your squad was sent to rescue a group of American archeologists who are about to be imprisoned by North Korea. The archeologists recently made a world-changing discovery that needs to be protected by any means. Soon it turns out your real enemy is not North Koreans, but rather something not from this world. The plot is told partly through cutscenes, but mostly through in-game events that the player participates in.\nAll Delta Force soldiers are equipped with super-powered futuristic Nanosuits, which are the trademark feature of Crysis series. The Nanosuits provide four types of powers that can (and should) be switched on a fly during battles. \"Strenght\" enhances the wearer's abilities in melee combat, \"Armor\" protects him from the damage, \"Speed\" allows you to move faster, and \"Cloak\" renders you almost invisible to opponents. Besides the story mode, there are two multiplayer modes that allow up to 32 players to participate. Instant Action mode is a traditional deathmatch, while Power Struggle mode features two teams (designed to look like American and North Korean) trying to destroy each other’s bases.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":9631,"name":"Sins of a Solar Empire: Rebellion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65c/65c9c15e274705b5fe343e424ce76ec8.jpg","description":"Sins of a Solar Empire: Rebellion is a first standalone and the third overall DLC to the original Sins of a Solar Empire title. It is also a strategy set in space with the science-fiction lore.\n\n###Gameplay\nThe point of the game is to conquer as many planets as possible using the given resources. The protagonist can be chosen out of three races: industrials, aliens and psychics each with unique special abilities.\nThe gameplay process occurs exclusively in online mode, but single battles and succeeds against enemy AI is possible too. However, the campaign as a whole cannot be played offline. \n\n###Key features\nAs in usual RTS, the gameplay is centered around resource management — the title's economy consists of prices on Metal, Credits, and Crystal — each with the individual gain conditions. So it would be impossible for instance to sell all of your metal to the friendly guild — after the wholesale, stock prices decrease and economy shifts towards them like real-life one.\nWhile exploring the world, the player may stumble across habitable planets and anomalies which prevent the player from getting to the goal. Anomalies include asteroids, hostile environment, and ice fields.\n\n###Rebellion DLC\nThe expansion adds two new units into the gams: Loyalist and Rebel — delegates of any races can choose between them. A graphical engine was updated as well.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":10767,"name":"Shadow Tactics: Blades of the Shogun","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c35/c354856af9151dc63844be4f9843d2c2.jpg","description":"The game takes place in Japan during the Edo period (early 17th century).\n\nThe new shogun united Japan after many years of war, but a conspiracy arises against him, the leader of which is hiding under the name Kage-sama. The shogun orders the samurai Mugen to find out who Kage-sama really is.\n\nMugen is unable to carry out the mission covertly, this leads to an open rebellion by the conspirators against the shogun ...\n\n###Gameplay\nShadow Tactics is a real-time tactics video game.\n\nBasically, the player, as far as possible, quietly removes the guards and hides their corpses, secretly moves past the guards. The player has five characters that are not always involved at the same time.\n\n###Characters\nHayato - ninja, can kill opponents at a distance with shuriken and distract them by throwing stones. Dragging corpses on the shoulder. Armed with ninja sword.\n\nYuki is a young thief, can set traps, and also lure guards, playing the flute. Armed with a dagger.\n\nMugen - a samurai, can lure the guards with a bottle of sake and kill several opponents at once. He is also the only one who can defeat enemy samurai in a direct clash. Can carry two corpses at once, moving at the same time with run. Armed with katana.\n\nAiko is a spy who, if she has the right clothes, can change into a peaceful resident to merge with enemies and distract the guards by talking. It has sneezing powder, reducing the visibility area of ​​the guards for a short time. Carries corpses on the ground. Armed with a hairpin.\n\nTakuma is an elderly sniper, can still throw grenades (both explosive and with a paralyzing gas), his tamed raccoon dog named Kuma can distract opponents.\n\n###Opponents\nare armed with guns and are divided into three types:\n\nSimple guards are the least disciplined guards who can be easily distracted or trapped.\n\nStraw hats are more disciplined, will not leave their post without obvious need, they are not deceived by such tricks as Yuki pipe or a bottle of Mugen sake.\n\nSamurais are heavily armored opponents, for their elimination Mugen is needed or the command actions of other characters.\n\n###Others\nIn addition to security, there are civilians on the map who are not aggressive towards the player’s characters, but are often hostile and if they see them, they are reported to the guards. But sometimes there are civilians who will not report to the oppressive guards about the characters.\n\nIn many missions, there are special conditions - such as snow (tracks on the snow attract the attention of the guards), or night (at night the guards see worse, but more vigilant).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":58752,"name":"The Awesome Adventures of Captain Spirit","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/efd/efd6b2cb621c41a2b6580d8ac260b8ba.jpg","description":"The Awesome Adventures of Captain Spirit is an adventure game set in the 'Life is Strange' universe. The game is considered to be a promo for the second part of the series — the entire walkthrough would take roughly more than 2 hours.\n\n###Connection with the series\nThe title indirectly connects the two parts of the game by sharing the characters and following the original timeline — the events depicted in The Awesome Adventures take place three years after the ending of Chloe and Maxes adventures. The game is being distributed for free. The title inherits the importance of the dialogue and in-game choices and emphasizes them by transferring all the options chosen in The Awesome Adventures into Life is Strange 2 by detecting the save file.\n\n###Plot\nAs this was the case with the 'Life is Strange,' the main accent in the Captain Spirit is made on the storytelling.  The events center around Chris Eriksen — the nine-years-old protagonists who are coping with the loss of his mother with the help of made-out alter ago sharing the name with the game's title.\n\n###Gameplay\nThe game consists of several quests player needs to accomplish before finishing the walkthrough. The activities like microwaving the food, supposedly, using the Chris' ultra-abilities are accompanied by a lot of dialogues and in-game puzzles.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":19592,"name":"Hitman 2: Silent Assassin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/683/6833fbb183fd72a61c032501e3bc6d36.jpg","description":"Hitman 2: Silent Assassin is the second part of the Hitman series, which tells us about the killer clone.\n\nThe game takes place in 2002-2003.\nThe story begins after the events of Hitman: Codename 47 (the first part of the series). Agent 47 left a killer job, and now he is trying to start a quiet life, living simply and working as a gardener in a monastery under the patronage of the father, Emilio Vittorio. But life soon turns against him. Mafia kidnaps Emilio. Desperate, 47 switches back to the Agency he previously worked for to ask them to help him find Emilio. The Agency agrees to help him, but in exchange for the fact that he will fulfil several orders. The protagonist accepts.\n\nThe game has fixed a lot of flaws of the first part: the management of the game has been improved and simplified, the first-person view and a suspicion indicator has been added, which allows the player to understand how close the enemies are to reveal him. The ranking system was also added. After each mission, the player receives a rank for the quality of its execution.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":622492,"name":"Forza Horizon 5","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/082/082365507ff04d456c700157072d35db.jpg","description":"Your Ultimate Horizon Adventure awaits! Explore the vibrant and ever-evolving open world landscapes of Mexico with limitless, fun driving action in hundreds of the world’s greatest cars.\r\nExplore a world of striking contrast and beauty. Discover living deserts, lush jungles, historic cities, hidden ruins, pristine beaches, vast canyons and a towering snow-capped volcano.\r\nImmerse yourself in a deep campaign with hundreds of challenges that reward you for engaging in the activities you love. Meet new characters and choose the outcomes of their Horizon Story missions.\r\nTake on awe-inspiring weather events like towering dust storms and intense tropical storms as Mexico’s unique, dynamic seasons change the world every week. Keep coming back for new events, challenges, collectibles, and rewards, and new areas to explore.\r\nTeam up with other players and enter the Horizon Arcade for a continuing series of fun, over-the-top challenges that keep you and your friends in the action and having fun with no menus, loading screens or lobbies.\r\nCreate your own expressions of fun with the new EventLab gameplay toolset including custom races, challenges, stunts, and new game modes. Customize your cars in more ways than ever before. Use the Gift Drops feature to share your custom creations.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Playground Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":19057,"name":"S.T.A.L.K.E.R.: Clear Sky","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68e/68e34eb2122fe9e23f634e0b5f5ea6ae.jpg","description":"The second installment of the S.T.A.L.K.E.R. franchise is set one year before the events of Shadow of Chernobyl and serves as its prequel. You will explore the forbidden area around Chernobyl, Ukraine, after a new disaster that turned into The Zone, a post-apocalyptic wasteland full of mutants. The setting was inspired by a Russian sci-fi book Roadside Picnic and its adaptation Stalker. Scar, the main character of Clear Sky, is a stalker, which in this world is a term for guides and explorers in The Zone. He was hit by an energy beam that gave him a superhuman ability to survive The Zone’s phenomena. Scar joins the Clear Sky, a secret science organization that studies The Zone’s anomalies. Strelok, an important character from the previous game, appears as the main antagonist. \nLike its predecessor, Clear Sky is a combination of first-person shooter gameplay with RPG mechanics like skills, leveling up, dialogue, and inventory. The player is free to explore the open world and accept quests unrelated to the central plot from various NPCs and factions. Compared to Shadow of Chernobyl, the prequel has improved graphics, additional options for customization and equipment repair and a complete day/night cycle.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"GSC Game World","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"}]},{"id":5636,"name":"Rage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a7/8a75028028592f9323d1e6e86668bb91.jpg","description":"The game takes place in the near future. Civilization gradually begins to die out after the meteorite fell to the Earth. You find yourself in the middle of a vast wasteland and discover that humanity is trying to rebuild itself, under constant threat from bandits, mutants, and Power – a tyrannical state regime,which is actively interested in you personally.\n\nYou have to participate in intense firefights with hordes of mutant bandits, trying to save your life. You can also give a try in tight races, and on the proceeds, you will be able to modify your buggy.\n\nThe game has a vast range of hand weapons, and there are both classic weapons from games, entirely new and unique types, exclusives for RAGE. Various optional devices can improve the gun. Also in \"RAGE\" there is an in-game economy, players can spend the game money earned in fights and races. For the money, you can buy new weapons, reinforced armour.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":19410,"name":"Day of Defeat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccc/ccc0d5396e3331d58e5eb58a6a1fa1b7.jpg","description":"Day Of Defeat is a popular Half-Life modification, which resembles a multiplayer FPS set in the European war theatre of World War II and was later released as a full standalone game on Steam. The movie \"Saving Private Ryan\" served as the main inspiration for the mod. In one of the later updates, the movie's sound effects were added to the modification. \n\nPlayers can choose between two teams: Axis and U.S. Army. At the beginning of the round, the teams spawn in their own spawn areas. The goal of either team is to complete their objectives the list of which depends on the map played and prevent the other team from completing theirs. The game ends if one of the teams completes all their objectives or when the time limit expires in which case the team with the most completed objectives wins. \n\nThe list of weaponry resembles those used in the World War II. The game features hard recoil and the players are unable to fire when running or jumping. \n\nThe list of maps offered on game's release consisted of 15 maps which varied in size and locations. The most notable examples are Omaha Beach and Operation Avalanche.\n\nDoD was later ported on Source engine and released as Day Of Defeat: Source.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Valve Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":38,"name":"Injustice 2","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e42/e428e70c97064037326d7863a43a0454.jpg","description":"Injustice 2 is a fighting game developed by NetherRealm Studios.\r\n\r\nThe game begins on Krypton in its last hours. After Brainiac attacked the planet, he decides to destroy it using the beta-bombs. Only Superman and Supergirl survived, as their parents decided to send them to Earth, but these two get separated as the shuttles courses get affected by the planet's explosion. Time passes and Superman becomes a tyrannic Earth dictator, yet Batman destroys his regime at the end of the first game. Batman attempts to rebuild the society after the fall of Superman.\r\n\r\nThe core gameplay resembles the same of the first game. Every character has their own unique set of combos and special attacks. The objective of every fight is to knock out the enemy. The players can use the environment in order to damage their opponent. Every successful attack fills the super meter. Super meter can be used to perform special skills or dodges. Using the full super meter charge allows for a unique attack. \r\n\r\nInjustice 2 features a loot box system. Players can get new outfits with special effects from the crates. An RPG-like mechanics is also present as the characters four base stats can be improved after every fight.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":4491,"name":"Shadow of the Colossus (2011)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ac/6ac602e70c837ababdf025e997391d9c.jpg","description":"PlayStation 2 classic that never made it out of the Sony game system. An eerie and surreal tale about sacrifice and cruelty that the world contains. \n\nPlay as Wander -- young warrior that roams vast and hollow game universe that’s surrounded by sharp cliffs and endless water. He is on the mission to kill 16 gargantuan colossi all scattered around the game world. \n\nEach colossus is a puzzle and can be killed only after solving it. At Wander’s disposal are his sword and bow that helps him climb the beasts. Each one requires the player to come up with a cunning strategy to topple each behemoth. The story is told in a very ascetic way and consists of only two in-game cutscenes. Nevertheless, it helps to build up the atmosphere mystery in the game epos. \n\nDevelopers are no strangers in the dark, atmospheric games such as this: they also behind critically acclaimed ICO that also had been published on PlayStation 2.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":616765,"name":"Marvel's Guardians of the Galaxy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/708/7080e6c87e0825cb02888bf3c44b3889.jpg","description":"Fire up a wild ride across the cosmos with a fresh take on Marvel’s Guardians of the Galaxy. In this third-person action-adventure game, you are Star-Lord, and thanks to your bold yet questionable leadership, you have persuaded an oddball crew of unlikely heroes to join you. Some jerk (surely not you) has set off a chain of catastrophic events, and only you can hold the unpredictable Guardians together long enough to fight off total interplanetary meltdown. Use Element Blasters, tag-team beat downs, jet boot-powered dropkicks, nothing’s off-limits. If you think it’s all going to plan, you’re in for a world of surprises, with the consequences of your actions guaranteed to keep the Guardians on their toes. In this original Marvel’s Guardians of the Galaxy story, you’ll cross paths with powerful new beings and unique takes on iconic characters, all caught in a struggle for the galaxy’s fate. It’s time to show the universe what you’re made of. You got this. Probably.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Eidos Montreal","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":884,"name":"Call of Duty: Modern Warfare Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/509/509c81a5da92a8d0645d9e160d155017.jpg","description":"###The restart\nReleased in 2016, the remastered version of one of the most revolutionary parts of the annual Call of Duty series. In 2007, the series moved from historical scenery to modern, got a new more advanced graphics thanks to the freshly-released consoles and presented to the players a hardcore fast-paced multiplayer. The latter is still wanted by hardcore fans, which gave the publisher Activision Blizzard a reason to remaster the game.\n\n###Key features\nIn the new version, developers from the Raven Software did their best to rebuild the experience (the original game was developed by Infinity Ward). The game is available for purchase, as a separate product, and as part of a bundle. Owners of the original version of the game can get Remastered for free - you need to have the original disk for this or digital purchase. The re-released game did not change the gameplay in any way: it is still a fast-paced first-person shooter. The story campaign, during which the player takes control of several characters, also has not changed. Most of the changes turned out to be cosmetic and allowed the new studio to add new technologies to the original game: for example, while prone and moving, the weapon touching the ground will vibrate the controller. Also in the single-player campaign, new cheat codes were added, such as exaggerated physics and the ability to replace heads on the shoulders of virtual people with watermelons.\n\n###The changes\nThe main changes lie in multiplayer, which pulled up to the standard of modern games of the series. In place, there were the same modes, the same weapons, and perks. Added new ones, like the Prop Hunt mode, in which players turn into nonliving objects and hide on the map. New content is available as the challenges unfold.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Raven Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1140,"name":"World of Goo","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d03/d030347839f74454afcd1008248b08ae.jpg","description":"World of Goo is a physical construction puzzle.\n\nThe gameplay consists of creating different shapes of goo balls. In total, the game has 47 levels. And, what is remarkable, each level has stylized visual and musical themes, what gives the game a unique atmosphere.\n\nThere is another bonus level called World of Goo Corporation. Its essence is to build high towers with the help of extra balls goo, which the player managed to collect during the passage of the other levels.\n\nThe primary goal of the game is to bring the required number of goo balls to the pipe which is the exit. To do this, the player must use the goo balls to build various structures such as towers and bridges, to overcome gravity in different places such as dungeons, hills, abysses or rocks. There are several types of goo balls, each of which has unique properties. The player must combine them to complete each level.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"2D BOY","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii"}]},{"id":3315,"name":"Magicka 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/516/516c6bfe36ddb498d860f68927448a75.jpg","description":"Magicka 2 is an action-adventure game developed by Arrowhead Game Studios. The game serves as a direct continuation of the first Magicka.\n\nOnce upon a time, four mages saved Midgard from complete destruction. However, the war between magic schools broke out after that. Most of the wizards passed away. Humanity entered a Golden Age without the mages destroying the human's way of life. During this period a prophecy of a child that would make Midgard a better place emerges. The prophecy also told that the evil forces will oppose the child. Mages set out on a quest to save the child.\n\nThe game could be played alone or in a cooperative mode with up to four players. Unlike most role-playing games, Magicka 2 does not feature any class system. Every character is armed with a staff and a melee weapon.\n\nMagicka 2 features a high degree of satire and a lot of references to other games. For example, one of the weapons the player can use is the Excalibur or the M60 machine gun crafted by a local blacksmith from a string and a shotgun. The main feature of the game is the dynamic spellcasting system that allows combining 8 elementals in order for the player to choose their own playstyle.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Paradox Interactive","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":4439,"name":"Mass Effect 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/315/3156817d3ac1f341da73de6495fb28f5.jpg","description":"Mass Effect 3 is the final part of the trilogy of the same name, created by BioWare. It is an action RPG with wide customization opportunities and several endings that depend on your choices during the game. There are side quests you can complete, and a relationship system that opens new ways to fulfill tasks and lets to romance some characters. The game follows traditions of the cosmic opera genre and features interstellar travel, space fights, and interaction with various alien races. Mass Effect 3 heavily focuses on combat; the core is shooting with a cover system and pursuits.\nYou play as Commander Shepard (who can rather be male or female) during his fight against the race of Reapers, that invades Earth. The only hope of the world is the absolute weapon you have to create with the help of all races. The tone of the series switched to more pessimistic compared to previous games. Your actions may lead to the deaths of your friends, and this makes your choices harder. \nThe game is followed by Mass Effect: Andromeda, however, this installment is not a direct sequel to the trilogy and follows the story of brand new characters.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BioWare","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"}]},{"id":5528,"name":"Call of Duty: World at War","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/da1/da15524e850ee9791b32973b748e08d5.jpg","description":"Call of Duty: World at War is a first-person shooter set during World War II and based on several historical battles. The action switches between three playable characters and covers the Pacific Theater and Eastern Front. The story begins with U.S. Marine Private C. Miller who is captured by the Japanese and waits for execution. Later it jumps over war theaters and the timeline, skipping entire months.\r\nThe battles in World at War are quite realistic, with the maximum of two weapons you can carry plus hand grenades. AI allies fight alongside to you, and there's also a cover system that helps to restore health and complete stealthy missions. The variety of levels includes PBY missions, sniper tasks, and sea battles. \r\nWorld at War is the first game of the franchise to introduce Nazi Zombies mode - a cooperative mini-game where 2 to 4 players fight endless hordes of zombies. While the area cover in this mode is quite small, it was expanded by the World at War map packs.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Treyarch","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii"}]},{"id":15317,"name":"Shadow Warrior","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7e/f7e70957c14ead1fa187a616dfa83e09.jpg","description":"1997 classic Shadow Warrior is a genuine specimen of a Doom-like first-person shooters craze that took place in the 90s. Coming from the developer of Duke Nukem, the game uses the same slightly modified engine and uses 3D voxels instead 2D pixels. \r\n\r\nMaster Zilla, head of the Zilla Enterprise is planning to conquer Japan using his minions from the “dark side”. At this point, Zilla Enterprises gained control over every major industry in the country. You play as Lo Wang, a bodyguard for Zilla Enterprises, that suddenly realises the dark nature of the company he is working for and leaves it behind. But Master Zilla is not letting go that easily. \r\n\r\nGameplay wise Shadow Warrior did no changes to Duke’s formulae: you roam three-dimensional levels, killing enemies and solving basic puzzles. Lo Wang can use Japanese-themed weapons such as katanas and shurikens, as well as traditional for the genre firearms: UZIs and etc. This is a slightly remastered version of the classic.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14606,"name":"Ricochet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/120/120d930368bc171c42f9caab94e33c65.jpg","description":"Ricochet is a multiplayer Half-Life mod developed by Valve.\n\nRichochet is a deathmatch game that closely resembles platformers. The game field is made out of several floating platforms which the players can jump on by stepping on one of the arrows on the edge of the platform.\n\nThe objective is to push other players off the platforms using throwing discs - the only weapon present in the game. The player can't have more than 3 discs at the same time. The platforms are limited by a horizontal strip that can be used for ricocheting the discs. For pushing the player off with a direct hit, 1 point is scored. 2 for pushing the player off with a ricochet and 3 for double ricochet.\n\nThere are two firing modes: single disc shot and the beheading shot that uses all three discs at once. \n\nIn comparison to other Half-Life mods, the number of deaths is not tracked by in-game statistics. Overall, this mod is much more primitive than the others. Only 2D targeting is present and the player movement comes down to jumping from platform to platform.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Valve Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":391399,"name":"Tell Me Why","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b28/b28a135fa6133e17b228f46902a4fda4.jpg","description":"Tell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life is Strange. In this intimate mystery, reunited twins Tyler and Alyson Ronan use their supernatural bond to unravel the mysteries of their loving but troubled childhood. Set in beautiful small-town Alaska, Tell Me Why features true-to-life characters, mature themes and gripping choices.\nAs you conjure up memories of the past, your choices will affect the twins’ relationship, determine the strength of their bond, and shape the course of their lives.\nTell Me Why unfolds across three chapters, all of which will release in the summer of 2020 with Xbox Game Pass and will also be available for purchase on Xbox One, Windows 10 and Steam.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10310,"name":"Robocraft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b9/2b9a49e89c1ba892a648620194dcf327.jpg","description":"Robocraft is a free-to-play multiplayer third-person action game developed by Freejam Games.\n\nPlayers build their own robots using building blocks that can be acquired in the in-game shop using ROBITS, an in-game currency which can be earned by playing the game, recycling other parts, opening loot boxes and be bought with real money.\n\nPlayers can build whichever robots they like unless it uses under 2000 CPU. This limit does not increase with leveling up. In order to destroy an enemy robot, the players have to damage at least 75% of their CPU. One of the main features of the game is a complex damage model that allows for damage redirection and redistribution. Players have a wide variety of weaponry in their disposal which includes several energy weapons, ballistics and all things explosive. There are multiple rarity variants for every weapon which boost one of the stats of the weapon. \n\nThe game features multiple social features as creating player's own platoons and clans. Clan Wars are also present in the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Freejam","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15714,"name":"Deponia: The Complete Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/99d/99d7fadd2342f575d238a4e1f5c542b6.jpg","description":"Deponia: The Complete Journey is a remaster of an approved Deponia trilogy consisting of initial Deponia, Chaos on Deponia and Goodbye Deponia. There is also a fourth installment widely considered parallel and off-canon. Another feature of The Complete Journey — four hours worth of developers' comments. \n\n###Gameplay\nDeponia is a point-and-click adventure set on the planet of the same name. The game features 2,5D gameplay which means there are layers to the static background. As in the most games of this genre, the game includes interactions with the objects on the screen some of which are: pick up, combine, use for puzzle and talk to, if the object is animate.\nThe title features multiple hints if the player finds himself stuck at the level. Hints can be turned off.\n\n###Story\nThe story derives from the planet Deponia, the population of which were forced to move to the city called Elysium leaving Deponia as dumpster behind them and considering all its inhabitants to be dead.\nThe player follows a story of Rufus who is eager to follow the quest of his father's life and reach Deponia. Sadly, his ship brokes and he is forced to live on Organon ship — this is the organization responsible for dumping trash on Deponia's surface. Rufus is set to find out the truth about Deponia undoings.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":20405,"name":"Deathmatch Classic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b04/b042f8a7d3d9f8fe61d5af5d47ab6088.jpg","description":"Deathmatch Classic is a standalone Half-Life mod developed by Valve.\n\nDeathmatch Classic was initially developed as a remake of a popular game by Id Software, Quake.\n\nThe initial release included five maps, which were ported from Quake. The gameplay closely resembles the same of Quake with minor differences in weaponry. For instance, the iconic Half-Life crowbar is used instead of Quake's axe.\n\nDeathmatch Classic physics is similar to Quake and allows the players to traverse at high speeds using bunnyhopping because of game engines similarities. However, the game speed in Deathmatch Classic is slower than in Quake. \n\nThere is no loadout system in the game, so the players have to pick up weapons that are scattered across the map and vary from the default shotgun to a rocket launcher, a taser, and a powerful beam weaponry. \n\nThere are also three kinds of bonuses in the game which grant players special abilities such as invincibility, invisibility or quad damage for a short amount of time.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Valve Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":326252,"name":"Gears 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/121/1213f8b9b0a26307e672cf51f34882f8.jpg","description":"From one of gaming’s most acclaimed sagas, Gears is bigger than ever, with five thrilling modes and the deepest campaign yet. With all-out war descending, Kait Diaz breaks away to uncover her connection to the enemy and discovers the true danger to Sera – herself.\n*Xbox Live account required. Visit www.gears5.com for additional information.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"The Coalition","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2805,"name":"Street Fighter V","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a32/a32c9c299488ca99afc3fcea605a7718.jpg","description":"Street Fighter V is a fighting game, the fifth main installment in Capcom’s Street Fighter series.  \n\n###Story \nThe game takes place between the events of Street Fighter IV and Street Fighter III. The game features two story-oriented modes: Character Story and A Shadow Falls. In Character Story you can choose any character to go through a series of fights. It starts with a prologue and finishes with ending unique for each character. At launch only, Characters Story was available while A Shadow Falls, a full-fledged story mode that describes a battle between World Fighters and criminal syndicate Shandaloo was added later in July 2016.\n  \n###Gameplay \nLike its predecessors, Street Fighter is a 2D one-on-one fighting game. The initial characters roster included 16 characters four of which were newcomers to the series. Since the game release, many more characters were added with DLC making roster more than twice as big as it was on launch. The core gameplay shares many similarities with Street Fighter IV. However, it abandons Focus Mode and Ultra Combos introduce in that game. The main new mechanic in Street Fighter V is V-Skills system. V-Skill is special moves, unique for every character. Using these moves helps to fill V-Gauge which can be used to perform V-Reversals, special counter-attacks, or V-Trigger especially powerful abilities that require the full gauge.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":197,"name":"Trove","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d68/d684c5ec81b8ea46bfd4b5c3bae4007f.jpg","description":"Trove mods come to the Steam Workshop!Trove’s modding community is one of our greatest assets. The creativity and passion shown by so many players allows endless customization and limitless imagination! To better support you, and your creations, we’re proud to bring modding to the Steam Workshop.\nAbout the GameGrab your friends, hone your blades, and set off for adventure in Trove, the ultimate action MMO! Battle the forces of Shadow in realms filled with incredible dungeons and items created by your fellow players. Whether hunting treasure in far-off lands or building realms of your own, it’s never been this good to be square!\nCubular ClassesPlay as a Knight, Gunslinger, Ice Sage, Dracolyte, Pirate-with-a-parrot, or any (or all!) of the other Classes in Trove while mastering abilities from deadly ninja techniques to deliciously deadly ice cream crushes. Upgrade your gear to tackle epic challenges and strut your stuff with killer looks.\nInfinite RealmsExplore through fully destructible realms on the backs of fire-breathing dragons and purrfectly whiskered Meownts. Jump into action tailored to any level as you conquer untamed wilds from the Treasure Isles to Candoria, home of the sweet-toothed Candy Barbarians.\nDelve into DungeonsAssemble a group of hardy cube-kind and crawl your way through huge dungeons unique to each realm. Brave deadly minions, bosses, and traps to “liberate” powerful armor and weapons, or dip into smaller Lairs for single servings of danger perfect for solo fun.Get Rich with LootRake in a shimmering hoard of treasure and collectible items from the deepest and darkest places in Trove. Load up on special gear, costumes, decorations, recipes, crafting ingredients, flying carpets, sea-faring ships, and dragons of mighty renown.\nBuild Your Home… Cornerstones are personal homes you can build block by block, but they’re also mobile bases! Drop your Cornerstone at specially-marked plots in any world you’re visiting, and voilà: your hand-crafted home-away-from-home will appear, giving you a place to kick back, relax, and craft to your heart’s content.\nBuild a World…What’s better than crafting alone? Building entire new Club Worlds with friends. Feel like making enormous geodesic domes in the desert? Magnificent castles in the sky? Do it – and land yourself in our list of the cubic masterpieces in Trove!\nBuild Anything in the Game!Dragons? Check. Bacon swords? Yup. Rainbow-grade 3D glasses of insufferable doom? Just the tip of the iceberg! Collect a HUGE range gear made by your fellow players and make and submit your own items – including Dungeons, Lairs, Class Costumes, and more.\nPlusMusic Blocks, Meownts, Fishing, Farming, Pets, Sailing (with Boats!), Flying (with Wings!), Mag Trains, Dance-Pads, Heroes, Villains, Allies (who might be Villains), Flasks, Bombs, Piñata Parties, and the Crafting of any and all Things.\nDid we mention it’s free to play?!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Trion Worlds","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":5298,"name":"Tomb Raider: Legend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9d4/9d45e22df640fcb6f4b754aa3491ae09.jpg","description":"The gaming world's sexiest and most intrepid adventurer makes her triumphant return in Lara Croft Tomb Raider: Legend!\nFollow Lara down a path of discovery as she travels the globe to remote, exotic locales in search of one of history's greatest artifacts that unleash unwelcome figures from Lara's mysterious past. With guns blazing, Lara must use her athletic ability and intellectual wits to explore vast, treacherous tombs, riddled with challenging puzzles and deadly traps.  Experience the beginning of the new Legend in the most adrenaline-fueled Tomb Raider adventure ever!\nLara Croft evolved! - the sexy, dual-pistol wielding heroine is presented like never before with new graphic and animation sets, presenting Lara in the finest fidelity to date\nReturn to the tombs! - discover and explore living breathing, lost ancient realms that hold clues to the secrets of Lara's past. Physics, Water and Fire systems bring the perilous environments of Lara's world alive, and challenge the player to improvise solutions to obstacles\nThe Intuitive and Fluid Control System movement allows you to keep Lara in continuous motion; seamlessly handle any obstacle and interact dynamically with any surface\nExperience the new legend of the Tomb Raider series! - the future of the adrenaline-fueled adventure meets the promise of the next generation gaming systems.\nUtilize strength and intelligence on your quest! - use the grappling hook, an arsenal of new weapons, communications devices, and other tools to achieve your goals.\nTravel the globe to the world's most exotic locales! - explore ancient tombs, treacherous jungles, snowy mountain ranges, and much more.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"}]},{"id":14334,"name":"Satellite Reign","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8df/8df64136042eb6e2ed4fa910a6ad96ac.jpg","description":"Satellite Reign is a real-time strategy, where you customize your team of four members and fight the tyranny of a mega-corporation called Dracogenics. The game is set in the open-world cyberpunk future, so the visuals combine dark locations with neon-highlighted spots. The gameplay depends on your soldiers’ class. You can use agents with different abilities to form a group that suits your playstyle. There are multiple ways to complete missions, whether you prefer to be stealthy or rush through enemies’ facilities.\nThe story takes place in a fictional City, where Dracogenics gets the full control over politics and military forces. To release the city, you become the head of a rival corporation and set attacks against Dracogenics. The goal is to overcome the evil syndicate using well-designed tactics.\nExcept for missions, the game pays attention to the technology development and resource management you need to provide to defeat Dracogenics. Meanwhile, the interaction between your corporation and civilians is minimal, so you don’t need to affect their attitude to you to win.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"5 Lives Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16787,"name":"Bully: Scholarship Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e2b/e2b2bf36ff4af8f8495d2f4e08b1d392.jpg","description":"Set in Bullworth Academy, a fictional British private school, this game tells about school bullying and the troublesome period of growing to adolescence. You assume the role of Jimmy Hopkins, a 15-year-old boy and a “problem child”, who was already kicked out of many schools for his misbehavior. \n\nGameplay in Bully is reminiscent of that in Grand Theft Auto games (made by the same Rockstar Games), albeit on a smaller scale. You, as Jimmy, walk around an open world of Bullworth Academy and its surroundings, finding new optional missions that may get you into trouble and fun at the same time. You can pick fights with other hooligans, fire at your schoolmates with a slingshot, drop stink bombs, ride a skateboard, and break into others’ lockers, as long as you don’t get caught by the teachers. You will also attend classes and perform exercises, which are rendered as mini-games. A smaller world, compared to GTA, means fewer characters, but each major character is interactive, fleshed out, and unique. The characters are split between several factions, or “cliques”, and Jimmy will have to complete specific missions to earn their respect. Completed tasks will also provide Jimmy with trophies that he will store in his room to commemorate his successes.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Rockstar New England","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":9835,"name":"Outlast 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/880/880f6aa65fe9d786f1a455963df76180.jpg","description":"Outlast 2 is a first-person survival horror game developed by Red Barrels. While continuing the ideas of the first Outlast, the game's story does not continue the plot of the first title in the series. \n\n###Plot\nBlake and his wife Lynn are journalists that investigate a case involving the murder of a pregnant woman. The set out to visit the crime scene in the remote Arizona village by a helicopter that breaks down mid-air and crashes. Blake has to find his wife and figure out what is going on in the village.\n\n###Gameplay\nAs the first game in the series and it's expansion pack, Outlast 2 is a single-player survival horror experience. The main protagonist is unable to fight his enemies, so stealth is used to avoid confrontation. Unlike the previous titles, Outlast 2 features a stamina bar and new additions to the movement system, such as sliding and going prone. \n\nBlake has a camera with him at all times. This camera is used for activating night vision, eavesdropping to distant conversations with its microphone. The camera requires batteries for it to work, so the players have to look for them on the levels. \n\nThere is no automatic health regeneration present in the game. So when the player suffers some damage, they need to find a medkit in order to restore their agility and health.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Red Barrels","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":4523,"name":"Red Faction: Armageddon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/395/395ad028483d6cd9076b746a3eec993d.jpg","description":"Armageddon - the fourth part of the game Red Faction.\nThe action takes place on Mars. Mars is colonised and inhabited thoroughly, but the device for creating an artificial atmosphere is captured by a group of unbalanced scoundrels. Colonists have to move under the surface, where for some reason there is air.\nThis is a setting. We meet the hero pursuing his own tasks - he is looking for treasure in a dungeon under someone else's order. But instead of gold and gems, he discovers a device of an incomprehensible purpose. The hero contacts the customer and receives an order to blow up the found structure. The explosion leads to the awakening of a race of monsters, like giant insects, which begin to briskly destroy the colonists. And the hero now has to kill the monsters.\nArmageddon sets a new level of the Red Faction game. The important novelties:\nMore opportunities to break through the walls.\nThe hero gains additional energy from destroying something.\nThe hero gets a device that can collect back the destroyed objects.\nSometimes the hero finds a fighting robot, sits down in it and literally tramples the enemies.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Volition","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":326251,"name":"Deathloop","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/018/01857c5ff9579c48fa8bd76b4d83a946.jpg","description":"“DEATHLOOP” transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments and meticulously designed levels in an immersive gameplay experience that lets you approach every situation any way you like. Hunt down targets all over the island in an effort to put an end to the cycle once and for all, and remember, if at first you don’t succeed… die, die again.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Arkane Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":17127,"name":"Torchlight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b17/b175178f8842276b8b18b339fe3146a1.jpg","description":"The game takes place in the city called Torchlight, which, according to the creators, is situated on the nameless mountain. The boomtown is built above a source of valuable crystal resource associated with magic. The resource is called Ember. It is not only of material and scientific value but also a source of dangerous effects on all living organisms.\n\nOptionally, the player can take third-party quests or visit other dungeon locations, from which he cannot be transferred at any time to the city, unlike traditional positions.\n\nThe game generates each level of the dungeon, collecting together small chunks of the game environment. Each chunk is made by hand and can be used in a variety of rooms. They can contain various events and interactive objects, such as levers that open secret rooms or push bridges to a previously inaccessible site.\n\nAlso, an additional feature is that the player can choose a pet (wolf-dog, ferret or lynx), which will be fully involved in the game, helping the hero in the battles. The pet is equipped and can carry a small amount of stuff.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Runic Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4012,"name":"Resident Evil Revelations","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89a/89ac2742fcfeba3b95ac94457af766ef.jpg","description":"Not every survival horror fully explored different styles and formats like Resident Evil did. Resident Evil Revelations keeps the story and mechanics from the previous installments.  It’s set between Resident Evil 4 and 5, taking place right after the creation of BSAA. Agents Jill Valentine and Parker are sent to the cruise ship Queen Zenobia in order to find two missing field agents Chris Redfield and Jessica. But they find a trap, set by a bioterrorist organization Veltro. And now players will have to solve puzzles and to kill monsters. \nRevelations are using an episodic storytelling format, separating single player campaign into different segments, allowing players to experience different scenarios and play as several characters throughout the game. But it keeps the main focus and the events on the ghost ship. But aside from the single-player campaign, players can try to complete modified story mode scenarios, fitted for the combat survival. Completing the Raid Mode objectives will allow one or two players to receive experience points and weapons.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":6773,"name":"Sunset Overdrive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2e/c2eb6021a2596644b437e943612af25c.jpg","description":"2027, the metropolis of Sun City.\n\nThe city is full of creatures, savage, aggressive and insane - these creatures were just ordinary townspeople a short while ago, but they abused the energy drink produced by Fizzco, in which something was wrong with the recipe. In general, loyal consumers mutated into monsters and now nothing can be done with them, only to kill everyone.\n\nThe protagonist (by the way, who worked at Fizzco) is not constrained by any laws of physics, can move around the city in any direction, run on walls and wires, jump like a kangaroo and so on. This is not parkour, it's just complete freedom of movement. He also has a \"guidance system\" that shows him the way.\n\nIn addition to the hero, several groups and singles of varying degrees of eccentricity are fighting monsters in the city. Monsters also do not belong to the same type. Monsters are many, they are very different and extremely unusual - there are, for example, creatures fused with water cannons or a bucket from an excavator. The hero's weapon is even more diverse than the monsters. Various weapons rush vinyl records, throw bowling balls, shoot teddy bears with pieces of TNT in their paws and this is not the whole list.\n\nThe game has about fifty amps to move the hero and defeat the monsters.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":29215,"name":"Life is Strange: Before The Storm","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/214/2140885d34e3a3398b45036e5d870971.jpg","description":"Life is Strange: Before the Storm is a three-part episodic prequel to Life is Strange, an interactive movie adventure game. It’s a tribute to Chloe Price, one of the protagonists of the original game. While the core mechanics stays the same as you need to interact with items and make decisions, the key feature has changed. Instead of rewinding time you can use the Backtalk option - Chloe’s ability to talk out the opponent.\n\nThe story develops around Chloe’s relationship with Rachel Amber. While ditching the school with her girlfriend, Chloe gets involved in a drug accident. The game features characters from the original title and introduces several new heroes. The plot depends on the decisions you make through the game. The story has multiple endings with several changings in side arcs. \n\nThe game also features improved graphics, Chloe’s customizable outfit that affects her interaction with people, and the ability to change the environment with tags and graffiti.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]}]