[{"id":27007,"name":"Crunchyroll","genre":"Desconocido","price":0.0,"description":"Now Crunchyroll gives you access to thousands of hours of your favorite\nAnime for free on Wii!\n\nCrunchyroll is the official destination for the largest lineup of\ncurrent and classic Anime & Manga. Watch hit shows like Naruto\nShippuden, One Piece, and Sword Art Online on all your favorite devices.\nWatch for free or become a Premium member to watch ad-free with\nexclusive access to simulcasts—your favorite shows available as soon as\n1 hour after they air in Japan.\n\nNot a Crunchyroll member? Start a FREE 14-Day Trial of the Premium\nMembership today at https://www.crunchyroll.com/wiiU.\n\nSubject to availability in your region.\n","imageUrl":"https://media.rawg.io/media/screenshots/8aa/8aa351fea1e98d11490be4e125188c8d.jpg","releaseYear":2014,"developer":"Crunchyroll","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"}]},{"id":21735,"name":"Fowl Space","genre":"Action","price":0.0,"description":"A heroic rooster sets forth on a ridiculous space adventure to DESTROY THE SUN! Unfortunately for him, a legion of lingerie-loving Vikings has turned it into their headquarters and they’re big fans of fried chicken. Full of high tech weaponry, constant non sequitur, terrible gaming humor and a wanton disregard for anything wholesome; Fowl Space is a crazy journey you’ll never forget... to say the least.\nKey Features\n5 insane weapons including exploding kittens, unspecified white goo, and a killer whale flail.\n5 stages of complete and utter randomness in the center of the sun.\n9 challenge levels that are homages to other awesome indie games.\nTerrible gaming humour and relentless abuse of memes throughout.","imageUrl":"https://media.rawg.io/media/screenshots/1c2/1c21b8020c538f50832d388049e7fa14.jpg","releaseYear":2012,"developer":"Pixelante Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21669,"name":"The Defenders: The Second Wave","genre":"Action","price":0.0,"description":"Fight the ghosts through 50 waves of growing danger. Play as a powerful wizard, a mighty warrior, or a strategic builder to stop the ghost invasion. Evolve your character in the direction you want. Survive until dawn, or die trying.\nFeatures:\nAwesome one to four player hack'n'slashing\n50 waves of evil dudes to fight\n10+ enemy types, each providing a new challenge\n5 big, mean, evil bosses\n12 different spells to fight off the enemies\n6 tactical things to place to help you in the battle\n25 items to buy to improve your defender\nYou can even bring down the moon\n... also sheep!","imageUrl":"https://media.rawg.io/media/screenshots/c85/c85879a33fc05ed02a7485fcd071dd8e.jpg","releaseYear":2015,"developer":"FallenMaster","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21382,"name":"Perfection.","genre":"Casual","price":0.0,"description":"Perfection. is a simple, soothing puzzle game about cutting shapes to fit into outlines. There are an infinite number of puzzles, each randomly generated to be unique and interesting.\nIts gameplay is very minimalistic and very forgiving; there is no time limit, and you can cut as many times as you want and undo as many times as you want until you get each shape right. Or, you can challenge yourself to clear the shape in front of you in as few cuts as possible. Whether you get it perfect or not, once a shape is completed, it's gone forever. There's no commitment to replay any level, because there will always be a new one for you to try.\nThe game's soundtrack is a beautiful synthesized soundscape, composed by Omni-Psyence and available on Bandcamp for free.","imageUrl":"https://media.rawg.io/media/screenshots/e1d/e1d0c876015258422fb1edb2089a788d.jpg","releaseYear":2013,"developer":"Dumb and Fat Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21006,"name":"Inside Me","genre":"Action","price":0.0,"description":"Trading Cards Available\nAbout the Game\"Inside Me\" is a top-down shooter in which you play as one of nanorobots embedded in the human body to fight infection.\nWhile clearing the infected cells you will fight with various enemies and dangerous bosses.\nThe general gameplay consists in controlling more smaller bots in fighting with parasites.\nDuring the game you will be able to reveal unique abilities which you can combine with each other.\nFeatures\nHardcore gameplay\nColorful hand-drawn 2d art style\nThe use of unique abilities\nCombining of abilities\nBattles with dangerous bosses","imageUrl":"https://media.rawg.io/media/screenshots/7fe/7feb661fa548d34b9a4771963c886c04.jpg","releaseYear":2015,"developer":"SnowBiteGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20762,"name":"Wyv and Keep: The Temple of the Lost Idol","genre":"Action","price":0.0,"description":"Take control of two rookie treasure hunters as they adventure into an ancient Amazonian temple! Use teamwork to advance through 6 fiendishly difficult puzzle worlds - from a cannibalistic pygmy village to an active volcano. Dodge poisonous darts, venomous snakes, and deadly spike traps and use dynamite to blast through crumbling walls and floors. Discover hordes of hidden treasure, challenging secret levels, and even a mythical pygmy hat salesman.\nWyv and Keep is a game of action and puzzle-solving, where up to two players guide the treasure hunters through a gauntlet of confounding puzzles in search of the legendary lost idol. The game is presented in a style that would feel right at home on the 16-bit consoles of old, with beautiful pixel art, a catchy soundtrack, and finely tuned platforming gameplay.FeaturingFully Co-operative - Innovative dual-character gameplay enables both characters to be controlled by either one or two players.\nOnline Enabled - Play the entire game through with a partner from halfway around the world.\nChallenging Gameplay - Over 60 exciting levels, spanning around 20 hours of brain-teasing gameplay.\nHidden Secrets - Collect hoards of hidden treasure, discover challenging bonus levels, and unlock all six different endings.\nStunning Pixel Art - Lovingly handcrafted characters and environments.\nFantastic Music - Featuring a full 20-track OST by accomplished musician Luke Thomas.\nHigh Fashion - Discover the secret in-game pygmy shop, and collect a wide assortment of stylish hats.\nCupcakes - They're a girl's favorite!\n\"Intense puzzles... Stellar level design.\" - Co-Optimus\n\"I felt like the cleverest man in all the world when I beat a level.\" - Rock, Paper, ShotgunDeveloper Notes:Thank you for playing! Please let us know of any issues or give suggestions for what you'd like to see next! :)","imageUrl":"https://media.rawg.io/media/screenshots/341/34136f7f29c1702682e4705d1024998f.jpg","releaseYear":2014,"developer":"A Jolly Corpse","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19653,"name":"Hinterland","genre":"RPG","price":0.0,"description":"June 11, 2009 - Update\nTwo new playable Orc classes: Lord (Warrior) or Shaman.\nExpanded gameplay: Orcs consume twice as much food, learn martial skills faster, manufacture items slower, and the Shaman uses totems to summon creatures.\nSeveral new items regardless of character class.\n\nAbout HinterlandLoot, level and build with fast paced RPG combat and strategic base building!\nCan you build a vibrant settlement, lead your people to prosperity, and tame the wild Hinterland?\nParty-based RPG Action  A variety of characters, weapons, and strategies are at your disposal -- will you lead the charge with a devastating two-handed strike, or stand behind the herder in plate mail with your trusty bow?\nTown Building  Choose your settlers from a huge cast of characters and arm them for defense, or give them tools for production.\nCharacter Development  Develop lowly farmers into great warriors and customize your character with a variety of specializations.\nRandom fantasy world  Each game of Hinterland takes place in a new location with different resources, items, and challenges. Different challenges feature a range of enemies, including orc war camps, dark elf raiding parties, goblin infested mines, ruined cities filled with undead, and more.\nCustomizable Gameplay  From a hardcore game to a world without raiders you make the choice about the type of game you want to play.                    Hinterland is a new type of role-playing strategy game from the developers of Children of the Nile™, Caesar IV™, and SimCity Societies™.","imageUrl":"https://media.rawg.io/media/screenshots/526/526dcd5c9784524e0d3b7081d37eabc0.jpg","releaseYear":2008,"developer":"Tilted Mill Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19167,"name":"Terra Nova: Strike Force Centauri","genre":"Action","price":0.0,"description":"From the creators of Ultima Underworld I & II and System Shock.\nLead an elite fighting team battling for freedom from the sinister forces of the Earth Hegemony. Engage in combat on the bloody battlefields of four unique worlds. Encased in your Powered Battle Armour (PBA) you are an unstoppable fighting force.\nWhich is just as well, for as your colony prospers a new breed of pirate has emerged. More organized and armed with powerful weapons, these new pirates have prompted the Cantauri government to establish an elite fighting force, the Strike Force Centauri.\nLead your team against the new threat to Centauri peace and discover the dark secret behind the pirates growing military might...\nBonus Content Included: Music from the band Tribe (feat. Eric and Terri Brosius), High Resolution scans of Manuals, Quick Reference Cards and Armour Schematics, Retro Desktop Themes and more!\nBattle to save your colony in over 30 missions, including recon, search and rescue, night raids and full scale battles.\nCreate your own missions with the Random Scenario Generator.\nSophisticated Artificial Intelligence engine allows you complete control over your squad mates and enemy adaptability.\nBreakthrough outdoor renderer allows for a fully interactive environment.","imageUrl":"https://media.rawg.io/media/screenshots/038/0381e0715094f806fb491ae87b14496f.jpg","releaseYear":1996,"developer":"Looking Glass Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18254,"name":"Apartment 666","genre":"Action","price":0.0,"description":"Life is an endless cycle of loops with only one way out.\nYou are 12 years old and after some events, your father and uncle have left you in your new apartment. One day you wake up and nobody is home. Play as Julian an unexpecting 12 year old who discovers what happend to his family. You try to exit your Apartment only to find yourself waking up back in your room. However, nothing is the same, some rooms are opened, furniture is moved, there is somebody else with you.\nFind out what happened to you, your family and discover who is with you or within you.\nFeaturing narration from Julian's perspective. Get inside the mind of a 12 year old and see the world the way he does.\nExperience a frightening atmosphere game\nThe realistic audio,  graphics, and atmosphere of the game lets you experience the game as if you were there. The experience will change you forever.\nOpen the door, behind it is where the true horrors lie\nNarration done by Julian McVey.","imageUrl":"https://media.rawg.io/media/screenshots/064/064e339fa5169cfd8f0f32c7d9c9c131.jpg","releaseYear":2016,"developer":"I Need Play","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17358,"name":"Squirreltopia","genre":"Action","price":0.0,"description":"\nThe Squirrel population is in trouble! Shadow-tail, an evil, robotic squirrel has kidnapped squirrels and stolen all the gems from Squirreltopia! Get them back and defeat his powerful machines to take back your planet and prevent squirrel extinction!\nScurry through diverse levels, including deserts, forests, factories, and alien planets. Use the environment to your advantage, by utilizing bubble machines, bomb-blocks, balloons, invisi-blocks, and more!Features:Simple, addictive gameplay\n50+ Challenging levels! (don't worry, you have unlimited squirrels at your disposal)\n♫ Full Original Soundtrack\n5 Unique Worlds\nInsane Boss battles\nPlay as many different squirrels, they will change with each life!\nCutting-edge squirrel tail physics!\nExplore the overworld and find entrances to new levels. Play in any order!\nMini-games, unlocked by finding retro game cartridges hidden in levels\nKeep track of your best times for each level, try to earn all the time trophies!\nSecret cheat items that can only be earned by the most skilled Squirrels!\nCan play with only 1 hand\nThroughout the worlds, there are many obstacles, some are dangerous, and some may help you on your journey....\nNote: Linux/Mac versions hopefully coming\nPHOTOSENSITIVE SEIZURE WARNING\nA very small percentage of people may experience a seizure when exposed to certain visual images, including flashing lights or patterns that may appear in video games. Even people who have no history of seizures or epilepsy may have an undiagnosed condition that can cause these \"photosensitive epileptic seizures\" while watching video games.\nThese seizures may have a variety of symptoms, including lightheadedness, altered vision, eye or face twitching, jerking or shaking of arms or legs, disorientation, confusion, or momentary loss of awareness. Seizures may also cause loss of consciousness or convulsions that can lead to injury from falling down or striking nearby objects.\nImmediately stop playing and consult a doctor if you experience any of these symptoms. Parents should watch for or ask their children about the above symptoms - children and teenagers are more likely than adults to experience these seizures.\nThe risk of photosensitive epileptic seizures may be reduced by taking the following precautions:\n• Play in a well-lit room\n• Do not play when you are drowsy or fatigued\nIf you or any of your relatives have a history of seizures or epilepsy, consult a doctor before playing.\nThanks for checking the game out!","imageUrl":"https://media.rawg.io/media/screenshots/d6b/d6b9fbbfd1a34f350241b1902f6f542b.jpg","releaseYear":2015,"developer":"Sean Davy","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17326,"name":"Egg Time","genre":"Action","price":0.0,"description":"The game revolves around simple mechanics and physics.\nCatching eggs, defusing bombs, using “egg time” a variation of bullet time to catch even the most hard to catch eggs.\nStages have their own twists and there are a bit more things to do than it meets the eye.","imageUrl":"https://media.rawg.io/media/screenshots/b5e/b5eb80a9eec829a4c23d1e907fb11b3f.jpg","releaseYear":2016,"developer":"Dalibor Bartoš","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16895,"name":"Goliath","genre":"Action","price":0.0,"description":"Kindly be informed that the Goliath game is presently in its Pre-Alpha phase and remains under active development. We are committed to incorporating forthcoming enhancements, which will encompass a variety of game modes, additional maps, and diverse character options.\nHe was an inevitable wave that washed away all our world’s governing\nsystems, alliances, and protectors. Our world was no match for a\nruler from the stars with his superior strength and exhaustive\nknowledge of our world.\nAnd so our world became his.\nEvery year since our planet has come under his “protection”,\nGoliath hosts a tournament of the best warriors from what few\nregions we have left. His hidden agenda is to use these games to seek\nout and dispose of any potential threats.\nOur goal, as warriors, is to win the tournament for the right to\nchallenge Goliath and take back our freedom!","imageUrl":"https://media.rawg.io/media/screenshots/554/554ce0f493ca210a6d64b63059d50371.jpg","releaseYear":2016,"developer":"Whalebox","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":16407,"name":"Atlantis 2: Beyond Atlantis","genre":"Adventure","price":0.0,"description":"A Point&Click adventure using 360° vision technology in every scene.\nA thrilling new adventure in the heart of Atlantis. Play the role of Ten, a descendent of Seth, the hero of the first Atlantis. The forces of light and dark have awoken and are preparing to fight. Ten carries within him the powers of light. His destiny is to fight his mortal twin. His quest leads him on a dangerous journey through Tibet, Ireland, China and Yucatan.Key FeaturesAll voices and texts in English.\n5 fantastical places to explore that will lead you from the icy cold of Tibet to the torrid heat of Central America.\n60 3D characters based on the Omni-Sync system\nSets and landscapes with 360° graphics (Omni-3D).\nA captivating audio environment and a host of challenges requiring logic and perspicacity.","imageUrl":"https://media.rawg.io/media/screenshots/a8e/a8e50eaac9e493eb2db0dca3d478333d.jpg","releaseYear":1999,"developer":"Cryo Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15752,"name":"VRchaeology: Prologue","genre":"Adventure","price":0.0,"description":"Equipped with your archaeological tools and a bit of TNT, you're on the hunt for treasure: bones, gold... anything that'll pay. In the distance, you make out the entrance to some sort of abandoned mine. Will this be the road to riches, or your doom?\n---\nThis brief (~10 min) experience serves as the prologue to the VRchaeology episodic series.","imageUrl":"https://media.rawg.io/media/screenshots/c26/c26a2dfad8e0e58af1b7c83a172d5902.jpg","releaseYear":2016,"developer":"Play Nicely","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15739,"name":"Six Sides of the World","genre":"Action","price":0.0,"description":"SIX SIDES OF THE WORLD – ALL HAIL THE PUZZLE LORD!“Six Sides of the World” is a puzzle videogame that takes you into an intergalactic journey through different star systems  riddled with brain-racking challenges.THE ULTIMATE MATCH: YOUR BRAINS vs SCI-FI HAZARDSSpatial orientation, logic and pure wit will be your weapons to go through the different cube shaped planetary systems. Each level will bring the threats to a whole new level, adding all kinds of sci-fi hazards: from portals to laser beams.\nYou will need to carefully analyze each cubic planet to understand its dangers and potential solutions. Rushing might lead you to death: it’s all about breaking down each puzzle and finding the right pace.EXPLORE A VAST GALAXY SYSTEMSix Sides of the World presents you a series of star systems to be explored. Each one is comprised by different puzzles that introduce new and more challenging mechanics. But most interesting feature of this is that these star systems can be navigated linearly, following a easier predetermined path; or you can make a detour if you are brave enough. Some of the puzzles will present more than one possible solution, enabling the player to achieve a more difficult victory, that will unlock new extra puzzles.FROM TEST OF WIT TO ULTIMATE HEADACHE!The freedom of exploration in Six Sides of the World let you set the difficulty: the linear path takes an intelligent and resolutive mind; but the additional solutions to some of the puzzles require a true sense of understanding of each puzzle. And that’s not all! These solutions will lead you to extra puzzles that are capable of driving you insane. It is a smart way of letting the player to set the difficulty by him/herself: going for the extra solution is a way of asking for bigger challenges. And the extra levels are the biggest challenges you can face! There is a difference between understanding new mechanics and getting to their true core. Are you ready?ALL HAIL THE PUZZLE LORD!Maigo is an explorer who’s about to discover something far bigger than he expects. As he navigates through space, facing increasingly difficult puzzles, he starts to understand he’s tapping over something transcendent. Some questions arise: who has created all these worlds? What motivates this intergalactic architect? There’s an utter plan beyond all this? It is a test? A mean to protect something? In seek of the truth Maigo will have to overcome all the challenges to meet this kind of… PUZZLE GOD.FEATURES A galaxy of puzzles: Dozens of creative, defying and engaging puzzles set in cubic planetary systems\nChoose your way to victory: Non-linear progression with different difficulty levels. Follow the easy levels to end the game, explore the optional ones to face a real challenge.\nEasy to control, hard to master:Easy and intuitive controls, playable with the mouse and only one button.\nOtherworldly music: Soundtrack composed by Carlos Viola.","imageUrl":"https://media.rawg.io/media/screenshots/f94/f9427e9fc830fc8ffebb5f59793849cd.jpg","releaseYear":2016,"developer":"Cybernetik Design","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":15570,"name":"Survivor Squad: Gauntlets","genre":"Action","price":0.0,"description":"Survivor Squad: Gauntlets is a Strategy-Action game where you command a Squad of Survivors in a world where Line of Sight is extremely important, you cannot shoot what you cannot see. Develop your formations, move as a unit and cover every corner. Leave no man behind!\nUse your weapons and gadgets to slaughter hundreds of infected in a series of levels with unique events. Gather your group, build your base, craft your gear, level your squad and get to the extraction!\nComplete 20 Puzzle-like Editor Challenges that will test your brain and problem solving skills while teaching you the power of the editor\nSurvivor Squad: Gauntlets also features a very powerful Editor that has been used to build all the Developer Content you see in the game. It lets you place all kinds of Objects and interact with them through hundreds of possible Event Actions and manipulate them with Variables and Event Triggers. Anything from Lasers to Sentry Guns to Buttons and even Custom Interfaces!\nThe editor is essentially a visual programming language so if you can imagine it, you can build it!\nAlong with the Editor comes several tools for sharing and playing Community built Gauntlets. Build a death trap and challenge your friends to beat your score!","imageUrl":"https://media.rawg.io/media/screenshots/0e5/0e50dad9ed42f4bfcf74cc23aa4b8e7d.jpg","releaseYear":2015,"developer":"Endless Loop Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13637,"name":"Rogue Wizards","genre":"Adventure","price":0.0,"description":"The Council oversees the elam families, aristocrats who are descended from the first humans in Rilfanor, and the banlits, who were originally people born without magical abilities. The Guild has never admitted banlits because of their lack of magical capacity; and they've never admitted women because they believed women were too weak-minded to control such power.\nNow, many generations later, the elam magic is weakening, and latent magic talent has reappeared among the banlit population. Many of the elam are in denial, but some of them want to take the radical step of allowing banlits, including women, into the Guild.\nIn your quest you'll explore randomly generated dungeons, collect treasures, master magic, avoid traps, solve puzzles, and of course cleanse the dungeons of all the evil minions within.  Every dungeon is unique, no two locations will ever be the same.\nIt's not all dungeon-crawl.  Feel at home in your very own Wizard Tower where you can enhance and customize the way you play by building a thriving town, brewing your own reagents, crafting or buying your own gear, powering up your magic, and recruiting help.\n\"A smart blend of town building and dungeon crawling to create one of the most promising RPGs in years\" Dave Brevik - CEO Gazillion Entertainment, Creator of Diablo Series, Marvel Heroes\n\"Spellbind's Rogue Wizards is taking procedural roguelikes in an exciting and thoroughly charming direction\" Mike Booth -  Game Director at Blizzard Entertainment, Creator and Designer of Nox and Left 4 Dead, Founder of Turtle Rock Studios\n\"Spellbind is making exactly the kind of game I would make for mobile & desktop.  I'm jealous, and I want to play!\" Erich Schaefer - President Double Damage Games, Designer Diablo 1 & 2, Torchlight 1 & 2\nEvery minion has a unique ability with a carefully balanced interplay of strengths and weaknesses.\nSix schools of magic each with a complete set of upgradable spells to bring doom upon your enemies.\nDiscover tons of randomized magic items, providing a nearly unlimited variety of ways to slay your foes.\nRandomly generated environments, no two dungeons are alike.\nUpgrade vendors around your tower and gain instant access to a bounty of new items and enchantments.\nEnchant your items and change the very nature of the magic they harbor inside, breathing new life into your favorites so you can slay more powerful enemies.\nCraft materials and items at your cauldron so you always have the right amount of magical essences and potions at your fingertips.","imageUrl":"https://media.rawg.io/media/screenshots/cfa/cfaf4505e9f7b7e4d191a869598dd36a.jpeg","releaseYear":2016,"developer":"Spellbind Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":13313,"name":"Bitku","genre":"Indie","price":0.0,"description":"What is BITKU?\n- A simple storyteller\n- A short comic creator\n- A strange art toy\n- A new way to express yourself in pixels...\nBITKU is all or none of the above, and totally FREE with no IAP.\nHere's how it works:\n1) Choose a theme\n2) Get 10 random cards related to that theme, each of which has a single background or multi-frame object\n3) Make a 1-4 panel comic or story with the contents of those cards.  Add text, recolor anything, enlarge, rotate, etc.\n4) Save your creation as a PNG and share it with the world!","imageUrl":"https://media.rawg.io/media/screenshots/a99/a9921ec9824ab3e02844160384a0c76b.jpg","releaseYear":2017,"developer":"Pixeljam","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12924,"name":"Finding Bigfoot","genre":"Adventure","price":0.0,"description":"BIGFOOTStory\nIt all started in the spring of 2016. The newspapers Jasper published message about the disappearance of a group of tourists in the national park. Police believe it was just an accident, because the band went to raft on the river. But your team sure that this definitely involves one of the most elusive creatures that are called Bigfoot or Sasquatch. You and your team of researchers decide to get to the truth...Gameplay:\nBe resourceful and test your strength in the Bigfoot hunting, and remember that even the most experienced hunter can become victim...\nWe pay great attention to the creation of artificial intelligence of the monster, it will be as realistic as possible. There will be available large area for hunting, with lakes, swamps and caves.Features:\n- The game is developed on Unreal Engine 4.\n- Online Co-op is designed for up to 3 people.About us:\nWe,CyberLightGameStudio, a small indie team from Ukraine.\nYou can contact us by this contact information:\n@mail cyberlightgs@gmail.com","imageUrl":"https://media.rawg.io/media/screenshots/50e/50e5812650802b7f6832b20062b70adb.jpg","releaseYear":2017,"developer":"CyberLight","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12541,"name":"HitBox","genre":"Action","price":0.0,"description":"Hitbox centers around fast, slick shooting. With all unnecessary distractions removed, we've focused on the core gameplay of moving and shooting. Position yourself nicely, practice your aim, and improve your reflexes to excel. A friendly and inviting style makes it approachable and easy to learn but experienced players will find it hard to master. Our stylish and colourful graphics help ensure the game runs smoothly on many different computers so your experience never drops frames and the gameplay stays on top.\nWith online, local and split screen multiplayer we've made sure you can play with whoever you want. When you need a bit of practice before going against real players we have bots to fill games with so you can hone your skills or just get a feel for a new map.\nFour different classes distill different play styles of the game. You can be a careful sharpshooter, or a mad gunman running around and confusing the enemy. Each class wants to counter another and choosing the right class will always give you an upper hand in a fight. The Tactician can blow your enemies away with his shotgun, while the fast firing Flanker than can get up close and personal and unload lots of bullets. The Marksman is the man of accuracy, a tough class to play but can deal devastating amount of damage. The Trooper is the jack of all trades, able to fit into many situations, but might not be ideal when pressured.\nCompetitive movement based twitch shooting\nComedic and stylized graphics powered by Unreal 4\n10 Unique dynamic maps\n4 Game Modes\nOnline, LAN or split screen multiplayer along with complex AI to compete with!\nFour classes representing different possible play styles","imageUrl":"https://media.rawg.io/media/screenshots/fc9/fc934cc8d78c633df76fefa9fa292a22.jpg","releaseYear":2017,"developer":"David Colson","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12346,"name":"Dynamic","genre":"Action","price":0.0,"description":"DYNAMIC at its core is a third person action platformer.\nTest your hand-ball skills against impossible odds & intricate obstacles where every dimension counts.\nYou can play up to 100+ levels in single player & 12 different multiplayer game modes which include:\nSpaceball  -Arcade handball: Team with most goals at the end of the match wins, the hoop has two goals, top one is worth 3pts & and the bottom is worth 1pt.\nBreakball -Klashball re-imagined: Every ball destroyed determines the amount of points scored, most goals at the end of the match wins.\nMaya  -Arcade Mayan Pitz: The hoops are on the side of walls, most goals at the end of the match wins.\nParty Ball -Smaller map with each teams post right next to eachother.\nMotion -4D handball: A moving cube that serves as each teams goal post, within a smaller cubed shaped map.\nBlockbuster -Blocks & Goals: Each team has to mine a block in order to score.\nWallball -Arcade Wall Ball: Whenever a wall gets hit a point is added to the relative team, take back points by wall running on your teams wall.\nRugby - Arcade Rugby: hail-mary passes, dodge being chucked and slide for a touch down. Most goals at the end of the match wins.\nRandomizer -Slot Machine : Press a button and a random light will appear on the goal able to be scored on, each post is worth a different amount of pts.\nVolleyball -Arcade Volleyball : Wall seperates both teams, aim for the pads on the floor to score. First to 54 pts wins, or team with most points at the end of match wins.\nDodgeball -Arcade Dodgeball: Wall separates both teams, chuck the ball at your opponent to score.\nFutbol -Arcade Soccer: Fast paced soccer, most goals at the end of the match wins.","imageUrl":"https://media.rawg.io/media/screenshots/5bf/5bfd016cafddb6de158c33a781184ed9.jpg","releaseYear":2016,"developer":"White Dog","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11281,"name":"Evolution","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/94d/94d05f94fef56b3ec827e4f5455d09c9.jpg","releaseYear":2016,"developer":"D1ONE","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9513,"name":"Ortus Arena","genre":"Strategy","price":0.0,"description":"Battle the enemy with your team of elemental warriors and try to break the delicate balance of energy in your advantage.\nOrtus Arena is a symmetric turn based game for two players. With your re-incarnating elemental warriors, you must collect energy and conquer the board. Spending energy to move multiple units, but also keeping energy for defense. A delicate balancing act between attacking and defending. The way you manage each of your eight warriors is of crucial importance between victory or defeat.\nOrtus Arena is the expanded digital implementation of the physical, two-player board game Ortus©. It allows players with a knack for tactical gaming to challenge their friends (both local or online) or climb the ranks against others of the same skill level.\nStrategy prevails! No dice rolling, no card drawing, the victory in entirely up to your logical and strategic skills.\nLuck has no place in Ortus, but your brain does!\nA clever AI is present to be combated in the solo game mode. The average duration of one game is half an hour.two Difficulties:Apprentice Mode: Fight with 8 warriors, attacking with melee or ranged attack. This mode will help you learn the basis of the game. Once comfortable enough with this mode, you can try…\nMaster Mode: Unleash the true strategic power of the game. Your soldiers now have powers according to the element they represent.\nMultiplayer mode: Local or Online, you can try to outsmart your friends!\nSolo mode: You can learn the game’s basis with the campaign, or you can try to beat the AI if you’re on your own.\nLearn the strenghs of your elemental soldiers on Master Mode:\nEarth: Those soldiers can hide and thus can’t be targeted, unless there is another earth soldier in the same row. Their attacks are more powerful than the other characters and they cost more energy as well.\nWater: They are the only ones that can attack several enemies at once, all around them or on a line. If you don’t block the first impact, then you’ll have to pay a degressive cost of energy for all the soldiers the attack targeted.\nFire: Fire soldiers work by pair. Their attacks don’t cost anything so you just have to pay for their movements on the board. If they are correctly aligned, they can protect one ally, and have to be in a triangular position to attack your opponent’s soldiers.\nWind: They pay no Energy for flying in a straight line to the end of their Hexline. They possess ranged attacks that costs energy.three Ways to Win:[/h2] Control 5 Energy Wells Knock Out 8 Of Your Ennemy’s Soldiers[/h2] Get Your Guide to the Center Of the Map![/h2]","imageUrl":"https://media.rawg.io/media/screenshots/95b/95bcd959a34138ab1daaff9d22b692c7.jpg","releaseYear":2016,"developer":"Firebrush Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":966352,"name":"Deceit 2","genre":"Action","price":0.0,"description":"Discord\nAbout the GameABOUT DECEIT 2Deceit 2 is an immersive 6-9 player social deduction horror experience that can be played with friends or online via matchmaking. Your goal, escape the Ritual. But beware, two of your party have been corrupted by evil, hiding amongst you in plain sight, empowering the Ritual in order to sacrifice you to the Game Master's mysterious Benefactors. Band together, decipher allies from foes, but in this treacherous game, who truly stands by your side?WHO CAN YOU TRUST? The Innocent's strength lies in unity. Suspect an Infected amongst you? Unite to initiate the Banishing Ritual. But tread carefully; a wrong accusation leads to even greater mistrust in your ranks. Engage with the mysterious Peddler, trading souls for invaluable tools to aid your quest, navigate the haunting In-Between, all to secure your escape.\nMANOEUVRE & MISLEADAs an Infected, exploit the Ritual Site's Weak Points and tear the fabric of reality asunder. Once breached, all are thrust into The In-Between, a shadowy realm where the Infected's true power becomes unleashed. Here, they sow chaos, hunting and destroying the Innocent. Yet, if caught in the real world, their reign of terror can be halted.\nHUNT & BE HUNTEDWhen The In-Between engulfs all, the race to escape intensifies. Evade the supercharged Infected, whose very presence warps reality. But remember, the Ritual demands sacrifice. Who amongst you will pay the ultimate price?\nBOUNDLESS BETRAYALDeceit 2 offers an unparalleled social sandbox experience. At its heart lies the art of deception. Observe, analyse, and deduce, but remember, with ever-changing tools and terrains, strategy is fluid.\nDive into Deceit 2 - where trust is fragile, and every choice could be your last. Will you emerge victorious or become yet another victim to the Ritual of Deceit?\nDARE YOU ENTER THE RITUAL?Millhaven Asylum, 1979: A chilling occult ritual claims the lives of a once-renowned family, leaving only whispers of the horror behind. This unsolved enigma lay dormant until the audacious Truth Seekers Anonymous dared to unravel it. Now, you're ensnared, a pawn in the sinister Ritual of Deceit, orchestrated by the malevolent Game Master.","imageUrl":"https://media.rawg.io/media/screenshots/d7d/d7d60ff21c0eadc0edeabfed9f06df3e.jpg","releaseYear":2023,"developer":"World Makers","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":963626,"name":"Sticky Business","genre":"Simulation","price":0.0,"description":"CHECK THESE OUT\nAbout the GameCreate, pack and sell your own unique sticker creations!\nYou want a collection of cat stickers? A witch-themed shop? Or add a derpy face to all of your creations?\nCombine dozens of elements to create your own collection and sell them to like-minded people. Different stickers attract different customers! You can add some sparkles or holo effects to make them even more special!\nPack orders and hear more about your customers' stories every time they buy stickers!\nFeaturesGet creative and build the cutest stickers out of thousands of possible combinations!\nOptimize your sticker production by building the perfect sticker sheets and make as much use of your resources as possible!\nPack orders for your customers and hear about their lives!\nBuy upgrades to get more sticker graphics and effect foils to make your shop even more exciting!\nAdd goodies and custom packaging to your orders to make your customers even more happy!\nFor all you content creators out there: Sticky Business offers a Twitch integration, which allows your viewers to become customers in the game, setting up orders and letting your creativity run on peak level!\nhttps://store.steampowered.com/app/2303350/Sticky_Business/","imageUrl":"https://media.rawg.io/media/screenshots/5b4/5b442617d235d909cd8071cb812e98f9.jpg","releaseYear":2023,"developer":"Spellgarden Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":644777,"name":"Toodee and Topdee","genre":"Action","price":0.0,"description":"Links\nAbout the GameToodee and Topdee is a 2D Platformer and a Top-Down Puzzler hybrid.\nSwitch between Toodee and Topdee and their unique perspectives, and watch how the game bends to the rules of the current genre.\nSolve mind-melting puzzles!\nOvercome hard-as-nails challenges in the precision platforming sections of the game.\nIf you're having a hard time, you can modify some of the game rules in the difficulty settings.\nMeet strange friends on your quest to find the missing semicolon and return the balance to the universe.\nBut also... Defeat huge BOSSES!\nAfraid to go alone? You can play with a friend in the local CO-OP mode.\nAnd don't tell anybody... There are secrets...","imageUrl":"https://media.rawg.io/media/screenshots/636/6362ea628efa7a79b20eb647cb14555c.jpg","releaseYear":2021,"developer":"dietzribi","libraryGames":null,"platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":429647,"name":"Happy's Humble Burger Barn","genre":"Action","price":0.0,"description":"Play the Sequel!\nAbout the GameHave you ever DREAMED of working at the best burger place ever? Your dream is about to become a reality as you just landed a brand new job at Happy's Humble Burger Barn! Welcome to Happy Humble's Burger Barn, home of the chilled beef burger, can we take your order?\nIt's time to show your new boss what you're made of. Don't let the Happy's Humble Family down!\nFeaturing a state-of-the-art Burger Chef Simulation™ that'll get your buns toasted and patty sizzlin'. The burger cooking is so realistic your very perception of reality will abruptly fade into a kaleidoscope of introspective turmoil that is re-transmitted as the ultimate low-poly PS1 burger cooking experience!\nThe sizzle of the burgers as they cook on the grill, like music to your ears, will lull you into a deep relaxation not unlike an ASMR whisperer with a rare talent and the highest-end microphone connected directly into your ears like vintage Leslie speakers with the rotary cranked. The crispy green lettuce, the tomato oh-so ripe and juicy, the onions sliced to perfection will have your taste-buds surfing the waves of satisfaction, impressing all the tourists that had congregated at Burger Beach on Flavor Island.\nTend to your customers as their demand for Happy's delicious Chilled Beef Burgers increases every minute. Satiate their hunger, quench their thirst...after all, the customer is always right.\nFulfill orders from the menu featuring mouth watering items such as:\nThe Happy's Deluxe Burger\nFrench Fries\nSalmon Nuggets\nSoft Drinks\nShakes\nWhat are you waiting for? You have customers waiting!\nYour goal as a Happy Humble Employee is to manage all aspects of the restaurant. The entire staff had the great timing of ALL calling out on your first day. Even the person who is supposed to be training you! This includes sanitation, order delivery, and general fast food duties.\nTry to fulfill all the customers orders while living your best life as a minimum wage worker. Flip the burger, fill the cup. Scoop the fries, order up! Flip the burger, fill the cup. Scoop the nuggets, order up! Flip the burger, fill the cup. Scoop the fries, order up! Flip the burger, fill the cup. Scoop the nuggets, order up! And on, and on it goes. What tangled deep fried webs we weave.\nHappy's Humble Burger Barn is a horror / thriller adventure with a focus on perception. This small game was made in a little under a month and is our homage to the PSX era and aesthetic. It's a short (~1 hour) experience in which we focused on experimental design concepts","imageUrl":"https://media.rawg.io/media/screenshots/bca/bca1e782d7556da43fd85013b6eb6aa7.jpg","releaseYear":2020,"developer":"Scythe Dev Team","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":351770,"name":"GemCraft - Frostborn Wrath","genre":"Strategy","price":0.0,"description":"The epic tower defense journey continues with GemCraft - Frostborn Wrath. You have finally broken free from your frozen prison, and while your body is still numb of cold, there is no time to lose. Reclaim your knowledge of wizardry, create versatile gems, and place them into various buildings to turn them into deadly weapons. Repel the waves of monster horde attacks, and face sinister enemies as you fight your way back towards the Spiritforge. The Forgotten is already on her way there, gathering a demonic army and getting stronger than ever. Can you stand your ground against the growing darkness?\nGemCraft is a dark fantasy, fast-paced, real-time strategy, tower defense game where you can create and combine gems of various properties, combine and upgrade them, construct buildings to house your gems for even more diverse uses, and cast spells to further enhance your gems or strike at the enemy. Level up, unlock skills, and replay levels with battle traits to level up even more and eventually become a wizard of immeasurable power.\nGemCraft - Frostborn Wrath is the fifth chapter in the series, a new puzzle piece in a branching epic story arch.Key features:\nRepel the monster horde in more than 100 fields of battle with various conditions and challenges.\nCraft and combine six types of gems with different effects to shape your defense strategy or make quick tactical decisions in the heat of the battle.\nTwo dozen passive skills to unlock and enhance as you level up and increase your power.\nSocket fragments you find into your mystical talisman to obtain new special bonuses.\nCast devastating spells to decimate your foes or enhance your gems.\nControl the speed of battle with fast-forward or pause to fit your play style.\nEnrage the upcoming monster waves to make them more fierce but also give more experience points to level up further.\nUnlock a wide range of battle traits, combine and stack them to replay battlefields for more dangerous battles with greater rewards and more XP to level up even more.\nHold out as long as you can in Endurance mode, where you can gain additional endurance wave stones to set your next endurance run even longer.\nFight in Trial mode with a fixed set of gem types, spells, and difficulty settings to test your bare hands gemcrafting skills and unlock wizard stashes with various rewards.\nGain more than 900 achievements that will reward you with more skill points and unlock higher battle trait levels as you earn them.Feature highlights for veteran wizards of GemCraft - Chasing Shadows:\nA brand new GemCraft chapter with whole new fields and chapter map to explore.\nFull HD native game resolution for more detailed and crisp visuals.\nLarger battlefields (GCCS: 54x32 tiles, 1 tile = 17x17 pixels; GCFW: 60x38 tiles, 1 tile = 28x28 pixels)\nRedesigned player interface, gem types, skills, battle traits, strike spells.\nNew buildable buildings (lanterns and pylons), more powerful shrines, new kinds of hostile and support structures, new creatures to fight.\nGems get stronger when your mana pool levels up (all gems have the poolbound bonus only white gem component had in GCCS).\nBrand new talisman system with fragments inspired by jigsaw puzzles, and a collectible fragment shape collection to transform fragment shapes to fit.\nEven more Steam achievements than before, prepare for the achievement hunt!\nNew endurance mode starting at wave 1 and beginning with short endurance runs that can be extended by gaining endurance wave stones.\nAlmost all of the fields have a challenging Trial mode with fixed spells and mana regardless of wizard level (similar to vision fields in GCCS)\nLinked waves (2 waves start at the same time, i.e. giants can arrive together with swarmlings).\nOne click gem creation, pre-adjustable gem creation grade, upgrade gems in the inventory with the mouse wheel too.\nEnraging gem slot - enrage all waves by socketing one gem.","imageUrl":"https://media.rawg.io/media/screenshots/d98/d98d7539b0706d51069e2404f2dbee05.jpg","releaseYear":2020,"developer":"Game in a Bottle","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":324185,"name":"Figment: Creed Valley","genre":"Adventure","price":0.0,"description":"Figment: Creed Valley is an encore to Figment. Dusty and Piper have restored peace in The Mind, however, a new adversary is threatening its balance. Our two heroes must travel to Creed Valley, where The Mind’s beliefs and ideals are formed, to face their most menacing and theatrical foe so far.\nThe Moral Compass has been shattered and a once peaceful voice of the subconscious has broken loose. Face new enemies as you make your way through enigmatic challenges and explore The Mind’s two fundamental states: Open-minded and Closed-minded. Switch between states and adapt to the shifting environment to move forward.KEY FEATURES\nA fresh chapter of Figment with its own self-contained story\nNew singing nightmares with their own original songs and themes\nDiscover two sides of the same world with a unique state-changing mechanic\nWhimsical narrative and art style\nUnravel mysteries as you venture into the depths of The Mind","imageUrl":"https://media.rawg.io/media/screenshots/2ac/2acec1eee15262b8f8db9726d16bacb0.jpg","releaseYear":-1,"developer":"Bedtime Digital Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":306111,"name":"Zup! XS","genre":"Casual","price":0.0,"description":"Experimental minimal physical puzzle with explosions. The player's must build a level and keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60 Levels\n▪  Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic by Ann Sharova","imageUrl":"https://media.rawg.io/media/screenshots/22d/22d8f061ebc02c5701bcec29d40acbdb.jpg","releaseYear":2019,"developer":"Quiet River","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":257279,"name":"SEQUENCE STORM","genre":"Action","price":0.0,"description":"EXTREME RHYTHM ACTION meets FUTURISTIC RACING.  Press the buttons in time to the music to build up speed and power, using either a gamepad or keyboard.  Strategize your use of SPEED BOOST and HYPER abilities to speed past the competition.  Unlock 36 increasingly twisty tracks with 5 difficulties each, offering something for everybody from casual to insane.  Challenge your friends in split screen mode.\nSTORY CAMPAIGN: Follow Elijah Gale through 60 missions, with two difficulties.  Elijah is a down-on-his-luck engineer who accidentally finds a lucrative new career as a \"daemon.\"  Discover a world where megacorporations have found a new use for human minds; doing their digital bidding in The Sequence, where speed is the only thing that matters.  Earn credits and upgrade Elijah's rig.","imageUrl":"https://media.rawg.io/media/screenshots/8c1/8c1366477db89ed258960ae5b554755f.jpg","releaseYear":-1,"developer":"SPECIAL MAGIC GAMES","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61097,"name":"Mini Battlegrounds","genre":"Action","price":0.0,"description":"Join Discord community for live chat\nPlease join Discord server for live chat now\n- https://discord.gg/RejNvjn\nA friendly community is awaits for you.\n-------------------------------------\nMini Battlegrounds\nLand - Loot - Survive\nPlay PUBG in a Minecraft world\nLike - https://www.facebook.com/minibattlegrounds/\nFollow - https://twitter.com/MiniBattlegrou1\nMINI MONDAY & FRAG FRIDAY - [every week!!]\nDear warriors,\nWant some more blocky chickens?\nBattle with our amazing streamer teams now!\n[Event time] -\nFrag Friday: PDT 16:00,Friday\nMini Monday: EST 17:00,Monday\n[Duration] -\n6 hours.\nDon't miss it! Join in the party with our streamers and have fun!\n[How to participate]-\nsimply enter the game and play together with streamers.You can contact our streamers for a chance to get a free beta key if you haven't bought the game yet.\nMore details -> https://www.facebook.com/minibattlegrounds/videos/280770829167057/\nKill more! Don't die!\nMBGs Team\n-------------\nhttps://www.youtube.com/watch?v=24LK_u11TPY\nhttps://upload.boom.tv/w?v=rfd4x8kwjrw0g\nhttps://www.youtube.com/watch?v=X1vA1CN3bxk\nMini Battlegrounds\nLand - Loot - Survive\nPlay PUBG in a Minecraft world\nLike - https://www.facebook.com/minibattlegrounds/\nJoin - https://discord.gg/RejNvjn\nAbout the Game* A cute blocky skin battle royale game with 8 millions registered players in China  *\n* Similar gameplay with fortnite and pubg, but more casual and easier to learn and enjoy. *\nMini Battlegrounds is a multiplayer last-man-standing battle royale full of adrenaline-packed combat! With simple controls, this game is easy to pick up for new players, while maintaining a high skill cap to entertain the seasoned veterans of the genre.\nUsing an isometric view rather than the traditional first-person view that is so common to the genre adds a unique feel to the game that separates it from its competitors, and adds a new layer of strategy and skill.\nJoin up to 50 other players in an abandoned town with one goal: survive. Gather armor, a plethora of weapons and other unique boosts, and use them to slay your enemies. It's kill or be killed, and only one person will be left alive; you.\nMini Battlegrounds shakes the dynamic of the genre, being heavily optimized to combat cheating, where similar titles fail. Whether you choose to be a casual player and focus on collecting rare skins and beautiful cosmetics, or a God on the battlegrounds, skill reigns supreme, and you must forge your own destiny.Features Intuitive control, easy to learn yet hard to master\nVast amounts of weapons with more added frequently\nFast games with meaningful rewards\nNo pay-to-win\nAnti-Cheating optimization so true skill shines","imageUrl":"https://media.rawg.io/media/screenshots/9bc/9bcf48b89e69913acf39a226da387b41.jpg","releaseYear":2018,"developer":"IOA Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":52444,"name":"Space Invaders (1978)","genre":"Action","price":0.0,"description":"Space Invaders (Japanese: スペースインベーダー, Hepburn: Supēsu Inbēdā) is an arcade video game created by Tomohiro Nishikado and released in 1978. It was originally manufactured and sold by Taito in Japan, and was later licensed for production in the United States by the Midway division of Bally. Space Invaders is one of the earliest shooting games and the aim is to defeat waves of aliens with a laser cannon to earn as many points as possible. In designing the game, Nishikado drew inspiration from popular media: Breakout, The War of the Worlds, and Star Wars. To complete it, he had to design custom hardware and development tools.\nIt was one of the forerunners of modern video gaming and helped expand the video game industry from a novelty to a global industry (see Golden age of arcade video games). When first released, Space Invaders was very successful.\nThe game has been the inspiration for other video games, re-released on numerous platforms, and led to several sequels. The 1980 Atari 2600 version quadrupled the system's sales and became the first \"killer app\" for video game consoles. Space Invaders has been referenced and parodied in multiple television shows, and been a part of several video game and cultural exhibitions. The pixelated enemy alien has become a pop culture icon, often used as a synecdoche representing video games as a whole.","imageUrl":"https://media.rawg.io/media/screenshots/c38/c381fe2913f790fc4d66620e8add37b0.jpg","releaseYear":1978,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"},{"id":0,"name":"Android"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Atari 5200"},{"id":0,"name":"iOS"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"NES"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Wii"},{"id":0,"name":"Atari 7800"}]},{"id":51567,"name":"MatchyGotchy","genre":"Simulation","price":0.0,"description":"MatchyGotchy is a fun experience from the Matchy Star world. Stars need your love so they can become the rocket surgeon they always wanted to be. Look after their food, health, household lab chores, games, and important selfie every other day.\nStars have four different life stages: smol egg, tiny baby, awkward teen, rocket surgeon adult. Your level of care will determine how quick or slow they get to grow up. They need your guidance to grow and become productive so they can build ships and explore the galaxy. It's a digital tamagotchi like experience!\nMatchyGotchy Parenting\nAll stars get two important meters: Happy and Hungry. These meters deplete over time, meaning you have to look after them. If you do not replenish these, then your Star will become neglected affecting its health and productivity.\nYou could be the proud parent of an All-Dimensional Master Shipwright, Dauntless Elegant Diplomat, Interstellar Shipment Manager, Space Physician MD, Mighty Booty Hunter, Picturesque Alien Botanist, or Astrological Forecast Specialist.\nJust like any Tamagotchi, there are important actions to take towards your parenthood skills. Soon you will be able to download more instructions so you can become the best rocket surgeon parent you can be.\nLet's get ready for Xanadu ~☆\nThe more stars you get, the better your chances to explore the galaxy. Collect them all, build your space fleet, and get yourself that fancy intergalactic Xanadu pool party you always wanted!\nMatchyGotchy is a Matchy Star inspired game experience. Matchy Star is coming 2018.","imageUrl":"https://media.rawg.io/media/screenshots/937/9373ec4dd209ad8eaee22461ced3e0ee.jpg","releaseYear":-1,"developer":"Silverware Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":49672,"name":"Audio Factory","genre":"Adventure","price":0.0,"description":"Audio Factory is a VR experience (Daydream port) showcasing spatial audio capabilities of the Resonance Audio SDK by Google. Work your way through each factory floor to experience evocative sound design, compelling visuals, and fun interactive tasks. Experience how spatial audio contributes to the VR immersion.  This is a Daydream port and visualizes the Daydream controller by mapping controls to the Vive and Oculus Touch controllers. Note: Wired headphones required (Bluetooth headphones not supported due to their increased latency). Vive controller or Oculus Touch controller required.\nFor more information on how you can add spatial audio to your VR experiences using the Resonance Audio SDK, please see our website link further down on this page.","imageUrl":"https://media.rawg.io/media/screenshots/fbe/fbee8c8a0dc0ec979a977f9587140b81.jpg","releaseYear":2017,"developer":"Google","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":48912,"name":"MegaRace 1","genre":"Action","price":0.0,"description":"You know those punk highway gangs, the ones who really think they rule the road? You just hate them, don't you? So you say, 'Somebody ought to do something about them criminal highway gangs!' And we say, 'Oh yeah?! Well, why don't YOU do something, mister big-mouth!'. You don't have the car? We'll give you the car! You don't want to get arrested for taking the law into your own hands? Not a problem! You know why? Because it AIN'T REAL! It's a whole lot better than real, baby! It's virtual television: reality's worst nightmare!\n* Aggressive, high-velocity, futuristic racing\n* Breathtaking visuals for their time, achieved by using prerendered video sequences\n* Sometimes witty, sometimes just plain cheap commentaries by the memorable Lance Boyle","imageUrl":"https://media.rawg.io/media/screenshots/d1c/d1c446f612ab174c1a8f8f1ed312a752.jpg","releaseYear":1993,"developer":"Cryo Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":47504,"name":"Grace of Zordan","genre":"Strategy","price":0.0,"description":"Strategy and tactics turn-based card game mostly focused on player’s ability to assess the situation and control the battlefield. A small indie developer team is ready to present their vision of the best strategy and tactics turn-based card game, the Grace of Zordan.\nIn Grace of Zordan, you use spells, organise your units in the battlefield and lead your hero to victory using the cards and abilities of the creatures. As developers, we tried to create the card balance that would not be based on donate and some cards dominating the other ones, but rather on fine interaction among them and the player’s skill. We strive to avoid the situation where the players either stop using some of the cards or use them significantly less often than the other ones.\nWe drew inspiration from a variety of genres and diverse games: chess, Heroes of Might and Magic, Diablo, Warhammer 40k: DoW, Warhammer: Total War, Hearthstone. We do our best to improve the game’s attractiveness to people who prefer winning with their own abilities, style, cunning and calculation. We are trying to minimize the Pay-To-Win effect to a Pay-To-Opportunities system, so that the players could showcase their skill more.3 Decks instead of oneYou decide which deck to draw the next card from. To get to the card you need faster, put it in the first deck. In our game, you’ll find it a lot easier to put together a deck of your preference to defeat your opponent.\nActivated AbilitiesAlternative use of mana through balanced game opportunities will help you reasonably diversify your strategy.\n7х7 Game BoardA unique game board that allows you to win tactically. Battle mechanics allow you to make tactical advantage of creature position and characteristics.\nModifiersUse unit characteristics to break enemy defenses or come up with a counter-strategy.\nSurprise Your OpponentsSucceed through unpredictable moves and accurate calculations. Diversity of balanced units and cards creates innumerable ways of outside-the-box play.\nBalanceThroughout the development process, the balance was tested and developed by people with cybersport experience. We strive to minimize occasionality.\nLooking forward to seeing you in the Grace of Zordan! =)","imageUrl":"https://media.rawg.io/media/screenshots/601/601b00d67690cdbc828db82aeec036c2.jpg","releaseYear":2017,"developer":"Cybergrotex","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46429,"name":"Utawarerumono: Mask of Truth","genre":"Adventure","price":0.0,"description":"The final chapter of the Utawarerumono series!\nYamato and Tuskur—two nations' fates hang in the balance⸺\nFor almost two decades, this series of tactics-RPG visual novels has been beloved by Japanese fans for its spectacular music, art, characters, and story. Now it finally returns to its origins on PC.\nThe riddles of the past are answered here.Features50+ hours of story and gameplay\nThoughtful, slick, and active tactics-RPG combat\nNew Co-op Final finisher moves to slay your enemies in style\nCustomizable keyboard and mouse controls\nAn unforgettable, evocative soundtrack.\nCatharsis","imageUrl":"https://media.rawg.io/media/screenshots/324/3249c89f16e7f511fe52c4092552362c.jpg","releaseYear":2017,"developer":"Atlus U.S.A","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":45622,"name":"Bloodlines of Prima","genre":"Action","price":0.0,"description":"Infinite power.\nUnlimited wealth.\nEternal life.\nThose brave enough to conquer the untamed primordial lands will be richly rewarded should they unearth what legend claims is hidden there. Tread carefully. If you die, you lose everything.\nBloodlines of Prima is a FPS Rogue-lite Multiplayer game, set in a land overwhelmed by mysterious elemental forces. You are in search of the Prima Materia, the key to creating the legendary Philospher’s Stone.\nMix and match hundreds of different abilities to achieve your goals.\nCollect essences of your slain enemies to reinforce the base camp, unlocking new buildings and services, summon bosses or buy powerful equipment for your character.\nHelp your server to progress and conquer challenges before other servers do.\nUnlock bank access to save your most precious treasures from being pillaged from your dead body.\nExplore a huge, diverse environment dominated by strong elemental enemies.\nUpgrade your equipment, craft consumables to increase your power, or transmute your accessories to augment your abilities.\nThe more you explore and conquer, the more powerful your Bloodline becomes.","imageUrl":"https://media.rawg.io/media/screenshots/ba4/ba4ac97f729fa1d31fd3e30b4e5d687f.jpg","releaseYear":2017,"developer":"Amazastrophic","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":45297,"name":"Warfront Defenders: Westerplatte","genre":"Action","price":0.0,"description":"Battle of Westerplatte was unique in many ways, and this game will try to reflect on that. Players can expect that they will be outnumbered, outgunned, but not out of tactics. Also, expect enemies with brains, they will react to your strategies and apply counter strategies to break down your defences. All you have is a handful of soldiers to stand in their way.\nWarfront Defenders as a series of games will attempt to take inspiration from the historical battles of WW2 and turn them into tactical games playable on small dioramas. This game is made in collaboration with the Museum of Westerplatte to derive inspiration from the actual event and design the level based on the actual maps from the period. Though this is not a chronological account of the battle, the gameplay and the tactics are heavily inspired by the proceedings of the historical battle and its challenges are designed to remember the defenders of Westerplatte.\nFeature List:\nDestructible environments\nPosition your soldiers anywhere, use cover tactics, some of the areas are more exposed than the others\nEquip/Add health and Upgrade/Downgrade your soldiers during battle\nBuild fortifications, lay mines to slow down or kill enemies\nReactive enemy AI, changes strategies based upon your movement\nOverwhelming bosses like Battleship Schleswig-Holstein, Stuka dive bombers, snipers","imageUrl":"https://media.rawg.io/media/screenshots/c16/c16134e2ad9b44df07cf83c962bd8498.jpg","releaseYear":2017,"developer":"Flying Robot Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]