[{"id":15164,"name":"Primal Carnage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83e/83ec6107288567671f6008d9a05fab7e.jpg","description":"Primal Carnage is an online multiplayer shooter that immerses its players in skilled PVP combat, team-based strategy and savage class-oriented matches unlike any you've previously experienced...\nDispatched to reclaim a remote island from a dinosaur outbreak, a team of battle-hardened mercenaries fight to take control of its abandoned facilities and secure classified objectives. Play either side in the fight for survival of the fittest, taking on the role of an armed human mercenary or a cunning prehistoric predator.\nIt’s Man versus Dinosaur in the ultimate fight for dominance...who will emerge victorious and who will become extinct?Key Features9 Maps with large, open environments illustrating the vastness of an overrun remote island\n10 playable classes, each with unique skills and abilities\nPlay from both first-person (humans) and third-person (dinosaurs) perspective\nAchievements, unlockables, and cosmetic DLC\n\"Get to the Chopper\" mode - Humans must fight their way through the dino horde to reach their only escape... the CHOPPPER!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Lukewarm Media","platforms":[{"id":0,"name":"PC"}]},{"id":9838,"name":"Empyrion - Galactic Survival","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d4/4d413314381152621b2ce1880545c962.jpg","description":"WorkshopEnrich your gameplay experience with blueprints from the Empyrion workshop: browse great collections of community created vessels and bases, try new and uncommon designs - or upload your own projects!\nAbout the GameEmpyrion - Galactic Survival is a 3D open world space sandbox survival adventure. Build powerful ships, mighty space stations and vast planetary settlements to explore, conquer or exploit a variety of different planets and discover the mysteries of Empyrion!\nFight human, alien and biological hazards and survive in a hostile galaxy full of hidden dangers. Play as a lone wolf or team-up with your friends, build new friendships, create alliances or make war to conquer the solar system.\nEmpyrion uniquely combines elements from space simulations, construction games, survival games and ego-shooters. In Empyrion, you can forge your destiny in a galaxy with infinite possibilities!Space and Planet Exploration:An absolute free-roaming experience awaits you: warp between planets, fly from planet to moons, land on planets and freely walk around to explore your surroundings. Discover the secrets of different alien races and tangle with the native fauna and flora. A sandbox full of different, vivid planets is waiting for you to explore!\nSolar System and Open World:The solar system is procedurally generated and features several planets and interesting POIs. Each planet has its own characteristics (planet type, gravity, atmosphere, number of moons, terrain, surface, vegetation, climate, and resources).\nBuilding and Construction:Build large capital vessels, small fighters or mighty space stations and vast planetary settlements by yourself - or download a blueprint from the Steam Workshop and customize it with your very own ideas of form and function!\nSurvival Mode:Get out of your escape pod, grab what's left from your ship and prepare to survive in a hostile environment. Food and oxygen are rare, resources are scarce, ammo is low and dangers lurk around each and every corner. Keep your eyes open. You need to be smart and well prepared if you want to survive more than a day on an alien planet far away from Earth.\nCreative Mode:Just build and make your craziest dreams come true, without having to bother with food, resources or enemies. Join the Creative Community and upload your creations to the Steam Workshop!\nSingleplayer and Multiplayer Play as a lone wolf in single player or join the multiplayer community: team-up with your friends, build new friendships, create alliances or make war. You can build yourself a comfortable home in a well-protected PvE area or face the permanent dangers of PvP planets to ransack their riches or conquer the solar system with your faction.\nWildlife and Enemies:Don't get mislead by the peaceful animal wildlife of some planets and the silence in space. Most of the animal wildlife wants to snack on your leg - and aggressive robot drones, alien soldiers and their guardians will try to hunt you down as soon as you are within sight. Fight for your life and deploy a range of weapons against fierce and obscure alien creatures.\nMining and Resource Gathering:For building and construction, you need to gather and mine resources. Dig down to the rich deposits of a planet or drill through an asteroid full of rare ore. You might also plunder alien buildings or scrap any structure you come across.\nExtensive Crafting System:Learn how to combine resources and building materials to craft your equipment. Craft your stuff in your base or while you are on the move and equip your buildings and vessels with a range of different devices, weapons and gadgets for different purposes.\nHunting, Farming and Food System:Grow your own vegetables and fruits or hunt creatures for their meat to prepare yourself a delicious meal. Some plants help to create medical supplies while others can be picked up and consumed for first aid or to quickly settle your empty stomach.\nExperience and Tech Tree:Do whatever you want - and gain experience points for doing so! Scrap that old stuff and use the points to unlock those shiny new devices in the Techtree.\nTerrain Deformation:Each planet features a voxel-based terrain. You can entirely modify and deform the terrain: flatten it for your planetary station, dig holes to find resources or build a tunnel system to protect yourself. Empyrion is a true sandbox game!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Eleon Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":3980,"name":"Pool Nation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6e/c6ed897e162db936cd26053bc5e9f6e3.jpg","description":"Pool Nation FX Now Available!Owners of Pool Nation can now pick up Pool Nation FX at a discounted rate!  But hurry as this is a limited time offer!\nhttp://store.steampowered.com/app/314000/\nAbout the GamePlay POOL NATION and become mesmerised by our balls, entranced by our decals & unashamedly attached to our cues, so join us please, & just have fun playing pool!! WARNING: contains addictive content!!\nPool Nation, with WORKSHOP integration AVAILABLE NOW in our Crazy Mode the Box Of Tricks (Out Now)! But fear not, Pool Nation is not just about trick-shots, Pool Nation is a serious pool sim, the heart of the game is our world renowned Physics engine, the balls will behave as they would in the real world - Fancy a game with Aiming Assist turned off - you go ahead - Play Pool Nation Your way!\nWith eleven addictive game modes, including the adrenaline pumping Endurance, extensive career modes and seven exciting online modes including the new Speed Pool! Not forgetting the Box of Tricks coming soon to Steam, giving you the ability to imagine, build and share your most outlandish trickshots with the world. Utilizing a variety of objects, including Ramps, Pikes, Loop the Loops and Speed up strips, the Box of Tricks is limited only by your imagination.\nWith Pool Nation, gameplay is king! Online or offline, the ease of control gives you the ability to pull off shots you wouldn't dream of in the real world. The balls behave exactly as they should use the table surround to create the most unbelievable trickshots and view them back in super slow mo.\nThe graphics are as shiny and pixel-perfect as the physics, with beautiful locations, stunning exterior landscapes, eye-catching interiors, the ability to change the time of day, and customize your games with a huge array of balls, cues and table decals creating your ideal pool playing environment. Every detail has been considered and polished, from the super-detailed table baize and deforming cushions, to the explosions of chalk dust from the cue tip.\nPool Nation - the Community's Pool Game!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cherry Pop Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":622495,"name":"Metroid Dread","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c26/c262f8b54b46edc72594c4a9bb8ee13e.jpg","description":"Samus’ story continues after the events of the Metroid™ Fusion game when she descends upon planet ZDR to investigate a mysterious transmission sent to the Galactic Federation. The remote planet has become overrun by vicious alien lifeforms and chilling mechanical menaces. Samus is more agile and capable than ever, but can she overcome the inhuman threat stalking the depths of ZDR?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":400298,"name":"Soul Calibur IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a6/7a6727469c2a24cc4230effc3d280c3b.jpg","description":"Soulcalibur IV (ソウルキャリバーIV Sōrukyaribā Fō) is the fifth installment in Namco's Soulcalibur series of fighting games, released for the PlayStation 3 and Xbox 360 in 2008. Soulcalibur IV included three characters from the Star Wars franchise as playable fighters. This was the first Soulcalibur game not to receive an arcade version, and the last Soul series’ 1590 A.D. trilogy game, following II and III. In addition to greatly improved graphics over the previous title, the game features guest characters from the Star Wars franchise. A spin-off for the PlayStation Portable, Soulcalibur: Broken Destiny, was released in 2009.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":50580,"name":"Retimed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ec/9eced3b4e62074779e8218ab50a5b8f4.jpg","description":"Retimed is a local multiplayer arena shooter for 2-4 players. When a player is in danger, time slows down and a time bubble is created around the player. Now there is enough time to react and try to dodge the deadly projectiles. These time bubbles generate exciting alternations between fast-paced movement and tension-filled slowmotion moments.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team Maniax","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28207,"name":"FUEL","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b4/0b43ec1b1d17eda4c9e5ab0a7687d577.jpg","description":"Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   The Games on Demand version supports  English, French, Italian, German, Spanish.  In an alternate present, vast swathes of America have become no-go areas as the devastating effects of global warming ravage the continent. Floods, storms, bush-fires, tornados and hurricanes have driven people from towns and cities into safe zones as extreme weather wreaks havoc, creating thousands of square miles of dangerous uninhabitable areas. People turn to renewable energy in the face of the destruction caused by global warming. But these danger zones become a playground for a new breed of racer. With a stockpile of fuel to be burned, adrenaline junkies head into the wilderness to compete against each other in spectacular races against themselves and the elements.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Asobo Studio","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":22641,"name":"Fantasy General","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e44/e44ff4680f9490220bfa5c45c153eed5.jpg","description":"Fantasy General includes the \"Island Challenge\" add-on.\nFor over a century, the world of Aer was a place of peace, joy and prosperity. Through advances in technology and magic, its inhabitants created a harmonious society, rid of disease, destruction and evil. All was well within the land of Aer... Until the Shadowlord came. Once a mere man with a voracious thirst for knowledge and power, the Shadowlord explored where no other dared, forsaking his humanity for absolute control. Summoning forth creatures of evil and attracting the most despicable of men, he created a powerful army and conquered Aer, engulfing it in pain, suffering and death. With the populace kept weak and divided through brutality and fear, few dare to openly challenge his reign. But now, The Council of Five, a leadership of Aer’s wisest rulers and mages, has selected a powerful general to unite its people and challenge the Shadowlord’s rule. With magic, beasts, mortals and mechs at your disposal, you must construct and lead your army across the lands of Aer, defeating the Shadowlord’s forces and generals.. Join the battle and restore peace and happiness to this broken world.\nFantasy General is the third instalment in Strategic Simulations’ Five Star General Series, and invites you to leave the trenches of World War II and enter a world of heroes, swords, magic and beasts. As a turn-based strategy game, you must lead your army into battle with the Shadowlord’s forces and defeat each of his lieutenants across varying terrain and battlefields. Build your army from the ground up, research upgrades to strengthen your forces, and augment your army with items and heroes who will aid you in your plight. With an atmospheric choral soundtrack, a user-friendly, point-and-click interface and engaging strategic gameplay, this contrasting addition to the Five Star General Series will have you hooked from the opening cinematic and will keep you plotting and battling to the very end.\n- Battle the Shadowlord’s forces and lieutenants across 5 continents\n- Choose your general from four champions, each with its unique traits and abilities\n- Customise and upgrade your army, with over 10 unit classes and four races to recruit from\n- Uncover hidden items and heroes to upgrade your troops and lead your army\n- Choose from three game modes: Campaign, Scenarios and Local Multiplayer","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Strategic Simulations","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22413,"name":"Rover Rescue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d13/d131365a7f871aca8240e9e203a04cc5.jpg","description":"Three ships, ten planets, thousands of people in danger and millions of meteors between them and you. Rescue as many as possible in a race across the whole solar system and make off with as much salvage as you can in this fun & frantic little home-made sci-fi action-strategy game!FeaturesBringing the line-drawing genre forward, The Agent Saga Rover Rescue adds 3D levels with gravity, power-ups, speed enhancers, commander upgrades and so much more!\nThere’s actually a bit of a story! It all ties together into rest of The Agent Saga.\nFor those that like their Space, the entire menu system is an integrated audio-visual tour of the solar system, integrated fully into the game, with artwork based on real NASA images.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pointscape","platforms":[{"id":0,"name":"PC"}]},{"id":17929,"name":"Huntsman: The Orphanage (Halloween Edition)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef7/ef770b8d793d2fb2844222e8372dc389.jpg","description":"HALLOWEEN EDITION v1.03 - NEW UPGRADE!v1.03 is now live, with extra sound effects and a new memento that unlocks a new part of the story! Get lost in the hedge maze returning the mementos to free the orphans, escape the Huntsman as he walks the same dark pathways... hunting for you!\nHUNTSMAN HUNTING YOU!\nNOW WITH SHORTER STORIES, 30 TO 60 SECONDS EACH\nFULL-LENGTH STORIES STILL IN THERE IF YOU KNOW WHERE TO LOOK!\nINTRICATE HEDGE MAZE DESIGNED BY A \"RIPLEY'S-BELIEVE-IT-OR-NOT\" MAZE-MASTER\nNEW UPGRADED AND EXPANDED TERRAIN\nIMPROVED GRAPHICS & MORE NEW SOUND EFFECTS\nAnd Merry Christmas to all our existing customers, v1.03 IS A FREE UPGRADE and thank you for your support!\nSteam Greenlight\nThis game was picked with help from over 66,666 members of the Steam Community. To vote for other games you’d like to see made available on Steam, please visit Steam Greenlight.\nAbout the GameMORE STORY THAN GORY! A HYBRID OF ALTERNATIVE HORROR AND CREEPYPASTA...\nWelcome to the Halloween Edition v1.03!\nTake a deep breath, dim the lights, put on your headphones...\nNon-linear first-person gameplay lets you explore Grimhaven Orphanage and discover the characters who once lived there – voiced by Dan Bull, Chuck Huber and Raychul Moore, plus a multitude of other great voices from around the world - some of which we discovered through our global YouTube auditions!\nWe call this ‘alt horror’ because it has no graphic violence, blood or guns. As the player, you have no defense... however, you must show empathy and courage to save the twelve missing orphans. This is a game for people who like to explore, listen, think and solve - and play cat and mouse in a dark and scary maze. Listen to the nineteen personal creepypasta-style stories to piece together the mysterious events of that fateful night in 1898, when twelve orphans simply... disappeared! Now with shorter (30-60 sec) in-game stories to enhance the tension and new plot twists when you least expect them! And don’t panic story lovers! The full stories are still there – on the menu page and somewhere within the game… if you know where to look!!\nFind the twelve orphan’s mementos and place them on the correct headstones to set the lost souls free. Did we mention the headstones are in a hedge maze? Custom-created by a ‘Ripley’s Believe-It-Or-Not’ Maze Master? No problem! But first you’ll have to find the key... Are you up to the challenge? Did we mention the Huntsman… in the maze… stalking you? Did we mention he may also be lurking in Grimhaven Orphanage?\nSo – how fast can you turn and run? Well you won’t know ‘till you check it out! So go do it! Have fun!!  Scare yourself as much as you want (maybe you should keep the hallway light on…!)\nThis is a Free Upgrade for all our Steam key holders and supporters of our Black Friday Edition – THANK YOU!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"ShadowShifters","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":39588,"name":"Time Gentlemen, Please!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08a/08ab7c2b2ec75aec6a7d2642cc31de0e.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Zombie Cow Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17922,"name":"Deadbolt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/64f/64f4c1b2f06d1baa5c3f937aac986c03.jpg","description":"DEADBOLT is an extremely challenging stealth-action hybrid that allows you to take control of the reaper to quell the recent undead uprising. Play and complete missions given to you by the mysterious fireplace as you become the avatar of death. While the reaper has an impressive arsenal and skillset to kill the undead, he has one flaw - he dies in one shot... leaving you with no room for error.Key Features:•\tComplete over 25 extremely challenging missions\n•\tUnlock and obtain over 30 weapons, ranging from a reaper's scythe to an automatic grenade launcher\n•\tFight over 35 enemy types, from zombies to vampires to bosses and more\n•\tChoose your playstyle: quiet assassin, loud one-man army, or anything in between\n•\tGib them all! DEADBOLT's dynamic gore system guarantees that all evisceration leads to satisfaction\n•\tChoose your own way to complete a mission - no mission has to be completed in one way\n•\tAccomplish a variety of objectives, like assassinating gang leaders and investigating mysteries\n•\tMulti-genre soundtrack created by the talented Chris Christodoulou of the Risk of Rain OST\n•\tCreate and play custom maps with the DEADBOLT Map Editor (Windows only)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hopoo Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":14803,"name":"Age of Conan: Unchained","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8d/c8d1882cc7b49cadb08e9a309cb148e5.jpg","description":"Age of Conan: Unchained is an award-winning and critically acclaimed massively multiplayer online game set in the sexy, savage and brutal world of Conan the Barbarian.\nTread in the footsteps of the greatest fantasy hero of all time, and explore the vast reaches of Hyboria. Choose between twelve different classes, from Barbarian to Demonologist, and fight your way to riches and glory as you battle creatures straight out of hell or even engage in colossal guild vs. guild warfare!\nRobert E. Howard’s brutal, savage of world of Hyboria comes to life in a way you’ve never seen before!  Experience a massive and diverse online multiplayer world where your best friends are the steel at your hip and the wits about you.\nChoose from Twelve distinct classes and weave the tale of your character’s life as you begin on a Stygian slave ship off the coast of the Barachan Isles. Without any memory of your identity, it’s up to you to be the master of your own destiny.\nAge of Conan: Unchained’s combat system features active roles in combat. You control every chop, thrust, and swing of your weapon.  Unleash devastating combos and show no mercy!\nRecruit allies and rule your very own guild, work together to acquire renown, and construct vast guild cities as a monument to your glory.  Then, engage in epic guild-vs-guild siege warfare in the Border Kingdoms and claim battlekeeps in the name of your people!\nAge of Conan: Unchained is completely free-to-play!  Simply create an account, grab some friends, and join the fray!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Funcom","platforms":[{"id":0,"name":"PC"}]},{"id":14356,"name":"Cubicle Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b22/b22ac938447679d82637500386a33075.jpg","description":"Cubicle Quest is a game about how life can suck. Dead end jobs, repetitive obligations, irritating coworkers... Cubicle Quest takes all of those things and turns them into enemies you can fight in an old-school RPG.\nAdventuring in Cubicle Quest doesn't earn you levels and gold to fight some great ancient evil. Every quest has an impact on your character's life, whether it's getting a promotion at work, finding new friends, or figuring out what you want to do in life. Gain allies and personal strength until you take on the forces keeping you in your cubicle!\nFeatures:\n- 20-25 hours of gameplay, including post-game challenges and secret ending. Permanent choices and time-based challenges add replay value.\n- Monsters don't drop gold. All your cash comes from the complex financial system, including your regular job, side gigs, and potentially starting your own business.\n- In addition to destroying your credit card and college debt, you can invest your money in savings accounts and stocks.\n- Instead of elements like fire and ice, you fight enemies with work or interpersonal skills for intuitive strategy. The enemies will be hitting you with unique elements too, many of them not comparable to normal RPG strategies.\n- Nine party members, each useful for supporting you in different challenges.\n- Multiple choices for marriage, each providing unique elements to the second half of the game. Or stay single, if you find the right quest.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ian Isaro","platforms":[{"id":0,"name":"PC"}]},{"id":46480,"name":"Thief Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3d/f3d20e1d997bdcf3cae0cb3caba8343b.jpg","description":"Thief Simulator\nBecome the real thief. Observe your target and gather information that will help you with the burglary. Take the challenge and rob the best secured houses. Buy some hi-tech burglar equipement and learn new thief tricks. Sell stolen goods to the passers and avoid too much attention from the police. Do anything that a real thief does!\nA good thief always observes his target. What's inside? Who lives there? What's your target day schedule? Find out when the house is empty and does it have nosy neighbours. Check if their dog chooses dog snacks over the bone. Dress as a courier or a cop to investigate your target even better. Choose from lots of possible approaches to prepare the best plan. Many modern devices available in Thief Simulator might come in handy with gathering intel about your target and it's neighbourhood.\nThe faster, the better. Find and steal as many valuables as possible in the shortest time possible. Remember that infinite backpacks don't exist. When it's about time you have to maintain cold blood. In every house you'll find tons of useless stuff, which can really slow you down. If you're not shure that you can take some serious money for it, maybe a good idea would be to leave it behind and save space for some expensive goods. If you fill your backpack with worthless items, you may have to waste your time to throw stuff out just to make space for other things. Be careful, cause some things can draw police attention to you!\nA real, experienced thief can spot places where there's most probability of finding some valuables on the fly. Use the scanner to highlight all the valuables in sight and places where you can expect them to be. Remember that you can use it only few times during burglary and that it has a limited range.\nGet rid of stuff that can lead cops on your track. Turn off the GPS trackers, disconnect all the devices from the internet and erase serial numbers. Disassemblement of an car is expensive, but if it's a rare model, spending a few dollars may save you a few years in prison. Some of the goods you can sell without investing money in getting rid of tracks, but ultimately the decision is yours. Remember, that if you dont remain careful, cops will eventually knock on your door.\nLook around for any useful items. They will save you some time on lockpicking or hacking. Keys, notes with passwords to the alarm systems, or even fridge magnets. All those things can look useless, but can also make life of an aspiring thief so much easier and reduce your burglary time even by a half. Of course many of them are just useless trash... Or maybe they aren't?\nBe careful! In some houses you can meet unexpected guests. If they catch you in the act, your memory portrait will be on every pole in the city. This will seriously impact your intel possibilities and reduce the trading capabilities.\nDesign your own house. Build a fortress and put it to the test with the Thief Simulator editor. Choose from alarm systems and security devices you've already seen to make potential thief's life a little harder. Get yourself a dog or two. Surround your house with the electrical fence. It all depends on your imagination and wallet of course. See if others can rob you!\nFind your neighbour's house or build it yourself, and find out if it's easy to rob. Make a bet with frend about who robs the other one first, or join forces, build an unconquerable fortress and put it to the test by sharing it with other players.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Noble Muffins","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":36777,"name":"Tom Clancy's Ghost Recon: Advanced Warfighter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5d/d5d1285eda70648606e4ce108d8e82b9.jpg","description":"(Online Interactions Not Rated by the ESRB) Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". The face of war has changed. New enemies and new threats require a new type of warfare - a new type of soldier. Enter the Ghosts.    Become the soldier of the future:  Using a fully integrated combat system with cutting-edge weapons and revolutionary communication systems, gain a realistic view of how war will be fought in the next decade.    Customizable multiplayer experience and Unique Online Co-op Campaign: Create your own identity, create your own gametypes, and take the battle online with up to 16 players. Then, play a brand new campaign created exclusively for online coop play. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"}]},{"id":16266,"name":"Conflict Desert Storm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/50f/50f52c19d1af1ed922a518a3b52a7172.jpg","description":"Take charge of the most feared special operations forces in the world: the elite British SAS or the US Delta Force squads. You're the best trained, best equipped and best organised. The area that has been assigned to you is yours for the taking. Seek, locate and destroy enemy targets and personnel. Create havoc and confusion throughout the enemy's lines of communication and supply. What lies before you is the opportunity of a soldier's lifetime. Take your equipment, take your training and use it well. Squad-based combat over 15 challenging missions.Key Features:Control a squad of four expert SAS or Delta Force operatives - Team Leader, Sniper, Heavy Weapons Specialist and Combat Engineer.\nCall in air strikes, take control of vehicles and engage in the most fearsome combat you will ever face.\nWatch your squad's expertise improve as each mission is completed.\nUnprecedented AI governs enemy and squad behaviour.\nMultiple paths through 15 challenging missions in urban, desert and indoor environments.\nReal-World physics and ballistic models accurately simulate the rigours of combat.\nSuperb sound effects, explosions and actual Special Forces weaponry.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Pivotal Games","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":14100,"name":"Sakura Beach 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c5/8c5313a652b7b008606b08a0bf2dc838.jpg","description":"It's been a few months since Seiji last visited the beach. After enduring the chaos of his new daily life, another holiday with his childhood friends is just what he needs. However, the appearance of another girl whose love of space rivals his own ensures that his trip will be anything but peaceful.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2496,"name":"Runestone Keeper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/154/15443c24ae7ca8a1443927be67c6a0c8.jpg","description":"Runestone Keeper is a challenging roguelike to roguelite dungeon crawler that blends classic role playing elements and turn-based combat strategy.\nDive into the dungeon roguelite-ness and begin your very own epic adventure! Grab your rucksack, sharpen those dusty swords, step into the dark chamber and fight for glory![Features]Randomly Generated Dungeon Elements – Almost everything is generated differently each time to ensure a unique experience!\nPrefix and Suffix Based Equipment – Loots come with random yet rare prefixes and suffixes. Combat, collect and combine for a killer suit!\nDiverse Monster Mixes - Tread lightly, or be ganged upon by monsters with complementary abilities that might drive you crazy.\nItems, Traps, Devices and Events - Opportunities for a favorable turn even at the most desperate moment. Choose wisely and use the unwelcoming surroundings to your advantage!\nHeroes and Goddesses – Create your hero’s attributes build! Sacrifice to receive your mighty God’s blessing (and later betray him to check out his fury)!\nModes and Leaderboards - Multiple modes to choose from and a global ranking system to check yourself among all the dungeon adventurers.\nA Challenging Experience - Prepare to have a tragic (not to mention permanent) death ;)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blackfire Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":51327,"name":"Mega Man 11","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f75/f751a9a43abb507bf95f9b96cc79feac.jpg","description":"Mega Man 11 is the eleventh game in the main series of Mega Man franchise. It is designed n the vein of classic 16-bit 2D platformers.\n\n###Plot\nLong ago, Dr. Wily, a would-be mad scientist, created a device called the Double Gear System that could increase the powers of robots by pushing them to the limit. The device was banned for being too dangerous for robots. This time, however, Dr. Wily decided to complete his creation and test it on the eight robots he stole from his former colleague, the wise Dr. Light. Using Double Gear, Dr. Wily creates Robot Masters of the stolen robots to help him to conquer the whole world. Mega Man, a good robot and the protagonist of the series, cannot defeat the stronger and faster Robot Masters. To help him win, Dr. Light temporarily installs him a variation of the Double Gear System.\n\n###Gameplay\nThe player controls Mega Man in a 2D environment, as he runs through the levels and defeats evil robots. There are eight unique Robot Masters that serve as the game's bosses.\n\nThe Double Gear System not only sets up the game's plot but also works as a game mechanic. Using it, Mega Man can access two additional skills. The first is “Speed Gear” that allows him to slow the time down as if he moves and reacts incredibly fast. The other is “Power Gear” that allows Mega Man to make attacks that deal more damage. In accordance with the game's plot, however, the use of the Double Gear System is not safe and can overheat Mega Man.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":45827,"name":"Door Kickers: Action Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a45/a454fd08fdb77a0361d2bb7b2a16f7fa.jpg","description":"Door Kickers: Action Squad is an old school side scroller action game that puts you in the role of a SWAT trooper and sends you to deal with bad guys in various locales of Nowhere City USA.\nChose your gear wisely then kick the doors down and face the outlaws. Master weapons recoil and time your reloads, use distance and cover to your advantage and, most importantly, know your enemy and deal with him accordingly.\nAnd when it gets too hard, bring over a friend to help.\nQuick Points:High detail retro graphics\n3 playable characters, each with unique gameplay\nnon linear levels and unpredictable enemies\nover 20 weapons and gear items\nover 20 enemy types and 4 game objectives\nUnlock player and squad abilities and use them wisely\nCouch and Network Cooperative Multiplayer\nLevel Editor included\nComing to Windows in 2017, with Mac/Linux TBA","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"KillHouse Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":11212,"name":"Violett Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a8/8a8161dbd6c19ba108ea5ea230de22c5.jpg","description":"Special OfferBuy Violett on Steam and get the fantastic Soundtrack from the game for free. A set of catchy tunes will accompany you wherever you want!\nAbout the GameThe new ultimate version of Violett brings even more of the best point and click adventure fun, right onto your screen. In this expanded version you'll see a pair of completely new levels, full of entirely new puzzles and specially composed music. Upgraded graphical effects in the game making the hand-painted, Escheresque surroundings look even more stunning. Redesigned and improved game mechanics as well as controls will let you solve the riddles presented to you with much more ease. If you ever get stuck by a particularly tricky puzzle, a redesigned system of tips will help you move forward. And newly added gamepad support will make your game much more pleasurable to play on your big screen TV or your PC's monitor.\nSet in a world full of wonders, quirks and things from beyond our reality, Violett is a remarkable adventure game that will push your brain to the limits and engross you completely.\nDragged by her parents, a young and rebellious teenage girl – Violett, moves to an old spooky house in the middle of nowhere. Forced away from her friends and life in the city; she imagines how boring life in countryside will be: spending day after day, bored in her room with absolutely nothing to do. But what she cannot imagine, is that in just few moments, she'll have the adventure of her life.\nA spark of light from the nearby mouse hole catches her attention, she reaches inside and in a blink of an eye she's in a completely different place. So familiar, yet so distant. So magnificent, and yet dangerous. A place where frogs singing operas are daily occurrence, garden gnomes are emissaries from another dimension and power of telekinesis is not freaking anyone out. Now only your wit and luck can help her unite with her parents.\nRack your brain on intricate puzzles. Use the power of telekinesis to get you out of your troubles. Fight the evil spider queen that wants to make you her new trophy. Use your touch to roam the beautiful and slightly psychedelic world, inspired by Alice in Wonderland, Dali and other great works. Immerse yourself in the soothing sound track, that is also available as a DRM free download\n- Fantastic 2,5D point-and-click adventure game\n- Unique world inside the 'rabbit-hole'\n- Multitude of puzzles and riddles\n- A spooky atmosphere of mystery and uneasiness\n- Evil Spider Queen who's trying to prevent you from ever coming back\n- Paranormal forces to manipulate objects\n- Beautiful hand-painted graphics full of quirkiness and style\n- Full parallel reality inspired by Alice in the Wonderland and other great works\n- Gamepad support","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Forever Entertainment S. A.","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":9607,"name":"Holodrive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/919/919f40aa83ce3ea662a0f66ee00ab193.jpg","description":"Holodrive is a super fast-paced collectable 2D multiplayer shooter. Create your robot, customize it and jetpack your way to victory!\nWhen Holocorp created the 'Dummys' their main purpose was to be companion robots - mans new best friend. No one could predict these robots would turn out to be obsessed with blowing each other up... in style! Now, dressed to impress and equipped with a vast arsenal of guns and an unhealthy dose of unpredictable power-ups, they compete in special arenas to see who's best. What could go wrong?\nNon-Stop Multiplayer Action\nThe action is fast and strategic and explosions are rife! You'll learn to love blowing each other up, but when you do you'll materialized quickly to continue your shooting spree. Use the map to your advantage and surprise your enemies by teleporting right into the combat or hiding behind anti-bullet barriers!\nCollect a vast arsenal of weapons\nCarry up to 7 weapons at a time. Pick up weapons and ammo as you platform through the levels or grab weapons from enemies you kill. Get different weapons by opening packs, craft them or equip your free weapon that’s available on rotation every 3 days!\nMobility, Versatility, Unpredictability\nEvery Dummy is equipped with a jetpack so you can move with great speed through the arena. Fast gameplay is accentuated with the use of ramps and strategically placed power ups that can turn the tide of battle with an element of surprise at any time.\nCustomize and Show off your Stylish Self\nHat, head, torso, arms, legs, skin and jetpack are fully customizable! Open Holopacks and compete on style with complete sets like the Shinobi or Ninja, OR mix and match to make a brave and bold fashion statement!\nJump in - It's Free to Play, now with Cocoball!\nHolodrive is free to play, but it's a level playing field even if you DON'T spend money. You’ll be able to collect any combat item by just playing the game! Compete in deathmatch or jump in one of 3 team-based game modes including the new Cocoball for a cluckin good time!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BitCake Studio","platforms":[{"id":0,"name":"PC"}]},{"id":21823,"name":"Among Ripples","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/499/499dd2e56eec5aa0f7ecc09df7087d29.jpg","description":"In Among Ripples you are presented to a soothing and meditative experience where you can experiment at your leisure. As the caretaker of a small pond you decide which creatures should be introduced into the ecosystem, and what species will thrive. Study the creatures you introduce and learn more about them in order to shape a pond that you find sustainable. This game is a short but sweet experience where you get the opportunity to relax and think about the balance in nature.\nFeatures:\n* Sandbox style gameplay where you are free to choose your own goals\n* Intuitive communication of the game system\n* Organic art style drawing inspiration from shadow puppet animations and watercolor paintings\n* Serene soundtrack with ambience changing with the seasons\n* Relaxed experience where you can take your time and see how things progress at your own pace\nAmong Ripples is a free product with no strings attached. It's a little experimental title we want to share freely with you all.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Eat Create Sleep","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":20426,"name":"Spy Chameleon - RGB Agent","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/056/0564efb8d9e0cd2dde765ac61d97c3e1.jpg","description":"NEW STEAM FEATURES:\n- trading cards\n- leaderboards\n- steam achievements\n- cloud saving\nDon't let the cartoon visuals fool you. Being a RGB Agent requires some good skills.\nSpy Chameleon RGB Agent is a challenging arcade-puzzle game where the player needs to avoid being spotted thanks to the color-changing mechanisms of the main character.\nAcross 5 crazy missions and 75 levels the player will discover different enemies and mechanics in order to complete super secret missions only achievable by a RGB Agent: taking pics of a celebrity and her lover at her bedroom or getting the secret formula of a famous drink company are only some examples.\nObserve the moves of your enemies, choose the right path and start running to the next safe spot. The length of the levels make this game perfect to spend a few minutes completing some levels or hours finishing missions and getting all the challenges, speed-running through the game or getting all the achievements.\nGame features:\n- change color to blend with the environment\n- 75 challenging levels. The difficulty increases as you learn the mechanics\n- 3 challenges in each level: pick collectibles and beat time\n- 5 different enemies, each one with different mechanics\n- a mix of good reflexes, timing and strategy\n- levels designed and timed to be enjoyable by speed-runners","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"EnjoyUp Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19769,"name":"The Next Door","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38f/38f2bc9bbf0ef5b46491b9cf894e88d9.jpg","description":"who looks out dreams, who looks inside awakens\nThe Next Door não é somente um jogo.\né algo a ser experimentado.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Labory","platforms":[{"id":0,"name":"PC"}]},{"id":14011,"name":"Omerta - City of Gangsters","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/972/9727f016cb8d39a733288538141251c5.jpg","description":"Omerta - City of Gangsters is a simulation game with tactical turn-based combat. Taking the role of a fresh-from-the-boat immigrant, with dreams of the big life, the player will work his way up the criminal hierarchy of 1920’s Atlantic City. Starting with small jobs, his character recruits a gang and expands his empire by taking territory from other gangsters. Eventually he establishes his own crime syndicate and becomes the de facto ruler of Atlantic City.Key FeaturesHistorically accurate representation of Atlantic City and its landmarks\nStrategic gameplay allows city overview, planning, expansion and gathering of intel\nTurn-based tactical combat with a cover system and stealth action\n15 unique player controlled characters each with unique personalities and backgrounds\nA RPG system for development of player characters and managing their equipment\nCompetitive and cooperative multiplayer mode with persistent gangs\n15+ hours of gameplay in a single play-through\n20 unique maps visualizing the various districts of Atlantic City","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Haemimont Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":10435,"name":"Infinity Wars: Animated Trading Card Game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/255/2550ed68848ebbec3491b283797c7441.jpg","description":"Welcome to a unique trading card game that blends rich lore and artwork with innovative gameplay mechanics that are both simple to learn, and hard to master. Play with fully animated cards in 3D battlefields, and assemble decks from over 800 cards and 8 stylized factions. Choose any factions you like, in combinations or in full purity, and customize your strategy to your play style. Explore the strategic depth of simultaneous-turn gameplay in a number of PvP game modes and an expansive PvE campaign system. With unlimited card trading and rich reward systems, Infinity Wars Reborn is a genuinely free-to-play trading card game.Features Unrivaled Strategic Depth - Outmaneuver your opponents with defensive and offensive posturing. With the simultaneous-turn mechanic, foresight and cunning will prove the difference between victory and defeat.\nFully Animated Artwork - Breath life into your trading card experience with 3D battlefields and over 800 beautifully animated cards.\nGenuine Free-To-Play - Acquire all cards in the Infinity Wars Universe without ever needing to put money down. Earn cards simply by logging-in!\nRich PvP Game Modes - Craft your deck and take to the battlefield in ranked and casual play; draft decks and join Rift Runs to score epics rewards; battle opponents with curated decks to explore new cards and ensure a level playing field for newer PvP players.\nRobust PvE Campaign - Delve into the Infinity Wars lore with a 21-mission campaign spanning multiple factions and worlds.\nUnlimited Card Trading - Build your decks with precision and engage the community with an unlimited card trading system.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lightmare Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":791,"name":"I, Zombie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/635/635511272d695eae4abc3911949c2e4a.jpg","description":"!NOW WITH IN-GAME LEVEL EDITOR!\nQuite a different zombie game - this time YOU are the zombie! Command your infested comrades, fight your way to freedom and let the zombie kind dominate the world!\nIn I, Zombie you play as the leader of a zombie horde and your goal is to infect all humans on the map. Whenever you infect a human you turn him into a one of your kind and you can use him against armed soldiers. You're also able to command your horde to either attack the enemies, follow you or wait for orders. Each scenario requires tactical approach and careful planning to achieve success.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Awesome Games Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":14435,"name":"Slash It","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87a/87a3cebea2a08fbcfdca21d238188538.jpg","description":"Slash It is a 2D colorful arcade game. The goal is to match shapes, press letters and numbers in the right time and direction.\n6 Game modes, Hiscores & Steam Leaderboards\n300+ Easy Achievements\nTrading Cards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":475071,"name":"Banners of Ruin","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a0f7b914b8e9e05abd6bbd480ed2b9d.jpg","description":"Assemble your party. Answer the call. Win the war. Build a deck and fight a series of turn-based combats with up to 6 party characters through the city of Dawn's Point. Each character can unlock a set of unique cards and abilities that can augment your deck in powerful, exciting ways.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"MonteBearo","platforms":[{"id":0,"name":"PC"}]},{"id":11387,"name":"Port Royale 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/458/4589f56845f867775404f7493810f078.jpg","description":"The Caribbean, in the turbulent 17th Century. The mighty kingdoms of Spain, England, France and the Netherlands fight over the colonies. And there you are, a young sea captain whose only goal is to become the most powerful man in the New World. To achieve that goal, you may choose one of the two available campaigns: will you become an Adventurer or a Trader?\r\nIf you chose the way of the Adventurer, lead an unforgiving campaign for the conquest of the seas: invasion, piracy, bounty hunting, raiding; do whatever it takes to build your own empire in the Caribbean. And of course, trade will have a less important role to play in your rise.\r\nThe way of the Trader is, on the opposite, mostly about developing your riches and your economic power. To be the most powerful Trader of the New World, you have to create trade routes, build industries and develop the economy of the colonies.\r\nOf course, in Free Play mode, you can mix both of those in any way you want, letting you create your own unique and exciting story.\r\nFor the first time in the acclaimed Port Royale series, you are not alone in the beautiful and seemingly so peaceful seas of the Caribbean. The Multiplayer mode allows up to 4 players to play through LAN or over the Internet. Develop a successful trading company, lead your ships in beautiful 3D naval battles and force your opponents to their knees!Key Features:Two different single player campaigns: Adventurer and Trader\r\nNaval battles, raids, plundering and invasions await the Adventurer, while the Trader will develop trade routes and the economy to earn glory, fortune and power\r\n16 different ship types, such as powerful Galleons or versatile Frigates\r\nOrganize trade with 60 different cities such as Port-au-Prince or Tortuga\r\nA competitive Multiplayer mode for up to 4 players\r\nA comprehensive trade system, with supply and demand dynamically setting the price of goods and wares, like in the real world","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":840,"name":"DRAGON QUEST BUILDERS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/782/782e85426ac03b6f9c2d38f37b31b060.jpg","description":"Generations ago, the realm of Alefgard was plunged into darkness by the terrible and treacherous Dragonlord, ruler of all monsters. Mankind was robbed of the power to build and forced to wander the ruins of their former home, scrounging and scavenging in the dust to survive.\nNow it’s up to you, a Legendary Builder chosen by the Goddess herself, to return the power of creation to the people and rebuild Alefgard. Only when the wonder of imagination has been returned will mankind be able to overthrow the evil Dragonlord once and for all!\nBUILD FOR FUN. Gather materials, craft items, and build everything imaginable!\nBUILD FOR ADVENTURE. Play through a tale of epic proportions in a sandbox world packed with memorable characters and dangerous monsters.\nBUILD TO SAVE THE WORLD! Use the power of creation in battle against the reigning Dragonlord and restore peace to the shattered realm.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 ARMOR PROJECT/BIRD STUDIO/SQUARE ENIX All Rights Reserved. © SUGIYAMA KOBO\nDRAGON QUEST, DRAGON QUEST BUILDERS, SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":311644,"name":"Heave Ho","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e4a/e4a8cd08b6b73800a2d823ceb69f2a98.jpg","description":"“Heave Ho” is a physics-based local multiplayer adventure across an impossibly wide ravine, tasks up to four players with a simple goal – don’t fall to your death!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Le Cartel Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":22651,"name":"Runaway 3: A Twist of Fate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27f/27f02c047024e4d46f7316ccacdeff0c.jpg","description":"Runaway: A Twist of Fate is the adventure game of the year! Featuring a production worthy of a big 2D animated movie, Runaway follows a story full of twists and turns, and packed with comical highlights. All in all, you will be confronted with more than 200 mysteries and puzzles to keep your brain running through a big adventure that you will never forget!\nSome say that Brian saw aliens and that he killed someone. Others say that he wanders in the streets of New York, or that he parties in Hawaii. Some even believe that he is dead… But his girlfriend Gina will do everything possible to find him and prove to anyone that they are wrong. Help Brian and Gina solve the mysteries of their greatest adventure packed with humor, suspense, twists, golden chickens, lies and a happy ending… even two happy endings!\nKey Features:\n\nA rich scenario, hilarious humor, and stellar realization make Runaway: A Twist of Fate a great adventure game.\nVisit nearly one hundred exceptional visual sets with unequalled detail.\nDozens of charismatic 3D characters perfectly integrated in the 2D sets.\nAn improved engine for better sound and visual quality.\nDifferent levels of difficulty and a new, fully interactive help system to adapt itself to all players, both novice and experienced.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Pendulo Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16116,"name":"Sun Blast: Star Fighter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9dd/9dd2c755e6ea4bd2e0f48e912f6cd85f.jpg","description":"Sun Blast is the best 3d space shooter on Steam.  Earn upgrades as you fight your way through a massive seleciton of levels.\nIn a period of 48 hours, an alien race utterly annihilated Earth's military forces.  Only one colonial ship remains, and it's humanity's last chance.\nChoose your starfighter and join the desperate counter-assault on the alien forces.  You're massively overpowered and ridiculously outgunned, but with cunning and a lot of luck, you can prevail.\nAs you prove your worth in combat, you'll rise in rank and gain the ability to upgrade your ships weapons and defenses.   This is the 3d space shooter you've been waiting for!\nFeatures:\nFull gamepad support\nThree ship designs to choose from, each with unique look and behavior\nFight against stealthy fighters and gigantic starships\nHuge level selection, from planet orbits to underground tunnels to infested military bases\nReplay levels to earn medals\nSteam achievements and leaderboards","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"OBLONE Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13792,"name":"Zanzarah: The Hidden Portal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fcd/fcd0ec5846c340e37a0088474b661ca7.jpg","description":"Step into a mystical world of fairies, elves, goblins, pixies, dwarves, druids, and wizards. Zanzarah: The Hidden Portal tells a fantastic story of Amy, a young woman on a mission to reunite three worlds--the human world, the fairy world, and Zanzarah. As Amy, you must collect magical fairies, battle dark forces, and find portal stones that can free more fairies. While you explore lush worlds, you can interact with bizarre creatures and practice a variety of spells.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Funatics Software","platforms":[{"id":0,"name":"PC"}]},{"id":22475,"name":"Heli Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a66/a664e03dd10f5792905c9e30cb8e9c60.jpg","description":"HELI HEROES updates the old-school \"shoot'em up\" arcade machine games to new dimensions on today's PCs. You command an AH-64 Apache Longbow or a Russian Hokum helicopter. The goal is to fly through various levels and carry out the mission objectives. During the missions you will find different types of weapons and additional offensive and defensive systems. The game's look and feel is made up of a 3D landscape that you fly your helicopter over, through and into. The mix of reality and Sci-Fi missions vary from destroying Iraqi oilfields up to fighting against the \"Big Boss\" enemies in Alaska.STORYIt all started, not with a bang, but with a whimper…\nRevolution Now, the most formidable terrorist group in existence, is on the brink of creating a new world order. Your challenge, if you are crazy enough to accept, is to defeat them at all costs.\nCommanding an AH-64 Apache Longbow or a Russian Hokum helicopter - your goal is to fly through various levels and carry out the mission objectives. During your adventures in HELI HEROES you will find different types of weapons, bonus objects and additional offensive and defensive systems. The very survival of the world depends on you: it is time to take the challenge, and put an end to global terrorism - an end to Revolution Now.FEATURES:Fast and fun to play - packed with intense action and breathtaking explosions and particle effects\n30 day and night missions with varying weather conditions\nEasy to understand missions with clear-cut goals\nUnits and weapons from the real world with a wide variety of ammunition types\nDefense systems: decoys, additional armor and stealth\nFuel and ammunitions limits to test flying strategies\nIntuitive control: No need to learn complex menus, keys or unit lists\nSupport for nearly all pads and joysticks\nSingle Player and Companion Mode for 2-player simultaneous games\nResolutions from 640x480 up to 2048x1800 in 32 bit color depth\nInternet competition and campaign mode\nEyeSave Mode™ Technolgy\nMusical Score and Sound FX in Dolby Digital 5.1","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Reality Pump","platforms":[{"id":0,"name":"PC"}]},{"id":2796,"name":"Mitsurugi Kamui Hikae","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ee/3eeebe23796269690ca77f46f5ac7862.jpg","description":"The smash hit action game from Comic Market 84 is finally available on Steam!\nMisa is a Blade Templar, a secret defender of humanity, who happens to be a high school student. When her classmate, Suzuka, succumbs to the dark seduction of the Demon Blade, Misa releases she must protect the world at all costs. Already the evil sword is draining Suzuka's life force and, if Misa cannot destroy the Blade alone, she very well may need to strike down her friend.\nMitsurugi Kamui Hikae focuses on high-speed arena-based action. Use lightning fast sword slashes, hand-to-hand attacks and mysterious ancient techniques to defeat wave after wave of demonic foes. Be prepared: the enemies are relentless and will attack from all sides. If you aren't prepared to strike and roll, you'll be overwhelmed in no time flat.\nWeaken your enemies with vicious wounds, employ hand-to-hand techniques to build your katana gauge, then cut deep with your divine blade. A spectacular flurry of blades will take down even the largest crowd of NPCS! After beating them bloody, sheathe your sword to finish them off with style. Be warned: if the enemy isn't \"bleeding,\" then they'll take the opportunity to strike you mid-pose!\nUse skill points to learn new skills, upgrade your abilities, and take on brutal bosses. Every playthrough of Mitsurugi will grow you as a player until your success if guaranteed! And if the game suddenly becomes too easy, there are three difficulty levels to test your mettle. Good luck!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ACTIVE GAMING MEDIA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":343595,"name":"Sonic Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/566/566b771293b3e8aee0c071a02e81d925.jpg","description":"Join Sonic and friends as they embark on their first truly epic quest to stop Dr, Eggman’s most villainous scheme in the hit Dreamcast title Sonic Adventure™ now available on Xbox®LIVE Arcade.  An ancient evil lurking within the Master Emerald has been unleashed from its slumber by the devious Dr. Eggman and is on the verge of becoming the ultimate monster using the 7 Chaos Emeralds. Only Sonic and his friends are heroic enough to put a stop to Dr. Eggman and his evil minions. Hit the ground running in this classic epic adventure in a race against time to save the world!  There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Dreamcast"}]}]