[{"id":10436,"name":"Golf With Your Friends","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5a/f5abab52c4d606551cd5ec3ab709e501.jpg","description":"Golf With Your Friends is an entertaining, challenging, multiplayer mini golf game for up to 12 players.\nThe game currently has 6 levels containing 18 holes each.\nThe controls are simple and the game is designed for the user to be able to host or join a game within a few seconds.\nThe game will be hosted on our servers where the user has the ability to add a password if so required or leave it open to the public.Key Features 6 Vibrant challenging levels containing 18 holes each, 108 holes in total.\n12 Player multiplayer\nBall customization\nPlayer created servers\nSteam invite","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blacklight Interactive®","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11425,"name":"SPORE","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cae/caeb9d0cb154124b132d51861735431e.jpg","description":"Spore is a god simulator developed by Maxis. The game features several genres such as RPG and RTS.\r\n\r\nThe players create a new species. It is possible to create a completely new species using an in-game editor. It is up to the player to control the evolution process. \r\n\r\nThe game is divided into several stages. After each stage, the player's gameplay is evaluated and a special bonus that is going to evolve the next stages is given based on their actions. The creature you made is evolving through every stage and changes its' physique.\r\n\r\nAt the beginning of the game, you choose one of six planets to settle your creatures on. The first stage of the game is called Cell. The player controls a microorganism that lives in the water. In order to survive, the microorganism has to consume pieces of meat or seaweed and avoid being eaten by other water inhabitants. \r\n\r\nDuring evolution, your cell develops a brain and migrates to the shore. The in-game editor opens where you can add legs for your creature. The players meet other species that can be cooperated with or eaten.\r\n\r\nAfter that, three stages are available for the player: tribe, civilization, and space. The latter is endless.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Maxis","platforms":[{"id":0,"name":"PC"}]},{"id":19560,"name":"Far Cry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ee/2eef5ed5e82c28d1299ecc2a0e60f2cb.jpg","description":"The game that started the popular Far Cry series. The player assumes the role of Jack Carver, a former special forces operative who became a ferryman. The protagonist was hired by a journalist Valerie Constantine to escort her to a remote Pacific island. Soon after they arrived, the boat was attacked, and Valerie went missing. Now Carver is stranded on an archipelago covered by tropical rainforests, which are hiding an abandoned Japanese warship, a secret lab, and an active volcano. On a search for Valerie, he will fight a gang of mercenaries and discover the monstrous experiments that are carried out on this islands. \r\nCarver eventually gains access to a variety of firearms. He’s also equipped with binoculars that allow him to see and even hear the enemies from far away. Stealth and detection are the central aspects of the Far Cry gameplay. The lush vegetation in the jungle offers perfect cover, so both Carver and his opponents can hide and sneak behind each other’s backs. The design and huge size of levels allow for a variety of routes and approaches to complete each mission, with use of stealth, surprise attacks, sniping, or another tactic of your choice.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"}]},{"id":15860,"name":"STAR WARS: The Force Unleashed II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/693/693952316d4b90984a92e7ab0f5c9b81.jpg","description":"STAR WARS: The Force Unleashed II is a third person action/adventure video game with elements of platforming. It is a sequel to STAR WARS: The Force Unleashed released in 2008. The game was created during nine months development cycle and despite some similarities to the first one, TFUII offered elements such as modified sound effects and gameplay. The main protagonist of TFUII is a clone of Starkiller, who has a secret history with Dart Vader. The main goal of a game is to find your true identity and find protagonist's love – Juno Eclipse. The game takes place about six months after the events of the first entry in the series and one year before the first Star Wars film. TFUII is known for its dark and much more personal story compared to the first game. There are two main weapons in the game – The Force itself and a famous lightsaber with which you can do various different combos. TFUII also adds another new element – puzzles, the ability to wield two lightsabers at a time and more Force powers then the original.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":10926,"name":"Factorio","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e4/7e4e22b76da131e9690d5757555093c2.jpg","description":"Factorio is an isometric space real-time strategy developed by Wube Software. \n\n###Story\nAn astronaut is stranded on the surface of a distant unknown planet, that is full with low life forms and fossil fuels. His main objective now is to survive and build a rocket to leave the planet. Luckily, the main character has a scientific background, hence why he can build any machinery from steam engines to exoskeletons, power grids, and oil plants. The planet's inhabitants start to think that they got infected by the astronaut and try to eliminate the threat as soon as possible.\n\n###Gameplay\nThe player controls only one character that can move around the map freely by walking at first and using vehicles later into the game. The unknown planet that the players explore is rich with oil, minerals, water, and other fauna.\n\nThe player controlled character can mine the resources by himself and the tools that can be crafted or by building specific mining equipment. The latter will be much more effective. The same thing goes for resource processing and other stages of item development as from the game's beginning, the players can't keep up with all the things they have to do simultaneously.\n\nThe game features a Tower Defence aspect, as the planet's inhabitants set out to kill the player and eliminate the cause of damage to their planet. The players have to build a sophisticated defense network of turrets and mines to protect themselves.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Wube Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":10393,"name":"Gothic 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a3/8a3e91293e38dcc1126ae83d31bfd6e4.jpg","description":"The third part of Gothic series picks up the plot of Gothic II: Night of the Raven immediately after its ending. The protagonist arrives at the kingdom of Mrytana that was recently conquered by a horde of orcs with the help of a rogue wizard. Only a handful of humans, led by their king, still maintain their resistance in the capital that is protected by a magic shield. The rest of the human population is enslaved by orcs. The Nameless Hero is expected to save the kingdom; however, the player is free to choose to help orcs instead or even side with some other faction, like Nomads. There are six factions in the game, of which three will allow the protagonist to join after he reaches a certain level of reputation with them. \nLike previous parts of its series, Gothic 3 is set in an open-world high fantasy setting, and its gameplay reminds that of The Elder Scrolls series. You can explore cities, forests and deep underground caves, accept quests from NPCs, and fight a variety of monsters and wild animals to level up and learn additional skills for battle, magic or crafting. The world of Gothic 3 is vast, though somewhat empty and nearly devoid of female characters.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Piranha Bytes","platforms":[{"id":0,"name":"PC"}]},{"id":2131,"name":"Race The Sun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a01/a01b34c722ceec784817381eb1824fa5.jpg","description":"In Race the Sun you control a spaceship powered by solar energy. You have to dodge objects on your way, for example, from laser beams, other ships and various obstacles, while collecting blue pyramids that will boost the player. The game will end only when you either crash into something, die, or when the sun goes down. The ship's speed remains constant until the ship remains under direct sunlight, but if the ship falls into shadow or collides with an object, the ship's speed will drop.\n\nYou have to fly through the landscape with abstract shapes and obstacles of varying complexity. Levels are procedurally generated and divided into separate regions, and each contains its own set of tests.\n\nThe game presents three primary levels: the standard level, the level of \"Apocalypse\", in which the player moves faster through more difficult tests, and an obstacle course in the form of a maze. These regions and levels change daily for all players, and the online scoreboard allows users to compare their results with others.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"FlippFly","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Web"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":19369,"name":"Call of Duty","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c5/9c5bc0b6e67102bc96dcf1ba41509e42.jpg","description":"Call of Duty is a World War II first-person shooter developed by Infinity Ward. It is the first game in the series by the same name. \n\n###Plot\nDuring the game's singleplayer campaign, the players take control of three soldiers from different armies: Joey Martin from the U.S. military, sergeant Evans from the British SAS, and Alexei Ivanovich Voronin from the Red Army. The game's plot follows their path from boot camp to the Battle of Berlin. There are 26 missions present in the game.\n\n###Gameplay\nCall of Duty features both singleplayer and multiplayer modes. During the singleplayer campaign, a briefing is held or a slide-show with commentary before every mission. In order to complete a level, the player has to complete several objectives in a chronological order. There are four difficulty levels in Call of Duty, they differ in the amount of damage the player can sustain. There is no health regeneration system present in the game. A health pack system is used instead.\n\nThe players can carry two main weapons, one pistol, and 10 grenades. The players can melee any enemy they encounter in the game.\n\n###Multiplayer\nAt the beginning of the match, the players choose one of four sides: the U.S. Army, the British forces, the Vermacht, and the Red Army. \n\nThere are 4 game modes present in Call of Duty: Deathmatch, Team Deathmatch, Domination and Search and Destroy.\n\nThe game's maps are renditions of the real battlefields, such as Sainte-Mere-Eglise, the shores of Normandy, Berlin, and Stalingrad.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Infinity Ward","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4602,"name":"Bulletstorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b42/b42b05096de6668833bbab38f6099c6a.jpg","description":"Bulletstorm is an FPS developed by People Can Fly and Epic Games.\n\nThe game is set in the 26th century, where the universe is run by the Confederation. The player controls the commander of a black ops unit Grayson Hunt who went rogue after realizing that the unit was tricked into killing civilians by its' superior, General Sarrano. 10 years pass when Grayson and his team come across Sarrano's cruiser, attempt to destroy it and crash land on a surface of a planet called Stygia which used to be a tropical-like resort. \n\nThe game focuses heavily on combat and features a scoring system named Skillshot. Players gain points for every kill, the more creative the murder is - the more points one gets. Environmental kills are valued the most. Points are used as currency that can be used to upgrade your weapons, buy new ones or get ammunition.\n\nPlayers can carry three weapons with the assault rifle being the default one and can always be found in one's inventory.\n\nThere is no competitive multiplayer in Bulletstorm, but co-op and score attack modes are available.\n\nOn release, the developers made fun of other games in the marketing campaign. The dark humor was one of the defining aspects of Bulletstorm.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Epic Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":244716,"name":"DiRT Rally 2.0","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f3/8f306808c45a4dbe0cd698e0b142af08.jpg","description":"DiRT Rally 2.0 dares you to carve your way through a selection of iconic rally locations from across the globe, in the most powerful off-road vehicles ever made, knowing that the smallest mistake could end your stage.\r\n\r\nYou will need to rely on your instincts with the most immersive and truly focused off-road experience yet, including a new authentic handling model, tyre choice and surface deformation.\r\n\r\nPower your rally car through real-life off-road environments in New Zealand, Argentina, Spain, Poland, Australia and the USA, with only your co-driver and instincts to guide you. Race on eight official circuits from the FIA World Rallycross championship, complete with licensed Supercars and support series.\r\n\r\nDevelop your team and cars around race strategies, and progress through a varied selection of Events and Championships in both a single player Career Campaign and a competitive online environment.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":4361,"name":"Rayman Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/375/375f84d018242d7519a230f623981217.jpg","description":"Rayman Origins is a 2D platformer, the fourth main installment in the Rayman series. Set 400 years before the events of Rayman: Hoodlums' Revenge, the game follows Rayman and his friends as they disturbed an old woman from the Land of the Livid Dead and were attacked by an army of monsters. To return the balance to the world, Rayman needs to start his incredible adventure.\nRayman Origins has a completely two-dimensional graphics and looks like an old-school platformer. The gameplay follows classical mechanics too, including the side-scrolling perspective and progressive combat system, that starts with simple punches and evolves to diving and self-resizing. Rayman uses different abilities to kill enemies and overcome various obstacles. To progress through the story, you need to defeat special enemies and reach the end of every level. There are also a lot of collectibles that in fact complicate the game if you want to pick them all.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ubisoft","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"}]},{"id":4477,"name":"Kane & Lynch 2: Dog Days","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b50/b501727147644474562935f19a60134e.jpg","description":"One could call Kane & Lynch 2: Dog Days a modern art project and be correct. Dog Days is the continuation of infamous Kane & Lynch: Dead Men. This time the player controls Lynch - a psychopath who now lives in Hong-Kong with his love Xiu. Kane, the protagonist of the first game, comes to Hong-Kong in hopes to get some money by smuggling guns to Africa together with Lynch, but at the very beginning of the game Lynch decides to do a little job with local mafia and Kane accidentally shoots a girlfriend of influential mafia person and everyone, starting with local hooligans, police and then military turns against the two. \nKane & Lynch: Dog Days differs from all the other third person shooters by its original visual style and presentation. Everything what player sees is filtered by lo-fi visual effects and so everything looks like filmed with an old and cheap digital photo camera. The screen is shaking all the time, censuring wounds of shot enemies, colors of screen drastically changes when Lynch is wounded. The rhythm of the game is insanely quick to the point where it gets surreal.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":9515,"name":"We Were Here","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77b/77bd0acea49153dc6c5a89d91eb568bc.jpg","description":"Lost and separated in an abandoned castle set in a frozen wasteland. Your only possession left is a walkie-talkie, with a familiar voice on the other end. Can the both of you find your way out in time?\nIn We Were Here two players are trapped inside an abandoned castle. Player One is confined to a small secluded part of the castle. Player Two roams the castle trying to find Player One. Every room challenges your wits and ability to communicate clearly, using only your voice. There is no other way to communicate with each other, so make sure you have a microphone ready!\nAre you ready to find out how well you and your friends work together? If you like living on the edge, try playing it with a complete stranger!\nInspired by games such as: Myst, Amnesia: The Dark Descent and real-life escape rooms.\nBoth players have a completely different game experience.\nExplore beautifully crafted environments in a fictional castle inspired by Castle Rock, Antarctica.\nOvercome challenging puzzles by working together.\nAtmospheric thriller setting that will keep you on the edge of your seat.\nOptional Virtual Reality support. Enjoy the game with- or without VR!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Total Mayhem Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":13570,"name":"Game Dev Tycoon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e70/e7009d889b38df2a16f78859a7343308.jpg","description":"Steam Greenlight\nAbout the GameIn Game Dev Tycoon you replay the history of the gaming industry by starting your own video game development company in the 80s. Create best selling games. Research new technologies and invent new game types. Become the leader of the market and gain worldwide fans.A journey through gaming history\nStart in the 80s\nStart your adventure in a small garage office in the 80s. Enjoy the hand-crafted level design while you develop your first simple games. Gain experience, unlock new options and create your first game engine.\nCreate games your way\nIn Game Dev Tycoon the decisions you make during development really matter. Decide which areas you want to focus on. Does your game need more gameplay or should you focus more on quests? These decisions will have a major impact on the success of your game.\nGrow your company\nOnce you have successfully released a few games you can move into your own office and forge a world-class development team. Hire staff, train them and unlock new options.\nMake larger more complex games\nWith experience and a good team, you can release larger, more complex games. Larger games bring new challenges and you will have to manage your team well to deliver hit games.Features\nStart a game development company in the 80s\nDesign and create games\nGain new insights through game reports\nResearch new technologies\nCreate custom game engines\nMove into bigger offices\nForge a world-class development team\nUnlock secret labs\nConduct industry changing products\nUnlock achievements\nModding support\nWorkshop support\nCommunity translations for German, Spanish, French, Portoguese (Brazil), Russian, Czech, Swedish, Dutch and Italian are available through the in-game menu.\nThe full game has many more features which are not listed here to prevent spoilers.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Greenheart Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":372576,"name":"Lost Ark","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d9e/d9e868382c48ec98c9b23b8fbe6a2045.jpg","description":"Explore seven vast, varied continents and the seas between them to find vibrant cultures, strange and fantastical beasts, and all the unexpected marvels waiting to be discovered. Delve into the secrets of Arkesia, prove your might in battles and raids, compete against other players in PvP, travel to distant islands in search of hidden riches, face packs of enemies and colossal bosses in the open world, and more.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Smilegate Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19397,"name":"Vampire: The Masquerade - Bloodlines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f0/6f0a69db053bce957d8328a7253fbb29.jpg","description":"Vampire: The Masquerade – Bloodlines is a story-driven action-RPG based on table-top role-playing game Vampire: The Masquerade, the part of the World of Darkness franchise. The game is setting a gothic urban fantasy where vampires, werewolves, and other supernatural beings live secretly by humans. The story follows the player character that gets turned into the vampire and becomes a member of Camarilla – a considerable vampire organization that tries to keep vampires’ existence in secret from ordinary people. It confronts Sabbat, an organization whose member believe that Vampires should let their inner beasts go wild no matter of people’s awareness.  \n\nThe gameplay’s primary emphasis is variety in player’s action. The same goals can be achieved in several ways. Depending on the character’s abilities and clan affiliation, it can intimidate, seduce or convince NPC’s with words, use brute force or sneak in the shadows without being noticed. There are seven unique vampire clans from which player creates his character. They have different skills, supernatural powers, appearance, characteristics. Some of them affect gameplay in its unique way, e.g., vampires from Nosferatu clan are so deformed that they cannot be seen by ordinary people, forcing the player to rely on stealth and brute force rather than communication.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Troika Games","platforms":[{"id":0,"name":"PC"}]},{"id":17357,"name":"Orcs Must Die!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/417/4176298c1b22ccd338ce3dfc34eb7e28.jpg","description":"Orcs Must Die! is a tower-defense game where you, as the War Mage, need to protect the world from the hordes of evil creatures such as Orcs and Ogres. To complete your mission, you need to keep enemies out from magical Rifts that must not be destroyed. Every level features from four to twelve waves; each Orc that reaches your Rift damages it a little. Once the Rift Score is 0, you need to start the level over.  \nThe title uses a third-person perspective that makes it look like a classic action game. To protect the Rift, you can not only use different traps and spells but also fight Orcs yourself. If you're killed, you'll respawn near your Rift for a certain score. \nEach trap or spell costs the in-game currency you earn by defeating enemies. At the beginning of the level, you choose up to ten items for the battle. As a rule, all traps only work once and then need some time to recharge. Every item is upgradable; on higher levels, you can also get some boosts that will affect that level only.\nThe game is followed by Orcs Must Die! 2 that features a co-op mode, and Orcs Must Die! Unchained, a free-to-play follow-up.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Robot Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":13387,"name":"Serious Sam HD: The Second Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/46a/46ac84997152eaf4f760257a60099231.jpg","description":"Serious Sam HD: The Second Encounter is an HD remaster of Serious Sam HD: The Second Encounter. The game is the second episode of Serious Sam, released as a standalone title. It’s a first-person shooter split into three parts, each of them is set in different countries and eras. The HD edition adds to the game better graphics and new animations, weapons and secrets.\nSet in the world of aliens and time travel, the story directly continues the plot of The First Encounter: Sam flies to Sirius, but his starship crashes and lands into Central America in the Mayan age. Here he needs to make his way back to Earth through hordes of monsters. \nYou can choose from a variety of weapons, from different guns to chainsaws and flamethrowers. As a rule, there are dozens of enemies on screen at the same time while your health and armor are non-regenerative. So, you need to think about your tactics to avoid the strongest attacks. For those who prefer silent kills from a distance, the game features a sniper rifle.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Croteam","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":2889,"name":"Oddworld: New 'n' Tasty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba0/ba006ef12175ad4773e5964c320099c4.jpg","description":"Oddworld: New 'n' Tasty is a platformer developed by Just Add Water. It is a complete remake of the first installment in the series, Oddworld: Abe's Odyssey.\n\nThe game tells a story of a prisoner of the biggest meat-processing plant on Oddworld. The Protagonist is a Mudokon named Abe who is a floor-waxer and an Employee of the Year. With the ingredients for the company's main products running out, the owner of the plant decides to launch a new treat named \"Mudokon Pops!\". Overhearing that, Abe decides to escape and free all Mudokon slaves he can find.\n\nNew 'n' Tasty is a 2.5D scrolling platformer with the main focus on puzzle solving. The player can talk and direct other Mudokons. The objective is to find and rescue 299 Mudokon slaves by getting them out of the plant through portals. Some Mudokons are hidden in secret areas.\n\nNew 'n' Tasty features good and bad endings. The outcome depends on the number of saved slaves. Saving over 150 Mudokons results in a good ending, which is considered canon.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Oddworld Inhabitants","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":19584,"name":"Risen 2: Dark Waters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/224/224bc150dfb159caf58ae504f507847e.jpg","description":"Risen 2: Dark Waters is a pirate-themed action RPG set in the world filled with numerous fantasy creatures. It’s the sequel to Risen that follows and expands its story a little. Playing as a partly customizable character you need to help Patty, a female pirate from the original game, to find her father and save the world from Titans, who intend to destroy everything.\nRisen 2 features a character development system where you can upgrade five characteristics. You can focus on either melee combat or use an amount of gunpowder weaponry. Another way is to develop your black magic skills. You can also upgrade the level of damage your attacks make and learn tricks to complete missions stealthily. A huge variety of abilities allows you to combine different skills in the way suitable for the preferred playstyle.\nTo develop your character, you need Glory that is gained from completing quests, exploration and killing enemies. Some abilities can be upgraded with special items or through training with master characters.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Deep Silver","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":22508,"name":"Overwatch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ea/4ea507ceebeabb43edbc09468f5aaac6.jpg","description":"###The Legacy\nOverwatch is a multiplayer first-person shooter from the company that gave players the saga of Azeroth, Starcraft and the Diablo universe. Despite these releases coming out years ago, they are still alive and actively updated. But the developers at Blizzard wanted something new: the company does not like to experiment with new settings, preferring to transfer existing characters to new genres, worlds, and situations. The exception, perhaps, can only be a game about the three Vikings—The Lost Vikings, but this, too, was a long time ago.\n\n###The story and setting\nAnyway, the company Blizzard has approached the development of Overwatch with team-specific meticulousness to details and desire to create an elaborative game universe. The player faces a choice between 21 characters who were part of the elite Overwatch unit. The task of Overwatch soldiers is to protect the Earth from conflicts and external threats. But something goes wrong, and the team of heroes breaks up. Despite the multiplayer bias, the game has a full story, it combines all the characters and maps on which the battle takes place. Since the launch, seven new characters have been added to the hero pool. Blizzard tells the story of the world of Overwatch through their characters: almost everyone has an animated short film, comparable in quality to a full meter from, for example, Pixar.\n\n###Continuous support\nThe game won the hearts of players around the world immediately after the launch. The figures confirm this fact: more than half a million dollars from sales and more than 40 million players. Overwatch has become an anchor project for Activision Blizzard, and the company continues to develop the project two years later, constantly offering players new maps, new characters, new themed events, and new cosmetic skins.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":59023,"name":"Red Faction Guerrilla Re-Mars-tered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b38/b3825d2c32be1c43d667cc20113230cf.jpg","description":"Red Faction: Guerrilla Re-Mars-tered is a third-person action game remake developed by Volition, Inc. \r\n\r\n###Plot\r\nAfter the EDF took down the Ultron Corporation, a new tyrannical regime was established soon after.  Alec Mason comes to the red planet in search for work and to see his brother. Not long after their meeting, Mason's brother is murdered by the Earth Defence Force. Alec learns about an underground resistance group called Red Faction and joins them to seek revenge for his brother.\r\n\r\n###Gameplay\r\nThe players have to complete a wide range of missions in the game's singleplayer mode. These missions can be taken in whichever order the players see fit. There are six districts present on the planet. Mason has to gain the trust and respect of the residents from the whole districts to make them join his side, lower the enemy presence, and in the end, put the regime to end.\r\n\r\nThe game's world is highly interactive with the players being able to bring every building they want down thanks to an advanced physics model. This feature is used a lot in the game, as many quests will have Mason demolishing administration buildings, infrastructure and so on. The in-game currency is given out to the players for the destruction of the environment and mission completion.\r\n\r\n###Re-Mars-tered Edition features\r\nNo gameplay changes were applied whatsoever. However, the game's graphics engine was heavily reworked and modified which allowed for native 4K and HDR support.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":18287,"name":"Anomaly: Warzone Earth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d28/d28e64fd1af23d1846d20b47dfa933f8.jpeg","description":"Anomaly: Warzone Earth is a real-time strategy based on tower defense genre principles. However, instead of protecting your base from waves of enemies, in this game, you try to break into aliens' facilities. \nThe story is set in the near future when an alien spacecraft falls on Earth. As the head of an investigation team, you need to explore the anomalies happening around the parts of the ship and find out the information about the catastrophe. As the section of the spacecraft landed in several cities, game events take place around the world.  \nThe core gameplay is reversed tower defense mechanics. You have several armor units in the convoy; however, you can't manage them directly. Instead, you need to set paths for them through the city streets and use different boosts to make your attack more effective and help the convoy survive. \nAnomaly: Warzone Earth is followed by Anomaly 2 that presents several new maps and mechanics including tower defense vs. tower offense multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":4206,"name":"Vanquish","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/88a/88af17cc08783ccdd1608ae63c47eeac.jpg","description":"Take the fight to evil Russian robots using a rocket-powered self-adapting battlesuit in this innovative third-person shooter from Resident Evil creator Shinji Mikami.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Platinum Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":791638,"name":"MultiVersus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2e/d2ee15fda80056efef174da4ca5ae54f.jpg","description":"MultiVersus is a platform fighter that lets you team up with or against your friends using some of the world’s most iconic characters including Batman, Shaggy, Superman, Bugs Bunny & more. Use unique co-op abilities, find your favorite fighter combos and save the Multiverse!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Player First Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":842,"name":"Call of Duty: Advanced Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e05/e053aae547e0978ad90280a1a3d8f177.jpg","description":"Call of Duty: Advanced Warfare is an FPS developed by Sledgehammer Games. It is the eleventh major installment in the series.\n\nIn the year 2054, the private military companies become the world's leading military power. Countries replace their own armies by hiring PMCs. You play as Jack Mitchell, the soldier of the biggest PMC named Atlas. You are a loyal combatant, yet a major conspiracy is unraveled in Atlas. \n\nThe game's core mechanics revolve around an exoskeleton that is worn by the Protagonist. Exoskeletons offer their users enhanced mobility, strength and unique abilities such as dash, ballistic shield or a short-timed boost. Advanced Warfare does not feature a tradition heads-up display, using holographic projection on the weapons as its interface. \n\nDuring singleplayer, the players are able to upgrade their exoskeleton using upgrade points that are gained after every mission. 22 points are required in order to purchase every exo upgrade. \n\nAs for the multiplayer, the game does not feature many changes apart from the enhanced mobility and the Pick 13 system that allows players to choose any equipment available as long as it does not exceed 13 allocated slots.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Raven Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":12884,"name":"HELLDIVERS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae3/ae357d6e6f9e89597e8293469ddabba9.jpg","description":"HELLDIVERS is a top-down shooter where you need to complete procedurally generated missions among the endless amount of enemies. While the game has a single-player mode, the gameplay is more suitable for a co-op playthrough. Unlike in many shooters, in HELLDIVERS you must avoid friendly fire as you can hurt your teammates. Another feature is that you can decide for yourself where to drop, which vehicles to use and choose the order of the objectives to complete.\nThe story is set on Super Earth where the government brainwashes people to make them more loyal. While the planet is surrounded by enemy creatures that intend to destroy it, you play as a soldier of a HELLDIVERS unite who needs to protect Super Earth. As a rule, the missions include forcing through an enemy base, capturing required objectives and escape. There's no need to kill all the enemies as they are endless; instead, you can try to complete the mission stealthier. Before the mission, you can choose weapons from a variety of equipment and also get support firepower during the battle.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Arrowhead Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":339961,"name":"The Dark Pictures Anthology: Man of Medan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/206/2060eda39e4646bbe90b55ab7495c173.jpg","description":"The Dark Pictures Anthology is a series of stand-alone, branching cinematic horror games featuring a multiplayer mode.\n\nIn Man of Medan, five friends set sail on a holiday diving trip that soon changes into something much more sinister...\n\nEmbark on a horrific journey aboard a ghost ship.\n\nExperience your terrifying story with a friend online or go for safety in numbers with up to five players offline\n\nAll playable characters can live or die. The choices you make will decide their fate.\n\nWho will you save?\n\nDon't. Play. Alone.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":35561,"name":"Star Wars: Republic Commando","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b1d/b1de33eca64ad293702d9554f5ac5cd5.jpg","description":"The game is set in the Star Wars universe during the Old Republic era. The player assumes the role of a Republic commando who leads his group of four Clone troopers, the Delta Squad, through various military missions. You only directly control the commander of the squad, Delta-38 aka Boss, the other three characters are AI-controlled NPCs that you can give orders to. They are known only by their codenames and have different specializations: Sev is a sniper, Fixer is a technician, and Scorch is explosives expert. The player is not fully identified with the main character, and if Boss is shot down, the player can order his comrades to revive him or to continue on with the mission. The level is only considered failed if the whole Delta Squad is down.\nThe plot revolves around the Clone Wars that was fought between movie Episodes II and III. The Delta Squad fights against the Separatist forces on the various planets, among them Geonosis and the Wookie homeland Kashyyk. A few classic Star Wars characters make appearances, most prominently, General Grievous as a boss and Master Yoda at a mission briefing. The game’s soundtrack contains the excerpts from the Star Wars film score, some original music, and a song by Indie Rock band Ash.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":61961,"name":"Headsnatchers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/831/8317fca646c75922f2ba6f291f6aac6d.jpg","description":"Hold onto your head with Headsnatchers, a stupidly hectic up-to-4-player local and online multiplayer party-game where you snatch your friends’ heads to come out victorious. Because, let’s face it, you’ll do anything to win.LOCAL AND ONLINE MULTIPLAYER, BUT SUPER WEIRD\nChallenge your friends to insane brawls, where the goal is to pluck heads from shoulders and use them to get that much-desired victory! Headsnatchers has 25 ridiculous maps with unique, yet unlikely, weapons and features, with their own steps and rules to follow. Well, they’re more like guidelines. Nobody likes rules. Dunk your buddies’ heads through hoops like LeBron, kick your grandpa’s gobbler through a portal to hell like Doomguy™ and flush your sister’s brain-basket down the toilet like the dooky you pushed out five hours after you shoved that XL pizza down your face. You name it, Headsnatchers has got it. Probably.\n*The online mode currently has 6 playable maps, but that number will grow as Headsnatchers continues development in Early Access. Custom heads aren’t supported in the online mode at this time. Keep an eye on the Steam announcements and forum to stay up to date!\nOFF WITH THEIR (100+) HEADS\nBecause apparently kids nowadays are all about self-expression and unique identifiers, we felt we couldn’t stay behind the times. With over 100 unique heads to choose from, there’s a head for everyone. Did we mention there are pop culture references? There’s a head that resembles that one angry guy from that anime you used to love, and one from a children's show with a certain mathematically challenged Count. If you don’t like any of those, make your own heads using the Headitor! You can save up to 20 heads, so go nuts trying to recreate those school dweebs who used to pick you last for gym.\nA SINGLE-PLAYER MODE MADE JUST FOR YOU\nSometimes you just need a little me-time - we totally get it. Rip it up in the single-player Zombie Castle-mode! This single-player feature spans across three different difficulty levels. “But, my dudes, every game has multiple difficulties nowadays”, we hear you thinking. Zombie Castle is different throughout its easy, normal and hard modes. Different levels, different everything, same zombies. We’re calling it right now: you can’t beat them all. Probably.OBLIGATORY KEY FEATURE BULLET POINTS\nWe’re sorry, but we just have to go over all of the features one last time. Okay, ready?\nLocal and online* multiplayer, support up to 4 players\n4 game modes and 25 unique levels\nZombie Castle single-player mode, for when you really need some me-time\nChoose from 100 heads\nA limitless custom head creator* (yes, we’re calling it the Headitor, and there’s nothing you can do about it) that allows you to save up to 20 custom heads*\n*The online mode currently has 6 playable maps, but that number will grow as Headsnatchers continues development in Early Access. Custom heads aren’t supported in the online mode at this time. Keep an eye on the Steam announcements and forum to stay up to date!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"IguanaBee","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":4111,"name":"Lord of the Rings: War in the North","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f32/f3240d0b7a9e6523c8d708129c512ac8.jpg","description":"Lord of the Rings: War in the North is an action RPG developed by Snowblind Studios. The game is based on J.R.R. Tolkien's The Lord of the Rings series of novels.\n\nEradan, Andriel, and Farin arrive at the Prancing Pony tavern in a small town of Bree where they meet Aragorn. He tasks them with distracting the orcs at Fornost in order to save Frodo from an attack that is plotted against him. The trio sets out on a difficult quest.\n\nAt the beginning of every level, the player has to choose one of the three characters to play with. Each character has their own set of skills and equipment. \n\nAll three characters are able to use light and heavy attacks, block enemy attacks, sprint, and perform combat rolls. Critical strike system is also present. During singleplayer it is possible to command the player's comrades.\n\nOnline co-op mode is also present with up to three players. It is possible to swap items between the characters with each character being able to find their own set of secrets on the level which is not possible in singleplayer. \n\nLeveling up system is also present with players being able to level up their melee attacks, long-range attacks or their defense.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":13909,"name":"Prince of Persia: The Sands of Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/99b/99b39612e864d6ddfdb2c407fd9010a1.jpg","description":"Prince of Persia: The Sands of Time is an action game with platforming and puzzle solving elements. You take on the role of the Prince who gets two powerful artifacts: the Dagger of Time and the Sands of Time. Tricked by the Vizier, he releases the Sands that turn citizens into monsters. Now Prince needs to fix his mistake.\n\nThe key feature of the game is Prince’s ability to rewind time using the Dagger. It’s combined with platforming as you explore the city climbing walls and jumping over obstacles, and fights with enemies. If you make a mistake during these activities, you can go back to ten seconds and change your actions. The Dagger also allows to slow time and freeze enemies. You can’t customize the protagonist, however, you can upgrade his health and power at special points within levels. \nThe game consists of several levels full of multiple traps and environmental puzzles. Some levels are cooperative and you complete them together with your AI companion, Farah. While Prince uses melee combat and different tricks, she fires a bow at enemies. You need to protect Farah because the game ends if she dies..","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"}]},{"id":19568,"name":"Tom Clancy's Splinter Cell: Conviction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/366/366e521df82c81218984915203aa3644.jpg","description":"The action takes place after the events in Splinter Cell Essentials and continues the Double Agent’s storyline. Former Navy Seal officer and a friend of Sam Fisher Victor Coste is taken prisoner by an unknown group of people. The is conducting an interrogation, while he remembers the story of Sam. \n\nGameplay-wise Conviction is a bit different from other games in the series: while crawling in the darkness is still a thing, Sam spends fewer times in the shadows this time. Thanks to new Mark and Execute feature Fisher can take on multiple enemies at once finishing them in one spectacular move. \n\nSingleplayer campaign is good enough but it gets better when another player added to the mix -- the game features cooperation mode with a fully separate story, which allows going through Sam Fisher shenanigans with a friend. Players can coordinate each other's attacks, and plan the enemy encounters and compete against each other in Face-Off mode.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":18185,"name":"Company of Heroes: Tales of Valor","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/249/249cb9b8c402ed713358fcf434bcca11.jpg","description":"\"Company of Heroes: Tales of Valor\" is a strategy game, an expansion to the game \"Company of Heroes\".\n\nAdded three story campaigns: \n1. Tiger Ace - this campaign will tell about the life of Michael Wittmann's tank, his battles in 1944 at Villers-Bocage. In the story, the tank entered the city but was immobilised by British weapons. The crew was forced to escape from the pursuit.\n2. Causeway - the plot tells about the company of paratroopers of Airborne Divisions of the United States, who tried to secure the La Fiere causeway before the arrival of aid to the allies.\n3. Falaise Pocket  - here the plot follows a unit of SS Panzergrenadiers stationed in the town of Trun. In August 1944, after the capture of the allies, Chambois, the army must hold the city and to evacuate the advancing American division and Canadian armoured division.\n\nThe game has a detailed infantry control, as well as the maximum number of soldiers now depends on the number of strategic points with resources (gasoline, ammunition). Also, in the game, there is a time of a day and new maps.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":17158,"name":"PAC-MAN CHAMPIONSHIP EDITION 2","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fa/7fa3e1fbabb9fb5c77525e47fa49e261.jpg","description":"The much-awaited sequel to PAC-MAN™ CHAMPIONSHIP EDITION!<br/>\n<br/>\r\nFeaturing eye-popping 3D graphics and funky visuals, the latest version of the classic game takes chomping and chasing through mazes to a whole new level!<br/>\r\nMake up to four ghost trains for maximum chompage!<br/>\r\nNew modes include Score Attack and an Adventure Mode with fast fleeing fruit, big bad bosses, ridiculous remixed rules, and more!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":58640,"name":"Realm Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/621/62130da33398d23116ac8e61a7b3111a.jpg","description":"Explore a fantasy world in Realm Royale, the new Battle Royale sensation. Are you an Assassin, a Warrior or a Mage? Choose your class, then loot fantastic weapons and magical abilities to create your own Champion. Stay ahead of the deadly fog by mounting up and moving out. Will you be the last Champion standing?\nChoose from one of five classes before every match, each with its own game-changing abilities. Become a Warrior, chug a shielding potion, and leap into battle. Soar through the skies as a Mage, slinging fireballs. Take steady aim as a bow-wielding Hunter. Deploy turrets and shields as an Engineer. Or blink onto a rooftop and snipe your enemies as an Assassin.\nGo traditional with shotguns and snipers, or embrace the fantasy with ice staffs, swords, and crossbows. If you want to win, you’ll need to craft Legendary Weapons at Forges scattered across the Realm. But be careful: While you’re crafting, your enemies may attack.\nJourney through the lush jungle of Jaguar’s Claws and the scorched sands of Goblin Gulch. Visit frigid Everfrost and iridescent Fungal Forest. The best part: you don’t have to walk around this massive Realm. Just summon your mount to outrun the fog and ride into your next glorious battle!\nCall your friends: It’s time to squad up. Realm Royale is the first Battle Royale designed to be played in four-person Squads. Help your team by dropping a Healing Totem, or plant a Sensor Drone to reveal incoming enemies. Each class has strengths and weaknesses, but by working together the crown royale could be yours.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Hi-Rez Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9736,"name":"Slime Rancher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43f/43f4f3a50651f371c147ecce8ee841a9.jpg","description":"In the far-distant future, far, far away in space (to be exact, a thousand light-years from the Earth), on the planet Far, Far Range, mega-corporations (they, it turns out, will be with us in the distant future!) discovered the ideal source of income, universal natural resource - Plort.\n\nYou can produce almost anything from Plot - from food and household chemicals, to solid alloys and incredibly powerful batteries.\n\nPlort is a concentrated mucus produced by slimes - jelly-like living organisms of various species and characteristics.\n\nSlimes, unfortunately, can not be taken to Earth to breed and receive the right amount of Plort. We have to fly to 'Far, Far Range', to build there something like a ranch for slimes and for all this to hire earthlings. One of these earthlings, the space rancheros, the brave young girl Beatrix LeBeau is the character of the game. The girl (and the player) will fly a thousand light-years in a deep sleep to equip a ranch from a Hobson Twillgers, study the planet's environment, collect, feed and breed slimes.\n\nTo get the necessary hints the girl can look for notes of the former owner - they meet on the territory of the ranch, and also communicate via Star Mail with a close friend from the Earth. In conversations with a friend, we learn a lot of things about the former, earthly life of the heroine - this information will be important.\n\n###Gameplay and economics\nSlimes need to be fed, and this is important. The rest they will do themselves.\nIt is necessary to feed them not by anything, but by appropriate products. But slimes will produce a lot of Plort - and Plort can be sold on the market, having received currency - newbucks. For newbucks you can buy equipment for ranches and so on. The world of the game is not known until the end, it is possible and necessary to travel through it, opening up new locations, finding new slimes for the ranch, as well as food for slimes and other new resources.\n\nFrom different types of slimes you can get hybrids. However, with this you need to be more careful - you can get aggressive evil slimes, which will have to be dissolved with water.\n\nSlimes are quite diverse. Ordinary slimes are generally friendly, but they can be dangerous not because of evil will, but because of some natural features like thorns, emitted radiation or the ability to explode.\n\nSome slimes are more productive than others, they produce more Plort. It is these slimes that are created by hybridization, since it is difficult to find them in a natural environment.\n\nOrdinary slimes sometimes merge into a huge Gordo-slime - inside such organisms there are often valuable resources and other interesting and useful things. To get all this, you need to blow up the Gordo-slime.\n\n###Game modes\nAdventure. The world is open for research, there are no serious restrictions. You can develop as you want. You can communicate with other ranchers, carry out their assignments and exchange resources with them. \n\nCarefree is an adventure mode that goes even easier.\n\nThe five-day trial is a mode in which you need to earn as many newbucks as possible in 5 days.\n\n\"The steel master of the ranch\" - the conditions in this mode are so complicated that it resembles a game of survival. In the mode there are unique tests that change the impression of the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Monomi Park","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":12757,"name":"Warhammer 40,000: Dawn of War II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d9/4d9afae02fdf2896569b1c7bfeabb8c1.jpg","description":"Warhammer 40,000: Dawn of War 2 is a tactical RPG in the science-fictional setting. The sequel to Warhammer 40,000: Dawn of War, the game follows its tendency to simplify strategy aspect and focus on battles. So, base building is removed; instead, you can explore locations and kill various monsters. \nThe game's story places you in the middle of the war on the desert planet Calderis. While helping another group, your Space Marines squad is attacked by Orks. This battle starts a whole string of missions, which the campaign mode consists of. The plot had several endings; unlike in previous games, here you need to pick units up before the fight and can't change them later. \nDawn of War 2 extends the series’ role-play features. You can choose from four races and form armies of six different squads. Every race and squad has its own characteristic. The game also places a heavier focus on weapons and cover with improved physics, additionally making the experience more realistic in a way fights between huge mechs can be.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12662,"name":"LEGO Star Wars - The Complete Saga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf3/cf39c637f18800b6d3f65d640a8ebbaa.jpg","description":"Lego Star Wars: The Video Game is an action-adventure game based on Star Wars set of Lego constructors. This is the first installment in the Lego Star Wars video game series.  \n \n###Plot and art style \nThe game uses characters from the movie series and loosely retells the story of episodes I-III. It consists of several chapters each recreates a certain part of the movie.  \nAside from terrain, backgrounds and special effects, all of the in-game objects consist of Lego pieces thus the name.  \n\n###Gameplay \nIn each level, you play as a group of characters from the movie and have to complete a specific task. You control only one character at a time while AI commands your teammates, but you can instantly switch between them.\nThe game also supports multiplayer for two with drop-in/drop-out system so the second player can join you without going back to the main menu. The gameplay mostly consists of solving puzzles, exploring environments for secrets and fighting enemies and bosses. There are many characters to unlock as well as other collectibles. Different characters have different abilities and weapons the can be used in combat, puzzle-solving or accessing previously closed parts of the map. There is no game over in Lego Star Wars. Running out of lives makes you lose some in-game currency/points before instantly respawn.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":61176,"name":"Bloodstained: Ritual of the Night","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/26c/26cacc55399ed6b2c14e20d2eca0620a.jpg","description":"Bloodstained is an exploration-focused, side-scroller action RPG packing all of the best features you've come to know and love from the Metroidvania genre into a single, content-packed game.\nPlay as Miriam, an orphan scarred by an alchemist’s curse which slowly crystallizes her body. In order to save herself, and indeed, all of humanity, she must battle her way through a demon-infested castle summoned by Gebel, her old friend whose body and mind has become more crystal than flesh.\nWHAT'S IN THE GAME?\n- Addictingly tight and satisfying gameplay alongside a rich new story in the gothic dark fantasy style of Koji Igarashi, the celebrated godfather of \"Igavania\" games.\n- A game soundtrack by genre and industry veteran Michiru Yamane, performed by a full live orchestra ensemble.\n- Story cut scenes and NPC interactions fully voice acted by a star-studded cast, including actors like David Hayter, Ray Chase and Erica Lindbeck to name just a few. (Seriously, we have a lot of voice acting star power in this game, it's kinda nuts...)\n- A total of three playable characters, two of which have yet to be revealed...\n- Literally a metric ton of weapons and spells, which you can upgrade, level up and visually customize.\n- Beautiful 2.5D graphics: 3D models crafted with a lot of love and care on a 2D game environment. That means lots of cool tricks that \"regular\" 2D can't do...\nWHEN?\nWe're going to be revealing the release window of the game very soon.\nTHE FUTURE\nExpect a worryingly large amount of announcements and updates, everything from updating the look of this Steam page to the game in general. It's going to be one wild ride.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]}]